{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2241403",
      "video": false,
      "title": "Outpost: Rise of the Spetsnaz",
      "recommendations": [
         100183,
         252189,
         46202,
         23281,
         44811,
         332278,
         325827,
         278706,
         185755,
         322061,
         14642,
         68212,
         90164,
         233734,
         251733,
         30385,
         126962,
         85646,
         21800,
         58250
      ],
      "backdrop_path": "/iHpOtA2C3erMMQQbJZRhQnptAGM.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "andrew taylor-smith",
         "id": "51c82a7e760ee36f071d3722",
         "content": "The popular Outpost franchise gets third outing with a prequel,   OUTPOST : Rise of the Spetsnaz, an origins story rooted in the aftermath of WW2.\r\nAfter the short prologue, we join a Russian unit (The Elite Special Forces known as the Spetsnaz) whilst on a stakeout mission for Nazi blood. They’re a rag tag bunch; disguised in part by the garments of fallen Nazis - sporting their wardrobe and Nazi insignia.\r\nThey makes easy work of the first wave of unsuspecting Germans, but just as their leader discovers some sinister  paraphernalia,  they are out gunned by a backup fleet sporting more hardware that sends them fleeing to the forest. Their leader, one Dolokhov is captured and taken to the experiment chamber of an underground bunker where the origins of this action packet saga come to light. Followers or the previous two films will appreciate the attention to detail that director Kieran Parker and Rae Brunton have cultivated here. It’s subtle enough not to indulge one too much in what we’ve already come to like about the series. Several characters emerge in numerous Zombie guises recognisable in the labyrinth of shudder-some  corridors.\r\nIt’s not long before the unit are pitted against the sinister and barbaric regime  orchestrating their evil deeds and using them as test subjects for something far more inhuman and sinister.\r\nWhat transpires is most action packet of the series so far. It’s littered with a high body count and some well executed fight sequences. There are also great moments of tension and some dry humour thrown in too. There’s even space for the occasional Russian proverb  -  Trouble never comes alone…\r\nIt’s not without its less shining moments. The ending, although brutal came about too quickly and easily. A potentially life-saving amount of weaponry would have helped our assailants to safety was never used. They dispose of the Nazi’s with mere  firepower and some combat when there was an entire army at the Reich’s disposal. This spoiled it for me. That said it is not a dull film, not in the slightest. It just had too much action and not enough danger placed on the surviving Russians.\r\nThis marks Kieran Parker’s directorial debut after story writing and producing the previous two films, Outpost and Outpost : Black sun. It’s a commendable turn, particularly in the action sequences. The central performances are strong too. Bryan Larkin’s  Dolokhov has huge presence , his seemingly imperious demeanour showing signs of cracking under the terrors. He’s hulking, stoic and commanding.  Meanwhile  Michael McKell’s  sneering  Strasser, the unhinged Nazi overlord is brimming with  a measure of the sadist and eccentric. \r\nIt leaves it open for a sequel. Some may welcome it but will the zombies rise again or has it been a good series needing to resign from the Outpost?",
         "url": "https://www.themoviedb.org/review/51c82a7e760ee36f071d3722"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Arkadi",
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822ff09",
               "name": "Velibor Topic",
               "profile_path": "/yWqta1oCZfFC0ihBSApmN3CloLg.jpg",
               "id": 34515,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Fyodor",
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822ff0d",
               "name": "Iván Kamarás",
               "profile_path": "/cvfG57ICJjm7RM9Xco4kxxgcvvr.jpg",
               "id": 145812,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dolokhov",
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822ff11",
               "name": "Bryan Larkin",
               "profile_path": "/oVqPGi5bJWs2F95HdlhRUfzekhl.jpg",
               "id": 567086,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Strasser",
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822ff15",
               "name": "Michael McKell",
               "profile_path": "/wHhicLI7CvdYwmD4JmrRWvHJqEG.jpg",
               "id": 136040,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c78c3a36847f822ff1b",
               "name": "Kieran Parker",
               "profile_path": null,
               "id": 56628,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c78c3a36847f822ff21",
               "name": "Rae Brunton",
               "profile_path": null,
               "id": 56636,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.728049,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 164377,
      "vote_count": 17,
      "budget": 0,
      "overview": "In the third installment of the hit Nazi Zombie action horror movie, Outpost: Rise Of The Spetnaz, we discover the horrifying origins of these supernatural soldiers and see them in ferocious gladiatorial battle against the most ruthless and notorious of all military special forces: the Russian Spetsnaz.",
      "similar": [],
      "original_title": "Outpost: Rise of the Spetsnaz",
      "runtime": 87,
      "poster_path": "/6YB21yqofhomL98iSZxpOuCbf3E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Black Camel Pictures",
         "id": 12977,
         "origin_country": ""
      }],
      "release_date": "2013-06-26",
      "vote_average": 5,
      "belongs_to_collection": {
         "backdrop_path": "/7glOZjnZWYYcr67pvz3mSIYIBOC.jpg",
         "name": "Outpost Collection",
         "id": 108804,
         "poster_path": "/xiAWTgzyb1TxW8kN05qiVKNJFxb.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kieran Parker"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Rae Brunton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2241403/",
      "coverLink": null,
      "actors": [
         "Bryan Larkin",
         "Iván Kamarás",
         "Velibor Topic"
      ],
      "reviews": [
         "OK, so lets talk about this series a little: Outpost: loved it! Black sun: So-so; Rise of Spetsnaz: not your average zombie movie. Part three was better than two, at least in my opinion. Sure, the beginning is slow, cause there is a German general who talks for like 20 minutes into the movie and he gets quite annoying at times. But luckily for us they shut him up and let the action roll. The movie is violent, quite gorish, not for them stomach weak people, some much loved kill shots, very few moments when the characters act dumb, as they usually do in horrors, so overall, an entertaining movie. It's dark, it's sinister, well the main character puts it best: \"f*cking crazy Nazis!\" So, let me tell you, if you're a fan of them first 2 parts, you gonna love this. Jut bare in mind, try to get over the first 25 minutes, they kinda suck, but after those dull moments, you'll get plenty of blood, action, zombies and death! 2013 is a good year for parts 3 apparently, both Hatched 3 and Outpost managed to stand quite tall for number 2 sequels. So, there is hope after all, who knows what we're going to be looking in next, important thing is: I'm dying to see more!!",
         "The original Outpost (2007) spawned a new era full of Nazi zombie flicks let be so far Dead Snow (2009) be the best one. I was never really into the Outpost franchise and the second entry Outpost Black Sun (2012) was for me almost a reason to leave the franchise. But seen the trailer of this prequel I thought that it could deliver something new. Kieran Parker makes his directorial debut here but he of course new the stuff because he was producer and even story writer of the franchise so far. So we go back in time but still the Nazi's are mixing elements of the supernatural and the techniques of the day to create a new super soldier. But this time they are hunted down by the red army. But things go wrong and some Russians are being captured for experiment. From there on we meet the typical zombies again. It isn't that gory at all although it has some bloody shots here and there. This time it's more of an escape from prison flick. But it do deliver for the fans of the Nazi zombie genre. The acting was rather good this time especially by Bryan Larkin (Dolokhov) and Michael McKell (Strasser) but the grey overtone in the colours doesn't add to the viewing. By making the zombies some kind of super soldiers it also of course will make horror buffs move away from the Outpost franchise. You can easily watch it as a stand alone a thing you couldn't do with the boring Black Sun. I'm more looking forward to the next installment of Dead Snow then Outpost. Not that it was bad but I'm missing something. Gore 1/5 Nudity 0/5 Effects 3/5 Story 3/5 Comedy 0/5",
         "Honestly, don't know why it got 4.2 in my opinion the movie at least deserves 5.0-6.0 yes it is a cheesy sci-fi plot, but I think it is well executed. The thing I love about Outpost movies is the atmosphere and even though I think that the film took an odd turn by going back to WW2 to have an origin story it was still well done. But we can all see that the budget of the movie isn't completely as good as the first Outpost. The acting is decent and the action is good. Plot and the story maybe little bit too cheesy, but it's a Nazi zombie sci-fi flick so what do you expect? god father? I'm actually surprised with the stern treatment Outpost movies receive. Not to mention when people call ''Dead Snow'' good it's just eerie. Even Frankenstein's army has 5.0 than this considering the fact that it is not as good. War of the dead has 4.0 even though it's not an awful disaster. This one actually had some cameos and references from the previous films including the Beethoven song that starts randomly playing once in a while in all three films (very good touch in my opinion) as far as I am concerned the movie is definitely a 5.0 - 6.0/10. It wouldn't hurt to let the logic fly out and enjoy a cheesy flick that can grant you certain entertainment. IMDb and Rotten Tomatoes logic: if it's not a masterpiece, it's bad. Even though IMDb is a saint compared to Rotten Tomatoes. Hopefully, when more people vote it'll at least get the rating of 5.0",
         "The Outpost series of films is Movie-Marmite. It's about undead zombie Nazi's, which means you either love films like this or you don't. But if you love that crazy yet serious tone of early John Carpenter pics, or enjoy the balls-out wartime action of Where Eagles Dare, then you're going to have a blast with this film In Rise of the Spetsnaz, a bunch of Russian special forces in WWII ambush a Nazi convoy and discover a secret base. They're captured, locked up and must escape, especially once they discover the Nazi's plan to experiment on them. The origin story is simple, straight forward and told very well. Unlike the first Outpost, or the sequel, their are no ghost-zombies or extraneous sci-fi devices to absorb because the Nazis in 'Spetsnaz' haven't invented it yet. The more outrageous quantum-physics tech used in the other movies is still a future dream of the Nazis and is what they're striving to create; so rather than this being a man against science/supernatural film, it's more a balls-to-the-wall WWII action thriller. Like the other films, the actors and film makers are taking this all deadly seriously. The acting (especially for this kind of film) is superb. Bryan Larkin channels Gerard Buttler and looks like a major action hero in waiting whilst uber-Nazi Michael McKell has the gravitas of the best Bond villains. All in all, Rise of the Spetsnaz is the best popcorn actioner I've seen in a long time. It's great fun, suspenseful and the most accessible installment to the Outpost universe.",
         "I like science fiction, horror, thriller, I dislike bad science fiction, horror, thriller - and I hate being cheated by reviews and hype. I bought Outpost III having read some good reviews. Hopefully this review will stop you making the same mistake. I should have learned my lesson with Outpost I, low budget, bad script, bad acting, bad direction. I skipped Outpost II and tripped up on III. The review I read said that it was a definite boost to the franchise, fine acting, fine camera work, script, etc., etc. In my opinion all of those do not apply. Imagine Outpost I and effectively you have Outpost III. This is lazy film-making. When a Nazi quotes Shakespeare expect the worst and you will not be disappointed. When someone says Bryan Larkin puts in a fine performance ask - in which scene? When Nazi soldiers attack like retards and start filling up the corridors with their stupid dead bodies and you think - is this it, is this the movie? Answer yes and find something else to do. I am generous giving this 3 stars out of 10.",
         "I just rewatched the first one and the second one but had never heard about this one so I decided to watch it. While the first movie is a decent low budget horror movie, the second one is an action/horror movie and this one. This one is a pure russian wank fantasy that has nothing to do with the first movies. So if you enjoyed the first one and kinda liked the second one but wanted more? Well this movie contains nothing about what you liked from the first two, so just ignore this one. If they had called this movie just Rise of the Spetsnaz instead of Outpost and removed the whole \"zombie\" element it might have been a decent low budget war movie. But as it stands I'm judging the movie as a trilogy and as such it's an awful one.",
         "I would like this one if it was not the 3rd of it's line. I would like this one if it was not simply the end of an almost endless loop that they can mess with when ever they want to go back, and make a cheap movie. I would like this one if it was a stand alone story. I don't like Outpost 1, or 2. The first 2 movies tried really hard, but were too dark, and working on such small budgets that you could only expect what you got. They were not all that great though, the first being just a retelling of the old Zombie bunker unsealed after 50 + years, and the second one tried to take that one further even though the original team had pretty much ended it. So now we have the 3rd of this series which if it were on it's own merits would be an alright late 90's early 00's army movie with too much back story, and narration, so it is too bad those first two movies ever happened. Though as is more the case than would be expected these days you would not have this half decent pile of crap if it had not been for the fully steaming piles that proceeded it, and have still not gone back up. If you have watched the first 2 then this movie will be as fun to you as Lobsterman from Mars once was, otherwise pass on by this film.",
         "The first 'Outpost' film was a classic (well... a classic in the B-movie horror genre). However, the second part was totally unnecessary and not even worth trying to watch. Here we have the third instalment of the franchise. And it's a prequel/origins movie. But don't worry if you haven't seen parts 1 or 2. It also works as a stand-alone affair. It's set in 1944 on the 'Eastern Front' where Russian commandos are raiding German bases. While doing so, they only go and discover that those dastardly Nazis are trying to resurrect the dead and turn them into 'super soldiers.' Naturally, the Nazis don't plan on letting this little secret get out and capture our Vodka-swigging heroes, leaving them to escape from the undead-ridden facility. Okay, so the plot isn't going to blow your mind, but then the film isn't either. It's average. There's not much else to say, but, if you need reasons, I'll mention that the you won't care too much for the characters. The Russian heroes are tough, grunting macho men with no real depth, therefore you can hardly really relate to them. The Nazi commander of the base is a little too campy for the role. It's a gritty and serious film and he comes across like a cackling Bond villain. Nothing much happens in the first twenty-five minutes, but, if you stick with it, at least you're rewarded with some violence and zombie-killing fun. Its strengths are that it's suitably violent and well-shot so as to make the most of the bleak and gloomy setting. And it's not that long either, so, once the twenty-five minutes are over, it moves swiftly for the rest of the duration. But, ultimately, it's nothing new. And that's its major flaw. You've probably seen plenty of zombie movies. And many of them are better. Therefore, do you really need to watch another one? If you think the 'Nazi element' may make it different, just stick to Outpost (1) which is head and shoulders more fun than this. Or, if you can put up with subtitles and a lighter tone, try Dead Snow for a really gory and light-hearted approach to killing dead Nazis. Outpost 3 is just too little too late. You probably won't hate it, but you probably won't remember it by this time next week. http://thewrongtreemoviereviews.blogspot.co.uk/",
         "Greetings from Lithuania. \"Outpost: Rise of the Spetsnaz\" (2013) is just what you might expect and nothing more. It gives you exactly what it promises - a gory blood fest with some zombies and specnaz. That's it. Acting is OK for this material, just didn't understood why these zombies always entered to fight like they were professional wrestlers. And how did American, Russian and German communicated? In what language would have they speak and perfectly understand each other? But you don't ask questions like these in a movie called \"Outpost: Rise of the Spetsnaz\" - you just go with it. Overall, if you a hard fan of the first part (which in my opinion was very cool low-budget B horror / sci-fi / action flick), you might actually enjoy a bit of this installment, and if you have a very boring evening, this flick can do the justice for one time.",
         "This was marketed as the \"origin\" prequel to the premise outlined in the first two films. Personally it serves very well as both prequel and a stand alone WW2 action horror in its own right. I have the Dutch blu ray and the film is gory and violent as befits the subject, if your for this film you know what to expect! The lead actor is excellent as Dholokov leading his \"Russian dogs\" as Klassner puts it, the film has several stand out scenes bookended by a very familiar old Russian man! The colour palette has a muted look to enhance atmosphere and the Nazi testing bed for the zombie super soldier is very well realised. Best kill in the film is Dholokov and the Nazi radio operator very well done. Try to rent this film excellent unrelenting authentic violence and action you certainly feel and realise that the Rusdians were perhaps the toughest soldiers of all.",
         "I guess there were a lot of Outposts back in World War 2! Obviously this is not based on a \"true story\" or whatever. Even if the Nazis where famous for experimenting on people, this is (as the previous installments) just an exaggeration of what is known to people. For entertainment purposes, this is solid. Not really great (there have been way better zombie movies), but not bad either. We get a new story with a new villain, which means you don't really have to be aware of the other \"Outpost\" (movies). You have to dig those movies otherwise don't even rent it. Even if you are into Horror action movies, this doesn't mean you'll like this, especially because it's mostly dry (a bit more humor would've helped)."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Black Camel Pictures",
         "Savalas Film"
      ],
      "summaries": ["In this third installment of the hit Nazi Zombie action horror movie, Outpost: Rise Of The Spetnaz, we discover the horrifying origins of these supernatural soldiers and see them in ferocious gladiatorial battle against the most ruthless and notorious of all military special forces: the Russian Spetsnaz."],
      "budget": 0
   },
   "movielensId": 171817,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-06-26",
      "dvdReleaseDate": null,
      "directors": ["Kieran Parker"],
      "runtime": 87,
      "movieId": 171817,
      "title": "Outpost: Rise of the Spetsnaz",
      "mpaa": null,
      "actors": [
         "Velibor Topic",
         "Iván Kamarás",
         "Bryan Larkin",
         "Michael McKell"
      ],
      "imdbMovieId": "2241403",
      "originalTitle": "Outpost: Rise of the Spetsnaz",
      "genres": [
         "Action",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["SL-ZOGhzFas"],
      "plotSummary": "In the third installment of the hit Nazi Zombie action horror movie, Outpost: Rise Of The Spetnaz, we discover the horrifying origins of these supernatural soldiers and see them in ferocious gladiatorial battle against the most ruthless and notorious of all military special forces: the Russian Spetsnaz.",
      "tmdbMovieId": 164377,
      "avgRating": 3.5,
      "releaseYear": "2013",
      "numRatings": 7,
      "posterPath": "/6YB21yqofhomL98iSZxpOuCbf3E.jpg"
   }
}