{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "comedy",
            "id": 10267
         },
         {
            "name": "erotic movie",
            "id": 190370
         }
      ],
      "imdb_id": "tt1365048",
      "video": false,
      "title": "3-D Sex and Zen: Extreme Ecstasy",
      "recommendations": [
         150146,
         41923,
         138976,
         76321,
         82479,
         82760,
         45491,
         70628,
         35726,
         31605,
         95177,
         264959,
         103970,
         70634,
         73941,
         291163,
         88006,
         75759,
         15203,
         60029
      ],
      "backdrop_path": "/xHsqBcDy5VvV4MuI974HuIoRRQc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1005,
               "character": "Ruizhu",
               "gender": 1,
               "credit_id": "52fe4760c3a368484e0c3b43",
               "name": "Saori Hara",
               "profile_path": "/cLm0XcEAxTKcEVX3k9gmDLflf7y.jpg",
               "id": 122158,
               "order": 0
            },
            {
               "cast_id": 1008,
               "character": "Dongmei",
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b4b",
               "name": "Yukiko Suo",
               "profile_path": "/cBOfY0v9nB0jBR5WqZUr0GCJoq2.jpg",
               "id": 548487,
               "order": 1
            },
            {
               "cast_id": 1012,
               "character": "Prince of Ning",
               "gender": 0,
               "credit_id": "57265172c3a3685871000634",
               "name": "Tony Ho Wah-Chiu",
               "profile_path": "/3QO0ZJEsEg1U5LZQhzvx0m8Jpya.jpg",
               "id": 586484,
               "order": 2
            },
            {
               "cast_id": 1011,
               "character": "The Elder of Bliss",
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b57",
               "name": "Vonnie Lui",
               "profile_path": "/lMYwvyq3xzbRrdMvzdzlzC83MPa.jpg",
               "id": 1163353,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Tie Yuxiang",
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b47",
               "name": "Lan Yan",
               "profile_path": "/qAl4pPnu9pZ5wTxGiIpHyXPy59k.jpg",
               "id": 548485,
               "order": 4
            },
            {
               "cast_id": 1010,
               "character": "Wei Yangsheng",
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b53",
               "name": "Hiro Hayama",
               "profile_path": "/3KOFiv9bExx0cjuC7OBd6AnakvJ.jpg",
               "id": 1039927,
               "order": 5
            },
            {
               "cast_id": 1013,
               "character": "Maid Xian Lan",
               "gender": 0,
               "credit_id": "572651b19251411e9f004001",
               "name": "Carina Chan",
               "profile_path": null,
               "id": 1613813,
               "order": 6
            },
            {
               "cast_id": 1014,
               "character": "Scholar Shun Shang Guang",
               "gender": 0,
               "credit_id": "572651e59251417744003a2f",
               "name": "Jason Yiu",
               "profile_path": null,
               "id": 1613814,
               "order": 7
            },
            {
               "cast_id": 1015,
               "character": "Mr Lam",
               "gender": 0,
               "credit_id": "5726527d9251417782003973",
               "name": "Justin Cheung Kin-Seng",
               "profile_path": null,
               "id": 1172982,
               "order": 8
            },
            {
               "cast_id": 1016,
               "character": "Dique",
               "gender": 0,
               "credit_id": "5726528692514119ed0062d0",
               "name": "Tenky Tin Kai-Man",
               "profile_path": "/lCcreZ88cFxhUgw0O7bVwdZc0zY.jpg",
               "id": 1136808,
               "order": 9
            },
            {
               "cast_id": 1017,
               "character": "Quan Laoshi",
               "gender": 0,
               "credit_id": "5726528f9251417782003977",
               "name": "Kirt Kishita",
               "profile_path": null,
               "id": 1169040,
               "order": 10
            },
            {
               "cast_id": 1018,
               "character": "Tiancan",
               "gender": 0,
               "credit_id": "57265298925141778200397c",
               "name": "Mark Wu Yiu-Fai",
               "profile_path": null,
               "id": 1613815,
               "order": 11
            },
            {
               "cast_id": 1019,
               "character": "Page",
               "gender": 0,
               "credit_id": "572652a5c3a36851e50007c2",
               "name": "Cliff Chan",
               "profile_path": null,
               "id": 1613817,
               "order": 12
            },
            {
               "cast_id": 1020,
               "character": "Monk Budai",
               "gender": 0,
               "credit_id": "572652fac3a368305a005581",
               "name": "Wong Shu-Tong",
               "profile_path": "/r5kyvIM6fWaVTvujA0twkUx3ln9.jpg",
               "id": 1139658,
               "order": 13
            },
            {
               "cast_id": 1021,
               "character": "Mayor",
               "gender": 0,
               "credit_id": "57265303c3a3685871000675",
               "name": "Lawrence Lau Sek-Yin",
               "profile_path": null,
               "id": 1319988,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b2d",
               "name": "Christopher Sun",
               "profile_path": null,
               "id": 548481,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b33",
               "name": "Stephen Shiu",
               "profile_path": null,
               "id": 548482,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b39",
               "name": "Stephen Shiu Jr.",
               "profile_path": null,
               "id": 548483,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "52fe4760c3a368484e0c3b3f",
               "name": "Mark Wu",
               "profile_path": null,
               "id": 111294,
               "department": "Writing",
               "job": "Screenstory"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 17.643012,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 67308,
      "vote_count": 20,
      "budget": 0,
      "overview": "The story is loosely based on a 17th century erotic Chinese story named The Carnal Prayer Mat and follows a young scholar named Yangsheng who gets married to the beautiful daughter of a local merchant. When their sex life proves unsatisfactory, Yangsheng leaves home and journeys to the Pavilion of Ultimate Bliss.",
      "similar": [
         28468,
         86331,
         80752,
         341174,
         226,
         134764,
         435126,
         27066,
         24402,
         1278,
         88,
         979,
         10530,
         703,
         27,
         4995,
         50620,
         51828,
         112160,
         81774
      ],
      "original_title": "3D肉蒲團之極樂寶鑑",
      "runtime": 118,
      "poster_path": "/dEb0Kb0xmUuHmO1Dk4WKHuaw5Cw.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "One Dollar Production Limited",
            "id": 7688,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Local Production",
            "id": 7689,
            "origin_country": ""
         }
      ],
      "release_date": "2011-04-14",
      "vote_average": 4.4,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Sex and Zen Collection",
         "id": 395591,
         "poster_path": "/sFrLDqUMDt3QaBhqWe7b98hOfmv.jpg"
      },
      "tagline": "3-D Sex and Zen: Extreme Ecstasy",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christopher Lap-Key Sun"],
      "runtime": 129,
      "synopsis": null,
      "writers": [
         "Stephen Shiu",
         "Mark Wu"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt1365048/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTgzMTgyNDI0OF5BMl5BanBnXkFtZTcwMjkzNzExNg@@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Hiro Hayama",
         "Leni Lan Crazybarby",
         "Miyavi Matsunoi"
      ],
      "reviews": [
         "The film is promoted as the first 3D porn to attract viewers, it is no doubt a very smart way of making $$ for the movie company, but I think those who pay to watch the film should totally readjust the mindset going into this film. If you are expecting lots of sex scenes and expecting inappropriate things flying 3D in your face, you are asking for too much. When I bought the ticket to watch this film, I totally expected this to be a nonsense comedy that doesn't really make much sense. When you take that approach I think this film is way more enjoyable. I find it quite entertaining and laughable at some scenes (so are fellow viewers, who couldn't stop laughing at some scenes), and even though a little cheesy, there is a theme into it. Thing I give big thumbs up are the costumes and props, it makes me realize the producer is taking this film very seriously instead of just a low budget stupid movie. The musical department also deserves lots of credit as the sex scenes are quite steamy because of the background music they use. Again, this is NOT an artistic film, just take it as a bubble gum film that makes you laugh for 2 hours.",
         "A 3D sex movie, especially one produced in Hong Kong and especially one with a pedigree such as the Sex and Zen movies from the 1990s, should be a lot of fairly harmless fun. There should be plenty of double entendres (and single entendres!), plenty of bosoms heaving out across the audience, and a plot that is as uncomplicated as the sexual positions are complicated. For the most part, '3D Sex & Zen: Extreme Ecstasy' is that film. Extremely handsome boy meets extremely beautiful girl. They make a lot of love, but something's not right. So, the handsome boy goes off to consult various masters in hopes of improving things. That's the first half of the film. Rather unfortunately, the second half turns to violence, sadism, rape and torture, and where five minutes ago one was chuckling about the protagonist declaring \"I must make love to ten women at the same time\", suddenly one is faced with genital mutilation, followed by rape, then more genital mutilation, followed by... Well, you get the idea with that one. I suppose a film has to go in a direction, and a sex film especially, once the thrill of seeing the actors and actresses naked has waned somewhat. It can become increasingly absurd and nihilistic, like many Russ Meyer films; change tack and take in another exploitation genre (such as, ummm, 'Zombie Strippers'?); or go for a message, which more often than not is 'actually, this much sex isn't that good for you' (take 'Austin Powers', if you will). 3D Sex & Zen goes somewhere between all three, and despite being about 20 minutes too long, somehow fails to deliver satisfactorily on any count. The message that it does have is sweet, however, and understandable to people of all nations. And there's something charming about the fact that in Hong Kong, 3D Sex & Zen made more than Avatar on its opening day. Overall, it's worth a watch, perhaps more for what it is than what it says.",
         "Despite the charming cast, 3D Sex & Zen: Extreme Ecstasy is a disappointment which does not live up to its hype. As an erotic movie, it is not as satisfying as a hard-core pornographic movie. As a drama, it has paper-thin and inconsistent characters. That the main character and his wife suddenly miss each other is totally without substance. As a result, it fails to touch some members of the audience and the delivery of the message becomes very weak. On the whole, it is a cult movie mixing pornography, foul language, jokes, romance, gore and action. However, it falls between two stools. You are advised not to take the plot seriously and expect any hard-core images, or you may be disappointed. A similar Korean movie, A Frozen Flower, is highly recommended.",
         "A review of the world's first 3D Chinese-language erotic film, we believe, is simply extraneous- after all, you've probably already decided on this basis alone whether or not you're going to watch this movie (and if you have, we strongly urge you to catch it in 3D). And why not- since besides action and horror, erotica is probably the genre that would clearly benefit from the additional dimension, especially seeing as how we already talk about them boobs very much dimensionally. It makes perfect sense then that producer Stephen Shiu would decide to reboot his infamous Category III- series 'Sex and Zen' for a new audience, the story inspired in part once again by the ancient Chinese text 'The Carnal Prayer Mat'. Of course, story is probably the least of the reasons why their audience has opted to see this film, so Shiu, who co-wrote the screenplay with his son Stephen Shiu Jr and Mark Yu, keeps it simple, in fact perhaps a little too simplistic. The protagonist here is a young Ming Dynasty scholar Wei Yangsheng (Hiro Hayamo) who has just gotten married with the beautiful Tie Yuxiang (Leni Lan). The couple have one problem though- Wei is just not very good in bed, and goes frigid all too quickly. His quest to better their sex life leads him to the Pavilion of Ultimate Bliss, a carnal pleasuredome reigned over by the Prince of Ning (Tony Ho in an effectively hammy performance) living a life of hedonism and unrestrained sexual pleasure. Armed with an excuse, Shiu and director Christopher Sun trot out familiar Japanese AV stars Saori Hara and Yukiko Suo, as well as Hong Kong's very own busty beauty and wet dream fantasy Vonnie Lui. Hara and Suo are among two of the temptresses at the Pavilion, while Lui plays The Elder of Bliss, an androgynous being who looks stunning but speaks with the voice of an old man. If you're a fan of Lui, the bad news is that she doesn't go topless- nevertheless, that disappointment will probably be short-lived seeing Hara and Suo do so for the most part when on screen. Indeed, one can pretty much guess how the rest of the girls were auditioned for this film, but we wouldn't expect less from a film like this. There is a generous amount of nudity in the film, restricted however to boobs, bums and the brief shots of Yangsheng's incompetent penis. Love-making is also copious, and most if not all of the scenes set in the Pavilion have either nudity or love-making or both in the background at least. Sun's film doesn't forget its purpose to titillate, and so at least on a visceral level, you can be assured that you will leave satisfied. While it remains remarkably consistent in the skin department, the film is much less so in its tone. At the start, it adopts the same playful attitude as the original film, with Yangsheng's unaccomplished sex life as well as his desperate attempts to improve his endowment played up for exaggerated laughs. Especially hilarious is Yangsheng's visit to two quack village doctors (one of them played by Stephen Chow regular Tin Kai-Man) for a penis replacement operation, their wordplay and subsequent bungling of the organ utterly ridiculous but also side- splittingly funny. Things however take a much darker tone when Yangsheng's devastated wife gets raped and both Prince Ning as well as Yangsheng's buddy Lin (Tenky Tin) reveal a nasty conspiracy to teach him a lesson for his arrogant ways. Depictions of rape and sexual violence are already toned down in the 'international version' that we are getting here in Singapore, but these later scenes, especially an extended climax which plays out like torture porn, will quite likely discomfort some audiences. Sun plays these up supposedly to strengthen the moral at the end about love and fidelity, but one wishes that he had exercised more restraint. Restraint is also in short shrift when it comes to the use of 3D as a gimmick, and the additional dimension is primarily used in the film's action scenes to hurl some weapon or another at the audience. Granted that the film industry in Asia is just waking up to the possibilities of 3D, therefore such gimmicks are probably to be expected while the technology is still being experimented. The stereoscopy also does enhance the curves and depth of the nude female cast, but these effects tend to be much subtler. But of course, gimmick though it may be, there's no denying that it does work after all to add to the luridness. 'Sex and Zen' was never meant to be high art in the first place, offering visceral pleasures in a rambunctious way. There will be those who will criticise it for objectifying the female sex (which any soft-core porn film is certainly guilty of to some extent), but then they are probably not the audience this film is meant for. For everyone else keen to savour in the display of flesh, this is just the carnal pleasure you'll get. www.moviexclusive.com",
         "Apparently this did beat Avatar at the Chinese Box Office, so they can't have been that wrong now, can they? Of course \"Sex and Zen\" seems to be a popular movie series in general in Chinese movie history. Though I haven't seen any other of those movies (this actually played at the Fantasy Filmfest), I can't tell you if it's true that they took the \"best bits\" from previous movies and put them together here. What I can tell you though, is that this should be taken for what it is: a strange little erotic comedy. If you can wrap your head around that, there are quite a few OTT moments to \"enjoy\" here. Until the end of the movie, they never cease to come up with something even more ridiculous than what they've shown you before. Again just don't take it seriously and have a hoot (whole cinema was laughing) and don't mind the \"message\" at the end of the movie (though it is kind of a nice touch ... no pun intended).",
         "3D SEX AND ZEN: EXTREME ECSTASY. It's difficult to know what to make of a film with a title like that. It's just so, well, in your face...as are the 3D effects in this film. 3D is showcased throughout, and it comes in the form of some very, very poor CGI. CGI penises, CGI gore effects, they're all presence and correct here and all very silly and fake-looking, but I guess that's part of the charm. The meandering storyline involves a spoilt young man who marries a beautiful woman but fails to satisfy her in the bedroom. Frustrated, he falls in with an evil brothel keeper who arranges for him to have a penis transplant. Madness ensues, in a plot incorporating transgender villains, rape, sexual torture, and a military coup. None of it makes much sense, and the acting is very poor indeed, apart from the chief villain who looks like he stepped in from an old Five Venoms movie. What 3D SEX AND ZEN does offer is an endless array of sex scenes, almost all of them involving topless nudity. The actresses are certainly game for a laugh, but it's difficult to identify just what sort of film the producers were trying to make. As a comedy it works in places but the proliferation of rape stuff in the second half makes it hard to stomach, and as a serious drama the character motivations are laughable. It's an oddity all right.",
         "Yes our first 3D sex film, and we are sold a bit short, as it cuts back on you know, sex, nudity, but with some added sick violence. It's not really how this especial one should of been intended, but I disregard the violence in this remark. If you haven't seen this in 3D, being the experts, you'll spot the moments. You would get more out of it, seeing this in 3D. I was outnumbered in the Palace Ezi Max Cinema, a vast one. April 19th, 2011. I couldn't believe it. I was thinking 'If only I had my non Asian friend with me\". I'm the only Aussie in this packed cinema of Asian folk. Some brought in some wine, to mark this auspicious occasion. There have been three other Sex and Zen films prior, all coming out consecutively in the mid nineties on. So this one is refreshing, but it had me so thinking this stories similar to the others, but really this sex flick, takes away from the story, when you have luscious stark lovelies engrossed in intercourse or sex acts where some bouncing boobs are coming at you. There are some memorable scenes: not so, that gigantic squashed c..k that really looks like a c..k, (a scary thing) the couple of scenes and dialogue following this, hilarious, the funniest in this flick. There are our lead couple I think, having intercourse on a giant curved, stone statue'd c..k (yeah really) and maggots foot disease, some great towering shots of a fortress, and 45 degrees slicing and dicing (great in 3D). The last scene, the most potent, beautiful too, thus bring disappointment as the end credits start to roll. These out there films, and I'm not just talking the Sex And Zen series, too me are just films to get off, where we do neglect the story that goes into it. With these Sex An Zen films, we really have to pay attention to the story as we get lost or deviate from, as these colorful, stark and nubile beauties are in our faces, visually pleasuring us with their goodies. That she male kind of put a damper on it too. At the end of the night it the sameo, some visuals staying in your mind, without giving a second thought to the story. But is the movie good? No.",
         "Long before 3D Sex and Zen: Extreme Ecstasy begins the filming, it has drawn the media's attention for being Hong Kong's first 3D pornography feature. While South Korea comes out with Natali 3D (2010) before 3D Sex and Zen goes on a general release in April 2011, 3D Sex and Zen has proved to give audience the better deal. First time director Christopher Sun has created a sensation when 3D Sex and Zen opens in cinemas. The 3D erotica could have been better, but nonetheless it is a good try. Loosely based on Qing Dyansty's erotic literature, The Carnal Prayer Mat, together with partial adaptation from Sex and Zen 1991 (featuring Amy Yip, Hong Kong's famous sex bomb in the 1990's taking the leading role), 3D Sex and Zen offers a story of eroticism with morality, in which both areas could have strike a better balance. The story begins with Wei Yangsheng (Hiro Hayama), a scholar who believes that life is full of pleasure. He marries Tie Yuxiang (Lan Yan), the beautiful daughter of Tie Fei, the Taoist priest. However, as Tie Yuxiang knew nothing about sex life, Wei Yangsheng finds his marriage a dull and boring commitment. Upon introduction from a good friend, he was invited to Prince Ning's Chamber of Pleasure, in which he was introduced to two beauties: Rui Zhu (Saori Hara), a highly skilled courtesan in methods of pleasure; Dong Mei (Yukiko Suo), who gains only pleasure thru infliction of physical pain. With the help of Pleasure Old Man, who appears as a young beauty (Vonnie Lui), Wei Yangsheng spend his days in Chamber of Pleasure, drowning in sexual pleasures. This is the beginning of the trap he was lead into, while he was collecting evidences against Prince Ning's corruption. 3D Sex and Zen has succeed in selling itself as a movie with plenty of nudity, sexual inter courses, lesbianism and sadomasochism. It also touches on taboos in Asian country such as sex and religion. However, it failed to live up to it's hype of presenting sex in an eye popping 3D. What audience get to see for the 3D effects are, sad to say, items flying over to the eyes of the audience. Unlike Hollywood 3D slasher flicks such as SAW 3D (2010), My Bloody Valentine 3D (2009) and Final Destination 3D (2009) which promises audience with blood and gore right in front of their eyes, audience for 3D Sex and Zen got themselves with only mahjong tiles, bullets and knives flying towards the audience. The only eye popping scene audience saw was the upper nudity made by Vonnie Lui. As a movie claiming to sell eye popping sex in 3D, it has not really lived up to its hype. Most of sexual scenes and nudity appears in clear images when 3D glasses are put on, but the eye popping visuals are simply lacking. Another area that is worth mentioning in a rather negative way is 3D Sex and Zen contains a fair amount of violence and gore than sex and nudity. Be prepare to see decapitation if you are not ready for it. The flow of the story could have been better, in terms on how 3D Sex and Zen was presented. The flow is rather weak, with much details missing from the movie. More details could have been used to beef up the weak storyline, such as how Wei Yangsheng and Tie Yuxiang trying to salvage their failing marriage towards the end of the movie. Though 3D Sex and Zen are not totally based on The Carnal Prayer Mat, what audience will like to see is how filmmakers can do a full adaptation of The Carnal Prayer Mat, which serves as more than just a tale of eroticism. It is a tale of morality that serves as a warning on sins and retribution. 3D Sex and Zen managed to carry the message across the film, but the fair amount of violence and gore seems to hinder the way the message are meant to be presented. To sum up, for audience who wants a more detailed story, they can consider the 135 minutes extended version on blu-ray release. 3D Sex and Zen could have improved by beefing up the storyline, which gives audience more pleasure than confusion."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Local Production",
         "One Dollar Production Limited",
         "China 3D Digital Entertainment"
      ],
      "summaries": ["As a conceited scholar of the Ming Dynasty, Wei Yangsheng believes that since life is short, one should pursue the ultimate sexual pleasure as time allows. Wei Yangsheng encounters Tie Fei the Taoist priest's daughter, Tie Yuxiang, on an occasion. With the former's talent and the latter's beauty, they fall in love at first sight, and Wei Yangsheng is later married into the Tie's family. Yuxiang is elegant and courteous under the influence of her father's faith, though her lack of passion cannot fully satisfy Wei Yangsheng's sexual needs. His disappointment is no less than his affection for her."],
      "budget": 2580000
   },
   "movielensId": 171821,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "2011-04-14",
      "dvdReleaseDate": null,
      "directors": ["Christopher Sun"],
      "runtime": 118,
      "movieId": 171821,
      "title": "3-D Sex and Zen: Extreme Ecstasy",
      "mpaa": "NR",
      "actors": [
         "Saori Hara",
         "Yukiko Suo",
         "Tony Ho Wah-Chiu",
         "Vonnie Lui",
         "Lan Yan",
         "Hiro Hayama",
         "Carina Chan",
         "Jason Yiu",
         "Justin Cheung Kin-Seng",
         "Tenky Tin Kai-Man",
         "Kirt Kishita",
         "Mark Wu Yiu-Fai",
         "Cliff Chan",
         "Wong Shu-Tong",
         "Lawrence Lau Sek-Yin"
      ],
      "imdbMovieId": "1365048",
      "originalTitle": "3D肉蒲團之極樂寶鑑",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["iUcqtIy0xDs"],
      "plotSummary": "The story is loosely based on a 17th century erotic Chinese story named The Carnal Prayer Mat and follows a young scholar named Yangsheng who gets married to the beautiful daughter of a local merchant. When their sex life proves unsatisfactory, Yangsheng leaves home and journeys to the Pavilion of Ultimate Bliss.",
      "tmdbMovieId": 67308,
      "avgRating": 5,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/dEb0Kb0xmUuHmO1Dk4WKHuaw5Cw.jpg"
   }
}