{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "splatter",
         "id": 15085
      }],
      "imdb_id": "tt3367250",
      "video": false,
      "title": "Caedes",
      "recommendations": [],
      "backdrop_path": "/htgK25EPpEPL13wf39ayF1SWP3v.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Daniel Kies",
               "gender": 0,
               "credit_id": "561f70dec3a3680e10002bb6",
               "name": "Bernhard Bozian",
               "profile_path": null,
               "id": 1522729,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Leen Martin",
               "gender": 0,
               "credit_id": "561f70eb92514171c5002b58",
               "name": "Lena Baader",
               "profile_path": null,
               "id": 1324145,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Manesh Desei",
               "gender": 0,
               "credit_id": "561f710492514171d0002a8e",
               "name": "Burak Akkoyun",
               "profile_path": null,
               "id": 1522730,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Jorrun Anderson",
               "gender": 0,
               "credit_id": "561f711ac3a3680e1d002da0",
               "name": "Jakob Graf",
               "profile_path": null,
               "id": 1522731,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Fritz Kurz",
               "gender": 2,
               "credit_id": "561f7126c3a3680e1d002da8",
               "name": "Max Meyr",
               "profile_path": null,
               "id": 1332900,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Alsuna",
               "gender": 0,
               "credit_id": "59d76330925141251f00c4cb",
               "name": "Manoush",
               "profile_path": null,
               "id": 98195,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "561f70ce92514171cd002bbf",
            "name": "Slavko Spionjak",
            "profile_path": null,
            "id": 1522728,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.246138,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 322148,
      "vote_count": 1,
      "budget": 0,
      "overview": "Directed by Slavko Spionjak.",
      "similar": [
         310135,
         16871,
         1992,
         4232,
         1690,
         19912,
         29427,
         76617,
         126889,
         381288,
         298250,
         588,
         16288,
         256742,
         341006,
         923,
         21484,
         19994,
         13190,
         2024
      ],
      "original_title": "Caedes",
      "runtime": null,
      "poster_path": "/hLk0Bs4Xa6mrZME1FUfiFwcsFVE.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Tiberius Film",
         "id": 23868,
         "origin_country": ""
      }],
      "release_date": "2015-10-15",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Slavko Spionjak"],
      "runtime": 89,
      "synopsis": "Dan and his three friends ( ex - soldiers ) go camping in a forestglade. After a wild night of drinking it comes to a rude awakening ! Panic and hysteria spreading. A young woman is just bitten by a camper with bare teeth. Totally confused and pure fear people try to find refuge in the forest ... ... And this is where they expected absolute evil ! Spanish: Dan y sus tres amigos ( ex- soldados) ir a acampar en un claro del bosque. Después de una noche salvaje de la bebida se trata de un rudo despertar ! El pánico y la histeria se extienda. Una mujer joven es simplemente muy mutilado por una caravana con los dientes descubiertos. Totalmente confundida y conducido por puro miedo la gente trata de encontrar refugio en el bosque ... ... y aquí es donde se espera que el mal absoluto ! German: Dan und seine drei Freunde (Ex-Soldaten) machen Campingurlaub auf einer Waldlichtung. Nach einer wild durchzechten Nacht kommt es zum bösen Erwachen! Panik und Hysterie greift um sich. Eine junge Frau wird gerade von einem Camper mit bloßen Zähnen regelrecht zerfleischt. Vollkommen konfus und von nackter Angst getrieben versuchen die Menschen Zuflucht im Wald zu finden ... ... und genau dort erwartet sie das absolut Böse !",
      "writers": [
         "Rita Spionjak",
         "Slavica Spionjak"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt3367250/",
      "coverLink": null,
      "actors": [
         "Bernhard Bozian",
         "Lena Baader",
         "Burak Akkoyun"
      ],
      "reviews": [
         "\"Caedes - Forestglade of Death (Die Lichtung des Todes)\" is an awesome movie created by German productions near Munich. It was possible to arrange a great selection of excellent actors. It's a quite funny splatter film with sophisticated SFX (no blood or body computer-generated imagery)! It contains an interesting story about a still current political issue presented in a realistic and sarcasm way at the same time! The beginning of the story is structured in a classic way. A bunch of young people make plans for a camping trip in a forest. They meet a lot of other people there and have fun together. They have a party and everything seems to be fine, as expected. Even so the situation is supposed to turn overnight, literally. Further the story takes its bloody course and rises to a horrifying revelation... A definitely exciting movie for all zombie heads and horror fans :D Comedy and horror alternate with one another continually. It can definitely keep abreast of grand Hollywood movies! All in all, a great movie considering the available resources. :)",
         "First of all I have to say, this one is a low budget production. You see it, but what you also might see is, that's a project from the heart. You got a lot (funny) overacting, jokes, splatter (real professional and good looking) and the explanation, what \"Ceades\" really means... It's not perfect, but if you want an entertaining movie-evening, you should give it a shot. There is one point, I also have to mention: With Tobias Licht there is a really great villain in this movie. I would have wished for more screen time.",
         "A group of friends wants to party at a camping fair - \"Happy Camping\". All the visitors pass out at night and wake up to random strangers attacking them. Obviously, some of the guests had bad beer, for they became... zombies! After several painful dialogues and zombie killing the group learns what happened... and tries to fight it. Sounds like a nice film to watch? Unfortunately not. I was fooled by the (in that time) 6-star rating. After watching the movie I realised that only around 40 people have voted on that movie, so that explains a lot. To make things short: The one mandatory star I have to give is for the nice cleavage which is presented to the viewer every five minutes during the movie. Besides from that, \"Caedes\" features an unbelievably stupid plot, bad acting, worse sound mixing and outstandingly poor jokes, not to mention the cheap gore. Watching this hurt. Really, really bad. In general, I can appreciate even the worst zombie/gore/horror- flick. Obiously, this one here marks an exception. Don't, just don't.",
         "It's low budget horror, so you should know what to expect then. It is funny at times (some dialog choices are nice) and the characters are as out there as you would imagine they'd be. The effects are quite decent for a movie like this (which cannot always be said about the \"acting\" unfortunately). You can have a couple of laughs if you watch it with friends (kind of like a party movie, though there are better ones to get excited about of course). Don't expect there to be nudity, but there is a lot of gore/blood around. It takes a bit at the start, but after that it's a \"festival\" of violence if you want to call it that ... watch the trailer to be certain if this is for you though",
         "Oh my gosh, \"Caedes\" is SO typically for bad German movies, that I am not sure if I should laugh or cry. And by the way, I AM German, and I hate German movies. As in every German movie, the actors are horribly bad, the dialogues are embarrassing at best, the sound editing is a joke, the effects are poor, the plot is non existent, and the characters are laughable stereotypes. Some \"kids\" (every actor is at least 30 years or older, but of course they portrait \"Teens\") celebrate in a tent camp in the woods. Next morning, every 2nd teen became a Zombie and starts eating the party guests (this happens, when you don't offer barbecue on your party !). No one is surprised at all. No questions are asked, everyone begins to do his stuff. One is kung-fu-ing every Zombie down, the tough bitch wrestles them down, the others get axes and stuff. When suddenly someone starts shooting from his hide in the woods on Zombies and teens alike, again no questions are asked, cuz this is totally normal in outdoor parties. I quit this ridiculous waste of time and this insult for every horror fan after 20 minutes, because no one with a brain can watch this any longer. I recommend not the movie, but to do something useful with the DVD. Like, put it under your table, so it stands still finally. Or play some frisbee with it. Or make it a gift to someone you hate."
      ],
      "genres": [
         "Action",
         "Horror"
      ],
      "productionCompanies": ["UE Spionjak Films"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 171807,
   "movielens": {
      "languages": [""],
      "releaseDate": "2015-10-15",
      "dvdReleaseDate": null,
      "directors": ["Slavko Spionjak"],
      "runtime": 0,
      "movieId": 171807,
      "title": "Caedes",
      "mpaa": null,
      "actors": [
         "Bernhard Bozian",
         "Lena Baader",
         "Burak Akkoyun",
         "Jakob Graf",
         "Max Meyr",
         "Manoush"
      ],
      "imdbMovieId": "3367250",
      "originalTitle": "Caedes",
      "genres": [
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Directed by Slavko Spionjak.",
      "tmdbMovieId": 322148,
      "avgRating": 5,
      "releaseYear": "2015",
      "numRatings": 1,
      "posterPath": "/hLk0Bs4Xa6mrZME1FUfiFwcsFVE.jpg"
   }
}