{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "medium",
            "id": 2723
         },
         {
            "name": "ghost hunting",
            "id": 15040
         },
         {
            "name": "ghost hunter",
            "id": 159939
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "seance",
            "id": 163186
         }
      ],
      "imdb_id": "tt4974584",
      "video": false,
      "title": "Harry Price: Ghost Hunter",
      "recommendations": [],
      "backdrop_path": "/dSLY5JE3bvqNHV5JDsUWJxH37AR.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "boenkqb",
            "id": "567f0138c3a36860e900a39c",
            "content": "Having withdrawn from society following the suicide of a young soldier, con artist Harry Price is drawn back into the land of the living when an MP's wife, Grace Goodwin, is found naked in the streets of her local constituency. Fearing a scandal may taint a promising career for her husband, Edward Goodwin, Sir Charles Harwood recruits Harry Price to investigating Grace's condition. If Harry is unable or unwilling to assist, she will be committed to an asylum.",
            "url": "https://www.themoviedb.org/review/567f0138c3a36860e900a39c"
         },
         {
            "author": "John Chard",
            "id": "56879758c3a36860e9022650",
            "content": "Separating the real man from the show?\r\n\r\nAny self respecting British citizen with a bent for the supernatural knows about Harry Price. To see any production on film or television with his name attached instantly gets the knowing excited. This is, as regards this ITV production, more a curse than a blessing.\r\n\r\nWhen Guy Ritchie re-imaged Sherlock Holmes, the most striking thing was that his Holmes and Watson could actually be any buddy buddy duo, the famous names are incidental in that it sells the premise. The same is the case here, this really could just be a British paranormal investigator of his own accord, instead of the makers attributing the Price name just to make an appealing heading.\r\n\r\nThe pic is a decent spooker, nice period design, safely written - and even though Rafe Spall as Price is oddly cast - it's decently performed. It plods at times, veering close to being boorish with its paranormal literary kinks, but for those without any affinity to the real Harry Price then this is a good watch. Those who who do know their Price onions, on the other hand, will only be left disappointed. 6/10",
            "url": "https://www.themoviedb.org/review/56879758c3a36860e9022650"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Price",
               "gender": 2,
               "credit_id": "566850649251417401003244",
               "name": "Rafe Spall",
               "profile_path": "/7ucsDEWvcMU4SpxtZEaYErPpXHh.jpg",
               "id": 28847,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sarah Grey",
               "gender": 0,
               "credit_id": "56685072c3a36836ac00348f",
               "name": "Cara Theobold",
               "profile_path": "/6mcjQu63qvi6u9YA89dtDNwHO4b.jpg",
               "id": 1252496,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Edward Goodwin",
               "gender": 2,
               "credit_id": "56685080925141740b002fb8",
               "name": "Tom Ward",
               "profile_path": "/nQIJFwBXxc3ppekkbC4P2pGTigO.jpg",
               "id": 29527,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Joan Grey",
               "gender": 1,
               "credit_id": "5668508d92514173ff003098",
               "name": "Sophie Stanton",
               "profile_path": "/5nU4V49LKNKOQ19FJEmBfmg9pMl.jpg",
               "id": 105494,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Grace Goodwin",
               "gender": 1,
               "credit_id": "5668509e925141740e0034f5",
               "name": "Zoe Boyle",
               "profile_path": "/2Z4wSFHUEE4eWCVQ8oqAaqj19La.jpg",
               "id": 1252492,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Albert Ogoro",
               "gender": 0,
               "credit_id": "566850a7c3a36836a30031cb",
               "name": "Richie Campbell",
               "profile_path": "/yMB9VQhIa6PvhiWb3KsHajPT6OU.jpg",
               "id": 553273,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Vernon Wall",
               "gender": 0,
               "credit_id": "566850aec3a36836a6003312",
               "name": "Lewis Reeves",
               "profile_path": "/qacp3kcCHmCP6Gs3rshDjMvz523.jpg",
               "id": 1534962,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "5681788d9251412e5200f3c4",
               "name": "Paul Bigley",
               "profile_path": "/fqRomZYLJatugmtuCdQHvnI9u14.jpg",
               "id": 49350,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "56817894c3a368607500fae9",
               "name": "Josh Bolt",
               "profile_path": "/iWvd8KdmDmpySNnu3JpRauurbPB.jpg",
               "id": 233276,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "5681789ec3a36828f5006bb0",
               "name": "David Burke",
               "profile_path": "/chZOTgwqyUiD4DgIM392L1mR1kM.jpg",
               "id": 1220099,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "566850589251417411002ef3",
               "name": "Alex Pillai",
               "profile_path": null,
               "id": 203159,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5680486192514131df00b758",
               "name": "Jack Lothian",
               "profile_path": null,
               "id": 1554428,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 1.104508,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 371833,
      "vote_count": 15,
      "budget": 0,
      "overview": "When MP's wife Grace Goodwin is found naked on a London street, Harry Price is summoned to investigate claims that her house is haunted.",
      "similar": [
         288158,
         452507,
         77949,
         102283,
         201085,
         13188,
         134366,
         11618,
         2655,
         1562,
         627,
         1427,
         769,
         4771,
         137094,
         75780,
         497,
         91586,
         169917,
         433808
      ],
      "original_title": "Harry Price: Ghost Hunter",
      "runtime": 90,
      "poster_path": "/bAA32NYV8jwOVG4pdgRvbQdTZgX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bentley Productions",
         "id": 70930,
         "origin_country": ""
      }],
      "release_date": "2015-12-27",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alex Pillai"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Jack Lothian"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4974584/",
      "coverLink": null,
      "actors": [
         "Rafe Spall",
         "Cara Theobold",
         "Richie Campbell"
      ],
      "reviews": [
         "Apparently the real Harry Price was a well regarded paranormal investigator who had a reputation for exposing fakes. This ITV made for television film had all the hallmarks for being a potential pilot to a series. However the very poor ratings it received over the Christmas period makes any series very unlikely. Rafe Spall played Harry Price dragged out of self exposed exile in the 1920s to look into the case of a leading politician's wife who is displaying bizarre behaviour and having haunting visions of a drowned child in a big house they recently moved into. Harry Price is adamant that their is a rational explanation to all this. The smarmy politician, who seems to be based partly on David Cameron with his 'we are all in it together' quip near the start of the programme has other motives in engaging Price to look into his wife's strange condition at a politically sensitive time for him. Well I was not sure what to make of the husband's own behaviour because the character was so badly written which to me lessened a lot of the mystery. He does not want Price snooping around, he does not want him to talk to his wife. He will not even engage medical doctors to treat his wife. Given the way he was behaving over his wife's condition why did anyone reckon he was potential Prime Minister was beyond me! Price with the assistance of the household's combative maid delves deep onto this mystery but really it was rather shallow, plodding and over-long. When Price is not moping around with memories of his own dead wife or the soldier who killed himself in front of him displays the whizz bang of the modern day Sherlock (I noticed the film had a cameo from David Burke who was Dr Watson version 1 in the Jeremy Brett Sherlock Holmes series) and the demystification of Jonathan Creek without the humour and agility.",
         "This fictional story is inspired by the real Harry Price, a 'psychic researcher' who investigated supposed supernatural phenomena and exposed fraudulent spiritualists. In this feature length drama, set in the early '20s, Harry is called into find out why Grace, the wife of Liberal MP Edward Goodwin, is behaving strangely after moving into their new house. The party are determined to ensure that her strange behaviour doesn't damage her husband's prospects. She is convinced that there is somebody else in the house but Harry can't find anything obvious. As the investigation continues Harry ends up working with Sarah Grey, the maid, who believes that he is a fraud. When I watched this I had no idea that Harry Price was a real person so had little idea what to expect; this might be the best way to enjoy it as this way it works as both a mystery and as a ghost story right until the resolution. The story grabbed in the opening scene when a soldier kills himself in front of Harry after taking some banal advice the wrong way\u0085 this brief scene explains why Harry stopped acting as a spiritualist himself. The central mystery is interesting which kept me guessing as to who was responsible and why. The central characters are fun to watch; even though at times it feels as if this is a pilot for a possible series; the ending, where Harry asks Sarah to become his assistant on a more permanent basis, certainly suggests that there could be more if the ratings are good enough\u0085 and if there is I'd certainly watch. The supposed supernatural elements are shown in a way that leaves the possibility that there is a ghost as well as the possibility that we are just seeing what a deluded/drugged person may be seeing. The cast are impressive; Rafe Spall is solid as Harry and Cara Theobold is likable as Sarah; the central pair. They are ably supported by the likes of Tom Ward, Zoe Boyle and Richie Campbell. Overall I'd recommend this to people who enjoy a mystery and don't want any offensive material; even the brief nudity is shown in a way that shows almost nothing without the contrivance of conveniently placed items.",
         "Any self respecting British citizen with a bent for the supernatural knows about Harry Price. To see any production on film or television with his name attached instantly gets the knowing excited. This is, as regards this ITV production, more a curse than a blessing. When Guy Ritchie re-imaged Sherlock Holmes, the most striking thing was that his Holmes and Watson could actually be any buddy buddy duo, the famous names are incidental in that it sells the premise. The same is the case here, this really could just be a British paranormal investigator of his own accord, instead of the makers attributing the Price name just to make an appealing heading. The pic is a decent spooker, nice period design, safely written - and even though Rafe Spall as Price is oddly cast - it's decently performed. It plods at times, veering close to being boorish with its paranormal literary kinks, but for those without any affinity to the real Harry Price then this is a good watch. Those who who do know their Price onions, on the other hand, will only be left disappointed. 6/10",
         "Okay, maybe it was rather predictable (I certainly wasn't surprised to learn who the culprit was, despite the red herrings thrown in the path). Maybe it was corny. At times it was inconsistent. BUT it was very creepy (I spent a lot of time with my hands over my eyes) and at times rather moving in its exploration of mental illness. I also liked the period sets and costumes. I thought Rafe Spall was excellent and his character made an attractive focus for the action. I'll be intrigued to see how they manage to expand it into a series (assuming that's the intention) as there is limited scope for the title character to exercise his skills.",
         "Rafe Spall plays 'ghost hunter' Harry Price. In the wake of World War I many people had lost loved ones and could not reconcile the senseless waste that had occurred and wanted to be able to speak to them beyond the grave. This included the very high and very low in society. In order to fill the void a mini industry took off of mediums and psychics who used all manner of tricks and scams to exploit their grief. Harry Price is in this field and is contacted by a high profile MP whose wife has had a bit of a 'turn' and come over all unnecessary; she in turn claims that their new home, an erstwhile 'workhouse', is haunted. He is called in to investigate and prevent the poor woman from being hauled off to the sanatorium – posh word for mad house. Now this is a TV film but has very high production values for the most part. There was some wobble camera at the beginning but that seemed to calm down – much to my relief. The acting is all top notch and a real chemistry builds between Price and the maid Sarah played by the wonderful Cara Theobold. There are some really spooky bits but this is essentially a detective story with psychic overtones and I must say I greatly enjoyed it. I hope they make some more - recommended.",
         "One of the delights of coming to a series \"cold,\" so to speak, without any knowledge of who the \"real\" Harry Price, is that we can approach it on its own terms as an example of a mystery thriller without speculating about whether it is \"true\" or \"untrue\" to the historical past, whatever that means. This is certainly the case with HARRY PRICE: GHOST HUNTER. The real Harry Price (1881-1948) gained a reputation as someone using the then innovative sciences of psychotherapy and psychoanalysis to understand the human mind as well as expose fraudulent mediums who spent a lot of their time touring music-halls and playing on ordinary people's gullibilities. Alex Pillai's production includes one such sequence where our eponymous hero (Rafe Spall) interrupts a performance given by Monsieur Lutrec (Simon Gregor), and ends up hitting the fraud on the chin backstage. Yet the historical material should not be allowed to obstruct a good story. As with most investigator-heroes, the television Harry has a past; haunted by the specter of his dead spouse, he spends most of his evenings dreaming at his dreary home. İt is only when he encounters spry ladies' maid Sarah Grey (Cara Theobold) that he decides to slough off his depression and look forward once more with fortitude. Having himself been involved in fraudulent activity, he decides now to devote himself to the cause of truth in unmasking other frauds. The production manages some side-swipes at manipulative politicians such as Sir Charles (Michael Byrne) who is so preoccupied with getting his protégé Edward Goodwin (Tom Ward) elected as the new leader of the Liberal Party that he is prepared to go to any lengths to achieve his aims. The fact that Edward turns out to be a sleazy character whose faults are unmasked at the end is simply poetic justice. As with most period dramas, the settings of early Twenties London are meticulously recreated, even though it seems that every sequence - whether interior or exterior - seems to have been shot using a smoke filter. The story is little slow to get going, with perhaps too many swooping pans and unexpected zooms at the beginning designed to create a spooky ambiance. On the other hand the ending is cleverly staged through Sarah's point of view as she recovers consciousness, having been ruthlessly felled by Edward. MPs will do anything, it seems, to assert power over women.",
         "As another reviewer has noted, HARRY PRICE: GHOST HUNTER has absolutely NOTHING to do with the real-life paranormal investigator. It gets the era right but that's about it. What we have here is the usual lefty period drama nonsense, with a miscast and poorly acting Rafe Spall full of the usual mannerisms and the like but failing to convince for a second as the real Price. I would have enjoyed this immensely had it followed some of Price's real-life cases, like the mongoose or Borley Rectory. Instead, we get involved in some nonsense involving a guy's wife who keeps having ghostly visions. They also shoehorn a black guy into the story in a ridiculous show of tokenism. The plotting is slow and dull and the characters are quite laughable, but the biggest regret is that Price is so unrecognisable. Spall looks nothing like him and acts nothing like him, so why they bothered pretending that he was Price I don't know. Without the Harry Price hook I probably would have rated this higher, but as it stands it's a kick in the teeth for any fan of the supernatural.",
         "If your looking for a dramatic story about the real Harry Price and any of the actual cases he investigated, then you are in the wrong place. Because all this is, is about a fictional case of a politician's wife who is experiencing paranormal activity at her house. to the best of my knowledge the real Harry Price never investigated such a case. (I've studied many subjects of the paranormal including some of Prices actual cases to know that this program was fabricated to make it look like a real Harry Price case) If it showed dramatic stories of some of his actual cases like The Brocken Experiment, Gef the talking mongoose and Borley Rectory. Then I would have rated it a lot more. (depending of wither the facts were correct) I was left extremely disappointed. Even the \"Ghost\" depicted in this program looked crap. If you ever wanted to see a dramatic version of an actual case which took place Then go and see The Enfield Haunting, because they got most of the facts correct. On other hand if your looking for a ghost story about a famous ghost hunter, again your in the wrong place. However if your looking for a program which will bore you to tears, with a rubbish ghostly effects. Trust me this program is it. I'll leave it up to you, which one you like to do with this program. My advise. don't even bother wasting your time. Complete rubbish, avoid at all costs",
         "Superb, thought-provoking period piece with contemporary and feminist undertones; and there's the rub, in that, usually, I have little time for entertainment projecting contemporary liberal ideology onto period pieces, which, by dint of chronology makes a mockery of us all. However, due to the consistent quality and interesting plot I was able to set my misgivings aside and thoroughly enjoy the film. Following World War 1, known as the the Great War, most British families had lost close family members, many, more than one. As a result there was extensive interest in the afterlife, the spirit world, in that, many people wanted to reach out to their loved ones because for many, they never have had the opportunity to say goodbye, subsequently, the fad produced so-called supernaturalists, deceitful men and women keen to cash in on grieving relatives. Into this environment comes Harry Price, 'ghost hunter', a modern scientist aghast at witnessing these parasites prey on grieving families and seeks to expose both them and their methods. However, Harry, played brilliantly by Rafe Spall, succumbs to 'evoking' the spirits on behalf of a grieving soldier but the well-meaning deceit goes dreadfully wrong and his 'victim' commits suicide leaving Harry bereft. Months later, we find Harry morose and drifting, somewhat hangdog and unemployed. Into this environment arrives a senior opposition politician with an urgent need for Harry's particular skill set; it seems a promising politician's wife is being troubled by the dead and only the Ghost Hunter can help. On Harry's journey to unmask the perpetrators or confront the dead he is ably assisted by Downtons Abbey's Cara Theobold as Sara Green who puts in a marvellous performance as the hard put-upon maid of the haunted household. The supporting cast, Zoe Boyle, Tom Ward and Richie Campbell are competent as well as confident, typical of a quality British production. In closing, I believe there is, within this film the promise of a great TV show if the ITV network which produced the show demonstrates a little vision and courage. All in all a spooky 8/10.",
         "I thought this was excellent, and would love to see a series come out of it. Everyone has been saying that Rafe Spall looks nothing like the real Harry Price, but does it matter in the scheme of things??? I just thought it was an excellent story, and would love to see more. I love ghost stories, real ghost stories that is, not horror, blood, guts and gore, so this was just perfect for me. I think if you want to see a true to life programme, go to the biography channel or look up Harry Price online, there are lots of details on his website. I for one thought Rafe was excellent, and would love to see more programmes like this instead of the usual reality housewives/singety sing song sing drivel. Well done ITV for once."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Bentley Productions"],
      "summaries": [
         "In the 1920s Harry Price, a medium and exposer of fake clairvoyants, is approached on behalf of rising MP Edward Goodwin, whose young wife Grace's odd behaviour causes her to believe that their house is haunted and she is being made to obey the commands of ghosts. Goodwin is sceptical, feeling that Grace's problem is psychological, but he will not have her committed - partly so as not to harm his political career - and asks Harry to move in following mysterious, sinister writing on a floor. Helped by sensible housemaid Sarah and opportunistic journalist Vernon Harry researches the house's history, learning it was previously a workhouse where a young boy, Grace's possible ghost, was murdered. However he also discovers personal secrets from the Goodwins' past, which make Grace susceptible to her alleged visions.",
         "A TV-movie about Britain's real-life ghost hunter and skeptic Harry Price, who investigated tales of the paranormal and supernatural."
      ],
      "budget": 0
   },
   "movielensId": 171831,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-12-27",
      "dvdReleaseDate": null,
      "directors": ["Alex Pillai"],
      "runtime": 90,
      "movieId": 171831,
      "title": "Harry Price: Ghost Hunter",
      "mpaa": null,
      "actors": [
         "Rafe Spall",
         "Cara Theobold",
         "Tom Ward",
         "Sophie Stanton",
         "Zoe Boyle",
         "Richie Campbell",
         "Lewis Reeves",
         "Paul Bigley",
         "Josh Bolt",
         "David Burke"
      ],
      "imdbMovieId": "4974584",
      "originalTitle": "Harry Price: Ghost Hunter",
      "genres": [
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When MP's wife Grace Goodwin is found naked on a London street, Harry Price is summoned to investigate claims that her house is haunted.",
      "tmdbMovieId": 371833,
      "avgRating": 4,
      "releaseYear": "2015",
      "numRatings": 1,
      "posterPath": "/bAA32NYV8jwOVG4pdgRvbQdTZgX.jpg"
   }
}