{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "weekend",
            "id": 2677
         },
         {
            "name": "strip club",
            "id": 3688
         },
         {
            "name": "u.s. navy",
            "id": 4410
         },
         {
            "name": "nerd",
            "id": 5801
         }
      ],
      "imdb_id": "tt0088385",
      "video": false,
      "title": "Weekend Pass",
      "recommendations": [],
      "backdrop_path": "/mZSckQlf6LkPXRAw2a9ZauOXWCQ.jpg",
      "revenue": 21058000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Paul Fricker",
               "gender": 0,
               "credit_id": "52fe47ae9251416c910722ff",
               "name": "D.W. Brown",
               "profile_path": "/iQEY1GnOImTwu5jaSbzcj25YwN.jpg",
               "id": 144304,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lester Gidley",
               "gender": 0,
               "credit_id": "52fe47ae9251416c91072303",
               "name": "Peter Ellenstein",
               "profile_path": null,
               "id": 1196196,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Webster Adams",
               "gender": 2,
               "credit_id": "52fe47ae9251416c91072307",
               "name": "Patrick Houser",
               "profile_path": null,
               "id": 199189,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Bunker Hill",
               "gender": 0,
               "credit_id": "52fe47ae9251416c9107230f",
               "name": "Chip McAllister",
               "profile_path": null,
               "id": 174373,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tina Wells",
               "gender": 1,
               "credit_id": "52fe47ae9251416c91072313",
               "name": "Pamela Kay Davis",
               "profile_path": null,
               "id": 1196197,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Cindy Hazard",
               "gender": 1,
               "credit_id": "52fe47ae9251416c9107230b",
               "name": "Hilary Shepard",
               "profile_path": "/57xw7A6na2vpUmmbTJZtUVV120f.jpg",
               "id": 106487,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tawny Ryatt",
               "gender": 0,
               "credit_id": "52fe47ae9251416c91072317",
               "name": "Graem McGavin",
               "profile_path": null,
               "id": 19180,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Maxine",
               "gender": 0,
               "credit_id": "555a35429251416a23000087",
               "name": "Annette Sinclair",
               "profile_path": null,
               "id": 178516,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Bertram",
               "gender": 2,
               "credit_id": "555a354d925141410100082f",
               "name": "Grand L. Bush",
               "profile_path": "/gAh3iIR7Pbpjx6o5qtAa9GTKKKe.jpg",
               "id": 14333,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Nat",
               "gender": 2,
               "credit_id": "555a3576c3a368778200d5ce",
               "name": "Teddy Wilson",
               "profile_path": "/pT5g0ZOwNhPRd6utOTSBBeQrqjj.jpg",
               "id": 58649,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Sadie",
               "gender": 1,
               "credit_id": "555a3587c3a368778200d5d0",
               "name": "Bunny Summers",
               "profile_path": null,
               "id": 44800,
               "order": 11
            },
            {
               "cast_id": 9,
               "character": "Joe Chicago",
               "gender": 2,
               "credit_id": "532bdab6c3a3684b9d000cb2",
               "name": "Phil Hartman",
               "profile_path": "/rf62sAab9vOjm9x7ZA0VBWDkHvD.jpg",
               "id": 14104,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Tony Twan",
               "gender": 0,
               "credit_id": "555a35999251412ff900a92b",
               "name": "Tony DeLia",
               "profile_path": null,
               "id": 1441659,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Sookie Lane",
               "gender": 0,
               "credit_id": "555a35a892514125760003a6",
               "name": "Lynne Marie Stewart",
               "profile_path": "/bcu1p1ul7Fyds9sZdkYQsmmMRVD.jpg",
               "id": 1232417,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Candy",
               "gender": 1,
               "credit_id": "555a35d19251411e5b00bc35",
               "name": "Debra Christofferson",
               "profile_path": "/8DYZ5eGlruBsRxEfRxOE1nP96Nt.jpg",
               "id": 168331,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Officer Henry",
               "gender": 2,
               "credit_id": "555a35e5c3a368778200d5dd",
               "name": "Henry G. Sanders",
               "profile_path": "/2SU75g2CAIzGWbgfIlNvKZQhYTZ.jpg",
               "id": 16506,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Officer Anthony",
               "gender": 0,
               "credit_id": "555a35f5c3a368776c00b5d4",
               "name": "Anthony Pena",
               "profile_path": null,
               "id": 103572,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Etta",
               "gender": 0,
               "credit_id": "555a364c9251412ff900a946",
               "name": "Valerie McIntosh",
               "profile_path": null,
               "id": 1364917,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47ae9251416c910722fb",
               "name": "Lawrence Bassoff",
               "profile_path": null,
               "id": 109044,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "539a7fdf0e0a260fb000112b",
               "name": "Lawrence Bassoff",
               "profile_path": null,
               "id": 109044,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "539a7ff10e0a260fa2001132",
               "name": "Mark Tenser",
               "profile_path": null,
               "id": 1015439,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "539a80060e0a260fab00112b",
               "name": "Michael D. Castle",
               "profile_path": null,
               "id": 22425,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "539a80170e0a260fb700109e",
               "name": "Marilyn Jacobs Tenser",
               "profile_path": null,
               "id": 22426,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "539a802d0e0a260fb30010b7",
               "name": "Mark Tenser",
               "profile_path": null,
               "id": 1015439,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.622696,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 80211,
      "vote_count": 2,
      "budget": 0,
      "overview": "Three rookie sailors who have just completed basic training are out on their first weekend pass. As they hit one bar after another, they soon forget everything the Navy ever taught them.",
      "similar": [
         251516,
         35056,
         9737,
         620,
         96,
         8363,
         257344,
         90,
         12163,
         881,
         5255,
         50456,
         15092,
         161,
         744,
         755,
         44833,
         77930,
         9879,
         9005
      ],
      "original_title": "Weekend Pass",
      "runtime": 88,
      "poster_path": "/dtjE9f5b7UjhbBJlbsLV0T5VuUr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Marimark Productions",
         "id": 1010,
         "origin_country": ""
      }],
      "release_date": "1984-02-03",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "72 Hours of liberty to forget everything the navy taught them",
      "adult": false,
      "homepage": "http://www.crownintlpictures.com/tztitles.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lawrence Bassoff"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Lawrence Bassoff"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088385/",
      "coverLink": null,
      "actors": [
         "Patrick Houser",
         "Chip McAllister",
         "D.W. Brown"
      ],
      "reviews": [
         "This isn't that good of a movie but it has a mysterious charm working for it that I can't quite put my finger on. I don't know, but I think it has something to do with the camaraderie of the four sailors. As a military veteran, I found the friendships fun and engaging. Where else can four completely different guys strike up such a bond outside of the military? This film focuses on four sailors fresh from boot camp who have a weekend pass in LA before they head their separate ways, various specialized schools. LA is the former haunt of Spencer and Bunker Hill (Chip McAllester) who have dames from their past they're eager to meet while nerd Lester has a phone number of his commander's niece and Fricker (D.W. Brown) has a spot lined up at a prestigious LA comedy club. They each have their missions but Lester's is the only one that proves fruitful, however, each sailor finds romance in the arms of a woman they weren't expecting. STORY: $$ (The story really is a letdown. It really isn't the story as much as the filler that hinders the viewing experience. The director gives FAR too much time to dance choreography, tossing in some lame mime shows, aerobics workouts and a spandex-clad dance climax. However, despite the emphasis on dancing, the love story of Bunker Hill and his aerobics instructor sustains interest as does Spencer's fling with college chum Hilary Shepard, who doesn't quite live up to his fantasy--she's too Hollywood for his tastes. Fricker's lead up to his comedy routine could have used some work as could Lester's set-up with the commander's niece (Graem McGavin). ACTING: $$$ (For a 1980s comedy that featured a bunch of lesser names, the acting wasn't that bad. D.W. Brown and Chip McAllester shine. You'll feel for Brown's Fricker whose main ambition is to be a great standup comic but he just doesn't have it. His failure, however, leads to a romance with the cute Daureen Collodel, who, just like Fricker, was a bomb on the stage at the comedy club. McAllester is solid as Bunker Hill who returns to his old stomping grounds--and all black neighborhood--with his three white sailor chums. Some ethnic jokes ensue. Hilary Shepard gives a quality performance as Spencer's object of lust who cares for nothing but her own image. She gives the best line in the film when she agrees to bed Spencer but only under her rules--mechanical appliance necessary. She tells Spencers that conventional sex went out with bell bottom pants. Graem McGavin gives a sensitive performance as the sheepish girl that Lester dates). NUDITY: $$$$ (There are your typical strip club nude scenes supplied by \"actresses\" early in the film as the sailors first destination is eats and titillation. Later on Hilary \"The Body\" Shepard disrobes for a bath but gets rebuked by Spencer. Buxom little Graem McGavin isn't as obliging in this film as she was in MY TUTOR).",
         "There is a scene in \"Citizen Kane\" where Joseph Cottens character Jedediah Leland is attending an opera. On the stage singing, or at least trying to sing is Kanes mistress Susan Alexander. Leland is so bored with her talentless performance he begins making paperdolls out of his program . If you watch this movie you may also find yourself becoming a master in the art of paperdoll making. A bunch of Navy recruits fresh out of bootcamp on the town for 72 hours. Their weekend comes to an end sooner for them than this picture does for the viewer. Recommendation: The second part of the title \"PASS\"",
         "\"Weekend Pass\" is one of the lesser efforts from the legendary Crown International during this time. Those hoping for typical raunchy and nutty hijinks from the era of the sex comedy will be sorely disappointed with it. There *is* some enjoyable nudity, but no sex, and the movie has no real comedy fireworks. That's not to say that it doesn't deliver some laughs, but in general it's not hard to see why some viewers would consider it to be boring. Writer / director Lawrence Bassoff, who went on to direct \"Hunk\" for the same studio, obviously knows that he doesn't have a lot of story here, so he's obliged to pad the running time here and there. Fortunately, this does benefit from an attractive and endearing cast who manage to make it endurable. Four young men, sailors in the Navy, have just completed their basic training, and now intend to have the last great weekend of their lives before they have to go their separate ways. They include aspiring stand-up comedian Paul Fricker (D.W. Brown), preppie Webster Adams (Patrick Houser), geeky Lester Gidley (Peter Ellenstein), and former gang member \"Bunker\" Hill (Chip McAllister). All they really wanna do is see some action (naturally), so they hit up places like a strip joint and an aerobics class. Bunker also runs into his old gang and there's time for Paul to attempt an act at a comedy club. The objects of their affection are likewise an engaging bunch: Pamela Kay Davis as Tina, Graem McGavin as Tawny, Daureen Collodel as Heidi, and Annette Sinclair as Maxine. The supporting cast also features familiar faces such as Grand L. Bush (\"Die Hard\") as gang member Bertram, Teddy Wilson (\"Loose Shoes\") as restaurant owner Nat, Bunny Summers (\"From Beyond\") as Sadie, the late, great Phil Hartman ('Saturday Night Live', 'NewsRadio') as comedy club emcee Joe Chicago, Anthony Pena (\"Humanoids from the Deep\") as a cop, and Kirk Calloway (\"Cinderella Liberty\") as Squeenie. As was said, nothing all that exciting ever happens but this is still mildly entertaining. Unfortunately, not much of the stand-up in the movie is all that funny (although the audience in the club seems to think otherwise), and the bouncy pop soundtrack does feature some horrible music (the irresistible theme song notwithstanding). Overall, a watchable enough comedy while it lasts. Six out of 10.",
         "A motley quartet of four sailors -- hip \"Bunker\" Hill (a likable performance by Chip McAllister), nice guy wannabe comedian Paul Fricker (solid D.W. Brown), cocky stud Webster Adams (a perfectly smug turn by Patrick Hauser) and timid nerd Lester Gidley (an engagingly awkward portrayal by Peter Ellenstein) -- on a 72 hour liberty pass cut loose in Los Angeles: Among are foursome's misadventures are visiting a strip club, going to Venice Beach, and having a harrowing run-in with a nasty street gang. Writer/director Lawrence Bassoff relates the entertainingly silly story at a reasonably zippy pace and maintains a winning sense of goofy good-natured fun throughout. Better still, this movie has a surprising amount of real heart and warmth to it; the main characters start out as kind of blah and uninteresting, but become more well-developed and engaging as the plot unfolds towards its charming conclusion. Naturally, there's still a pleasing amount of yummy female nudity (Sarah Costa and Ashley St. Jon are smoking hot as a pair of sexy strippers). Moreover, we've got a bevy of beautuful babes in colorful supporting roles: Pamela Kay Davis as sassy aerobics instructor Tina Wells, Hilary Shepard as the sultry, but stuck-up Cindy Hazard, Graem McGavin as cute dweebette Tawny Ryatt, and Daureen Colledell as sweet aspriring stand-up comic Heidi Henderson. Phil Hartman has a funny bit as smooth comedy club emcee Joe Chicago. Bryan England's bright cinematography, John Baer's jaunty score, and the bouncy pop-rock soundtrack are all up to speed as well. A very pleasant and diverting piece of harmless piffle.",
         "Four sailors just out of boot camp head out to Los Angeles on a free weekend. They all end up meeting various women with differing results. Weekend Pass was made in an era when the sex comedy was at its commercial peak. There seemed to be loads of them back in the 80's or so it seemed anyway. To be honest, the majority of these films have been very much forgotten and don't even command a minor cult following now. I would say that this one does qualify as a sex comedy, as it has some nudity sprinkled throughout and its central characters and their motivations certainly fit the genre. But it's a very restrained example of this kind of film it has to be said. And while it's not exactly funny, most of its peers aren't either. I have to say, however, that while this is hardly a very good film I found it to be somewhat likable. I think this was primarily down to its quite decent cast who put in engaging performances, while on the other hand its episodic structure meant it never got too boring either and ensured that there was a reasonable amount of variety to its events. There are encounters in various places such as a strip joint, a comedy club and an aerobics disco. I thought the various couplings towards the end were handled fairly well also, with even some worthwhile dramatic acting in places. By the end of the flick you would never say it's a lost classic but, at the same time, I thought it did a number of things reasonably well and wasn't as knuckle-headed as this type of fayre normally is.",
         "It beats Casablanca, Citizen Kane, Gone With The Wind and The Wizard of Oz as the world's finest example of cinematic craftwork. And if you believe that, I have a voting machine from South Florida I'd like to sell you. P.T. Barnum was right.",
         "The plot of WEEKEND PASS reminded me of those old musical comedies starring Gene Kelly and Frank Sinatra in which a trio of up-for-it sailors come on shore leave for the weekend and engage in all kind of escapades. Unfortunately this is the lame '80s comedy version of the story, put out by trash purveyors Crown International, and it's as dumb and stereotypical as you'd expect. The problems are tenfold. For starters, the main characters are all jerks, and I mean real scumbags. When you see the way they treat women and find out the kind of humour they enjoy then you'll end up hating them too. Secondly, the adventures they embark on are dumb and designed to titillate than anything else. They end up at a sleazy strip club, allowing for ample nudity from the female extras, and also head to a comedy club and listen to various racist and offensive jokes. To pad out the running time there are a few sub-plots here and there and some slapstick moments, although surprisingly for a Crown International film, no scene of a dog tearing off a woman's bikini top. Oh well - you can't have everything...",
         "Four sailors leave bootcamp in San Diego and travel to LA for a long weekend. While there they visit a strip club, go to the beach, do aerobics, go to the old neighborhood, get a massage, and go to a comedy club. They all meet girls and live happily ever after. Eighties music soundtrack. Rather pointless movie available on many multi-packs. 4 stars for the nudity Guide: F-word. Nudity (Hilary Shepard, stripper Sara Costa, Cheryl Song, Ashley St. Jon)",
         "Torture isn't pretty. It hurts, and frankly, I wouldn't recommend it. So, in the same thought, I wouldn't recommend WEEKEND PASS. Four young, nubile sailors set out on a (dare I say?) weekend pass. The aftermath: 88 minutes of sheer, mindless, pathetic, depressing boredom. How this inescapably bad film ever received theatrical release, is beyond the wisdom of Solomon. Whoever was the studio exec that approved this, has probably moved on to a new line of work. The acting is appalling. The script seems as if it were written by some fifteen year old students, who really thought they were being clever. I'd rather watch someone tripping on bad acid. Just AWFUL. Gentle viewer, you have been warned. NOT RECOMMENDED.",
         "\"Weekend Pass\" did pretty well at the box office for a low budget youth comedy with no big stars in its cast. However, it's all but forgotten today. Watching it, it's pretty easy to figure out why it hasn't built even a minor cult. There's no real story here - it's just a bunch of vignettes that have little to no relationship with each other. There are a number of attempts at humor, but they all fall completely flat. The musical score is pretty bad - I'm sure even audiences in 1984 thought the music was sub par. And while there is some T & A, none of the characters actually gets lucky, at least on screen. Still, I have to admit that the movie is not COMPLETELY terrible. The production values are pretty good for a low budget movie, taking us to a number of places that include some L.A. locations you don't usually see in a B movie. The four main characters come across as pretty likable guys, supporting each other and having warm personalities. And the final sequence has a surprising amount of emotion. I'm not saying this stuff saves the movie, but it helps to make the viewing experience less painful than you may be expecting.",
         "Alas, the only film I have *ever* walked out of...even as a horny 15-year-old who found nothing in this flick to justify the $5 I shelled out at the time. Recommend to people you loathe only.",
         "In what sounds like the perfect recipe for an 80s sex comedy, four naval recruits get a weekend pass and head to Los Angeles for 72 hours of fun. Unfortunately, 'fun' in this case consists largely of driving aimlessly around town in a jeep, getting in a scrap with a badly dressed street gang, visiting the world's worst comedy club, and busting some moves at an aerobics themed party (WARNING: this film contains scenes of gratuitous body popping and gaudy spandex outfits which may cause uncontrollable hysteria and/or feelings of nausea). The weekend's more risqué activities are limited to a quick visit to a strip joint, hiring a topless masseuse (the only one in LA who doesn't offer extras!), and for one member of the group, almost getting jiggy with an ex-girlfriend (the fool chickens out when he realises that she is more experienced in the sack than he is). Not much to boast about when they get back to base, then. By the end of their not very wild weekend, each guy has successfully hooked up with a 'nice' girl, meaning that they've had zero nookie, and that anyone unfortunate enough to have watched this wretched bilge has had zero fun."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Marimark Productions"],
      "summaries": ["Three rookie sailors who have just completed basic training are out on their first weekend pass. As they hit one bar after another, they soon forget everything the Navy ever taught them."],
      "budget": 0
   },
   "movielensId": 172195,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-02-03",
      "dvdReleaseDate": null,
      "directors": ["Lawrence Bassoff"],
      "runtime": 88,
      "movieId": 172195,
      "title": "Weekend Pass",
      "mpaa": "R",
      "actors": [
         "D.W. Brown",
         "Peter Ellenstein",
         "Patrick Houser",
         "Chip McAllister",
         "Pamela Kay Davis",
         "Hilary Shepard",
         "Graem McGavin",
         "Annette Sinclair",
         "Grand L. Bush",
         "Teddy Wilson",
         "Bunny Summers",
         "Phil Hartman",
         "Tony DeLia",
         "Lynne Marie Stewart",
         "Debra Christofferson",
         "Henry G. Sanders",
         "Anthony Pena",
         "Valerie McIntosh"
      ],
      "imdbMovieId": "0088385",
      "originalTitle": "Weekend Pass",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "EmWCetWz6TM",
         "25rqYBRnNjc"
      ],
      "plotSummary": "Three rookie sailors who have just completed basic training are out on their first weekend pass. As they hit one bar after another, they soon forget everything the Navy ever taught them.",
      "tmdbMovieId": 80211,
      "avgRating": 3,
      "releaseYear": "1984",
      "numRatings": 2,
      "posterPath": "/dtjE9f5b7UjhbBJlbsLV0T5VuUr.jpg"
   }
}