{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "handcuffs",
            "id": 772
         },
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "tied up",
            "id": 34156
         }
      ],
      "imdb_id": "tt0095730",
      "video": false,
      "title": "The Night Before",
      "recommendations": [
         26156,
         157036,
         30467,
         189755,
         54768,
         24081,
         96378,
         24073,
         150889,
         96600,
         68426,
         277687,
         100274,
         44895,
         85137,
         61964,
         27743,
         51321,
         183661,
         57204
      ],
      "backdrop_path": "/1jEf1JvFB8ykDmCSvURKvKX5jcE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Winston Connelly",
               "gender": 2,
               "credit_id": "52fe46ef9251416c9106491d",
               "name": "Keanu Reeves",
               "profile_path": "/bOlYWhVuOiU6azC4Bw6zlXZ5QTC.jpg",
               "id": 6384,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tara Mitchell",
               "gender": 1,
               "credit_id": "52fe46ef9251416c91064921",
               "name": "Lori Loughlin",
               "profile_path": "/vz0O132QhxEWkGOzCiODP2RSZ77.jpg",
               "id": 92509,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rhonda",
               "gender": 1,
               "credit_id": "52fe46ef9251416c91064925",
               "name": "Theresa Saldana",
               "profile_path": "/rvUptPY5VXmG1NnZsGcifBkaQmf.jpg",
               "id": 17652,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Tito",
               "gender": 2,
               "credit_id": "52fe46ef9251416c91064935",
               "name": "Trinidad Silva",
               "profile_path": "/mvJy15qgxM0cFst7pfnh80RZjVO.jpg",
               "id": 146798,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "544928250e0a267483001bdd",
               "name": "Suzanne Snyder",
               "profile_path": "/90FrTcjJudpeIYUjUzlO6XAmvnt.jpg",
               "id": 20363,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tuff #2",
               "gender": 2,
               "credit_id": "5a787c1a925141775c0122ac",
               "name": "Ned Bellamy",
               "profile_path": "/aPAsdVFewZK3ldhvrL1ea2VUkUK.jpg",
               "id": 2141,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ef9251416c9106492b",
               "name": "Thom Eberhardt",
               "profile_path": "/etx0mXlGZLPOAcCSySYz49YWs8A.jpg",
               "id": 68381,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ef9251416c91064931",
               "name": "Thom Eberhardt",
               "profile_path": "/etx0mXlGZLPOAcCSySYz49YWs8A.jpg",
               "id": 68381,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59ad7991c3a3682c7c04aad3",
               "name": "Paul A. Edwards",
               "profile_path": null,
               "id": 1402095,
               "department": "Camera",
               "job": "Camera Operator"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.204406,
      "production_countries": [],
      "id": 38966,
      "vote_count": 17,
      "budget": 0,
      "overview": "The Night Before is a 1988 film starring Keanu Reeves and Lori Loughlin. Reeves plays Winston Connelly, the so-called high school nerd and vice president of the Astronomy club. Loughlin plays Tara Mitchell, the pretty and popular head cheerleader who also happens to be the local police chief's daughter. The Tagline was: \"You lost your father's car. Sold your prom date. And a guy named 'Tito' wants you dead.\" It was filmed and set entirely in Los Angeles, California.",
      "similar": [
         1903,
         77,
         346685,
         11284,
         72570,
         1824,
         8273,
         914,
         18785,
         9737,
         261392,
         10157,
         127380,
         1954,
         2501,
         2502,
         414,
         1018,
         409,
         38
      ],
      "original_title": "The Night Before",
      "runtime": 85,
      "poster_path": "/mUPhy2GsW8YEIhUd3V6jtI4HS4D.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Kings Road Entertainment",
         "id": 4255,
         "origin_country": ""
      }],
      "release_date": "1988-04-15",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "You lost your father's car. Sold your prom date. And a guy named 'Tito' wants you dead.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thom Eberhardt"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Thom Eberhardt",
         "Gregory Scherick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095730/",
      "coverLink": null,
      "actors": [
         "Keanu Reeves",
         "Lori Loughlin",
         "Theresa Saldana"
      ],
      "reviews": [
         "I caught this movie on a pay channel over 10 years ago. It begins with a very young Keanu Reeves waking up in an alleyway after a night of heavy drinking. He is wearing a dirty prom tuxedo with no memory of what he did with his prom date. The film unfolds in a series of clue searching and memory flashbacks in which Reeves slowly pieces together exactly what happened. To my pleasant surprise, I found myself totally engrossed in the film within the first 5 minutes! At the time, I had no idea who Keanu Reeves was, so my interest in the movie was totally unbiased by his fame. I truly enjoyed this movie for just what it was...a fun movie to watch. Nothing too deep or meaningful here. I especially enjoyed the cameo by George Clinton.",
         "My fondest memory of this film is of watching Reeves and Laughlin dance to George Clinton's \"Baby Boy.\" Reeves, apparently, really is a ballroom dancer, and he is elegance itself in this sequence--right up to the moment when he slips on a wet spot on the floor and falls into a table. The rest of the film is a pleasant diversion, without giving the brainpan much of a workout. It builds humorously enough on its premise--that a cheerleader can learn to love a nerd--then cruises to its inevitable conclusion. Of course, it helps when the nerd is as handsome as Keanu Reeves. Look for Tiny Lister in a small role as the bartender who slips Reeves a mickey. This one has a great soundtrack, by the way, and it demonstrates once again that Reeves is underused as a romantic lead.",
         "I have to say that this must be my all time favourite movie! I mean come on! Everyone's saying it's awful but I've never laughed so much as when I saw it. Don't listen any negative comments about this movie - if you have a sense of humour at all then you will thoroughly enjoy this movie. Also, if you like Keanu as Ted in Bill and Ted's Excellent Adventure then you will be pleased to now that there's definitely some 'Theodore Logan' in Winston Connelly. And if you're a Keanu fan in general then you're in for a treat because he is undeniably cute as the nerdy Winston. Although relatively hard to find this movie is worth searching for. A must see!!!",
         "Being that this is my first ever review it is strange that I've picked this particular little 80's treasure! Now, Keanu Reeves. Not many people rate him as an actor. That much is clear by reading some of the other reviews of this movie (and others of his). Early in his career he starred in this movie about a regular 'geeky' guy who wants the cream of the crop. Miss-High-School-Cheer-Leader-Drop-Dead-Gorgeous-Thing! Well, he manages to somehow get her on a date. In fact he gets her to go the prom! (No spoilers) He wakes up in a strange place. Doesn't know what's going on and that's this movie's premise. He wakes up in a dead end place. His date GONE. Keys to a car that's no longer there... He has to find out where his date went? THEN find out why he sold her! And then find the Pimp he sold her to!? Now if that don't make you want to buy/rent this film I don't know what will! This flick is really great guys honestly. Check it out! It's also a very dark kinda movie in places. Strange and weird. Well directed. Be sure to check out Lori Loughlin. She is truly gorgeous in this film! And Keanu is FUNNY!!! \"Let me tell you a little something' about Tito... The man... is DUMB!\" - classic. Watch it and/or pray it comes available on DVD/Blu Ray in USA or UK!!",
         "A fairly good film with no real flaws. The film explores the misadventures of a prom couple winding up on the wrong side of the tracks. Think \"Sixteen Candles\" meets \"After Hours\" but sanitized for mainstream viewing. White slavery, drugs, grand theft, assault and armed robbery... it's all here, but presented in a way that keeps the spirit of those topics alive without being vulgar. A good watch, but if you're viewing it expecting explicit scenes and jokes, then you're in for a letdown. A mildly funny film that takes a look at L.A.'s underworld through perspective of a teenage couple. There's nothing deep about this film, but it's likable all the same, as most good hearted comedies are. There're a couple of tangentially suggestive scenes, but nothing that would prove offensive to the mainstream viewer. The comedy is light here and there, and pretty smart; it's not spoon fed to the audience. A definite thumbs up for some light viewing.",
         "I love this movie. It's funny and romantic. Keanu Reeves is quite charming as Winston. Lori Loughlin is adorable and a nice match for Keanu. The only problem I see with the movie is that Keanu is just too cute and charming to be believable as a \"punishment date\" for Lori's losing a bet.",
         "I think the best reason to see this flick is to see Keanu Reeves in his earliest, and perhaps quirkiest role. Reeves plays a young loser who wakes up in an alley on prom night with no memory, no car, and no date. The rest of the film is a meandering series of misadventures involving pimps, dealers and car thieves. Put your brain on hold while watching this one.",
         "Really nice movie guys, it starts strange then unfold into this funny; but interesting story, on how he got there? Lori is stunning just as in her other movies and Keanu adds that spice to make it all a awesome movie. The plot is good Keanu suffers in the movie but just when I taught he wouldn't stay with the girl... whoops she turns out to like all the crazy mix up that has been going on. She thinks she was kidnapped??? After knowing the truth, her idea towards her hero changes radically; but then in the midst of that he becomes a hero again and well ends up with the stunning girl. I been watching some 80's movies lately I didn't taught this one would be as good as the rest turns out I ended up watching this movies with a thumbs up. I am a picky person but this movie nails it I love it!!!",
         "I thoroughly enjoyed this movie. Cute beyond words. The scenes in the bar are nothing short of hysterical as this poor kid staggers around getting himself in more and more trouble...and the dance routine is soooo freaky/cool lol. Most of the minor roles are really great and its easy to miss some of the one liners and characters peppered throughout this film. I wouldn't recommend this as a typical brat packer movie - although on the surface, it could be mistaken for one. On the negative side, it takes a little while to get the flow of the movie and Keanu's character but it is worth it. Once you have tuned in to the humour, its a very funny movie. This film has an amazingly young (and cute) Keanu, plus some really side splitting moments. The awful fashion and great music makes this trip back into the late eighties great fun.",
         "This late 1980's movie is hilarious, and captures the time perfectly. What's more madcap than getting lost, drugged, selling your snobby prom date to the omni-feared pimp? Then waking up in a strange place foggily remembering what happened and having to retrace your steps from the earlier evening. Funny stuff. Keanu Reeves and Lori Loughlin are very smart and cute as the leads. They have great chemistry. But the real stars are the crazy assortment of locals they encounter on the way. It also has a great soundtrack by Parliament. Bootsy Collins and George Clinton are great. This films brings back so many young memories. Highly recommended teen fare. Enjoy!",
         "I can't possibly imagine someone thinking of Keanu Reeves as a nerd, but that's what he is in \"The Night Before.\" The school queen, Lori Loughlin, has to go to the prom with Keanu's Winston because she made a bet with friends and lost. The chain of events that happens is wacky and hilarious, and it shows Keanu at his sweetest.",
         "I found the VHS of this film in the bargain bin at a local used DVD, CD and books megamart. I thought I may have stumbled upon some lost Keanu Reeves film. It also stars Jesse's hot wife from Full House. While I never cared for Lori Loughlin's \"Becky\" on Full House, I thought she might do better in a more adult role. As I watched The Night Before I found it to be much like an ABC After School Special I saw years ago. Keanu Reeves had not developed his acting ability enough to engage the audience and Lori Loughlin's performance was fair at best. The story has potential as Keanu Reeves' character has to find out what happened on prom night, the night before. I am glad this average ho-hum film served as a stepping stone to Keanu Reeves' eventual super stardom, but had it been more popular, it could have sunk him too.",
         "This is a must for any lover of films, or the Weird and Wonderful that fill studio backlists to the brim. 'The Night Before' is different, not only in the conventional, but the unconventional. Creating laughs from the twisted love match of Reeves & Loughlin, the seedy going-ons that run the streets at night, to slapstick escapades that adorn the closing sequences. The story initially unfolds slowly and out of order in flashbacks (\"where am I?\"), then becomes linear as he figures out how to find and rescue her. Best sequence: Keanu and the lovely Lori Laughlin dancing to the funky music of \"The Rats Nest Band\", which happen to be none other than George Clinton and Bootsy Collins, and then at the end a quite satisfying car chase (there was a little John Wick in him even then). Lots of jokes and stereotypes about various low life inner city denizens, and about the hilarious (sarcasm) topic of human trafficking. Even though much of it is funny, and arguably avoids overt racism, it's just not always on the right side of the taste line. Overall rating: 7 out of 10.",
         "The story isn't anything new. Keanu Reeves plays Winston, a guy who wakes up with a major headache and absolutely no memory of what occurred the 'Night Before.' But as he wanders around the sleazy parts of a Californian city, he starts piecing together clues as to what exactly happened to his prom date, Tara (Loughlin), and a dreaded showdown at dawn with a guy named Tito. I usually like 80s teen movies and most of the time it doesn't matter how stupid they are. But I didn't like this movie at all. It was quite revealing of what a bad actor Keanu Reeves can be. If you've seen Prince of Philadelphia, the River's Edge, or hell, even Bill and Ted, then you know he can give a good performance. All the while I was watching him in this movie, I just kept thinking of the old skits on Mad TV where they used to do the Keanu Reeves School of Acting. \"Get in touch with that empty space in your brain.\" And Lori Loughlin, also no rookie to 80s teen movies, delivered her lines like she was suddenly picked on in English class to read the parts of a boring play. And the story, which reminds me a lot of the old Nintendo game, Uninvited, would've been better if the characters and their situations were much more outrageous. The synopsis for the film compares The Night Before to Scorcese's After Hours, which, for those who haven't yet seen it, is about a guy who gets lost somewhere in New York, and every time he tries to find his way back home, he gets involved in some awful situation with a bunch of complete wierdos. Well, in Night Before, sure Winston comes across some strange folks like the guy who just sticks his arm in his car and grabs his wallet out of his tux. But there lacks a lot of humorous oddities that could've made this movie much more memorable. With a nutty story like this, there's plenty of opportunity to do that.",
         "While I agree that this film isn't going to be on a Top 100 list any time soon (or Top 1000 for that matter), the acting, plot, characters, and atmosphere is so incredibly dull that you have to see it. Somehow or another, the director made L.A. look like the most generic urban setting ever seen. Things are so contrived and stupid that you'll get a rise out of it. How often do you get to see men named Fat Jack struggle for his life up a flight of stairs? How often do you see black people play guitars that are shaped like stars with glitter and sequins on them? Have you ever thought of Neo shooting at a pair of 45 cent gaudy red shades with his fingers? Then this is the film for you. As if all this wasn't incentive enough, you get to see Lori Loughlin in her skivvies. Now I bet you're running to your local VHS rental shop.",
         "I was intrigued to see this movie after I found out that it was one of Keanu's earlier film debuts. The novelty of Keanu's performance wore off quite fast once I realized how absolutely dreadful this movie was. It was truly a struggle to get through it. Actually I only saw the ending a week or so later when I caught it being televised again. Even the beautiful Lori Loughlin was unable to rescue this film from the depths of mediocrity and garbage. Avoid this movie even if you are a Keanu fan.",
         "Avoid this movie like the plague! This stinks so bad it's like the worst thing ever put on film. It ranks \"up\" there with an Ed Wood flick. However there is something that may make you watch it - it \"stars\" Keanu Reeves! Holy maceral! I wondered if there was another actor similar to Jack Nicholson who was completely untalented at the start of their career and later developed into a star... it's Keanu Reeves. (But his performance in \"Bill and Ted's Adventures\" was cool.) Burn the master... they don't allow negative scores on IMDb.com... 1/10 -Zafoid PS: Some real good music. -Z"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Kings Road Entertainment",
         "Zealcorp Productions Limited"
      ],
      "summaries": ["Winston Connelly wakes up in the middle of the night in an alley with no idea of how he got there. Nor does he know where in Los Angeles he is or why he is wearing a beat-up tuxedo. Through a series of flashbacks, he remembers that he was sidetracked on his way to the prom the night before. In the meantime, he has to figure out what happened to his wallet, his car keys, his date, and why a pimp named \"Tito\" wants him dead."],
      "budget": 0
   },
   "movielensId": 172253,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-04-15",
      "dvdReleaseDate": null,
      "directors": ["Thom Eberhardt"],
      "runtime": 85,
      "movieId": 172253,
      "title": "The Night Before",
      "mpaa": "PG-13",
      "actors": [
         "Keanu Reeves",
         "Lori Loughlin",
         "Theresa Saldana",
         "Trinidad Silva",
         "Suzanne Snyder",
         "Ned Bellamy"
      ],
      "imdbMovieId": "0095730",
      "originalTitle": "The Night Before",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["au162B_kGuQ"],
      "plotSummary": "The Night Before is a 1988 film starring Keanu Reeves and Lori Loughlin. Reeves plays Winston Connelly, the so-called high school nerd and vice president of the Astronomy club. Loughlin plays Tara Mitchell, the pretty and popular head cheerleader who also happens to be the local police chief's daughter. The Tagline was: \"You lost your father's car. Sold your prom date. And a guy named 'Tito' wants you dead.\" It was filmed and set entirely in Los Angeles, California.",
      "tmdbMovieId": 38966,
      "avgRating": 3.5625,
      "releaseYear": "1988",
      "numRatings": 8,
      "posterPath": "/mUPhy2GsW8YEIhUd3V6jtI4HS4D.jpg"
   }
}