{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0377701",
      "video": false,
      "title": "Cowboys & Angels",
      "recommendations": [
         12795,
         4927,
         44305,
         321,
         15708,
         89199,
         15728,
         27181,
         41189,
         14344,
         15850,
         79926,
         33343,
         4676,
         15179,
         35161,
         19844,
         10111,
         14681,
         22597
      ],
      "backdrop_path": "/8jsICeEI6x4lULqzTXnGWmy4AMj.jpg",
      "revenue": 33700,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Shane Butler",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001cdf",
               "name": "Michael Legge",
               "profile_path": "/p13bDxDneCF2cCOV8YbiLcA99p0.jpg",
               "id": 65031,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Vincent Cusack",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001ce3",
               "name": "Allen Leech",
               "profile_path": "/ezLSwpml7IWGy4loLpDUwIZ7wM8.jpg",
               "id": 85718,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gemma",
               "gender": 1,
               "credit_id": "52fe43d9c3a368484e001ce7",
               "name": "Amy Shiels",
               "profile_path": "/n3LQunD9gdoOLb6JHGqI7PHMc9R.jpg",
               "id": 85719,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Frankie",
               "gender": 2,
               "credit_id": "5a5e97a59251415a91000342",
               "name": "Sean Power",
               "profile_path": "/nohuNcdXrUBeRUQiZ2OTu3K8JN7.jpg",
               "id": 33396,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe43d9c3a368484e001cdb",
            "name": "David Gleeson",
            "profile_path": null,
            "id": 85717,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.430448,
      "production_countries": [{
         "iso_3166_1": "IE",
         "name": "Ireland"
      }],
      "id": 20148,
      "vote_count": 13,
      "budget": 2000000,
      "overview": "The story concerns a hapless civil servant who gets more than he bargained for when he moves into an apartment with a gay fashion student and finds himself on the catwalk. The film sets out to explore the difficulties for young people in keeping their identities in a fast moving culture of drugs and clubs.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769
      ],
      "original_title": "Cowboys & Angels",
      "runtime": 89,
      "poster_path": "/kIWj6s902aFOIZYZiKDGdjrVdcE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "TLA Releasing",
         "id": 328,
         "origin_country": ""
      }],
      "release_date": "2003-05-14",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David Gleeson"],
      "runtime": 89,
      "synopsis": "Shane Butler (Michael Legge) happens to live in London. He is a civil servant looking for a room to stay in the city and to avoid the long trip commuting back and forth. All the rooms he sees are horrible, small and with the toilet in the middle of the living room, or too expensive. While waiting to see another rathole, he comes across Vincent Cusack (Allen Leech) three years his senior. One of the possible landladies is an old lady with a cat (Peggy Coyne), who scares Shane away. The nice estate agent (Jennifer Barry) shows him a perfect place, but it's way out of his league in terms of rent, so she suggests that he shares the room with the other person interested in it. It happens to be Vincent. Shane's mother (Angela Harding) helps him move - he's just got three rubbish-bag full of things. She gives Shane a St. Christopher medal to protect him, because she's a bit afraid of him leaving in the city centre. Outside the building of the condo where now he's leaving, Keith (David Murray) leaves and lurks around. The audience feels that he's not a clean character. In their room, Vincent has already occupied every possible available location with his stuff. Shane settles as best as he can in his room and starts drawing a castle landscape. Vincent leaves, and Shane tries to find some available space for his own toiletries in the bathroom to no avail - Vincent has taken up everywhere; and as he's left the flat without saying anything, he can't even complain to him. Shane decides to go to a disco, but two bouncers (Jason Cahill, Robert Quigley and Cathall Costello) won't let him in just because - well, probably, just because of his boring, office worker look. Shane has to leave. Inside, Vincent is checking out a guy (Nigel Mercier) who's looking at him as well. They can't wait to arrive to the guy's apartment and make love. Meanwhile, Shane wants to order at a fast-food place because he likes one of the sellers. Gemma (Amy Shields) laughs when her co-workers take her cap. Shane tries to strike a conversation with her, so some of the girls who are waiting in the queue behind him giggle like morons at the dialogue. Shane has to buy some chips he probably didn't even wanted, and leaves. Shane arrives late for work... once again. His colleagues laugh at him. He tries to act non-chalantly, as though he had been working for hours, but he's reminded to clock in. All his colleagues give him his mugs so that he goes and makes coffee for everybody. Back to his condo, everything is neat, tidy, in order. Vincent jokes that if Shane doesn't like it, they could go back to how the flat looked like the day before. They talk about Vincent being at art school and knowing everyone. They reminiscence about the one time when Shane sat beside Vincent during his Christmas '98 examinations, and wrote in his paper that H2O was the chemical symbol for hydrogen dioxide. Shane also asks Vincent if he's say, and he answers he is. Shane adds that he isn't, to which Vincent says that everything says that Shane is not. They talk over a marijuana cigarette, and Vincent tells of Jimmy Doherty, the boy which was his first lover back in a school trip to Paris. Vincent adds that he's never slept with a woman. Vincent mentions that he has to prepare a fashion collection before he graduates, but that he hasn't even begun yet, and it's already late. Vincent daydreams of going to New York after graduation. Shane envies that Vincent has dreams and belongs to a community, the gay community. Shane comes back to the Supermacs fast food place, but another attendant (Julie McEvoy) attends him. Disappointed, when he arrives to his flat, Gemma is there, as she's a good friend of Vincent, who introduce them - and Shane admits that he's already met her at the Supermacs. Gemma spent two years in the USA and then she's come back to live with her parents, but doesn't know for sure if she wants to go back to art school. To enter the conversation, Shane says that he's considering going to art school as well. Vincent says that Shane's really a civil servant working for the Department of Agriculture. Vincent takes Gemma to his bedroom to show her his designs for the fashion show. Shane overhears them talking about him, and Vincent says to Gemma that he's completely square, and that he already has a full-time job. Outraged, Shane goes for a walk in the night. He stares at a bridge and the waters of the river reflect in his face. He calls Ma from a phone booth, and denies feeling lonely. A police officer is separating some drunk people. A bum asks him for a cigarette. He returns home and decides to take the St Christopher necklace from his neck. The thing gets tangled in a pipe box or something, and he finds a bag full of drugs. He takes them with him to his room. The petty drug dealers, Keith and Budgie (Colm Coogan) think it must have been somebody from the building. Later, Shane puts the bag back in its again. Keith discovers him. As nothing has disappeared, Keith is nice to him and offers to buy him a pint. He acknowledges Anne (Maeve McGrath) and the barman (Micheál Ó'Dubhghaill) They go to a rock bar, and Shane smokes maria for the first time. Shane skins some more in the toilet. He also pukes and pukes. When he comes back to his new-found mates, Jerry complains that when they told him to skin it in the toilet, they didn't really mean IN the toilet. Vincent walks Shane out. Keith will give Shane 1,000 euros if he goes to Dublin for some hash. Shane refuses but immediately repents. Vincent says that Gemma is going through a phase, but she might not be a lesbian after all. Shane tells Vincent not to go on bad-mouthing him in front of her. Vincent will change the way Shane looks by throwing all his clothes out. One of Shane's co-workers, Jerry Brown (Frank Kelly), tells him that he never left his boring job because he was afraid of quitting a steady thing. In his time, to have a stable job in the civil service was everybody's dream, and his mother was over the moon about it. So Shane finds out the courage to go to the Limerick College of Art and Design. He picks the paperwork at Admissions, and stares at the part where the papers say that \"students should budget an amount for fees and textbooks\". So it's decided: he'll go to Dublin. During the train trip, he gets blocked when he has to explain in 200 words or less why he wants to study art. The train arrives at Heuston Station in Dublin. He calls his contact from a phone booth. Bunny (Alvaro Lucchesi) gives him the drugs. Frankie (Sean Power) appears driving like a maniac, and mocks Shane saying that he looks like a fucking desperado. Shane can't touch anything within that cab, because it has been stolen, and having his fingerprints around would be dangerous for him. Shane thought it'd be only hash, but there were many different kinds of drugs in the bag. They drive him back to the station, and they have a car accident while smoking hash. A screaming woman (Karen Fitzgibbon) gets badly hurt, and when a man wants to call the police, Frankie and Bunny beat him up. Shane stares, horrified. Bunny and Frankie push him to the station. Keith gives the money to Shane, who doesn't even want to count him. Keith speculates that Shane is doing it all for the love of a girl, as he's not a criminal, or a junkie, and has a job. There is somebody, a thug (Frank Dineen) watching the building of Keith and Shane. At the same time, Vincent is going through a designer's block phase. Vincent inquires why Shane's look worried, - he told him that he had been home to see his family - and expresses lack of confidence in his own talent; he also inquires about the pencil sketches on the walls, and Shane says that his father was killed by a drunk driver, his mother took it hard, there was not much money around, and he passed the civil service exam... and that decided it. Shane shows Vincent the money and the form. Vincent tells him to save the money for school, as clothes are his department, and he's gonna change everything. This time, when they go to the pub, the bouncers let Shane in without a hassle. After the disco, they organize a house-warming party on the spot, and all of Gemma's co-workers attend after work. At the party, Vincent refuses to acknowledge that he and Shane flirt with each other. Gemma smokes from Shane's joint. Shane stares at Gemma, but her co-worker (Niamh Foley) interrupts them, so she looks for Vincent and invites Shane for free chips for life. The co-worker and Shane have sex. As walls are thin, Gemma and Vincent can hear them moaning and laughing. Vincent jokes that finally the flat has been christened. Keith and Jerry invite Shane over to a disco. Gemma and her female friend are there as well in full-party gear. Shane has a horrible hangover the following day, even when he didn't even realise that Gemma was in the same place as him. Vincent is using cheap models (Mary Jackman, Danielle Lawlor, Mary-Louise O'Callahan, Sharon McNeill, Alanna Littleg, Niamh Quinn) for rehearsals in his fashion show. When Vincent asks Gemma for a valium, she tells him to ask Shane, as \"he's got all the connections\". Vincent freaks out and tells Shane off: he doesn't really know where he's putting himself into. Vincent leaves banging the door as Shane admits that there are drugs in their apartment at the moment. It's Jerry's farewell party at the office. They all go to the pub for some pints after the farewell speech. At the pub, Jerry is kind of melancholic, as everything is celebrated with a pint of beer in Limerick: birth, marriages, deaths, engagements, retirements. When Shane goes to the toilet, he realises an only-ash fag in the ashtray, and looks for Jerry, who had stumbled into the floor. The ambulance takes Jerry away and Shane leaves all his distraught colleagues behind. When he arrives to his apartment, Vincent won't even look at him, in spite of Gemma inquiring aloud \"Is he OK?\". Shane draws while crying. He burns the art school application form. Keith and his friend show Shane a flatliner, one of the pills Shane brought from Dublin. Shane hallucinates from the Dubliner lady in the car accident screaming. Keith protects Shane when he's about to get into a fight with a disco-goer before a bouncer (John Finn) intervenes. Gemma, who's dancing with Vincent, prevents him from intervening. Shane hallucinates they're laughing about him. Shane slaps Vincent and Gemma punches Shane. The bouncers take Shane out. Shane kicks a skip and punches Keith who tries to stop him. Keith kicks Shane in the balls. Gemma offers support to Vincent while Keith has taken Shane to the apartment. Shane confides in Keith that he is scared that something terrible is going to happen if he doesn't do something. Keith recognises that Shane is not the only one who hides himself, and Keith admits that he's felt attracted to Shane since the first time he laid eyes on him, and now it's his opportunity - and starts undressing Shane. Keith starts kissing Shane, and Gemma finally dares to french kiss Vincent. It looks like both couples are going to have it going on, but they all stop. When Keith leaves, Shane tells him that he's not like him. It's Jerry's funeral. He had never married or had kids, so only his colleagues attend. Vincent finishes up his collection while Shane is about to burn all the drugs he's got. Two police officers in street clothes ran after Budgie and Keith and arrest them. Frankie and Bunny also fall. Vincent and Shane won't speak to each other, so Shane starts mopping to room as an act of repentance. Vincent tells him to help him to sow, as the fashion show is the day after tomorrow. With Shane's help, the collection is finished in no time. Vincent smokes a joint for the first time. They laugh that Shane loves Gemma, who's infantuated with Vincent, and Vincent himself doesn't have much success with men. Knocks on the door. Is it Keith? Or Gemma? It's the police with a search warrant. Detective Black (Padraig Campbell) finds the remaining drugs and Vincent smoking a joint. Not only is the fashion show at stake now, because they won't hear the accusations until the next day, but also Vincent will lose his opportunity to go to New York, as they won't let him in if he has got any police records. They try to laugh everything off, thinking that when the going gets rough, the rough gets going They are taking to the Inspector's office in the morning. Shane touches his St Christopher medal. When the Inspector enters, it's the lover who tore Vincent's shirt to pieces. First, Vincent says \"hi\" and smiles. Shane stares at him and the Inspector stays frozen. Then, he tells the police officers to leave for a second. Once alone, Vincent calls him \"lover boy\". Next thing we can see Vincent and Shane leaving the police station, while Vincent cries out \"There is god, there is god\". It's noon, so he's got to run to the fashion show location, as he's missing rehearsals. Vincent convinces Shane of helping him backstage and of walking the catwalk with the rest of the models. When Vincent graduates, Shane gives him an open-ticket to New York. Vincent wants to hug or kiss Shane but doesn't. He introduces Shane to his parents (Moira O'Dwyer & Niall Johnston) and he takes a photograph of them. Shane quits, although his boss, Richard Walsh (Frank Coughlan), tries to convince him. He tells him that Jerry would have been proud of him. Gemma and Shane see Vincent off at the airport. They look at each other and Shane offers to buy a drink for her. Meanwhile, Vincent finds St Christopher medal in his pocket, but only until it is detected by an airport security guard (Randall Daly). Shane hangs a drawing of Jerry in his wall. There are photos of Jerry and the boss, himself and Vincent. He finally fills out the application form for the Limerick College of Art and Design. He says in 200 words or less that he's found his voice, and that he wants the institute to show him how to use it. He is seen drawing Gemma, naked, sleeping in bed, presumably after having made love to him. End credits. ----written by KrystelClaire",
      "writers": ["David Gleeson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0377701/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg3NjI1NTQ0MV5BMl5BanBnXkFtZTcwNzE0NzcyMQ@@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Michael Legge",
         "Allen Leech",
         "Amy Shiels"
      ],
      "reviews": [
         "Although it sounds like the premise for a formulaic sitcom, Cowboys and Angels turns out to be something entirely different. This big-hearted crowd pleaser, written and directed by David Gleeson, centers on Shane (Michael Legge), a lonely 20-year-old misfit who moves to the big city and takes on a gay roommate, fashion-design student Victor (Allen Leech). After some queer-eye advice from the popular, outgoing Victor (new haircut, new wardrobe, new attitude), Shane begins to emerge from his shell. But an incidental friendship with the drug dealer who lives downstairs threatens to wreck his life just as it is beginning to come together. Refreshingly, Cowboys and Angels uses its characters as people, not types, on its way to detailing Shane's gradual coming-of-age. Even with its brief running time, the movie feels slight and padded: The story technically ends 10 minutes before the movie does. But the lack of the expected gay-straight clichés puts you in a forgiving mood, and Gleeson's upbeat, humanist approach takes care of the rest.",
         "Flat-mate wanted: apply within. So begins the sweetest straight-gay friendship in recent memory. Shane is a lost and lonely 20 year-old civil servant from the suburbs; he's adorably hetero and has no sense of style. His new roommate in the big city is Vincent, a hot young fashion student, queer, innately stylish, full of life, surrounded by friends, and able to pick up a hot daddy in ten seconds. For Shane, Vincent unlocks buried artistic dreams and a burning need to embrace the adventure of youth. For Vincent, Shane is...well...he's a makeover project, inside and out. And soon enough, he's in serious trouble. Filled with just enough confidence to make just the wrong move, Shane falls in with two drug-dealing thugs downstairs, and things get dangerous fast. As he spins out of control, Vincent flinches from the monster he's created. But the flat has thin walls, and even at their worst, Shane and Vincent never stop listening for each other. Refreshingly, writer/director David Gleeson's vision of this friendship transcends all that we've come to expect from a gay-straight relationship onscreen. The warmth and youthful optimism that emerge from this duo is positively infectious, and Michael Legge and Allen Leech effortlessly bring to life one of the rarest kinds of love. Gleeson's production is polished and lyrical; like Shane's clothing designs, Cowboys and Angels is colorful, bold and exhilaratingly alive.",
         "This breezy comedy-drama marks an assured feature film debut for David Gleeson, who traces his interest in film back to his childhood in the Co. Limerick village of Cappamore, where his father ran the local cinema. Set in present-day Limerick City, his film stars Michael Legge, who played the teenaged Frank McCourt in Angela's Ashes, but it offers a very different view of the city to the rain-sodden misery of McCourt's early life - and to its Stab City image as the alternative murder capital of Ireland. The emphasis of this warm, engaging movie is on the friendship that develops between two young men who agree to share an apartment for economic reasons. Shane (Legge) is a shy with girls and already bored with his job as a civil servant, and Vincent (Allan Leech) is a flamboyantly dressed, openly gay fashion design student. Shane's journey of self-discovery is charted with wit and insight in Gleeson's sweet-natured movie, which neatly resolves the potentially awkward moral dilemmas it raises. There is an appealingly natural chemistry between the charming lead actors, and a touching portrayal of a disillusioned older civil servant by Frank Kelly.",
         "Now here's the right way to do a drama/comedy involving Ireland's drug scene. (Makers of Headrush, take note!) Shane is so young and fresh-faced that we instinctively want to take him on our lap and give him a big hug--even though he's 20. His mother gives him a religious medallion and frets as he moves into a flat in the middle of Limerick. And she's right to. Shane is a lost soul looking for something and/or someone to belong to. His flatmate Vincent, on the other hand, is très cool and seems to have everything under control. We think we know where things are heading, but not everything happens quite exactly the way we expect. Being a movie, things move in a clear arc and do end very tidily, but still this film gets at some real truths about what life is like for young Irish men these days. What seems strange for an Irish movie is its sense of optimism and its celebration of people finding themselves. Shane is played by Michael Legge, whose previous experience playing a Limerick character was as one of three actors to play the young Frank McCourt in Angela's Ashes. Here he makes a very convincing transformation from insecure youth to newly found self-confidence. Allen Leech is likewise convincing as Vincent, who does a queer-eye-for-the-straight-guy number on Shane. Also on hand are David Murray, playing a more menacing version of his character in Flick, and Frank Kelly, managing to erase his \"Father Jack\" image as Shane's co-worker who symbolizes the dead end of a safe path through life.",
         "It's rare to come across exceptionally well done movies like this one that manage to stay hidden for years? Cowboys is a genuine rare gem. This cleverly written Irish drama is highly entertaining and realistic. But it's tilted just a few degrees off axis making it fresh and unpredictable. This is familiar subject matter given a genuine makeover with a few Irish twists. It's the sort of film that makes wading through all the junk at film festivals worthwhile. On a more technical level, it never feels particularly low budget. The lead actors do a very credible job. The cinematography is honest and the sound, in particular, is way above average for this genre. There are a few stray threads hanging off the seams here and there, but the story and main characters are easily captivating enough to keep your attention elsewhere. Others obviously consider this a gay themed movie but I don't agree. There's no gay romance and only a brief moments or hints of gay intimacy. There might be a tiny element of \"Queer Eye For The Straight Guy\" here, but it's just one of many small subplots. It's much more a coming of age movie--and, as such, it clearly excels.",
         "Two Irish lads move in together. Vincent is a well-balanced gay art student and Shane is a sheltered and shy civil servant. Through a makeover a la \"Queer Eye,\" Vincent helps Shane gain self-confidence. Unfortunately, Shane falls into the wrong crowd and starts trafficking drugs. Is this a makeover movie (complete with themes about being true to yourself) or a movie about the Irish drug scene? It tries to be both, but it never finds a good balance. It ultimately strives to be about the relationship between the two young men, but it never really succeeds because the relationship is never fully developed for the viewer. This problem could have been easily avoided--two very endearing deleted scenes should have been kept in the film for sure. There are some random scenes that seem to come out of nowhere, but it all pieces together nicely (perhaps too nicely) in the end. The lead character does some awful things, like being part of a hit and run where a woman is terribly injured and a man is severely beaten when trying to call the cops, but in the end it is all okay because he's a likable guy with a fabulous gay roommate who has unexpectedly got the hook-up. Oh, please. Still, the overall theme of being yourself and true to yourself is great, even if the movie goes about expressing it in a half-assed way. And both lead actors are irresistibly cute.",
         "Two Irish lads 'meet cute' in this story of straight and gay roommates that neatly skirts any real peril in favor of an emotional pot of gold for the two main players. With more than it's share of plot contrivances - piling coincidence upon coincidence - it's often tough to stick with the story but the playing of it's two stars Michale Legge as Shane (with his open-faced honesty and good looks) and Allen Leech as Vincent(smirking rakishly and charming us in the bargain) make this a ride worth taking - even as it detours into Dublin drug-running to add a modicum of tension. Amy Shields is the gal pal (relentlessly billed as luminous by the producers, she lives up to the attribution) that is beloved by both (for different reasons, natch). But film's fairy tale fade-out is less than convincing, despite the winning performances and brisk direction.",
         "It's a low-budget film with little in the way of a storyline and includes some diversions that have little bearing on the overall product. All of this would lead you to dismiss it as a lightweight offering. However, one of the main functions of a movie is to capture a sense of time and place and, in this context, Cowboys & Angels succeeds brilliantly. Even though it was made just two years ago, it has already found a unique position in time that viewers can relate to. It is set in my hometown of Limerick at the turn of the millennium as Ireland was moving from being the poorest country in western Europe to one of the wealthiest. Much of this happened to the bemusement of a population which had grown up on unemployment and emigration and now suddenly found itself surrounded by opportunities it had only dreamed of up to then. And along the way, a certain innocence was lost as a bulging generation of baby-boomers (Ireland's birthrate peaked thirty years later than its neighbours)worked its way through the buzz and the heartaches of transformation. In some ways, it resembles growing-up classics like American Graffiti and Rebel Without a Cause but set in a very different time and place. The main character, superbly played by Michael Legge, captures that wide-eyed innocence that the country was going through at the time while the photography picks up the youthful vitality of the city. While, on the surface, it may be an unremarkable tale about an unremarkable place, the ambiance is absolutely spot-on. Cowboys & Angels is perhaps the most representative contemporary feature film to come out of Ireland during the past decade.",
         "It's almost unheard of to find a gay-themed movie out of Ireland. But here it is. Wunderkind David Gleeson wrote and directed this, his first feature-film (shot entirely in his native Limerick). 26-year-old Michael Legge (Older Frank in \"Angela's Ashes\", and having kept off the 30 pounds he lost for that film) plays Shane, a sweet and artistic but fearful young man who is a bit of a mama's boy and geek. Having lost his father in a DUI motor vehicle accident, 18-year-old Shane abandoned college for a secure civil service job. Now, a year later, Shane seeks to move out of his mother's house and into an apartment in the city. But apartments are expensive and not easy to come by. Soon Shane hooks up with an old schoolmate, Vincent (adorable 23-year-old newcomer Allen Leech). Vincent graduated three years before Shane, and has been attending a local art college. The two move in together. Vincent is the stereotypical homosexual -- flamboyant, well-dressed, stylish, a good dancer, popular, materialistic. Shane is almost the direct opposite, which tells you right away where this film is headed. It's not long before Shane is homesick. Limerick is a violent, impersonal place. Shane knows no one. Vincent, however, is picking up tricks right and left (including a handsome older man). Shane's homesickness is worsened by the confessions of Jerry (played with quiet and gentle desperation by the terrific veteran actor Frank Kelly), a civil servant who shares Shane's cubicle. Jerry is on the verge of retirement. But Jerry never married, never had children, and never followed his life's dreams. Now, his life spent, Jerry is overwhelmed by regrets -- regrets which prey on Shane's loneliness. Shane soon stumbles on a cache of drugs in his apartment building (the incident is not as cheesy or trite as it sounds). When some other tenants almost discover him with the drugs, Shane takes them so he won't be caught. But when Keith, the drug dealer, finds his stash missing, he knows it had to be someone in the building who took them. Keith finds Shane attempting to return the drugs, and decides to co-opt the insecure young man (an ugly and yet realistic twist in the plot). Shane and Vincent eventually bond, with Shane admitting that he admires the way Vincent easily fits in. (It's a moment of dialogue that had a largely gay audience laughing out loud.) Vincent encourages Shane to try harder, and that means following your dreams and being yourself. Following Vincent's advice, Shane decides to apply for art school. But the fees and cost of books are horrendously high. Shane makes a fateful decision, and agrees to be a \"mule\" for one of Keith's drug shipments in return for a large cash payment. Shane travels to Dublin, where he meets two of Keith's drug buddies. They give him a shipment of drugs to take back to Limerick. But as the three joyride in a stolen car, they smash into another vehicle. Horrified (as his father died in a similar accident), Shane freezes. The two dealers, however, are not and they brutally beat one of the crash victims when he attempts to call for an ambulance for his injured female companion. Back in Limerick, Shane makes his drop and is rewarded with 800 punts for his trouble. Shane swallows his fears and horror at what he's done, and asks Vincent to turn him into a stylish social butterfly. Vincent gleefully agrees. Shane is transformed, and soon draws the attention of Vincent's beautiful blond female friend, Gemma. But needing more cash to fund his social experiment, Shane swallows his misgivings and starts helping Keith push drugs. Shane himself begins a downward spiral into drug use. When Vincent confronts him and Shane admits that he's been using drugs, Vincent storms out. Vincent, however, remains unaware of Shane's larger troubles. He's struggling to complete his senior project -- a fashion show for which he has yet to complete any designs. Although Shane is aware of Vincent's need for assistance, he neglects his new friend as he continues to snort, smoke and drink his way through life. Things come to a head one night in a club. Shane a pill which makes him loose control. Shane spies Vincent and Gemma dancing, and his drug-induced paranoia causes him to attack Vincent. Gemma punches him out, and Shane is thrown out of the club. That night, Keith takes Shane back to the apartment -- unaware that Gemma and Vincent are sleeping in Vincent's bedroom. Gemma tries to seduce Vincent, and Keith tries to seduce Shane. But both men reject these advances. It's a moment of truth for each, being true to themselves for once. The next day, Shane reconciles with Vincent and helps him with his senior project. But events begin spiralling out of control. Shane attempts to destroy the drugs in his possession, but completes only half the task when the police burst into the apartment. Finding heroin, pot and crack cocaine, they arrest Shane and Vincent. Certain they will be indicted for drug dealing and possession, the two are hauled before a local Detective Inspector -- who, it turns out, is the same man Vincent had sex with a few weeks before. The closeted detective lets them go (a ludicrous turn of events). Off they rush to Vincent's fashion show. It's a wild success -- and stars Shane as the super-model surrounded by hot women in tight clothes. All's well that ends well: Shane surprises Vincent by using his remaining drug money to buy Vincent an open-ended ticket to New York City, the place Vincent has dreamt of going to pursue being a fashion designer. Shane decides to abandon his cushy civil service job in favor of art school, and the beautiful Gemma falls in love with him. Shane's learned his lesson: Money and drugs don't make you fit in. Only being true to yourself will get you happiness and what you wish for. The problems are pretty obvious in the film. Once more, a film tries to be a \"dramedy\" -- mixing comic laughs with serious drama in a mish-mash that's neither. The worst example of this is during the drug bust in the boys' apartment. It's supposed to be a serious moment, the devastation of all their dreams. Shane, in particular, is in deep trouble. He's been in a hit-and-run, obstructed justice by not reporting the crime, obstructed justice by not reporting the beating, engaged in drug possession and drug use and drug transportation and the sale of drugs, been guilty of assault and battery himself and he's guilty of destruction of evidence. Yet, the film tries to lighten the mood by cracking jokes. The audience really can't take any of the important things in the movie seriously (including the film's anti-drug and be-true-to-yourself messages) when it treats them so cavalierly. But a deeper problem is the uneven characterization in the film. Shane is played by the extremely likable, decidedly cute -- and terribly talented -- Michael Legge. But there don't seem to be good reasons for what Shane does. Shane tells Vincent that the death of his father had a deep impact on him. Arguably, Shane should now be an anti-drunk driving advocate. (He appears to be: He refuses to go to pubs, despite Vincent's encouragement, and is upset by public drunkeness.) Yet, Shane almost casually tosses away his aversion toward inebriation in order to earn the money to go to art school. Shane's actions wouldn't seem so out of character had Shane's desperation, loneliness and despair seemed deeper and more soul-wrenching. Instead, Shane is depicted as merely being homesick. And why is Shane so deeply influenced by Vincent? After all, Shane barely knows him. Shane's despair is not so apparently awful that Shane should latch onto just any popular person he encountered...and yet, he does so. This would have made more sense had the film spent more time making Vincent into an impossibly powerful, respected, popular person. But, in fact, Vincent is depicted as a bit insecure, and not as personally influential or charismatic as he should be in order for Shane to respond to him as he does. That exposes another problem in the film, which is the short shrift given the character of Vincent. Vincent is almost a stereoptyical homosexual, a caricature which does little to advance the plausibility of the main story. Indeed, while the heterosexual characters (primarily Shane) seem real and fleshed-out, Vincent remains a goody-two-shoes stereotype. He has no internal life to speak of, and his friendship with Shane remains inexplicable. Indeed, the film's big emotional moment comes when Shane attempts to reconcile with Vincent. Vincent just takes him back -- which implies that Vincent is either some sort of cardboard character who does what the author wants him to, or Vincent is a doormat of a human being who loves forgiving the abusive friends he has. Whichever, it doesn't make Vincent a very appealing or interesting character. It's these sort of problems that the film stumbles over repeatedly. And although \"Cowboys and Angels\" is pleasant enough (and, thank god!, Irish), well-acted, funny and interesting, the film really doesn't hold together. By the time Shane and Vincent are released from jail (the coincidence of the inspector being Vincent's trick is just too implausible, and their release is farcical), the audience has largely given up on trying to make sense of things or caring about the characters. There's plenty of heart here, but the script needed re-thinking. I look forward to David Gleeson's next film, however, and to more from Michael Legge and Allen Leech.",
         "Although there is a gay lead in first-time director David Gleeson's \"Cowboys and Angels\", this is by no means a gay film, rather a touching and heartwarming story of two young men coming-of-age in the heart of Dublin. Rivaling anything that's on the market today in the way of teen films, this rises above any of them with great performances and a fresh look at some old themes. It might be too sweet at times and neatly wrapped but the Irish charm of the characters keeps it afloat throughout. Michael Legge plays Shane Butler, a geeky 20 year old lad from the suburbs who has just moved to Dublin. While searching for a flat to rent he stumbles upon a fellow classmate from high school, Vincent (Allen Leech), and the two reconnect when they both happen to be looking at the same apartment to rent. They decide to share it and Shane's adventure in the big city begins. Shane is straight, has a quiet demeanor, and looks like his mom dressed him, while Vincent is more outgoing, dresses and looks funky, oh, and is gay. The two don't quite hit it off at first, but their friendship develops over time and Vincent takes him under his wing, as a friend and partly as a fashion project. Shane falls for a girl named Gemma (Amy Shiels) who works in a nearby burger joint, and it just so happens an old classmate of Vincent's. Shane has a hard time making the connection with her and is envious of her and Vincent's friendship. To make matters worse, Shane finds some drugs in the buildings lobby, he gets caught by the dealer (David Murray), and is then offered a large sum of money to make a run. He takes the offer hoping the money can either buy him a new wardrobe or help put him into art school and get him out of his dead-end job at the civil service department. A subplot involves a coworker named Jerry that is truly touching. In any event, Shane falls into the wrong crowd and friendships are tested, hearts broken, and loved ones lost. But in the end, true friendship endures and you can't help be touched by either one, the cowboy or angel.",
         "I'm somewhat suspicious of long winded raving reviews that make excessive reference to the actors or crew. It always makes me think that either the person worked on the film, or were asked to write the review as a favour. I have no connection to this film and I thought it was terrible. I felt nothing watching it. It was not engaging, nor was it ambitious. Normally one has a certain allowance for an amateur film like this, you tend forgive certain things due to budget reasons etc. and most of those type of films have a certain spirit or drive to them that you admire. Not here. This film is in love with itself, and I certainly found it to have no spirit or drive to it. I found the films concept of the OTT 'gay character', who will change the indifferent 'straight character' to be less of a square and more in touch with himself; to be unbelievably cliché and outdated. A gay friend of mine commented that he found the portrayal insulting, I can see his point. Some things that occurred to me: The direction is pedestrian at best and the lighting is bad. The film did nothing new, nor did it have the notion or spirit to try. The acting of the two main leads goes from OK to almost good, but everyone else is poor. The cartoon 'gangsters' are laughable, and for all the wrong reasons. Is this meant to be a 'real' setting or 'magical realism' for Limerick? I couldn't seem to grasp the tone. I'm tired of seeing 'join the dot' movies receive plaudits at \"Festival Wherever\", and rave 'favour reviews' by provincial critics. Really, how does something like this get funded? I really feel that if some filmmakers careers depended on putting bums on seats in a cinema, they would soon find themselves having to change jobs. This is just not good enough.",
         "Despite it's good intentions this movie is completely pat. It's writing is absolutely obvious, and the \"surprises\" are utterly tragic attempts for moral or social or cultural redemption or something, or nothing. It's just a piece of . . . The writing at times devolves into such cliché that it is almost unbelievable that the actors could say such lines with straight faces. The actors, by the way, are the best part of it all, poor things. My heart goes out to them for having to suffer through the dialogue. They should be given awards for making this \"After School Special Movie of the Week\" seem life-like. Sadly in the end it just doesn't work, it's dead on arrival. Avoid this one at all costs.",
         "I popped the DVD into my PC just to see what this film looked and sounded like - and was immediately wrapped up in the visuals, the story and especially the sound. Even with a modest 5.1 speaker system I was amazed - it's hard to imagine a bigger or better experience in a cinema. Ninety minutes later I logged onto IMDb to sing its praises. I like that the script is very tight - yet allowing space for the characters to breathe. You can't help trying to second guess how they'll develop, because there's enough divergence to counter predictability - meaning that it all makes good reasonable sense and is very satisfying. The surround sound mix is just one of the attractions - and as well as being morally sound (very homo and hetero friendly) it's damned fine entertainment.",
         "I've just watched this film and I' surprised to find it was released in 2003. While watching it (before knowing the release date) I felt I was watching something out of the 1980s. Even though it may be contemporary, this film already has something \"aged\" about it. Its not exactly hackneyed, but there is something about the young people and the way they talk and act (and what they wear) that feels dated already. What especially struck me were the hairstyles and the clothing, some of the expressions and some of the mock innocence. These feel just too good, to tame, or too \"innocent\" to be credible in a movie in the 21st Century. The usual moral story, one supposes, and this time around just a bit too heavy-handed for my own personal taste. The stated gay interest or gay angle is very oblique.",
         "A sad little freckled mess of a young man arrives in big mean Limerick after the death of his father to start his new life. He decides to room with a gay man so effeminate he could practically fly away. \"Are you gay?\" he asks after they have moved in together, totally oblivious to the fact that his new roommate, a fashion student, dresses like a old Jewish woman. SPOILERS What next? You guess it! It's QUEER EYE FOR THE STRAIGHT (ahem) GUY Irish style, which apparently consists of a little mousse and some Barry Manilow costumes. Next up are some television calibre drug dealers, some fast food workers with plenty of disposable income and the sneaking suspicion that none of the people involved have ever been exposed to any of the subject matter they are depicting. Among the lessons this preachy movie teaches: - When your father dies, this is good time to abandon your mother - A drug run can be a good quick little income earner - A steady civil service job is the death of a poor boy - A drug dealer is a good choice to tell your troubles to - Lesbians like to sleep with gay men - All men wear make-up - Limerick has the population density of New York but just the one nightclub - After finding out your roommate is a drug runner and that there are drugs in the flat, a proper response is to say \"I thought I knew you!\" and mince on with your life. - Gay men are fairy god mothers that can wipe away straight boy sins So how do you solve life's problems? Get your lead from fifties musicals and PUT ON A FASHION SHOW! Subsequently, even more shocking costumes wear the actors. Homophobic and amateur nonsense with continuity errors galore. And did I mention the appalling costumes?",
         "This is a story about pursuing your dreams. a young Irish boy, shared an apartment with a stylish gay student and had a crush on his beautiful female friend, also got involved with some drug dealers. The storyline is believable, the evolvement of the plot is intriguing and interesting. How the pure friendship can come into being between a gay man and a straight man? It's the most touching part of this film. The sexual orientation is just a stunt, the relationship of the two characters is well presented. About dreams, the young boy always wanted to be an artist as he had the talent of drawing, but the status quo made him a civil servant. Sometimes we dare not to change just because we are too lazy, or in lack of motivation. Always easier said than done, but taking action might not be so hard as we think. Maybe changing our sexual orientation is difficult, however changing our life to fulfill what you really want is feasible. On the other hand, the drug culture is inevitable to the young generation, the temptation makes it hard to decline. Making a wise choice seems vital then. The cast is good, Michael Legge and Allen Leech each gives a strong and memorable performance, the chemistry between them is pleasant and adorable. Amy Shiels is amazingly beautiful in this film. I highly recommend this film to everyone who are wandering how their lives are going to be and I think it's very useful.",
         "COWBOYS AND ANGELS is a cute but somewhat forgettable coming-of-age movie that features a predictable premise of two men sharing a flat in Limerick -- one gay, one straight -- with an unconventional storyline. Shane (Michael Legge) is a twenty something Irishman who leaves his small town to make it big in the art world but lands a thankless, blue-collar job that does nothing for him. There he meets Vincent (Allen Leech), a stylish gay man who is appalled at Shane's lack of style. A friendship between then ensues, and the inevitable make-over takes place. However, the movie is interested in taking this set-up someplace a little darker, and one evening after a night on the town, Shane comes across a bag of drugs -- which belong to the quiet but dangerous Keith (David Murray) who makes Shane an offer he can't refuse. Thrown in the midst is Shane's attraction to Vince's girlfriend Gemma (Amy Shiels) who herself has an unrequited attraction towards Vince and virtually ignores Shane, and a surprising revelation Shane receives from Keith after a night at their favorite club goes south and he is thrown out into the streets. In this respect, COWBOYS AND ANGELS is a clever depiction of what is obvious and what is not because youth tends to ignore the facts of someone's sexuality, but it makes it even more ambiguous in the character of Keith, who represents a protector with a dark edge. Minus the runway at the end -- itself a cliché that attempts to spell out how far some characters have come in their journey through self-discovery, this is a pretty good movie, one that adheres to its convictions and doesn't try to throw in a left-field wrench for the sake of shocks.",
         "I was cleaning my computer, somehow I found this comment that I wrote for this movie, I don't think that it was published, So here it is. --- There are two things that I remembered the most. 1. One of the dialogs between the two characters. \"Are you gay? Yes, I am. It's the fashion thing, isn't it? It is everything. I am not, by the way. I figured. It is the hair thing, isn't it? It is... everything.\" That could be one of the things that people can talk about. 2. When they were about to see the inspector for their drug problems, the gay guy was very nervous. You can see it through his eyes. The instant he saw the inspector who had sex with him, his eyes changed immediately which he didn't even have to say anything to show that. Therefore, he has proved that he is a good actor for being able to express subtle things just through his eyes. There is one particular scene that did not make any sense to me. When Shane discovered the hidden drug, the next day when he was at the office, one of his workers said to him: \"don't worry son, it might never happen.\" And he smiled back. Another thing that seems to be a little unreasonable is that the drug dealer Keith is gay. He didn't act or look like gay, and he didn't seem to be interested in Shane sexually. Even though Ireland is another English speaking country, however, this movie still seems a little distant from where I am. It is about young people's life, I don't feel that most people can relate in the USA. Overall, it is a good film.",
         "I LOVE COWBOYS & ANGELS and the protagonist is very very beautiful actor and and an excellent actors! The history is actual in fact there are many young people in this situation. The movie can treat very good the themes presents on the movie: drugs, the friendship and many other.The movie have an excellent direction and excellent actors above protagonist. At the end of the movie win the friendship. That's good, a good friendship can help better more other solutions! Very good movies! The Italian title is \"AMICI PER LA VITA\" ,in English Amici Per la vita is FRIENDS FOR THE LIFE!So the Italien title resume the movie very well! I love COWBOYS & ANGELS AMICI PER LA VITA!",
         "I just saw this movie for the first time even though I heard about it 3 years ago.I really enjoyed it! It was everything I heard it was.It was heartfelt, and fresh and appealing.I found it interesting from the start as well as humorous at times.And then it got a little dark and sad before getting exciting again.I have never been to Ireland (or for that matter outside of North America) but I really liked the village of Limerick.It seemed like a really fun place and I could easily live there.I would love to visit there one day. I liked the friendship between Shane and Vincent(played by Irish hotties Michael Legge & Allen Leech).It was realistic and nice to see 2 friends who are complete opposites and who were not put off by each others sexual preferences's.I did find Vincent's character a bit stereotypical but he played the part well. I liked the plot but thought Vincent spent a little too much time with Gemma and maybe should have had a boyfriend or something.Gemma(played by Amy Shiels)could not decide whether she was a lesbian or straight.I really wanted Shane and Gemma to hook up but it was unclear in the end whether it happened or didn't.After Shane's adventure's with those drug dealers and nearly getting hooked and destroying a close friendship, I liked how he finally realizes you don't need to pretend to be someone else, and eventually finds himself and pursues his own interests and realizes what is important in life.",
         "cute actors. moral lessons. eulogy to friendship. the wrong way of the shy and naif good boy, not real different by Pinocchio. a beautiful film. or, more exactly, a reasonable good film. who seems say everything. about all. and the choices to explore different circles of life is not real inspired. but the final, like in many similar cases, seems save the errors and the large dose of good and ambitious intentions. result - a nice story about the courage to become yourself. nothing new. maybe, too familiar. but useful as one of stories who seems be a chain of scenes discovered by a stranger on the window to street, in the evening.",
         "The movie is average, dreamy, slightly over-sweetened and cliché. Of course watching it in 2017 would make it seem like it's the oldest idea in the history of cinema : two different people colliding somehow and their different worlds mix together and lead to a sort of a balanced amalgam; (who's never seen such kind of movies??) but It's certainly enjoyable to some extent. I have to say that I found their Irish accent convincing and really sexy. I even think the film would lose so much sparkle if that accent was replaced by some ordinary American-English talk ( no offense to anyone ). Spoiler:The most precious scene in the movie which is also the most shocking, when all three men were in the car smoking a joint and driving recklessly when they suddenly hit two innocent people. They get out of the car to figure out what happened and the injured woman starts screaming her lungs out. It's truly an intense scene and it gets more shocking as the two dealers hit her husband, run away and oblige Shane to go with them. The extreme confusion and fear he faced at that very moment felt symbolic, they actually stand for the general confusion the character was facing while trying to \"find his voice\". It's a scene that even kept hunting him somewhere further in the movie. Generally speaking, it's not a movie you'd regret watching by the end. It's entertaining and quite funny but also kinda emotional and dramatic especially in the last scenes. I hope you guys enjoy watching it anyway !",
         "The freshness and utterly natural appeal of leads Michael Legge and Allen Leech is the highlight of this Irish production about the friendship of a gay and straight pair of roommates. Leech is an openly gay young man with ambitions to be a fashion designer who wants eventually to go to New York to fulfill those dreams. In that field it's either New York or Paris. The housing shortage in Dublin puts these two together and they had a past acquaintanceship from school. Poor Legge is a shy and socially clumsy kid who has a dull civil service job. Leech takes him in hand and gives him a Queer Eye makeover, but gets a lot more than he could imagine as Legge befriends a pair of drug dealers in the same building and gets Dublin law enforcement looking at him. Both of them get romantic attention from previous unthought of sources as well. In the end Leech is the one who provides a way out of difficulties for both of them. In a country with a rigid homophobic and Catholic tradition of which it has come to grips with Cowboys&Angels is a delightful film about the Irish gay scene. The leads give natural and sincere performances and for gay audiences and a few straight people I recommend this film.",
         "An enjoyable ninety minutes, an amiable film about youth, about growing up in many ways, about learning to getting along, a bit sentimental without being stupidly weepy, and a bit violent without indulging in bloodletting because it might be cool. Two young men, strangers, share a flat in Limerick out of convenience and learn to live with differences--but not easily--as is true with life, education is often not in a classroom, and the lead lad gets in some disturbing situations that are not merely illegal. The actors obviously had fun making the film, and that communicates to the viewer--being that it's authentic Irish, I thought subtitles might be in order as they sometimes are with brogues and dialects (Last Orders, for instance), but it's clear sailing, with a few plot complexities but an easy watch featuring likable characters.",
         "Have to say i enjoyed watching this one. It was a lot of fun to watch a film set in Limerick being from here and recognising a couple of faces. Not a good enough reason I know, don't imagine I'd have had as much time for it otherwise. The dialogue and acting was a bit stilted at times and the plot had quite a few holes in it.(Also people don't tend to wave ecstasy tablets around in the air listing their ingredients and then slap them down on the bar for their mate to pick up.) However, it's good to watch an Irish film about students and young people that's not overly self conscious and aware of being Oirish. It isn't too ambitious and achieves what it sets out to do, tell a simple coming of age story. It also depicts the city pretty accurately, it doesn't try to make it look like New York and it shows a couple of the undesirables who earn the place its reputation. Whatever you may think of this movie it's got a nice little feel good factor. Supermac's never looked so good nor its lighting so flattering. Hope to see more Irish films exploring the country and showing various aspects of life in 21st century Ireland. Here's to filming more movies in locations other than Belfast, Dublin or Wicklow."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Wide Eye Films",
         "Peter Stockhaus Filmproduktion",
         "Grosvenor Park Productions"
      ],
      "summaries": ["The story concerns a hapless civil servant who gets more than he bargained for when he moves into an apartment with a gay fashion student and finds himself on the catwalk. The film sets out to explore the difficulties for young people in keeping their identities in a fast moving culture of drugs and clubs."],
      "budget": 2000000
   },
   "movielensId": 172331,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-05-14",
      "dvdReleaseDate": null,
      "directors": ["David Gleeson"],
      "runtime": 89,
      "movieId": 172331,
      "title": "Cowboys & Angels",
      "mpaa": "R",
      "actors": [
         "Michael Legge",
         "Allen Leech",
         "Amy Shiels",
         "Sean Power"
      ],
      "imdbMovieId": "0377701",
      "originalTitle": "Cowboys & Angels",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story concerns a hapless civil servant who gets more than he bargained for when he moves into an apartment with a gay fashion student and finds himself on the catwalk. The film sets out to explore the difficulties for young people in keeping their identities in a fast moving culture of drugs and clubs.",
      "tmdbMovieId": 20148,
      "avgRating": 2.9,
      "releaseYear": "2003",
      "numRatings": 5,
      "posterPath": "/kIWj6s902aFOIZYZiKDGdjrVdcE.jpg"
   }
}