{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117880",
      "video": false,
      "title": "T2 3-D: Battle Across Time",
      "recommendations": [
         55998,
         62721,
         29361,
         71381,
         13442,
         38364,
         274388,
         57866,
         57889,
         31279,
         157414,
         63838,
         252034,
         32686,
         24553,
         166671,
         312100,
         80200,
         164502,
         314367
      ],
      "backdrop_path": "/dH3LT4qrEIiwYOerOWPsCx5GjNB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Terminator",
               "gender": 2,
               "credit_id": "52fe4711c3a368484e0b32a3",
               "name": "Arnold Schwarzenegger",
               "profile_path": "/zooXFWF1JtrV7UnZyGRxXDW11qt.jpg",
               "id": 1100,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah Connor",
               "gender": 1,
               "credit_id": "52fe4711c3a368484e0b32a7",
               "name": "Linda Hamilton",
               "profile_path": "/fcRpgjonpH3WmPs0V63g7iP7Dbm.jpg",
               "id": 2713,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "John Connor",
               "gender": 2,
               "credit_id": "52fe4711c3a368484e0b32ab",
               "name": "Edward Furlong",
               "profile_path": "/o7x6XcLSZSJygjYKLMcElEehmkr.jpg",
               "id": 820,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "T-1000",
               "gender": 2,
               "credit_id": "52fe4711c3a368484e0b32b5",
               "name": "Robert Patrick",
               "profile_path": "/dpUIbzLpExv69faSRyww8A4ydxf.jpg",
               "id": 418,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4711c3a368484e0b32b1",
            "name": "James Cameron",
            "profile_path": "/zy2foCd8PEtvCcsX48cROdQdDLB.jpg",
            "id": 2710,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 2.35848,
      "production_countries": [],
      "id": 65595,
      "vote_count": 29,
      "budget": 0,
      "overview": "Three freedom fighters attack a large corporation to prevent a future apocalypse.",
      "similar": [],
      "original_title": "T2 3-D: Battle Across Time",
      "runtime": 12,
      "poster_path": "/ltHTHogX11zY7XT0bIDEeUiQE0A.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "John Bruno",
         "James Cameron"
      ],
      "runtime": 12,
      "synopsis": null,
      "writers": [
         "Adam J. Bezark",
         "James Cameron"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117880/",
      "coverLink": null,
      "actors": [
         "Arnold Schwarzenegger",
         "Edward Furlong",
         "Linda Hamilton"
      ],
      "reviews": [
         "I'll never forget the first time I went on T2:3D in Universal Studios Florida. It was like nothing I've ever seen before. I went on it when it opened up a few years back. I've been on it once every year since. The sound in that theater is phenomenal and so are the meshing of 3-D Effects, Live Action, Lights, and Robots. When you see that motorcycle go in and out of the scene, and then mesh perfectly with the display on screen, your jaw will fall to the floor. The best part about it as well is that they actually brought in Arnold, Linda Hamilton, Ed Furlong, and Robert Patrick to reprise their roles. I wish the full version made it on the T2 DVD. Go to Universal FLA or CA and experience the attraction of a lifetime. It's just so incredible.",
         "This multimedia presentation is incredible and just great. If you love the Terminator movies, this is a real trip. You have to go to a Universal Studios park to see it, but it's just about worth it just to see this! The description says it's only 12 minutes, but with the live actor/animatronic presentation, and the Cyberdyne promotional film in the lobby, it's a good half hour. Go see it.",
         "Also the most expensive frame for frame too. This is a great experience overall. I especially liked the footage shown while you wait in line. It's full of references that foreshadow all the happenings of T-2. (\"Cyberdyne - We're taking over the world of communications!\") The effects are great, even if the story is a little contrived (Why bring John into the future anyway? He doesn't help any). The stage show blends perfectly with the on screen action. I've seen if four times and I still havent seen the transition. Definately worth the price od admission. Well, this and the Back to the Future Ride.",
         "James Cameron has brought to us once again, a quality piece of entertainment. Much like the previous films that carry the name of \"Terminator\", \"T2/3-D: Battle Across Time\" shows with every frame the quality that Cameron strives for: Perfection. Every detail is attended to: The aiming of a laser beam which seems to target YOU in the audience, the puff of dust as a mini-hunter passes over a concrete pillar, the drops of moisture as a polymimetic alloy creature melts and reforms, as well as a rush of air as a flying HK craft passes over you. From the preshow, where a hostess, 'perky' to your face, but backstabbing when she thinks she's being ignored, welcomes you; to the interruption of the show by John and Sarah Connor, in an attempt to prevent another Apocalypse brought on by Skynet, the entire show leaves the visitor leaving with the satisfaction that T2/3-D was well worth the (most of the time) short wait. Even when waiting in line, there are monitors showing \"Cyberdine\" sample shows. You may even see a Terminator identified through the monitor system. It's almost too bad this high quality show is only available at Universal Studios.",
         "I saw this \"movie\" at Universal Studios in Los Angeles and it was great. It is a mix between theater and cinema, double crossing with 3d effects, and the result was great. If was worth watching, only downside is that the audience get really wet at the end of the show. Why iam not going to tell you, you need to find out for yourself :-)",
         "This movie ROCKED!! Can't wait for Terminator 3? Then go see this one, it's the next best thing. Not only did they get the original actors to reprise their roles, they did it so convincingly these scenes could have been cut right out of T2. The 3D effect is incredible, causing viewers to duck as the T-1000 points his metallic blades right in your face and cringe as the T-1000000 explodes showering liquid metal (actually water) all over the audience. Besides the ultra-cool special effects, Arnold actually had some pretty good lines (after killing a cyborg T-800, \"he was my college roommate\"). This attraction alone is worth the price of admission to Universal Studios. Don't miss it!",
         "I'm one of those fans who hate it when sequels don't match their original stories, I want everything to fit together. But with this, I didn't care a bit! I didn't care that the terminator didn't arrive naked, I didn't care that somehow the characters were able go into the future, and I didn't care that this won't fit into any future sequels! This is pure fun, plain and simple. I just hope that someday someone finds a way to put this on video.",
         "A seamless integration of live action, cinematography and 3D film which left an entire audience ducking as robots fired across their heads, and attempting to find cover in the final explosive sequence. Unbeatable!",
         "Wow, you've never seen anything like it before at Universal Studios Florida. During my vacation to Orlando I love to go to U Escape and ride the movies. On this ride/shows you come face-to-face with the terminator himself. Not to menchan the T-1000 and the T-1000000. There are also little machines that fly and they have lasers on them and they're called mini-hunters. This is one of the best ride/shows I have been on. It goes up there with Twister, JAWS and Back to the Future. If you're gonna have a favorite ride USEcape then let it be T-2: 3D Battle Across Time!!!",
         "when i was at in LA some time ago. This was my favorite memory from the Universal theme park. it's very exciting & fun. I was sitting in the front row, the actors were running right by me. It was so cool. So if you ever are at Universal, this is a MUST SEE!!!",
         "I was presently surprised to find this on the IMDb, since the film is just a part of the overall experience - but I'm glad it's listed. Cameron shot the film section in 70mm, and in many ways it looks better than TERMINATOR 2: JUDGEMENT DAY. He's a perfectionist, and I think that's part of the reason why this is the best theme park attraction I've ever experienced, as well as a great short film. The 3-D aspect also has to be some of the best work done in that medium, and combining it with live stunt doubles onsite for the major characters is a stroke of genius. Even the dialog has sparkle. After seeing this a couple of years ago in L.A., it was clear that whatever lose ends or questions might have been left from the second movie were tied up here, and TERMINATOR 3 was only a continuation of the franchise (like many sequels) - certainly not the story. T2:3-D does take some plot thread liberties, but it's all forgivable considering the end result. I especially liked the setup piece you watch as you're waiting to go into the main attraction. There's a bit of the old mother - son chemistry here between Hamilton and Furlong, which is just more good direction from Cameron. We could have been given this setup information without a film piece, like many rides. But again, having the real actors involved in all film aspects sells the idea and gets us into the concept and universe quickly. I haven't bothered to see T3 and don't really plan to. This might be the only time a movie series story is not just continued, but completed, at a theme park attraction. BATTLE ACROSS TIME is the closure you're really looking for, from original TERMINATOR director / writer James Cameron and the T2 key crew.. And I think it's pretty much impossible to beat the new Terminator model we're given here. Just forget T3. When you're in LA or Florida, if you're a fan of the TERMINATOR at all, you owe it to yourself to check this out.",
         "\"T2 3-D: Battle Across Time is an amazing movie experience. It picks up right where \"Terminator 2\" left off. Imagine all the thrills, explosions,chases of \"Terminator 2\" on a big screen, by the end you will be gasping for breath and ready for another ride.",
         "I went into the theater at Universal Studios not knowing what to expect. I hoped it would not just be some stupid little presentation with things that were up in your face. Since it is 3-D, I thought they were going to focus more on putting things up close in your face rather than the actual effects. To my surprise, once the show started I was in awe and my mouth was open the whole time in interest. I wondered what would happen next. It was a combination of live action as well as 3-D. You can't take your eyes off it and you can't take your eyes off it (once it finally gets started). I thought the action was so good and it kept you interested. I would recommend this to anyone.",
         "From the queue to the end this attraction will captivate you! A high quality production all around. Best of all Arnold uses a whole new one-liner! Very few cheesy 3-d effects. If you go to Florida you must see this!",
         "i saw this at universal studios, and it was fantastic. it blends film and stage with great ingenuity, and the 3D platform is used to super effect. i normally remain calm during a movie, but wow, when those metallic creature's lance-like limbs and immense explosions headed my way in 3D i ducked and laughed and screamed. as did everyone else in the auditorium. this was a stellar performance.",
         "I was a fan of the movie, but I didn't really want to go on the ride. But my friend's dragged me into it when we went to Universal Studios Hollywood. I was never much of a fan of those 3-D attractions at any theme parks really, but this one blew me away. I don't want to give anything away, but my favorite part of this was when they 'blew' up the T-1000 and pieces of him were everywhere in front of you. It was really cool. Anyways, if you are planning to go to Universal Studios, SEE THIS!",
         "If only the average movie going experience could be this good! When going down to the Florida area just a few short years ago, nothing could've prepared my friends and I for what we would find at Universal Studios Florida!! This by far has to be the best movie / Terminator experience I ever had! If you are ever in the Walt Disney / Universal Studios area, YOU MUST CHECK THIS OUT! Special Effects, good story line, mystery and intrigue all make this is MUST SEE when there!",
         "I don't remember too much of this film. I remember that one of my sister's friend's brother had recommended \"Terminator 2: Jedgement Day.\" I said I would see it sometime. I don't remember too much about this film, except that it was similar to the war scene in the beginning of \"Terminator 2: Judgement Day.\" I also remember something with a 3-D skull popping out. Oh, and there was the part with the real counterparts of The Terminator and John Connor. (Actors dressed up like them and ran across the stage.) If you are a fan of \"The Terminator\" series, you will love this, no doubt. Note: You can find this at Universal Studios. Feel free to send me a Private Message regarding this comment.",
         "Make sure your glasses are clean! Very impressive mixture of film with live stage effects. Unlike most films of this format the 3-D effects are more subtle and realistic. The stage lighting, smoke effects and live actors are well synchronized with the film. The pre-show is actually entertaining and provides an important backstory. Since James Cameron was actually involved in this project we have not only the original performers from T-2 but the feel of that film. The climax has a great jolt for the audience!",
         "Possibly the best 3D so ever made! You either enter the Cyberdyne Systems building(or just outside of it if you are at USH) and go into a queue, with great AC, and stainless steel walls. It appears you are about to see a persentation for Cyberdyne, as they have TVs all over playing ads, and also news about the 'terrorist attacks' in 1991, but assure us that everything is OK. We then walk and pick up our safety visiors(3D glasses) and enter the Miles Dyson theater, we stand here for about 5 minutes till the preshow starts. We are joined by Kimberly Ducan a perky women with power, she tells how Cyberdyne is the best thing ever and shows us the most awesome preshow video ever! It's pretty much imagine a world where everything is perfect with Cyberdynes tech, but then the family of the future hacks into the system, yes it's the one and only Conners. Sarah warns us to run for our lives and kill everyone... OK minus the second part, they show us how evil Skynet is and all that jazz, we are then warned to get out of the building before they- then the video kicks back in. Of corse Kimberly tells us nothing to worry about and we go into the main theater which is HUGE! The show starts and we are introduced to the T-70s and they shoot at some targets, just when they are about to bring on the big Skynet project the Conners crash the show. Sarah starts shooting up a storm but then all of a sudden the T-1000 morphs off the wall as the Cyberdyne sign, kills Kimberly, and is also after to kill us all but then, it's him, the time portal opens and the Terminator in his bad ass self rushes in just in time in his mortal cycle and blast the T-1000 away long enough to grab John and run back to the future(another good movie and ride BTW) a chase starts but luckily they get away, then out of the sky our heroes are chased by a HK. The are blown off the chopper, and just when we think we're safe it seems Skynet has an ace up it's sleve with the mini hunters. The HK drops 4 mini hunters, these little guys pack a lot of punch after running out of ammo our robot hero uses his gun as a bat, snatches the other and crush it. Once again we forget there is no safety in the Skynet future, as an endo blast through the wall and just as he is about to kill little Johnny boy, the T-800 uses the crushed mini hunter and slices off his head. John asks if it's a friend of his, and jokingly Aronld replies \"he was my college roommate.\" John and the Terminator are on the run and enter they skynet building, where the mission is to end as the plan is to blow up the CPU, the only problem is the T-1,000,000 a spider like verion of the T-1,000 after freezing it it's blown away, John goes back in time as the Termintor uses bombs to destroy the CPU and the theater gets filled to fog and the seats do a slam down, John and Sarah are reunited and the future is safe for now, the terminator music kicks in and we exit to the left. If you stay you can see the huge Cyberdyne desk reset it's self.",
         "This 3-D ride based on the terminator experience is possibly the most well thought out and most creative ride I have ever been on. I couldn't believe all the cool aspects of the ride you can experience but its all there. A 3-D experience that you probably have never experienced before, live action that is happening all around you, guns being shot on stage, huge terminator's on either side and than the big ending. There's nothing else like it!!! I give it * * * * out of * * * * Also Recommend (Rides): Back to the Future, Men in Black, Twister Also Recommend (Movies): Terminator, Terminator 2",
         "I may be the first person on this notice board to see this in Japan! Go me! I saw T2/3-D on August 1st 2001 at the New Universal Studios Japan, Osaka. Even the fact that it was dubbed (and I couldn't understand it all) couldn't detract from my excitement and enjoyment of this fantastic show. The use of look-alike live action actors (combined with pre-shot film of the original actors) and the 3-D movie itself was mindblowing - especially when the characters run by close enough for you to touch them! And the set-up at the beginning by the publicly charming but frantically horrified employee during the first film - the Cyberdyne Promotion - is enough to make you laugh hilariously. I swear that your day will not be complete without seeing this. Congratulations to everyone involved, including the management at USJ, who kept the lines so delightfully short!",
         "My family and I had the great fortune to visit T2 3-D: Battle Across Time at Universal Studios in August 2000. English TV had aired a short documentary-styled piece a few years ago when the attraction was about to go live. It looked great then, but the actual visit just blew us away - it was far and away better than we could ever have expected. If you get the chance to see it, make sure you don't miss it. Brilliant!!",
         "I have been to Universal studios Orlando 2 times and have gone to experience this both times, and i plan to go again soon. this is by far the best 3-D i have ever seen.. no bi-color glasses that make everything look funny. if you are thinking about visiting Universal studios, this alone justifies going!",
         "This is a really \"must\" see movie experience. If you ever come to Hollywood, Florida or Osaka (200*) don't forget to see the 30 minute 3D-Experience Terminator 2 - Battle Across Time. Imagine you are traveling \"with\" Arnold and Edward Furlong through time to fight side by side against Skynet. Live action with real actors in the theater and a massive 3D movie on \"three\" (!) screens will blow you away. Don't miss this!"
      ],
      "genres": [
         "Action",
         "Short",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Landmark Entertainment Group",
         "Lightstorm Entertainment",
         "MCA Planning and Development"
      ],
      "summaries": [
         "In the year 2029, a computer called Skynet is fighting against a human resistance, after having nearly destroyed the rest of humanity in 1997. Skynet has found a way to send some of it's warriors, called Terminators, back in time. This is the story of the Terminator sent to kill the resistance leader in 1996. The resistance sends a reprogrammed Terminator back to 1996 to protect the young man, and the two end up traveling to the year 2029. The question is, can the future resistance leader and the Terminator defeat another new Terminator while destroying Skynet in the future?",
         "Presented as an attraction at the Universal Theme Park (Summer 1996), T2:3-D invites the audience to a presentation of future technology by the Cyberdyne Corporation; creators of the present T-800 Terminators and future creator of Skynet. Unfortunately, half-way through the presentation, they are sabotaged (live) by Sarah and John Connor, who inform us of the future doom Cyberdyne will unknowingly bring to the world. The audience is soon joined by the T-1000 as well as Arnold's T-800 on stage via motorcycle. The T-101 grabs John and exits the stage via a 3-D time portal and quickly pursued by the T-1000. From there it is all 3-D movie magic in which the T-8000 and John Connor must defeat Skynet which is guarded by the powerful T-1M (T-One Million).",
         "Three freedom fighters attack a large corporation to prevent a future apocalypse."
      ],
      "budget": 60000000
   },
   "movielensId": 172497,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": null,
      "directors": ["James Cameron"],
      "runtime": 12,
      "movieId": 172497,
      "title": "T2 3-D: Battle Across Time",
      "mpaa": "PG-13",
      "actors": [
         "Arnold Schwarzenegger",
         "Linda Hamilton",
         "Edward Furlong",
         "Robert Patrick"
      ],
      "imdbMovieId": "0117880",
      "originalTitle": "T2 3-D: Battle Across Time",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Three freedom fighters attack a large corporation to prevent a future apocalypse.",
      "tmdbMovieId": 65595,
      "avgRating": 3.5625,
      "releaseYear": "1996",
      "numRatings": 8,
      "posterPath": "/yYJjTL79Wqr1lltET7iKxE0ykP3.jpg"
   }
}