{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0119052",
      "video": false,
      "title": "The Education of Little Tree",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Little Tree",
               "gender": 2,
               "credit_id": "52fe467cc3a368484e093383",
               "name": "Joseph Ashton",
               "profile_path": "/gqYsCiW2HtHVjzopA3nPs0YYLED.jpg",
               "id": 24525,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Nonno",
               "gender": 2,
               "credit_id": "52fe467cc3a368484e093393",
               "name": "James Cromwell",
               "profile_path": "/f9HU6zS2K2DCRt2WoJBK61ElqPJ.jpg",
               "id": 2505,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Nonna",
               "gender": 1,
               "credit_id": "544602c3c3a36836d4000fdb",
               "name": "Tantoo Cardinal",
               "profile_path": "/pWQi9e8gUGdie0ZFWdcQtUpUQRw.jpg",
               "id": 7863,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Willow John",
               "gender": 2,
               "credit_id": "52fe467cc3a368484e09339b",
               "name": "Graham Greene",
               "profile_path": "/2FxWI8Lv5Y2Qx0rxIynULlxLiF2.jpg",
               "id": 6804,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e093389",
               "name": "Richard Friedenberg",
               "profile_path": "/bwRdv7cx2PvsynbKZ6YjYCn18bI.jpg",
               "id": 4137,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe467cc3a368484e09338f",
               "name": "Forrest Carter ",
               "profile_path": null,
               "id": 235255,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e0933a1",
               "name": "Earl Hamner, Jr.",
               "profile_path": null,
               "id": 61479,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe467cc3a368484e0933a7",
               "name": "Don Sipes",
               "profile_path": null,
               "id": 1209468,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e0933ad",
               "name": "Richard Friedenberg",
               "profile_path": "/bwRdv7cx2PvsynbKZ6YjYCn18bI.jpg",
               "id": 4137,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e0933b3",
               "name": "Jake Eberts",
               "profile_path": null,
               "id": 2359,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e0933b9",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e0933bf",
               "name": "Anastas N. Michos",
               "profile_path": null,
               "id": 19464,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe467cc3a368484e0933c5",
               "name": "Jere Huggins",
               "profile_path": null,
               "id": 48807,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e0933cb",
               "name": "Wayne Wahrman",
               "profile_path": null,
               "id": 10957,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe467cc3a368484e0933d1",
               "name": "Dan Bishop",
               "profile_path": null,
               "id": 957258,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe467cc3a368484e0933d7",
               "name": "Peter Stratford",
               "profile_path": null,
               "id": 217995,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.413375,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 62394,
      "vote_count": 2,
      "budget": 0,
      "overview": "Little Tree is an 8-year-old Cherokee boy, who, during the time of the depression, loses his parents and starts to live with his Indian grandma and grandpa and learn the wisdom of the Cherokee way of life.",
      "similar": [],
      "original_title": "The Education of Little Tree",
      "runtime": 115,
      "poster_path": "/cBJCiV56y5i5kEWZw1vXf2QYuFM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Allied Films",
            "id": 16977,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lightmotive",
            "id": 16978,
            "origin_country": ""
         }
      ],
      "release_date": "1997-12-25",
      "vote_average": 9,
      "belongs_to_collection": null,
      "tagline": "A boy of two worlds must learn to be his own man.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Friedenberg"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "Forrest Carter",
         "Earl Hamner Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119052/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0MDE3NzcyOF5BMl5BanBnXkFtZTcwNDc5ODUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: James Cromwell, Joseph Ashton, Tantoo Cardinal | See full cast and crew »"],
      "reviews": [
         "Despite comments that the author of the book from which this film comes may have had racist tendencies the tale sets out to show the prejudices in us all. The actors, particularly, Joseph Ashton (Little Tree) are adorable as if they are right out of a patchwork quilt. I don't mean to diminish the impact of this film by that comment. James Cromwell and Tantoo Cardinal as the grandparents set out to bring up the young by letting him learn by his own mistakes. The State, as always, has to interfere and its perhaps here that the boy's education really begins. The Appallachan scenery is jaw dropping and adds to the atmosphere that pervades from start to finish. THis a story to curl up with on the sofa on a cold, wet afternoon. It pulls at your heart strings and also has you smiling at tender moments. There is even one great belly laughing scene. I first saw this on U.K. TV and immediately ordered it on video. It's certainly in my top ten films of all time.",
         "a very touching journey of a little indian boy to discover his place in the world.This is a perfect movie without pretense ,political correctness just the way life is ... I recommend this movie to anyone big or small you will not be disapointed. we see simple people leading simple life with their own laws and rules often viewed \"immoral\" by others and the law. This is one of the aspects movie that I really liked ,way it`s show that many of the \"laws\" society imposes on us are merciless ,unjust and have no basis in reality of people forced upon.",
         "I have just finished watching the Education of Little Tree. I have to say it was a rare and magical film. It is a very simple story, that had me fixed to the screen. The acting is fluid and easy to watch, especially Joseph Ashton, who for someone so young, was just so real in the part of Little Tree. The photography was great, and had an almost dream like quality. A film that I am so glad to have seen.",
         "It is too bad that movies like this are not more widely publicized and seen. This movie has far more redeeming qualities and is better for the soul and heart than any blood and gore action packed swear and nudity fest flick. I would even go one better and recommend the book, because although the movie is fairly true the book has alot more that cannot be covered in a 2 hr movie. The actors are very good, Graeme Green is wonderful as always. This movie should be nominated for an Oscar, but of course it won't because stories about Native Americans are not nominated, or seen by the movie going public.",
         "My husband had told me about this movie for years, and when he rented it I was skeptical, at best since he's not known for his taste in films, television, or music. The movie takes place in the Applachian Mountains where I live. It's almost the story of my husband's family, they are a mix of Blackfoot, Crow, Cherokee, and several other tribes. After seeing the film, I truly understand what they've had to endure over the years. It also makes me think of the crimes that people commit on other people, all in the name of making a group \"fit in\". The young boy, \"Little Tree\" did not ask to be born into a family who has both white and Cherokee parents. In the 1920's this was a crime that was beyond forgiveness. The grandparents are also a \"mixed\" couple, they raise the boy and he is wise beyond his years thanks to them! This move will make you cry, laugh, think, and rejoice. I have to say, that it's even better than MY all time favorite, The Wizard Of Oz! RENT IT, BUY IT, LOVE IT!!!!! THE very best movie I've seen in years!!!!! P.S. Have PLENTY of tissue on hand!!!",
         "I first saw this movie when it was on cable while i was doing something else, but i was soon riveted to the screen. And have since watched it twice more. Don't know about the book but this is a powerful film, although i am not quite sure why. Maybe because it tells the story from such a different perspective than most of us tend to look at things. This movie has no big stars or recognizable (to me) faces but many memorable scenes, especially the one with the little boy and girl. Definitely worth watching.",
         "I found this film to be very accurate in that life for Native kids was extremely harsh in those days. It was just too disheartening for them who weren't allowed to speak their own language, practice their traditional ways, at the schools, in front of the teachers, not even when they were all alone sleeping in their dorms! Even if they were caught whispering in their own language in the dorms at night, that earned them the strap. Go figure! It was REALLY THAT BAD!! The biggest question will always remain ...... why the hell were the oppressors so afraid of Native folks and their ways?? Was it so bad for Natives to simply just live their lives in peace without being hassled all the time by white people?!?! I think this is some kind of curse against the First Nations! No other race on Earth has the kind of problems that Native people have thanks to you know who! Trust me when I say this .... no joking here.... I don't think this curse will ever go away in our lifetimes. Who knows if it'll EVER go away! But.... ANYWAYS..... that's my scoop on this film and why I gave it a 7 out of 10.",
         "I thought this movie was beautiful and moving. Fantastic acting by James Cromwell and Tantoo Cardinal. I think the movie got lost amongst the big studio dribble. Too bad. There should be more movies like this.",
         "It is 1935 in the mining town of Jericho City, Tennessee. Little Tree (Joseph Ashton) lost his mother a year after his father died in the Army. His grandparents (James Cromwell, Tantoo Cardinal) take him away from his white trash Aunt Martha into their mountain home. They live an Indian life. He makes moonshine whiskey with his good friend Cherokee Willow John (Graham Greene). Little Tree befriends a little girl (Mika Boorem). They face discrimination from the powerful and racism from everybody. Eventually the authorities force Little Tree into a residential school where they rename him Joshua. It is a little distressing to find out the authorship of the book. However I can't actually find any deliberate racism in the movie. It's a fine little movie but not that compelling. The little kid is fine. Cromwell is great as always. It's about their relationship and it's a nice little story about that.",
         "Seriously one of the best movies I've seen, the storyline the acting work well with each other and the scenery enhances the viewers experience, although the movie may have some backlash about the author, it should not ruin or degrade this movie. The story of one boy finding his sense of belonging through family and heritage. Its a great movie filled with tears, laughter, education and many more. I recommend watching it at least once by yourself as there is a lot to take in and to think about, one can reflect on his/her own life while watching it, although I'd recommend a certain age limit as there is need of a much wider understand and perspective which can only be seen through maturity and knowledge. Nevertheless a great movie to enjoy with family and friends."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Allied Films",
         "Lightmotive"
      ],
      "summaries": [
         "Little Tree is an 8-year-old Cherokee boy, who, during the time of the depression, loses his parents and starts to live with his Indian grandma and grandpa and learn the wisdom of the Cherokee way of life.",
         "Eight year old Little Tree lives in depression-era America. After his parents pass away, he goes to live with his grandparents in the rugged country side. There he is taught by them, as well as by Willow John, the Cherokee way of life. The history of how the Caucasians settlers first befriended them, then using the army forcibly took over their lands, forced them to re-locate resulting in many deaths. When the state's social services finds out that Little Tree is not attending school and is assisting his grandfather in selling liquor, they compel him to re-locate to an oppressive state run school, where things take a turn for the worse."
      ],
      "budget": 0
   },
   "movielensId": 1725,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-12-25",
      "dvdReleaseDate": "2002-03-12",
      "directors": ["Richard Friedenberg"],
      "runtime": 115,
      "movieId": 1725,
      "title": "The Education of Little Tree",
      "mpaa": "PG",
      "actors": [
         "Joseph Ashton",
         "James Cromwell",
         "Tantoo Cardinal",
         "Graham Greene"
      ],
      "imdbMovieId": "0119052",
      "originalTitle": "The Education of Little Tree",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Little Tree is an 8-year-old Cherokee boy, who, during the time of the depression, loses his parents and starts to live with his Indian grandma and grandpa and learn the wisdom of the Cherokee way of life.",
      "tmdbMovieId": 62394,
      "avgRating": 3.51582,
      "releaseYear": "1997",
      "numRatings": 158,
      "posterPath": "/cBJCiV56y5i5kEWZw1vXf2QYuFM.jpg"
   }
}