{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0209074",
      "video": false,
      "title": "Karlson Returns",
      "recommendations": [
         77762,
         127608,
         273202,
         81604,
         160046,
         77304,
         85035,
         36163,
         79853,
         77759,
         213321,
         67467,
         129229,
         72204,
         36162,
         72093,
         77294,
         79702,
         227998,
         36161
      ],
      "backdrop_path": "/oThyPpF8PCaxKKwUC3b1nxCRAD3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1006,
               "character": "Karlson (voice)",
               "gender": 2,
               "credit_id": "52fe485ec3a368484e0f5331",
               "name": "Vasiliy Livanov",
               "profile_path": "/eo4MRCTUcvq0IWfab64d7jw0V8H.jpg",
               "id": 1082610,
               "order": 0
            },
            {
               "cast_id": 1005,
               "character": "Junior [Malysh] (voice)",
               "gender": 1,
               "credit_id": "52fe485ec3a368484e0f532d",
               "name": "Klara Rumyanova",
               "profile_path": "/y8q4alTmW89uA2PsCbRoQyyqgdw.jpg",
               "id": 565312,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Freken Bok (voice)",
               "gender": 1,
               "credit_id": "52fe485ec3a368484e0f5329",
               "name": "Faina Ranevskaya",
               "profile_path": "/nAaTt8dZ5DpFv0ER6jO1Z3QTzhB.jpg",
               "id": 128301,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe485ec3a368484e0f5319",
               "name": "Boris Stepantsev",
               "profile_path": null,
               "id": 565310,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe485ec3a368484e0f531f",
               "name": "Boris Larin",
               "profile_path": null,
               "id": 565311,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "54b5376f925141746c0083cb",
               "name": "Astrid Lindgren",
               "profile_path": "/dArfGXX1aZnH1ZKXInDkWFLC7db.jpg",
               "id": 3850,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.160857,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 72203,
      "vote_count": 16,
      "budget": 0,
      "overview": "No movie overview available.",
      "similar": [],
      "original_title": "Карлсон вернулся",
      "runtime": 20,
      "poster_path": "/jQdA90RYOrPRkp1BBeQT3etPhMY.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Soyuzmultfilm",
         "id": 14599,
         "origin_country": ""
      }],
      "release_date": "1970-01-01",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/7aSJ3ufbWC0Ov3z1uDNeImi2ci0.jpg",
         "name": "Karlson Collection",
         "id": 158814,
         "poster_path": "/htmFn4SvmrAXjidvS4hrkmKxp28.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Boris Stepantsev"],
      "runtime": 20,
      "synopsis": null,
      "writers": [
         "Boris Larin",
         "Astrid Lindgren"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0209074/",
      "coverLink": null,
      "actors": [
         "Faina Ranevskaya",
         "Vasiliy Livanov",
         "Klara Rumyanova"
      ],
      "reviews": [
         "First of all I should say that the source material - Lindgren's book \"Karlson who lives on the roof\" was an instant success in the USSR. My childhood friends shared the book gave them many joy and good laughs over the story of Malysh and Karlson as a family reader. So the cartoon creator's super-task was to be at least on par with the book. You have to understand that Soviet movie and cartoon industry had one brilliant rule - no franchise, no serials. So the film director had to create maximum three 20 minutes parts from the source material of one week reader. Which should not replace the book, but rather work well as a teaser to the book, incite kids to read the book by presenting appealing cartoon's impersonifications of main heroes and events - the task which was solved brilliantly. First of all I love the painting: very distinctive intense colorful animated figures over water-color, pastel, air brush backgrounds, create a right world of a kid where the settings are secondary, and figures of papa, mama, brothers, sisters are primary. The family and house atmosphere is recreated so right, that it seems you can feel the street breeze from the wide open window in Malysh room, or the aroma of Freken Bock's freshly cooked buns. Second I love the absolutely persuading characters: busy and tired papa, wishing to avoid messing with kids, loving and hard-working mama, Malysh surrounded by family but still lonely as in desert, Freken Bock, a hired baby-sitter with unrealized aspirations in life, doing baby-siting not because of love to kids, and Karlson, a strange aero-mobile fat-man from outside the human society, and still very sociable, who seems to be the only character interested in peer-to-peer communication with Malysh. Still it is not very clear whether Karslon does this because he is just a jam and sweets addict or because he really cherishes friendship with the kid, but that's an important part of the friendship story. Third I love the dubbing and the dialogues - the supplier of the catchphrases, like Karlson's \"And we are larking about some buns here\" - a funny catchphrase to hide one's awkwardness, or Freken Bock's \"And I go crazy. What a pity.\" Also the pitch of antagonism between Karslon and Frecken Bock is lowered, and finally Bock gets to like Karlson, because little fat-man hits right with the middle-age lonely woman's soul strings as a \"Terrific man in prime of his life\". There is no songs in the cartoo, but music is right along with animation and dialogues, just to remember Karlson strolling outside of wardrobe in huge furcoat as the \"Vdol to Piterskoi, po Tverskoi Yamskoi\" (old Russian song) plays. The Soviet Karlson shall be preferred over any franchise, especially over Hollywood type franchise. Watching the parts you will receive aesthetic pleasure and plunge into the original book world what will stimulate book's reading.",
         "\"Karlson vernulsya\" or \"Karlson Returns\" is as the title already says the second from a duology of animated Russian short films. It runs for slightly under 20 minutes, so basically the same as the first. Animation style, humour and storytelling are also similar. There seems to be an antagonist early on, a cleaning woman at Karlson's house, but the longer the film continues, the more it becomes obvious that she is not evil at all. And in the end, she is pretty likable in fact. I guess this combination of Soviet animation and Swedish literature (Astrid Lindgren) was not a success: First of all, the animation is basically on a level that was done in the United States more than a decade earlier already. Yes you can go and say it is retro, but I personally did not like it and it is nowhere near to the Cheburashka tales from the same time (around 1970) for example. The story is okay, but this is mostly due to the good base material and I cannot really credit Stepantsev or Larin for that. There are flaws actually when it comes to taking a closer look at details etc., so the execution was certainly a bit shoddy here. It baffles me that this is considered one of the best from the Golden Age of Soviet Animation and the IMDb rating is also way over the top and not realistic. I give it a thumbs down. Not recommended."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Soyuzmultfilm"],
      "summaries": ["A not-so-friendly babysitter/housekeeper turns Malysh's home upside down. His imaginary friend Karlson comes back when he needs him most."],
      "budget": 0
   },
   "movielensId": 172585,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1970-01-01",
      "dvdReleaseDate": null,
      "directors": ["Boris Stepantsev"],
      "runtime": 20,
      "movieId": 172585,
      "title": "Karlson Returns",
      "mpaa": "",
      "actors": [
         "Vasiliy Livanov",
         "Klara Rumyanova",
         "Faina Ranevskaya"
      ],
      "imdbMovieId": "0209074",
      "originalTitle": "Карлсон вернулся",
      "genres": [
         "Adventure",
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "No movie overview available.",
      "tmdbMovieId": 72203,
      "avgRating": 3.68627,
      "releaseYear": "1970",
      "numRatings": 51,
      "posterPath": "/jQdA90RYOrPRkp1BBeQT3etPhMY.jpg"
   }
}