{
   "tmdb": {
      "original_language": "da",
      "keywords": [],
      "imdb_id": "tt2040565",
      "video": false,
      "title": "The Saga of Biorn",
      "recommendations": [
         283146,
         129979,
         86731,
         142196,
         100356,
         272423,
         52276,
         144425,
         67593,
         39887,
         83775,
         90040,
         108949,
         100393,
         40144,
         115893,
         51892,
         110760,
         100299,
         68986
      ],
      "backdrop_path": "/g88deWzRZX6ynXx671ujViR8z2U.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1000,
            "character": "Narrator",
            "gender": 0,
            "credit_id": "52fe49b49251416c750d0a2f",
            "name": "Phillip Sacramento",
            "profile_path": null,
            "id": 1009376,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49b49251416c750d0a35",
               "name": "Mathias Winum",
               "profile_path": null,
               "id": 1009377,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b49251416c750d0a3b",
               "name": "Patrick Voetberg",
               "profile_path": null,
               "id": 1009378,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b49251416c750d0a41",
               "name": "Jesper Aagaard Jensen",
               "profile_path": null,
               "id": 1009379,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b49251416c750d0a47",
               "name": "Thomas Arent",
               "profile_path": null,
               "id": 1009380,
               "department": "Sound",
               "job": "Sound mixer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b49251416c750d0a4d",
               "name": "Frederik Valentin Bjerre-Poulsen",
               "profile_path": null,
               "id": 1009382,
               "department": "Crew",
               "job": "Technical Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b49251416c750d0a53",
               "name": "Pernille Ørum-Nielsen",
               "profile_path": null,
               "id": 1009383,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "559030ae925141338e000e79",
               "name": "Frederik Valentin Bjerre-Poulsen",
               "profile_path": null,
               "id": 1009382,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.593859,
      "production_countries": [],
      "id": 96458,
      "vote_count": 9,
      "budget": 0,
      "overview": "An old Viking is determined to reach Valhalla, the warrior's afterlife full of excessive drinking and debauchery. To gain entry he has to die honorably in battle, but he discovers that the right death isn't so easy.",
      "similar": [
         21385,
         10527,
         81003,
         383498,
         74643,
         568,
         37724,
         91314,
         87421,
         56292,
         54138,
         52520,
         75612,
         19,
         101299,
         68726,
         157336,
         271110,
         140607,
         597
      ],
      "original_title": "The Saga of Biorn",
      "runtime": 7,
      "poster_path": "/pEsJOYURnMgeaASRlIOLVDqtMdC.jpg",
      "spoken_languages": [
         {
            "name": "Dansk",
            "iso_639_1": "da"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "2011-02-18",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 7,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Danish",
      "imdbLink": "http://www.imdb.com/title/tt2040565/",
      "coverLink": null,
      "actors": [
         "Phillip Sacramento",
         "Alberte Thorning Agerskov",
         "Jack E. Sovtar"
      ],
      "reviews": [
         "This animated short has a very unique style, a hybrid of 3D and cel shading that lends a idiosyncratic aesthetic to the whole affair. The storyline is simple, an aged viking wants to get into Valhalla (or as they refer to it \"Valhöll\") so he has to die in battle. Unfortunately it seems that it is more difficult to die in battle than one would expect. The aged viking encounters a variety of characters on his adventure, many of whom seem to be more dangerous than they actually turn out to be. His desire to die gloriously in battle continues to elude him. Humorous, with an enjoyable ending, this short is recommended!",
         "\"The Saga of Biorn\" is a Danish, English-language short film from five years ago. One of the people who worked on it and who also got an award for his work here is Benjamin Kousholt. It is the story of an old Viking, who wants to die in battle, so he will get to viking paradise. And he approaches all kinds of (not so) scary enemies to oppose him, so his last wish will come true. But the fact that he wins all these battle through coincidence and without having to do anything shows that this is really a comedy film. Oh yeah and it is animation of course. I for once liked the animation style of the landscapes and the characters which made it a pretty enjoyable watch. And the runtime was also perfect, so that the film did not drag. It's only worth seeing for the comedy and there is no real major significance to this little film, but it's good for what it is and that's why I recommend the watch. Thumbs up.",
         "I love this, I think it's a great short animation that's a real little blast to watch. The humour, the awesome action, it reminded me very much of what you'd get in an episode of the fantastic animated series \"Samurai Jack\", it had just the same terrific balance of those kinds of elements. It's really funny as you see all that befalls poor old \"Biorn\", an aged but still mighty Viking warrior past his prime(could've fooled me!)who is trying to die an honourable death by the warrior's code, but who just for the life of him(!) can't seem to lose as he faces one buffoon after another who manage to do themselves in through a series of hilariously unfortunate accidents - he could probably have beaten them all in hand-to-hand combat, but you never get to find out! He does eventually get his chance when he comes across a convent of nuns that is being assailed by a ferocious bloated giant who is gobbling up the helpless ladies, as well as using them like projectiles against Biorn while he's battling him! And I really enjoyed that part, the giant looks pretty cool and there's a lot of funny chaotic action going on everywhere. Anyway Biorn finally gets his death-wish when the giant impales him with a spear that had been stuck in its head, and he manages to put its eye out and fend it off before he goes, and then cometh the big comedic twist of fate... Biorn, in the afterlife, is ascending the long stairs that will lead him up to glorious Valhalla, which just in case you were unaware, is the Viking Norse version of Heaven, he's becoming joyously laden with fabulous blades of all kinds, but then meanwhile back on Earth..the very well-meaning nuns who are only showing their gratitude to the noble warrior who saved them from the beast, decide to honour him by burying him in hallowed ground with a Christian tombstone, which promptly switches gallant hearty Valhalla, into a meek and peaceful angels and fluffy clouds classic Heaven, which is a nightmare for Biorn as it's merely another of his own culture's version of hell, and he screams out in frustrated misery at the beautiful bars of his eternal 'prison!' That poor guy! I can positively think of nothing more fitting to say than, some folks just can't catch a break! And then it ends. Excellent stuff, I loved it, just jolly great animated fun and well worth seeing anytime!"
      ],
      "genres": [
         "Animation",
         "Short",
         "Action",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": ["Animation Workshop"],
      "summaries": [
         "A battle-scarred ageing Viking warrior is determined to have an honourable death on the battlefield, thirsting to reach the home of all warriors who died gloriously in combat: the mystical Valhalla. So, without delay, the mighty warrior attempts desperately to enter into conflict, nevertheless, fate seems to have other plans for him. Is all hope lost?",
         "An old Viking is determined to reach Valhalla, the warrior's afterlife full of excessive drinking and debauchery. To gain entry he has to die honorably in battle, but he discovers that the right death isn't so easy."
      ],
      "budget": 0
   },
   "movielensId": 172609,
   "movielens": {
      "languages": [
         "Dansk",
         "English"
      ],
      "releaseDate": "2011-02-18",
      "dvdReleaseDate": null,
      "directors": ["Frederik Valentin Bjerre-Poulsen"],
      "runtime": 7,
      "movieId": 172609,
      "title": "The Saga of Biorn",
      "mpaa": null,
      "actors": ["Phillip Sacramento"],
      "imdbMovieId": "2040565",
      "originalTitle": "The Saga of Biorn",
      "genres": [
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An old Viking is determined to reach Valhalla, the warrior's afterlife full of excessive drinking and debauchery. To gain entry he has to die honorably in battle, but he discovers that the right death isn't so easy.",
      "tmdbMovieId": 96458,
      "avgRating": 3.81818,
      "releaseYear": "2011",
      "numRatings": 11,
      "posterPath": "/pEsJOYURnMgeaASRlIOLVDqtMdC.jpg"
   }
}