{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0117338",
      "video": false,
      "title": "Picnic",
      "recommendations": [
         144580,
         39056,
         31140,
         41104,
         71434,
         259233,
         26146,
         19398,
         77133,
         86531,
         27245,
         28638,
         135832,
         46874,
         58700,
         27337,
         56362,
         222671,
         79133,
         24613
      ],
      "backdrop_path": "/84EY4zUEOCVf6k9pHSomI89V59r.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tsumuji",
               "gender": 2,
               "credit_id": "52fe45a9c3a36847f80d3783",
               "name": "Tadanobu Asano",
               "profile_path": "/zlZsST8s1Apm6D6bCyYeWrCKZCy.jpg",
               "id": 13275,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Coco",
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d3787",
               "name": "Chara",
               "profile_path": "/59ELOtL7S5tAW3KW30YhwmXZjSO.jpg",
               "id": 55782,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Satoru",
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d378b",
               "name": "Koichi Hashizume",
               "profile_path": null,
               "id": 124937,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Head Nurse",
               "gender": 2,
               "credit_id": "52fe45a9c3a36847f80d378f",
               "name": "Naomasa Musaka",
               "profile_path": "/sqqaE4q48HDbQ9CsFCJBtqhuI2i.jpg",
               "id": 133886,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d3793",
               "name": "Fujiko Yamamoto",
               "profile_path": "/9Yibp5YmxA84ZQNKC8jznKjQTdG.jpg",
               "id": 97209,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Coco's Mother",
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d3797",
               "name": "Shifumi Yamaguichi",
               "profile_path": null,
               "id": 1279794,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Coco's Father",
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d379b",
               "name": "Takaaki Kabuto",
               "profile_path": null,
               "id": 1279795,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d379f",
               "name": "Kazue Itô",
               "profile_path": null,
               "id": 1279796,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Pastor",
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d37a3",
               "name": "Keiichi Suzuki",
               "profile_path": null,
               "id": 3436,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a9c3a36847f80d377f",
               "name": "Shunji Iwai",
               "profile_path": "/tidlYgRReWLjzyvX9YmMVkUTmsM.jpg",
               "id": 55785,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a9c3a36847f80d37a9",
               "name": "Shunji Iwai",
               "profile_path": "/tidlYgRReWLjzyvX9YmMVkUTmsM.jpg",
               "id": 55785,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d37af",
               "name": "Juichi Horiguchi",
               "profile_path": null,
               "id": 1279797,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d37b5",
               "name": "Akio Nanjo",
               "profile_path": null,
               "id": 1279798,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d37bb",
               "name": "Susumu Tanaka",
               "profile_path": null,
               "id": 1279799,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45a9c3a36847f80d37c1",
               "name": "Reimy",
               "profile_path": null,
               "id": 1279800,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d37c7",
               "name": "Noboru Shinoda",
               "profile_path": null,
               "id": 55787,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a9c3a36847f80d37cd",
               "name": "Shunji Iwai",
               "profile_path": "/tidlYgRReWLjzyvX9YmMVkUTmsM.jpg",
               "id": 55785,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a9c3a36847f80d37d3",
               "name": "Toshihiko Kojima",
               "profile_path": null,
               "id": 1248272,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.112209,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 40886,
      "vote_count": 15,
      "budget": 0,
      "overview": "Believing that the world will end that very day, three mental patients Coco, Tsumuji, and Satoru set out upon a journey. Walking upon the tops of the walls of the city, they seek to find a picnic spot with the best vantage point to view the final event.",
      "similar": [],
      "original_title": "PiCNiC",
      "runtime": 72,
      "poster_path": "/qTYvLoQnIA6BfSeDG93fZwcWQ2g.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fuji Television Network",
            "id": 3341,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "PONY CANYON",
            "id": 15309,
            "origin_country": ""
         }
      ],
      "release_date": "1996-06-15",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shunji Iwai"],
      "runtime": 72,
      "synopsis": null,
      "writers": ["Shunji Iwai"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0117338/",
      "coverLink": null,
      "actors": [
         "Chara",
         "Tadanobu Asano",
         "Koichi Hashizume"
      ],
      "reviews": [
         "Director: Iwai Shunji Duration: 72 minutes Iwai Shunji is a fascinating director. He is able to hold the viewer's interest during films that last for over two hours, and can also engross the viewer in an emotionally intense film that lasts only 47 minutes. I have thoroughly enjoyed _All About Lily Chou Chou_, _Love Letter_, _April Story_, and _Undo_, so I was looking quite forward to viewing _Picnic_. Also, being a huge fan of Asano Tadanobu, I was looking forward to watching one of his earlier films. I was definitely not disappointed. _Picnic_ focuses on the lives of three mental patients: Coco, played by Chara, Tsumuji, played by Asano Tadanobu, and Satoru, played by Koichi Hashizume. Each individual has their own personal demons and suffer not only mental torment, but also are mistreated by the nurses. Their only solace is to walk along the wall of the asylum and view the world they are hidden from. The only person on the outside who is moderately kind to them is a Catholic Priest who gives Tsumuji a bible. Tsumuji reads the bible and is comforted by the fact that the world is soon going to come to an end on July 10th of that year. He was actually looking at the date the book was first published. The three friends decided to pass the walls of the asylum on that day and welcome in the destruction of the earth with a picnic. This is a great little film. Not being a fan of Japanese pop music my only knowledge concerning the singer Chara are the facts that she is married to Asano Tadanobu and that she has acted in two of Iwai Shunji's films, the one I am writing on here and _Swallowtail_. However, I think that she did a fine job of acting, and the times in which she is racked by mental torment are quite moving. Asano Tadanobu's acting is extraordinary. I felt my heart tightening when he reveals his darkest secrets to Coco. Great film. Check it out!",
         "This work by Iwai Shunji shows the strengths of the short film genre. Valuing atmosphere and cinematics as much as plot, it avoids the trap many primarily visual movies fall into by being just the right length to catch and hold the viewer's attention. Iwai is at his best here, showing his Christopher Doyle influences (and, thankfully, not his earlier TV-directing influences). He has also managed once again to pull exemplary performances from the cast. The story itself follows three psychologically disturbed people who leave their institution on a misdirected quest. Beyond that it is difficult to avoid saying too much, as, after all, this is a short film and hence has an appropriately short script. While Iwai Shunji's earlier works lie among the dregs of Japanese cinematography, Picnic (as well as Swallowtail) should elevate him to the status of one of Japan's best modern directors. One can only hope that he can continue making works of this superb quality.",
         "I've seen Love Letter, Swallowtail Butterfl, April Story from Iwai Shunji before this shortfilm.And I finally got to see it several days ago. It's really great,another gem from Iwai.It's the best shortfilm I've ever seen,I think. It feels like an allegory ,about our society and something we lost while struggling in it.I can't say out the signification clearly,but it DOES make me ponder about many things. And the cinematography,is very beautiful.I got deeply absorbed in the dreamlike picture,especially the slowly_fluttering black feathers in the last scene.I felt overwhelmingly sad at the time. All the performances are perfect,embodying the significance Iwai intended for. According to the four films I've seen, Iwai Shunji is the hope of Japan film industry.Expect more stunning from him.",
         "Iwai's Swallowtail and Love Letter are two of my favourite films. Asano and Chara are high calibre actors, and there are the stunning visual set pieces we've come to expect from Iwai, including the most arresting, startling suicide death ever committed to celluloid, a thing of sheer beauty. Unfortunately, the story is just too flimsy. The characters are not developed beyond their prognosis; Asano's demon makes disturbing hallucinatory appearances, but apart from that back story the rest is just three mentally disturbed people walking (and walking, and walking...) on a wall. There seems to be a short version and an extended version kicking about - I had the extended version, and it felt long. This seems to work better as a short film. The pseudo-Christian references are lame, a bum note in an otherwise passable effort. Thankfully, Iwai paid more attention to script in his later outings. This early one is strictly for fans looking to chart the director's development.",
         "I am very impressed by shunji iwai's films just like everyone else seems to be. I loved swallowtail butterfly so much. This film was good too, but it seemed to lack the feeling of reality and the created world in swallowtail. Chara is really awesome, and the other two guys do well at times, and lack at times in their acting skills. the loony people just don't always seem that looney, you can at times tell that they are just acting that way. still the film is done beautifully, and the story is interesting enough. watching three crazy people take a walk on a wall to see the end of the world is certainly original, and surprises may come. so anyhow. i would say that you should watch this, but don`t miss swallowtail.",
         "To watch this film about three patients from a fairly grim looking mental institution you have to suspend one belief: The belief is that all three can just leave without being detected. Once you get beyond that, and you should, you are left with a film that is oddly both ugly and beautiful. The three patients are Coco (the wonderful Chara), Tsumuji (the equally great Tadanobu Asano) and Satoru (Koichi Hashizume). They are sent to the institution for reasons you find out about eventually, and once they leave the film really expands into a somewhat atmospheric but beautifully shot film, with you watching these three supposedly crazy people interact with themselves and, in my favorite scene, a priest. The film is not long, only 65 minutes or so, but I was deeply affected about what these three young people are all about. So, get beyond my little caveat and watch the world with them. I think its a richly rewarding film about the frailty of life.",
         "In Picnic, director Shunji Iwai has crafted a short film of visual beauty and lyric poetry. Three young inmates at a mental institution walk along a wall connecting the hospital to the outside world and simply keep going, perhaps a metaphor for the Jungian idea of the long journey back to the genuine self. As they travel on a ledge between the ground and the sky, each in their own way attempts to liberate themselves from their inauthenticity and recapture the experience of wholeness. The inmates are Coco, played by Chara, a Japanese pop singer who would later star in Iwai's Swallowtail Butterfly, Tsumuji, performed by Tadanobu Asano, now the husband of Chara, and Satoru (Koichi Hashizumi). The first twenty minutes are set inside the institution. A reluctant Chara is delivered to the hospital by her parents and is subject to abuse and mistreatment by a female attendant. Tsumuji has murdered one of his teachers who was abusing him and sees the dead man's ghost before him in a very disturbing sequence. It is not clear why Satoru is there but we see scenes of him masturbating excessively. As the three find a common bond, they set out on their journey, first encountering a young choir at a Christian church singing an otherworldly hymn. They are befriended by the priest who gives them a bible even though Tsumuji says he is a non-believer. When the boy reads the publication date, however, he concludes that will be the day the world will end and the three decide to have a picnic at the nearby lighthouse to wait for the fateful moment. As they prepare to witness the world's end, they open up to each other with a childlike innocence and acknowledge their wrongdoing. Elizabeth Lesser says, \"The price for staying heart blind is a life unlived\". The Dalai Lama has gone as far as saying that \"the tendency to avoid problems and the emotional suffering inherent in them is the primary basis of all mental illness\". As they talk to each other and begin to make connection, they become real people not \"mental patients\". While the film's meaning may be different to each viewer, to me it is saying that we should live our life as if the world will end tomorrow, be in touch with the beauty of each moment, and acknowledge the actions in our life that may have harmed others. Whatever the message, Picnic is a stunning achievement, each scene capable of standing alone as a unique work of art. In spite of a sadness that reminded me of my own dark moods of adolescence, it left me with a feeling of transcendence.",
         "I live in Japan and watch a lot of Japanese films. Like anywhere there are the gems and the dregs. Unfortunately, this falls into the latter. It is shallow, pretentious and shot through with amateurism, from the none existent cinematography, to the flat dull performances. Chara should stick to singing, and this is probably Asano's worst performance on screen I've ever seen. This is more evident if you don't need to rely on the subtitles, as the original dialog comes across as hollow and flat in the native tongue. The concept is interesting and original, but that doesn't mean anything if the execution is lacking. Another point worth mentioning is that this is NOT a short film, it clocks in a just over an hour, a little longer in the original Japanese version (72 minutes) and I think this is it's biggest problem, it stretches an already thin concept beyond breaking point. Disappointing from Shunji Iwai, who is on of the more talented directors from Japan. Though to be fair, this is a relatively early piece, and his later works are much more confident in style and content. One for the fans only I think.",
         "I wonder why people said it lasted for 47 minutes when I have a 67 minute version. That certainly moves the film out of the short film category, I think. Anyway, this is a movie filled with symbols so that what seems a weird journey of three mental patients touches subjects like religion, sin, regret, without being religious. Two boys and a girl leave from a mental institution by walking on a wall. Normal people cannot go on the wall, they would fall down, like a cop that tried to stop them did. A priest comes to them on the wall, though, but sits on it, then climbs down on a ladder. After these two events they are armed with a gun and a bible. Going off the wall leads to death, as one of them accidentally falls down and hits his head. The main characters are childish and have different weird views over the world. The girl thinks the world was made by her parents when they gave birth to her and that it's going to end when she dies. The boy thinks the world is going to end and by reading the bible he convinces the others of it. So they decide to go to a picnic at the end of the wall to watch the end of the world. Of course, it's not the destination or the food that is important, but the journey. In the end, the world does end, sort of. I liked this movie, I think I will keep it in my collection. Watch this if you are in a mood for a meaningful low budget film.",
         "Since the composition is so delicate, the harsh texture of the editing should be made deliberately. The gloomy and horrific interior space and imaginative outdoor wanderings seem to tear the movie into two parts, but when the fences, rainstorms, feathers and other details are fully expressed, the metaphorical irony is gradually replaced by a purely romantic atmosphere. Although some part of the film it's going too far, the integral effect is quite remarkable.",
         "How do one feels the rules, the World, the Bible, and love when s-he's mentally disturbed? Reaaly cool! Chara and Asano Tadanobu are awesome and it has incredible cinematography as i think it can be expected from Shunji Iwai. The cinematography enhances the whole stuff, with a crescendo till the very end of the movie. It tells a lot while keeping it low on the words, as it let one feels from the inside point of view thanks to the humor and the great sensibility that are put into it. Overall a charming movie, on a barely easy field :) This is the second Shunji Iwai movie for me. His films aren't officially available in France, which is a real pain in the *ss.",
         "This is a short story about three teenagers in a mental institution (I'd prefer sanitarium because that is what it looks like) who, embarks on a trip to watch the end of the world. No need to analyze why but there are a lot of things they carry on their shoulders and when they get a bible from the minister it hints at consolation and they are quick to grab it. What is really apparent in this movie is the air of freedom; when they leave the gray, run down sanitarium it is all blue skies, refreshing winds and funny music (I'd love to have the sound track). I like this movie because of that, no matter how hard their lives are, there is always room for happiness, however fragile it may be. For fragile it is, in a blink of an eye it may vanish even though it may seem that it will last forever. It is a beautiful, yet tragic movie that I really recommend to anyone with an interest in the fate of people and their lives.",
         "This was one of the worst films I have seen in a while. I really think that I or any student could have written or filmed this movie, as long as you have some pretty faces to use as 'characters'. The movie attempts to portray the main actors as actually having mental visions of another human affecting their lives, ala A Beautiful Mind, in the first part of the film. Only toward the very end was this menacing vision revisited. In the rest of the movie, we see the main character happily and mindlessly drifting from neighborhood to neighborhood ending up at the ocean. An occasional reference to the meaning of life or the belief or even existence of GOD is supposed to lend this movie some credence.. a lame attempt. This is the state of Japanese Film making and acting,(in 1996 I know), and you wonder why Chinese actors were used in Memoirs of a Geisha! LOL"
      ],
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Fuji Television Network",
         "Pony Canyon"
      ],
      "summaries": ["Believing that the world will end that very day, three mental patients Coco, Tsumuji, and Satoru set out upon a journey. Walking upon the tops of the walls of the city, they seek to find a picnic spot with the best vantage point to view the final event."],
      "budget": 0
   },
   "movielensId": 172629,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1996-06-15",
      "dvdReleaseDate": null,
      "directors": ["Shunji Iwai"],
      "runtime": 72,
      "movieId": 172629,
      "title": "Picnic",
      "mpaa": null,
      "actors": [
         "Tadanobu Asano",
         "Chara",
         "Koichi Hashizume",
         "Naomasa Musaka",
         "Fujiko Yamamoto",
         "Shifumi Yamaguichi",
         "Takaaki Kabuto",
         "Kazue Itô",
         "Keiichi Suzuki"
      ],
      "imdbMovieId": "0117338",
      "originalTitle": "PiCNiC",
      "genres": [
         "Foreign",
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Believing that the world will end that very day, three mental patients Coco, Tsumuji, and Satoru set out upon a journey. Walking upon the tops of the walls of the city, they seek to find a picnic spot with the best vantage point to view the final event.",
      "tmdbMovieId": 40886,
      "avgRating": 3.25,
      "releaseYear": "1996",
      "numRatings": 2,
      "posterPath": "/3MxGlB6zYpWF5b445J7wMnCW5gQ.jpg"
   }
}