{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "babysitter",
            "id": 2604
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "1980s",
            "id": 208289
         }
      ],
      "imdb_id": "tt0085932",
      "video": false,
      "title": "Mary Poppins, Goodbye",
      "recommendations": [
         72611,
         20899,
         273126,
         70158,
         65123,
         63304,
         72211,
         273202,
         63536,
         127608,
         150949,
         27942,
         20894,
         64765,
         71103,
         129229,
         65142,
         333372,
         83614,
         30367
      ],
      "backdrop_path": "/rYEKkJQ8NXiUI4hfdsAzMYLPTEN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mary Poppins",
               "gender": 1,
               "credit_id": "52fe4959c3a368484e12709f",
               "name": "Natalya Andreychenko",
               "profile_path": "/tUPX3nYvk3dB3rhowg6vrNV2dj0.jpg",
               "id": 544626,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mr. Banks",
               "gender": 2,
               "credit_id": "52fe4959c3a368484e1270a3",
               "name": "Albert Filozov",
               "profile_path": "/jIJUbaUOaxLuD8WiCO9qoSnow8B.jpg",
               "id": 24373,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mrs. Banks",
               "gender": 0,
               "credit_id": "52fe4959c3a368484e1270a7",
               "name": "Larisa Udovichenko",
               "profile_path": "/gamqmpqySeqkQbV7eesAPxGEMSv.jpg",
               "id": 240532,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mr. A",
               "gender": 2,
               "credit_id": "52fe4959c3a368484e1270ab",
               "name": "Lembit Ulfsak",
               "profile_path": "/kPLqsrsv04bZIyYY2b8cOFFCO10.jpg",
               "id": 47432,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Miss Andrew",
               "gender": 2,
               "credit_id": "52fe4959c3a368484e1270af",
               "name": "Oleg Tabakov",
               "profile_path": "/2y9c4V6NR5OYFhhn1BeDqroNTFA.jpg",
               "id": 99282,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dog owner",
               "gender": 0,
               "credit_id": "52fe4959c3a368484e1270b3",
               "name": "Irina Skobtseva",
               "profile_path": "/9gcyzeWSa2f6sEAj86dLgfjb6JC.jpg",
               "id": 99258,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Admiral",
               "gender": 0,
               "credit_id": "52fe495ac3a368484e1270b7",
               "name": "Zinoviy Gerdt",
               "profile_path": "/tVsDAHClkifTwaV1kVEewcav6ak.jpg",
               "id": 237286,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Michael",
               "gender": 0,
               "credit_id": "53f2c4c0c3a3685aed005fb0",
               "name": "Filipp Rukavishnikov",
               "profile_path": null,
               "id": 1354363,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jane",
               "gender": 0,
               "credit_id": "53f2c4d6c3a3685af2005eca",
               "name": "Anna Plisetskaya",
               "profile_path": null,
               "id": 1354364,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Park cleaner",
               "gender": 0,
               "credit_id": "53f2c4f2c3a3685af2005ecf",
               "name": "Igor Yasulovich",
               "profile_path": "/bnVrQ1NTfLVdFni7mijBeQbqRNI.jpg",
               "id": 96519,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "59ad5bb69251410707044914",
               "name": "Semyon Sokolovsky",
               "profile_path": "/hOfeQCHhoV4YvwXNfQOw5kv01Lt.jpg",
               "id": 1600794,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4959c3a368484e12709b",
               "name": "Leonid Kvinikhidze",
               "profile_path": "/wXzSnXnGLMHKxcRpMHCTYvnuZIG.jpg",
               "id": 237285,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe495ac3a368484e1270c3",
               "name": "Vladimir Valutskiy",
               "profile_path": "/ucZJsBaN5iQ4jgPvQyRQsDX1Ua2.jpg",
               "id": 82592,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53f2c3e3c3a3685add005e69",
               "name": "P.L. Travers",
               "profile_path": "/lMHHHC1LPNEu8Ba9fZTUaVmGbld.jpg",
               "id": 5835,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.327928,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 77060,
      "vote_count": 10,
      "budget": 0,
      "overview": "A family hires a babysitter who seems to possess magical powers.",
      "similar": [
         11224,
         872,
         948,
         14128,
         10674,
         3933,
         10882,
         10545,
         49519,
         46195,
         196867,
         10530,
         11970,
         10020,
         141,
         93456,
         109445,
         321612,
         150540,
         342473
      ],
      "original_title": "Мэри Поппинс, до свидания",
      "runtime": 141,
      "poster_path": "/eIAQ4yloBqluQsNICJAKHfFUiRk.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [
         {
            "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
            "name": "Mosfilm",
            "id": 5120,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gosteleradio",
            "id": 14620,
            "origin_country": ""
         }
      ],
      "release_date": "1983-06-06",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Leonid Kvinikhidze"],
      "runtime": 141,
      "synopsis": null,
      "writers": [
         "P.L. Travers",
         "Vladimir Valutskiy"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0085932/",
      "coverLink": null,
      "actors": [
         "Natalya Andreychenko",
         "Tatyana Voronina",
         "Albert Filozov"
      ],
      "reviews": [
         "I saw that movie when I was about 7 or 8 years old. It was amazing movie for me. Handsome Mary Poppins (I didn't know then that it was Natalya Andreichenko, one of the most beautiful Russian actress in the 80's), imposing Cat-dancer and incredible Miss Andrew (this role was played by the greatest actor Oled Tabakov). Moreover, all the roles in this movie are played by very famous Russian stars. The atmosphere of fairy-tale stays even after movie watching. Songs and music are still moving to tears because the memory goes back to the childhood. I remember one moment well - balloons lying in the light of a lantern on the cobblestone pavement and sounds the song about the colour dreams which only children can see. I really like that movie and advice to watch it.",
         "There are some movies that stay for eternity in your heart. This is kind of such moves - half-musical, giving your hope, with most beautiful film music I have ever heard. What a pity, this movie is so little known. The movie is made in times of perestroika's beginning - the whole Soviet world was waiting for something new and fresh. This movie has its freshness, but this freshness is also actual for our days. Check it out - you'll be really happy to know that move, I bet! Sometimes, if I have depression or stress, I sing to myself the optimistic song from this movie \"Wind of Changes\". This is really warm and wise song, that let you feel the essence of your life. I cannot really describe the feelings, you get while of watching this movie.",
         "I think this movie is one of these you carry with you all your life. Once you see it, you fall in love. Why it's the number 1 movie in my heart, is that this is my childhood film. You got everything from it: fun, laughter, excitement, tears, warmth. There's lots of reading between the lines. And it is something every kid will understand and accept. I guess i would still cry when Meri Poppins takes the last wind to leave....",
         "I had literally never heard of this Soviet 1983 two-part miniseries about Mary Poppins until browsing on a website. I had loved since my early childhood the Walt Disney Mary Poppins and could not quite imagine how this new version would turn out... And it turned out very well indeed! Meri Poppins, do svidaniya starts out the usual way: the Banks, a couple of busy parents want a responsible nurse to take care of their troublesome but sweet children, Jane and Michael. The very proper lady they end up hiring has magical powers and brings the children into a world of adventures. But the stories adapted from the books are different than those set in the 60's movies : no merry-go-rounds here but a talking statue, an oniric pastry shop and Mrs Banks' mother coming to visit. The little town portrayed in the miniseries is both realistic and dreamy, a British suburb from a children's books, peopled with quirky and charming characters. Natalya Andrejchenko leads an excellent cast as Mary Poppins: she's ladylike and sweet, graceful and funny. A great actress to walk in Julie Andrew's footsteps, and give the famous part her personal touch. Lembit Ulfsak as Bert (now a gardener and Mrs Bank's beatnik brother) gives another very good performance, providing new relief to the part. And Albert Filozov as a more relaxed Mr Banks than David Tomlinson was in the film, has just the right combination of quirkiness and respectability. Finally, the songs are extremely enjoyable and will stay in your head a long time after viewing. The soft ballad Mary Poppins sings to the children before they go to sleep, with nostalgic undertones, and \"Veter Peremen\" the final, hopeful number, being two of the highlights. In the end, this is a very special and sometimes quirky miniseries, making the most of its actors, story and sets. A definite must-see for children and adults and a great alternative to the original Mary Poppins.",
         "According to opinion of western people, Soviet Union was absolutely totalitarian regime where everything was under propaganda, red dictatorship, etc. But at the same time there was great movie industry. Just look, how Soviet movie-makers show Britain, and they do not position British people or country as something negative, but would Americans or British make movie where events are happening in Soviet Union of 80-s or 70-s forgetting about Cold War realities, and just concentrating on art itself? By the way, one of comments was about Perestroika beginning. Actually 1983 year had nothing common with Perestoika because Perestroika begun in 1985, while in 1983 USSR was ruled by KGB man Yuri Andropov, and Gorbachev came to power only in 1985 March.",
         "People who like obscure movies probably know that Turkey made a bunch of no-budget versions of famous American movies: \"The Wizard of Oz\", \"The Exorcist\" and \"ET\", to name a few. I had assumed that the Turkish rip-offs were the weirdest possible movies. However, I didn't know that the Soviet Union made its own version of \"Mary Poppins\"! \"Meri Poppins, do svidaniya\" has to be the most whacked-out movie ever made. A dancing cat, an animated statue, and so-bad-it's-good '80s music (yes, somehow the Soviet Union got its hands on that) all in one movie. Seriously, this flick is like a combination of a \"Weird Al\" Yankovic song, and something created by Hunter S. Thompson. To be certain, the Bert character - played by Dick Van Dyke in the more famous version - looks like a cross between Elliott Gould and Keith Richards; when they first showed him, I thought that it was someone in a Michael Myers mask (that's the killer in the \"Halloween\" movies, not the guy who played Austin Powers). All in all, this is the sort of movie that could seemingly appear on \"Mystery Science Theater 3000\". I, for one, consider this flick to cool for that (I would have put the more famous version on \"MST3K\" in a second). This is one movie like nothing that you've ever seen. PS: Mrs. Andrew was played by a man in drag. It surprises me that they were allowed to do that in the Soviet Union, where homosexuality was illegal.",
         "If you're expecting something \"classical\", \"a la Disney\" don't watch this TV series. It's a really mad version of well known Poppins saga. Everything is happening somewhere in early 80's (very good design by the way) in a idyllic suburbia filled with really abnormal people. And Poppins is landing and making everything even more crazy! She's able too screen hallucinations, \"make dreams come true\" etc. The movie is filled with pop songs, dance numbers etc. Actually this kind of \"children movies\" were quite typical in SU in 80's. Surreal, crazy, filled with pop songs. I was preteen boy then and didn't understand them at all but now I think they were hilarious.",
         "this is great for old ages people In the first of many gripping twists,\"Mary Poppins\" is one of that select group of films that can truly be called 'Classic', a project conceived in love and filled with so much child-like wonder that it will never grow old or 'out-of-date'. Certainly the crowning achievement of Walt Disney's remarkable career, both story-wise and technically, the film remains an unsurpassed achievement! Based on P.L. Travers' tales of a magical nanny who arrives to bring families closer, the rights to the stories had been pursued by Disney since 1938, but Travers had seen what studios had done to other authors' works, and withheld her approval unless she could maintain some creative control. Years of negotiations only whetted Disney's desire to make a definitive, truly 'special' film, and by 1960, despite the box office failure of another fantasy-themed 'pet' project, \"Darby O'Gill and the Little People\", he was more confident than ever in the story's potential, bringing together a remarkable array of talent, including songwriting brothers Richard and Robert Sherman, production head Bill Walsh, and the brilliant artist Peter Ellenshaw to 'visualize' 1910 London through his matte paintings. With Travers' grudging approval, casting began. While American stage and TV star Dick Van Dyke was an odd choice to play a Cockney chimney sweep, he was a gifted mime and physical comedian, and had such a wholesome exuberance that Disney knew British audiences would forgive his shaky accent. Popular British actors Glynis Johns and David Tomlinson would play the preoccupied parents, with Karen Dotrice and Matthew Garber (from \"The Three Lives of Thomasina\") as the neglected children. Veteran stars Ed Wynn, Elsa Lanchester, Reginald Owen, Arthur Treacher, and Jane Darwell (as the Bird Woman, in her last screen appearance), headed the strong supporting cast. But it was the casting of Julie Andrews, in her first film, as Mary Poppins, that truly 'made' the film! Passed over by Jack Warner for the movie version of her stage hit, \"My Fair Lady\" (he opted for Audrey Hepburn), Disney caught her performance in \"Camelot\" on Broadway, knew, instantly, that she was the right 'Mary', and approached her for the role. \"But I'm pregnant,\" she told him. \"No problem,\" he replied. \"I'll wait!\" And thus a Classic was born! A multiple 1964 Oscar winner (including 'Best Actress' for Andrews, who got to share the stage with her \"Lady\" costar, Rex Harrison, who won 'Best Actor'), the film was a major hit, worldwide, and quickly achieved the legendary status it holds today. With songs both silly and sublime, seamless intermission of live performers and animation as only the Disney studio, at that time, was capable of, and the undeniable magnetism of Andrews and Van Dyke, it is nearly impossible NOT to like \"Mary Poppins\"!"
      ],
      "genres": [
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "Gosteleradio",
         "Mosfilm"
      ],
      "summaries": ["A family hires a babysitter who seems to possess magical powers."],
      "budget": 0
   },
   "movielensId": 172799,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1983-06-06",
      "dvdReleaseDate": null,
      "directors": ["Leonid Kvinikhidze"],
      "runtime": 141,
      "movieId": 172799,
      "title": "Mary Poppins, Goodbye",
      "mpaa": null,
      "actors": [
         "Natalya Andreychenko",
         "Albert Filozov",
         "Larisa Udovichenko",
         "Lembit Ulfsak",
         "Oleg Tabakov",
         "Irina Skobtseva",
         "Zinoviy Gerdt",
         "Filipp Rukavishnikov",
         "Anna Plisetskaya",
         "Igor Yasulovich",
         "Semyon Sokolovsky"
      ],
      "imdbMovieId": "0085932",
      "originalTitle": "Мэри Поппинс, до свидания",
      "genres": [
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A family hires a babysitter who seems to possess magical powers.",
      "tmdbMovieId": 77060,
      "avgRating": 3.025,
      "releaseYear": "1983",
      "numRatings": 20,
      "posterPath": "/eIAQ4yloBqluQsNICJAKHfFUiRk.jpg"
   }
}