{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3061222",
      "video": false,
      "title": "Alcoholist",
      "recommendations": [376581],
      "backdrop_path": "/mg9hPEg6AWbqqd3W3oLUxrfRGAB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Grey Speckled Man",
               "gender": 2,
               "credit_id": "581b8229c3a36869550018f4",
               "name": "Bill Moseley",
               "profile_path": "/qUgvWEdmsLTzYzVFc71Asqxsjhi.jpg",
               "id": 27737,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Claire",
               "gender": 1,
               "credit_id": "581b823792514115d3001874",
               "name": "Gabriella Wright",
               "profile_path": "/gRu9HvASbIceRNvQU43pvKyYc0l.jpg",
               "id": 118200,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Trevor",
               "gender": 2,
               "credit_id": "581b825bc3a368696700174a",
               "name": "John Robinson",
               "profile_path": "/fhQt1p1OjjsWzSf11mfZEa4QLwX.jpg",
               "id": 19197,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Farmer",
               "gender": 2,
               "credit_id": "581b826492514115c50017b6",
               "name": "Lloyd Kaufman",
               "profile_path": "/zTylEHdJL422WZ1vjEmEkDoWkk7.jpg",
               "id": 78021,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Veronica",
               "gender": 1,
               "credit_id": "581b8273c3a3686958001564",
               "name": "Tammy Jean",
               "profile_path": "/gRLNoShXKS3rNVZhz5QsI0zxDxJ.jpg",
               "id": 1455795,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Daniel",
               "gender": 2,
               "credit_id": "581b82a6c3a368696700179f",
               "name": "Bret Roberts",
               "profile_path": "/iWRlcdbyROp0inxnqYkM5ecCAfA.jpg",
               "id": 98051,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "AA Assistant",
               "gender": 0,
               "credit_id": "581b82b792514115d30018f1",
               "name": "Sherri Lyn Litz",
               "profile_path": null,
               "id": 1703543,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Angelica",
               "gender": 0,
               "credit_id": "581b82c292514115d7001a56",
               "name": "Skylar Drawdy",
               "profile_path": null,
               "id": 1703544,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Basketball Kid #1",
               "gender": 0,
               "credit_id": "581b82d0c3a368695e0014a4",
               "name": "Kellen Pembleton",
               "profile_path": null,
               "id": 1703545,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Daniel's Father",
               "gender": 0,
               "credit_id": "581b82ddc3a3686964001a3a",
               "name": "William Otterson",
               "profile_path": null,
               "id": 1703546,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "581b81f5c3a36869550018ba",
               "name": "Lucas Pavetto",
               "profile_path": null,
               "id": 1394095,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "581b820a92514115ce00179d",
               "name": "Lucas Pavetto",
               "profile_path": null,
               "id": 1394095,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "581b8215c3a36869550018e0",
               "name": "Massimo Vavassori",
               "profile_path": null,
               "id": 1394097,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.531047,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 424208,
      "vote_count": 5,
      "budget": 0,
      "overview": "An alcoholic spends all his time spying on his neighbor, waiting for the right moment to kill him.",
      "similar": [],
      "original_title": "Alcoholist",
      "runtime": 105,
      "poster_path": "/i3YT0uw6pmYfbDAJe3SgsUOKJnV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Dea Film",
         "id": 94396,
         "origin_country": ""
      }],
      "release_date": "2017-05-18",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Revenge will consume you.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lucas Pavetto"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Lucas Pavetto",
         "Massimo Vavassori"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3061222/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYWQyMGY2ZWMtOTQ1Mi00Y2JkLWE5ZjgtNjlmNThjNTYyZDc0XkEyXkFqcGdeQXVyMjY0OTA0NTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Bill Moseley",
         "John Robinson",
         "Gabriella Wright"
      ],
      "reviews": [
         "I don't know... If I were to read the script, I would say this movie would have a lot of potential. The actors are great, but the main lead behaves nothing like an alcoholic. His house is too clean, his body too well kept. His behavior is so unconform a drinker, I cringed. He acts more like a schizophrenic - a better title fit. The alcohol is emphasized, but a moot plot point and a sales pitch, leading to nothing. The therapy is extraordinary and senseless. The killing of his neighbor seems almost like a coincidental story, and that will leave you unsatisfied. In fact, all plot points are. The 'supernatural' visions are of no matter, and nothing is done with them, nor is it ever explained. Didn't like the CGI. They should have dropped it. Didn't like the ending. It was more of a 'situation' than a finale. This could easily have been the next 'the guest' with the plot idea. A stranger nearby with an aura of mystery and a mental condition, contemplating to kill - but believe me, if you want to kill somebody, you don't really go all out and buy the solitary house next door to make yourself the only suspect. Plenty of things just don't feel right with this one. Rating: 5.5/10",
         "If you are an alcoholic, the movie has a lot of scenes on why not to drink. Plenty of reminders! Overall, the story was good but I did scratch my head and wonder about the ending of the movie. Throughout the movie, the alcoholic is not the only person with an obsession. Individuals who reach out to help the suffering alcoholic and say, \"Trust me\" are not always to be trusted. Although, the movie includes many pathological altruistic people who are helping alcoholics not drink, the recovery is not healthy due to some of the controlling behavior enforced by the non alcoholic individuals. Another good reminder not to drink.",
         "The lead character renders a real portrayal of a real alcoholic. The acting is good to the point that you are forced to wonder if they got a real alcoholic to act in the movie! The support characters' performances are OK and 'almost' there. There is an overall darkness in the movie without any redeeming qualities. There appears to be an attempt to portray the obsessions, or the hidden darkness, of people with addictions and the people without. But this aspect is not made clear, or explored. I personally had an uncle who was never sober. He died when he was 42 years old from severe liver damage from alcoholism. That said, this movie perhaps tries to be a deterrent to viewers taking up the bottle. I don't see the point. I am not sure if it is effective in that message either. The bottle is taken up, even as this movie acknowledges, as a method of slow suicide. A brokenhearted or suicidal person taking to the bottle has already stopped caring about oneself or others, there is no real message or redemption in the movie. I felt that the movie took something away, my time, my desire to understand, and so on. The movie gave nothing. No entertainment, no real message. It left me depressed and regretting watching the movie. Hence only 4 stars. Just a fair warning.",
         "An extreme alcoholic lives next door to the man who killed his family and was cleared of any charges. This is what started his drinking and all he lives for now is to kill the man next door. Bill Moseley plays the man he wants to kill. The weird cameo was by Lloyd Kaufman who sits on a tractor and waves at a guy. That's it. This film was very depressing as we watch this guy drink himself silly, and he still finds himself unable to kill the neighbour every chance he tries. He finds a little solace in a worker from AA who helps him fight his addiction. The film was a real slow burner but it wasn't too bad. It does get repetitive after a bit. A good ending I thought and you probably won't want to have a drink for some time.",
         "It's your loss if you haven't watched Alcoholist yet or decide against it! I think nobody could portray the tribulations of being an alcoholic better than Bret Roberts. The barbarous lifestyle of alcoholist Daniel is bound to raise awareness against alcoholism. A mercurial story leading to a thought-provoking conclusion deserves your complete attention. The overly dramatic parts of this film, like that one father son scene, could be toned down. The set designing was very impressive. The alcoholist's neighbour's family didn't look like one but two adults and a child playing family. Gabriella Wright's unintelligible character mystified the film by taking up the responsibility of ridding the alcoholist of his true vicious addiction. A few scenes seemed necessarily repetitious yet monotonous at the same time. Apart from the brilliant lead, John Robinson's performance was noteworthy.",
         "This was an absolutely stunningly beautiful artistically cinematic and depressing disturbing and horrifying movie all in one it is much more than a man that is battling alcoholism and there's much more to the story than meets the eye it is one of those stores that will stay with you for long after the movie has ended I recommend this to any horror fan the acting is well was absolutely sensational",
         "At the end of it all, this movie is about disappointment. The path taken by both the hopeless alcoholic and the misguided and jaded therapist to achieve their own selfish agendas is flawed and transparent from their first encounter in the parking lot outside of the liquor store. Roberts' angst in the lead permeates every scene. His body is physically dependent on alcohol, and his withdrawal symptoms take him into delirium. The set design of his home is not too far off from what reality would show of an alcoholic's living space if he is near the end (hidden bottles of booze, overall disrepair and wretched conditions). His paranoia and fixation on killing his neighbor has taken over his entire consciousness. This, of course, will never solve the problems of his life, or provide a solution for the grief of losing his wife and child. But while under the influence, the fantasy of feeling the euphoria of murdering him in cold blood drives his every move. The \"Alcoholist\" (a clever play on words between \"alcohol\" and \"therapist\") Gabrielle Wright uses some outside-the-box strategies in an attempt to rehabilitate Roberts - as a sort-of remedy for her own professional grief of losing a patient she thought she had cured. He insists he is ready to quit drinking, yet she still includes booze as part of his therapy, insisting (perhaps correctly from a physiological standpoint) that his \"body isn't ready to quit.\" From a pure diagnostic and therapeutical standpoint, her method is indeed well-conceived and acted-out, but the premise of the treatment is it's demise. Treachery and doom linger around the film like some kind of trick of the weather. There is a grime to the film that looks to attach itself to the audience - much like the alcohol it depicts. If you're into tragedy, this is way above average. Its not a horror flick, but it is kind of haunting in the same type of way.",
         "Danny (Bret Roberts) has a major league drinking problem. He tries to stop, but can't last seven hours. He also has a demon that visits him. He watches his neighbor closely and desires to kill him, for reasons we discover later. He can't do it because he drinks and get the shakes. He needs to sober up. Claire (Gabriella Wright) is an unorthodox rehab counselor who forces herself into Danny's life violating ethical standards. It is interesting to watch the drama unfold as you don't know where the story leads. Guide: F-word. No sex or nudity.",
         "Can I just say, \"WOW\"! This movie will go down as my favorite drama movie of all time.Fascinating, inspiring. The acting was mesmerizing and the plot was impressively perfect. Went with another female friend . The lead actor renders a real portrayal of a real sick alcoholic person. The CGI visions are very intriguing. Gabriella Wright's unintelligible character mystified the film by taking up the responsibility of ridding the alcoholist of his true vicious addiction. A few scenes seemed necessarily repetitious yet monotonous at the same time. If you are looking for a strange metaphysical film with lots of surprises and sick characters, this is definitely a good movie for you.",
         "Wow!! I've never sat through out a movie anticipating next move and with a bundle of nerves before. There is never a dull moment and your heart will beat out of your chest in a lot of places. Acting is top notch and lighting and camera work is awesome. The rerecording is the heart of the movie and it is extremely impressive. Never look for any other movie if you want to see a original edge of a seat thriller, you will not be disappointed. I'm not going to give out any details , although if you see the trailer you will get a fair picture of what you can expect. I luckily came across sneak previews and thoroughly enjoyed what has been offered. For the fans, DO NOT MISS THIS MOVIE AT ANY COST! I've watched it in the theater and I'm also going to buy a Blue Ray copy when it's out so that everything i spend is contributed to movies like this."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Dea Film"],
      "summaries": ["An alcoholic spends all his time spying on his neighbor, waiting for the right moment to kill him."],
      "budget": 0
   },
   "movielensId": 172701,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2017-05-18",
      "dvdReleaseDate": null,
      "directors": ["Lucas Pavetto"],
      "runtime": 105,
      "movieId": 172701,
      "title": "Alcoholist",
      "mpaa": "",
      "actors": [
         "Bill Moseley",
         "Gabriella Wright",
         "John Robinson",
         "Lloyd Kaufman",
         "Tammy Jean",
         "Bret Roberts",
         "Sherri Lyn Litz",
         "Skylar Drawdy",
         "Kellen Pembleton",
         "William Otterson"
      ],
      "imdbMovieId": "3061222",
      "originalTitle": "Alcoholist",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["trqmAKto1GI"],
      "plotSummary": "An alcoholic spends all his time spying on his neighbor, waiting for the right moment to kill him.",
      "tmdbMovieId": 424208,
      "avgRating": 1.16667,
      "releaseYear": "2017",
      "numRatings": 3,
      "posterPath": "/i3YT0uw6pmYfbDAJe3SgsUOKJnV.jpg"
   }
}