{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0350934",
      "video": false,
      "title": "Final Flight of the Osiris",
      "recommendations": [
         24362,
         24959,
         24660,
         24358,
         24914,
         24960,
         24950,
         24675,
         74557,
         54821,
         106808,
         84582,
         129863,
         104697,
         194077,
         107268,
         161605,
         42510,
         105330,
         108278
      ],
      "backdrop_path": "/d3cCAyHUP9arbA8nhEUoorlh3Du.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jue",
               "gender": 1,
               "credit_id": "52fe4491c3a368484e02a455",
               "name": "Pamela Adlon",
               "profile_path": "/DbStLMSMhW1qtmKugYjS4yWOi.jpg",
               "id": 21063,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Thadeus",
               "gender": 2,
               "credit_id": "5365194c0e0a2647c8001789",
               "name": "Kevin Michael Richardson",
               "profile_path": "/9dMOW2CFRrlDkNzeXVGMJfASupM.jpg",
               "id": 24362,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Crew Man (voice)",
               "gender": 0,
               "credit_id": "567a8ba9c3a3685bbf002308",
               "name": "John DiMaggio",
               "profile_path": "/4gEy7tWkh95mgfsiHmTuFQkeRkx.jpg",
               "id": 31531,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Operator",
               "gender": 2,
               "credit_id": "5365197b0e0a2647c4001721",
               "name": "Tom Kenny",
               "profile_path": "/uU2VLWHkKZN0UkYVJBf1s1z2l3k.jpg",
               "id": 78798,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Pilot",
               "gender": 2,
               "credit_id": "5365198e0e0a2647ce0016b5",
               "name": "Rick Gomez",
               "profile_path": "/fqxDQWzG4OHZVqgnOqhS2HRSXPt.jpg",
               "id": 123532,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Crew Woman",
               "gender": 1,
               "credit_id": "536519a70e0a2647cb0016e0",
               "name": "Tara Strong",
               "profile_path": "/rFUZnJ4BaSaQVKW734xnUHSN9pm.jpg",
               "id": 15762,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Old Woman",
               "gender": 1,
               "credit_id": "536519bb0e0a2647ce0016bd",
               "name": "Bette Ford",
               "profile_path": "/oHbWCkFjNlX6n76sdzUj54pusFo.jpg",
               "id": 1212032,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4491c3a368484e02a451",
               "name": "Andrew R. Jones",
               "profile_path": "/cyJNjj7zg0vgExOdeR8IQ50FTco.jpg",
               "id": 56338,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "536b4c0c0e0a2647c800bcfb",
               "name": "Lilly Wachowski",
               "profile_path": "/qofqjT1drfmB5VNstWqSSfEJOLD.jpg",
               "id": 9339,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "536b4c170e0a2647db00b655",
               "name": "Lana Wachowski",
               "profile_path": "/fxZ7SpJCZ9DgJERWEpGmn5a4mdp.jpg",
               "id": 9340,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 2.856023,
      "production_countries": [],
      "id": 24357,
      "vote_count": 47,
      "budget": 0,
      "overview": "Immediately before the events of The Matrix Reloaded, the crew of the hovercraft Osiris discovers a quarter of a million sentinels drilling through the surface of the earth towards the last human city of Zion. But can the Osiris survive long enough to warn Zion?",
      "similar": [],
      "original_title": "Final Flight of the Osiris",
      "runtime": 9,
      "poster_path": "/bArlgzqN6z2g55ySuihN1GzWyDr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Square USA",
         "id": 4164,
         "origin_country": ""
      }],
      "release_date": "2003-03-21",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew R. Jones"],
      "runtime": 9,
      "synopsis": null,
      "writers": [
         "Lilly Wachowski",
         "Lana Wachowski"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0350934/",
      "coverLink": null,
      "actors": [
         "Kevin Michael Richardson",
         "Pamela Adlon",
         "John DiMaggio"
      ],
      "reviews": [
         "Spoilers Ahead. Of the nine films in this collection, this is clearly the most faithful to the feeling of the original movie script. This jumps in almost directly after the events of the original Matrix movie. After Neo becomes 'The One' and shoots off, superman-style, we are led to believe that shortly afterwards the adventure on the Osiris takes place. If you are already familiar with the story then you will no doubt be aware that the Osiris is the sister vessel to the Nebuchadnezzar, the ship manned by Morpheus, Trinity and Neo. The machines have put a new plan into action to halt the rebellion of Zion. The machines have located Zion underground and are drilling towards it. This is a fact unknown to our brave band thus far, but the crew of the Osiris are about to discover the truth. The actions taking place in this short film are directly related to the start of the 'Matrix Reloaded' and the events that unfold there. Like all of the short films in this collection, this is produced by the Wachowski Brothers themselves. Created by Square USA, this Final Fantasy-esque adventure is pure eye-candy. In truth it does little more than set the scene for the beginning of the second film in the trilogy and does not (story or plot-wise) stand up to close scrutiny. Though beautiful to look at, it is touted as much more than this but fails to deliver in almost every other department. Following the jaw-dropping swordfight at the beginning of the film we are then led down a pedestrian path, plotwise, of the Osiris' attempts to escape from the Matrix's Sentinels. In an attempt to lose the Sentinels they head down an uncharted tunnel, flying at whirlwind speed in the Osiris. Accidentally they find themselves at the surface of the planet and they are greeted by a site that chills them to their very marrow. Hundreds of thousands of Sentinels working furiously in co-operation with a huge drilling machine. They quickly deduce that the machines have located the underground city of Zion and are drilling straight down into it. The last bastion of man would surely fall if the machines were to reach it after years of searching. Knowing they must get this information to Zion, but knowing they will never get there, Jue (our female lead)is despatched into the Matrix to post a package that will ensure the rest of the human race will know what the machines plans are. Again we are treated to some stunning special effects with the action jumping smoothly from Jue's acrobatics in the Matrix to the plight of Thadeus, captain of the Osiris and his attempts to give Jue some time to get the message posted safely. Ultimately the Osiris is overcome by the legion of Sentinels they are running from, a referral to which is made in the second motion picture in the trilogy. In summary, this is a very enjoyable, if simple, prequel to the events taking place in the Matrix Reloaded. As I said, it is quite stunning to look at, but for all of the appearance, it's content is lacking. If the intention was merely to enlighten us to the upcoming plot, then it really needn't have bothered as we quickly ascertain the goings on when the second picture starts. It is difficult, I understand, to feel anything for the characters as they are all new and we don't get to learn very much about them in the short time we have with them, but more could have been made of this, which is little more than a beautifully rendered extended trailer for the new (at the time) movie.",
         "Set just before the beginning of The Matrix Reloaded, the crew of the ship Osiris escape a flurry of Sentinels by escaping to the surface where they see the massive drillers begin their descent into Zion. The crew must warn the city before it's too late. This could have been a spectacular short, but they just don't know what to do. A chunk of the running time is made up of a superfluous fight scene right at the start, and there really isn't much story. The visuals however are amazing (director Andrew R. Jones designed the SFX for Titanic and Superman Returns), even for 2003 standards the motion capture is very photo-realistic. It's just a shame that it doesn't amount to much.",
         "While practising kung fu and flirting in the dojo training programme, the captain of the Osiris, Thadeus, is alerted to an attack by a group of sentinels. Fleeing into an uncharted tunnel system the craft reaches the surface of earth where they see an army of sentinels and a machine for burrowing. Realising that Zion is directly beneath that site the crew realise that the machines are preparing an attack on Zion. As the sentinels close in on the craft one of the crew enters the matrix to deliver the information to one of the drop off points and warn Zion \u0096 but is there enough time? I was wanting to see this short so much that I almost went to see Dreamcatcher to get it! Happily it came onto TV a few days before the second Matrix film opened. The plot is quite simple and feeds into the sequels quite well. Being cynical you could say that this is yet another marketing tool for the Matrix and in a way it is. However I prefer to think that it performs a dual role as a trailer but also a short film in it's own right. Realistically \u0096 do you think the Matrix marketing machine NEEDS any help from this? The film moves quickly and is quite dramatic despite the short running time. Conversely to the films the `real' world is actually more exciting than the brief entry into the matrix itself (although they do try to spice this up with fancy moves etc), the real drama is the frantic attempt by the Orsis to escape or at least deliver it's warning. It may be more style than real substance or back story but it works well for what it is. The animation is very good. Looking at the characters faces reveal that it isn't quite as good as the real thing, but when it comes to machinery etc it does look very good indeed. I must admit to being a little sad and male by appreciating the striptease type sword fight \u0096 one example where animation can make things as good as real!! Maybe the animation is why the stuff in the matrix isn't as exciting \u0096 because we know `how they did that' \u0096 they drew it! Overall I don't know if I'd pay to see this but it is worth a look as part of the Matrix films. It has pace and is exciting and, although the short itself has a simple plot it does fit in nicely to the wider world. Even if you view this as a cynical marketing ploy \u0096 it is still quite an entertaining marketing ploy.",
         "In my opinion, this was an okay short. It was nothing compared to my favorite (Detective Story), and the sole purpose of this episode was to simply be eye candy. Yes, eye candy. From the fight/striptease at the beginning to the closing credits, the short is VERY visually attractive, but the acting is sub-par and the story is simply a typical Matrix action scene minus the plot. Yes, I understand it is the story of the Osiris discovering the Machine invasion heading for Zion, but the short itself is simply...kind of dull, honestly. If you like computer generated asian girls getting naked with katanas and some shady mention of a backstory setting up the movies, this is for you. If you like a neat short story with neat little inner tidbits that stands alone without the movies, watch Detective Story.",
         "This short was visually stunning and full of action. It created a different world within the mind's of matrix fans. It made me care about other characters outside of the one's featured in the movie. Jue made me wish Lucy Liu had been cast in an upcoming sequel.",
         "Presents a new wave in the marketing of trilogies. In 2004, \"The Year of the Matrix\", the filmmakers have promised us not only parts 2 and 3 but nine parallel mini-features - some of which are downloadable from the web. This, longer, mini-feature has a mini Matrix story using the high-tech animation (fully life-like characters) that we saw in Final Fantasy. The two leads manage to exude sexiness in an initial sword-play fight scene, the main objective of which seems to be to remove / slice off the opponent's clothing. the second scene involves a battle with seekers.",
         "Some Spoilers I stayed up 'till about 1 a.m., after \"The Matrix,\" to see this. Maybe it's just me, but I didn't think the animation, voices or action was all that great. It's essentially an eight-minute-long advertising campaign for the upcoming movies, and the beginning \"fight\" sequence is about five minutes of sensual fighting that doesn't fit into something like \"The Matrix\" at all. Fighting, yes. But the entire scene keeps leading to them shredding their clothes off in the sword fight. Please. I don't know why, but I expected something clever from this. I thought it was going to be a half hour long at least, and be a bit of a prequel to \"The Matrix.\" But it's just a long commercial, kinda like BMW's with Clive Owen. Only one difference: BMW knows how to both advertise and entertain at the same time. \"The Animatrix,\" apparently, does not. When the credits rolled, I felt cheated. Let's re-cap, shall we? One five-minute-long sensual fight, leading to an attack on the ship, \"The Osiris.\" This beginning sequence is basically one long advertising scheme, and the whole Countdown to Nudity was something teenage boys would come up with. After that a woman from The Osiris goes into The Matrix to deliver a package. This takes up about two minutes, and while it is the most visually enchanting scene in the commercial - err, film - it feels rushed. After she delivers the package, the ship is destroyed (in another rushed sequence) and she is killed inside The Matrix, plopping dead on the street. Booooring. At least the Wachowski Brothers realized this doesn't fit into an entire movie, but I really wanted a prequel to \"The Matrix.\" How about a look at the man who freed Morpheus from The Matrix; the man who was the first to realize The Matrix was a computer-generated illusion? Or what about showing some of Morpheus' adventures with Trinity before Neo came into the picture? I suppose because the actors wouldn't lend their voices - but then again, I'm kind of surprised they wouldn't, seeing how it would be a continuation of their characters. I hate to be a damper on everyone's fun, but an eight-minute-rip-off of \"The Matrix\" with so-so animation just isn't my piece of cake. Worth seeing if there's nothing else on. 2/5 stars - John Ulmer",
         "This is one of several animated short films that are based on the Wachowskis' \"Matrix\" movie. The director actually worked on special effects for several very famous films such as \"Titanic\". However, I have to say neither the characters nor the action made this really look like it belongs to the series except the fight in the first 2-3 minutes maybe. This fight sequence also includes the shot of the Asisn girl of which we only see one eye that was used for the Animatrix cover. This lack of Matrix connection is not necessarily a criticism on these 10 minutes as the animation is fine and the story isn't too bad either. The action didn't do a whole lot for me though, so i wouldn't recommend it. but then again, I am not a great Matrix fan anyway, at least this is a common denominator.",
         "This commercial for the Matrix sequels is being hailed (obviously by hardcore matrix fans) as breakthrough animation. I believe Shrek, already a few years old, was about 10 times better. The characters in this Wachowski advertisement look like puppets, move like puppets, and the action is mostly shoot-em-up stuff. The fascination of the Matrix wore off some time during the second half of the first movie, and now it's just more of the same. Ptooei! Now Dreamcatcher, on the other hand, that's a cool picture. Bert",
         "Awing the world with the graphics of SPIRITS WITHIN, OSIRIS by comparison is a step back, or rather, it really is a job done on the side as all energy was being poured into FF. The clunky movements of the characters, especially noticeable in the opening simulation scene, are subpar those of the 2001 box-office flop. SPOILER: The actual sequences inside the Matrix involve an extended jump, flat jogging, and a casual conversation with an old lady who decided for once that she should not turn into an Agent and stop Jue from informing Zionites about the attack of the Sentinels. Maybe Jue wasn't such a hot face among the Agent's most wanted list. Maybe it's a big PLOT HOLE. But, there is mouthfuls of butt, and that alone must make OSIRIS the top favorite of pseudo fans of the Matrix.",
         "I strongly suggest that any fans of the Matrix should see this short animated feature. It is a sort of ''mini-prequel'' to Matrix Reloaded. The computer animation is quite remarkable, similar to that of Final Fantasy, or the Starship Troopers TV series. Also, I thought it was a very clever (devious?) move by the film studios to show this as a featurette with Dream Catcher - I guarantee this ploy must have at least doubled the box office takings for that film (quite a good movie in it's own right, in my opinion). Animatrix: The Final Flight of the Osiris is highly recommended viewing for Matrix devotees, enthusiasts of computer animation and sci-fi fans in general.",
         "This is the first of the Animatrix shorts, found on the DVD of them. It is arguably the most entertaining. This maintains a rather fast pace throughout the entirety, without ever becoming overwhelming. It takes place a little before, and sets up, Reloaded(and also the Enter the Matrix). That doesn't mean it is a requirement to view this, however. The plot is well-written, and the story-telling is good. The CGI is stunning, incredibly naturalistic and quite close to being seamless. This was animated by the people who also made Final Fantasy: The Spirits Within, and you can tell that their talent was applied to this. The visuals are amazing all the way. The music is fitting. The sound in general is great, and the voice acting is nice. The characters are well-written, but there is little time devoted to developing them, particularly beyond the two leads. This is 9 minutes long, and the focus here was on making it feel like one of the awesome action scenes from the films(this is definitely the one most true to that aspect of the trilogy). They succeed. This has strong sensuality, but not particularly anything objectionable beyond that. The disc also holds a making of, six and a half minutes, very worth watching, with the crew talking about it, clips of it, and we even get a glimpse at some of the short they created to prove they could pull this off. I recommend this to any fan of the concept and the movies. 8/10",
         "This is the first part of 'The Animatrix', a collection of animated short movies that tell us a little more about the world of 'The Matrix'. This one is very exciting with some beautiful animations and the action as spectacular as we saw it in 'The Matrix'. Very good.",
         "The Final Flight of the Osiris is referenced in \"The Matrix: Reloaded\" although only briefly. That makes it one of the two short movies in the Animatrix which are, the other being the incredible \"Kid's Story\" which actually gives that annoying sidekick from Reloaded an amazing new dimension that I had never expected. Back to Osiris. The movie starts with some nice training fight sequence that seems to be the Wachowski's wet dream: Kung Fu + Anime + Eroticism. Seriously, I felt slightly disconcerted at enjoying the sexiness of it all. I suppose they wanted to make a point: Computer generated animation can be sexy. They made their point a little too well for my liking. Anyway, after the strip-fight, the story begins, but to be honest, the fight took up so much of the time of this short that the rest seems oddly rushed through. Of all the shorts, this is the one that felt like it simply wasn't meant to be short, and had to be rushed too much for its own good. It's about sentinels, the discovery of the premise of Reloaded (Zion is threatened) and a desperate attempt to save the world, martyr-style. Visually, it is stunning throughout. This left Final Fantasy (made by the same people) out in the cold, it looked so much better, especially the skins of the main protagonists. If being able to photorender people was sufficient to make a movie for humans, we'd be nearly there. Unfortunately, the animation of the mouths when talking is still not quite perfect, but everything else nearly is. But it's all style and little substance. That's why this is definitely not my favourite short, although it is very interesting to watch. 7/10",
         "This is an awesome preview to the coming Matrix movies. The opening scene (though, somewhat....odd) was a beautiful demonstration of the character modelling done for the movie. And the story that followed took me right back to the moments I watched the original matrix for my first time. That is to say, I was sitting there completely mesmorized by what I saw. Very beautiful, and very well done. The ending made me scream in frustration that I have some months to wait before I can indulge in a new matrix experience...",
         "The most well known and iconographic of the Animatrix shorts is \"The Final Flight of the Osiris\", which is one-part back story to the Reloaded narrative and two-parts showcase to the CGI animation skills of its creators. Let's just face it and realize that the story itself takes significant second tier to the animated characters, which in some cases look so real it's almost disturbing (see the term: Uncanny Valley). Whereas the beginning is somewhat gratuitous, it does help provide a relationship and thus caring for the characters in a relatively short amount of time, all while being titular to male viewers. I think \"The Final Flight of the Osiris\", ultimately, stands as a good example of the ways in which CGI can replace real actors and, if it ever becomes readily available and cheap, new forms of pornography (see the movie: Demonlover). In the meantime, it's a feast of color and movement that can at least be appreciated on an artistic level by all fans of animation, as well as Matrix acolytes. --PolarisDiB",
         "this is one of two of the nine Animatrix shorts directly connected to the events of the Matrix Reloaded and tells an important story animated in gorgeous CGI reminiscent of the movies themselves. it begins in a dojo much like the one Morpheus and Neo spar in during Neo's training in the first film where we meet Thadeus and Jue who spar with swords and acrobatics and a tribal little tune to accentuate their sexual tension. they are interrupted by the warning of sentinel activity. the ship is named the Osiris, after the Egyptian god who presides over death, resurrection and immortality - as far as I'm aware - and this is about letting the story of its crew and their sacrifice for Zion be told and remembered, otherwise only mentioned in passing at the beginning of Reloaded. in escaping from the sentinels they choose to go down an uncharted passage and end up above the surface of Earth, where they spot the massing army of sentinels and the big diggers. they realise that Zion is directly below them, just as the sentinels realise they're being watched. the Osiris escapes while Jue enters the matrix one last time to deliver a warning of the impending invasion of Zion. she succeeds using lush acrobatics to get from a building high up to the ground through a set of bars down an alley, to a mailbox on the high street before having a short conversation with a granny about important packages getting to where they're meant to be. meanwhile in the real world, despite the best efforts of the Osiris engines and gunners and pilots, they stand no chance against the thousands of sentinels that descend upon them, and they are killed by sentinels before the ship explodes finishing them off. message delivered, goodbyes said and conversation with granny done, we see Jue's matrix self die. Final flight of the Osiris captures the essence and character of the films and visually satisfies with beautiful graphics, apparently produced by Square, of Final Fantasy fame, and the plot is an interesting and significant precursor to the events of Reloaded and any matrix fan should give it a watch, along with the other Animatrix. Fly, baby, fly!",
         "Overall the CGI was extremely realistic, especially in the real world. When the Osiris is attempting to escape the sentinels, it almost looked like it was cut out of the Matrix movies. Though the CGI looks very good during the scenes in which you see the entire ship and all the sentinels, when there are closeups of the characters faces you can tell that its obviously CGI. But the fight scene in the beginning with Thaedus and Jue was a pretty good piece of animation, and their movements were very realistic. It was engaging how gradually they showed more skin, but I have to admit that the CGI was so good that I was hoping that Jue got fully unclothed instead of Thaedus. Jue was hot!, it would have been interesting to see her in Reloaded wearing the outfit she wore during their fight scene. Anyways the plot is alright given that the whole movie is only like ten minutes, and its even better if you've seen the movies.",
         "Final Flight of the Osiris is the only good segment of the awful Animatrix. In the beginning of the segment shows Thadeus and Julie in a virtual training with swords when a Sentinel alert appears.Thousands of Sentinels are been detected on the surface. In the surface, they detect that the Sentinels are going to dig and destroy Zion. Julie goes to the Matrix with the mission of putting a message to alert the Zion capitains. Infortunatelly the Osiris is destroyed and all tripulants are killed. That's why the name Final Flight of the Osiris. The segment is really cool. The only problem is of to buy the whole Animatrix collection to see the movie. After the segment, the Enter the Matrix game begins(In the Post Office).After Enter the Matrix, Matrix Reloaded begins.",
         "To warm things up for the disappointing last two Matrixes (or is it Matrices?), the Wachowsky brothers produced the Animatrix, a series of 9 short animated movies, the first of them being Final Flight of the Osiris. It starts of with a great sexually charged fight sequence between Thadeus and Jue, before the story takes place in the real world, with the Osiris finding out about the diggers towards Zion. They try to warn the city while hundreds of machines are chasing them. The story takes place before the Matrix Reloaded and stays close to the story we've seen so far (unlike other animatrixes). It's probably the best, if only for those first two minutes... 7/10.",
         "SPOILER I have to say it was a nice animated short film I love the fight scenes at the beginning of the movie. The CGI was simply breath taking I was really amazed on the animation of Final Flight of the Osiris. I just wish Final Fantasy was just as good as this Matrix short film. The fight sequences was pretty good I really think it could have been a lot better nothing compared to what I seen on the Matrix Reloaded. The one thing that bother me was the ending I know from the title it was going to end with the ships destruction, but it wasn't just the ship that was destroyed the whole crew died. The ending sucks, but I still enjoyed it.",
         "A rather splendid little stand-alone CG-animated film set in the universe of \"The Matrix\" series of movies. The engine used to generate the characters and animation is clearly the same as that used in \"Final Fantasy: The Spirits Within\". People who have criticised this movie's animation need their eyes examining. I found the movement of the characters utterly realistic, and their facial expressions were masterfully done. The best part, it has to be said, is the opening fight sequence between Thadeus and Jue. The only niggle I'd have is that sword fighting blindfolded is a concept more suited for showing off live action effects; clearly there's nothing clever about getting \"blindfolded\" CG characters to be able to fight as if they can see! But the fight, with its clever little device of gradually showing more flesh, is a splendid piece of animation work, with some nice touches of humour. Once that is over, the film moves over to more generic action sequence which really doesn't show us anything we haven't already seen in \"The Matrix\". As the title implies, it does have a somewhat downbeat ending, so be warned!",
         "It is important for all those who want to get a better understanding of what is going on in The Matrix Reloaded that you see this short film. Some might criticize it as being of poor quality animation, which is in part true, but it is worth watching since it's only like 15 minutes long. But the animation part is really not important. The small amount of information it provides is not crucial to the plot of Reloaded, but it might clear up a few points when you actually go see The Matrix Reloaded. Otherwise, i liked it, i gave it a 9/10.",
         "The Final Flight of the Orsiris owes it allegiance to Final Fantasy: The Spirits Within, and this film doesn't disappoint. Displaying the next generation of digital animation, this little film brought new meaning to \"animation.\" While the abruptness of it was somewhat annoying, at least one gets to enjoy the sharpness and downright coolness of this nine-minute feature. Just goes to show, the release date for this film and its eight counterparts will not come quickly enough.",
         "The Final Flight of the Osiris is our first chance to see one of the Animatrix shorts we first heard about on the \"Matrix Revisited\" dvd - and boy did it deliver! Directed by the Animation Director for \"Final Fantasy: The Spirits Within\", Final Flight delves further into the Matrix universe and manages in its 9 short minutes to not only create a greater anticipation for the upcoming Matrix Sequels, but convey a well written and action-packed story that the film it opened in front of, Dreamcatcher (2003), couldn't do in its 136 minutes. I greatly look forward to the other seven Animatrix shorts and thank the Wachowski brothers once again for bringing us the most important piece of science fiction since Star Wars."
      ],
      "genres": [
         "Action",
         "Animation",
         "Sci-Fi",
         "Short"
      ],
      "productionCompanies": [
         "Silver Pictures",
         "Warner Bros."
      ],
      "summaries": [
         "Thaddeus and Jue, the senior officers of the hovership The Osiris, have their erotic martial arts sparring session interrupted when the crew discovers a dire threat to the hidden city of Zion. The crew resolves to warn the settlement, but they are immediately detected by the machines and the chase is on. Now Jue must enter the Matrix to send the warning and hope that her comrades can hold off the enemy until she can complete her mission.",
         "The crew of the hovercraft Osiris discover a quarter of a million sentinels drilling through the surface of the earth towards the last human city of Zion. As the ship flees from the pursuing machines, crew member Jue attempts an emergency broadcast drop into the Matrix to warn Zion of the imminent attack. A prelude to \"The Matrix Reloaded\".",
         "After discovering a force of machines on its way to Zion, the crew of the hovercraft Osiris attempts to warn the city by using the Matrix."
      ],
      "budget": 5000000
   },
   "movielensId": 172881,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-03-21",
      "dvdReleaseDate": null,
      "directors": ["Andrew R. Jones"],
      "runtime": 9,
      "movieId": 172881,
      "title": "Final Flight of the Osiris",
      "mpaa": "PG-13",
      "actors": [
         "Pamela Adlon",
         "Kevin Michael Richardson",
         "John DiMaggio",
         "Tom Kenny",
         "Rick Gomez",
         "Tara Strong",
         "Bette Ford"
      ],
      "imdbMovieId": "0350934",
      "originalTitle": "Final Flight of the Osiris",
      "genres": [
         "Science Fiction",
         "Action",
         "Animation"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Immediately before the events of The Matrix Reloaded, the crew of the hovercraft Osiris discovers a quarter of a million sentinels drilling through the surface of the earth towards the last human city of Zion. But can the Osiris survive long enough to warn Zion?",
      "tmdbMovieId": 24357,
      "avgRating": 3.47826,
      "releaseYear": "2003",
      "numRatings": 23,
      "posterPath": "/bArlgzqN6z2g55ySuihN1GzWyDr.jpg"
   }
}