{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0372764",
      "video": false,
      "title": "Beyond",
      "recommendations": [
         24660,
         24959,
         24950,
         24960,
         24914,
         24362,
         24357,
         24358,
         74557,
         54821,
         161605,
         356155,
         105335,
         189054,
         108278,
         105330,
         106025,
         196293,
         107261,
         233913
      ],
      "backdrop_path": "/nVTtd34DJDr5o2zKr82iHzsTWZu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Yoko",
               "gender": 1,
               "credit_id": "52fe44a3c3a368484e02e5d3",
               "name": "Hedy Burress",
               "profile_path": "/mktE9DQDLIbycur8Y78QO4KscRg.jpg",
               "id": 41558,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Agent",
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e5d7",
               "name": "Matt McKenzie",
               "profile_path": "/taEnqM4Lc6G2PUlVyuFQcSJJQom.jpg",
               "id": 29797,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Manabu (voice)",
               "gender": 1,
               "credit_id": "536b5fc20e0a2647d800bba1",
               "name": "Pamela Adlon",
               "profile_path": "/DbStLMSMhW1qtmKugYjS4yWOi.jpg",
               "id": 21063,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Misha",
               "gender": 1,
               "credit_id": "536b5ff60e0a2647db00b886",
               "name": "Tara Strong",
               "profile_path": "/rFUZnJ4BaSaQVKW734xnUHSN9pm.jpg",
               "id": 15762,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Housewife / Kenny",
               "gender": 1,
               "credit_id": "536b60300e0a2647d800bbb4",
               "name": "Tress MacNeille",
               "profile_path": "/nUURm7MBAvKNq79gBhOVfs7Zlhl.jpg",
               "id": 34983,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Pudgy / Masa / Sara",
               "gender": 1,
               "credit_id": "536b607c0e0a2647c800bf56",
               "name": "Kath Soucie",
               "profile_path": "/urLkA155Yc19TKyeCUYGwzEt2PO.jpg",
               "id": 60739,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a3c3a368484e02e5cf",
               "name": "Kouji Morimoto",
               "profile_path": "/xRs1ulNnfLs5kkZcINkd73NgwnE.jpg",
               "id": 183,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "536b61630e0a2647c400bd01",
               "name": "Kouji Morimoto",
               "profile_path": "/xRs1ulNnfLs5kkZcINkd73NgwnE.jpg",
               "id": 183,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 2.674333,
      "production_countries": [],
      "id": 24675,
      "vote_count": 28,
      "budget": 0,
      "overview": "While looking for her cat, a young woman and some kids find an abandoned building where strange things happen and the rules of physics don't always apply. Part of the Animatrix collection of animated shorts set in the Matrix universe.",
      "similar": [],
      "original_title": "Beyond",
      "runtime": 13,
      "poster_path": "/2WlnnBYT1KmyPidaZiXDi4pFdnF.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Studio 4°C",
         "id": 11671,
         "origin_country": ""
      }],
      "release_date": "2003-06-03",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kôji Morimoto"],
      "runtime": 13,
      "synopsis": null,
      "writers": ["Kôji Morimoto"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0372764/",
      "coverLink": null,
      "actors": [
         "Hedy Burress",
         "Tress MacNeille",
         "Kath Soucie"
      ],
      "reviews": [
         "Most everyone I've talked to feels this was by far the most moving of the Animatrix shorts. I wholeheartedly agree, but I wasn't sure why at first. I think I've figured it out. We all have those beautiful moments in life that surprise us, overwhelm us, and then just disappear. The problem is that we as humans can't really communicate experiences with each other. The best we can usually do is vaguely explain the circumstances of an experience and hope to trigger memories of that experience in someone else. It still only works if the person has already had the experience. If someone tells me about their first love, I can only understand it by remembering how I felt during mine. If someone explains what it's like to be abused as a child, I really can't relate no matter how well it's described. There is, however, a good trick that can be used to convey feelings. Use a fictional but literal description that should provoke the same feeling. For example, to describe heartbreak, I may say it felt like someone ripped my heart out and kicked it into a trash can. Hopefully, you can imagine this literally happening to you and end up with the same feeling as I have. This is what \"Beyond\" does. It describes what it feels like to experience beautiful human moments without requiring very specific empathy. Sometimes, with the way they make us feel, the moments we experience might as well be glitches in a perfectly running computer program that we bumble into and are deleted from under us just as quickly. Even an alien who only vaguely feels awe and wonder at the possibility of physics breaking down elegantly for a short time could understand the excitement, awe, and sadness that a human feels every few years, if one is so lucky.",
         "I'm not a rabid fan of The Matrix (too many logistical flaws), though I have seen the two live action movies and plan on seeing the third (though I have to wonder why it is that so many movies lately are transition movies--Star Wars Episode 2, Matrix 2, X-2, etc). My main reason for purchasing the Animatrix was that I am an animation lover, and not just of Disney or anime. I love Looney tunes, peanuts, Max Fleisher, Watership Down, Ralph Bakshi, Fantastic Planet, Wallace and Gromitt, Rocky and Bullwinkle, The Simpsons, etc. You get the picture. Of these nine stories, I can only say I thoroughly enjoyed this one. Not only is it beautifully animated, it has an imagination that rivals Miyazaki's. \"Beyond\" adds to the matrix mythology the essential element that it has been missing from the beginning: humanity in concrete terms. Unlike most of the rest, including the live action movies, it doesn't *talk* about what it's like to be human, because the characters are too busy being humans. It isn't about the mumbo jumbo of freeing one's mind to escape this seeming prison; instead, it shows someone, raised to believe the prison is not a prison, and she reacts realistically to it. Unlike the movies, it creates the sense that the people aren't automatons and are worth saving. (Not to take it too seriously, but just think of how many people they waste in all those shooting sprees--what, are they not worthy? Just because they don't buy into Morpheus' truth? Shouldn't they, ethically, knowing how these people will react to them, try to avoid conflicts with the caged humans, or at least attempt to use less-than lethal force? After all, is someone still a hero if they have to become the villain to save the world?). The only real problem with Beyond is that it depicts animals as being as real as the humans (they're not, remember the deja-vu scene). But then, with the ending of Matrix Reloaded, perhaps there will be answers to this in Matrix Revolutions. 9/10. Seriously. You should see this even if you hate the matrix.",
         "This short is in many ways the opposite of \"World Record\". Where that film is based on an clever concept and idea, and totally wasted its potential, \"Beyond\" is based on a simple concept, and takes it, well, beyond what I expected (pardon the pun). World Record uses cold and surreal animation to tell a fairly real story. Beyond uses warm and traditional animation to tell a somewhat surreal and bizarre story. In short, it is a work of contradictions. The story - and there isn't all that much of it, to be honest - is about a group of kids who find a haunted house (a glitch in the matrix) and accept it as perfectly natural part of their world, they enjoy the enchanted surroundings with the childhood innocence that they still possess. I can only recommend this short movie - after \"Kid's Story\" it is perhaps the best of the Animatrix quickies. Fun, and enchanting.",
         "It is interesting that no one mentions that this part is actually connecting the matrix universe to the Stalker movie from Tarkovsky. There are visual references and the whole idea of the zone of strange things makes sure for me that the creators kept that movie in mind. Maybe the reason is that the two audiences are quite different: Matrix-buffs and fans of classic russian movies do not overlap. However, this background information makes the part more interesting, and not necessarily as a backstory of the Matrix-universe (where all interpretations are aimed). This is my favorite, technically it is beautiful, and compositionally it is very oeconomical.",
         "Beyond is, hands down, the best of the Animatrix shorts, a simple story about a woman who explores a \"haunted\" house in search of her missing cat. It's a bit difficult to understand if you haven't seen The Matrix Reloaded, but it does address one point that was made in that movie that I had hoped they would go into in more detail, namely ghosts, vampires, werewolves and other paranormal phenomena being entirely the result of a glitch in the Matrix. Beyond is a haunting piece reminiscent of the \"Labyrinth\" segment of Neo-Tokyo, an obscure anthology of anime shorts by Rin Taro (Metropolis), Yoshiaki Kawajiri (Ninja Scroll) and Katsuhiro Otomo (Akira).",
         "My absolute favorite Animatrix short. A young girl called Yuki, living in a quiet, sunny corner of an unnamed Japanese city, can't find her cat and wanders through the alleyways where she encounters a group of boys. They take her to 'the haunted house' a bizarre place where objects float, the rules of physics seem to be broken, and where timelines apparently overlap. Yuki and the kids don't realize that it's merely the Matrix breaking down in that particular city block. They have a wonderful defying gravity and investigating the mystery before the Agents show up and reconfigure the block back to 'normal'. The animation is gorgeous, with bright, warm colors and a peaceful, ethereal score by Chris Neilman (which was left off the score CD, for some reason). There's also something hauntingly familiar about it. Could the Matrix be real?",
         "i'm quite fond of the nine Animatrix, superbly made companion pieces, interesting stories that surround and supplement the matrix world established by the movies, and along with both parts of the Second Renaissance this is certainly my favourite; i prefer it even to that aforementioned Second Ren origin story. this is despite the fact that this tells perhaps the least significant story of the nine; two others tell stories directly linked to Reloaded, and the other four are examinations of escape from the matrix, converting machines to the human cause, choosing between the matrix and the war in the real world and a detective getting caught up in a battle between Trinity and agents. the story of this title is thin, flighty and seemingly diversionary like a few of the others; it is a neo-fantastical tale of a girl whose cat goes AWOL at feeding time and who goes searching for it; a couple of capricious kids take her to a haunted house where all manner of spectacular, unnatural and illogical wonders take place, such as rain from the sunny sky, floating objects, displaced shadows, weird fluctuations inside the building, doors to voids which contain echos of your thoughts etc. it's a dilapidated ruin but the kids make games of and delight in the impossible twists in the laws of physics in the place and play. the girl joins them when she finds her cat. however, agents have identified the place and set out to fix the bugs and reconfigure the glitches. as they get near rats swarm the previously calm building and then the agents break in and kick the kids out. the next day they and the girl return but the magic is gone. this title is a sea of tranquillity and calm beauty amidst all the style, conflict, struggle, philosophy and bleak post-apocalyptic ruin of the matrix universe, and the tone of the anime and little hints along the way reveal the true purpose and observation of the story. to elaborate, the story begins with a sped up montage of a city centre road crossing and a busy office. monotonous, churning, busy, reliable and ordered. then, a green computer screen moves over to the haunted house. it's glitches and bugs and pathways and malfunctioning routines in this old house and surrounding gardens but the kids who have found it play with and make games out of them. this is the distinction between the machines and people; where the former see errors, the latter see the changes in reality there and revel in them, they see them as fun, beauty and wonder. the house even seems to react to that, with bright oceans of light and an ability the kids find to make the rules of gravity and time and so forth up as they go along and manipulate them in their harmless, innocent games, enjoying the carefree abandon in the impossible playground. the rats spew out, seemingly in reaction to the approaching agents who arrive as they do. after the house is built over and glitches and bugs fixed, the kids return but the magic is gone and everything behaves normally. disgruntled, they saunter away, while the girl picks the formerly floating can up and drops it. it rolls over to the house, and the girl studies blood dripping from her hand. she was touched by the random magic and craves more, and an entrancing slowed drop of blood drips to the ground. the title ends with another look at the inner city crossing, as order has been again restored. but for a brief window, there was magic in the world, and the people rejoiced in it. the delightful tranquil atmosphere of the short is helped by the animation. it's suburban Japan with shrubs and gates and houses everywhere and every scene is over-arched by a bright sunny day, things and backgrounds shimmering and glowing over their crisp outlines in the great weather. Studio 4°C did a good job with their Animatrix projects but this is probably their nicest effort. the music is evocative and perfect for the piece, haunting, dreamy, ambient and rhythmic. director Koji Morimoto and the considerable cast and crew do a great job of taking a simply story and making something beautiful and poignant out of it. Beyond is an observation on beauty and a calming panorama of creativity in the face of monotony and it celebrates the fun that can be squeezed out of even a system of control. the flower is stamped on but it makes its mark. it is a wonderful piece of animation that goes beyond its insignificant little story in the grand scheme of the franchise and presents a touching beauty in the eye of its beholders that is witnessed and interacted with to gorgeous effect even among authoritarian agents and the dreamworld of the matrix.",
         "\"Beyond\" is one of the weaker segments of the \"Animatrix\" in my opinions. Maybe this has to do with the fact that it was not written by the Wachowskis, but by Kôji Morimoto, who also directed it. I am not too familiar with any of the voice actors except Strong and Adlon, but there are quite a few of them. Of course there are as this is one of the longest episodes of the Animatrix. I just wish the story would be as good as this was long. Unfortunately, it was not. A girl's cat runs away and when she heads out to get her back the finds much more than just a lost kitten. One problem I had with this one here is that I did not like the way the girl was animated at all. The rest was okay in terms of looks, but the protagonist I wish they could have done better. The scene with the cat looking right at us before we see the mouse is a nice way from the director of playing with our brains. Not enough though to let me recommend it. One of the weaker Animatrix segments in my opinion.",
         "Here is something very interesting: an Animatrix short that defies the typical story of someone coming to the truth, or close to it, and rather an exploration of the ways in which the Matrix as a program can cause amazing and surrealistic experiences outside the realm of ordinary experience. The aside in \"Reloaded\" about the supernatural coming from glitches in the system was an interesting revelation but not entirely developed as well with those dread-headed albinos; this short more than makes up for it. A young girl loses her cat and enlists a couple of even younger pranksters to help her find it. They track the cat to an abandoned, \"haunted\" house, where weird things are afoot. Things seem to come and go out of empty space at random, the laws of physics can be defied (and played with), and objects are rendered into various levels of suspended animation. At first the young girl finds them terrifying, but slowly begins to enjoy the freedom she has over reality, and plays with it. However, her adventure is short-lived once the Agents key into the fact that there is an area of the city that is \"unrendered\". This short is really smart in the way it mixes both audience familiarity with the Matrix with a sense of wonderment and freedom to the new laws as defined by a (broken) part of the overall program. The animation itself clues into what is actually happening, whereas it's also kept in mystery through the eyes of the characters, who interpret only what they can see. It has also a somewhat sober and saddening ending. It's also nice that this experience doesn't lead to visits by Neo, Trinity, or Morpheus, but that it gets to stand on its own. I'm actually surprised that this short wasn't directed by Satoshi Kon. The animation style reminded me strongly of some of the better episodes of \"Paranoia Agent\". If you, the reader, are one who was intrigued by this specific animation and want to see more things like it, check out the aforementioned series and his feature-length \"Paprika\", as well as other movies he's made. --PolarisDiB",
         "None of the other shorts stood up the hairs on the back of my neck like this one. Even in the stern droll world of the Matrix, innocence, wonder and purity survive. I was reminded of Castle in the Sky at certain moments. Yoko (Hedy Burress of FFX) and the three kids have a carefree little afternoon in this amazing house that defies all the rules. They're oblivious to the truth that they are in a computer program that just happens to be glitching in this time and place. The sights and sounds of this short are gorgeous and sublime (how I would also describe the score), and despite lasting only 12 minutes, it evokes an immense emotional impact, bringing you up to a high, then wrenching everything away. It is one of the finest films of any length I've ever seen, and definitely the best of the Animatrix shorts.",
         "Beyond will probably score high in almost everybody's list of the Animatrix shorts, and I am one of them. It tells the story of a haunted house (a glitch in the matrix), in which a group of kids play with gravity and such. A good story well told and well animated, it is one of the highlights of the Animatrix. It's actually an addition to the movies, which should have been the case for all of them. Instead, we got silly shorts like Matriculated and Program. So, if you only have time for a couple of the nine, check out this one as well as the first 'Last flight of the Osiris', and leave the rest of them. 7/10.",
         "This is the sixth part of 'The Animatrix', a collection of animated short movies that tell us a little more about the world of 'The Matrix'. In this short we see some kind of flaw in the matrix. There is a house where things can not break and it seems that there is no gravity there. There is not much action and may be that is why I didn't like it as much as the other shorts. It was still a nice fantasy story so I was still entertained.",
         "SPOILERS Much like some of the other stories in The Animatrix, Beyond was flat and meaningless due to the fact the animation just couldn't come up to par with the story. The story is this: a young woman wanders into a building where the law of physics are tainted, providing entertainment to the local kids and a sense of discovery for everyone involved. The downside, as is with a lot of Japanese animation, was the animation itself. Too many bright colors, too many offsetting facial stylings to really create a consistent brand of humanistic drawing. This particular short was at times a bit silly, but the idea was there. Unfortunately, no one really knew how to draw off it.",
         "A young girl, Yoko, sets out food for her cat but gets worried when the pet doesn't show up at the usual time. Asking around the neighbourhood, she finds a group of kids who say they saw the cat over by a building they know as `the haunted house'. She goes over to see if she can find her cat but finds much stranger things than she expected. Part of the series of animations making up the Matrix companion piece `The Animatrix', I saw this as a stand alone piece recently at a festival of shorts and animations and was drawn in by where it was going even if it was a bit strange and seemed unlikely in what I knew of the matrix universe. As the house gave up it's secrets, the short seemed more and more unlikely and it lost me a little bit. The animation is pretty good but lacks the heavily stylised feel that some of the others of the series have. That is not necessarily a bad thing but it needed more in the way of substance to make it work. The feel at the start is good as it uses music and an observational atmosphere to good effect but I never bought into the plot and it didn't really go anywhere of interest that added to the universe of the matrix. Overall this starts well but goes nowhere. Those who love the first film of the trilogy may also find the central premise rather hard to accept.",
         "Coming in at about 13 minutes, this, the seventh of the Animatrix short is the longest of them all. The pacing is mostly good, and in spite of sometimes being laid-back, it's never boring. The animation is great, a nice mix of 2D Animé style and gorgeous 3D CGI elements. The many surreal visuals are beautifully realized. The writer and director behind this has a vivid imagination, however, this is not for everyone. It deals with the idea of glitches in the programming, and how they are perceived or treated by those who discover them. The themes explored aren't bad. The concept doesn't go as far as it arguably could, but I understand that the Wachowski's requested that it go no further than it does. The sounds and music are well-done. Voice acting has fine performances. The characters are credibly written and portrayed. This doesn't directly relate to the films, other than taking place in the same world as they do. It has a making of, on the DVD, which runs at about nine minutes, and is interesting and worth watching. I recommend this to fans of the Matrix universe and/or science fiction. 7/10"
      ],
      "genres": [
         "Animation",
         "Sci-Fi",
         "Short"
      ],
      "productionCompanies": ["Studio 4°C"],
      "summaries": [
         "Yoko's cat Yuki hasn't shown up for diner and this really concerns her as the cat never misses a meal. She starts looking, asking neighbors if they have seen the animal. Then, one boy mentions seeing Yuki around the 'Haunted House', further up in the city. It's a favorite playground of the boy's group of friends. Yoko soon finds out this isn't an ordinary place. Objects are disappearing, feathers turns into birds and gravity seems to be absent. But Yoko soon finds out the existence of the place is also known by a group of rather reckless people.",
         "A young girl and a group of children discover that an abandoned house contains a wondrous nature to it."
      ],
      "budget": 0
   },
   "movielensId": 172877,
   "movielens": {
      "languages": [""],
      "releaseDate": "2003-06-03",
      "dvdReleaseDate": null,
      "directors": ["Kouji Morimoto"],
      "runtime": 13,
      "movieId": 172877,
      "title": "Beyond",
      "mpaa": "",
      "actors": [
         "Hedy Burress",
         "Matt McKenzie",
         "Pamela Adlon",
         "Tara Strong",
         "Tress MacNeille",
         "Kath Soucie"
      ],
      "imdbMovieId": "0372764",
      "originalTitle": "Beyond",
      "genres": [
         "Science Fiction",
         "Animation"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "While looking for her cat, a young woman and some kids find an abandoned building where strange things happen and the rules of physics don't always apply. Part of the Animatrix collection of animated shorts set in the Matrix universe.",
      "tmdbMovieId": 24675,
      "avgRating": 3.4375,
      "releaseYear": "2003",
      "numRatings": 16,
      "posterPath": "/2WlnnBYT1KmyPidaZiXDi4pFdnF.jpg"
   }
}