{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "pimp",
            "id": 1667
         },
         {
            "name": "cops",
            "id": 8233
         },
         {
            "name": "blaxploitation",
            "id": 10601
         }
      ],
      "imdb_id": "tt0072409",
      "video": false,
      "title": "Willie Dynamite",
      "recommendations": [
         88052,
         253277,
         172824,
         90949,
         60792,
         172469,
         18035,
         320586
      ],
      "backdrop_path": "/kfnfwDzpJfHcXFv8wUaJjLKnddw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Willie",
               "gender": 2,
               "credit_id": "531515f3c3a3682a02005dd7",
               "name": "Roscoe Orman",
               "profile_path": "/6geEQyUvmAAaZFWyK5GQlccqiR.jpg",
               "id": 90776,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Cora",
               "gender": 0,
               "credit_id": "53151610c3a3682a02005ddb",
               "name": "Diana Sands",
               "profile_path": "/jGmuQzoJYPOb8msUnLDwIpIywuu.jpg",
               "id": 103940,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Robert Daniels",
               "gender": 2,
               "credit_id": "53151628c3a36829d3005e5b",
               "name": "Thalmus Rasulala",
               "profile_path": "/yPuxMbOo7mG22I8kdmLmht00KIq.jpg",
               "id": 86138,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Pashen",
               "gender": 1,
               "credit_id": "53151645c3a36829d3005e5e",
               "name": "Joyce Walker",
               "profile_path": null,
               "id": 150648,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bell",
               "gender": 2,
               "credit_id": "53151658c3a36829e2005de2",
               "name": "Roger Robinson",
               "profile_path": "/9OdZ1JzSVTC0eeunnQwwnMArMef.jpg",
               "id": 138255,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Celli",
               "gender": 2,
               "credit_id": "5315166cc3a36821d3001a56",
               "name": "George Murdock",
               "profile_path": "/6FsCrzj86JjQJsEMYWnDBdPa0kw.jpg",
               "id": 2081,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pointer",
               "gender": 2,
               "credit_id": "53151680c3a3682a02005de0",
               "name": "Albert Hall",
               "profile_path": "/yHGN2pIdBcBk19sAu0EchOxfYMY.jpg",
               "id": 8354,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Honey",
               "gender": 1,
               "credit_id": "5315168fc3a36821d3001a59",
               "name": "Norma Donaldson",
               "profile_path": null,
               "id": 54434,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sola",
               "gender": 1,
               "credit_id": "5315169fc3a3687e3f000d0a",
               "name": "Juanita Brown",
               "profile_path": null,
               "id": 123347,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Willie's Mother",
               "gender": 1,
               "credit_id": "531516b6c3a3687e38000c77",
               "name": "Royce Wallace",
               "profile_path": null,
               "id": 1190722,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Gorgia",
               "gender": 1,
               "credit_id": "531516e1c3a36829c4005fab",
               "name": "Judith Brown",
               "profile_path": null,
               "id": 112404,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Connie",
               "gender": 1,
               "credit_id": "531516f7c3a368299b006069",
               "name": "Marilyn Coleman",
               "profile_path": null,
               "id": 89954,
               "order": 11
            },
            {
               "cast_id": 29,
               "character": "Scatback",
               "gender": 0,
               "credit_id": "560eb6f4c3a368681900c59a",
               "name": "Mary Charlotte Wilcox",
               "profile_path": null,
               "id": 1215426,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Pearl",
               "gender": 0,
               "credit_id": "53151721c3a3687e38000c7d",
               "name": "Marcia McBroom",
               "profile_path": "/oYgBul46aPNfdUJQLXYNxe5POHg.jpg",
               "id": 45112,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Willie's Lawyer",
               "gender": 2,
               "credit_id": "5315173ac3a36829e2005def",
               "name": "Jack Bernardi",
               "profile_path": null,
               "id": 152586,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46dfc3a36847f8117009",
               "name": "Gilbert Moses",
               "profile_path": null,
               "id": 171145,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5315175fc3a36821d3001a64",
               "name": "Ron Cutler",
               "profile_path": null,
               "id": 1102705,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5315178cc3a36829e2005df6",
               "name": "Joe Keyes",
               "profile_path": "/Aw0v4JCnTpHMJyNz6JuHDjA14mz.jpg",
               "id": 1232341,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "531517b9c3a368299b00607c",
               "name": "David Brown",
               "profile_path": "/rS11US9Th9grQlTN0NdK7Q2VrI1.jpg",
               "id": 1260146,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "531517d3c3a36821d3001a7e",
               "name": "Richard D. Zanuck",
               "profile_path": "/uoPXQ29L8vlphMuojaBlmuwi1Mu.jpg",
               "id": 1297,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "531517e9c3a3682a22005a1e",
               "name": "J.J. Johnson",
               "profile_path": null,
               "id": 6569,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "531517ffc3a36829b8005e6a",
               "name": "Frank Stanley",
               "profile_path": null,
               "id": 55320,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "53151813c3a3682a02005e2e",
               "name": "Aaron Stell",
               "profile_path": null,
               "id": 8484,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53151829c3a3682a22005a54",
               "name": "George Santana",
               "profile_path": null,
               "id": 1298390,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "5315183dc3a3687e3f000d67",
               "name": "L.B. Merman",
               "profile_path": null,
               "id": 1298391,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "5315184dc3a368299b0060d9",
               "name": "Bernard Johnson",
               "profile_path": "/cI39ZUMVRI5bJjewFhPRUnfJr9P.jpg",
               "id": 60879,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5315186dc3a36829e2005e56",
               "name": "Bernard Johnson",
               "profile_path": "/cI39ZUMVRI5bJjewFhPRUnfJr9P.jpg",
               "id": 60879,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5315188bc3a36821d3001ac9",
               "name": "John T. McCormack",
               "profile_path": null,
               "id": 1128257,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.427868,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46018,
      "vote_count": 6,
      "budget": 0,
      "overview": "Willie Dynamite is a pimp who operates in New York City. Willie was a big success as a pimp, but now, just as fast as he rose to the top, he has hit bottom. A former prostitute who has become a social worker tries to get Willie to clean up his life while it is still possible.",
      "similar": [
         50270,
         979,
         13441,
         1904,
         281,
         86331,
         157847,
         9282,
         258480,
         12994,
         12150,
         1690,
         26973,
         466,
         12093,
         23742,
         4995,
         7516,
         1640,
         345
      ],
      "original_title": "Willie Dynamite",
      "runtime": 102,
      "poster_path": "/jbnVjuJ2nxenpShhHJWOg5zKHnu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1974-01-23",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Chicks, Chumps, he uses 'em all.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gilbert Moses"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Ron Cutler",
         "Ron Cutler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072409/",
      "coverLink": null,
      "actors": [
         "Roscoe Orman",
         "Diana Sands",
         "Thalmus Rasulala"
      ],
      "reviews": [
         "******SPOLIERS****** \"Willie Dynamite\" is miles above the average \"Blaxploitation\" films made in the 1970's by it's not glorifying the title character in any way but showing him as a ruthless as well as tragic and misguided person. A person who's self-destructive lifestyle as a big time city pimp lead to disaster not only to himself but to all those around him: his women his friends his hangers-on and worst of all his sweet and church-going mother played by Royce Wallace. Back in those days, the 70's, Willie Dynamite, Roscoe Orman, could easily have been made to be a hero for the youth of the inner city ghettos to be looked up to and emulated. Instead the movie wisely chose to show him and his lifestyle for what it was, indifferent and unfeeling. Thats how Willie was to those women who worked the streets and hotels for him selling their hot bodies for the only thing that mattered to him the bottom line: Cold Cash. The film chronicles the rise and fall and in the end redemption of big city pimp Willie Dynamite after he saw his mother collapse in the courthouse, when she found out what Willie really did for a living, and later die in the hospital without Willie being able to tells her that he's sorry for what he did and get her forgiveness. Willie let his mom on to believe that he was a record agent not a pimp. Willie's top hooker Pashen, Joyce Walker, who wanted to get out of the hooker business and become a fashion model after she was shown the light by Cora, Diana Sands, a social worker who tried to save girls like her from being exploited by pimps like Willie. Pashen instead gets sweet-talked back into turning tricks by Willie's and ends up having her pretty face slashed while she was in the womens house of detention waiting to be bailed out by him. Diana Sands steals the movie with her sensitive portrayal of a social worker who knows all too well what life on the streets can do from her sad and abysmal life as a young women and tries to get the girls working for Willie to save themselves from that life like she did. We also see Diana change her opinion about Willie when he's destroyed by his fellow pimps as well as the law and becomes a broken and humbled person instead of the brash and arrogant pimp that she fought with throughout most of the movie. It's Cora's tender and emotional scene with Willie at the end of the film made you want to reach for your handkerchief. Finally Willie himself who went from a cold-hearted and unfeeling person who looked at both his hookers and the Johns who paid for their services only as dollar signs to where he became a sensitive and understanding person by the time the movie ended but it took a walk through hell for Willie to get to that point. The movie also has fine location filming in and around NYC with a great musical soundtrack. It would be unfair for \"Willie Dynamite\" to be described as a \"Blaxploitation\" movie; It doesn't exploits it's audience it educates it.",
         "The ad and plotline for this movie may give you the impression that Willie Dynamite is a typical blaxploitation actioner with heavy doses of violence and sex but that is not the case. Willie Dynamite deals with a NYC pimp (Orman) who must deal not only with the police and a dedicated social worker (Sands), but also his fellow pimps who resent his increasing level of power within the city. There is not much in the way of nudity or blood or even profanity. During the last third of the movie, the story switches gears as both Orman and Sands go through some major changes which cause them to alter their outlook and approach to their lives. In doing this, Willie Dynamite goes in a different (and less sensational) direction than many films of this period chose to go. The film also takes on a higher level of believability which helps to bring the two main characters to life. Both Orman and Sands are impressive in their roles. It is sad to note that Sands died shortly after making this as she was a very talented woman. Orman, believe it or not, went on to become a staple on TV's Sesame Street as Gordon! Now that's a change of pace. His fur coats and fur hat add some unintentional laughs to the story, though at the time this was made, they were probably in vogue. In fact, Willie Dynamite has a great early 70s ambiance that many of the bigger movies of the time did not contain. Willie Dynamite may not be the best known of the blaxploitation genre but it deserves more attention than it got.",
         "After watching 100 or more blaxploitation movies in the last 10 years or so, my wife and I fell in love with this movie. You love blaxploitation for the cheesy acting, the characters, the cars, the ghetto heroes. But for this one, it's the costumes. Sure, it's got pimps, hos, bad cops, drugs and prostitution, even a ex-hooker with a heart of gold. With costume changes nearly every scene; leather, fur, satin and those hats!, this one should have taken an Oscar! If we can find the DVD, this one goes in the permanent collection. Mary and David",
         "Highly entertaining and interesting as willie dynamite applies the principles of capitalism to enhance his business of managing sporting ladies. But where there is greed and the quest to be second to none, one is always confronted with jealousy and envy from your fellow peers. The character Willie dynamite was immaculate in his dress from the beginning of the film to the end. He changes wardrobe complete with hats more times than Cher did in her last concert! He displays the 70's pandering apparell that he wore to absolute perfection. I originally saw Willie Dynamite in 1973, and after watching it again today, after all of these years, it had the same impact. That is why I feel that I can recommend the viewing of this film. If you like blaxploitations films, this is a must see!!!",
         "In the course of one week, poor Willie the pimp is getting the heat from rival pimps, from the cops (including the wonderful Albert Hall), and from a reformed prostitute who is trying to get Willie's \u0091girls' to unionize (`You can call me the Ralph Nadar for prostitutes', she snaps in one of the film's funniest lines). He even gets the IRS on his ass, although that scene isn't terribly realistic since no pimp and/or drug dealer with even half a brain would put his earnings in a bank!. What else? His purple Caddy gets towed about twice a day, his girls get busted (or worse!) and ultimately, his poor mom strokes out. Pimping just doesn't pay! This film isn't like most of the other blaxploitation films. It downplays the guns and drugs angle, and the lead character is not so baaad that he's good \u0096 or vice versa. He's a nut, really. You can even see people in the background who were unaware they were in a film, pointing at him and laughing. You can almost feel sorry for him because he's more stupid than evil, and that's where the film wins the viewer over. The film breaks away from formula a number of times, and despite the OUTRAGEOUS costumes and decor (even the telephones are fur-lined!), we care about the people in this film. There are good cops and bad cops, and there is a nice balance of giving us women with brains and brawn, but who are still capable of a pretty nasty catfight when the need arises. Something for everyone! My only beef is that despite a pretty \u0091bad' theme song, the score doesn't rock at all. In fact, there are even a number of scenes that are scored with folky harmonica music. How uncool is that? It's also a shame that this film wasn't nominated for Best Costume design, but we all know how unlikely it was that most of the Academy members ever even saw this film. Just isn't fair! Overall, I think this is one of the best films of the blaxploitation genre, and along with `Unholy Rollers' and `Switchblade Sisters', one of the best exploitation films of the seventies.",
         "It is impossible to deny that this film has some hilarious parts. You can't help enjoying the absolutely ridiculous outfits and mannerisms of the pimps. Everything from Willie's beyond gaudy car to even the characters' names (i.e. the white pimp named Milky Way) is pretty entertaining. But it does have some serious (well okay, maybe not serious) implications as well. It is basically set up like most classic tragedies; a man in a position of great power falls due to a tragic flaw. Willie is likable enough not to deserve our hatred, but ruthless enough that we accept that he deserved his fate. Okay, so it's a bad idea to overthink this movie, but it is important to at least recognize that format. Furthermore, its social implications are pretty relevant. It portrayed Black and White characters in both positive and negative stereotypes, as well as providing more well rounded characters to serve as positive rolemodels. It started out glorifying the pimp lifestyle and slowly de-glamorized it as a life of dishonesty, drug addiction, violence, and eventual ruin. It may have really given young kids growing up in ghettoes in that era as made something to think about by slowly exposing the harsh realities of a life outside the law. Especially since it also presented positive Black role models who came from similar situations, like Cora, a prostitute-turned-social worker on a quest to help rescue other young girls from a life on the streets.",
         "A classic 70's Blaxploitation film. Pimps as colorful as peacocks with land cruisers dressed in chrome. Roscoe Orman (Gordon from Sesame Street) plays Willie, a pimp who has the patter down pat and the clothing that rivals anything that your imagination can come up with. He runs afoul of a determined social worker and the police, both determined to bring him down. They use every trick in the book to make his life hell and bring on him the wrath of his fellow pimps. Diana Sands, who was one of the top black actresses of the 50s and 60s, shined as the social worker. This was one of her last films as she died of cancer before its release. She was 39. Like Al Capone, Willie's downfall was the IRS.",
         "Willie Dynamite is most certainly one of the most flamboyant pimps to ever grace the screen and his \"stable\" of beautiful women are frequently scantily clad, but don't let the smooth taste fool you, Willie Dynamite is not your average pimp film. \"Willie Dynamite\" was at times thought-provoking, frequently intense and entertaining throughout. Watching Willie Dynamite fall from pimp grace makes for some interesting drama. Roscoe Orman is great as the fallen pimp and Diana Sands is brilliant as always but there is much to be said about the performance of the young Joyce Walker, Willie's newest and most inexperienced 'treat'. This film's motto seems to be 'even an old dog can learn new tricks' as each of the main characters undergo some form of transformation before the credits start rolling. 8/10 stars",
         "This Blaxploitation classic merits a viewing on at least two bases: one, you've got none other than Gordon of 'Sesame Street', a.k.a. actor Roscoe Orman, playing a pimp, and two, you have to love these COSTUMES! \"Willie Dynamite\" (Orman) is a capitalism-oriented flesh peddler with a wardrobe to die for. But he'll have a few thorns in his side: a pair of detectives (George Murdock, Albert Hall) out to righteously bust him, a mysterious enemy determined to screw him over, and a crusading social worker named Cora (Diana Sands), who acts as a patron saint to hookers. Directed with style by Gilbert Moses, \"Willie Dynamite\" is generally engaging entertainment. Some viewers may be pleased to note that, although the rating is R, there's no excessive violence, and very little in the way of bare female skin. That doesn't mean, however, that it's not worth other peoples' time. It spins a decent yarn (screenplay by Ron Cutler, based on a story by Cutler and Joe Keyes Jr.) that unfolds at a respectable pace, gives us some agreeable action set pieces, and makes fine use of locations. There's a wonderful score provided by J.J. Johnson, and a rousing title theme song that gets you in the proper mood immediately. Orman is great fun playing a charismatic antihero. The scenario lets you wait until the end to let you know whether or not Willie D. can be redeemed, leading to some poignant moments. Sands, sadly dying of cancer during this time, gives the best performance in the movie. Thalmus Rasulala is saddled with little to do as her attorney boyfriend. Similarly, there are other familiar faces here that are rather wasted. Judith Brown, Juanita Brown, Marcia McBroom, and Mary Charlotte Wilcox as some of Willie D.'s hookers mostly just take up space. The pretty Joyce Walker gets the lions' share of attention as novice ho Pashen. Roger Robinson, as an antagonistic pimp named Bell, is most amusing, but there may be viewers who will take offense to his stereotypical portrayal of a gay character. \"Willie Dynamite\" is lively, funny, and sometimes touching. Blaxploitation completists will want to check it out, for sure. Seven out of 10.",
         "What is uncanny about Willie Dynamite is that the film is able to take this despicable, self-absorbed, sadistic pimp and humanize him. How director Gilbert Moses and actor Roscoe Orman(as Dynamite)pull this off is worthy of applause. The destruction left by his devious activities are of focus in this blaxploitation effort. Cora(Diana Sands, in a solid performance), a social worker, attempts to pry a lovely young prostitute, Pashen(Joyce Walker)from the clutches of Dynamite's powerful influence. Willie Dynamite decides to take his pimping solo, splitting from his colleagues, securing wealthy clientèle for his girls. Dynamite lives it up lavishly, while his girls are treated to second hand \"glamor\" wardrobe they believe is high-class. Meanwhile, Dynamite's fellow pimps are seeking after him, not appreciative of his decision to separate from their network which brought forth quite an enterprise. The police are after Willie, hoping to pin the right crime on him that'll stick, forcing him off the streets. Dynamite has a reputation for getting his girls hooked on narcotics, when their worth is depleted and value diminished sending them away to fall into destitution. Cora, understanding his dangerous nature, wishes to see Willie taken down, soon recognizing that despite his corrupt ways, he's still a human being in need of guidance. The film starts out as almost a comedy where these pimps, with their pomp and attitude, driving their colorful cars and wearing their vibrant custom suits, fur coats, and flashy hats, are almost caricatures, over-the-top creations broadly performed by the African-American cast. But, as the film progresses, it gets dead serious and we see how the life style of a pimp can, in fact, lead to tragedies of severe magnitude. Preshen almost succeeds in getting away from the whoring business, but through Willi's commanding dominating personality, he's able to convince her to stay, with the consequences of her brief imprisonment leading to a devastating abuse threatening a potential modeling career. Dynamite's mother(..and their family)have always been told that he was an important music producer, explaining the gifts and other extravagances he could give her..the truth revealed and the possible incarceration of her son yields a terrible reaction. And, as competition arises, one of Willie's top girls is killed by a throat slash during an altercation over rich clients. It's a domino effect that leads to Willie's downward spiral, everything that happens contributed to his bad behavior, repercussions deriving from his mistakes and avarice. It's a hoot seeing Orman, a fixture on Sesame Street, in the role of a lecherous pimp! Shooting on the streets in many cases adds a grit and grime providing an authenticity that gives the material presented extra punch. Orman, at times, can be pretty electrifying, and his character, for most of the running time, is easy to root against for he's not very likable at all. Great chase scene as Willie attempts to break free from two detectives on his tail, while hoping to recover hidden drugs stashed away for safe keeping.",
         "Probably what might make most people give this particular Blaxploitation movie a look is the promise of \"Gordon\" from the children's television show \"Sesame Street\" playing a flamboyant pimp. There definitely is some novelty to get from that, and the movie boasts other attributes such as good production values (including a lot of outrageous clothing choices). However, the end results overall are to some degree a bit unsatisfying. One reason for that is the portrayal of the title character. I was unsure throughout whether we are supposed to be on the side of Willie Dynamite or not. I suspect not... but I'm not sure, one reason maybe being that the character is kind of thin. It's hard to get into the head of this character a lot of the time and get his perspective of things. The script also suffers from the fact that the narrative is more or less a collection of vignettes loosely connected together, rather than one strong story thread. If you like Blaxploitation movies from the 1970s, you'll probably find enough to enjoy here. However, you'll probably still see a fairly large bit of potential that wasn't quite realized.",
         "The movie was good but it's not a movie about pimps. The movie is comparable to The Mack. Pimp movies don't have reform built into its plot. A movie can't have a message and be about pimps. It does not go together. A story about a bad guy turned good is a dime a dozen. Pimp movies aren't for that.",
         "As all fans of exploitation cinema will know, there were many, many blaxploitation movies released during the 1970s after Melvin van Peebles left an incredibly impression on black audiences with Sweet Sweetback's Baadasssss Song in 1971. While many are rather enjoyable in a comical way, few works of blaxploitation were actually any good. Tony Award-nominated Broadway director Gilbert Moses' Willie Dynamite is incredibly under-seen, but is one of the genre's most impressive works, shunning the usual hyper-stylised, lightly comic beats in favour of something more serious and dramatic, while also touching on themes such as black identity, racism and police corruption. New York pimp Willie Dynamite (Roscoe Orman) has built himself a mini-empire, training his girls to work like a production line to maximise profits and keep his many customers happy. While his clothes are utterly outlandish (there are some of most ridiculous outfits ever seen in the genre here), Willie ain't no lovable scamp like Super Fly (1972), but a real piece of s**t; he regularly threatens his girls with violence, underpays them, and fails to offer any help when they get themselves arrested. When he's late to turn up to court for his most recent arrival Pashen (Joyce Walker), prostitute-turned-social worker Cora (Diana Sands) takes a particular interest, and becomes intent on rescuing Willie's girls and ending his reign of terror. For a genre normally so rich in exploitative traits, Willie Dynamite contains no nudity and little violence, earning its adult rating instead for language and drug use. The lack of sex and action scenes leaves plenty of room for drama and character building, and Willie's journey to discovering his place in society and ultimately redeeming himself is all the more engrossing for it. Anyone familiar with Sesame Street will be left shocked at the sight of Orman wearing some of the most garish costumes ever committed to celluloid and trying to keep his bitches in check, and it's a very convincing performance. But it is in fact Diana Sands, who sadly died shortly after filming, who steals the film as the force of nature with a gentle side. Ripe for re- discovery, there's much more to Willie Dynamite than I would have ever expected. Now, bring me some scratch.",
         "Not a very common blaxsploitation film released through Universal Pictures. This one had a decent budget and starred the one and only Gordon from Sesame Street (Roscoe Orman). It was a little odd watching him play a pimp but he did do an amazing job. I wonder if this role landed him the job as Gordon. This isn't really exploitative at all with no violence or nudity instead tells a story of a pimps hardships with the police always arresting his girls and shaking him down constantly. His competition works him over as well every chance they get. His biggest problem seems to be his mother who obviously disapproves of his life choice. A great film all the way through but the only thing missing was a funky soundtrack.",
         "This was an entertaining story that made good use of its 1970s New York setting. Willie is trying to keep his position as the most profitable pimp in the city, but the heat are coming down hard. He has an enemy in a politically active social worker trying to liberate the women in his stable, and he has pressure from the other pimps to follow a group plan to out-maneuver the law. Willie doesn't want to deal with any of it; he just wants things to continue the way they have been. Eventually it starts to fall apart; the heat make trouble, costing him time and money, his women get pulled, disfigured, and killed, and his momma passes away after learning the truth about Willie's career. Willie then decides to rethink things, and the social worker turns supportive, offering him compassionate council, and with one conversation, he decides to turn his life around. For me, the weak parts were the chase sequences, as they tended to go on too long. It was also too abrupt when Willie reformed; it would have been a better story if they could have shown it to be a slow, gradual process. Something that stuck out was the sound design; you can hear every movement of fabric in this movie. If someone shifts in their seat, you hear their coat rubbing against the chair. The audio was like a high quality FM signal, and the main character's voice was especially resonant, so that was a plus. Bell was an entertaining protagonist, with the highlight being the first scene of the movie: the pimp council. This story remains fresh and interesting, despite the dated fashions. I think you could make pretty much the same movie today, and the message of unchecked ambition would be just as relevant.",
         "\"Willie Dynamite\" (Roscoe Orman) is a pimp who has a stable of 7 prostitutes who earn him a very lucrative living. Life is good. However, one day a rival pimp by the name of \"Bell\" (Roger Robinson) decides to call a meeting to discuss organizing into a collective group and allocating territories for each of them to conduct their business in. Willie is the only one who doesn't care for the idea and incurs the wrath of Bell in the process. Not only that, but a social worker named \"Cora Williams\" (Diana Sands) becomes concerned about one of his prostitutes by the name of \"Pashon\" (Joyce Walker) and decides to put Willie out of business. The fact that she is sleeping with the Assistant District Attorney makes her much more dangerous than Willie realizes. Suddenly things mysteriously start going wrong for him. Big time. Anyway, rather than divulge the entire story, I will just say that this was an interesting film depicting the life of a pimp from his point of view. The problem with that scenario is that in order to be realistic it had to show the ugliness within him. As a result, it became difficult to sympathize with him or develop any concern with his plight. On the other hand, because of the arrogant and illegal tactics the police used it was also difficult to side with them either. Likewise, the ending wasn't well-developed and seemed to leave the story hanging. In any case, in spite of all of the challenges and flaws this was still an entertaining film for the most part. Not great by any means, but for a blaxploitation film dealing with this particular subject matter I suppose it deserves a rating of slightly better than average.",
         "I can't fully explain why but I absolutely love this movie. I put this with Pineapple Express. Even though their completely unrelated; their movies that make me smile, and a little happy, and I could watch it over and over which I can do with few movies. I think Bell's parts are funny. The way he says \"Willeee Dynooomiiiite\"(You have to see it for yourself). I think Willie's acting was good too. I think the movie as a whole had good acting. I thought that the movie was pretty believable....well maybe. I think people would of got killed doing the things they did in this movie. That Willie is a smooth mofo though. I've read some reviews and some people really don't like this movie. I guess that's why we're all different. I think it was a pimp classic. I like the way Willie handled his business. I did't like the black cop though for some reason. The white one either really, but the black one I just didn't like his face lol as mean as that sounds. This movie is not for everyone by a long shot. I can't picture some...lets say..upscale people watching and enjoying this but um...if you have the right background and possible the right buzz you will really enjoy this knee slapper lol.",
         "This film is brought to you by the letter \"P\". Kids, let's think of some words that start with \"P\",... In probably the weirdest case of casting I can think of, Roscoe Orman plays the title character--who is a pimp! Years later, Orman would achieve some notoriety playing \"Gordon\" on SESAME STREET--now THAT'S interesting casting!! Seeing this 70s \"super-pimp\" all decked out in furs and pimp costume is very, very surreal--especially with the amazingly over-the-top style and language and crazy pimp-mobiles! Now, although Willie is on top of his game, his world begins to crumble when an ex-hooker turned social worker decides that enough is enough. She encourages the prostitutes to dump this jerk and either go into business for themselves or try something legitimate. Willie responds by threatening the lady. She decides to declare war on Willie and things look really, really bad for the pimp-meister. However, when things go worst for Willie, the movie takes a very, very strange twist with the social worker--one that rather blindsided me. While not at all believable, it was certainly an interesting twist. While this is a so-called \"blaxploitation\" film in many ways (especially due to the lead being a pimp), the film is much different than you'd expect. First, it's story is stronger than the genre--with some complexity. Second, the film isn't all \"black and white\" with cartoon-like characters and silly stereotypes. The cop who hates Willie the most is a Black cop who's a Muslim. Third, the film lacks the nudity and hard edge you'd normally see. And finally, the story doesn't seem either anti-White or glorify evil by the time it's finished--and as such, is a much more three dimensional film that's worth a look. Needless to say, this film that, at times, glamorizes pimps may seem like the ultimate misogynistic film, but stick with it. Rabid feminists probably should not watch this film or they'll suffer a stroke, but if they'd bear with it, by the end it does have a positive message and is not a \"pro-pimp\" film like THE MACK!!!",
         "Roscoe Orman is Willie D, a sad sack of a pimp who embodies the Godfather of WWF(E)'s saying \"Pimpin' ain't easy\". His pimp-mobile is constantly getting towed, his hoes get busted, he's getting audited, and to top it off some uppity knee-jerk liberal activist wants his bitches to unionize. It would be among the best Pimpsploitation movies, if it didn't get so damn melodramatic towards the end. Willie's pimping clothes are, in a word, Dynamite (especially this one hilarious huge hat he wears at one point). By the way, this isn't the last of Willie, oh no it ain't. He got his ass together, changed his name to Gordon R. and now he can show you how to get, how to get to Sesame Street. Hope he wasn't the one to pimp Ernie out to Bert. Best Line: (Willie in a line-up shouting about his coat) \"It's Lamb!! IT'S LAMB!!!\" My Grade: C Where i saw it: Black Stars",
         "SPOILER ALERT! A not too bad blaxploitation film with a \"happy ending.\" A reformed prostitute (Diana Sands) attempts to bring a fairly inept pimp down while the cops are on him like glue. Roscoe Orman plays the title role, a pimp who's seen better days, and he's woefully upstaged by his ridiculous outfits. It's all fast paced, sometimes stupid, even a bit campy but also fairly entertaining. Sands brings a lot of class to the film and Thalmus Rasulala is in it too. The faux-funk music is by JJ Johnson, who also contributed to CLEOPATRA JONES & THE FUZZ BROTHERS. Produced, inexplicably, by Zanuck/Brown (a year before they hit pay dirt with JAWS).",
         "Long before the WWF's \"Godfather\", Willie Dynamite proved without a doubt that \"Pimpin ain't easy!\" Available on video at most BlockBuster Videos'. Not the quintessential \"pimp flick\" that \"The Mack\" w/Max Julian or the humorous romps of the \"Dolemite\" films; but not as dreary as say \"The Candy Tangerine Man\"."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": ["A social worker tries to get a pimp to change his ways."],
      "budget": 0
   },
   "movielensId": 172925,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-01-23",
      "dvdReleaseDate": null,
      "directors": ["Gilbert Moses"],
      "runtime": 102,
      "movieId": 172925,
      "title": "Willie Dynamite",
      "mpaa": "",
      "actors": [
         "Roscoe Orman",
         "Diana Sands",
         "Thalmus Rasulala",
         "Joyce Walker",
         "Roger Robinson",
         "George Murdock",
         "Albert Hall",
         "Norma Donaldson",
         "Juanita Brown",
         "Royce Wallace",
         "Judith Brown",
         "Marilyn Coleman",
         "Mary Charlotte Wilcox",
         "Marcia McBroom",
         "Jack Bernardi"
      ],
      "imdbMovieId": "0072409",
      "originalTitle": "Willie Dynamite",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["sAhVtcMMsqQ"],
      "plotSummary": "Willie Dynamite is a pimp who operates in New York City. Willie was a big success as a pimp, but now, just as fast as he rose to the top, he has hit bottom. A former prostitute who has become a social worker tries to get Willie to clean up his life while it is still possible.",
      "tmdbMovieId": 46018,
      "avgRating": 1.5,
      "releaseYear": "1974",
      "numRatings": 1,
      "posterPath": "/jbnVjuJ2nxenpShhHJWOg5zKHnu.jpg"
   }
}