{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0052751",
      "video": false,
      "title": "Donald in Mathmagic Land",
      "recommendations": [
         151430,
         55462,
         93718,
         67591,
         55566,
         66870,
         67593,
         67138,
         89773,
         55510,
         67173,
         54477,
         97884,
         67709,
         53469,
         54163,
         54167,
         90497,
         90021,
         54080
      ],
      "backdrop_path": "/iZyAqg3fszylsDD3gXeX5rTnBOi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Donald Duck",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9e21",
               "name": "Clarence Nash",
               "profile_path": "/bEtwgcLncIDovv9qplhTVffQB7e.jpg",
               "id": 78077,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "The True Spirit of Adventure / Narrator",
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9e25",
               "name": "Paul Frees",
               "profile_path": "/ey4xNbw7AfFW7brHnb3C9ADL34Q.jpg",
               "id": 16417,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9df9",
               "name": "Les Clark",
               "profile_path": null,
               "id": 115754,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9dff",
               "name": "Hamilton Luske",
               "profile_path": "/xeyWJsFlMtgjyfZnnElMnc6qFF6.jpg",
               "id": 11429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9e0b",
               "name": "Wolfgang Reitherman",
               "profile_path": "/p9ywBLS3Pvv3BcocjLsPwnll6mc.jpg",
               "id": 57314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47eb9251416c750a9e11",
               "name": "Milt Banta",
               "profile_path": "/HTfh7xcbuS5SkOoi7atQ5nX4YR.jpg",
               "id": 71211,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe47eb9251416c750a9e17",
               "name": "Bill Berg",
               "profile_path": "/5kjCQH33mAfZNEnndmlEDt1TXuB.jpg",
               "id": 148073,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "55a5cd239251410996000668",
               "name": "Joshua Meador",
               "profile_path": "/r7VwcasPi9BxYziLPZlasLQ7CSZ.jpg",
               "id": 222238,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.797872,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19715,
      "vote_count": 25,
      "budget": 0,
      "overview": "Disney used animation here to explain through this wonderful adventure of Donald how mathmatics can be usuful in our real life. Through this journey Donald shows us how mathmatics are not just numbers and charts, but magical living things.",
      "similar": [],
      "original_title": "Donald in Mathmagic Land",
      "runtime": 27,
      "poster_path": "/mPvhkiOFXlwdccEAV67cNW0CaGK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1959-06-26",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Les Clark",
         "Joshua Meador"
      ],
      "runtime": 27,
      "synopsis": null,
      "writers": [
         "Milt Banta",
         "Bill Berg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052751/",
      "coverLink": null,
      "actors": [
         "Paul Frees",
         "Clarence Nash"
      ],
      "reviews": [
         "First, let me trot out my creds. I took a PhD in combinatorial mathematics from Ohio State in 1986. I'm going to claim this is relevant for two reasons: one, that this cartoon is based upon some deep and beautiful mathematics; that this material can open up into deeper study for any student, from junior high to postgraduate. The second is that this can open up mathematics for kids, and I will offer myself as an example. I remember seeing this when I was pretty young, and really got hooked on the bit about learning to play pool \"by the Diamond method\". It offered that math was \"a lot more than just two times two\", and that it was cool to study math. The cartoon focuses deeply on non-arithmetic aspects of math, and that is welcome. Even as an adult, I still find it entertaining, but would be something I would give to any kid I cared about to expose him to the art behind math. Buy it for the kids, or for yourself. But be prepared to study number theory and algebraic geometry, if you follow the leads -- rich material awaits... and as the cartoon notes, there are still many other doors to open and new things to discover...",
         "I first saw this wonderful film in school in the early 60's. For several years it was an \"annual event\". Considering I was never in the same school district twice in a row, it was fascinating to see what grade level each district thought it was for. It gives a clear and understandable approach to the question of \"What is math (arithmatic) good for anyway?\" Fun, musically diverse, and perhaps a bit silly, it stands the test of time. Paul Frees' outstanding narration allows the youngers to enjoy the fun of the movie, and the olders to understand the concepts. It also explained how to calculate a bank shot on a billiard (or pool) table using the spots. heh.",
         "I am not going to say that this is Donald's absolute best, being a fan of his, as there are so many cartoons of his that are real gems, but Donald in Mathmagic Land has been a personal favourite of mine for a while now. True, there isn't much of a story, if there is one it is very simple, and there isn't a nicely rounded ending as such. But what I do love about Donald in Mathmagic Land is that it is different, it is unique, it is educational for kids and it is really enjoyable. In fact it actually makes maths fun, and I do confess maths was one of my least favourite subjects at school, for example I never got my head completely around algebra. Even if there are minor flaws with the story and ending there is so much that compensates. There is some stunning art work that is somewhat inventive, and I think it has held up well over 40+ years, there is a fun music score, there are some funny moments such as Donald's quibbling with the omniscient narrator and there is outstanding vocal work from Paul Frees and Clarence \"Ducky\" Nash. Overall, if you love Disney and you love Donald Duck, plus if you want something educational even if you don't like the subject, just put Donald in Mathmagic Land on. 9/10 Bethany Cox",
         "In Grade 11 Trig class, we made our teacher rent this as a going away present for the Seniors who were graduating early. This is a great example of the teaching power of film. In straightforward fashion, Donald overcomes his fear of numbers through illustrative examples. Plus, it teaches kids to play pool! Learn to use the diamonds on the table, and you too can improve your game with geometry and simple arithmetic. Recommended!",
         "This animated documentary was an excellent combination of entertainment and education and is a real feather in Disney's cap. Most people have varying degrees of either disinterest or dislike of mathematics. This renders math comprehensible as well as making it fun and interesting-a combination most of my math instuctors were either unwilling or unable to accomplish. After 41 years plus, this doesn't feel the least bit dated. I'm glad to see it's available. Three cheers for the mouse (and the duck too, though I must confess that, for the most part, Donald leaves me cold. Not here, though.). Most recommended.",
         "I have never really been a fan of Disney. Don't get me wrong, there are some Disney films that I like, but to be honest I didn't dig Mickey Mouse and Co. (Sorry, but I am a true Looney Tunes fan). However, there are always exceptions (The Little Mermaid, Aladdin, The Lion King and Beauty And The Beast among them). A good case in point is \"Donald in Mathmagic Land.\" Growing up, I saw it every year and enjoyed it more and more. Donald isn't a math fan. A voice tells and shows him that math is an integral part of our life (Chess, Billards and Shapes). You have your typical Disney humor in it, but it teaches you a valuable lesson: no matter what someone tells you, math IS important in every aspect of our lives and that you can never escape it. It's a great way to get your kids to understand the magic of math.",
         "One of the greatest films of all time. well, maybe one of the greatest educational films of all time. Disney could always make educational films fun and entertaining, and next to his 'Man in Space' series, this is his best. definitely his most timeless since some of the information in the 'Space' series is now dated. only problem is, this is so entertaining you just kick back and watch the cool retro animation and forget to take in the math lesson. Donald Duck quacks,squeaks and squawks his adorable little self through a succession of colorfully presented math lessons ending with a quote from Galileo that's intended to inspire awe and make us ponder the universe. I would have, but I was still too busy thinking about how cute Donald looked. especially when he was playing pool against a live action background.",
         "Donald in Mathmagicland is the Alice in Wonderland of educational cartoons. It makes very little sense, and to explain the nonsensical happenings, is the simple fact that this is mathMAGICland. If you're into some strong story telling, this is not for you, but if you want an entertaining and educational Disney flick, than this one is for you. Donald Duck is transported to Mathmagicland. In this land, various happenings in normal life are explained through math, and an ominous voice talks to Donald, voiced by Paul Frees. Donald learns how instrument strings are mathematically designed, and how the game of chess in a math process, how the game of pool can be mathematically calculated, and much more. This is not much of a story. It makes no sense, and has no real ending, but it's still a great short. The animation is fantastic. The animation features constant morphing of shapes and it's hard to imagine that these animators could use these techniques 50 years ago. The live action is thrown in well, also. The scene where they teach how to calculate pool is the most interesting in the movie, and the mixture of live action pool and Donald Duck looks excellent, and is a nice throwback to techniques used in Donald's earlier picture \"The Three Caballeros\". Paul Frees is an excellent narrator, and Donald Duck is the perfect character to send to this inexplicable math land. The animation is great, and this educational Disney film is brilliantly animated and very informative. My rating: *** 1/2 out of ****. 30 mins.",
         "I know I saw this at least four times in public school. Disney did some instructional films during his tenure. In this one, Donald Duck with his whiny squawk and lack of discipline, bemoans the \"fact\" that he finds mathematics boring. But in steps the disembodied voice of Paul Frees (Boris Badenov) who leads Donald to Mathmagicland where he can see all the benefits of learning about numbers and geometric concepts. After one viewing in about fourth grade, this film was indelibly stuck in my head. We learn about why there are diamonds outside the rails of pool an billiard tables. We see how formulas are constructed. Mostly, it's a history lesson, showing how mathematics has aided people moving into modern time. And Donald is his usually squawky presence.",
         "In a strange and gloomy place, a giant shadow breaks into the darkness, a reassuring presence: it's our old friend Donald Duck, with a shotgun and a safari hat, seems like he's ready for a wilderness trip. But what a strange opening, numbers lie on the ground, trees have (literally) square roots and a weird bird-like creature made of a triangle, a square and a circle recites Pi (with a mistake in the numbers' sequence from what I read). This is where Donald calls someone and a voice answers him. This is Paul Frees, the narrator of this glorious journey in the world of Mathematics. But Donald is immediately turned off; this is eggheads' stuff, which shows the lucidity of the writers regarding the reception the film would get, especially among schools' pupils. And till now, how many people, almost proudly, declare they hate math or never got it. But how many of them became athletes, musicians, artists or botanists? This is one of the greatest lessons of \"Donald in Mathmagic Land\", math is everywhere, and those who don't feel too hot about it might underestimate how daily exposed their line of works is to numbers and geometry. So, Donald couldn't have been more wrong, and without asking for permission, the voice takes him to Ancient Greece, when Pythagoras invented music through a simple use of divisions applied to a string, obtaining a different sound depending on the portion you plunk, the genesis of the scale of music we're all familiar with. Then the film transitions from Pythagoras to the pentagram, the sign of recognition he used with his disciples, a form that contains great applications in Arts and architecture. The film turns to a more playful tone, with a few insights on the use of math in games, sport and geometric forms in the real world. Finally, the conclusion acknowledges that math hasn't revealed all their secrets, and the boundlessness of human mind might welcome new discoveries. Indeed, while I was checking on Youtube comments, I was fascinated by the way everyone seems to have a story with \"Donald in Mathmagic Land\". Some had their first encounter with the film from a school (old-school) projector, others had it in a low quality VHS, a few vaguely remember a weird Donald Duck cartoon full of geometric forms, documentary footage and some stuff about music and games. Yet what do these people have in common? They were overwhelmed by a nostalgic feeling when finally rediscovering the short film on a device that relies on binary programming, math again, and for such a magical (nostalgia-inducing) feeling\u0085 mathmagic, indeed. Still, I read some comments on IMDb complaining that the film failed to deliver its premise and betrayed a sort of intellectual pretension from Disney studios. Well, I don't think of any cartoon that took the same challenge after this one, and the film is so didactic and pedagogical that it's very likely to raise an interest on math, so what's the problem? And speaking of my personal experience, although I had this film recorded at the age of 8 (it was the Disney Channel and the program was always closing with a longer feature), as I was growing up, my passion for mathematics grew and so did my interest for this short. I was not just good at math, math made me curious and playful. There was something fascinating in that flawless universe where certitudes were absolute, a world of real application, yet all made of abstractions, the greatest challenge human intelligence ever had, one that shaped our universe, our history in its most appealing forms: nature, music, sports, beauty and progress. There's nothing that doesn't owe something to Math. And it's all a matter of proportions, like the Golden rectangle, the figure that keeps the same proportions, everything obeys the same rules, and what applies on the vast universal scale, applies to nature and human body. The gravity operates on the planets as well as billiard balls; a big wheel moves a car while a small one makes a telephone work. The same proportions of a musical scale can be indirectly found in a tree's form. And when I finally got the pentagram part at the age of 17, I immediately took a paper sheet to check by myself the properties. It was magical. This is a ubiquity one can't ignore, and it's remarkable how the essential about math is showcased in less than half an hour. Esthetically, the film finds the perfect pedagogical note, swinging back and forth between real-life footage, cartoons, and schematic explanations. I didn't notice it back then, because I didn't much care for the times of release, but now in 2016, I can't help but feel a weird sadness watching these images, because they were meant as contemporary illustrations, but now, the movie itself has become a past relic of its own present, dated because it ended before the greatest revolution mathematics would provide: computer's binary programs with all their 0 and 1. But to his credit, the narrator tells us that the applications of math are infinite, you can't confine them in a chamber or a limited space, let alone a short cartoon, only the mind is boundless enough to contain all the possible knowledge. The film is much aware on that, and therefore closes on this note with this great quote from Galileo: \"Mathematics is the alphabet with which God has written the universe\". So, as long as there will be a universe, there will be this universal language, and people from all over the world enriching our civilization on the field of Arts and Sciences. And with his limited screen-time, Walt Disney studios wrote the greatest tribute to mathematics, a marvel of edutainment that certainly encouraged many vocations, as sure as eggheads are eggheads.",
         "A Walt Disney DONALD DUCK Cartoon. While looking for true adventure, DONALD IN MATHMAGIC LAND learns a great deal about the vital importance of mathematics in the Universe. Loosely based on Lewis Carroll's ALICE books, this short film uses fun & fancy to teach some pertinent facts about the wonder of mathematics. Some of the ideas of Pythagoras are examined, the mysteries of the 'Golden Rectangle' are explored and the mathematical principles of the games of chess & billiards are exposed. The voice of Paul Frees as the Spirit of Adventure makes a fine counterpoint to Clarence Nash's vocalization of the Duck. Walt Disney (1901-1966) was always intrigued by pictures & drawings. As a lad in Marceline, Missouri, he sketched farm animals on scraps of paper; later, as an ambulance driver in France during the First World War, he drew comic figures on the sides of his vehicle. Back in Kansas City, along with artist Ub Iwerks, Walt developed a primitive animation studio that provided animated commercials and tiny cartoons for the local movie theaters. Always the innovator, his ALICE IN CARTOONLAND series broke ground in placing a live figure in a cartoon universe. Business reversals sent Disney & Iwerks to Hollywood in 1923, where Walt's older brother Roy became his lifelong business manager & counselor. When a mildly successful series with Oswald The Lucky Rabbit was snatched away by the distributor, the character of Mickey Mouse sprung into Walt's imagination, ensuring Disney's immortality. The happy arrival of sound technology made Mickey's screen debut, STEAMBOAT WILLIE (1928), a tremendous audience success with its use of synchronized music. The SILLY SYMPHONIES soon appeared, and Walt's growing crew of marvelously talented animators were quickly conquering new territory with full color, illusions of depth and radical advancements in personality development, an arena in which Walt's genius was unbeatable. Mickey's feisty, naughty behavior had captured millions of fans, but he was soon to be joined by other animated companions: temperamental Donald Duck, intellectually-challenged Goofy and energetic Pluto. All this was in preparation for Walt's grandest dream - feature length animated films. Against a storm of naysayers, Walt persevered and over the next decades delighted children of all ages with the adventures of Snow White, Pinocchio, Dumbo, Bambi & Peter Pan. Walt never forgot that his fortunes were all started by a mouse, or that childlike simplicity of message and lots of hard work always pay off.",
         "This cartoon is much too great, for one thing, it used the cantakerous Donald Duck and the seemingly \"bored\" math to mix together, so, it made more fun and great knowledge that everybody, even the adults, will approved it, too bad, why didn't I use this before? This film used lots of math knowledge, like golden ratio and golden rectangle, Pi, full of laughs and fun, I did like the episode when Donald try to fix himeslf in a golden rectangle shape, but to no avail, bad luck! It simply proved that Donald weren't perfect, too. Pythagoras in the film also great, gags and maths, together created a wonderful educational film for Disney and Donald Duck himself, for sure, it seens like Disney staff have different creative ideas, too! Especially put Donald Duck inside, and at last, with the help of The True Spirit of Adventure, Donald finally understood have math great are, and me too! I learned a lot from this film. Overall, it's one of the best Disney and educational film I ever seen.",
         "This movie is a must-watch by anyone from age 6+. It may be from Disney. It may have a cute, animated Donald Duck on the cover. It may be a classic \"short\" (27 mins). What is most impressive about this IMPORTANT piece of entertainment is the ability to converge entertainment with education to create something children, high school students, and professional mathematicians alike see the value of this excellent little film. This is not your standard short about Donald playing hockey with his triplet nephews. It isn't Mickey and Pluto chasing Chip and Dale up one tree and down another. It isn't Goofy \"YA-HA-hooey\"ing his way along another bumbling adventure. This is good old fashioned egghead mathematics in the most joyful, silly, absorbing way possible. It is a marvel. If you are a math teacher, PLEASE buy a DVD copy of this and show it annually to your classes, no matter what grade - 1st-12th -- even university-level would find it invigorating. If you are a student of any age, track this down and watch it. You'll never look at music, chess, pool tables, or algebraic equations (yes, they are all in there) the same again. The best review I can give is this: My sister-in-law teaches 4th grade math and had never heard of this show. I went home and pulled it out of our library to \"loan\" to her. When my college-age son saw what I had in my hand, his eyes lit up. \"My Trig teacher put that on for us! It's AWESOME!!!\" I'm 52 and flunked geometry in high school. My 19yo son was an honors math student through high school. If we can BOTH find this little short to be incredible, I could ask nothing more. Disney, I applaud you. Thank you for this tiny slice of edutainment that is worth every penny and every second spent watching. It's pure \"mathematical joy\" - two words I never thought would share the same sentence in my vocabulary.",
         "\"Donald in Mathmagic Land\" is the sort of cartoon that math teachers have been showing their students for years. It's a case of bait and switch, as important scientific and mathematics concepts of contained here...and it looks like fun since it stars Donald Duck. While this does make the material more palatable, it still is a well made but rather dry film. When it all begins, Donald wanders into an odd land where there are lots of numbers and symbols. Suddenly, the narrator (Paul Frees*) begins talking about Pythagoras and geometry. Donald, inexplicably, finds this all very fascinating and this isn't completely surprising as the concepts are explained in ways that normal folks could understand--such as the use of geometry in games such as football and billiards. By the end of the film, Donald has been thoroughly convinced how swell math is and the viewer, hopefully, is still awake. I am a bit cynical about this one. Considering what the film is trying to get across, it does it in about as entertaining a fashion as possible. And, the artwork is very nice. But it's STILL a relatively dry topic and kids hoping to see Donald up to his usual antics will no doubt feel a bit let down by it all. Not a bad film at all...and one that was nominated for an Oscar, by the way. *Frees is also the voice of the narrator in Disney's Haunted Mansion at Disneyland and Disneyworld. He also is the voice of Boris in old Bullwinkle cartoon.",
         "\"Donald in Mathmagic Land\" is a 27-minute short film which explores basic mathematic references in everyday life. 27 minutes may be long for cartoons from that era, but it's really short given the fact that there were no less than 4 directors and 3 writers working on it. I am sort of interested in maths and I've always liked Donald, but still somehow I did not find this one particularly interesting or funny. Then again I am not really big on Disney's works who take themselves seriously as an educational movie. The Academy thought otherwise and nominated it for an Oscar, but it lost to the Dutch entry from that year. Another mathematics meets cartoon idea won the Oscar, namely \"The Dot and the Line: A Romance in Lower Mathematics\": if you enjoyed Donald's take here, you may want to check that one out as well. It's also not even half as long. This one here is already over 55 years old and yet it is far from being one of the early Donald cartoons. And also far from being among the best in my opinion. Not recommended.",
         "Donald Duck (and the audience) is given a tour of how mathematics have changed the world and impact our everyday life. It's a cute cartoon (with a few live-action scenes), and I'd love to give it 10 stars - the only reason I rate it a bit lower is that this film doesn't seem to have a good target audience. The math discussed is far beyond the comprehension of the child who would normally watch Disney cartoons, and it's too childish for someone old enough to know what the various concepts are. Granted, when a concept is introduced, the narrator attempts to describe the math in a way that someone unfamiliar with it might comprehend, but I have trouble believing that they succeeded in that attempt. Having said that, this is an admirable and creative way to demonstrate how math is relevant to children who might otherwise despise the subject and it was fun and humorous. I'll certainly have my child watch it when I think he is old enough and that's as high a compliment as I can give any movie.",
         "When I was a freshmen student at the start of high school in 1967 my math teacher brought this film to class to wake up the lethargy and the lack of interest for math in the class. Everybody laughed when he was setting up the projector since it was a cartoon with Donald Duck. The general feeling was it was for 3rd graders and it was going to be a very long and boring 30 minutes. Once the shades were drawn and the lights turned off however the laughing stopped in about 5 minutes into the film. You could hear a pin drop the rest of the way through the presentation. After the film was over the questions started and never really stopped until the end of the semester. That film breathed new life and interest into the world of mathematics for all of us in that class. Our teacher was a great instructor and I guess he had similar experiences with that film in his other classes as well. That film woke up an interest in me that stayed with me through high school and college and even now to this day. I have a copy and I still watch it once in awhile just for the great memories of so long ago.",
         "This is a magically educational cartoon short starring Donald Duck where he delves into an adventure of numbers, points and charts in showing us how mathematics works in real life and how math can sometimes be magical. I have seen this short a number of times in elementary and middle schools, particularly during the time when math is taught. Though it is not the typical funny cartoon where we see Donald and his misadventures, this short is actually pretty neat and engaging, showing us how shapes, charts, numbers and math gadgets work in a clever way, utilizing that special Disney touch. The animation is vibrant and brilliantly done and it is fun seeing Donald take on a more unique role in getting kids to learn, while retaining his lovably frustrated personality. Overall, a pretty good cartoon that can both be fun and educational. Grade B",
         "This interesting failure shows us how Disney, never content with being an entertainer and businessman, had intellectual pretensions--sometimes magnificently realized (as in Fantasia), rather less well here. I say this as a great fan of this puzzling but lovable attempted documentary in cartoon form. The pool table sequence goes on for far too long, and contains very little actual math (the same could be said of the whole movie). Disney ultimately lacked the courage of his pretensions, and the movie positively drowns in these little pop culture references, possibly included to forestall charges of elitism. The closing sequence lurches into what we would nowadays call \"Intelligent Design\" territory, and a reference to God's guiding hand is squeezed in at the last minute, perhaps to placate red-state viewers. So what you are left with is a mishmash of elegant, graceful animation (some of the finest ever committed to screen) combined with a jarringly superficial treatment of the subject. And yet, and yet; the opening segment, with the waterfall of numbers and the jam session with the Ancient Greek mathematicians, has a sense of wonder and hallucinatory magic that has rarely been equaled. And there is always Donald, our favorite everyman, who learns that math isn't just for eggheads, after all."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["Donald's goes on an adventure in which it is explained how mathematics can be useful in real life. Through this journey it is shown how numbers are more than graphs and charts, they are geometry, music and magical living things."],
      "budget": 0
   },
   "movielensId": 172935,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-06-26",
      "dvdReleaseDate": null,
      "directors": [
         "Les Clark",
         "Hamilton Luske",
         "Wolfgang Reitherman",
         "Joshua Meador"
      ],
      "runtime": 27,
      "movieId": 172935,
      "title": "Donald in Mathmagic Land",
      "mpaa": "NR",
      "actors": [
         "Clarence Nash",
         "Paul Frees"
      ],
      "imdbMovieId": "0052751",
      "originalTitle": "Donald in Mathmagic Land",
      "genres": [
         "Comedy",
         "Animation",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Disney used animation here to explain through this wonderful adventure of Donald how mathmatics can be usuful in our real life. Through this journey Donald shows us how mathmatics are not just numbers and charts, but magical living things.",
      "tmdbMovieId": 19715,
      "avgRating": 3.8125,
      "releaseYear": "1959",
      "numRatings": 8,
      "posterPath": "/mPvhkiOFXlwdccEAV67cNW0CaGK.jpg"
   }
}