{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 42,
      "synopsis": "Harnessed children, with alien machinery in their backs, work like drones on top of a building. There are a dozen of them and they're scavenging scrap metal. Mechs and skitters stand guard out front. Tom and his group conduct surveillance from a rooftop across the street. There are 6 aliens and five of them. They're talking about coming back later when Karen knocks a brick off the roof and the aliens hear and open fire. They have to retreat. Back at the high school HQ, Tom is immediately swarmed by parents of missing children asking if he saw them. Anne suggests the parents post their pictures on a bulletin board. Porter is back and delivers a briefing in the command post. He reports a scout ran into resistance fighters outside of Chicago who know about groups in Texas, Oklahoma and California. The bad news is alien structures are going up over other cities, like Boston. Porter orders them to collect intel and war material. Weaver tells them he'll be breaking them down into teams of four and six fighters. Tom tells Porter what he knows about the harnessed kids. He tells them the science team removed harnesses from three kids, but they died hours later. He says now the chief surgeon thinks he has a solution, but he needs to test it. Tom knows he means Ben. Weaver doesn't want to bother with rescuing a dozen kids, but Tom tells him it's important to keep hope alive by bringing parents their kids back. He tells Tom to just bring Ben back for now. The civilians have set up school in the gym. Tom finds Matt sitting by himself. He's worried about his brother. He heard the kids die when the harnesses are removed. His dad tells him a doctor figured out how to take them off safely. Uncle Scott brings Pope food in his cell. He objects to the preparation and rants about the technique. Turns out Pope was a chef. Uncle Scott suggests to Weaver that they let him cook. Weaver checks with Maggie, who vouches that Pope can cook. He learned in prison. When Pope comes in, he complains about their cooking equipment but says he'll take the job. Tom checks with Anne about the doctor. She describes him as very smart and competent and sure he's the best for the job. His name's Michael Harris (Steven Weber). Tom knows him. Later, Michael tells Tom about getting separated from Rebecca, Tom's wife. He tells Tom he's sorry. The next day, Tom and usual group watch the harnessed kids, looking for Ben. Mike sees his son Ricky and immediately jumps up yelling and runs for him. Tom tries to cover him and throws a bomb at a mech. Mike gets his son in the truck. Tom wants to go back for Ben but a mech shoots at him and knocks him out. Dai grabs Tom and throws him in the truck. Karen and Hal run but soon find a mech in their path. Cut to Tom waking up with Dai, Mike and Ricky. He doesn't want to go re-arm and wants to get Karen and Hal. He takes Dai's shotgun and walks down a dark hallway. He hears a noise and is soon face to face with a skitter. He runs but it races after him on the ceiling and knocks him down. It gets on top of him, but Tom scoots for his sawed off and blows off one of its legs. That slows it down so he can shoot it in the head. He beats it with his gun until it stops moving. Back at camp, Anthony reports to Weaver that they didn't get Ben. Weaver hears a hubhub and goes to investigate in the hallway. He finds Tom dragging the still kicking alien down the hallway. \"I brought you a prisoner of war,\" he tells Weaver. Weaver is impressed. Tom gets a fresh gun and heads out. Hal wakes up in the rubble to see his zombified brother dragging Karen away. A mech shines a light on him and five hardnessed kids line up to face him. A skitter inspects him then the mech opens fire on the harnessed kids. Dr. Harris prepares to do surgery on Ricky, who also has cystic fibrosis. Weaver stops in and Dr. Harris essentially tells him to get out of his way. He says they have to cut the harness out instead of removing it entirely. He lights a small torch and starts cutting the harness needles. He thinks the harness supplies the kids with a drug and they were dying when they were suddenly cut off. So he's pumped Ricky full of morphine in preparation for slowly lowering the dosage. They have to leave the probes in the kid. Harris explains that the harnesses are partially organic, so over time they fuse into the kid. Tom runs down a dark street and sees Hal stumbling toward him. Hal tells him the skitters took Karen. He doesn't understand why his dad left, but Tom says he was knocked out. Hal tells him the mech killed the kids and let him go. Tom recognizes it as an old Nazi trick, leaving one alive as the messenger. So if they go back, they have to get all the kids. At the high school, Porter is excited to have a live skitter to study. He's going to have Dr. Harris stick around for three weeks. Pope feeds people and Weaver says he'll give him a week tryout, but he still has to get locked up when he's not working. Tom visits Ricky, who is still knocked out after the harness removal. Anne says he's stable and it seems like the procedure worked. Tom finds Dr. Harris drinking Scotch outside the skitter's cell. Harris says there are people who think that those surviving the first wave of the invasion are the best of mankind, but he doesn't think there's anything noble about running away. Tom asks if that's how Harris survived. He blames him for abandoning Rebecca. Harris says he wasn't with her when the second wave attack started, but Tom says he found her with a bag that was too heavy for her to carry alone. Harris says it was a split second decision and \"I thought the community needed my medical skills...\" Tom decks him. Harris then says it's actually Tom who's responsible for her death because that morning Tom was supposed to go with her looking for provisions. Harris says that because he's now alive, Ben has a chance to live. Tom says the people who survived owe it to those that didn't to become the best of mankind. He visits the wall of missing children and puts up Ben's picture. He finds Hal wrapped around Matt, sound asleep. In its cell, the skitter wakes up. Ricky opens his eyes.",
      "writers": ["Robert Rodat"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1462059/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjE3NzI2MzYwOF5BMl5BanBnXkFtZTcwMjc1MDQ4NA@@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Noah Wyle",
         "Drew Roy",
         "Maxim Knight"
      ],
      "reviews": [
         "A show that started out showing us how a group of Americans were resisting an alien invasion in a post-apocalyptic world just appears to have completely lost its way and become about how many times we can save Tom Mason's family. Who really cares anymore? In Season 4 it appears that Earth's only surviving group of resisters are in about 4 camps. One of them is lead by Anne Glass, Tom Mason's partner who leads them all on a merry go round searching for her daughter (like they all don't have missing family of their own). Another of the groups is now lead by said daughter - who have laid down all arms by the way. A third group has just escaped from an alien camp and have the unfortunate deal of having 2 Masons in their group. Father Tom goes off to search for his youngest son leaving first son in charge of the rest of the resistance who have to wait for him risking alien abduction. The final group are being indoctrinated by the Aliens with the 4th Mason Matt being one of the only resisters. Its fascinating how some of the aliens have gone from being indestructible with guns in season one through to being killed by knives in season 4. Completely lost its way in my opinion. Lets get back to Earth Council, organised resistance, real military not all led by Masons (is there a hidden message there?) and please is there any other resistance anywhere else in the world? If the future of the world depends on this group of 100 odd people led by Masons, then the aliens might as well kill them all off now!",
         "Season 1 was pretty good for a low-budget sci-fi. There was a family dynamic, there was true tension, and there were constant alien attacks. Out of all of the seasons, the first was the most realistic. Season 2 was pretty good, too. A trek to Charleston, political infighting, aliens winning the war. Season 2 was probably the best. However, the writing was on the wall, and the decline was inevitable. People began developing \"relationships,\" random events were becoming more and more fortuitous, and the purpose of the 2nd Mass seemed to disappear. Season 3 was a significant decline in the quality of the story. With the introduction of the bubbleheads, plot lines became cheesy, the characters became idiots, and the storytelling style began to resemble Parenthood more than War of the Worlds. Season 4 is in line with Season 3. I think the series has jumped the shark with the Lexie storyline. Not only is it highly derivative (see the Adria storyline from Stargate:SG1), but poorly written. Not only that but you get GI Jane version of Dr. Glass, insane zealot Lourdes, blind to reality Tom, and cardboard sidekick Weaver, but you also get plasticky bubbleheads that have similar personalities to the Asgard of SG1. I can't overemphasize the fact that Season 3, and especially Season 4 feel like poor remakes of Stargate:SG1. I'm not sure that I'll stick around for season 5. I loved Season 1, I liked Season 2, I was OK with Season 3, and I'm bored with Season 4. In the end, I'm afraid of season 5.",
         "Having read so many \"reviews\" which consist of watching 1-5 episodes I would like to comment myself having watched the entire series. This is not one of the best sci-fi series i've ever watched. However it is much better than anything else out there now. I wasn't too sure about the series after the first couple episodes and it had a strong Stargate Universe feel to it. I'm not going to post any spoilers but I can say the story significantly improves in my opinion and so does the care factor for the characters and where its all going by the end. The finale is a blast and had my girlfriend look at me with her mouth wide open after the ending and that we need to wait until next summer for the follow up... She wants to see it right now! As do I. The season ended very well and the show has been massively underrated on here. If you haven't seen the show or you've seen a few episodes and aren't sure. I encourage you to use your own opinion and give it a chance i'm sure you will like it much more by the end.",
         "This series started off good, took a weird and barely entertaining turn in season 4, and ended with a dud. I spent 5 summers watching this show only to have the climatic victory last around 10 minutes. They tried to introduce too many new characters and story lines with very few episodes left, leaving the last season feeling crowded and unfinished. The aliens entire reason for the invasion might be one of the stupidest moments I've seen on TV, right up there with the Rachel/Joey romance and that weird ending to Lost with all it's flash forwards and sideways crap the last few seasons. I mean come on, earth defeated the aliens once with sticks and rocks and it took these guys 5 years to do it? I'm not buying it. Like I said I enjoyed the show early on but I only hung around the last few seasons to see how it would end, and now I'm glad it's over.",
         "I do not know what happened behind the scenes leading up to Season 4, but something major changed back there. I would assume I would have heard about a major writers strike, but whatever the reason, this show is now sunk, in my opinion. There is a dramatic shift in tone moving into Season 4, something which is executed in an extremely clunky manner. The context, pretext, and everything else about this season is so very amateurish. The character & plot evolution that happens should have taken a season in and of itself, but is crammed into a single episode. Mild mannered characters are suddenly expected to be accepted as Rambo. Other characters change Race with no explanation (no joke). Major opponents shift tactics in a seriously fundamental way. (Nazi Germany, to Starship Troopers) Honestly, it's as if there's an entirely different crew behind making this show... and they're all interns. Throw out all the knowledge you've built up during the first 3 seasons, suspend your disbelief, and you might just enjoy it.",
         "After watching the entire show - honestly, after S2, continued to watch just because I really respect Steven Spielberg - gave it 5 out of 10 stars because it's average in just about every category. There is no clear story line, most of the key events happen randomly, out of nowhere, and the pace also seems to be changing at random. Also, you just know, since day one, which characters are expendable, and which ones will survive. No matter what happens, no matter how cornered they appear to be, the Masons always manage to pull out easily. Surrounded by 1000 Skitters? No problem, there's probably a subspace turbomodulator buried right under their feet. There's a top secret enemy agenda that could turn the tide of the war at the last moment? No problem, there's a random orange semi-sphere, made by the enemy, that has only one purpose: to transmit those super-secret messages to those who touch it. Sorry, I HONESTLY believe I wrote smarter sci-fi stuff back when I was a 14-year old kid. As sci-fi as a genre declines even further, the audience seems not to care at all about the quality of the shows anymore. Honestly, I'm surprised by the number of people calling this show a good, fresh or smart one. It's really not.",
         "At first, I have to say that I really had some expectations for this show. I mean, yeah, the plot was nothing revolutionary but i still hoped to get some good post-apocalyptic/drama/sci-fi TV out of it. Oh God was I wrong. The acting was awful. The actors were stiff as boards, not as nearly depicting the situation they were really in. Combine that with truly annoying characters and you have the recipe for a disaster (man did I hate that religious girl). And the babbling about history and great battles in the past where smaller armies defeated much larger ones? Well how many times in history did armies wage war against aliens? *facepalm* The writing was so cheesy and full of clichés that at one point, I actually hoped that the aliens were just gonna nuke them or something, just to put an end to it. An awful soppy family drama with huge holes in the plot. But nevertheless, I continued to watch, hoping that it might get better. Well, it didn't. It just got worst, the season finale being not worth watching and insulting my intelligence. As user idonotexist wrote on the message board, the scene where the aliens tell Tom that they didn't expect such resistance, well I \"wanted to peel my eyes off\". p.s Who the hell gave money to do a season two!?",
         "OK, i've made it to the third season. What did i see until now? A bunch of people survives an alien invasion, tries to group up with other survivors across the USA and tries to fight back the bad aliens helped by the good ones, which arrive without any decent explanation, the most obvious deus-ex-machina ever. in like in more than 1200 minutes of series this is all that happens: so whats the deal you say? Well, actually there is none. This series a MEGA LOAD of useless and empty dialogues, between stereotyped characters, mixed with all those \"already seen\" family dramas (the lost/captured/infected son, the boyfriend/girlfriend, the hard role of the leader/father and every clichè you ever seen in any post-apocalyptic movie/series). Topped with ultra evolved aliens with ROBO MECHS who cant even aim at a car and shoot randomly killing 1 human out of 100 alien-plasma-gatling-rocket gun ammos. But hey, lets shoot that bad ass alien war machine with my ak-47, i like the sound of bouncing bullets. Really stay away from this, sci-fi doesn't have ANYTHING to do with this series, because the prefix SCI actually means that there is something scientific in it, while there is not. There is no logic in the behaviour of characters, in the action scenes, everything is driven by what every stereotyped character has to do to fulfill his predictable and boring role. If this wasn't from Spielberg it'd have died in one or two season, i can guarantee you that. Or maybe even not, considering another series which is the copy of this (yes, The Walking Dead) had an unbelievable success where i found it the most boring, melodramatic, stereotyped, zombie flick ever, even among some b movies. Im giving this a 3 just because the majority of actors are good and the CGI as well, too bad all those good resources were wasted on a SO EMPTY storyline. There is a ton of good series that are worth your time if you're looking for some sci-fi, don't force yourself to get to the point when you're watching the screen after 120 minutes and think \"my GOD is something entertaining gonna happen or what!?\". Spielberg phone home and never come back.",
         "Having allot of night shifts in a row, with loads of hours needed to be spend doing something, i started on this TV-show, mainly because i just love sci-fi. However, the sci-fi part is really a small part of this TV-show, mainly is is a constant emotional roller coaster ride, up and down, in every episode, one just have to close his eyes and listen to the background music, its just crazy how it can keep on going. 1. try to count how often \"Family\", \"hope\", \"faith\" and trust\" are used, its just ridiculous. 2. Notice how they never seem to learn from anything, they keep doing basic kids mistakes, yes, the fire will burn your fingers again the second time you put them into the flames. 80% of all the problems they get into, is not because the aliens are tricky, its because they are just really really damn dumb. 3. Notice also how they don't evolve to the situation, in a show like the walking dead, they slowly get more and more bad-ass, cynical and thorough, survival becomes a part of them. But not with these, its drama, drama, and then some more drama. Only my damn stubbornness and curiosity kept me going, i wanted to see how season 4 ended, but i can assure everyone, that I'm not gonna watch season 5, out of fear from becoming transformed into an emotional wreck.",
         "I do not understand why so many people are being so harsh regarding this show. Yeah, its basically \"The Walking Dead\", except with aliens...but I think this is a good thing. Unlike \"V\", this is a show that focuses on the survivors. Many reviewers have said that the characters are clichés. However, I would simply call them archetypes and I thoroughly enjoy watching most of the characters when they are on screen. It seems that many reviewers have based their opinions on the first 2 episodes. However, with so many characters, it takes time to get to know them. The show definitely starts off at a slow-burn. I think many people are having the same problem with this show as they did with \"48 Days Later\". Many people wanted to see a zombie horror movie. However, once they realized that the movie was a human drama and the zombies where more of a situation that humanity had to deal with, the reviewers whined that the movie sucked. \"Falling Skies\" is the same way. The show is not about aliens. The alien invasion is just the situation. The show is about the human drama that is the result of the situation. Watch more than just 2 episodes before you form an opinion. I think that you will enjoy it.",
         "In my original review I had many positive things to say. Seasons 1-3 were constantly moving between 'good' and 'excellent', at least for me, But unfortunately the show took a real dive from Season 4 Episode 1, and like most people, I went from an avid fan to someone who quit watching after no longer being able to justify my time on it. Season 1-3: The series is a drama/sci-fi hybrid about a family (and by extension-- the remnants of a society) post-alien invasion. We see some great acting, war, survival and drama (albeit sometimes a little cheesy). The acting is usually great and the story progresses at a steady pace as well. We see twists, story arcs, character depth, back story and lots of science fiction. Its certainly worth a try for any sci-fi enthusiast. Not quite Stargate or Battlestar standards, but good in its own right. Negatives: The CGI is awful. Be warned that your suspension of disbelief will have to be stretched a little further to be convinced that anything CGI is really there. Falling skies season 4 onwards: Absolutely abysmal. The story is completely turned on its head and moves absolutely nowhere for literally 6 episodes in a row(where I finally gave up). The characters Lexi and Lourdes are horrendously irritating, their story-line is boring, unresponsive and absurd, even by sci-fi standards. Tom mason is basically an unkillable superhero, and all of the progress or the first 3 seasons went straight out the window. As with everyone else on the forum at the time, I was completely bewildered as to how a show with (at least) a watchable standard could suddenly turn into....that. But it happened. I would highly recommend seasons 1-3, at least for a try But I would avoid Season 4 completely.",
         "Let me just settle one thing before i bash Falling Skies. When i say it's unrealistic, some people tell me \"it's a show about ALIENS, it's SCI FI, how real do you expect it to be?\" Well. Shows like Falling Skies and The Walking Dead are supposed to be realistic set in an alternate location. That's why you will never see a dog grab a gun and shoot invisible clowns. The shows are supposed to be realistic with a touch of fiction. I haven't watched Falling Skies for a while so i might be off on some details but i liked the first episode. It did show some promise. Of course, this was before the clichés and speeches with the sad music started to happen 2-3 times per episode. How annoying is that cute kid? What is it with Spielberg and his kid heroes? You know, the kid who whines about his birthday in the middle of an alien invasion, an apocalypse. His brother, Hal, is supposed to be 16. We only find that out after a couple of episodes, i assumed he was in his early 20's (i think the actor is like 22-24 too) but na, he's 16. Lacrosseplayer. Who happens to be the only handsome man in the camp since all the ladies are attracted to him (his GF, the Christian fanatic girl, the girl in the house where those guys were making deals with the skitters) How annoying is the Christian fanatic girl? Everything she says has some religious message. It's so forced, she's so happy and positive because she has God and she REALLY believes in the whole he-works-in-mysterious-ways thing because if there is a God who is good and mankind is about to cease to exist, that sure is mysterious. How annoying is Jimmy? He's one of the worst actors on FS; you know the scene where the Christian girl spends her daily 8 hours in front of the shrine praying, and Jimmy walks up to her and says \"why are you praying for these people? You don't even know them\" and he was VERY surprised at seeing someone pray for someone they don't know personally. Is that a big surprise in America? Or is his character just poorly written? He was genuinely confused when he saw that. I think it's weird. He already knows she's a religious freak, she believes in talking snakes, yet it's such a huge thing that she prays for a kid she never met. Moving along to the commanding officer. Don't know his name because he is so corny i never really bothered to remember it. He looks like a drunk redneck in a uniform his wife made for him. You know the episode where he had a breakdown and went to his house, prepared to give up the war and everything, but suddenly he finds glasses on the floor and completely changes his mind. Later on, he says that those glasses are his wife's. A week after the aliens attacked, he went home, and his wife wasn't there, neither were the glasses, but now, there they were. Like, he remembers in detail what his wife's glasses looked like and he also remembers the exact location of every obstacle in that house. What about the scene where they used mech bullets against the mech? They seriously waste all their ammo on one mech, they didn't even aim, they just sprayed it and it turned out, all it took was 9-10 hits to bring it down. Don't get me started on Toms RPG hit in the end. What i really didn't understand is the final scene. The alien actually tells Tom that he is impressed by the resistance. Wow. This \"resistance\" is moving in snail pace with huge groups of people along roads, not even caring if they are detected, in a world where mankind is down to 10% of it's species. They have been invaded and almost conquered. But despite all that, the alien says he is impressed. I don't buy it. I can't allow myself to buy since it's a load of crap. It's like if i have to fight a 10 year old kid to death, and after breaking every bone in his body, i hold up and tell him \"can we please talk this through? I'm impressed by your performance\" Spielberg keeps making a fool of himself with Falling Skies and Terra Nova and i'm sure that people only watch Falling Skies because there is no competition. Same goes for Terra Nova and The Walking Dead. Unrealistic, corny cliché. But hey. At least i know that when the aliens come, Christianity will be the correct thing to apply.",
         "This isn't just bad sci-fi, its dreadful TV. The plot holes are the size of craters. If this is supposed to be post-apocalpse - the producers have failed to hire a continuity editor to make sure that there is some sense of damage. The high school of refuge is in pristine condition with floors dust-free, the science lab immaculate and the medical supplies in brand spanking new boxes of apparently unlimited quantity while the civilians can't find food other than lima beans. Preposterously - the world best doctor shows up in a clean button down shirt, belt, and khakis as though he just stepped out of a limo. The children have ample art supplies, civilians apparently clean and ambling about raking leaves (what happened to the seasons?), and the local suburban housing un-used and not ransacked for supplies. The plot, already thin and laughable, isn't support by context. The CGI is irrelevant since the aliens are so incompetent with weapons one wonders why they have them. If there weren't bad enough, the characters are clichés. The only interesting person in the entire three hours I've seen so far is the bad-guy-turned-chef. I find myself more interested in how he made lima beans edible than how the best hope for teenage captives is a propane torch and morphine drip. Which as a surgical technique is plumbers work, literally. At least Mad Max had grit.",
         "If you're going to do an Alien Invasion series, it should, at the very least, be as good as 'V' from 1983. Well it's 2011 and Falling Skies isn't even a quarter as good. The acting is wooden, the script, lazy. Think the Waltons meets Party of 5 with a few aliens and 'baddies' (the aliens are bad but the real danger to the humans are the humans themselves - so terribly patronising - it's been done to death) thrown into the mix. Even the design of the Aliens themselves seems to have been undertaken by a below average sub-prime banker who, having lost his job, is now trying his hand at working in TV and got a job in the design team via an uncle producer who owes his family after they donated large sums of money to cover up his dubious personal practices which were discovered by the Stanford campus police back in 1984. Bi-peds copied from starwars. Skitters copied from starship troopers. Slightly changed of course, but nothing original. And the whole premise of a band of wholesome people on the run from a deadly force seems a bit irrelevant after the quite excellent Walking Dead has done the same thing, only infinitely better. Watched the 3rd Episode last night. I wasn't at all sure that anything could be as bad as the first two episodes, but that thought would evidently appear to have been vary naive. Shame on me for having a shred of hope that the series might improve slightly over time. Yes, you are right dear readers, the 3rd instalment was the TV equivalent of chewing someone else's toenails. Horribly wrong. The world has been taken over by an oppressive alien force. The humans are on the run. Despite this, the humans appear to be able to live in large numbers quite comfortably and undisturbed in a sizeable unconcealed above-ground building, strolling about without any sense that they might be attacked. What the heck are the aliens playing at? Just nuke 'em and put us all out of our misery. To compound matters, there only seems to be about 2 or 3 Aliens in the area at any one time, whereas there are about 300 humans. What the heck are the humans playing at? Just rush 'em with numbers, overcome them and be done with it. No sense of dread, no sense of suspense and no sense that any character is in mortal danger. Noah Wyle's son is staring down the barrel of an alien gun, the picture cuts to black and ten minutes later he shows up alive? I am Jack's complete lack of surprise. And as for the character of that bloke who was the leader of the outlaw group - one minute he's the leader of a gang of men guilty of rape and pillage and the next he's (voluntarily) the cook for the entire group of wholesome humans (who just killed all his buddies). Yeah, he's a real stand up guy all of a sudden. Are we just supposed to swallow this without question? Well sorry Mr Spielbergo, you might get away with that stuff with certain audiences but not with me sunshine. I'm angry at how bad this show has turned out to be. Im a massive sci-fi fan and usually i would got over certain flaws if the show has enough imagination to compensate. This has none.",
         "Normally not one to watch many TV-series but this one caught my eyes. The storyline was simple enough: a group of people trying to make ends meet in a post-apocalyptic world in the aftermath of alien invasion. Simple! But oh my was I ever wrong. The show will probably not change your viewing-habits but it will leave you with an deep impression of the great care the creators worked by. The characters are well-written and well-acted, they have emotions and soul, personality. They seem real. The story is paced moderately and the show rarely focuses on one element, like pure action or spacey Sci-Fi-phenomena, for long but manages to find the balance between these genres, making a show everybody should be able to sit through. And enjoy :-) The setting, mood and world is believable (as believable a post-apocalyptic world would be to me) and the atmosphere reaches a point of realism yet maintaining the fourth wall. The aliens are charming and sounds like the velociraptors from 'Jurassic Park' (actually a good thing), but they are more than meets the eye. We want to know more of them, yet the show keeps them at bay. They blend seamless into the world of chaos thanks to the before mentioned care by the creators. This is not one of those series that rely on cheap jokes, puns, mundane stereotypes, half-cooked morale and whathaveyou, but rather depicts a world not unlike your own: clever and natural. Check it out :-) BTW, my first review ever on IMDb so be gentle with the rookie :-)",
         "Some Americans may feel this TV series is somewhat relevant to what is happening in Iran or Afghanistan or something like that. But these Taleban or Al-Quaeda warriors are several grades of magnitude better that the crappy folks from the Falling Skies. The show presents the Americans as very stupid bunch of folks who try to fight the asymmetric war as if it would be some sort of road picnic. So, we know the aliens are advanced, do have absolute air superiority, have the ability to sustain huge damage by bullets and their war machines are almost immune to normal weapons. So our heroes decided to fight them this way: Form a large group of folks, move during the day in a open space. Camp near bridges, if you want to camp in city, pick up the biggest building you can see. This way you can form the most visible target well suited for bombardment. Even when you know the normal guns are almost useless, always form search parties equipped exclusively with firearms. This way you can shoot a lot of bullets with almost no effect while running away. Noise from the shootout is always fun! Even when you know the enemy has air superiority, enjoy a lot of group activities under fresh air in broad daylight, especially with your kids. When the enemy is near, it is always fun to fight and scream something like \"WE HAVE TO RETURN FOR THEM!\" \"NO, WE HAVE TO RUN AND LIVE SO WE CAN BEAT THEM THE OTHER DAY!\" Or try to play the catch the ball with your dog, so aliens can easy notice you. It is always fun to reveal your position to the enemy for some really stupid reason. Even when you are under the pressure from the enemy, it is always fun to have disagreements about the strategy, the food supplies or just enjoy some firefight with a group of other folks. You will not get bored this way! An last but not least, please remember that all the supplies are in the cities in the supermarkets. I'm somehow scared that the series will end when the heroes die of hunger because they will be out of canned beans and biscuits. They will not be able to find any other food source! The show is retarded and shows the Americans in a very stereotypical way they are usually displayed by their enemies: As a bunch of egoists unable to survive harsh times, unable to adapt or invent some creative new strategy against the superior enemy. The Taleban folks have adapted more quickly an in more creative ways. Maybe the creators of the Falling Skies may learn a trick or two from them...",
         "Some movies and shows are a mystery to me. Why are they appreciated and loved and high rated by a community which claims to have high standards and no easy 'suspension of disbelief' ? OK, maybe I have too high expectations from that community, namely the SF-lovers. I am at least one, but luckily no part of a community. I had no high expectations from 'Falling Skies', when it started, but they were lowered in an instant after watching the first episode, as I had to realize, that this show is not about Aliens, Science Fiction, or war, or even surviving the ultimate invasion, but about the American Dream, which is a dream since it isn't allowed any longer to be lived out: Adults and teens (male only in the past, but now also female) running around in then open, wavering and shooting all kinds of guns in a so-called situation of self-defense. That means complete freedom, no more fences, no more tax payments, no more traffic rules. A world full of rednecks, even some with academic degrees (at least those who can yield a gun fast enough), more or less united against the common enemy, some more or less willfully collaborating. And so it stayed, for the full first season, the full second season, the full third season, and the full fourth season. That is continuity, I said to me, at least. Maybe some people who get permanently bashed at work can come home, watch this show and go to sleep thinking about their lead role against foreign invaders like...everyone, in case of an invasion, of course. It doesn't do the show any good that Steven Spielberg is involved. On the contrary, it seems that a work of Spielberg today does mostly look for satisfying the smallest common denominator of the biggest number of viewers. There he failed with 'Terranova', which was one step above 'Falling Skies', but at least delivered some good CGI, some interesting theories and strange characters. Which 'Falling Skies' doesn't. It is a straight-to-beer-can delivery and grabs random pieces from the third-class storytelling wasteland of pulp magazine, that should never see the light of the telly in order to store the cockroaches where they belong. After unbelievable four seasons, that 80ies-like torture of an SF show will hopefully come to an end with the final 5th season. Oh, it's a shame, many will cry, there would be so much more to tell.... The only satisfaction that came to me is the idea that the story of the show has some parallelism with the US Iraq adventure. There, they devastated the country, too, tried to install a submissive government, which failed, too. Conversion of the society to western standards failed also. Because at gunpoint, such things usually do not work out very well. Which Israel could have told them long ago (if she would have had realized that, eventually). However, the season 4 finale was actually so massively ridiculous, predictable and stupid, I thought I would have maybe completely missed the subtle humor (or horror) of all four seasons. Am I a damn idiot, I asked myself ? Yes, I answered, it was idiotic alone to watch this show, hoping it would improve a bit in time.",
         "I love post-apocalyptic stories. I love sci-fi. Given those two statements I was, naturally, looking forward to this series with a great amount of anticipation. But oh my! On the strength of the two episode pilot, I am sadly rather underwhelmed. I expected Walking Dead with Aliens. Instead I got an unhappy mix of the War of the Worlds TV show, Battlestar Galactica and the Brady Bunch. There's altogether far too much \"family drama\" and not enough action/grim reality on display here. Token nods to reality, in the form of \"we need to find more food\" and such-like comments, do little to increase the believability of the show. Acting is passable, on the whole, but the show has what appears to be low production values. I'm sure this wasn't the case, but it just looks cheaply put together. In addition, though the Earth has apparently been conquered by the aliens, there seems to be no real sense of menace to the group. The aliens appear, but only here and there. Somehow, I would think the aliens would take a little more interest in a group of three hundred people trolling about the countryside. Instead, the aliens seem intent on \"lurking\" wherever the humans might conceivably go. Logistically, this is a nonsensical idea that is clearly a plot device, however idiotic. Likewise, along with the lack of menace, there is a total lack of urgency displayed by the group. They appear in no rush to move away from the infested city, no doubt in part due to the seeming lack of interest on the aliens part in rooting them out. A whole boat load of \"family crisis\" has been unloaded into this pilot. So much so that even those with a particularly sweet-tooth will find themselves feeling sickly at the sugary niceness of it all. Another rather irritating thing....along with the family melodrama comes one of the most cringe-inducing melodramatic scores I've heard for a long time. It's just overdone to a terrible extent. I'm sure it was meant to evoke sympathy for the plight of the poor citizens, but all it did for me was to make me, by turns, scowl or chuckle at the screen. The characters are thinly drawn and somewhat stereotypical. Grizzled War Vet, knowledgeable Professor, Lady Doctor, Annoying teen brats etc, etc. Of course, they all display the typical TV show lack of intelligence when it comes to dealing with their situation. So, for instance, a discussion in which they wonder why the \"Skitters\" have six limbs and the mechs are bipedal, doesn't end with any kind of speculation on the nature of the invading force, just a shrug. There's a whole military vs. civilian friction dynamic that simply shouldn't exist. An \"us and them\" mentality that is beyond foolish. The opening child's narrative points out that all the soldiers were killed and \"then the mummies and daddies had to fight\". Except...apparently not every mummy and daddy. It's a world invasion....shouldn't everyone be a warrior now? On the plus side, the series started out with a low, so things can only get better from here. Right? I certainly hope so, else this show isn't going to survive long enough for us to find out much about the aliens. SUMMARY: Looks cheap, stereotypical characters, no sense of menace or urgency, enough saccharin sweetness to give you Diabetes five times over. Will not survive the first season unless things improve greatly. EDIT: Episode 5 was the worst yet.....so much sentimentality and melodrama...I'm drowning...help! Help! Some TV company throw me a frickin lifeline here! There must be better things to watch......gurgle. EDIT, EDIT: Oh God! There's to be a season 2! Here's hoping they listened to what was wrong with season 1. EDIT FOR OPENING OF SEASON 2: Well, it IS better... but there is still the tendency to drop into piano-music accompanied melodrama at the drop of a hat. You have to be a real cheese lover to enjoy this. Hopefully it will improve, but then, I've been saying that since the first episode of season 1, so.... EDIT FOR END OF SEASON 2: Yes. I watched right to the end! It is getting better and I will tune in to Series 3 when it airs. I've even given it an extra star. But no more! I have my limits! EDIT FOR SEASON 3: Ah, what to say. Opening episode skips 7 months of time. New alien at the end of S2 are now allies with no attempt to show how that all came together. The tendency to melodrama and over sentimentality has returned with a vengeance. For God's sake stop with the piano music. It takes more than that and having the main character cry or be angry in turn if you want the audience to connect with your hero. Speaking of which... get rid of Noah Wyle. Get somebody new in or at least have the guts to kill him off and do away with the whole vomit-inducing \"Family is everything\" shtick. It got old in season 1 guys! Stop with the formula writing crap already! -1 star for failing to shoot the piano player! END OF SEASON 3: It got better! Oh no, wait... I started watching Revolution, which is so bad it makes this look better. Falling Skies... better than Revolution! There is a ray of sunshine on the horizon! SEASON 4 EDIT: It is much better! To the point where I've given it another star! It's a little over the top, plot-wise, but enjoyable. I'm actually now a little sad that it is finishing after season 5.",
         "The saddest thing about this show is how few SciFi-Fans actually get how cheap, unimaginative, repetitive and lame the show got over it's course up to season 4. There is very little good to say about season 4. Actually I can't think of anything. About every idea is old, every dialog feels phony, acting appears bored and staged and the plots and main plot are just plan stupid. Do the people making this show and the actors saying those lines really not notice how bad this show has become? Or do they not care? Or are they in a collective hype and don't see clearly anymore? But anyways. The fact that some people call this still a good show or even praise season 4 to be the best saddens me a even more than the quality of the show which had such potential.",
         "It pains me to see so many negative reviews. Unlike many of the other opinions, I find this TV show to be fresh take on an old story. I enjoy the gritty depiction of humanities struggle for survival, yet their ability to unite together in such odds. I enjoy the progressive discovery of how the aliens think and feel. They don't dumb them down and make them simply a tyrannical race that is out to destroy the world, nor do they make them unbeatable. The Visual effects have some very strong moments. They are not afraid to show the aliens and they also do not steer in any open ended directions. They meet questions that arise head on. There are weak points in some of the machines CGI, however. Nevertheless I find it subtle enough to where I can take the show seriously without noticing any flaws. I rarely discover a show that I am able to get so involved in. I feel I can insert myself into the story when watching and be apart of the adventure that is unfolding, and at the end of the day they tie in hope. Some people have issues with the religion that is rarely thrown in. I personally find it refreshing. It is in dire times that people turn to faith. Realizing that there may be something beyond themselves. It gives hope, not matter what you believe in, and hope is what gets you through. Rather than taking an offended stance I enjoy watching the integrity of those who maintain faith, and the respect given for the differences we all have in such walks of life. Rather than going into specifics about the show I encourage you to watch it yourself and form your own opinion. There, at present, are only 7 episodes so it will not be hard to watch in order to form an opinion. In closing I find this show fresh, gritty, yet filled with hope and strength. I have enjoyed every aspect of it and I hope to see more seasons to come!",
         "Season one of Falling Skies was fantastic: battles, high budget special effects that look like an A list movie, and a main character who is likable and relatable because he will do literally anything to protect his boys. I came away from season one slobbering for more, and with a 9 month wait it was essential that they keep audience interest. I should have known it was too good to be true. Season 2 started off well, with main character Tom returning from the alien spaceship to reunite with his sons. Alien hybrid son Ben, no longer content to sit on the sidelines, had turned into a warrior out to do or die for the 2nd Mass. A lot of the season 2 stories involved him, which was fine with me. He's an interesting character whose growth and coming to terms with his new nature was done well and well acted. Then what I'd seen coming from the first episode came to the forefront: the pandering and fanservice to the squealing teenage and lonely middle aged crowd reared it's head. Tom all but abandoned his sons--his reason for living--to rush into a relationship with the series' one-dimensional and wholly boring Anne. One son was struggling to find his place, one was leading a fighter squadron, and the youngest was...well, we're not sure where poor Matt was while Tom shacked up with his concubine. Hey, why not? It had been less than a year since his wife and mother of his children was murdered by aliens, but a man has needs, yeah? Well, that takes care of the middle aged housewives, now how to get the teenage fangirls a-squealin'? Throw oldest son Hal, the Big Man on Campus, into a will-they-or-won't-they with token stereotype \"tough chick with a past\" Maggie. He flirts, she broods and rejects him. I mean, she simply can't get into a relationship because she's got a past, see, and she spends every scene alluding to it. This goes on for a while until they finally get together, sending those teenage girls running for their keyboards to crank out bad \"Haggie\" fanfiction. Those of us who are mature and actually like reason behind things had a hard time when Maggie and Hal giggled and actually made out during two separate alien attacks. Their lives were in danger and they're playing tonsil hockey. I definitely want them on my post-apocalyptic team. Spoiler alert: Maggie's deep, dark secret turns out to be that she ran with a bad crowd, spent time in jail, and had a kid out of wedlock. This would indeed be shocking IF THIS WERE 1950. Season 2 ends with the biggest cliché they could possibly come up with: Anne is pregnant. A doctor and a college professor could not figure out how to use a condom, apparently. Boring end to a largely boring season. I didn't watch the first half of season 3, so I'll wait here while you go read someone else's review. Okay, thanks for rejoining me. By now you know that the baby is an alien and Anne runs away with it, leaving the relative safety of Charleston to go...well, who cares, at least she's gone. Good riddance to boring rubbish. The remainder of the season was decent enough as soon as she left. Tom stepped down as President and stalked off on a trek to find Whats-Her-Face and the brat, but somehow never made it. Not terribly persistent of him. I'm thinking Tom finds her as boring as I do and was relieved when she split. There is one standout episode where Tom, under mind control from the evil Karen, relives his old pre-apocalypse life. We finally see his family and work life and are treated to a final, heartbreaking goodbye when he escapes Karen and returns to his old house. All good things must come to an end, and Anne and her thingie are returned in a most illogical way. Slight problem: the spawn is now around 10 years old. They grow up so fast, don't they? She runs to her daddy and clings to his leg. Meanwhile, Tom is looking at her like he wants to shake his leg and scream, \"Get it off me! Dear God, get it off meeeeeeeee!\" but he keeps his cool so as not to alienate his bed warmer who is watching with pride. Oh, and Hal and Maggie are apparently off-again. It looks serious this time, folks, like maybe it will last a whole episode this time. Take that, Maggie. That's what you get for saving Hal's life and ridding the world of Karen. Think twice before you do that again, girl. Overall, Falling Skies had huge potential, but fell victim to lazy writing and catering to what they must assume is a largely immature fanbase. With only 10 episodes per season, they try to cram in endless subplots and characters we don't ever care about (did you care when Crazy Lee died? General Bressler? The President whose name I didn't even know?)and fill the rest with boring, rehashed clichés.",
         "*** Mild spoilers maybe *** I have seen most of it up until 4th season's start. I just keep returning to it hoping that with each new season it will improve, at least something. But it doesn't. It is least logical, worst scripted, worst acted shows I have seen. Nothing makes sense there.. How can aliens come here with so advanced technologies, but fail to catch a bunch of barely surviving people in few years. And people are just walking around or sitting there for so long.. I could go on and on about the flaws of this show, and I keep wondering, how did it get to the 4th season at all???? I thought this show wouldn't survive the first. But unfortunately it did.. My sincere recommendation - there are so many more better shows to invest your time into, this one is totally not worth it.",
         "SPOILER ALERT I'm not a sci-fi fan so I don't really understand the comparison people make between this show and Stargate and Battlestar Galactica. But I do enjoy post apocalyptic films, and that's why I was looking forward to watching Falling Skies; it looked awesome in the IMDb description. What I didn't know before watching it is that lately, Mr. Spielberg has gotten a thing for family drama set in alternate locations. I get the feeling the people behind Falling Skies were thinking \"lets do a family drama. We got the rebellious, good looking teen age boy, the dead mother, the brave father trying to to the right thing but has issues raising his children on his own and of course, the youngest child who has no clue of what's going on and misses his mom. Every time the child's emotions are displayed (and it happens in almost every episode) there is some cheesy line with a sad piano playing in the background as he whines about his birthday not being celebrated while they walk through a chaotic and ruined world. If i whined like that in the aftermath of an alien apocalypse, my father would've probably slapped me back to sanity. But we have seen this kind of drama before, so many times. So the writers got the brilliant idea to display this family drama in a future where Earth has been invaded by aliens. Yeah, I know. I get the feeling that the focus is all about emotions and sadness amongst the people because there are tons of plot holes in the alien part of the story. They got brilliant technology, still they can't spot the big amount of people that is 2nd Massachusetts. We don't get to see them enter Earth, we don't see how it all started, all we get is some kid explaining it in the beginning of the pilot in some drawings. Awww. The actors are very corny, but that's probably because of the script. It's such a terrible script, it's purpose is to force you to feel something for the characters. You get the FEEL-SORRY-FOR-THE-KIDS feeling thrown at your face as the adults in every episode spend way to many minutes TALKING about how important it is to keep the kids safe. Why is this? If the adults get killed, the kids will die too, won't they? No wait, they will become aliens because it seems the \"skitters\" were once human as well. The whole first season could've been displayed in 5-6 episodes and the ending of the first season was so terrible. The RPG he launches at that one alien air plane of course hits it (while the air plane was flying to the mother ship). One shot, one kill. Who could've seen it coming? Yeah, everybody. So as Tom walks back from the \"fight\" they had with the aliens, this space craft lands and one of the superior aliens wants to talk. The alien says he's impressed by the resistance the 2nd Massachusetts put up. Really..? I just get the feeling the aliens are to lazy to kill the Massa squad since there are about 100 soldiers and 200-300 kids and women. Must be something magical going on in the regiment because the same aliens that invaded the ENTIRE EARTH have such difficulties killing these people. Oh wait, there is magic involved, Ben got that thing where he can mess up the aliens frequency. I give this 3/10 because I like the story (even though its not even slightly original) and I do believe we need more TV shows with this storyline, but Falling Skies fails in everything else; script, actors, special effects - you name it, they fail it.",
         "Pros: 1) It's an alien invasion movie. Cons: 1) Acting is really bad. Fake emotions like attempting to be sad/distraught, but failing horribly at it. 2) Unrealistic - large number of humans roaming around, without being found by super aliens who had the technology to build HUGE ships (thousands of times larger than super aircraft carriers) and to come to earth, crossing hundreds, if not thousands or tens of thousands of lightyears. Humans riding motorcycles loudly and not being tracked? Laughable. 3) Scripts are cheesy and totally fake. Thoughts: This is 2011 folks. The camera work has to be much better than this. Even Star Trek Voyager from 15 years ago did a better job. The camera purposely moves away from certain scenes/shots so that whoever is responsible for special effects doesn't need to do it. Trying to cut a few pennies here and there. Compared to The Walking Dead, this one is a copycat and, really, there is nothing from this show to compare. I don't usually question things when a good or movie show is running. But when you are asking questions every 5 to 10 mins, something's clearly wrong.",
         "TL;DR: This show is alright, and it kind of succeeds in spite of flaws. It's dialogue-heavy, and a lot things that should be conveyed by using the camera to show the audience what's happening are instead spewed out of characters' mouths. There are a few issues with the plot, but it's not that bad. The aliens and the American revolution theme are pretty decent. If it had a higher budget it might actually be better than the border between mediocre and good. Gun safety is nonexistent in this series: in every episode the barrel of a loaded assault rifle is absentmindedly pointed at a child's head several times. The sexually abused character doesn't seem quite right, but I haven't known very many survivors of that kind of thing. A lot of the information that the audience needs to understand this show is put into the characters' dialogue, and it ends up feeling very heavy-handed. For example, there is an episode that steps seven months into the future from the previous events, and virtually every conversation between characters has the words \"seven months\" shoehorned into it somewhere. There are also countless other instances where the characters are chatting amongst each other when it makes no sense for them to be doing so--sneaking around in enemy territory, is one common example. There are also a lot of strange grammar mistakes in the characters' lines. It really doesn't seem like these are deliberate errors that are put there to convey the characters' personalities: in several instances there are highly educated characters saying lines that don't quite makes sense if you actually think about what they are saying. If the errors were somehow part of the story it wouldn't be a problem at all, but they seem to be just mistakes from a script that wasn't edited closely enough. The American Revolution theme is a good idea, but combined with the writing problems it makes the person who made this seem like a barely literate American bigot who didn't bother to learn anything but American history because \"'Murica's most importin place in da world\".. I'm sure the actual writer(s) (and, I guess, Americans in general) are very nice and all that, but the impression given by the lines in the show isn't good."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "DreamWorks Television",
         "TNT Originals",
         "Invasion Productions"
      ],
      "summaries": [
         "The chaotic aftermath of an alien attack has left most of the world completely incapacitated. In the six months since the initial invasion, the few survivors have banded together outside major cities to begin the difficult task of fighting back. Each day is a test of survival as citizen soldiers work to protect the people in their care while also engaging in an insurgency campaign against the occupying alien force.",
         "Survivors of an alien attack on earth gather together to fight for their lives and fight back."
      ],
      "budget": 0
   },
   "movielensId": 172915,
   "movielens": {
      "languages": [""],
      "releaseDate": null,
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 172915,
      "title": "Falling Skies",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "1462059",
      "originalTitle": "Falling Skies",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Survivors of an alien attack on earth gather together to fight for their lives and fight back.",
      "tmdbMovieId": 355426,
      "avgRating": 3.19231,
      "releaseYear": "",
      "numRatings": 13,
      "posterPath": "/3J5yMMCeaRBgseLroChWU5fJAPF.jpg"
   }
}