{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "strangler",
            "id": 18147
         }
      ],
      "imdb_id": "tt0059786",
      "video": false,
      "title": "Teen-Age Strangler",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jimmy Walton",
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db527",
               "name": "Bill Bloom",
               "profile_path": null,
               "id": 1167446,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Lt. Anderson",
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db52b",
               "name": "John Ensign",
               "profile_path": null,
               "id": 1167447,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db52f",
               "name": "Rick Harris",
               "profile_path": null,
               "id": 1167448,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe4aaac3a36847f81db533",
               "name": "Stacy Smith",
               "profile_path": null,
               "id": 1123477,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db537",
               "name": "Jim Asp",
               "profile_path": null,
               "id": 1167449,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db51d",
               "name": "Ben Parker",
               "profile_path": null,
               "id": 1159997,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db523",
               "name": "Clark Davis",
               "profile_path": null,
               "id": 1167445,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.212146,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 109097,
      "vote_count": 3,
      "budget": 0,
      "overview": "A troubled teen with an undeserved criminal past is the suspect when young women start turning up around town dead and marked up with lipstick.",
      "similar": [
         272693,
         397837,
         449176,
         10625,
         9880,
         308369,
         2105,
         222935,
         3597,
         26123,
         43923,
         57214,
         241848,
         10314,
         286565,
         37725,
         4951,
         9655,
         9377,
         37735
      ],
      "original_title": "Teen-Age Strangler",
      "runtime": 61,
      "poster_path": "/iBaPQ33eC38y1Oq9ZXsEYYa35np.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ajay Film Company",
         "id": 14001,
         "origin_country": ""
      }],
      "release_date": "1964-01-01",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "Budding Young Teeny-Boppers Were the Bluebeard's Prey! See Dismemberment and Death!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ben Parker"],
      "runtime": 61,
      "synopsis": null,
      "writers": ["Clark Davis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059786/",
      "coverLink": null,
      "actors": [
         "Bill Bloom",
         "John Ensign",
         "Rick Harris"
      ],
      "reviews": [
         "Yes, this movie stands on its own campy merits. I first saw it some 15 years or more before MST3K got their sticky robot paws on it (and made it even more hilarious). I am originally from Huntington, WV, where the movie was filmed, although I was only 4 years old when \"Yipe Stripes\" jammed the AM stations. Most of the cast were locals, many playing roles that they held in real life.",
         "It almost seems like a satire of teen delinquent movies. However, it takes itself just seriously enough to be even funnier. What's really hilarious is what passes for \"delinquent.\" The tough malt shop gangsters are readily intimidated by, and most respectful to, the police. Some even express concern about their parent's anger if they're out too late. The big drag race is at about 15mph and the only casualty is the retardo \"little brother\" (he actually appears to be a teenage cretin)and his bicycle being run off the road, causing him to cry hysterically---- though not as hysterically as the viewer will be laughing. The \"Little Old Lady From Pasadena\" would sure blow the doors off this crowd. The teenage chicks victimized by the psycho look like high mileage 35 year olds of the time, and most of the guys seem to be around 30 or so, some complete with receding hairlines. Most people will find this film quite a bore, but fans of low budget sleazy trash will enjoy it quite a bit.",
         "YIPES STRIPES! That song rocks. Apparently the only thing that does in this movie. Definitely not your standard high budget horror film, but after seeing it a few times, it's kampy cheesy effect does shine through! No actors come to mind here. The 20 and 30 yr olds...I MEAN, good old fashioned teenagers are puzzled by heinous stranglings in town. Is it a a teenager who strangles or someone who strangles teenagers? This will haunt your mind as the show goes on. There's a bad boy gang railing against contemporary social mores. Either that or they're big Hoya fans clad in leather jackets. Heavy teen petting occurs in the oddest of back alleyways in the shady part of town. Our teen gang is deep in a whodunnit. And then, there's Mikey. Man, the ONLY character that I can recall from his incessant whining! His panic attacks and tear filled lines about some bike. Major pity factor with this one. For laughs, check out the wannabe drag race. Ah, \"Yipes Stripes\". Who can forget this classic top 20 song? It's catchy beat makes your hips shake, hop up on diner counters, and swing till you're groovy! Watch how the girl lip syncing....uh, I mean SINGING the song. She really looks like she can't wait for happy hour! The guy behind the counter steals any scene he's in. \"And he didn't steal no bike neither!\"",
         "You have to like \"Teenage Strangler\". Or at least I do. There's so many problems and mistakes and inanities and miscues and missed opportunities here that it's like an all-you-can-eat buffet for your inner film critic. But it's still a likable (if laughable) film. The filmmakers didn't have a clue about how to write dialog, pace a scene, direct an actor, film a chase scene, edit a film, or, apparently, market their finished product for a wider distribution. And the acting on display here wouldn't pass muster at the local community theater tryouts. Every scene features some of the most tin-eared lines dialog you can possibly conceive, which are then delivered with some of the most hilariously inappropriate line readings ever kept on film. Example: \"I knew a policeman named Henderson once.\" \"The name I have is...ANDERSON.\" Another example. \"I'll pick you up from school I don't know how this is going to end but BY JUPITER I won't be...\" Everyone here is straining so hard to make a GOOD film, an IMPORTANT film that comments on contemporary morays while also displaying arch wit and hipness...and everyone here stinks up the joint something awful. Bill Rebane would abandon the project in despair. Ed Wood, Jr. would scrap these scenes as \"unsalvageable\". Herschel Gordon Lewis would decide that they just \"weren't suitable\". Larry Buchanan would...well, on 2nd thought, Larry Buchanan might use them. But only because he didn't have enough of a budget for another take. Highlights of \"Teenage Strangler\" include: The scene where \"Mikey\" and \"Betty\", in the emotional climax of the movie, have a joint meltdown in front of the police detective that will cause you to rupture your diaphragm. There is a hotrod 'drag race' scene where the hot-rods reach apparent speeds of 20 mph. The additional 15 mph 'chase scene' near the end of the movie between the same two hot-rods where the camera pans away and the Foley sound effects make it sound as if the driver shot himself and then exploded. There is the whole \"I didn't steal no bike neither\" subplot which exceeds all known FDA allowances for goofiness. There is the \"juvenile delinquent gang\" subplot which packs all the drama and emotional resonance of a toothpaste commercial. There is the psycho janitor, and the misunderstood sullen kid, and the \"Yipes Stripes\" dance party where the peppy girl dances and sings on the lunch counter in her pantaloons while the kids have epileptic seizures all around. (Oh no, my mistake, they aren't having seizures, they're dancing.) But you know something? It's all so kitschy and well meaning that you can't hate the people involved, and you end up enjoying \"Teenage Strangler\" for its campy sincerity and its fumble fingered tributes to far, far better films made by actual directors. The MST3K coverage of \"Teenage Strangler\" easily falls into their Top 10 all time enjoyable episodes. Let's hope it gets reissued on one of their DVD collections so it can continue to make our milk go down the wrong pipes and out our nostrils instead.",
         "I saw this one as part of an episode of Mystery Science Theater 3000 as I am sure many people did. The film kind of combines a murder mystery with those teenage rebel films as we get the obligatory random and in this case horrible song, we get a drag race and gangs and we get a killer on the loose! Granted, it is a bit telegraphed as to the identity of the killer as I was pretty sure who it was the moment he first appeared on the screen. Thus, rendering the murder mystery portion of the film almost moot. We get cops talking, we get fights in the local soda shop and we get Mikey, a brother who will do what it takes to clear the name of Jimmy and who kind of breaks down a lot for a guy. The run time on this film had to be incredibly short as the episode of MST3K that it was on featured a short that lasted through the entire first section of the movie time. I am pretty sure this one most likely did not have to get cut due to anything too risqué within as it looked like a pretty standard film for the times and in the 60's 'standard' usually means no nudity and graphic kills are few and far between. The story has a killer on the loose, strangling young women, hence the title Teenage Strangler. Of course, one of the women killed is most definitely not a teenage so the other title fits the bill better. Not sure why that older one was killed, but my guess is that it would make more sense in a straight cut of the movie. Well, the police are going around and badgering parents and interrupting the Yipes Stripes song so they can find and stop this killer! Jimmy gets the blame initially and his strange, overly emotionally brother will do anything he can to clear his brother's name including going to the police station to tell the police that Jimmy didn't steal no bike, which really isn't relevant to the whole strangling case, but that is how Mikey rolls! Jimmy runs afoul of his gang members and they must race; meanwhile, the strangler takes out a couple of other girls and that one girl who is kill boyfriend really takes it in stride. This made for a rather funny episode of MST3K as Mikey is such a wonderfully absurd character for the gang to make fun of. You take him out of the movie and it is still an okay episode, but with him in it just wow. Literally the guy is chewing the scenery any time he is on the screen. So, in the end, a movie that is kind of a combination teen rebel film and murder mystery where there is not much mystery because you have to be rather dense not to figure out who the real killer is. Thankfully, we only get the one song, but we get its tune played throughout the film as they really did not put much effort into the music in this film only playing the one song or bars of it throughout the film. However, in the end a pretty bad but harmless film that probably would have completely disappeared from the face of the earth if it had not been riffed by MST3K.",
         "This campy whodunit is an example of the fun that was the 1960s. There's a distinct \"Manos: The Hands of Fate\" flavor to the film as we have a shrill, overacting female lead, a creepy Torgo-esquire janitor, an authoritarian cop, a jaunty soundtrack that never fails to entertain, various shots of teens necking, and plenty of Southern accents to go around. Some of the scenes are superfluous (such as just about any scene with the character Curly), yet there is little denying that overall the film is quite enjoyable. Perhaps most fun of all, though, is the unforgettable character of Mikey. He's the androgynous, whiny teen that you just can't help but love. I give the movie a score of 6/10, and the MST3K version a 9/10.",
         "I saw this first on MST3K and then on video and I actually liked the movie on its own! Sure, most of the acting is laughable, especially little Mikey, but the music is great, there is some suspense, and a shower scene! This one might be hard to find, but it is pretty good and fun to watch on a bad day!",
         "Like many others, I saw this on MST3K (albeit a long time ago). It was hilarious, and I'm sure it's pretty funny on it's own, too. The plot has something to do with a teenage strangler, a new kid with a bad rep, his bike-stealing mongoloid younger brother, and a malt shop sock hop. What I remember most is the movie being so colourful that it was just pretty to look at despite what happened on screen, and of course the memorable acting of young Mikey, who was related to the director in some way to earn his role. Features the \"hit\" single \"Yipe Stripes\" and a cheat ending.",
         "If the fans of MST3K, such as me, can ever get together and create an MST3K Hall Of Fame, this movie might be inducted in as a charter member in the film category. John Humphries definitely will be inducted as a charter member in the actors category, along with such luminaries as Joe Don Baker, Ross Hagen, John Agar and...the guy...you know, the one who played Torgo. Humphries made only one MST3K appearance, but it was a great one, playing a character so annoying that you're just begging the other characters to give him a swirley or rub his face in crunchy underwear. Fortunately, Humphries seems to have a sense of humor and reality, as he didn't foolishly follow other MST3K actors into years of horrible films, thinking he'd eventually get his big break.",
         "Teen-age Strangler (1964) * (out of 4) Lt. Anderson (John Ensign) is investigating a string a woman who were murdered and he comes across Jimmy and his girlfriend Betty. It appears then two were together moments before Betty's friend was murdered and the suspect is Jimmy. Soon more bodies are turning up and a twist in the story happens. TEEN-AGE STRANGLER (the title on the Something Weird Video print) is a pretty awful movie from start to finish and its 61-minute running time feels almost triple that. The film is a complete failure but at the same time there are moments that are bad enough to where you can find yourself being entertained. I'm not sure what the filmmakers of this were thinking as it came about a decade too late. Even by 1964 standards this thing is kinda lame and shallow. There's certainly no shock value or exploitation moments going on so basically we're watching a bad and predictable mystery with a couple murders sprinkled throughout the running time. I must say that I did like Ensign in the role of the tough cop and I did have some fun watching him bully around some gang members. John Humphries is also memorable as the brother who has some sort of \"issue\" that will certainly give the viewer some laughs. These bad moments are thankfully bad and campy enough to add some entertainment value to the picture. Still, the horror, mystery and \"hot rod\" aspects of the film are rather boring so it's too bad but there's really not much here.",
         "The murders in this schlocky, mistitled movie seem merely peripheral to the real action, which is all the singing, dancing, flirting, and fighting at a local teen hangout. It is hardly surprising, then, that the filmmakers include a songwriter of two tunes featured in the adolescent action. Though the settings are realistic--since actual locations were utilized--no one succeeded in finding a competent director or cast. Bill Bloom, however, as Jimmy, somehow struggles through the mire of an inane script to show some skills as an actor. Most of the players range from wooden to overwrought, so that the movie does emerge with some worth as an unintentional farce.",
         "Totally and utterly lame-o, with such a high cheese factor that it makes for hysterical viewing. 'Teenage' Strangler(never understood this one, as the killer isn't a teenager nor is he exclusively killing teens), is a vastly awful film, not quite on the level of Manos but pretty close. To start with, the 'actors' are all rejects from the local community theater. The worst example is not the over-dramatic Betty or the incredibly whiny Mikey, but actually the woman playing Betty's Mom. She is laughing and upbeat the entire time she is talking about the tragedy that saw her daughter's friend strangled right in front of her eyes, and she is so chipper to the cop that's come to talk to her traumatized daughter that one wonders what she had been smoking or popping just before she came on set. The dialog is horrible and wooden, and there are weird sound affects here and there. Not to mention that someone is clearly heard giggling in the background when the cop is standing over the dead body of a strangled girl while solemnly talking about the murder. Just who, one wonders, thought that this death was so funny? The police station looks like it's in the boys' bathroom of a gymnasium, with pink tiles on the walls. The guy who comes to haul the first body away is dressed like a milkman. And what's with the girl dressed like a Swedish barmaid who introduces the horrid song 'Yipes Stripes'? The sets and clothing aside, the dialog ignored, we come to the tragic excuse for a plot. Some guy is strangling girls and women with pantyhose. Its obvious from the get go that it's the creepy janitor - I mean, come on, people! So the director decided to forgo all suspense, I guess. The only other suspects are the world's most mousy, politest 'gang', consisting of five respectful, well-mannered boys whose only claim to being bad is that they wear leather jackets with bulldogs on the back. And something tells me that they made those jackets themselves in Home Ec. I mean, the oh-so-bad Jimmy actually respected the grounding his Dad gave him! And he was polite to the cop, too. What kind of bad ass is this guy? There's a hysterical drag race in which Grandmas on walkers could have outrun the cars, not to mention the sound of squealing tires on dirt. And the best part of the film, if Jimmy would have just hit and done in the horrible little Mikey, just didn't come about. Dammit! It's a toss-up as to who had the best histrionics, Betty or Mikey. The scene where they both whine and wail at the top of their lungs in the police station makes one want to rip one's hair out in sheer agony. When you're not laughing your butt off, that is. I feel sorry for the guy playing the cop, to have to be in the same room with those two while they were both 'emoting'. The janitor finally gets it in the end, before he can finish off the annoying Betty. Double Dammit! When he gets shot, there's no blood or bullet hole. Maybe the sounds of the gun shots scared him into a fatal heart attack? And then there'a a painfully long closing scene of people dancing very, very badly. All in all, this film just didn't work on many, many levels. Not as a morality tale, not as a suspense thriller, not as a drama, not as a teen movie, and not as a film with a good soundtrack. And what was with the opening credits that looked like somebody had made them in wood shop? Teenage Strangler is good for many belly laughs, and should be must-see viewing as an MST3K episode.",
         "TEENAGE STRANGLER is a really cheap indie thriller dating from 1964. The only thing going for it is that it was shot in bright and vivid colour which makes a change from the usual black and white indies of the era. The story is about a maniac with a penchant for strangling beautiful young women. A juvenile delinquent is accused of the crimes and fights to clear his name while the real murderer is brought to justice. As with most indies of the era, this one really suffers from having stilted and wooden acting from a cast who are clearly not cut out for acting; there isn't a moment's energy in the whole thing.",
         "Yep, Teenage Strangler richly deserves the undivided attention of MST3K. I've found that with almost every MST3K episode, there are 2 or 3 specific 'scenes' that remain in the brain - getting better and funnier. Teenage Strangler has one of them ... as what'shername is lipsynching, sorry, belting out \"Yipe stripes...mumble mumble mumble...Yipe stripes... something else...Yipe stripes....\" Mike and the bots blast out \"SIEG HEIL\". Difficult not to laugh out loud when randomly thinking about it at \"very, very important meetings\". So trust me - check out MST3Ks take on Teenage Stranger, Giant Gila Monster (\"I sing whenever I sing....\"), Giant Spider Invasion (\"Hello dear - have a good day at the WH*RE?\"), This Island Earth (\"Normal view... normal view, nor-mal viewwwwwwwwww\"). Awesome. Strangler (as done by MST3K) gets 8/10, simply because I DIDN'T STEAL NO BIKE, EITHER!",
         "I feel bad for not giving this a lower score seeing as how it has such a low rating. The movie is about well, a strangler of teenagers and how he, well, strangles them. The biggest fault with this movie is that there's almost no screen time at all devoted to building up the suspense of the killer appearing. We get this dumb subplot about two brothers who feel guilty about stealing or borrowing a bike or they used to be thieves or something like that. I guess the movie was just trying to capture the youth at this time. The credits said 1965, but according to this website, it was 1964. Who cares? They probably didn't even bother to get the date right! Even for a short movie, it seems to have a lot of padding. Most of these stories don't go anywhere. I guess I will give it a little credit for trying to be realistic. Of course, I didn't grow up at this time. It is kind of amusing to see some of these obnoxious characters and realize how our standards have changed. *1/2",
         "This film is, without a doubt, one of the oddest, campiest, and most enjoyable I have ever come across. It isn't a teen movie, a thriller, or a true crime film, however it tries to be all three at once. Teen-Age Strangler(the title I saw it under on Mystery Science Theater 3000), is one of those films you watch, and say \"So this is where that horror/crime cliché came from!\" From the creepy janitor, the shower kill covered up by a turned-up rockin' radio, to the lipstick-marked victims, this movie runs like a thriller paint-by-numbers. All this being said, Teen-Age Strangler is a good popcorn film, great for the times you need a good dozen laughs. One thing I found off-putting was the killer's reveal and explanation for their crimes. There was a chance for a great creepy speech dripping with venom, but the actual one sounds vague and tired. Why did he use a stocking as his garrote? What did the lipstick mean? Did he really \"touch\" that girl years ago? Watch and see if you can guess the truth, and have a killer time doing it!",
         "This was actually a quaint and funny movie. Of course, the title doesn't make sense as the strangler isn't a teenager nor is he limited to the strangulation of teenagers, and Mike and the bots of MST3K give it that extra something, but I liked how it all took place in one small town with only a few settings, and the loud music that plays almost all the time. (Sorry for that run on sentence there.) I liked that it took place in a tiny town because it almost seems like the film takes place in another dimension or another planet, man. It seems like the kind of place you would go if you wanted to escape from the big city. Of course, you'd have to face the teenage strangler, but it would be no worse than city life. Oh, and whiny, girly Mikey was the best part, of course! \"A..And he didn't steal no bike, neither! I...I did!\"",
         "I wish to say that \"Teen-Age Strangler\" was slightly better than most of the movies shown on \"Mystery Science Theater 3000\", just because of that song \"Yipe Stripes\"; you gotta admit, it was a cool song. But other than that, every scene with the sniveling younger brother drags the movie down; I mean, what was that guy's problem?! So, as a mildly different take on the leather jacket genre, it deserves to get seen on \"MST3K\" to get the optimal experience. Aside from Mamie Eisenhower, other famous people cited by Mike (or was it Joel?) and the 'bots are Vivian Vance and Danny Thomas. And I will say that some of those girls are quite hot!",
         "Yes, it's amateurish, but this movie is also a lot of fun. It's a teen-age gang movie and a strangler movie all in one package. And \"Yipes Stripes,\" the film's big musical production number, will stick in your head for days. It probably cost about $500 to make this movie but don't worry, they got every dollar on the screen. The violence is more implied than shown, and while there's not a lot of action, the story moves fairly quickly. Fans of Mystery Science Theater 3000 may remember their take on this picture, but it's entertaining even without Mike and the robots. Somehow there's a sweetness to this movie, and for fans of trashy movies, this is a must-see.",
         "Got news for you. In 50 years, you and your hip popular culture will look even more dated that this movie does now. Your grandkids will laugh and cringe as they see the dialog and fashions that seem trendy today. Time out-modes all. On second thought, it's unlikely movies will be watched in 50 years. They will seem impossibly slow--and possibly retarded--to the hyper-accelerated brains of our descendants. Ultimately, there will be so much culture that whole swathes of it will be discarded permanently. But then I digress.",
         "A series of young women are strangled leaving the local police baffled. They catch a break when one young woman witnesses the killer in action. But she's unsure of what she's seen. And she's conflicted about telling the police that the attacker wore a jacket that looked just like her boyfriend's gang jacket. There's no way that her boyfriend could be a murderer, is there? Of the 17 cast and crew-members listed on IMDb for Teen-Age Strangler, 13 have no other credits listed under their name. And two others have only two credits. Unfortunately, this lack of experience shows. During the Mystery Science Theater 3000 commentary, someone compares Teen-Age Strangler to a community theater production. It's a very apt comparison. Calling Teen-Age Strangler \"amateurish\" doesn't even begin to describe it. The acting is shoddy with stilted delivery; the lighting, sound, editing, and other production values are poor; the script is filled with unnatural dialogue; and the sets and set design are what you might expect from using existing locations in Huntington, WV, circa 1964. In short, it's not a very good movie and probably not even worthy of the 3/10 rating I've given it. But despite its many flaws, there is a bit of entertainment to be had with Teen-Age Strangler. Granted, much of it is akin to watching a car crash, but the movie is not without its moments. First, while the production is amateurish, it does appear that everyone is giving it their best. There's a lot of that \"let's pull together to put on a show\" feeling to it. And surely that counts for something \u0096 not much, but something. Second, the film features at least one surreal moment involving a barefoot girl singing and dancing on the counter at the local malt shop. And as utterly ridiculous as the song she sings may be, there's no denying it's an unforgettable scene \u0096 Yipes! Stripes! Finally, there's Mikey. What a guy! He raises the bar for whiny characters to new heights. His meltdown at the police station is classic! So while it may not be much, I've come up with at least three things I \"enjoyed\" about Teen-Age Strangler. As I indicated, I watched the MST3K version of the film. Overall, it was an enjoyable experience and one of the really good episodes of the show I've seen. Funny stuff! I'll give Teen-Age Strangler a 4/5 on my MST3K rating scale."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Ajay Film Company",
         "American Diversified Services",
         "Original Six"
      ],
      "summaries": ["A troubled teen with an undeserved criminal past is the suspect when young women start turning up around town dead and marked up with lipstick."],
      "budget": 0
   },
   "movielensId": 173045,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-01-01",
      "dvdReleaseDate": null,
      "directors": ["Ben Parker"],
      "runtime": 61,
      "movieId": 173045,
      "title": "Teen-Age Strangler",
      "mpaa": "",
      "actors": [
         "Bill Bloom",
         "John Ensign",
         "Rick Harris",
         "Stacy Smith",
         "Jim Asp"
      ],
      "imdbMovieId": "0059786",
      "originalTitle": "Teen-Age Strangler",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["8iB3fEwqotQ"],
      "plotSummary": "A troubled teen with an undeserved criminal past is the suspect when young women start turning up around town dead and marked up with lipstick.",
      "tmdbMovieId": 109097,
      "avgRating": 3,
      "releaseYear": "1964",
      "numRatings": 1,
      "posterPath": "/iBaPQ33eC38y1Oq9ZXsEYYa35np.jpg"
   }
}