{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hollywood",
            "id": 12396
         },
         {
            "name": "cult director",
            "id": 155167
         },
         {
            "name": "pornographer",
            "id": 176511
         }
      ],
      "imdb_id": "tt0055452",
      "video": false,
      "title": "The Sinister Urge",
      "recommendations": [
         93630,
         44697,
         27342,
         37464,
         81899,
         22033,
         29424,
         14390
      ],
      "backdrop_path": "/sSbzcClcUeFziI2TNqcl8Mbl52C.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Lt. Matt Carson",
               "gender": 0,
               "credit_id": "5359a021c3a3684780000671",
               "name": "Kenne Duncan",
               "profile_path": "/jDYNqRMAfRl5fR1t66InT2FJxoa.jpg",
               "id": 120520,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sgt. Randy Stone",
               "gender": 0,
               "credit_id": "5359a037c3a3684788000650",
               "name": "Duke Moore",
               "profile_path": null,
               "id": 65499,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Gloria Henderson",
               "gender": 0,
               "credit_id": "5359a04cc3a36847a900068e",
               "name": "Jean Fontaine",
               "profile_path": null,
               "id": 1291344,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Johnny Ryde",
               "gender": 0,
               "credit_id": "5359a090c3a36847a1000677",
               "name": "Carl Anthony",
               "profile_path": null,
               "id": 106180,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Dirk Williams",
               "gender": 0,
               "credit_id": "5359a0acc3a36847a9000698",
               "name": "Dino Fantini",
               "profile_path": null,
               "id": 1313350,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mary Smith",
               "gender": 0,
               "credit_id": "5359a0c0c3a36847900006b3",
               "name": "Jeanne Willardson",
               "profile_path": null,
               "id": 1313351,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mr. Romaine",
               "gender": 2,
               "credit_id": "5359a0d7c3a368478000067e",
               "name": "Harvey B. Dunn",
               "profile_path": null,
               "id": 131479,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Officer Kline",
               "gender": 0,
               "credit_id": "5359a0edc3a3684780000681",
               "name": "Fred Mason",
               "profile_path": null,
               "id": 1313352,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Jaffe",
               "gender": 0,
               "credit_id": "5359a12bc3a3684772000661",
               "name": "Harry Keaton",
               "profile_path": null,
               "id": 122981,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Connie",
               "gender": 2,
               "credit_id": "5359a13dc3a368478000068e",
               "name": "Conrad Brooks",
               "profile_path": "/ccuggOAsOHthPN1kdhDbhH69Xwn.jpg",
               "id": 97824,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Man in Fight",
               "gender": 2,
               "credit_id": "5359a163c3a3684780000696",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53599fc0c3a36847790006a1",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53599fd3c3a36847790006a6",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "575647a59251416e25001557",
               "name": "William C. Thompson",
               "profile_path": null,
               "id": 65502,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "575647bb9251416e2a0016d3",
               "name": "Michael Terr",
               "profile_path": null,
               "id": 89258,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.453444,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31286,
      "vote_count": 5,
      "budget": 0,
      "overview": "A flunky for a porno movie ring starts murdering the smut films' lead actresses",
      "similar": [
         74643,
         522,
         599,
         188222,
         10218,
         294016,
         8012,
         856,
         509,
         2118,
         153,
         371638,
         194662,
         313369,
         7446,
         59436,
         109414,
         270487,
         277547,
         427900
      ],
      "original_title": "The Sinister Urge",
      "runtime": 71,
      "poster_path": "/i7TiUiGdJ1G8D8SnaA89NpJara9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Headliner Productions",
         "id": 56289,
         "origin_country": ""
      }],
      "release_date": "1960-12-08",
      "vote_average": 2.4,
      "belongs_to_collection": null,
      "tagline": "Pornography Headlines Come to Life!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edward D. Wood Jr."],
      "runtime": 71,
      "synopsis": "The film revolves around a series of murders of young women in the southern California area. The opening scene features an unnamed blonde woman (Betty Boatner) running along a mountain road, wearing only her undergarments. She is clearly scared for her life. She enters a city park and manages to reach a telephone booth. Her attempt to escape her assailant ends in failure, when the man also reaches the booth. He quickly kills her and leaves her corpse next to a lake. The corpse is soon discovered by visitors of the park. The scene shifts to a police station, where Police Lieutenant Matt Carson (Kenne Duncan) receives a phone report on the latest murder. He instructs subordinate Officer Kline (Fred Mason) to gather information from the witnesses who called in the discovery of the body. Then he summons his associate Sergeant Randy Stone (Duke Moore) and they head out towards the crime scene. They take note of the youthful appearance of the victim and suspect a connection to the \"smut picture racket\". The next scene takes place in the film studio of pornographic director Jaffe (Harry Keatan), an elderly man who is somewhat elfin in appearance. Jaffe is currently shooting a scene involving three women posing for the camera. He fusses over the details of the scene he is shooting, in a scene both depicting and mocking his artistic pretensions. His superior Johnny Ryde (Carl Anthony) interrupts him to bring orders from their boss, Gloria Henderson (Jean Fontaine). She wants their inventory moved to a safer location. Jaffe promises to do so after completing of his shooting. He never actually finishes, since Carson leads a police raid into the studio. All participants in the shooting are arrested, and the inventory of films passes into police custody. Back at the police station, Carson and Stone are berated by their superior, who demands quicker action in exposing the racket. Afterwards the two officers are visited by local businessman Mr. Romaine (Harvey B. Dunn), who demands to know why are taxpayers' money wasted in persecuting harmless deviances such as pornography. In his view, they should be preoccupied with more serious crimes and with the gangs of young hoodlums roaming the streets. In response, Carson claims that the dirty picture racket is connected to major crimes. He then reveals images of the murder victims, and explains the connection between them working for the racket and their violent deaths. He then asks the shocked Romaine if he has a daughter. As he exits the door to leave, the visibly shaken Romaine explains that he has two daughters. The next scene takes place in the suburban house of Gloria Henderson. Gloria is visited by Johnny Ryde, who informs her of the recent police raid. The conversation shifts to Shirley, a person permanently silenced by Dirk. This is the first time the name of the killer is revealed in the film. The conversation also reveals that Shirley had learned too much about the inside operations of Gloria's organization and was attempting to blackmail them. Johnny states that he is worried about Dirk himself, since he clearly enjoys using his knife. The conversation next moves to another operation of the pornography ring. They have been peddling bondage photos to high school kids, but these young customers have started demanding newer material. The scene shifts to a hangout for the teenage crowd, Jake's Pizza Joint. Teen customers are depicted happily dancing and eating. Then two young man approach each other, with switchblades in their hands. A fight begins, and Dirk Williams (Dino Fantini) is seen observing from afar. The fight is taken outside and evolves into a street fight attracting onlookers. Inside Jake, the owner, finds time to negotiate the purchase of more smut pictures from Janet, an agent of the pornography ring. He complains, however, about the inventory of photos he already has. Claiming that copies are already owned by everyone from ages 7 to 70, so finding new customers is hard. The fight outside attracts the attention of the police, so Jake and others are arrested. The two street fighters are revealed to be low-level smut peddlers, who were fighting over turf area. Later, Janet leads three other women into attacking Clauson, a distributor of smutty pictures who was embezzling funds of the organization. The man ends up hospitalized. The scene shifts back to Gloria's house. Gloria and Johnny are watching 16 mm films, projected onto a screen, and conversing. Gloria points that the increasingly unstable Dirk is both aroused and triggered to kill by viewing pornography. Johnny claims that he can still keep the killer under control. Meanwhile, Dirk has returned to the park. He is flirting with a woman and the two kiss. But then his lust turns to murderous rage. He strips off her clothes and then stabs her to death. In the police station, Carson and Stone start discussing the fates of the women victimized by pornography. 'Mary Smiths' from 'Everywhere, USA' who graduate at the top of their class, were once great in a school play, and come into Hollywood seeking stardom. The scene shifts to following the path of one 'Mary Smith' (Jeanne Willardson). The inexperienced actress is rejected by film studios and talent agents, before offered work by Johnny Ryde, who introduces himself as a director, without explaining the kind of films he directs. With childlike naivete, Mary agrees to work hard for him. She receives money for her expenses long before filming starts. She first becomes economically dependent on her employers, then she resigns into posing for revealing pictures. The scene shifts from the fate of 'Mary Smith' to the exterior of Gloria's house, where Dirk is seen lurking. He breaks into the house and gets his hands into more smutty pictures. By this point, he is clearly addicted to both porn and killing. Later he returns to the park and finds another victim, a young woman who was feeding the ducks. This time the murder has repercussions for him. He leaves behind photos which he had touched with his bare hands. Through his fingerprints, the police discover the identity of the killer. The identity of the killer is leaked to the press, making the headline of the Hollywood Chronicle. Gloria's own overlords in \"the Syndicate\" then order her to remove Dirk permanently, as he is an unruly employee who is drawing negative attention for their organization. Gloria and Johnny next argue over the best way to accomplish this. Johnny suggests an indirect way of killing Dirk, by sending on an errand in an old car with faulty brakes. In other words, arranging a fatal \"accident\" for him. As if aroused by the idea, the two partners then share a passionate embrace. Dirk survives his \"accident\" by leaping out of the car, then comes to Gloria's house seeking vengeance. He finds it empty and them manages to ambush an arriving Johnny. Johnny temporarily manages to convince his assailant that they could work together to topple Gloria off her leadership position. Dirk then murders Johnny, before being shot in the dark by Gloria, who assumed that she was shooting Johnny. The film ends with Gloria's disbelief that she shot the wrong man as the police arrest her.",
      "writers": ["Edward D. Wood Jr."],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055452/",
      "coverLink": null,
      "actors": [
         "Kenne Duncan",
         "Duke Moore",
         "Jean Fontaine"
      ],
      "reviews": [
         "What a night. The stuff of which legends are made. In 1995 in beautiful downtown Toronto, when Tim Burton's mighty biopic ED WOOD went into second-run, one of our rep cinemas had a never-to-be-forgotten quadruple bill of films by everyone's favourite cross-dressing auteur. JAIL BAIT, BRIDE OF THE MONSTER, NIGHT OF THE GHOULS preceded this, the final programme of the evening, and perhaps Ed Wood's final masterpiece (well, for his \"legit\" non-porn movies anyway). From the expected pimply nerdy geeks to one dignified old gentleman who said that they SHOULD have given Mr. Wood a star in front of Grauman's, this, the least seen of all of Wood's pictures from his \"classical\" period, was a real crowd pleaser. THE SINISTER URGE is a must for anyone with even a passing interest in the films of this precious Gonzo genius, or, like myself, who have a strange attraction to works made by people who eke out an existence way way way in the back alleys of Tinseltown. This riotous \"expose\" is classic Edward D.: long scenes which don't go anywhere (including an extract from his uncompleted JD epic- HELLBORN), priceless dialogue which waxes profundity about everything and nothing, and a strange attempt at morality while also delivering whatever exploitation elements that unsuspecting people paid to see. My favourite bits include: 1) the long scene where the two hardworking cops out to bust the porn ring must explain to an anonymous taxpayer who comes to the station, and tell him exactly why they are spending his hard-earned tax dollars on such a seemingly trivial matter; this scene wouldn't even pass the green light in a pre-production meeting for an educational film, however with typically Woodian panache, the taxpayer leaves afterwards shaking his head in amazement over the great public service these man are performing. Once again, within his ridiculous subplots, Wood slyly inserts bits where you realize how subversive his scenarios really are. The ever-critical writer-director is simultaneously praising and damning these intrepid cops for a seemingly superfluous service-- remember, only two years later the US government spent a huge wad of the taxpayers' money to decipher the lyrics to \"Louie Louie\" because the song was considered to be corrupting the minds of impressionable youngsters. 2) the director's cameo appearance; since one of the main subplots concerns some knife-wielding loony who attacks women in the park (apparently looking at semi-clad girls in magazines drove him to his social deviance), the two cops talk about sending an undercover male officer in drag to the park and foil the psychotic pervert (right here, the audience knowingly began to applaud), and in the next scene, there is Mr. Wood in a dress and mop wig trying to ferret out the guy in the park. A cameo appearance to save some money instead of hiring another bit player? In most likelihood, a good excuse for the eccentric auteur to insert his personal baggage-- a Brechtian cry for identity. 3) a bizarre climax, featuring a decapitated head in someone's bushes! Man, they sure don't make them like this anymore. Seeing THE SINISTER URGE is like a breath of fresh air. As much as PLAN 9, GLEN OR GLENDA and BRIDE OF THE MONSTER are important works of this pioneering independent filmmaker, the stories about their creation, and their dialogue is cited so often that perhaps they no longer seem new. It is great to see this, and also JAIL BAIT, and appreciate the charms that even his under-hyped works have.",
         "I really think smut gets a bad rep. This Ed Wood schlocker attempts to correlate the smut racket and the ills of society's problems. Well, at least back in 1961. Of course, this isn't shown so well and Ed delivers his usual bland scenes of dialogue where the characters are trying to further progress the story. Or were they trading borscht pie recipes? Well this all adds up to a movie that seems like a 10 hour skin grafting session. Is it bad? Of course, no question. Or was it made out to be that way? After seeing Ed Wood's works, it looks like his actors are giving serious, genuine performances, but there's a sense that they're having fun with it (that is until Ed explained how he was going to pay them). Characters galore range from crazed psychotic who really intimate with a switchblade to 9 fingered wonder Harvey B Dunn who adds new meaning to `giving the bird'. Some scenes are so kampy, it's funny. An interview with naïve actress really had me laughing when the interviewer slyly explains what type of film they'll be shooting. Also, a group of teeners (aka more of Ed's extras) witness a fight break out for no reason!! To try and explain the hilarity of this scene would not do it justice. Count how many desk scenes there are till your wall paint starts peeling! And that Kline, can he steal a scene or what? Ah, but let's not forget Jean Fontaine as Gloria. Her grating voice really adds a menacing presence (I will never look at a leotard the same way ever again). Maybe smut wasn't the problem and Gloria was the root of the problem? Well, that or her seal tight ensemble displayed throughout the movie! Listening to Gloria's logic and way of reasoning makes me realize that caning may not be such a bad thing after all. And her great line \"Dirk? No, that can't be Dirk. Uh-uh. No, that's not Dirk. No\" is well worth the price of admission. There's so much more like shooting on the smut set of scantily clad (?) actresses, abrupt jump cuts, a police raid (HA HA HA), the Syndicate\u0085.oh man, some directors wish they could create movies with the flair Ed Wood had. I'm starting to see method in Ed's madness.",
         "Don't fall into the evil world of pornography! This movie is classic Wood. For some reason, I have a hard time seeing it as being made in 1961, however. It's great going through, looking for how many errors due to budget constraints there are, continuity errors, all the usual. Add to this the stiff acting and memorized lines, and you're all set. I enjoyed this movie, and see new stupid errors in it every time I watch it, it can supply you with hours of entertainment. Don't expect Ben Hur, but if you enjoy Ed Wood, or haven't seen anything else by him but want a classic example of his work, this is one you'll want to see.",
         "Some people believe that Ed Wood knew exactly what he was doing: that he *intended* to make \"bad\" movies in order to make people laugh. There are plenty of good reasons not to buy into that theory, and THE SINISTER URGE is Exhibit A. PLAN 9 FROM OUTER SPACE, GLEN OR GLENDA, and BRIDE OF THE MONSTER are endearing in their goofy lunacy. This one, though just as bad as the rest of Wood's oeuvre, is mostly just plodding and dull. Not that there isn't entertainment to be had here, at least for the bad movie connoisseur: my personal favorite is the obvious use of pre-existing (and completely unrelated) footage, shoehorned in on the waste-not want-not principle and \"justified\" through the use of atrocious dubbing and risible expository dialogue (which takes place *after* the inserted scene, making it even more ludicrous). But that's not the sort of thing calculated to make a mainstream audience roar with laughter. I can imagine someone trying to make a movie like PLAN 9. I can't imagine anyone trying to make a movie like this.",
         "One of Ed Wood Jr. lesser known works about the smut racket where Wood himself has a cameo role in it. Not as the cop in drag with a tight womens wool sweater, which would have been more like it for Wood, but as a smut peddler having it out with his rival at a pizza joint that fronts for a porno distribution site. With a number of young women found dead in and around a local park their deaths are connected to a local smut ring headed by Gloria Henderson. Things get real bad for Gloria when the cops take into custody her top smut photographer Jaffe together with all the canisters of porno films, that he hid in his closet. Leaving her racket on the verge of being shut down not just by the cops but by the syndicate who are bankrolling her smut operation. The weak link in Gloria's smut business is one of her enforcers Dirk Williams who becomes so hopped up and morally corrupted by having a hand in her smut racket. Dirk he goes bananas when he sees porno films and pictures that he's peddling supplied by Gloria's right-hand man in her business the former legit Hollywood film maker Johnny Ryde. Dirk's uncountable urge for sex and violence is touched off just by the sight of smut photos and that drives him to commit rape and murder. The local cops know all about Gloria's operation but need solid proof and evidence to put her,together with Johnny Ryde, out of business. In the end it's Gloria herself who provides all the rope that they need to hang her without Gloria even knowing it. Director Ed Wood does the best he can to show the evils of pornography and how it effects naive and innocent young girls who come to Hollywood looking to make it big in the motion picture industry. Only ending up getting talked into making porno films by the likes of Gloria and Johnny Ryde to just pay off their bills. We see the tragic story of Mary Smith who ended up making smut films and photos for Gloria and finally fell victim to Dirks sinister urge. When he caught Mary alone in the park, by the duck pond, and ended up raping and murdering her. We also see in the movie \"The Sinister Urge\" how difficult it is to arrest the likes of Gloria Henderson and make the charges of the crimes she committed stick. Admittedly a laughable venture, which of his movies aren't, of Wood's because of the cheap budget and in some cases non-actors in it. The movie \"The Sinister Urge\"is still years ahead of it's time thanks to the foresight and vision of it's director Ed Wood Jr, in showing the evils and horrors of the then, in 1961, underground and illegal smut business in and out of Hollywood. That destroyed the lives of thousands of young girls like Mary Smith in mind as well as body.",
         "Edward D. Wood Jr (or E.D. Wood credited for the film) is practically revered today as a filmmaker forgotten and neglected in his time as just another Shlock-Meister of B-movie (or Z-movie) cinema. His legacy is now, well, being the ultimate in bad schlock kind of movie-making, where you can almost see the sets about the tear at the seams, the actors going through their lines like they know they won't get any pay for it, and camera-work (and perhaps editing too) that becomes jarring in the worst possible ways. While the Sinister Urge, Wood's last 'real' film before diving deep into obscure porn directing (ironic considering the film's subject here), does not have a kind of classically bad way about it like Plan 9 From Outer Space. That film has since become a kind of cult classic where the actor in place of the late Bela Lugosi in the film, the various props and sets (including the 'saucers'), and horrendous narration becomes most of the ironic fun. The Sinister Urge in comparison doesn't have that impressive ambition to be something more than it can never be, as this film is nothing more than an under-cooked 'warning' film about porn movies, and the people who may kill to be apart of them. The Sinister Urge is 71 minutes long, which doesn't overstay its welcome (though one may try and define 'welcome' with an Ed Wood picture) as a film with many static camera angles and very few moments of ingenuity. One of those- the scene where the brakes don't work with the car- is ironically successful, as it really shouldn't be at all workable as a scene, but as a little piece of suspense it could be worse. Most of the rest of the picture isn't so lucky- again, many, many actors who seem like they are not only content to not become stars, they're almost doomed to be in pictures like Wood's. Often the performances are wooden, but of course part of the real problem with watching such actors is the often silly dialog. It tries to be 'realistic', but Wood has no gripe with stopping somewhere to have a character (usually the lead cop character) to lay out a dull speech about the message of the story. On top of the story not really being too coherent, anyway, the director's method of the 'cut, print, perfect' method can be seen quite often with some laughable mistakes abound. Now, does all of this make the Sinister Urge as astoundingly, amusingly bad as Plan 9? Not really; there's nothing too memorable about how the film is bad here, unless you're a die-hard fan of the director. He does try here and there to keep some storytelling merit, with his style being so uncomplicated and static it shows his ambition. But the lack of talent overcomes everything else, not to mention the cardboard-sided points of the film. It's also not too unworthy of the Mystery Science Theater 3000 treatment either, which has now made the film available on DVD. The commentary is spot-on usually and funny, though as with Plan 9 you may still want to make wisecracks on your own. That's Wood as the mustached guy who fights at the Cafeteria in one scene.",
         "General, bland 50s fear mongering film. This was the first Ed Wood movie I ever saw and it was only because it was an episode of Mystery Science Theatre 300. The acting was wooden and forceful and the scenery looked as if it would collapse at any second. Plot concerns a syndicate of 'smut' makers and the polices crusade against it and the woman who runs the show. The bad guys get it in the end and there is a half hearted attempt is made in showing a link between crime and porn. Watch the MST3K version. It makes the movie actually worth watching.",
         "absolutely hysterical film about the porn industry. brassy blonde (jean fontaine has to be seen to believed) runs a porn industry that frankly isn't very exciting. the combination of bad writing and bad acting exerts a strange fascination. never dull.",
         "\"ANOTHER SEX MANIAC MURDER! - SMUT PICTURE RACKET BLAMED!\" - The Hollywood Chronicler reports. 1959's \"The Sinister Urge\" was the last movie Ed Wood Jr. would ever direct, so it serves as his directorial swan song and all I can say is, Ed went out in style! So what's to be said about it, sure it's a bad movie, but all of his movies are bad, but for me The Sinister Urge is one that endures and here's why. First of all the film comes loaded with several memorable and highly amusing characters, in which when these six characters (Lt. Matt Carson, Randy, Johnny Ryde, Gloria Henderson, Yaffe and Dirk Williams) interact with each other, the screen is absolutely flush with character and charisma. The Sinister Urge - a quickly-made cheapy, clocks in at just over 70 minutes, so as you might expect there's little in the way of wasted time and things get interesting in a hurry. I find that when the hour grows late The Sinister Urge is a perfectly charming little flick to wind down your day with - which in my experience, does not diminish with repeated viewings. Plus (and to brilliant effect) this film has the dubious distinction of being the -one and only- Ed Wood film to be featured on Mystery Science Theater 3000. It's my opinion that this film gels together and that's primarily due to how good most of the casting is. Well maybe \"good\" isn't exactly the right word, \"effective\" may be more suitable. So what's it all about? Well unlike most of Ed Wood's work, The Sinister Urge actually has a very tight and cohesive plot, which for once seems to be rooted in reality.... for the most part at least. This charming Ed Woodian-tale takes us back to the late 50's, at a time and place, where you could find your friendly-neighborhood-smut-peddler's (Johnny Ryde and Gloria Hendersen) busy at work plying their wares and when backed by the local syndicate, the duo of Johnny and Gloria, along with \"Yaffe\", a quirky little business associate, this team of three makes for an A-1 smut-running racket. You see what these pioneering pornographers are vying for, is for a complete saturation of the local market and then to expand their operations from there. And as the queen bee, Gloria Henderson herself said \"I've got a tremendous busy going here and it's getting bigger every month.\" But before the dastardly duo of Henderson & Ryde can ascend to the ranks of pornographic super-stardom (in Smut Town and beyond), there's a formidable obstacle in their path: Lieutenant Matt Carson and his side-kick Randy. To make the movie something a bit more involving than the production and distribution of softcore smut, schlockmeister Wood wisely included something that actually is a crime: Murder (or more accurately - serial murder). Which as it turns out, is very bad for business. Whose to say, if it weren't for the serial-killings which were happening on a routine basis, that Lt. Matt Carson and Detective Randy wouldn't of, in time, become regular customers of the smut picture racket. But however it's a string of serial murders, that gets the wily, veteran, policeman on their case. While I'm fond of all the great casting that's seen in this cheap n' trashy piece of schlock (but of course isn't that all that Ed Wood EVER made), but for me, in what was her one and only film appearance, it's the performance of Jean Fontaine who stands-out the most. She was simply a natural in the role as the witchy and conniving Gloria Henderson, who conveniently ran her dirty picture business from the comfort of her suburban home - her very own hive of sin. But in reality this woman seemed to be little more than an aging, sand-paper-voiced, cigarette-hag, who probably wasn't straying to far from her own personality. The films simply a riot and Ed Wood has some insanely crazy ideas about the affects of porn on society, which you'll hear in detail throughout the movie. But as I see it, the movie is at it's most stupendously ridiculous 20 minutes in, during a scene where Lt. Carson is conversing with Mr. Romaine, an elderly \"concerned citizen\" and tax-payer, whose all in a flutter, but leaves somber after Lt. Matt Carson \"educated\" him on all things smut. With such ludicrous claims as \"The dirty-picture racket can be directly connected to a good percentage of the major crimes in this city.\" or \"The smut-picture racket is worse than kid-napping or dope peddling.\" Then a little latter on we have a scene where some of Gloria Henderson's models, posing in panties and bras, in a privately-owned photography studio mind you, are arrested by Lt. Carson and his goons, for what was essentially, nothing more than a series of glamour shots. However and here's where it get's outlandishly out-of-wack, the bail for each model was set at $5,000 a piece. That's in upwards of $60,000 in today's money!!! For the crime of: glamour shots. With all these wild claims one can easily conclude, that Ed Wood had some incredibly bloated (even downright errant) idea's on the corrupting influences of porn (or \"smut\" as they call it - their product, quit tame by today's standards). Released in 1959 The Sinister Urge came at the end of what was truly an awesome era for bad movies, the late-50's and from what I've seen over the years, the only era that was better at producing bad movies was the mid-80's. An era, which at the same time, also has many of the very best movies as well - the 80's were an incredible time for movies.",
         "I think this might be the worst movie Ed Wood ever made. What's weird is that he's known for making movies with cheesy special effects. Those are always a laugh. I was disappointed that this movie was mundane and didn't have any monsters or anything. It seems like this was the one Ed Wood movie I hadn't heard of. It manages to not even by laughable by his standards. The story is just way too boring. It's weird looking back at this film and remembering the Hays Code. Never heard of it? Before movie ratings in 1968, it was the standard for film censorship. It's just so strange to see scantily clad women being labeled as \"pornography\". They mostly use the term \"smut\" so it surprised me at the end when they did explicitly say \"pornography\". I'm certain porn was never even illegal. This was just way too ridiculous to even care about. The story is that there's a killer stalking women working in these roles. As expected from a B-movie, it moves very slowly and has had bad acting. It's just hard to even find that much to be amused by and I know Ed Wood could do better...or worse? *",
         "The Sinister Urge (1960) * 1/2 (out of 4) Edward D. Wood, Jr.'s hard-hitting look at the smut business has Lt. Carson (Kenne Duncan) and Sgt. Stone (Duke Moore) trying to solve a couple murders where the victims had just taken part in the pornography world. They believe the victims can be traced to a certain woman (Jean Fontaine) but they need to find out who's actually doing the killing. THE SINISTER URGE is Wood's attempt to show how ugly and evil the porn business is so I guess it's kind of ironic that this would be his last directing job for ten years until he would start working in, you guessed it, the porn business. As you'd expect, this here is a pretty poor film that like most of Wood's stuff has an interesting idea but the story is all over the place and in the end it just makes no sense. It seems that Wood was wanting to do the story about a psycho turned on by porn and then mix in a detective tale and the two items just didn't mix very well. The film is certainly a tad bit sleazier than the normal 1960 production but this doesn't make up for the weak dialogue or bad performances. It's funny but the film really puts down those who take advantage of girls who come to Hollywood to become stars and the film also preaches that girls should just stay home. The first female victim has such a Southern accent that I'm guessing Wood found her as she stepped off the bus. Wood's regular outlaws (Duncan, Moore, Conrad Brooks) are all here and it's worth noting that this here was Duncan's last feature film. Fans of Wood's work will still want to check this out but it's certainly miles behind his classics.",
         "The most amazing thing about this movie is the way it's been used elsewhere -- on MST3K and in a U2 music video, for starters. Jean Fontaine in ridiculous clothing runs a \"smut\" photo and film industry, consisting of girls being photographed in bathingsuits (often one-piece!) or filmy dressing gowns. The result of seeing \"smut\" is the immorality of the youngsters in the town, ranging from fistfights to homicidal tendencies. Worth seeing if you're interested in sociology, for a view of a 1950s attitude towards sex and morality, but doesn't even have entertainment value for anyone else.",
         "I saw this film as an episode of Mystery Science theater 3000 as I am sure 75 percent or more people have. This Ed Wood film was not like Plan 9 From Outer Space or Glen and Glenda, this one is a bit less known. To be honest, I only thought he did the two movies! That is not the case as he has apparently made a whole lot of films and most of them are pretty bad to say the least. Though I always find it strange that the gang from the satellite of love riffed so many of his films, but never did riff Plan 9 From Outer Space. My only guess as to why not is that one would be too easy. This film is one of his films looking at crime and such which seems to be one of his favorite type films along with horror. This one he literally seems to attack the pornography industry frequently using his police characters to condemn it and such and I kind of find this ironic in that one of the last films he did was Necromania which is at least a soft core porno itself. The story in this one has gruesome murders in a park and it all somehow ties into the local adult film industry. The police are trying their best to not only solve the murders, but to destroy the adult film industry responsible for the crimes. Which is a stretch to say the least as the killer in this one sees a picture then goes to kill the female. I do not know, I have never had the urge to kill someone based on seeing a naughty picture. I mean, if the guy had a wife would he kill her if she got naked? So the whole concept of the film is preachy and though the film is centered around the adult film industry there is very little skin being shown. The shoots they do show has a person filming random girls in poses. Pretty sure that would be just as effective using a camera. This made for a pretty funny episode of Mystery Science Theater 3000 as most of the Ed Wood films do. The film is preceded by yet another hygiene short as they seemed to do a lot of those as they apparently made a lot of those back in the day. I also enjoyed watching Frank go crazy and try to blow up Deep 13 because he watched to many movies featuring explosions! All in all a rather good episode of the show, but Ed Wood films give the gang a lot to work with! So this film pretty much tries to stress to the viewer that porn is bad and that it is responsible for all crime in the known universe. Pretty much like people who claim drugs are all bad while they drink a cocktail, just someone trying to jump on a bandwagon of waving their finger and trying to feel they are doing some good. Then later they make a film that is basically what they are condemning. Ed Wood and his films are a bad lot, but for my money, Coleman Francis is a lot worse!",
         "A flunky for a porno movie ring starts murdering the smut films' lead actresses. This film has made it on the \"turkey list\", has been made fun of by MST3K, and has been called he worst film Ed Wood ever made (which is a rather scathing insult). I am okay with the MST3K part, but the rest seem a bit unfair. This is not that terrible of a movie. My biggest issue is that I mistakenly thought this was a horror film. That may be because the title was borrowed by Rob Zombie. Beyond that, I actually thought the plot was interesting and the script seems well-written. The sets are cheap and the editing needs work, but this is clearly a film that was not just another rehash. Allegedly it was partially inspired by \"Psycho\", but the difference is so major that no one would ever guess.",
         "You know that when Mr. Wood made a film he did put all of his heart and soul in each one of the films (ok the ones I saw and the 50's films that most people see) The problem being is that he was completely incompetent as a director. You can't polish a turd and all of these films are turds. But he did try his best, in my opinion this is one of the best and funniest, with or without MST. A fairly static film, the only action happening with a fight scene. The rest of the film consist of all the actors explaining about the plot. Carl Anthony is the most static of this bunch. Kenne Duncan and Duke Moore, two of the laziest cops on the beat. Then the rest, Jaffe, Mr. Taxpayer, Dirk (a swell guy), Kline (KLINE!!!!!) and best of all: GLORIA. The scariest woman on the planet who's probably passed on by now of throat cancer, or squeezed to death by some of those outfits, likely from Mr. Woods own collection. Why this film is not on DVD like the rest of the Ed Wood collection I don't know. Somebody get out there and pester Wade Williams productions and get this on DVD too.",
         "This movie is so unintentionally funny, like all Ed Wood movies. It's not on the same level as Plan 9 from Outer Space, but it comes mighty darn close. Not only that, but MST3K riffed it, as well. That raises the humor level about a hundred points. I recommend it to anyone with a love for bad movies.",
         "That is not as if I immediately rag on Ed Wood's films. They are not great, but they are kind of entertaining and guilty pleasure standard in a way. The Sinister Urge did nothing for me though, and derails Night of the Ghouls as quite possibly Ed Wood's worst film. The scene with the cops and the tax-payer is quite funny and Kline is a fun enough character, but that was all really that I liked. Wood's films are not very well made, but The Sinister Urge manages to be one of his worst-looking and most amateurish films. The effects are clearly fake with little attempt to try and disguise it, and the camera angles and editing are like they're placed here and there with little thought to them. There are so many errors that you'd fill a novel's worth writing them down. The dialogue is both silly and stilted, it also paints the porn industry in such a negative light but it borders on extreme and somewhat one-sided. Don't get me wrong, porn is one of the last career moves I want to pursue, but I just wondered whether it really was as \"evil\" as The Sinister Urge painted it out to be. The fact that the film chose to stop the story for a character to make a speech to emphasise this doesn't help and it all came across as too heavy-handed. The story is plodding and dull, things are kept simply but so much so that it all seems rather static. The climax is also really bizarre and you are not sure whether that's a good or bad thing. The acting at best is wooden, worst of all is Jean Fontaine who is unbearably shrill and annoying. To conclude, even when I knew what to expect I just didn't care at all for The Sinister Urge. 2/10 Bethany Cox",
         "Even by Ed Wood's standards, The Sinister Urge is a miserable movie. Everything you would expect to find in an Ed Wood film is here \u0096 a ridiculous plot, bad acting, stilted dialogue, poor editing, and bad set design. Most of the \"action\" takes place behind a desk on an all but barren set as two policemen drone on an on about nothing. There's one scene that must be seen to be believed involving a \"taxpayer\" who shows up to demand to know what the police are doing. They give Mr. Taxpayer a good lecture about the dangers of pornography and how it leads to all sorts of other crimes including murder, kidnapping, jay-walking, terrorism, and ripping tags off mattresses. It's a hoot! But as I've said before when discussing Ed Wood's movies, even with all the problems, there's a love for the art form that you can see just under the surface. Ed Wood wasn't the most gifted filmmaker and he often worked in less than stellar conditions, but there's no denying his love of movies. He just didn't have the wherewithal to make a \"good\" one.",
         "This movie is an absolutely delightful trip down to Absurdity Lane. Though, I'm not sure if people who are unimpressed by Edward D. Wood Jr's *unique* style would appreciate it as much, it is still worth checking out. Go into this movie with an open mind and a huge sense of humor, and it's well worth it. Ed Wood wasn't a bad director, he was just misunderstood, and continues to be to this day. Oh well, check it out with an open mind, and you should be all set.",
         "What promises to be a shocking, sleazy flick turns out to be more banal police-station banter and sophomoric hijinx from Ed Wood. The most engaging scene has a porn film director recruiting an ignorant wanna-be actress from Anytown, U.S.A.",
         "Dialog in Ed Wood movies are often among the worst you'll ever hear in any movie. It's tone cringing and hilariously bad at times. Especially also hilarious how Ed Wood tried to put in humor into this movie. Wood perhaps wasn't the worst director of all time but he might very well be the worst writer of all time. This movie its story is also really confusing to follow, since it just doesn't make much sense. It's a movie with many sub-plots, rather than one clear main plot and the movie focuses too much on too many different characters, rather than it has one clear and likable main character. The movie misses a Bela Lugosi, Tor Johnson or Vampira. But I have to hand Ed Wood one thing. Some of his movies handle for its time some sensitive and daring themes. He previously for instance did this before with his movie \"Glenn or Glenda\", which was about transvestites and more or less also with his movie \"Plan 9 From Outer Space\" which had some social criticism in it. \"The Sinister Urge\" concentrates on the world of pornography. Of course not a subject that would often be handled 'seriously' in '60's movies. Ironicaly enough Wood himself would land into the world of soft-core porn movie making after this film as a director, writer and (unfortunatly also) actor. It's especially since this movie tries to show how 'evil' pornography is. It even turns people into serial killers. Especially the dialog explaining how evil it all is, is extremely moralistic and completely totally horrible. I actually also would suspect that the portrayal of the porn industry is far from the truth and how it was at the time. So it's also really doubtful that Ed Wood actually did some research for his movie. Continuety is a big problem and the editing often doesn't make a whole lot of sense. Character positions and even car models change suddenly in between different cuts. It's also quite hilarious that the movie at times recycles some of its sequence and of course Wood also uses some archive footage again, this time even from some of his previous movies, of which some got never completed. This movie might very well feature the worst editing out of all Ed Wood movie's. Ed Wood was basically also really an horrible actors director. The acting is extremely wooden and the actors obviously at times don't know how to act or move, probably because they themselves had a hard time understanding the script or what Wood wanted from them. Of course the budget was also obviously low again for Mr. Wood. This means that the movie is mostly being shot at location and inside small studios, with cardboard sets and hardly any dressing to it, expect for a desk, a phone and a map of the world. Ed Wood always had a hard time finding financiers for his movies. This movie was perhaps the last straw for him and the reason why he for a while quite film-making after this in, in order to pursuit a writing career, before venturing himself into the world of soft-core porn movie-making. Edward D. Wood Jr's last 'serious' film-making attempt is consistent with the movies he did prior to this movie. So Mr. Wood ends in style with \"The Sinister Urge\". 2/10 http://bobafett1138.blogspot.com/",
         "\"The Sinister Urge\" is proof if any was ever needed that Ed Wood was a completely and utterly inept writer and director. He does, of course, have a surprising number of fans who actually like some of his work (\"Bride of the Monster\", I have to admit, isn't really all that bad of a film), but \"The Sinister Urge\" is so chock-full of Ed Wood clichés (redundant dialogue, amazingly bad acting, and taking hypocritical preaching to a whole new level are but few of the features of this film). I've seen \"The Sinister Urge\" several times in its \"Mystery Science Theater 3000\" version, which features some of the funniest and most seemingly random riffs in the history of that show- one scene features Mike and the bots breaking into song... but I won't spoil that for you. Tonight I watched this film without their aid and it is a prime example of complete cinematic incompetence. From start to finish the script is unbelievably bad, not even in an earnest \"Plan 9\" sort of way- there's only the occasional laugh here, unless you can find humor in something so pathetically horrid. Similarly, Wood is incapable of even a second of flair in his direction of the film. There are people in this world who will tell you with a straight face that this is a fine film, an indictment of the seedy world of pornography (oh let's face it, compared to what we have going now, the porn industry in 1960 was one big huge convent). These people are absolutely, unequivocally NUTS. One only has too look at Wood's filmography to see that he had already written several smut films, including notorious early nudie Western \"Revenge of the Virgins\", prior to this film's release. \"The Sinister Urge\" is one of the most boring, plodding, miserable excuses for a film in all of cinema. I'm not a big fan of picking on Ed Wood, to be honest, but this is proof (along with the many other films of his that aren't widely known) that Wood is an astoundingly incompetent director. 1/10",
         "I saw this movie, only because it was on MST3K and even then the movie was terrible... Don't see it, please..... But if you see it in MST3K, root for Kline, he rules... hehe Other than that, bad movie... Crowe rules",
         "When film was invented, the new medium was quickly compared to literature - written literature, to be absolutely clear. Accordingly, the first feature length pictures, in the silent time, were divided in scenes and acts like in theater pieces. Theater pieces too, although they simulate scenes of everyday life, are dominated by text which have be written first - like the scenarios of the movies. However, is this \"logo-centrism\" not astonishing? Simply the English word \"motion picture\" gives the much more appropriate comparison of film not with written text, but with painted (or photographed) pictures. Therefore, it makes much more sense to compare films with paintings. But what are the criteria according to which somebody can decide about its quality? Does it speak for bad quality if in a painting by René Magritte, there is day and night at the same time? Is this one a bad director who changes day and night in a short cemetery scene like Ed Wood did? Do we really believe in the reality of paintings so that we consider eyes being outside of faces pathological like in some early works of Picasso? Why do we scold Ed Wood when he forgets to take off the price-tags of his Walmart-plates that he used for UFO's? We know that eyes cannot be outside of a faces as we know that UFO's do not exist - where is there a border of credibility? Everybody know that humans with over-proportioned necks and empty eyes like the ones that Modigliani painted do not exist. But do we laugh at these works as we laugh at Ed Wood's Zombies? Peter Greenaway has recently said that in the near future we will be able to film what we think. Great! But before, I suggest, we should learn to accept that one can film what one SEES independently of criteria of literature whose relationship to film is about as small as the relationship of a technician to a physicist. \"The Sinister Urge\" is an absolutely disgusting example of how pseudo-funny \"editors\" can destroy 71 min. of a movie that is 71 min. long, by uninterrupted \"jokes\" that strive racism (the comparison of a colored actress with Benazir Bhutto). As a matter of fact, most parts of the dialogs of this movie are completely not understandable because of the stupid sexual, political and other comments. I therefore suggest that the complete edition of \"The Sinister urge\" is confiscated and destroyed. Ed Wood's work deserves a critical edition without comic strip covers on the DVD hulls and disgraceful comments, but with introductions and commentaries by renowned American film historians. I would like to look forward to seeing soon Ed Wood's work edited in a dignified looking package of carefully crafted DVD-collections.",
         "The best of Ed Wood's films-- his love song to Bela Lugosi, 'The Bride of the Monster' (1955), the amazing Wood-de-force, 'Plan 9 From Outer Space' (1959) and his masterpiece 'Glen or Glenda' (1953)--all contain the elements of his classic 'film making' style. These include poor direction, stilted acting, fakey looking action, monologues and dialogs ranging from the poor and sit-at-the-desk pedantic to the surreal and bizarre, non sequiter sequences, mistakes not edited out, non matching inserts of stock and original footage, lack of camera movement, cheap post production overdubbing -- oh, the list could go on forever if I had a film making degree from USC. This film shares these elements, but somehow, for me they just didn't 'click' this time. Too many boring sequences of Kenne Duncan (as Lt. Matt Carson) sitting at his desk talking to Duke Moore (Sgt. Stone) either about the relationship between pornography and crime, or to explain the developing action of the story that is mostly not shown. Here is the ultimate crime of visual or print story telling-- don't tell what happens, show what happens (don't say a man is evil, to make your point describe or show him kicking a cat or squashing a lizard with his foot). We finally do get a visual story: a mix of a serial killer (a well cast Dino Fantini) knifing models in the park after looking at their 'smut' photos; a small town girl, eager to make it in Hollywood, getting tricked into the porno racket, and the battles of the 'smut' merchants Johnny Ryde (Carl Anthony) and Gloria (the bizarrely dressed hoarse voiced Jean Fontaine) with the police, their customers and 'the syndicate'. This description makes the film sound better than it is. Little that goes on is of note, except for its unintentional humor (another great part of Ed Wood's 'style'). This is why it's best to watch the 'Mystery Science Theater 3000' 1994 version (available on DVD) that not only glorifies the humorous high points (\"You're filming your shirt!\" etc.), but also helps us wade thru the tedious dead spots, of which there are many. We know why Ed Wood relied so much on explaining off stage action rather than showing it: it was a simple lack of budget and time (but also skill). This does not put him up on the level of doing the best with the least. That honor properly goes to the great Edgar G. Ulmer whose landmark Poverty Row films 'Detour' (1945) and 'Man From Planet X' (1951) are master classes in film making technique in working on virtually no budget or time. Ed Wood can never be considered in the same rank as other film makers, but occupies his own unique and special place: The Top of the Bottom. The MST3K version helps it a lot, but still I'll have to give it a 2."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Headliner Productions"],
      "summaries": [
         "Someone is killing young women in the park. Police suspect it's related to the smut picture racket, and begin leaning on Gloria Henderson, a smut front woman for the \"mob.\" Her right arm man continues to procure young women with stars in their eyes to submit to their heinous celluloid activities, and if the women try blackmail, they call in a specialist to take care of the problem.",
         "A flunky for a porno movie ring starts murdering the smut films' lead actresses."
      ],
      "budget": 20152
   },
   "movielensId": 173065,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1960-12-08",
      "dvdReleaseDate": null,
      "directors": ["Edward D. Wood Jr."],
      "runtime": 71,
      "movieId": 173065,
      "title": "The Sinister Urge",
      "mpaa": "",
      "actors": [
         "Kenne Duncan",
         "Duke Moore",
         "Jean Fontaine",
         "Carl Anthony",
         "Dino Fantini",
         "Jeanne Willardson",
         "Harvey B. Dunn",
         "Fred Mason",
         "Harry Keaton",
         "Conrad Brooks",
         "Edward D. Wood Jr."
      ],
      "imdbMovieId": "0055452",
      "originalTitle": "The Sinister Urge",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["S59jC5D5byY"],
      "plotSummary": "A flunky for a porno movie ring starts murdering the smut films' lead actresses",
      "tmdbMovieId": 31286,
      "avgRating": 3.5,
      "releaseYear": "1960",
      "numRatings": 1,
      "posterPath": "/i7TiUiGdJ1G8D8SnaA89NpJara9.jpg"
   }
}