{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "anthology",
         "id": 9706
      }],
      "imdb_id": "tt0174917",
      "video": false,
      "title": "Merlin's Shop of Mystical Wonders",
      "recommendations": [
         31380,
         31129,
         87874,
         62855,
         43248,
         52745,
         56140,
         31119,
         31124,
         99008,
         31276,
         31282,
         118641,
         84633,
         41516,
         35919,
         31287,
         32652,
         22727,
         31383
      ],
      "backdrop_path": "/ymDdJODDOs1q41U88NHVV1AFMhi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "52fe446c9251416c910102b5",
               "name": "Ernest Borgnine",
               "profile_path": "/kQhcGAc2TgohrvLZSYapT2SHRby.jpg",
               "id": 7502,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "55c5eec09251417a210017eb",
               "name": "George Milan",
               "profile_path": null,
               "id": 163411,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "55c5eec8c3a3682f2700177b",
               "name": "Bunny Summers",
               "profile_path": null,
               "id": 44800,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "55c5eecf9251417a300016df",
               "name": "John Terrence",
               "profile_path": null,
               "id": 100477,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "55c5eed8c3a3682f17001831",
               "name": "Patricia Sansone",
               "profile_path": null,
               "id": 1494849,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "55c5eeaf9251417a2a001788",
            "name": "Kenneth J. Berton",
            "profile_path": null,
            "id": 229704,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 0.830049,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31244,
      "vote_count": 14,
      "budget": 0,
      "overview": "Two creepy \"horror\" films joined together by Merlin's Shop which is, in turn, introduced by a Grandpa telling the story.",
      "similar": [
         16288,
         297160,
         193726,
         84348,
         29074,
         20701,
         5,
         354251,
         14128,
         33908,
         31578,
         29514,
         28043,
         199420,
         87436,
         46581,
         16281,
         436549,
         307047,
         351064
      ],
      "original_title": "Merlin's Shop of Mystical Wonders",
      "runtime": 92,
      "poster_path": "/kzhJTLFggoXWAcF5WmElTxaiCPk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Brencam Entertainment",
            "id": 90402,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Berton Films",
            "id": 90401,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-01",
      "vote_average": 2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kenneth J. Berton"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Kenneth J. Berton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0174917/",
      "coverLink": null,
      "actors": [
         "Ernest Borgnine",
         "George Milan",
         "Bunny Summers"
      ],
      "reviews": [
         "This \"movie\" seems to be little more than several different movies patched together. And in a sense, it is. Things start out with some old lady at an ouiji board whose house catches fire. Then after about six minutes, it turns out this is just some TV show some kid is watching while his grandfather (Ernest Borgnine in what may be the lowest point of his career since \"The Devil's Rain\") sits on a couch nearby. When the power in the house goes out Grandpa Borgnine proceeds to tell the kid some fractured and disturbing story loosely connected to Merlin the Magician, who has transported himself to the present day and opened a shop. Despite being the title character, Merlin does little in the movie except release evil artifacts into the world and collect them later while getting nagged by his irritating wife (If that's what she is. Their relationship is never really made clear in the movie). The first part of this fractured story involves a cranky newspaper reviewer who is unimpressed with Merlin's shop and threatens Merlin with a most vicious review. Merlin retaliates by giving him a book of spells which turns the obnoxious reviewer into an old man and then a baby. Merlin's revenge, I guess. The second tale involves an evil toy monkey who gets stolen from Merlin's shop and ends up being bought by a family from the early 1980's. The monkey has the ability to cause untold damage and evil by clapping the little cymbals in its hands. This segment was actually a 20 minute excerpt from a movie from 1984 called \"The Devil's Gift\" which was then clumsily inserted into this film. This is why this particular tale has no setup or conclusion, making the movie even more confusing than it already was. \"The Devil's Gift\" is apparently out of print and hopefully they won't use the MST3K exposure as an excuse to reissue it. Along the way, a goldfish dies, a cat is burned alive, a trapped dog dies after inhaling toxic smoke from a fire set in the garage and a woman has a rather frank conversation with her friend about her fertilization problems which has left her unable for her and her cranky husband to have a baby. And this is supposed to be a kid's film! This is either the darkest kids film ever or the most ineffective horror film ever. If you really want to give the kids nightmares, show them this movie before sending them to bed. This movie will most likely be remembered as the \"lost\" episode of MST3K. The airing of this particular episode was delayed five months because of rights problems with the movie. After watching this movie, I have to wonder why any sane person would actually want the rights to this stinkburger in the first place! Just another painful reminder of how much we'll miss MST3K.",
         "Films don't get any cheaper than this stitched together piece of padding, in which retired screenwriter/grandpa Ernest Borgnine relates \"sweet\" bedtime stories about the legendary Merlin (Yes, that Merlin. Merlin probably changed management after doing this movie) to his world-weary, seven year old grandson. Grandpa Borgnine's sweet, folksy, suitable for children tales are chock full of horrible death, crying children, murdered house pets, and abusive husbands, plus a fun cameo by Satan himself! The makers of this film probably didn't realize that their kiddy movie wasn't kid-like at all- because the bulk of the \"stories\" are footage from some other mid-to-late seventies movie about a killer monkey toy. Despite all the ugliness in these segments, there is a charming moment where a young boy happily sings \"Rock and Roll Martian\" to the stuffed monkey. This is probably the best scene in the whole, feature length movie. The other story segment, the one with the bickering, self-hating couple who can't conceive (kids love those kinds of stories!) has all the style and substance of an episode of \"Monsters\". This movie is filled to the brim by horrible acting, atrocious dialog, and some of the most laughable editing since Ed Wood's legendary day/night/day scenes. So don't hesitate to watch this movie.... if it comes on the late, great Mystery Science Theater 3000. Otherwise, you've been warned! ROCK AND ROLL MARTIAN!!",
         "Really....this is a hilarious MST3K episode...this film must have been made for MST3K one would like to think. But as that is not the case I can only say: WHAT THE HELL HAPPENED?! How did this movie ever get made? I love bad movies...but this is something beyond anything I've ever seen. THat it's from 1996 is also something I cannot believe. Who in their right mind joins a project like this? The biggest mystery in this movie is how the hell someone authorized it and got actors to actually play in it (of course..not all of them seem to do so) This is just ...a huge mystery of a film. I thank MST3K for showing it to me. It's really a gem amongst hugely crappy films. It's nice to see how bad a movie actually can get. Someone should really have made documentary about this movie and interviewed the people behind it. It would really solve one of the worlds biggest mysteries. Even the title of the movie is totally messed up. It should be \"MERLIN'S SHOP OF KILLER TOYS\" But..oh that would probably make it seem more predictable...uhm?",
         "Ernest Borgnine is a great storyteller. I think the boy suffered from random epileptic seizures after this film was made. This is awful. Merlin has decided to join the business world and has opened his shop of yore. Run by him and Mrs. Merlin, they first must deal with a cynical critic who threatens to ruin the shop's business. Good old Merlin gives him a book of evil wizardry. After fire breathing, cat from hell, levitating, and so on, the critic learns that this film has aged him (he's not alone). The second half is a rip-off of the monkey's paw, except in this case it's a duracell running monkey toy with cymbals. Ha ha. Of course, someone buys it as a present for a little boy and that's when the fun starts. One of the only saving moments is when Merlin goes around asking, \"Have you seen my monkey?\" Hee hee, that one always works! Merlin's gift shop.....to be avoided at all costs.",
         "It's hard to classify this atrocity. It's not really a fantasy, it's not very dramatic, and it most certainly isn't a family film. However, it is the type of film that's just begging to be torn to shreds on \"Mystery Science Theater 3000\", and fortunately, the folks at Best Brains turned this dog into Experiment 1003. Ernest Borgnine reaches the lowest point of his career as the narrator of a soul-scarring television movie he apparently wrote years ago. Now, keep in mind that he's telling this to his young grandson (who's still sharp enough to pick out a couple of plot holes). Apparently, Merlin decided that he wasn't moving enough merchandise in the Dark Ages, so he packed up and moved to 1996, setting up \"shop\" in an unidentified city. Entertaining a kid who suffers from bouts of slow-motion, Merlin is approached by an uppity reviewer for the local paper who sports a superiority complex and a wife who he hates for not being able to get pregnant (again, this story's being told to a kid). So the guy takes Merlin's magic book of spells and plans to demolish it with a strongly-worded review, but only ends up turning his cat into a ruthless hellbeast, then proceeds to light the animal on fire (again, there's an eight-year-old listening to this story). The guy ages a hundred years, rips off Humphrey Bogart, then turns into a baby, much to his wife's delight. So somehow, he's his own father. And now for something completely different. One of Merlin's most demonic possessions, a cymbal-clanging toy monkey (I always knew those things were evil) ends up being bought by a family from 1984. The young son, sporting googly-eye glasses and happily singing about the Rock and Roll Martian, is blissfully unaware that every time the monkey clanks its little cymbals (in the hopes that somebody somewhere is playing \"The 1812 Overture\"), some living thing in the house snuffs it. It starts when the dad notices that all the houseplants are dead (another issue - since when does a man notice a plant in the house?). Then an exploding lightbulb and an unattended pan of motor oil results in the fiery death of the family dog (remember, the little kid's still listening to this). With advice from his homicidal psychic friend, the dad tries everything he can to eradicate the plastic simian, if \"everything\" involves knocking it into a paper bag with a vacuum cleaner. But no, evil always finds a way, and the monkey keeps making it back to the 1980s. Merlin spends much of his time back in 1996 walking the streets, asking women if they've seen his little monkey. It amazes me that someone on the production crew watched the final product and said \"Hey, that's good, let's release it.\" If this was intended for the family market, then all parties concerned failed miserably, as the story flips back and forth between mundane and terrifying. But it offers a thousand good chances for being made fun of, and Michael J. Nelson and crew took those chances eagerly. Thank God.",
         "I remember seeing a recent MST3K episode featuring this \"Merlin\" movie, and oy, I got to tell you, the editor of this film should be fired (or sued by Stephen King for using one of his short stories in this movie). There are two plots dealing with Merlin, the sorceror, or as Ernest Borgnine told us. One story actually has Merlin interacting with people and the other one only has him just asking people for his toy monkey *snickers*. The rest and the intro of the film is basically stock footage from \"The Devil's Gift\" which is (from what I have heard) based off of Stephen King's \"The Monkey\", featured in his short story collection \"The Skeleton Crew\". And speaking of \"The Devil's Gift\", I saw the version uncut in a Jr. High English class, and though the film was not very memorable, the ending was. Originally, in the end of \"The Devil's Gift\", the whole family dies, including the hyperactive little brat. However, in \"Merlin's Shop of Mystical Wonders\", they poorly edit that, making it look like Merlin saved them, which never happens (if you listen in the background, you can hear the family screaming in agony). This film should be shown in a motion picture class at school, as an example on how NOT to edit a film.",
         "My sister and I were credited with 'production design' for this movie so I actually know quite a bit about how and why this movie was made... It took, I think, 5 years to shoot and was totally paid for by Ken Berton. A lot of the furniture and props in the film were from my home or from my prop garage... I had to admire Ken for his tenacity in actually and eventually getting the film in the can. His marriage ended due to his obsession with it and I think that the last letter I got from him mentioned that he'd had to declare bankruptcy. That was in response to my insisting that my sister and I get paid for the work that we had done for the film. We have yet to be paid, and shortly before I moved back to Canada from LA, I stopped bugging him. The movie must have been cursed because the last day/night of the shoot caused my sister's return to Canada, and her not speaking to me for nearly four years, until I myself returned to Canada. My sister and I went to the premiere together, and we were totally surprised to see Ernest Borgnine telling the story to the little boy. That part of the shoot we hadn't been involved in and Ken told us it was a last minute type decision to cement the different segments of the feature together... After a few years, I finally got a couple of copies of the film, but the memory of the shoot was so painful for me that I have never even opened the shrink wrap to the copies that I have. Neither has my sister. Is it possible that they may be collectors items one day?... I also helped with some of the special effects and with the make-up... Yes, it was a very, very LOW budget film and I learned a lot from it, and I thank ken for that. I didn't think that it was the worst film ever, since I've seen much worse with much higher budgets. lee~",
         "This movie is among one of the worst anyone has ever seen. Even Plan 9 from Outer Space has its funny points (all-be-them not intentional.) This movie is perhaps one of the worst movies ever made. From a film point of view, the movie has no tangible benefits what so ever. The film starts out with a grandfather telling a child a story about Merlin. What he failed to mention to his grandson is that Merlin is a complete and utter bumbling old man with a wife reminiscent of Roseanne. The movie then goes to show Merlin and his magical shop, and then, it goes to a completely different setting, and switches back and forth between Merlin's shop, and the different settings of the story. Both stories are supposed to be about \" How the people find folly in there own pathetic human ways and are grateful to Merlin.\" When they are really about \" How that old weirdo screwed us over and destroyed our families forever with his stupid shop.\" You might say \" Well didn't Merlin warn them?\" Yes, I'm sure he did, but them being stereo typical 80's men and women, where magic cannot exist and \" Dollar Good', they of course did not listen. In the end, this movie is only recommended to those who enjoy mind-numbing stupidity and rip offs of other poorly made movies. ( I.E. Dead Time Stories, Troll 2.) This movie receives a 2, and that's only because of the pity felt for the fact it cannot be shot and put out of its misery.",
         "This is a truly magical episode of MST3K. Though the movie itself is stupid beyond telling, the episode is arguable the most funny I`ve ever seen. My dad thinks it is anyhow. From the opening lines thrown out by Mike and the `Bots (\"Let`s predict some crap\" \"I forsee I`m gonna get hammered\" \"Is there a cheaper vodka than Popov?\" \"The ants have been screwing with her like that for years\") to the part when Jonathan confronts Merlin (\"I bid you lick me\") to when Jonathan fights his cat (\"So the cat`s flesh was roasted\" \"No Grandpa, no!\" \"Sit down, you`re gonna listen- The cat`s flesh melted, the horrible screams!\" \"No grandpa!\" \"Heh heh\") to the cheesy 80s part (\"Yep, that first morning beer is always the best!\") and the priceless finishing line, which is so memorable that it begs full transcription. Contrary to what some of these commentators have said here (and I`m not blaming them), Crow, not Servo, says \"Remember to believe in magic...Or I`ll kill you.\" This episode truly made me believe in magic.",
         "Wow! I question as to why this was made into a movie instead of a terrible anthology TV pilot. Along with being bad, this is just truly bizarre. It starts off with a burning building, which turns out to be a little kid watching TV. I guess the television program he's watching may foreshadow later events, but it's still pointless. The kid's Grandpa (Ernest Borgnine) tells him to turn that trash off, only to tell him a couple of strange horror stories to put him to sleep. Before the first story really starts, we are introduced to Merlin and his wife who now own a shop to bring magic to the world. Merlin ends up giving a book of spells to a jerk who's wife can't have a baby, but wants one. This guy ends up dabbling in the spells and doing some crazy stuff, including spitting out fire at the cat. Then there's a really dumb twist ending that I'm not going to give away. This segment was really strange, mainly because the first 15 minutes of it was Merlin, then it switches to a short 15 minute story. Also, by the rationale of this segment, Merlin gets his power from Satan. The second segment is better than this one...and the second one was terrible. A dad ends up giving his boy a stolen wind up monkey with symbols toy for his birthday. This doll claps the symbols together and bad things happen. To stop the bad things, all you have to do is put your finger in between the symbols, so it really isn't a very effective killer. The dad finds out the toy is evil somehow when his dog dies in a fire, which leads him to ask a psychic for help. Meanwhile Merlin walks the streets searching for info on where the evil toy he has for some reason, may be. The plot all leads to the dad trying to dispose of the doll before it hurts anyone, but when plans fail, will his family be fine? Who cares. This story is a big rip-off of two Twilight Zone episodes, \"Living Doll\" and \"It's a Good Life\", and even though they were made 30 something years earlier, they were much scarier and more believable. Along with these two stories sidetracked by Merlin and his wife's wacky antics, we have this dumb wraparound. The wraparound is stupid and pointless, but even more pointless is the title character, Merlin. There was no need to have Merlin in this. It would've been slightly better if they put in 3 stories and cut out the stupid old wizard and his cantankerous wife. Plus the music in the film I'm pretty sure is stolen from various films, including \"the Pagemaster\". In the end, this is a very bad and bizarre film. Adults will feel it's too violent and profane for little kids, older kids won't like it, and little kids will be too scared. For my final thought, I know this review sounds like a big complaint, and it really is. Let's hope the movie studios learned from their mistakes. My rating: BOMB/****. 85 mins. Contains some violence, language and some mildly sexual innuendos.",
         "The movie, a Brencam Entertainment/Berton Films release, is one of the more bizarre pictures to come along in a way, and is nothing more than two poorly-conceived, barely-frightening horror stories cobbled together and loosely tied together with the flimsiest of plot devices. It begins with a drunken medium consulting a Ouija Board and then being killed. It turns out that this was only a TV show being watched by Ernest Borgnine (who played the tough in \"From Here To Eternity,\" won an Oscar for \"Marty,\" then appeared in such shows as \"McHale's Navy,\" \"Air Wolf,\" and \"The Single Guy\") and his grandson, Mark Hurtado. After the electricity goes out, Borgnine relates two stories he \"wrote for television\" to the skeptical kid dealing with the never-asked question of what if King Arthur's wizard, Merlin, were alive today (\"Merlin used his powers to come to our time,\" Borgnine drones). The first episode features an infertile jerk of a newspaper columnist in a small Northern California town, Jonathan Cooper III (John Terrance) and his co-dependent, wife, Madeline (Patricia Samson, who pines for a child). After insulting everyone around him, and uttering a great unintentionally-hilarious line (\"I chew places like this up and spit them into the toilet!\"), he is given the wizard' book of spells and told to go to town on them. Merlin (George Milan), by the way, looks like a cross between Leon Russell and that one Oak Ridge Boy, and speaks like a gay guy on Novicane. A description of his wife, Zerella, played by Bunny Summers, is best left unwritten, suffice it to say, Lulu from \"Hee Haw\" mated with the Loch Ness Monster comes pretty close. Anyway, Cooper, after mocking Merlin, starts looking through the tome, and talking to himself on a tiny tape recorder, but eventually begins to cast some of the spells. This of course leads to some goofy scenes of things flying about, him being attacked by a cat, and then turning into an old demon that looks like Saleri from \"Amadeus; and finally a baby that his wife can now raise instead of the one she couldn't have. The next story features a small-time crook who steals a toy cymbal-playing monkey from Merlin's store (nothing else - just the stupid monkey) and then pawning it off. The buyer then gives it to Michael (Struan Roberts), the son of an addled single dad, David (Bob Mendlsohn), who plays with it, briefly, before moving on to toys that are more fun and interesting. For some inane reason, whenever the monkey bangs its cymbals, someone, or something (a plant, a fly, a goldfish, and a dog) dies. Which makes you wonder why Merlin even had it around to begin with. Another mystery is that why two different women would actually think that a normal 10-year-old boy would even want such a thing, or why the burglar thought it was valuable in the first place. Oh well. This plot device gives us a chance to see two really goofy scenes, though. The first has the little moppet singing \"Rock 'N Roll Martian\" to it like that one retarded kid in \"What's Eating Gilbert Grape,\" and then David, being told by an angry \"psychic\" to get rid of the toy, but not to \"let it know you're trying to get rid of it.\" So, the idiot begins cleaning his living room, trying to knock the monkey into a trash bag while whistling (\"Do da do do da. Not thinking' about demons No demons\"). Even after throwing it away, the stupid little kid fishes it out of the garbage can and is almost run over by a \"stud\" cruising for chicks in a Country Squire station wagon in a residential neighborhood. The dad has no choice but to take it out in the country and bury it, which only causes the earth to shake and David to almost get swallowed up as the world cracks like a China cup. Once again this begs the question of why a toy monkey that plays cymbals would have such power over life, death, time, space and nature. Couldn't it have been a more terrifying symbol than a cheap child's toy?! Later, after having a tree fall on him and almost dying trying to get rid of the thing, David discovers that his moronic mom brought it right back into the house. Merlin finally comes into the home and takes it back to his shop, placing it back on a shelf instead of destroying it. Yikes. For those who have never had a bad acid trip, seeing this film will give you just an inkling of how it would actually feel.",
         "Otherwise I couldn't bare this movie. This movie took two movies and used some sub-plot that didn't make any sense. This was terrible. Both of the two movies sucked and were pathetic. The acting, the effects, the music; need I go on? I'm not sure why they made this, but I am most definitely sure this movie deserves to get the MST treatment.",
         "Grandpa (Ernest Borgnine) is babysitting for little Billy when a storm causes a power outage. Faced with the sudden task of entertaining his grandson now that the TV is out of commission, he decides to tell him a story he'd written years before. It's the whimsical tale of Merlin, the magical wizard who proclaims that he \"only wants people to believe in and experience the joy of magic.\" So of course the obvious thing to do is open a trendy little shop downtown. It's (hopefully) not what the writer had in mind, but nonetheless it immediately becomes obvious that Merlin is (and I quote The Great and Powerful Oz), \"not a bad man, just a very bad wizard.\" Every item that leaves the Mystical Shop of Wonders causes terror and death. Apparently his great powers are useless when it comes to stopping the evil and harm he's 100% responsible for unleashing on the innocent. Despite the nearly non-existent links between subplots, one thing is consistent from beginning to end: every aspect of this story is so wrong on so many levels. No man, woman, child or household pet is safe – not even the goldfish! Seriously, even the most violent movies I've seen usually stick to one pet max! Don't get the idea that this is some sort of graphic horror flick. Not even by a long shot. It's pathetic, lame and ridiculous to the point that it's funny – that is unless you're poor little Billy. As you watch this, you'll be haunted by the burning question: \"Why is Grandpa Psycho alone with Billy, telling a violent tale that will likely scar him for life?\" But then, alas, he finishes the story with the lamest excuse for a happy ending and tenderly tucks Billy in. Sweet dreams little guy! I typically watch movies like this on Mystery Science Theater 3000, and I give that episode 10/10! This line really sums it up: \"So evil wins, Grandpa Borgnine?\" \"That's right, even your tiny soul is doomed, Billy.\"",
         "\"Merlin's Shop of Mystical Wonders\" is too dark to be a children's movie and too cute to be a horror flick. Which makes it perfect \"Mystery Science Theater 3000\" fodder! An incompetent mixture of \"Poltergeist\" and any wizard movie, it makes one wonder how they got a great actor like Ernest Borgnine on board. Although the movie has 1996 as its date, a large portion of it looks as though it was filmed at least ten years earlier (a very corny '80s look). As for the \"MST3K\" version, jokes naturally abound. I don't remember which jeers came from Mike, Servo or Crow, but someone notes that Merlin probably shouldn't ask women if they've seen his monkey! And when the ground starts caving in, one of them declares that Bugs Bunny must have missed that left turn at Albuquerque! Among the famous people who get mentioned are Tom Bosley, Madeline Albright, Bella Abzug and Linda Blair. So just stick with the \"MST3K\" version and you'll be fine. Yeah, she did look kinda like Julie Hagerty.",
         "I give this rating to the Mystery Science Theater 3000, forthwith known as the MST3K version. MST3K can make almost any horrible movie a laughing riot, and \"Merlin's Hop\" is no exception. If you do not know of MST3K, now you do, and I highly recommend you go check it out, especially if your the kind of person who likes to sit around with your friends and make fun of horrible movies. Basically, a guy and his two friends watch horrible movies like Merlin's Shop and critique it in every comedic way a horrible B-movie deserves to be critiqued. By itself, this movie is not worth watching, unless you wanna sit around with your friends and make fun of it yourself. But in the MST3K format, the \"making-fun\" is already done for you, and all you have to do is sit back and enjoy. Enjoy!",
         "\"I'm Sorry\" WHAT THE HECK WERE THEY THINKING?!? Merlin's shop of Mystical Wonders is definitely one of the worst cinematic excuses I have ever seen. To put it simply, what the Godfather did for film, this movie accomplishes basically the exact opposite. \"Whoops, ah farted\" First of all, the Godfather was an amazing spectacle which sent a chill down the spine while also bringing a tear to the eye. This movie sends a yellow streak through the pants, while bringing a yawn to the lips. Just as one of the characters ages during the film after performing magic(A butt wipe critic who goes ballistic on Merlin for claiming to be himself, while Merlin, in turn, voraciously apologizes for no reason, thus the quote above) so shall you. The magic feat of your doing, however, will be sitting through this 10 ton turkey without cowering. \"Have you seen my monkey?\" As you may or may not have heard, there are two parts too this movie. The first part involves a man (Afforementioned) who threatens to shut Merlin's shop down if Merlin fails to present him with real magic. Merlin, being the nice guy he is, gives him the critic a book that ages him 40 years, turning him into what looks like a fight between Bill Nye the science guy and a 17th century powdered wig. \"Now, where did I put that great clips coupon\" The second part, which is actually a separate movie from director Ken Burton, who decided to cram the two together into an obvious fusion. Basically, a burglar steals a monkey, which can kill, and this makes Merlin really.......... sad. He basically first starts to mope, and then goes out and searches the city for the toy. He has no luck, until a random lady happens to remember seeing one of the thousand identical toys in a shop window. Meanwhile, in the same, yet different movie, a man buys his kid a toy, and it starts killing stuff by clanging it's cymbals together. Boring things happen, and some people almost die, and the man acts like a retard and almost falls in a pit, and we all cheer when the movie is finally over. \"It makes your greatest wish come true\".\"Then why are you still standing here?\" One thing I forgot to mention is that the whole movie is narrated by an old man with a giant gap in his two front teeth, who sent a chill down my spine every time he smiled. Of course, since the T.V. wouldn't work, he decided he would scare his Grandson (The worst child actor ever seen) crap less. Basically, the title of the film leads you to believe that this film is a children's flick about magic and sappy joy and hearty, squeaky-clean love. SCREW THAT! Cats get lit on fire, animals get burned, and worst of all, we have to endure it all with the gap-toothed Ernest Borgnine! Yargh. 1/10 stars is just too much",
         "When you see a blonde woman threaten an old coot dressed up as Merlin, with Mace, you know you're in for a treat of a movie. Merlin's Shop of Mystical Wonders is one of the most muddled up, confused, poorly stitched together films you could ever have the misfortune to come across. It opens with a young boy watching TV. His grandfather then begins to tell him some stories about Merlin, the Great Magician, who has opened up a spell shop in the modern times. Selling potions, spell books, snakes, spiders, cauldrons and other wacky products, it's no surprise that an enraged reviewer decides to threaten Merlin by promising to give an awful review in the local paper about the shop. He then takes one of Merlin's spell books home and begins to dabble in the dark arts, only managing to turn his cat into a vicious beast. The cat then begins to violently attack it's owner, which results in the man setting the cat alight, and letting it die in a burst of flames. So far so good for a children's movie? No. So far so good for a horror film? No. Okay then... well, so far so good? No! The pain then continues when the man continues to practise spells, but only ends up turning himself a hundred years older, then turning himself back in time, to a young baby. And there, we have the end of the first strange story. Nothing very entertaining to get out of it. It's to harsh and bloody for young viewers, yet to unrealistic, unappealing and tame for any older viewer. The acting so far stinks like rotting fish, and the plot is a muddled as you can get. Then onto the second story, about a birthday present bought for a kid; a procession monkey doll, which claps cymbals and chatters it's teeth. However whenever it does this, something bad happens (starting with a goldfish, then the cat, then the near miss with the human) This episode is a fun premise, but is done slowly and painfully, with no real suspense or excitement to hold you down and reel you in. It's just to boring and slow and plain for anyone over ten years watching, and to creepy and a slight bit unsettling for very young, young children. So what audience category does this fit into? Who will enjoy it? Who is it aimed at? The answer is; no-one. And no-one should feel the need to torture themselves by trying to sit through this bland, sordid mess.",
         "How does and Actor such as Ernest Borgnine get into an F (Failure) Grade movie? Don't waste your time watching this movie as its pathetically useless and its cinematography is even below an amateur's standard. The story line could have worked well if its presentation and Actors were of a higher caliber. Not mentioning the lack of quality of the film. Most disappointing to see such a waste of film material.This is a disgrace to the film industry. There should be a regulation to stop poor films hitting the market. Total waste of time and energy. How this made it to a DVD or even to the screen is beyond all comprehension. I wouldn't rate this movie as there is no digit that springs to my mind that would even make it worth a minus rating.",
         "This 'movie' is kind of two stories brought together by Ernest Borgnine telling his grandson a story. Basically, the film has an older film called, \"The Devil's Gift\" fused with newer scenes and is presented as a movie. The \"Devil's Gift\" portions of the film are at the very beginning of the movie as the film Borgnine's grandson is watching is from that film and the last portion of the film featuring the very early 80's household dealing with the cymbal thumping monkey toy which has me wondering if they took said story from a short story done by Stephen King that can be found within the short story collection, \"Skeleton Crew\" as both stories feature the same premise of an evil monkey toy. The rest of the film has Borgnine telling his grandson the story of some failed television show he once tried to write featuring Merlin, but the film just does not work at all for several reasons. First and foremost is the fact the Merlin shop thing just did not work. Both stories are more horror oriented than fantasy as both stories feature Satanic type vibes to them. Then there is the not so seamless blending of two different era films as the portions of the film featuring Merlin look vastly different to the one featuring the monkey toy. Just a huge mess, to be sure. The story has the power going out in a house where a young boy watches the story of a woman using a Ouija board to contact a spirit from the other side. The boy's grandfather then proceeds to tell the child about Merlin and his mystical shop of wonders. We then enter Merlin's world where the first plot is that of an infertile couple where the husband writes reviews that have the ability shut stores like Merlin's down! Merlin gives him his spell book and the guy proceeds to get wrapped up in spells to summon demons and such while the wife plays with kangaroo toys because she so wants a baby. Then the story has Merlin's being robbed as the robber picks a cymbal banging toy monkey and seems fascinated by this very mundane toy in a shop full of numerous bizarre things. Well the toy ends up being given to a boy in the early 80's and it possesses the power to kill whenever it bangs its cymbals together. Merlin must track down the monkey, but it isn't going to be easy as he goes out in robe and beard asking women if they have seen his monkey. If that is not enough to make it difficult, he also has to contend with the fact the toy is in another era! This 'movie' was featured as an episode of Mystery Science Theater 3000 and is the final new episode of the show that was presented of the Scifi channel. It was not technically the last episode as that was the one featuring Diabolic; however, do to some issues regarding the copyright this film would not debut till after the show's actual end. It was a great episode as there is a lot in it to riff. The strange fact the film seems like it wants to be whimsical, but is kind of dark and the fact that the portion of the film featuring the monkey is extremely dated are just two of the reasons this episode was very funny. So, the film as presented here is rather bad. I would like to one day watch the movie, \"The Devil's Gift\" as I think that one might be interesting without the constant interruptions of a dude in a beard going around asking about his monkey. Granted, I do not think it is going to be a good film either, but the whole Merlin thing in this one was just a bit idiotic. One expects knights, swords and some magic when one hears Merlin's name. Here we get demons, satanic cats, killer monkeys and the like. It is less like Merlin and more like an episode of that old television show of the 80's, \"Friday the 13th\" where the show was about this group that had to retrieve cursed items, only that show was a heck of a lot better than this mess.",
         "First off i'd like to say that i enjoyed this movie from beginning to end. now, now don't start throwing rotten fruit and stones at me just yet! i will say that i viewed the mst3k version and i found that it was without a doubt one of the most hilarious episodes i've ever seen! there's nothing like sitting back and enjoying a good ernest borgnine movie that looks like each story takes place decades apart! one part squeezes us onto the couch of the overly bulbous ernest borgnine. he's telling the story to his grandson who looks like he's only nine. the story is wrapped around a family theme and a horror story. now what kind of a sick grandfather would tell his grandson a story in which people are being mauled by magical monkey dolls and accidents caused by magic spells? the funniest part comes when the 1980's scenes are taking place and the monkey doll is purchased. tell me this. why, in the name of god and all that's holy, would a twelve year old boy want a monkey doll? if i had been given that at age twelve, i would have kicked my parents in the face! but i did enjoy the middle-aged balding father figure who wore bell- bottoms and was always triyng to save the day. he solves that oh so problematic problem of getting rid of devil monkey dolls. do you have a devil monkey problem? no worries! just throw him in the trash! and another thing, that kid was way too big to be riding a big wheel.his disco queen lookalike mom must have babied him!!!!! then we've got merlin himself running aimlessly around town mumbling and sputtering out sentence fragments like: HAVE YOU SEEN MY MONKEY? do you have any idea how fast that b*****d would have been arrested in real life if he would have said that. not to mention that merlin is married to MIMI BOBECK from the drew carey show. not to complain too much, but in the original king arthur saga Merlin had no wife. this movie is absolute garbage. >",
         "Borgnine tells his grandson horror stories on a stormy night, during a blackout. The first story involves the adult theme of a couple's infertility. The second concerns a murderous toy monkey. Animals and old women are killed; the kid, who watches violent TV programs, is supposedly unfazed by his grandfather's horrific tales. For Borgnine fans, this film makes a fine sequel to his mid-70s Satanist excursion, \"The Devil's Rain.\"",
         "That's just one of the many lines that take on a whole new meaning of annoying in \"Merlin's Shop of Mystical Wonders,\" a wonderous film all right. It's a wonderous film, all right, one that cries out for a severe bashing from the get-go. Thank the stars, for MST3K, their witty remarks made this quite enjoyable, despite being two horribly done short films slammed together. One is about a writer who dabbles with Merlin's spell book, with unfortunate results and the other is from one of the director's other flicks, \"The Devil's Gift,\" which was about an evil toy monkey. Neither of these stories are very scary or interesting for that matter. What makes them even less interesting is they are being told to a little boy by his grandfather Ernest Borgnine (or however its spelled). Well to sum up, the acting is bad, but the fact that the second film is from the '80's and they try to pass it off as the '90's, makes the acting seem passable. 9 for the MST version.",
         "In my distinguished career as a movie critic, I divide movies into three catagories: Good movies, bad movies, and movies like Merlin's Shop of Mystical Wonders. Consider, if you will, the amazing symbolism found in the critic playing with magic. Can you not see the critic playing a Faust character, an alchemist toying with a power beyond him and then getting visited by the devil? Does this not symbolise man's hubris? Does it not show the inherent limits we are all capable of? I'm disgusted NOBODY finds this in this movie. And what of Merlin himself? The looks he gets on the street when he's in search of the Creepy Monkey toy only highlight the alienation wizards, wiccans, sorcerers, and Clinton Cabinet Members feel when they walk down the street. My god, are you not human? Can you not feel their pain? I'm kidding, of course. I don't need to tell you (but will anyway) that this movie is no movie that anyone except convicted politicians should ever see. And to think this was intended for children. Is Elementary School not enough torture for our young people? Do not watch this film, especially if you don't have the maturity to laugh at the hokiness of the Creepy Monkey Toy, or you don't have MST3K to help.",
         "You know what would happen to you if you took Sudafed and Nyquil together? You would have a reaaaaallllly weird dream of seeing three old codgers sweating, feeling urpy, and shedding gray hair, just like the 3 fossils in this MST3K-lampooned flick, \"Merlin's mystical shop of Wonders!\" The 3 codgers are one guy who claims to be the wizard Merlin, the other his wife (who look a lot like Divine!!) and the grandpa, played by Ernest \"Over the Hill\" Borgnine!. Basically, this movie is a myriad of pointless junk that contains not only old geezers, but annoying little brats, just like the kid who was playing with that weird monkey toy. Just what was that kid saying anyway? I know he said \"Rock and Roll Martian\" the first time, but it sounded like he also said \"F***ing old Martian\", too! This film was carefully tested and blasted by the folks at MST3K, and they broadcasted it with the remedial aid of their funny banter! If it weren't for the guys at MST3K, this trash flick would be as dangerous as giving a loaded 44. magnum to a 3-year old toddler."
      ],
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "Berton Films",
         "Brencam Entertainment"
      ],
      "summaries": [
         "This is a movie within a TV movie within a made-for-video movie. A boy is watching TV when a power outage forces him to talk to his grandpa for entertainment. His grandpa, a former screenwriter, re-tells an old screenplay about Merlin's Shop of Mystical Wonders. In it, Merlin sets up an enchanting store in a modern-day strip mall, accompanied by his gleeful wife and gnomes, snakes, dragons, etc. From this framing device, we then see two stories about people's encounters with items from the shop. The first sequence (created for this film but looking like an episode of \"Tales From The Darkside\") involves a pompous, cranky newspaper critic who begins casting spells using Merlin's spell book. The second story, an edited version of the full length movie, The Devil's Gift, is about an evil monkey doll (you know, the wicked grin and the cymbals?) who kills every time his hands clap. Merlin of the 1990s is disjointedly tied-in with the 1980 movie.",
         "Two creepy \"horror\" films joined together by Merlin's Shop which is, in turn, introduced by a Grandpa telling the story."
      ],
      "budget": 0
   },
   "movielensId": 173123,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-01",
      "dvdReleaseDate": null,
      "directors": ["Kenneth J. Berton"],
      "runtime": 92,
      "movieId": 173123,
      "title": "Merlin's Shop of Mystical Wonders",
      "mpaa": "",
      "actors": [
         "Ernest Borgnine",
         "George Milan",
         "Bunny Summers",
         "John Terrence",
         "Patricia Sansone"
      ],
      "imdbMovieId": "0174917",
      "originalTitle": "Merlin's Shop of Mystical Wonders",
      "genres": [
         "Horror",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two creepy \"horror\" films joined together by Merlin's Shop which is, in turn, introduced by a Grandpa telling the story.",
      "tmdbMovieId": 31244,
      "avgRating": 2.5,
      "releaseYear": "1996",
      "numRatings": 5,
      "posterPath": "/kzhJTLFggoXWAcF5WmElTxaiCPk.jpg"
   }
}