{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "burning of witches",
            "id": 2871
         },
         {
            "name": "walnut ranching",
            "id": 204942
         }
      ],
      "imdb_id": "tt0066476",
      "video": false,
      "title": "The Touch of Satan",
      "recommendations": [
         28445,
         31253,
         31380,
         31123,
         87874,
         31116,
         31119,
         31276,
         85854,
         13383,
         62855,
         109122,
         31122,
         31129,
         52745,
         34077,
         31264,
         27674,
         31258,
         31287
      ],
      "backdrop_path": "/zxcn6LN6KbwvtzGPOCMWAcedOHZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jodie Lee Thompson",
               "gender": 2,
               "credit_id": "52fe44799251416c91011f39",
               "name": "Michael Berry",
               "profile_path": null,
               "id": 67754,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Melissa Strickland",
               "gender": 0,
               "credit_id": "52fe44799251416c91011f3d",
               "name": "Emby Mellay",
               "profile_path": "/kEmEjht1y3gqgoiwmwyfkxnSxPg.jpg",
               "id": 1211360,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Luther Strickland",
               "gender": 0,
               "credit_id": "52fe44799251416c91011f41",
               "name": "Lee Amber",
               "profile_path": null,
               "id": 1026391,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Molly Strickland",
               "gender": 0,
               "credit_id": "53ac91afc3a3682edf00039f",
               "name": "Yvonne Winslow",
               "profile_path": null,
               "id": 1334644,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Lucinda Strickland",
               "gender": 0,
               "credit_id": "53ac91cec3a3682ed800042d",
               "name": "Jeanne Gerson",
               "profile_path": null,
               "id": 1076619,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Mr. Keitel",
               "gender": 2,
               "credit_id": "53ac926ec3a3682edb0004da",
               "name": "Robert Easton",
               "profile_path": "/1FtmmVRUFFepaE5ovwfwcSId8Ka.jpg",
               "id": 32494,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Deputy John Mason",
               "gender": 2,
               "credit_id": "53ac92e2c3a3682ed8000446",
               "name": "Lew Horn",
               "profile_path": null,
               "id": 154361,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Young Lucinda",
               "gender": 0,
               "credit_id": "53ac92fdc3a3682ee6000460",
               "name": "Sharon Crabtree",
               "profile_path": null,
               "id": 1334645,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53ac904ec3a3682ee6000422",
               "name": "Don Henderson",
               "profile_path": null,
               "id": 1028471,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53ac9070c3a3682edb0004bb",
               "name": "James E. McLarty",
               "profile_path": null,
               "id": 1163997,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53ac908ac3a3682edf00038e",
               "name": "George E. Carey",
               "profile_path": null,
               "id": 101458,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53ac90b4c3a3682ee600042c",
               "name": "Robert O. Ragland",
               "profile_path": null,
               "id": 98606,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "53ac90cfc3a3682edf000391",
               "name": "Jordan Cronenweth",
               "profile_path": null,
               "id": 594,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "53ac90fcc3a3682edf000396",
               "name": "Dick Elliott",
               "profile_path": null,
               "id": 1334641,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53ac911cc3a3682eee000436",
               "name": "Joe Blasco",
               "profile_path": null,
               "id": 103869,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "53ac9157c3a3682eee00043b",
               "name": "Steve Karkus",
               "profile_path": null,
               "id": 8959,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.03672,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31382,
      "vote_count": 12,
      "budget": 0,
      "overview": "A murderous and decrepit old woman resides on a California walnut farm with her family. On a whim, a traveler named Jodie makes a brief side trip to the farm, where he meets and falls in love with Melissa, the proverbial farmer's daughter. Jodie and Melissa grow closer as Melissa begins to reveal the strange, dark history of her family.",
      "similar": [
         60304,
         22033,
         675,
         9100,
         671,
         672,
         767,
         2667,
         588,
         11906,
         39890,
         16859,
         129,
         76492,
         37430,
         27022,
         674,
         290595,
         159824,
         673
      ],
      "original_title": "The Touch of Satan",
      "runtime": 90,
      "poster_path": "/35gOnMykpCE5OauvbLmDRtGv9V2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Stupendous Talking Pictures International",
         "id": 26046,
         "origin_country": ""
      }],
      "release_date": "1971-08-23",
      "vote_average": 1.6,
      "belongs_to_collection": null,
      "tagline": "To Love Her Is To Be Cursed!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Henderson"],
      "runtime": 90,
      "synopsis": "Jodie Lee Thompson (Michael Berry) is taking a trip to San Francisco from Austin, TX. Stopping at a small town for some supplies, the gas station attendant informs Jodie that there's a killer on the loose, and that a local farmer was recently murdered. Jodie drives off, and eventually takes a detour through an area where some trees and a small pond are. While having some food, he is surprised to meet a young woman. She tells him that her name is Melissa Strickland (Emby Mellay). Melissa eventually invites Jodie back to her family's walnut farm, where he meets her parents Luther (Lee Amber) and Molly (Yvonne Winslow). After dinner, Jodie prepares to go to sleep, when he is shocked when a wrinkled old woman with white hair and a badly scarred face appears in his room for a few moments. Jodie tells Melissa, who claims that he saw her Great-Grandmother, Lucinda. When Jodie inquires about her face, she explains that Lucinda was badly-burned as a young girl. The next day, Jodie and Melissa go into town for some supplies. Going into one store, Jodie is surprised that alot of people are going out of their way to avoid Melissa. Melissa explains that this is because the townspeople say that she is a witch. Jodie finds this laughable and hard to believe. On the drive back to the farm, Melissa offers to show Jodie where she does her witchcraft out of. Going to a small shed, the two talk over what Melissa's witch powers are, when Luther comes by. He doesn't give much information, but Melissa suspects that Lucinda has gotten out of the house again. Feeling something is wrong, Melissa asks Jodie to take her back to the house. The two arrive in time to see Lucinda having killed a Sheriff's deputy, with Luther and Molly trying to restrain her. Melissa manages to calm Lucinda, and has Molly take her inside. Luther shocks Jodie when he takes the keys from his car, and puts Jodie in the barn, handcuffing him to a pipe. As he is in the barn, Jodie's thoughts return to the gas station attendant who claimed that there was a killer in the area who had killed a farmer recently, and Jodie now feels that Lucinda is the killer. Melissa comes into the barn to talk to Jodie, who insists that they should have turned Lucinda into the police some time ago. Melissa claims she can't do that, and she has to take care of the family, claiming they are cursed. Jodie refuses to believe this as well. Later on that evening, Jodie is allowed dinner and goes to his room in the house. Melissa goes to the shed, and through her powers, coaxes Jodie to dream a certain dream: In it, Melissa is a young woman, in the 19th century. She is seated with her sister Lucinda and their parents reading a Bible, when some townspeople come carrying torches, and chanting 'burn the witch!' The father goes out to see the villagers who claim that a plague has struck their village, but left the Strickland family without any problems. The villagers then say that this is due to Lucinda being a witch, and soon after drag her from the house and burn her on a pyre. Melissa pleads for anyone to help her, when a strange wind is heard, and a voice asks Melissa if she will accept the Devil in exchange for the saving of her sister. Melissa agrees, and is able to put out the fire. She then lays curses upon the villagers who run off. Melissa is then seen untying her sister who has been badly burned. Jodie then goes to the shed where he finds Melissa. Through discussion, Melissa explains that she sold her soul to the Devil in exchange for saving her sister's life. This resulted in her staying youthful-looking for 127 years, but due to the deal, Lucinda aged and goes through her violent attacks. Even with everything he is told, Jodie still claims that he can't believe it all, but does love Melissa. Suddenly, Lucinda appears at the door, intending to kill Jodie. Melissa then causes her sister to catch fire, and she and Jodie escape from the shed before it burns to the ground. The next day, Jodie is given the chance to leave. He promises Luther he will not tell what he saw, but still refuses to believe what Melissa said was true. Jodie drives off a ways, but then has second thoughts, and turns back. Heading back to the pond and forested area, he finds Melissa waiting there. Jodie tells her that he still loves her, even if the Devil is inside her soul. They then make love, and Melissa tells Jodie that his love has set her free. However, this comes with a price: having freed Melissa, she has now begun to age to what she really is, and will now die. Jodie then calls upon the Devil, and gives his soul for Melissa, returning her to her youthful form, and now sharing in the curse that has fallen over the Strickland family.",
      "writers": ["James E. McLarty"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066476/",
      "coverLink": null,
      "actors": [
         "Michael Berry",
         "Emby Mellay",
         "Lee Amber"
      ],
      "reviews": [
         "How is this film stupid? Let us count the ways: 1) It centers around the two most lackadaisical characters to ever be the subject of a film. Jody and Melissa spend half the movie sitting in uncomfortable silence, and the other half trading dialogue in accents that never reach any level of emotion, not even when Melissa's loony \"grandmother\" Lucinda starts skewering people with farm implements. 2) Melissa and Lucinda live out in the middle of nowhere, on what Jody insists on calling a \"walnut ranch.\" Note to screenwriter: ranches usually raise livestock. Walnuts are more likely to be found in an orchard. 3) Besides Melissa and Lucinda, the ranch is also home to Luther and Molly. We assume they're Melissa's parents, until circumstances prove that impossible. Who they really are is aparently none of our business. 4) Melissa insists she's possessed by the devil. Jody refuses to believe her. This will persist, with no variation, for most of the film. 5) In a flashback, we learn Melissa and Lucinda are really sisters, and that Lucinda was nearly burned at the stake for witchcraft by an angry mob (more on them later) until Melissa sold her soul to Satan to save her. This scene, we later learn, takes place sometime in the 19th century. Blaming witches for everything had pretty much gone out of vogue by that time, although blaming minorities was pretty popular, if I remember my history. 6) Satan apparently is inconsistant in his deals. Melissa is allowed to remain young, while Lucinda ages. Then again, Lucinda in her youth looked something like Frida Khalo, so she didn't miss much. 7) About that angry mob--okay, angry isn't the best word for them, since they have about the energy and enthusiasm of a checkout line. How are we supposed to feel about them? They arrive with torches to burn Lucinda for witchcraft, but then it seems Lucinda really is guilty of the crime. It's one thing to portray Christians as narrow-minded, superstitious, and hypocritical, but what happens when they're actually right? 8) During the burning, the mob breaks out into \"Amazing Grace.\" Aparently they only know one verse to the song, since they repeat it endlessly. 9) To save Melissa from the Devil, Jody must sleep with her. We're not sure why this is. 10) Once freed from the clutches of evil, Melissa begins showing her age, which is around a hundred and twenty. Most films would allow Melissa to die, so that her tormented soul may finally be at rest, but nooo--Jody has to sell his soul to the Devil to get her back. This might be a harrowing statement on the powers of darkness, until I recall that having people like Jody and Melissa in the camp isn't exactly an asset for the forces of Hell.",
         "If you went into this film looking for great acting, a quality plot, excellent writing, and stunning special effects - oh boy, did you come to the wrong place! However, if you like a campy film that will allow you and your friends to revel in it's inadequacies - you've come to the right place. I've seen the movie by itself and in the MST3K version. (If you need tips on how to enjoy campy BAD movies, please watch MST3K sometime.) They were both just as enjoyable from a fun perspective. The dialog is unbelievably strained - but it doesn't come off boring, it comes off laughable. The male lead has some terrible acting, but funny enough to make you like the guy. Sure this film has some plot point problems, like who the heck are her \"parents\" she lives with if she's 120 years old? Or why does Satan apparently talk to everyone with their own voice? But it doesn't distract you, it makes you laugh and get more interested in this bad film. If you like campy schlock on a Saturday afternoon or Saturday night while drinking with your friends, this one is fun. If you want a good film, go elsewhere.",
         "Yes, the movie is pretty bad, and probably deserves the \"heckling\" it receives when being aired on MST-3000 on Sci-Fi channel. But it is still watchable, all the way to the end. I actually felt a sort of pity towards it: it seemed the movie had a feeling of wasted potential, like someone who could have been successful in life if only they had been allowed to attend a better school. It brings to mind an excellent comment I read by a reviewer who was commenting on the remade (1998) version of the movie \"Psycho\" - basically, that it was so pointless, afterall there are so many bad movies out there that deserve to be remade, so why would Hollywood waste time and money remaking the good movies, it makes no sense... And this movie fits that category exactly. It screams for re-make. It has all the makings of a pretty interesting, if not downright creepy, story: a traveller (driving a Maverick no less) who stumbles off the beaten path, into a remote out-in-the-boonies country location, where he encounters a good-looking girl living with sweaty people... But, she is not what she seems, because in reality she is 127 years old - her youth and vitality being due to a pact she made with Satan a long, long time ago... Oh, and there is death by pitchfork, and rural cops who even consider cowchips in the course of their crime investigation. Yes, there is a veritable gold mine of possibilities here. So, I nominate this movie as one of the bad ones that urgently needs to be remade, only with better production values, better script, better acting, better overall budget. (And a better soundtrack, too - it needs more songs in it than \"Amazing Grace\"). I see lots of potential here. Too bad I'm not a producer or a director, I could really do a lot with the basic ingredients that are at hand here. And if the remake doesn't work, well, \"Zah!\"",
         "Much to my joy, I was looking for something on my MST3K videotapes this weekend, and I stumbled across this movie on one of them...a new MST3K that I had taped years ago and never watched! Joy! Ok, so I watched this movie, and it's honestly not that bad! Yes, it's a bit cheesy in a 1970s sort of way, and there are a few pauses when people are speaking, and there are lines like \"This is where the fish live\", but this movie is really not that awful! Watching a film like \"Manos\" or \"Red Zone Cuba\" without the MST3K treatment would make a person long for the sweet release of death, but I think I could have watched this film without the riffing and still have enjoyed it. I thought it was a decent movie. True, it had plotholes big enough to drive a barfed-on Charger through, but it was a pretty decent movie. And I have a HUGE crush on the main character, Melissa. Touched by Satan or not, she's a sweetie who only wanted to help her sister. :(",
         "Relatively unknown low-budget horror (unless you happen to have caught in on Mystery Science Theater 3000 in 1998) is actually a pretty interesting and well-done horror venture. Young man drifting through the American heartland meets an attractive farm girl, who turns out to be a 100 year old witch with some dark secrets. Considering that The Touch of Satan is a drive-in flick of the early 70's, it comes off as a nicely-made and effective shocker. Director Tom Laughlin gives this film a gritty and creepy atmosphere. The film boasts some good tension and jolting murder sequences. The makeup FX are quite impressive, especially for a film of small budget. Story-wise the movie is both intriguing and chilling, reaching a truly poetic (and haunting) conclusion. Special mention also goes to Robert Ragland for his wonderful music score. The music is both beautifully stirring and melodic, a perfect piece for this film. The cast is also great. Stars Michael Berry and Emby Mellay are likable and attractive leads. The Touch of Satan is a much better horror film than many will give it a chance to be. Don't get me wrong, no one loves MST3K more than I do, but Touch of Satan is a horror movie that works even without the riffing. *** 1/2 out of ****",
         "A young man named Jody drives across country and decides to stop and have lunch in a small town where, he's been told, a \"chromichidal maniac\" is on the loose. He meets a young pretty girl named Melissa, falls instantly love and follows her home for dinner. Dinner turns into a weekend and we slowly (very slowly) learn that Melissa is no ordinary seventeen year old girl. She's a 120 year old witch who sold her soul to Satan, and the incredibly wrinkled woman she claims is her great grandmother is actually her little sister...and a \"chromichidal maniac\" to boot. Seems Melissa sold her soul to save the weird old chick from being burned at the stake by an angry mob 120 years earlier. Now, it seems, nothing can save Melissa from the curse...except perhaps for Jody's love. Will he sell his own soul to save her? Who cares? This 70s effort is filled with bad acting, a terrible script and a story that doesn't make a whole lot of sense. The flashbacks to the 1850s still manage to look like the 1970s and the angry mob is more of a slightly irritated gathering. Everyone looks stoned and delivers their lines in half hearted monotones, eyes glazed and faces expressionless. And Jody has got to be the stupidest kid yet to appear on screen. He hangs around even though he's clearly not wanted and continues to hang around even after things begin to get menacing. Not even the sight of Gramma-Sister eviscerating a cop with a scythe can scare him away for long. No, he's too much in love with Melissa, a drab farmgirl with minimal beauty whose claims of Witchy-ness cannot penetrate Jody's thick skull and sound any sort of alarm bells. And who the hell are those people that Melissa is living with? They're not her parents, but they're in on the Dreadful Truth, so what gives? This is just one of the many glaring plot holes that litter this lackluster film. Not even the horrific murders and the fiery finale could keep me from nodding off. This movie just kind of plods along like a cinematic sedative until it finally peters out and ends with no fanfare whatsoever. Guaranteed to cure insomnia.",
         "The plot says, \"A man meets a farmgirl who is actually a witch.\" I think the story is a bit more complicated than that, but sure... The film has flaws. Oh, yes, it sure does. Poor video quality (perhaps fixable) makes the picture appear even more cheap than it probably was. The plot drags at times, many times, and the villain relies on some rather poor makeup (though this would be less bothersome if she was shown less). Actually, the plot dragging is the worst part. Cut ten minutes off this to improve the pace and the whole movie would instantly be improved. Most people have probably seen this film on \"Mystery Science Theater\"... (actually, most people have not seen the film at all). Do not let this fool you. While the movie is bad, it is not quite the terrible film IMDb makes it out to be. I see worse films on a regular basis that somehow get better rankings. So, although this film is bad, its being on the Bottom 100 is in error -- with a few touch-ups, edits, etc. this film has the potential to be something more. Still something average, and not actually good, but far from the worst...",
         "I found this far more watchable than most others seem to have. A farmer inspects a noise in his barn, which we can see came from a doll. He encounters a killer with a pitchfork. The scene following seems to have a family commenting on the death, suggesting the guy turned out OK. However, it turns out they were talking about something else, as the killer stumbles in - and the family is committed to hiding the crime. A young man traveling to California stops in the town, and meets a young woman by her family's pond. They take a liking to each other, and she invites him to stay. Unfortunately, they're the family from the opening scene. She claims to be a witch, and he's skeptical. She claims also to be possessed by the devil, but this seems to refer more to ownership than the devil actually being inside her controlling her actions. The movie is slow, but has a nice 70s flavor, and a bucolic farm setting. For the gorehounds, there's the opening pitchfork scene (not terribly gory), and a much bloodier kill with a hook used for handling hay bales. There's a flashback to 100+ years ago of the punishment of a witch. The ending is perfect.",
         "If you like self punishment this movie is for you. How anyone could be able to watch this un-MSTed without blowing their brains out is beyond me. The acting of the unwitting boy and the 200+ old (but only looks in her 20s) witch are just horrible. Were these two not aware that 15 second pauses between lines are not good ways to keep an audience interested? Not that the other actors are much better. Melissa's \"parents\" are out-acted by pot holders and the old (at least 190 years old and at least looks her age) crazy sister of Melissa. Even Satan didn't do anything cool in this movie, nor did he/she even bother to appear (physically) in it. The plot is in a whole world of disarray. They left out the part of the script where it is explained how the simple Ma and Pa farmer folk got to be the witch's and her sister's parents. The walnut farm which doesn't have a single walnut tree on the property, and if there is they like to eat hay. Getting rid of a cop and his car off the edge of a cliff will attract absolutely no attention to the local police of foul play. Even though he happen to be calling in on the CB when he was killed by the psycho sister. Oh yes, and finally old decrepid granny-looking women can sneak up on almost anyone and kill them (even in broad daylight!). The ending is the typical devil schlock. (I won't ruin it for those who actually WANT to watch this movie.:P) But it ain't surprising. The most hilarious line in the movie is where the two \"lovebirds\" are standing and staring at a lake and Melissa says, \"This is where the fish live.\" Nobody (or movie) can be taken seriously after a line like that. Not even the real touch of satan could save this movie. The scene that sums this movie up is the one of the boy puking beside his car. It's exactly what you'll do if you had to sit through the *PURE UNADULTERATED EVIL* of \"The Touch of Satan\"! Thank God for MST3K...",
         "Thanks to the good, good people of Mystery Science Theater 3000, I have been subjected to a wide variety of tremendously bad movies. Some are worse than others, and some are so horrible that writing commentary on them is almost pointless. (Almost as pointless as why anyone would make the movie in the first place, i.e. 'Santa Conquers the Martians') But this delightful little film is definitely worth the commentary. Definitely. The story begins as we're cruising around in a hot, brown maverick with Jodie Thompson: the ill-fated loser/hero of our movie. He winds up at a walnut ranch on his road trip where he meets the frumpy Melissa Strickland, a gal with more than a couple of demons in her closet. Melissa talks Jodie into hangin' around for a couple of days, just enough time to get a first taste of what family life is like at the Strickland residence. Grandma mutilates a few people, Jodie and Melissa do it near her \"Dad's\" pond, and a couple of souls are sold to Satan. Fin. The plot itself isn't horrible... but everything else about the movie is. Horrid looking actors, horrid directing and film editing, and let's not forget the horrid dialogue. (\"This is where the fish lives\" will forever remain one of the funniest, stupidest comments ever said in a film.) In other words, this is a horror film- as in horrific every which way you slice it. But the film isn't all that unbearable to watch, especially when you have a couple of sarcastic robots at hand. The less seriously you take the movie, the more fun you'll have. And the more fun you have, the easier it will be to make it through the entire movie. Get's a 2.4 out of 10!",
         "(spoilers)Did anyone else actually enjoy the mad killer Grandma? At least she wasn't boring, and she didn't perpetually pause like the rest of the cast. Jody's a dull wuss, Melissa's a floppy vacuous Rhoda like girl, and her 'parents' aren't much either. Lucinda's actually alot of fun-from drifting into Jody's room to scare the crap out of him, to stabbing the womany cop to death with a hay hook. And heck, she even almost managed to kill the annoying Jody, so kudos to the crazed old witch for at least providing some entertainment value in this otherwise extremely slow film. And senseless, let's not forget senseless. There are so many things in this film that simply don't make any sense at all. Just who ARE the 'Stricklands'? Are they related in any way, or did Melissa simply force them to live on her ranch and pretend to be her parents? Why did Satan bother to possess Melissa at all, if he/she never intended to return? Don't you think the Devil would have found something for his servant to do in the last one hundred and twenty years besides try to corral her mad sister? Why don't the townspeople realize that Melissa never ages? How does Jody sleeping with Melissa(maybe to prove his 'love' for her was real?) help her escape from her devilish deal? And what kind of moron does it take to sell himself to the Devil just to get seconds? So they're both in the service of the Devil, and the whole beginning of the plot is negated. Melissa doesn't escape her eternal torment, Satan now has puss boy's soul as well, and nothing has been accomplished. Way to go, idiot. Besides these annoying little niggles, there's also the crappy soundtrack, the lighting that makes it appear as though the sun is going nova in every shot, and the apparent sleepiness of all of the cast members except for the dynamic but crazed Lucinda. The Touch if Satan apparently is supposed to make one fall asleep.",
         "***SPOILER ALERT*** Thank the powers-that-be that there's no more that a touch of Satan in this movie -- it's more than enough. From the incredibly long opening credits all the way to the end, this movie is mostly empty space. Our heroine's head is also mostly empty space, but she's pretty anxious to 'get out on her own' (we all know what THAT means) so our hero -- in a moment which is unusually realistic as far as this film goes -- takes an instant liking to her. They meet after he stumbles onto her family's farm where they introduce themselves to each other -- TWICE! We get to meet her family which consists of her creepily pleasant mother and her sweaty, cider-obsessed father who apparently finds himself VERY amusing as he chuckles a lot. After all the introductions, our heroes (Jody and Melissa, by the way [Jody's the guy]) take walks, meet Melissa's prune-faced Great-grandmother, go shopping, inform the viewers that fish live in water (who knew?), say each other's names a lot and go hang out at Melissa's private cabin. This is where Melissa does her witchcraft. While they're there, Grandma kills a deputy sheriff and gets sent to bed. Then the family locks Jody in the barn. Being the bright young man that he is, he starts suspecting that something is weird about this family. In a flashback, we learn that Melissa saved her sister Lucinda from a particularly mellow bunch of witch-burners about 120 years ago. Selling her soul to Satan was clearly the best way to do this, so now she's not aging, her sister won't die and she's still stuck with this stupid family. So now Lucinda is posing as her Great-grandmother until the deal can be broken. A good start to the deal-breaking comes when Melissa sets fire to Lucinda. After all this, Jody is sworn to secrecy and goes on his merry way. He gets pretty far, but then remembers he still didn't get any from Melissa, so he turns around. They roll around in the grass for awhile, and for some reason the deal is broken by that. Who would've guessed that breaking a pact with Satan could be so much fun? As a result, Melissa's actual age catches up to her. Jody's not too impressed with her new look, so he sells his soul to Satan to age her down again. So now, in an uplifting ending for all ages, these two morons are still tangled up with Satan. Happy trails! This movie is almost unwatchable. The dialogue is bad enough, but the pauses in-between are what really make you want to peel off your own skin. Even if you like so-bad-it's-good movies, only watch this film if you have A lot of patience. If you don't, try this film a-la Mystery Science Theater 3000. I give the film a 2/10 just because they managed to complete the thing. The MST version gets 8/10 -- one of the best episodes I've seen.",
         "I first saw The Touch of Satan at the Dublin (Georgia) Drive-In Theater following the 1980 re-release under the title Night of the Demon. It was then released under the original title on VHS video. I have read that it was directed by none other than Tom Laughlin, Mr. Billy Jack himself, despite the director's name being Don Henderson. I am aware that some people do direct films and write books using a false name but I have not seen where this credit has ever been officially given, implied or acknowledged. I am well aware that this film has been laughed-at, low-rated, panned, condemned, damned, parodied, spoofed and razzed by many. many people, but I still like it. There is just a certain something that makes it enjoyable to me. Michael Berry (Jody) seems to have gone on to a career working on film crews as an on-set medic, among other things. Lovely Emby Mellay (Melissa) seems to have simply just disappeared from the face of the earth after making this one movie. The location filming in Santa Ynez, California is one of the positives the film has. The scenery is lovely. The music was also quite good, too. The film also features some early makeup effects work by the talented Joe Blasco. I miss going to the drive-in and this is one film that transports me back to those days. I just wish that this DVD had been made from a better quality print of the film, if not remastered. It even looks a bit like a DVD that was ripped directly from a VHS video copy. That aspect makes me wonder just why the DVD is priced a bit higher than perhaps it warrants. Maybe it is also the fact that the film is so hard to find in other formats other than on MST3K. But I would much rather watch the film just as it was originally made and intended to be seen and relive the good old days of the drive-in. As for it being a \"bad\" or \"awful\" film, I have seen quite a few huge-budgeted films, featuring big-name casts that I enjoyed a lot less than The Touch of Satan.",
         "We follow Jodie, a guy, but with a name like that he's exactly the kind of wuss you expect him to be, driving way out to the country to eat his ham sandwich. He then stumbles upon Melissa who lives on the walnut farm (yep, you read that right) he stopped at. Besides a psycho grandma, Melissa has another dark secret that Jodie slowly, and I mean SLOWLY, unravels. Without the help of MST3k this movie would be a total pain in the royal behind. The pacing is slower than flowing tar on the North Pole, the dialog is unbelievably campy and dull and the acting is just plain crap. I'm not going to call this a turkey because the whole thing is not even funny bad, it's just bad bad. If you like boring, long-winded, trying-to-be-scary-but-just-stupid movies from the seventies, go ahead and watch this. If you do, I recommend you watch the MST3k version though.",
         "...you'll be praying for Satan to make an appearance. _Anything_ to make this movie at all interesting or attention-grabbing. The Touch of Satan staggers along like William Shatner on quaaludes, with huge reams of dialogue interspersed with breathy pauses as if the actors are phonetically spelling out their cue cards. Even an actor of the caliber of Robert Easton (I), as the leader of a slothful mob, can't inject any excitement into the proceedings. What might have made a decent 30-minute Twilight Zone episode (and actually in plot may have been very similar to a couple) is padded out to unbearable lengths.",
         "Like most who've commented, I saw this film with the help of MST3K, and I have to admit that this is one of the very few films I couldn't watch without it (along with the Coleman Francis trilogy and Manos). There is so much wrong with this film that it's hard to start. The plot (if it can really be called that) is a retread, a boring premise (house with dark secret) that's been done to death in every other horror film ever made. The male lead, Jody (yes, JODY), is an ineffectual dope whose most memorable contribution to the film is yelling \"Zah!\" The \"villain,\" Lucinda, is an ugly troll-like hag who can only spout gibberish when she's not busy hacking useless side characters into giblets. The love interest, Melissa, is a empty-headed ditz whose most enjoyable moment is showing Jody where \"the fish lives\" (and, quite fittingly for this film, is the character with the \"dark secret\"). Combine all this with horribly stilted dialogue (it feels like almost 3/4s of the film is pauses, either between lines or between words) and pacing somewhere between \"cold molasses\" and \"glacier\" (not to mention the fact that the first verse of \"Amazing Grace\" is used about 20 times in the film) and you have a movie that doesn't even manage to be affably mediocre or so-bad-it's-good, much less scary. Avoid this film at all costs, unless MST3K are shielding you from this film's dreadful slowness.",
         "\"Touch Of Satan\" has the feel of a movie destined for the 3rd feature at an drive-in triple feature. You get the feeling that by the time this thing started rolling at 1:00 am, everyone left at the drive-in was either 90% asleep, drunk off their butts, or so involved in heavy petting that it didn't matter what was on the screen. So on that level, TOS worked fine. It filled in 90+ minutes of screen and gave the night-owls some video background to accompany whatever their real priority happened to be at the time. Unfortunately, I had to watch it while wide awake, 100% sober, and undistracted by any opportunity to smooch and make out. And so I have little use (or pity) for this movie....and I have to confess that it was so incredibly dull that I had a lot of trouble making myself pay attention to it. I kept pausing the VCR to get a soda, or go to the bathroom, or make myself a sandwich, or make a phone call, or to start the dishwasher. Then I'd get back, start things up again, and try to pay attention for another 5 minutes...only to decide it was time to start the laundry, or pay a couple of bills, or do some push-ups... But unless a movie is actively offensive or horrifically awful, I always try to watch a movie all the way through and give it every chance to prove itself. So I eventually got to the end of \"TOS\", and my final reaction was....\"Meh.\". I have to admit, there is the germ of a decent, unsettling story in this movie, and there is a plot twist that could actually be considered somewhat clever. The cinematography is OK in a 70's \"Movie Of the Week\" way, and the young romantic leads are decent looking, if not particularly striking. But even though director Tom Laughlin (of \"Billy Jack\" and \"Master Gunfigher\" fame) had previously managed to make some involving (if contrived) movies, here he couldn't pace a dramatic scene to save his life, and he definitely didn't have the know-how or the talent to make these uncharismatic actors carry the movie. Maybe he should have stuck to directing himself and his regular cast of cronies. Or maybe he should have stuck in some hapkido or some gunfighting to pick things up a bit. He definitely didn't have a feel for \"horror\". As a previous reviewer astutely commented, this movie screams for a remake. Unlike good older movies, which are often happy accidents of inspiration, zeitgeist, and talent, the addition of modern 'gee-whiz' MTV jump cuts, CGI, and hot young actors would add a lot of visual interest to the proceedings, and would help frame the mildly interesting plot in a flattering way that held the viewer's attention. However, that probably isn't going to happen. Hollywood is never going to be that desperate for material that this dull-tastic collection of 70's clichés will ever get a shiny new outfit. Even in the MST version, the guys just didn't have anything to work with. That's kind of sad.",
         "This plodding and mostly boring movie features a decrepit old lady who looks like she's made of that skin that forms on the top of gravy when it's been sitting out too long. She kills a farmer with his own pitchfork, then runs home and smashes through a screen door (easily the funniest scene in the whole movie). Later she mutilates a deputy in another great scene, but I'm getting ahead of myself. The old lady belongs to a creepy, incredibly sweaty farm family that lives on a Walnut ranch. Jody, a Maverick-driving future-yuppie on a cross country trip to \"find himself\", ends up at the farm, trying to get some booty from farmer's daughter Melissa. In a lame plot twist it's revealed that Melissa and Killer Grandma are actually sisters, and Melissa can't age due to a deal with SATAN. Jody falls for Melissa and there's an ending that's not really a twist ending, but it's an ending and that's good enough. Although this is a feature length motion picture, there's barely enough substance to fill up a \"Twilight Zone\" episode, so the running time is padded by slow talky scenes and long pauses. There is a bit part by Robert Easton, the star of \"The Giant Spider Invasion\", and tons of ponderous dialogue: Jody yells \"ZA!\" at some people; a brain-damaged gas station attendant fears a \"fromacydal maniac\"; and Melissa says \"This is where the fish lives\". But really, aside from the grandma-through-the-screen-door bit, there are very few things to recommend in this movie, certainly not enough that anyone should consider watching it. The fact that people spent time making it is shocking.",
         "Well, you decide for yourself; there are good and bad points to this film. This prejudice movie was obviously written by a man, because Satan is apparently female. Though the good point of this movie is Satan is never shown, allowing your imagination to work for itself, it may be considered a flaw by some who can see the low budget of Touch of Satan. The plot is very interesting and holds you in, however the acting and dialogue are a bit under done. This movie is actually frightening in a few aspects, though at times it does drag on and begin to grow dull. 5/10",
         "This is completely stupid. I joke to film making everywhere. ::The main problems:: Acting is so terrible, it actually made me cry when I heard the dialogue being spurted out of the actors mouths. Not one of the actors could act and I bet they never got another job afte that. though they were probably too busy doing drugs to complete any other movies. The story is very lame, stupid, and annoying. Choke full of crap that would make even the most amateur film maker want to stop making movies. We get something in the story about witches and Satan, but nothing really pans out at all. It all just falls flat within the first three minutes of this lame movie, but by then you have probably turned the channel already. Which if I was not viewing the MST3K version, I proboby would have done within the first minute of this trash! The mood is overdone completely and really goes into overkill within the last few minutes of the movie. I think they tried to set too much mood and didn't take enough time on the plot, which might of helped this movie. The special effects are lame, and really only consist of bad face make-up which is really very lame. Though it is probably just the time period and might not have been helped. I do not want to recommend this movie to anyone....At anytime....Anywhere. This movie is very lame, and a venture down amateur film making lane! If you take a stop on crap film making street first of course. Do not see this movie unless it is with the help of Mike Nelson, Crow T. Robot, & Tom Servo. You can find it on Mystery Science Theater 3000 Volume 5. You might be sorry if you do not view it with them, as it is a headache inducing movie.",
         "I first saw this movie years ago when Mystery Science Theater (or MST3K) showed it. Since then, thanks to the miracle of something called videotape (and more recently on DVD), I've gone back to the definitive version (with the Bots) numerous times! Putting aside their funny antics, I'll try to rate the movie based on its own merits (or lack thereof.) First, the acting is uneven. The main character, Jodie, is kind of a bland Donald Sutherland. His hair, clothes, and mentality firmly point out that he's from the 70s. He's also pretty naive. Even though there's a lot of foreboding, Jodie is completely unaware of it. The actress who plays Melissa is equally bland, pretty but still bland. Between these two will pass numerous uncomfortable pauses. And when I mean pauses, I mean P... A... U... S... E... S... This is another one of those movies where you get the feeling the filmmakers didn't have enough material to make it a feature-length, so they compensated by putting long, slow pauses. Now mind you, pauses work when done right. Anton Chekov made a ton of plays using the pause to enhance meaning. The problem is when there's too much of a pause, it loses meaning. Not to mention, considering Jodie and Melissa are supposed to be budding lovers, it seems odd that they still share so many uncomfortably long pauses. The acting gets slightly better with the supporting cast. My personal favorite is the actress playing the witch/sister/great grandmother (depending on who's telling the story) Lucinda. When she flips out, it's convincing and startling. Good make-up too! In fact, that is the best feature about the film: killer witch/ sister/ great grandmother! Getting back to the love story, it's just as uneven as the rest of this film. Having just met Melissa, Jodie automatically agrees to stay for a few days with her creepy family. He's completely oblivious to their \"less-than-welcoming\" mood. As the movie goes on, we learn that Melissa is thought of as a witch in town. What follows is some of the blandest events to unfold. You get the feeling that there is a demonic force going on, but the pace needs to be ramped up! The ending is eerie, though it still seems out-of-place considering that the relationship between Jodie and Melissa doesn't appear to be that serious. Throughout the film, it's obvious there is no real chemistry between the two actors and it makes their relationship seem forced. Oh, did I mention the laughable dialogue? My favorite is when Melissa stops by a pond and says \"This is where the fish lives.\" Huh, the fish? Just the fish? Just one fish? What does that have to do with anything?! And why, oh why, did they have \"Amazing Grace\" play at least three times in this movie? Public domain? The overall problem is that there is a decent and scary little witch movie buried within. Unfortunately, it's so buried underneath ho-hum acting, poorly paced scenes, and those god-awful pauses that it isn't scary. Could you imagine if they remade this nowadays? Here's one movie I wouldn't mind seeing the studios remake!",
         "I kind of like this movie. Emby Mellay has a lovely alluring and sensual presence about her as a man she never knows approaches her and charms her, but the plot has a ridiculous nonsense in it that really keeps it from being a much better movie. It seems that she is a witch who has a pact with the Devil to keep her young and beautiful. it could have stayed there but there are dumb murders and an actress (or actor) in an awful old lady outfit. Just when you accept the movie with its foreshadowing and halfway charming atmosphere, the guy does the dumbest thing in the world. Sort of like \"Psycho\" or \"The Undead\" in reverse, the closing scene kills the whole movie.",
         "Another film I had the pleasure of watching through the eyes of Mystery Science Theater 3000. This film struggles between 3 different genres (road movie, love story, and supernatural thriller to be specific), and fails at all of them. The acting overall is pretty bland, and the story seems to be made up as it goes along. Here's the plot in a nutshell. A guy (Jody) is on a road trip. Stops at a pond to eat lunch, sees a girl (Melissa), both of them end up falling in love, oh and it turns out that she's possessed by Satan and is 127 years old. He decides to leave, but then comes back and decides that he doesn't care if she is possessed by Satan. They screw, she almost dies, he turns to Satan to save her. The end. What little horror and/or tension exists in this movie, is reduced simply to jump scares and underacting. The scenes with the burned grandmother/sister were predictable. Even during the witch burning flashback, the \"big Satan curses you speech\" was pretty underwhelming for what it was meant to be. But with all of it's faults, it's still not incredibly bad. It's bad, don't get me wrong. I wouldn't have bothered to watch this film had it not been for Mike Nelson, Tom Servo, and Crow T. Robot. But even without the riffing, the movie still held my attention somewhat. I'll admit the score was pretty interesting, and the overall plot was OK, but it could've used some really heavy tweaking. I would actually recommend watching this over some other world-renowned bad films like \"The Room\" or \"Battlefield Earth\". While those movies are both outlandish spectacles of poor acting, poor writing, and poor direction, this film really only suffers from severe mediocrity. Although it's still not worthy of a watch on it's own without MST3K. But then again, I don't think that this is available anywhere else besides MST3K. Also, a little side note about the last scene, I wonder if the writer(s) of the film \"High Spirits\" starring Steve Guttenburg and Daryl Hannah ever actually saw this film. Not that \"High Spirits\" had anything to do with Satan, more like the supernatural in general, but there is a sex scene between Guttenburg and Hannah that ends with Hannah's character rapidly aging to match her \"actual age\", very similar to what happens to Melissa at the end of \"Touch of Satan\". Seriously check this out on MST3K, then check out \"High Spirits\". You might be surprised by the similarities.",
         "Currently over 58% of this films votes are \"1\", probably because it appeared on Mystery Science Theater 3000. While it was great material for the show, this movie isn't completely without merit. The core idea of the movie was interesting (although amateurishly handled), and Micheal Berry gives a decent performance as the protagonist (or maybe the worse actors in the film just made him seem better). Some of the scoring and directing here is effective, as well. Overall, this film is a 4/10. But if you see it, see it on MST3K. Not only did it make for one of the best episodes (proof that the worst movies don't make the best episodes), but it makes some of the duller parts of the film seem lively.",
         "A young man (Michael Berry) on a cross-country trip to California stops one day to have a little lunch and meets a beautiful but highly suspicious farm girl (Emby Mellay) in \"The Touch of Satan\", one of the very worst movies ever put on celluloid. Naturally Mellay is not what she seems, she is really a 120-year-old witch who sold her soul to save her sister as she was being burned at the stake by an angry mob that believed she herself was a witch. Mellay makes a deal with Satan to save her sister, but pays her soul in return. Rumors around the spooky town come up and the suspense builds for Berry, but in the end will he try to destroy the curse or will he lose his soul as his love (or lust really) grows for Mellay? Whacked situations, a squeaky soundtrack, sophomoric performances, bargain-basement visual effects and a crummy script make this production one you should avoid unless you like those movies with camp value. I don't. Turkey (0 stars out of 5)."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Stupendous Talking Pictures International"],
      "summaries": [
         "On his way to California, Jodie decides on a whim to make a brief side trip to a farm, where he meets and falls in love with Melissa, the proverbial farmer's daughter. Or so it seems. In between the overlong dramatic pauses, we learn that Melissa is in fact a 120-year-old witch, and her remarkably spry \"great-grandmother,\" Lucinda, is actually her sister, who has been pitchforking people to death in her spare time. When Lucinda murders a local policeman, things start to get real complicated for Jodie.",
         "A young man meets a farm girl who is actually a witch."
      ],
      "budget": 0
   },
   "movielensId": 173109,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-08-23",
      "dvdReleaseDate": null,
      "directors": ["Don Henderson"],
      "runtime": 90,
      "movieId": 173109,
      "title": "The Touch of Satan",
      "mpaa": "PG",
      "actors": [
         "Michael Berry",
         "Emby Mellay",
         "Lee Amber",
         "Yvonne Winslow",
         "Jeanne Gerson",
         "Robert Easton",
         "Lew Horn",
         "Sharon Crabtree"
      ],
      "imdbMovieId": "0066476",
      "originalTitle": "The Touch of Satan",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["qU-q3Gqg50U"],
      "plotSummary": "On his way to California, Jodie decides on a whim to make a brief side trip to a farm, where he meets and falls in love with Melissa, the proverbial farmer's daughter. Or so it seems. In between the overlong dramatic pauses, we learn that Melissa is in fact a 120-year-old witch, and her remarkably spry \"great-grandmother,\" Lucinda, is actually her sister, who has been pitchforking people to death in her spare time. When Lucinda murders a local policeman, things start to get real complicated for Jodie.",
      "tmdbMovieId": 31382,
      "avgRating": 2.75,
      "releaseYear": "1971",
      "numRatings": 2,
      "posterPath": "/35gOnMykpCE5OauvbLmDRtGv9V2.jpg"
   }
}