{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "alien invasion",
         "id": 14909
      }],
      "imdb_id": "tt0055562",
      "video": false,
      "title": "Invasion of the Neptune Men",
      "recommendations": [
         31260,
         31387,
         112937,
         28445,
         31253,
         31134,
         31241,
         31133,
         44310,
         31127,
         31258,
         31118,
         3030,
         25061,
         31385,
         363185,
         31131,
         31284,
         30936,
         376884
      ],
      "backdrop_path": "/ukfWY5DZfK4YVvsLYbKn10id9m.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Tachibana - Scientist / Space Chief",
               "gender": 2,
               "credit_id": "52fe446d9251416c91010441",
               "name": "Sonny Chiba",
               "profile_path": "/ntFUKxaPHR5E7OWuyp0mdEZPfdk.jpg",
               "id": 2537,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Tanigawa Hiroshi",
               "gender": 0,
               "credit_id": "52fe446d9251416c91010445",
               "name": "Kappei Matsumoto",
               "profile_path": null,
               "id": 552641,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Tanigawa Yoko",
               "gender": 0,
               "credit_id": "52fe446d9251416c91010449",
               "name": "Ryuko Mizukami",
               "profile_path": null,
               "id": 1088656,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Garrison Chief Mikami",
               "gender": 0,
               "credit_id": "52fe446d9251416c9101044d",
               "name": "Koji Sahara",
               "profile_path": null,
               "id": 1088657,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe446d9251416c91010431",
               "name": "Koji Ota",
               "profile_path": null,
               "id": 1030630,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe446d9251416c91010437",
               "name": "Shin Morita",
               "profile_path": null,
               "id": 1023832,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe446d9251416c9101043d",
               "name": "Akihiro Watanabe",
               "profile_path": null,
               "id": 1088655,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [],
      "popularity": 0.869363,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 31254,
      "vote_count": 9,
      "budget": 0,
      "overview": "Clumsy invaders from Neptune are thwarted by hero Space Chief and a nondescript group of microshort-wearing Japanese kids.",
      "similar": [
         11549,
         11850,
         4858,
         2675,
         47933,
         137113,
         44912,
         49529,
         228161,
         299687,
         9982,
         7453,
         4722,
         9276,
         15512,
         34851,
         19995,
         8836,
         8337,
         395
      ],
      "original_title": "Uchu Kaisoku-sen",
      "runtime": 74,
      "poster_path": "/tvdcnLqXRA18Fk4e4rDHPTZNuog.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "1961-01-01",
      "vote_average": 2.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Kôji Ohta"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Shin Morita",
         "Akihiro Watanabe"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0055562/",
      "coverLink": null,
      "actors": [
         "Shin'ichi Chiba",
         "Ryûko Minakami",
         "Mitsue Komiya"
      ],
      "reviews": [
         "Aliens in bullet-head helmets, young boys running around in short shorts, army soldiers made up like Ru-Paul, Sonny Chiba (!) at his most un-heroic and Thomas the Tank Engine as the alien spaceship - is this any way to make a sci-fi movie? It is if you've made this one. \"Uchu Kaisoku-sen\" (or \"Invasion of the Neptune Men\", as I know it) is a movie I have mixed feelings about. On one hand, it has a plot that feels like they left a few pages out of the script and replaced it with LOTS of stock footage. On the other hand, this is also a movie that will leave you rolling in the aisles (or your living room floor), gasping for breath at the stupid (dubbed) dialogue, fakey \"special\" FX, small disc ships that look like evil crab cakes and large groups of Japanese people running around all over the place - with no Godzilla in sight. And that Space Chef - excuse me, Space CHIEF - what kind of a mook traipses around in white leotards, cape and a helmet with a corrective sun visor, trying to subdue the bad guys with karate kicks and chops that my two year-old daughter could out-maneuver with ease? To think that this was Sonny Chiba in that spandex is a head-scratcher; we all gotta start somewhere, I suppose. You can watch this either way: alone or with Mike and the robots. Doesn't matter 'cause you'll get entertainment value either way. Derisive laughter is derisive laughter, no matter how you take it. Though I still cackle when I think of how the MST3K crew reacted when they blew up the Hitler building (\"WHAT?!!\") or Servo's song dedicated to the stock footage (\"da da da-da da da...EAT IT, MOVIE!!!). Anyway, you watch a movie like this on a Saturday afternoon - after the cartoons and before the pro-bowler's tour. Perfect way to waste a couple of hours: laughing hysterically. Seven stars (yeah, that's right - SEVEN) for \"Uchu Kaisoku-sen\". Ten stars, as always, for the MST3K version. And, as always, \"NE C'EST PAS\"!",
         "Remember \"Prince of Space\"? MST3K # 816? Okay. This is basically a remake of that. Instead of Prince of Space, though, we get Space Chief, another effeminent, hopping hero. Instead of the chicken-men of Krankor, we get mute, bullet-headed robots who have trouble walking and fall down at the tiniest hint of danger. And instead of two annoying, gravely voiced, tiny-shorts-wearing kids we get SIX annoying, gravely voiced, tiny-shorts-wearing kids. Slow the whole thing down, add lots of scenes of Japanese people talking in poorly lit rooms, and actual war footage instead of special effects, and you've got one of the worse movies ever made. I know that phrase is over-used and has little or no impact anymore, but this movie really is almost unbearable. It's amazing! It's joyless, depressing, AND technically inept! Enjoy the Hitler building.",
         "Ah, japanese cinema. And we are treated to an early performance by Sonny Chiba! Too bad the helmet obstructs the view. I believe this dubbed version I saw definitely turns on the goofy meter with terrible high squealed voices reminiscent of an Alvin and the Chipmunks outtakes session followed by high pitched ear piercingly crass sound effects and lots of weird stuff like music playing backwards, creepy demonic alien warnings, and the hokiest kung fu battle EVER. Still, this is a strange strange movie and although you want to resist slamming the screen with sledge hammer, you wonder what can occur next or the highly effectiveness of an electro barrier. If you hate flicks where smug kids are always right and run around fields with impunity, you will not enjoy this Invasion. Watch Tokyo get bombarded and a rather dubious building front from a past era (I won't even spoil it since you get more of a kick seeing it by surprise). This MST one brings pain and you actually can share the misery that the guys on the Satellite of Love endured...and they usually watched this four or five times!! Goofy, fun, chalk board scratchingly bad, and a gamut of emotions are associated with this one. Still, way better than Mars Attacks.",
         "Under the Webster's dictionary definition of \"train wreck\", there is a picture of \"Iron Sharp/Space Chief\". And the third definition says, \"3. An event which exerts upon the observer the appalling, morbid fascination of a movie such as \"Invasion Of The Neptune Men.\"\" Well, not really. But this film is endlessly fascinating in its gormlessness. It's basically the same film as \"Prince Of Space\" - there's a willowy bachelor in a leotard, cape,and spastic head gear, who has fabulous secret technology and a humble secret civilian identity, and he saves Earth from invaders while irritating, screechy voiced children cheer his every move. The only real difference is that \"Neptune Men\" is even duller, cheaper, and less coherent, has six screeching children instead of two, and the aliens have even less charisma than the Chicken Men of Kran-kor. Oh, and Space Chief flies a rocket powered Chevy with fins instead of a Norelco Nose Hair Trimmer. And he never actually goes into space. It also resembles 'Prince Of Space\" in that someone obviously took several episodes of a goofy Japanese children's show,slammed them together and tried to pass the resulting structural mess as a 'movie' called \"Invasion Of The Neptune Men.\" Which brings up the question, \"Exactly how many children's' TV shows about wispy bachelors in leotards and capes who singlehandedly defeat alien invasions did Japan MAKE in those days?\" Are there even more abominations like that out there in obscurity, waiting to confound our gaijin sensibilities with their Nippon-osity?? One shudders to think of the horrors that await! Indeed, \"Fugitive Alien\" may only be an omen of things to come. Oh wait, there is one other obvious difference in IOTNM: a plot device called the \"electron barrier\", a city sized force field that protects the Japanese cities from airborne attack. And the Japanese manage to also whip up some advanced surface-to-air missile systems. (Stuff that Japan wouldn't have been allowed to have under the terms of their surrender in WW II).And Space Chief spends the last 20 minutes of the movie shooting down Neptune ships in an endless dogfight. The parallels to the events of the air war over Japan in WW II are as plain on the noses that aren't on the Neptune Men's faces: Someone wanted to indulge themselves with a fantasy where the air war over Japan had a different outcome. Anyway, this is really horrible. Made even more sloppily and carelessly than \"Prince Of Space\", it features several plot cul-de-sacs that desperately needed to be edited out of the final product, stock footage by the metric ton, and endless scenes of children in short pants running their lungs out to bombastic Russian Cossack music. They also shriek bizarre imprecations that defy any explanation other than, \"Well, it must be a Japanese thing\". Or maybe \"Japanese Tourettes' Syndrome.\" Also of 'interest': 90 percent of the budget for the show was apparently expended to create 10-15 seconds of special effects for the climactic air battle scene, and the movie loops this footage more times than I could easily count to pad out the film. I mean, I ran out of fingers trying to tally the number of times Space Chief shot down the same three ships! On its own merits, the movie deserves a 'zero', but for sheer 'golden turkey' entertainment value and tracking the miscues, gaffes, misjudgments and unintentionally hilarious speeches...AND as an excuse to make fun of Japan, I bump it up to two stars.",
         "I had the rare privilege of seeing this movie in three of its incarnations: the first being on MST3k, the second being a dubbed US version on tape, and the third being a very rare uncut laserdisk version of the film in the original Japanese. And after seeing this film in all three of its mediums, I must say that it still sucks no matter how you look at it. Everything in this film is just....wrong. The acting, the directing, the kids in little shorts, and of course let us not forget the stock footage featuring the famous \"Hitler Building\". But if you thought that the US dubbed version was bad (which is what most people have probably seen), well then you'll probably go blind watching the original uncut Japanese version. At least whichever American company that bought the rights from TOEI to feature this film in America had the good sense to cut out the little sing-a-long Mr. Tabana and his children do at the end of the film, praising the bravery of Iron Sharp (a.k.a. Space Chief, or Chef, or whatever) in bad harmony. Too bad they didnt show that on MST3K. All in all, the movie does have a good point, that being its so bad, its almost funny. Other than that, if your looking for a more serious Japanese Sci-Fi film, then Prince of Space might be a better choice.",
         "Where to begin? The soap-bubble thin plot? The lame \"hero\"? The annoying little kids? The repetitive and strafing footage filled battles? I honestly don't know. This film fails on so many levels, you can't really pinpoint what makes it the horror that it is. I don't think Mike and the Bots were even able to cover half the bad points that occured in the movie. The plot in the movie seems to continuosly go around in circles, with the evil bulletheaded aliens appearing, the scientists trying to look worried, the children in hot pants running, and Space Chief coming to the rescue. Sometimes we can't be sure exactly what is going on; all we know is that it's bad. So it comes to the final \"climactic\" battle, blah blah, the bad guys are defeated after a lengthy missile sequence, yadda yadda, and you're just glad it's over.",
         "Wow! This movie (I use the term loosely) really, really sucked. Thankfully I saw it with Mike and the 'bots...and they could barely make it through this abortion. I could barely make it through. Waaaaaay too much stock footage, waaaaay to many annoying kids. What made \"Prince of Space\" at least mildly amusing was the phantom of Krankor. At least he had a personality. The neptune suppositories down even talk.",
         "Sure, I thought \"Prince of Space\" was a TERRIBLE film, but after seeing \"Invasion of the Neptune Men\", well, that changed. This movie's even WORSE than \"Prince of Space\" to me. Why you ask? Well let's see... First off, all of those annoying kids running around in a group wearing shorts. I just wanted to go berserk after a while of listening to those annoying, dubbed voices. Second of all, Krankor doesn't appear in this movie. He was the only good point of \"Prince of Space\", and not having him in this film only made it worse (who didn't like that evil laugh that Krankor did). Third of all, The stock footage. They used the same stock footage scenes so much in this movie. It was just aggrivating after awhile. and fourth of all... no Prince of Space! Sure, he was a lame hero in the self titled previous film, but this new hero sucked. The movie overall is god awful. Mike and the bots did a great job bashing this piece of cheese from Japan. I suggest to anyone who wants to see this to check it out on MST3K. The only non-painful way to endure this.",
         "The superficial similarity is there: invaders come to conquer earth and alien-in-human-guise fights them off, earning the admiration of unpleasant children. Beyond that two movies are not very much alike. I can't be sure but I'm partly convinced that PRINCE OF SPACE was meant as a comedy. There's not a single person in the movie with even a shred of competence or dignity with the possible exception of the Prince himself, and even he makes some really dumb decisions. The aliens are devoid of menace, the scientists are helpless babies, and the children are selfish little snots good only at getting in the Prince's way. All these things stand in contrast to INVASION OF THE NEPTUNE MEN. The aliens are not goofy and, in the scene where they disguise themselves as human soldiers, they are even a bit menacing. The scientists put up strong resistance against the aliens even if, in the end, they need Space Chief to bail them out. The Chief isn't a swaggering buffoon--no \"hahahaha your weapons are useless\" nonsense from him--and his child fans get hardly any scenes. It's almost like PRINCE OF SPACE is a parody of the story that INVASION OF THE NEPTUNE MEN plays straight. NEPTUNE MEN feels like it's trying to be a serious sci-fi movie...which is maybe why it's such a crashing bore compared to PRINCE OF SPACE.",
         "I can't talk long, I've picked up a case of Roji Pantie Complex after watching this horrible abortion of a film and I'm very weak. Mike is administering panties to me, but my body can only absorb so many at a time. In this alleged movie, a group of boring alien invaders decide to cause random acts of violence on Earth in an attempt to take over the planet, but their schemes are constantly thwarted by Space Chief, strange visitor from another galaxy whose flying car shoots laser beams. A group of small Japanese children are also on hand at every major incident, and who seemingly are the nation's greatest natural resource as they have the power to discover valuable information and run really fast all over the place without ever getting tired. Yes sir, the scientists and military are helpless against an alien race that flies around in giant Pringles can with wings, but the day it ultimately saved thanks to a dork in a flying car and six of the most annoying children you'll ever meet. God bless Japan for making this movie. Once again, a horrible film is almost saved from being completely unwatchable thanks to the wonderful running commentary of Mike and the 'bots from \"Mystery Science Theater 3000.\" But I do stress almost -- there are times when ever the mighty ones on the Satellite of Love can't withstand the boredom and non-action of \"Uchu Kaisoku-sen\" (aka \"Invasion of the Neptune Men\"), and you do have to despise a film that has the nerve to introduce an intergalactic \"hero\" like Space Chief but then have him suspiciously absent through most of the film. The stock footage explosions are the most insulting, of course. Someone should feel very ashamed for including the \"Hitler Building\" in the explosion stock footage. Very dishonorable, Mr. Editor. Hang your head in shame. 2 out 10 stars. Japan should be tried for war crimes for producing this motion picture. P.S. Come back, \"Prince of Space!\" All is forgiven!",
         "The best way to see this movie is on Mystery Science Theater 3000. If you have ever watched MST 3000, you know that the MST crew take some of the worst movies ever made and make them fun. Along with the movie you get a running commentary of smart remarks, and references, that you would make if you had to see the movie and you couldn't get your money back! If you have not seen MST 3000, I think it is still on the Sci Fi channel. If not watch Mystery Science Theater 3000 The Movie. If bad movies are one of your guilty pleasures you will enjoy the movie MST style.",
         "**spoilers** That statement pretty much explains the sum of the plot. Unlike \"Prince of Space\", which if nothing else is enjoyable on a camp level, \"Invasion of the Neptune Men\" is painfully awful. The film involves FIVE annoying Japanese children in short-shorts with EVEN WORSE ACCENTS than the kids in \"Gamera\" and \"Prince of Space\" combined. If that's not painful enough, the \"Suppository Men\", aka the Big Lugs From Neptune (\"Could you help me get this thing off my head?\") surround the annoying kids and begin to strangle them. I thought - okay, not a very long movie, and not very charismatic heroes, but still, it's over before it got too painful. Well . . . no. Space Chief (played by Sonny Chiba!) (imagine Prince of Space with a buzzsaw on top of his head) stands-off the Neptune Men, and jumps around trying to hit them but failing. He must have a pretty strong chop, though, because the shock waves generating from his feeble kicks cause the Neptune Men to fall down without even being touched. Unfortunately, after a strategic retreat by the Neptune Men, Space Chief, lame though he was, disappears conviently for the next forty-five minutes. All of the other points have been pretty well covered by other reviewers. The MST3K was good but not great, though they got off some good lines. And BTW, WHY do they show the same freakin' stock footage over and over again??? The Hitler Building was amusing, but seeing a building explode FIVE TIMES (I counted) (plus the looped battle sequence at the end) is horrible. Avoid, avoid, avoid, and watch \"Prince of Space\" again with \"A Case of Spring Fever\" for an ENJOYABLE camp experience. Three stars for \"Invasion of the Neptune Men\" (enough laughs to keep me from giving it a one); eight for the MST3K version. \"Space Chief failed miserably/and tried to cover up his shame!\"",
         "All right, what the #$^# could ANYBODY be thinking that made this movie. It's actually worse than \"Prince of Space.\" The dubbing on the kids is far more annoying than Krankor's laugh. Oh yeah, the reason I'm comparing these two is because they're the SAME movie! This movie isn't all bad, though. It does have some nice cameos, such as the one made by the Fürher himself, Adolf Hitler. Plus it introduces us to stop-short-from-ten-feet-away fighting. Well, I'm going to seek revenge on the idiots who made this movie. See you later.",
         "The Invasion of the Neptune Men wasn't just an action movie, but a deep, and surreal tale of love, redemption, war, peace and the nature of our place in the universe. Beautiful in its own way, comparable to Shakspere and Milton in it's storyline. Evil is destroyed, and hope remains in the hands of the one true savior, Space Chief. Check out the cameo of Hitler.",
         "Gather round the campfire, children, and listen to the story of the great Space Chief!! Who sucked. He rode around in a bumpy car that, when lit on fire, sent him into space. But enough about me, let's talk about the children!! They were the real heroes here and the next time some crazy dj-aliens with records stuck to their heads come through the electro-barrier, I'm hoping those kids'll be around to get into level 5 security areas and figure that baby out all on their own. Cause goshdarnit, they've done it before.",
         "This is one seriously silly Japanese space movie. It is Undoubtedly awful when judged as one would normally judge a movie, but it's so ridiculous it's actually kind of enjoyable. Here are a few of the exceedingly silly events that happen in the movie: -Some Japanese kids, poorly dubbed into speaking English discover a space ship and some cone head Neptune men who try to kill them. Space Chief, a guy wearing tights and a stupid helmet lands his rocket powered golf cart, and starts jumping around in a silly fashion, cone head guys fall over, and run away. -People start noticing strange things and alert the scientists, the scientists talk science jargon about science, then do some science...SCIENCE! Politicians however do politics, feel skeptical about scientist warnings. -Jump cut to cone heads watching TV broadcast about alien invasion, apparently jump cut covers transition from general skepticism to belief. Suddenly the cone heads attack in their space ship, conveniently, the scientists have put together an \"electro barrier\" to stop them. -The cone heads attack, shoot flaming farts, the electro barrier deflects flaming fart rays, hilarious action sequence ensues, with cone heads falling over due to electro barrier. Defeated by this ridiculous barrier thing, the cone heads wimp out and go away.* -The ever present bunch of little kids from the start of the movie run around chattering incessantly, they stumble on a space probe thingie that contains a threatening message from the aliens. -The aliens attack and there is a scene of lots of silly looking running around in panic as people try to escape, however, the Aliens infiltrate japan, disguised as soldiers and almost manage to kill the bunch of annoying little kids. -Suddenly Space Chief is back in the movie, he shoots a couple of the cone heads, chases after two other into a building then promptly explodes(?). This causes lots of general running about in a big panic. At this point the movie suddenly changes tone and becomes somewhat serious. The government make an announcement that the word is under attack, and that people need to take shelter, which of course causes some proper panic. This is followed by a slightly less silly scene of the cone heads attacking earth with proper explosions and everything. Then Space Chief is back, this time actually doing some space battle (or rather lower atmosphere battle) flying around in his rocket golf cart thing, shooting the alien ships. After this sequence has gone on for a while the big moment comes, the moment when your jaw just drops and you can't help but utter a big WHAT! There is billboard of Hitler doing a seig heil. Unmotivated Hitler, just like that. The movie then goes on like nothing happened, recycling the same scenes of the battle between the cone heads and Space Chief, until it suddenly stops. Cue the scientists preparing \"Alpha Electron Rockets\", there is a tense moment as they count down, then Kablamo, no more cone heads, the end. *Somewhere around this point in the movie, there is a lot of talk about something called a Roji Panty Complex, I have no idea what that is or why it is mentioned.",
         "From the electro-barrier to the shot of a building with Hitler getting blown up, I think the Japanese are trying to give somesort of message to the rest of us OR it was just scraped together for the kids. There long periods of time where litterly nothing is going on(It equals 2001 in that respect). When you view it you settle into a haze and your eyes don't focus on anything and you might drool, it's that kind of movie.",
         "A lot of people slammed this movie and call it one of the worst. First of all, if you are pre-disposed not to like Japanese sci-fi films because of the sometimes obvious model work, then this film won't change your mind. I was curious about it after reading about it for many years in books and magazines. I finally saw it released on DVD from Dark Sky and I found it to be one of the most enjoyable Japanese sci-fi films I have ever seen. I say this on the basis of the special effects which I found to be excellent for the period in which this film was made. The sets are impressive. The matte and model work is as good as anything being done by an American studio in that era. The movie moves at a quick pace and I watched it two or three times in a row. Kind of like a smaller scale version of BATTLE IN OUTER SPACE. I have paid a lot more money to see films that entertained me a lot less than this one did. I'd choose this over STAR WARS: REVENGE OF THE SITH because INVASION OF THE NEPTUNE MEN is more fun to watch.",
         "What is with those disgusting little shorts that all those irritating children in Japanese films wear? Maybe it makes it easier for them to run, which you should do when this film is shown. It's another one of those \"take over the earth (or Japan)\" movies with the invaders under the false assumption that they can conquer an entire planet with 7 or 8 ineffective robots (or whatever they were) led by a person with a CD through his head. They never seem to have a plan except to make a lot of threats that they can't carry out. And they are so easily foiled that it makes \"Plan 9\" look militarily intricate. This movie puts \"Prince of Space\" on the Academy Award list of nominees. This is the worst, the pits, the nadir of all film making, even for Japan. The story?.....well, it's a take-over which comes to an end by the intervention of....ta da...Space Chief!!! What the hell kind of name is that? He never even goes out in space and he 'aint the chief of anything. He resembles the Prince of Space from the film \"Usei Oji\", in that his weapon is a grill lighter, he jumps around with a white hanky around his face, pilots a turkey baster and is a \"wispy bachelor\". The funniest thing in the film (and there are a lot of pretty funny scenes) is the Hitler building....that's what you get when you use stock footage that is WWII vintage. The kids with the little shorts have voices that belong on The Sopranos and they run, constantly run, run, run....and pretty soon they have all the adults running too. They also seem to have top secret clearance. What irritating little brats they are......why is one of them always named Kenny? The Japanese need to re-assess their film industry; at least their sci-fi and horror genres. It doesn't get any worse than this. If you want to talk about it further, I'll meet you at the Hitler building for a cup of saki.",
         "This has got to be worst film ever made next to another MST3K favorite, \"Hobgoblins\". The so-called \"plotline\" is about a non-threatening, Spandex-wearing \"hero\" named Space Chief(who never actually goes into space). The \"hero\" is trying to save the Earth(Japan)from a bunch of equally non-threatening space aliens who wear oversized bullets on their heads. Space Chief's admirers are a group of hotpants-wearing kids who seem to like to run everywhere. The fight scenes are badly choreographed and the kids voices are horribly dubbed. The movie uses actual footage from the second world war to show the destruction that the aliens supposedly caused. The other half of the movie is just stock footage. If it were possible, I would give this movie a 0.0000000000000000000000000000000000000000000000001 out of 10. I give it a perfect 10 for the MST3K version. P.S. And what the heck was with the Hitler building?!",
         "A lot happens in just over an hour! A group of kids investigate a mysterious 'satellite', discover a spaceship, are threatened by pointy metallic aliens but are rescued by a caped hero in a flying car (whom they christen \"Space Chief\"). Shortly thereafter strange radio waves are detected emanating from Earth that disrupt power transmission and nuclear reactors begin exploding. Scientists develop electrobarrier (a \"dome of electrons\") to protect our cities, but after a failed missile attack, and despite Star Chief's best efforts, the aliens infiltrate and blow up the barrier's power station. The invaders continue to press the attack by manipulating the weather, but again are thwarted by the resurrected electrobarrier. The alien mothership (which is trapped within the barrier) then launches a number of saucers that destroy industrial sites and buildings (including The National Diet Building) before being shot down by Space Chief in his flying car. In the meantime, Earth has developed new \"electron-minus alpha missiles\" with the capability of destroying the Neptunians, but will they be enough to save us?!? Panned by critics and lampooned by MST3K, \"Invasion of the Neptune Men\" is an inane but (IMO) entertaining way to pass an hour. I watched an English dubbed version in which the kids talked like the 'Bowery Boys' and included over-the-top music that sounded like something from a 1930's western. The special effects ranged from quite good for era and budget (the saucers were imaginative and the scenes of them attacking Earth were excellent*) to ridiculous (Star Chief's flying car looked like something from a soap-box derby). I liked the alien mother-ship (especially the 'spacy' sound effects) and was willing to suspend my disbelief when the pointy robotic invaders were on screen. Decades ago, I watched a game show (\"Eye Bet\", 1971) in which contestants watched film clips and were then questioned about what they had seen. I never forgot the clip of an acrobatic hero in tights and a cape kicking robot butt, so was pleasantly surprised the first time I watched Star Chief take on the Neptunians. Prime stuff if you are a retro-tokusatsu fan, or just looking for some goofy entertainment, or just too wasted to change the channel. *Some of these scenes may have been 'borrowed ' from previous productions.",
         "This 'film' I believe was a serial...basically, this movie is a collection of episodes and not an actual movie. The reason I believe this is that I actually saw this thing listed on television to watch, but it was only in a thirty minute slot and there was another one slotted to begin after it. However, I do not think you are missing anything in this one like the Sandy Frank collections which are entire series. My guess is that this is like four episodes, possibly of a Space Chief series and this set was the start of said show. That being said, it is completely horrible! Probably the worst film that Mystery Science Theater did as far as Japanese films are concerned. Sure, there were a couple that could give this one a run for its money, but in the end I do think this one has the fewest redeeming qualities of the ones they did. The two Alien Fugitive movies while not great had some decent effects and some entertaining aspects. Mighty Jack and Time of Apes also had their moments. There were a couple of the Gamera films that I actually classify as pretty good. Even Prince of Space which was another of the films featuring a dude who runs around attacking his very ineffective enemies was better than this one! The story has a group of boys who like running all over the place in a frenzy. They spot something strange landing and go to investigate and discover a spaceship that contains a race of slow moving aliens who promptly begin to try and strangle the boys! Well, a flying car comes out of nowhere and within it is Space Chief and he easily beats back the spacemen. Do not get to used to seeing Space Chief as he disappears for a rather good portion of the film as scientist must erect an electric barrier to foil the aliens plans. The aliens try to counter by freezing everyone, but that portion of the film seems rather pointless in retrospect. Then Space Chief flies around trying to blast the enemies out of the sky, but he doesn't really win before leaving and then they launch missiles against the Neptune Men...not a very memorable film. This was a rather good episode of MST3K, but I did not really care for them acting like this film was such a back breaker. Granted, how many jokes can you make about a car flying through the air blasting ships in the same loop again and again? I did like the bump where Tom Servo gets ill with Rogi Panty complex and yes that is a thing mentioned in the film. I also liked the jokes aimed at the kids who were pretty much there all the time throughout the film running here and there and everywhere! So this film is probably not the worst film that they have ever riffed on MST3K, but I do think it is the worst Japanese film they had ever riffed. The ones Joel did were not all bad, with a couple of them being films I actually enjoyed. The film may have been simply a collection though as you can sort of see fades in areas like when the kids wave goodbye to Space Chief when he saves them from being choked to death by the Neptune Men. The aliens just have no character and never seem all that threatening. They move slowly and even when they are in the guise of soldiers any threat they may pose is undercut by the fact they are wearing makeup! So yeah, this film is rather bad, but those kids are good at running!",
         "Da da da da da eat it movie! This movie is quite possibly the worst in the world. Where to begin? You could start with the virtually non-existent special effects. Or the total lack of acting. Or the stupid-dumb plot. Or the total lack of any emotion whatsoever. this movie's only remotely redeeming quality is that it has been made fun of by Mystery Science Theater 3000...But even they were hard pressed to make jokes about this total piece of garbage. If you could give it zero stars... I would. if Sharknado, Piranhaconda, and the Justin Bieber biography movie got together and created their own unique blend of demon, perhaps this film would be the result.",
         "I saw 'Invasion of the Neptune Men' on MST3K and I'm happy to report that it livened what would otherwise be a pretty potable cure for insomnia. The movie seems to fit very well with the title of 'Bad 50s Sci-Fi B picture' by having cheap costumes, bad actors and a set design made out of the box that the fridge came in. The story is not that much of a stretch but the journey getting there is too laughable. A group of annoying little boys, who apparently didn't make the cut for 'The Little Rascals', are out playing when they discover a spaceship in a field. Out of the ship pour 7 or 8 bullet-headed Neptune-ites bent on world destruction (they never stop here just for directions do they?) The movie is Japanese so the boys' dialogue has been dubbed, not by children but by grown men trying to sound like little boys!! Anyway, After accosting the boys the day is saved thanks to a guy driving a fiberglass looking vehicle and sporting a mask and a cape. From there it's pretty standard. The invaders destroy a city, lots of rolls of pennies were cashed in to pay for the special effects . . . yadda, yadda yadda Like I said, what made it bearable was commentary from M&TB especially the introduction of the bullet-headed Neptune men which prompts Servo to comment 'Suppository Man!' This resulted in a spit take from me. Also, The Neptune Invasion Force leader has a disc around the top of his head leading at a running commentary from Crow about 'Has anybody seen my record? I really liked that record!' MST3K ribbed a lot of bad movies but IOTNM just seemed the right target. It never seems to have been made with any sort of effort at a good movie, just an excuse for couples in the early 50s to neck at the drive-in. I guess what I'm getting at is that IOTNM would be impossible to take were it not for the comments at the bottom of the screen. Like a lot of terrible cinema, its inclusion on MST3K seems to help cushion an otherwise crushingly bad movie. Which it still is, but you get the idea."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": [
         "New Toei",
         "Toei Company"
      ],
      "summaries": [
         "(English version) Slow-moving aliens from the planet Neptune, wearing nosecone-shaped space helmets, attempt to invade Earth in a winged rocketship. But they are thwarted by a mysterious superhero called Space Chief who flies around in a rocket-propelled car.",
         "A bunch of kids who look like rejects from the Japanese version of 'Lord of the Flies' run around while aliens (from Neptune, presumably) blow up stock footage, including a building with a giant mural of Adolf Hitler. After much technobabble and shots of radar displays, they are defeated by a wispy bachelor named Space Chief who has a wobbly flying car.",
         "Clumsy invaders from Neptune are thwarted by hero Space Chief and a nondescript group of microshort-wearing Japanese kids."
      ],
      "budget": 0
   },
   "movielensId": 173103,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1961-01-01",
      "dvdReleaseDate": null,
      "directors": ["Koji Ota"],
      "runtime": 74,
      "movieId": 173103,
      "title": "Invasion of the Neptune Men",
      "mpaa": "",
      "actors": [
         "Sonny Chiba",
         "Kappei Matsumoto",
         "Ryuko Mizukami",
         "Koji Sahara"
      ],
      "imdbMovieId": "0055562",
      "originalTitle": "Uchu Kaisoku-sen",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Clumsy invaders from Neptune are thwarted by hero Space Chief and a nondescript group of microshort-wearing Japanese kids.",
      "tmdbMovieId": 31254,
      "avgRating": 2.5,
      "releaseYear": "1961",
      "numRatings": 1,
      "posterPath": "/tvdcnLqXRA18Fk4e4rDHPTZNuog.jpg"
   }
}