{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "old dark house",
         "id": 15346
      }],
      "imdb_id": "tt0035679",
      "video": false,
      "title": "The Black Raven",
      "recommendations": [
         30179,
         29324,
         36456,
         109109,
         59657,
         59701,
         61702,
         59703,
         117026,
         59581,
         80720,
         31240,
         91733,
         26924,
         35919,
         98092,
         33388,
         28425,
         23125,
         28439
      ],
      "backdrop_path": "/24autepOdboJE0wiAusISS4TRRd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Amos Bradford",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3217",
               "name": "George Zucco",
               "profile_path": "/hduZG2CH9UeGuBamxnohkd3DEVg.jpg",
               "id": 30417,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Lee Winfield",
               "gender": 1,
               "credit_id": "52fe499d9251416c910b321b",
               "name": "Wanda McKay",
               "profile_path": "/NO5Yvc0knXiN441a7KYlr8aJQh.jpg",
               "id": 100577,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Mike Bardoni",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b321f",
               "name": "Noel Madison",
               "profile_path": null,
               "id": 96058,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Allen Bentley (also as Robt. Randall) (as Bob Randall)",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3223",
               "name": "Robert Livingston",
               "profile_path": "/zRTqDSKWwBkoRaV8IdqUDxYxr1s.jpg",
               "id": 103773,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Horace Weatherby",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3227",
               "name": "Byron Foulger",
               "profile_path": "/iMr3cELQ3pNBcUfnrcH6FP9SIZO.jpg",
               "id": 96722,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Sheriff (as Charlie Middleton)",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b322b",
               "name": "Charles Middleton",
               "profile_path": "/eThqMEt65JKkxwRQu2usnpGbfuH.jpg",
               "id": 30017,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Tim Winfield",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b322f",
               "name": "Robert Middlemass",
               "profile_path": "/ly2TbPciZhxspq56fEMg90XRbmP.jpg",
               "id": 34208,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Andy",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3233",
               "name": "Glenn Strange",
               "profile_path": "/ePUp4f4XFguUPgR9wWMTqLg2LeC.jpg",
               "id": 30112,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Whitey Cole",
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3237",
               "name": "I. Stanford Jolley",
               "profile_path": "/f52QrybfGyAgm9pH9BnY95MBd7C.jpg",
               "id": 120739,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499d9251416c910b31fb",
               "name": "Sam Newfield",
               "profile_path": "/yEtFDW4DaCJkVLS8ktJEpScNiS4.jpg",
               "id": 52172,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3201",
               "name": "Fred Myton",
               "profile_path": null,
               "id": 52173,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3207",
               "name": "Sigmund Neufeld",
               "profile_path": null,
               "id": 52179,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe499d9251416c910b320d",
               "name": "Robert E. Cline",
               "profile_path": null,
               "id": 52181,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe499d9251416c910b3213",
               "name": "Holbrook N. Todd",
               "profile_path": null,
               "id": 52182,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Mystery",
         "id": 9648
      }],
      "popularity": 0.507101,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 86772,
      "vote_count": 6,
      "budget": 0,
      "overview": "A group of strangers are brought together in an old, dark house and must contend with two murders and $50,000 in stolen money.",
      "similar": [
         15021,
         16764,
         28073,
         11974,
         29298,
         13549,
         31592,
         262799,
         156372,
         84714,
         180624,
         464420,
         26679,
         52702,
         91733,
         20216,
         105110,
         95560,
         99545,
         236786
      ],
      "original_title": "The Black Raven",
      "runtime": 61,
      "poster_path": "/fdhyHyRj6VnWuhG1VEnXMUki1ZK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Producers Releasing Corporation (PRC)",
         "id": 16466,
         "origin_country": ""
      }],
      "release_date": "1943-05-31",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sam Newfield"],
      "runtime": 61,
      "synopsis": null,
      "writers": ["Fred Myton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0035679/",
      "coverLink": null,
      "actors": [
         "George Zucco",
         "Wanda McKay",
         "Noel Madison"
      ],
      "reviews": [
         "I got to see this film last night on my local access channel, and I had such a good time with it. It reminded me so clearly of the classic early Warner Brothers cartoons about the fiends in the old houses on stormy nights and when you watch a movie like this, you can see the influences that inspired the great Chuck Jones. Though I agree with the other reviewer that this movie is a bit muddled, I cannot watch a movie like this from the perspective of its own time. It is so much a period piece. And that is the source of delight. The quality of the sound...the pops and crackles, the staged storm sound effects, the clothes, the lighting, the bumbling sheriff, the damsel in distress - all come together to present a little gem out of time. I recommend this film as a charming visit with our history of movie making.",
         "Many people have found that most DVD editions of \"The Black Raven\" to be too dark in places and of overall poor quality. I've found a nice, bright restored version of it on a triple feature DVD called Black & Blue Collection which is available through the Roan Group.com. It's compiled with \"Black Dragons\" and the most perfect copy of \"Bluebeard\" that I've ever seen (other DVD's of \"Bluebeard\" on the market are too grainy, edited or have bad sound). Anyway, \"The Black Raven\" focuses on a group of people who are trying to get over the Canadian border for different reasons but are forced by a rainstorm and washed-out bridges to spend the night at the shadowy Black Raven Inn. The film has plenty of old dark house atmosphere plus the effective relentless howling of the wind and the pounding of the rain. George Zucco and Wanda McKay give good performances in this intriguing murder mystery. Enjoy it in its most perfect DVD edition. It really makes a difference!",
         "This is a very \"odd\" film about the owner of a hotel (Zucco) who as a side-line of smuggling criminals into Canada. It is a VERY \"atmospheric\" film, with plenty of rain, thunder, and mysterious goings-on. Comedy relief is provided by the \"scared-reaction comedy\" of Strange & Foulger. Many reviewers have (unfairly, in my opinion) \"panned\" this film, but I think it's a film worth seeing.....and VERY difficult to find!",
         "\"The Black Raven\", released by PRC is a surprisingly good low budget mystery running just under an hour. The story takes place during a raging storm that has knocked out the local roads and bridge. A group of varied travellers are then forced to seek shelter in a small hotel run by the mysterious Amos Bradford (George Zucco). The first to arrive is an old nemesis Whitey Cole (I. Stanford Jolley) who has a score to settle with Bradford. Bradford and his oaf-ish assistant Andy (Glenn Strange) overpower him and tie him up but he manages to escape and remain in the shadows. Shortly thereafter a gangster, Bardoni (Noel Madison) arrives on his way to Canada. Next a meek bank teller (Byron Foulger) who has embezzled $50,000 arrives followed by a young couple Lee Winfield (Wanda McKay) and Allen Bentley (Bob Randall) who are also running off to Canada to get married. Turns out Lee is the daughter of Bardoni's gangland boss (Robert Middlemass) who is the next to arrive looking for his daughter. Naturally everyone takes an interest in the $50K. Then Winfield is murdered and the Sheriff (Charles Middleton) arrives on the scene. As in all such mysteries suspicion falls on each of the principals until the real murderer is unmasked in the final reel. This compact little mystery is an entertaining little film noire. Director Sam Newfeld keeps the story moving and the audience guessing. The film is bolstered by its veteran \"B\" movie cast. Zucco, always under rated, was a staple of such films in the 40s and gives a excellent performance as Bradford. Glenn Strange is also good in a Lon Chaney Jr. type role as the simple-minded Andy. Foulger made a career out of playing meek little bank tellers. And Charles Middleton (Ming the Merciless in the Flash Gordon serials) gets to play a good guy for a change. An entertaining hour.",
         "A motley group of people are forced to seek shelter at a remote inn run by the snooty, sarcastic, but suave Amos Bradford (a perfectly unctuous George Zucco) because of a raging thunderstorm that has flooded out the bridge and the roads alike. These eclectic individuals include a vengeful escaped convict whom Bradford put in jail, a meek geeky bank teller who's trying to embezzle $50,000 bucks, a mean, ruthless mobster who also wants to get his grubby paws on the hot loot, a young couple who are planning to get married, and the huffy, overbearing, disapproving father of the bride-to-be. Naturally, a vicious killer starts bumping folks off. Efficiently directed in a briskly straightforward and economical no-frills manner by Sam Newfield, with an endearingly hokey script by Fred Myton, plenty of sharply sardonic dialogue, stark, gritty black and white photography by Robert Cline, a booming, melodramatic score by Charles Dunworth, and game acting from a solid cast (Glenn Strange in particular contributes an amiable performance as Bradford's clumsy, cowardly, oafish assistant Andy while Charlie Middleton registers strongly as a jerky ramrod sheriff), this wittily enjoyable Grade B mystery thriller potboiler delivers a reasonable amount of cheap thrills. A fun little quickie.",
         "This is a cheap B-movie made by a very small studio, PRC. It stars George Zucco--the King of low-budget suspense and horror films of the 1940s. While most every film he starred in for PRC and other poverty row studios were terribly written and had cheap sets and actors, he managed good performances. Plus, while often silly, these films really were a lot of fun. \"Black Raven\" is one of his PRC films and once again his performance was pretty good. Apparently old George is a criminal known to the forces of the underworld as \"The Raven\". You'd think with such a cool name he'd be sort of like Blofeld or Dr. Evil, but this is a kinder, gentler sort of villain (to paraphrase George W.). While a crook, he's a decent sort of crook--with a strong sense of justice. The weather is awful and bridges have washed away, so several travelers seek refuge George's inn (his legitimate cover). Some of them are crooks themselves (such as an embezzler who just happens to come there on his way across the border to Canada), a couple are running off to Canada to marry because her father is a jerk who won't give consent and, finally, the father arrives. Now talk about a coincidence--this father ALSO happens to be a judge AND George (among others) hates the guy. Eventually, there is a murder and the nice man who is running away with the lady is accused. Here's where it gets odd. The Raven KNOWS that the man is innocent and decides to try to help! Like I said, he's a kindler, gentler sort of crook! Overall, this is a very good film despite its poor pedigree. The plot is tight, the acting (in addition to Zucco) is very nice and it's a surprisingly good B-movie. Well worth seeing--even with a very unusual characterization by the Zucc-Meister!",
         "If you have a taste for old B-movie mysteries, this film will interest you. It delivers a good moody atmosphere with great shots of down-pouring rain, dark cellars and interesting characters. Various groups of people all become stranded at a spooky motel after a rain storm has closed the local highways leading out. A great cast of veteran actors make this little mystery worth watching. George Zucco is at his B-movie best. Glenn Strange gives us some good comedy relief. Plus, there is not much cheesy over-acting that you sometimes find in low budget movies. Here's a cool suggestion: Go rent the current movie, 'Identity' starring John Cusack. Then watch The Black Raven. You may be as amazed, as I was, at how much of the characters, plot and setting appeared to be lifted from this movie. I am not suggesting that they were stolen. If you have already seen 'Identity' you will understand that a certain character in the film seems to have spun a tale based on what he saw watching \"an old movie\". I'm just saying that I think 'The Black Raven' is the movie that they are referring to. While the character nor the movie maker actually says this, there is one reference in 'Identity' where a girl says, \"This is like that old movie where everybody is trapped in hotel...\" This probably doesn't make much sense unless you have seen both mentioned movies. Don't misunderstand me, I thought the movie 'Identity' was a brilliant display of script-writing. Way to go, Michael Cooney.",
         "This is a confusing mystery with lots of darkness and bumbling around. George Zucco is really the only interesting character. He seems to be part of the criminal element, yet he seems to have dignity and integrity. When a group of mismatched people arrive at a hotel in an intense rainstorm, including a gangster, a corrupt politician, his daughter and her fiancée, and an escaped convict, the action gets going. There is also an embezzler with 50,000 dollars who plays the Casper Milquetoast type. His money leads to all kinds of shenanigans. There's also a sheriff played by Charles Middleton (Ming the Merciless), who is a bit of a buffoon. Throw in Glen Strange, former Frankenstein monster, and you have about as odd an assortment as you can imagine. The pacing is pretty bad. There is a lot of running around in the dark and people looking through windows. Still, it's Zucco's character that really captivates. The bad thing is, \"What is his motivation?\" He observes and comments. He is trafficking criminals to Canada, yet we don't get enough information to really understand him. It's pretty forgettable, but has some moments.",
         "Almost an Old Dark House movie. On the qualifying side, it's a mystery, it has four murders, comic elements, a very serious thunderstorm, stranded motorists, people hiding in the shadows, & a big old dark boarding house. Close enough, I would say, but I didn't see any secret passageways & the film was made a bit late (1945) to qualify. Good dialog, intelligently written for its type, & most (but not all) of the acting is competent. George Zucco is especially good as the owner of the boarding house. 1940s Frankenstein fans, & Gunsmoke (TV) fans will greatly enjoy Glenn Strange's comic role as Zucco's assistant; he's funny & gets to do a little slapstick! Overall, quite an enjoyable film if you like this sort of thing (I do). It's hard to find this one, but it's worth looking for. I rate it 8/10.",
         "If you pay careful attention to David Chudnow's music, \"The Black Raven\" qualifies as more comical than creepy. This atmospheric, black & white, whodunit about one stormy night near the Canadian border in a motel on the American side is a solid, entertaining triple murder tale about greed, corruption, and revenge. Prolific director Sam Newfield, who helmed \"Hitler\u0097Beast of Berlin\" as well as 168 other films, teams up with frequent collaborator Fred Myton. Based on Myton's original screenplay, \"The Black Raven\" is a formulaic but polished potboiler with clever dialogue and strong performances. Amazingly, this Producer's Releasing Corporation B-movie is a respectably done programmer that preserves the unities of time, place, and setting to a single evening. The casting of Glenn Strange and Charles Middleton is worth mentioning. Better known as Frankenstein's monster in \"House of Frankenstein\" (1944), \"House of Dracula\" (1945), and \"Abbott and Costello Meet Frankenstein\" (1948), Strange plays an over-sized simpleton who doesn't know his own strength and behaves like a coward when he trips over two corpses. Furthermore, this represents one of Strange's more loquacious characters. Meanwhile, Middleton\u0097billed here as Charlie\u0097plays an incompetent but honest sheriff rather than a dastardly villain. Remember, the hatchet-faced Middleton starred as Ming the Merciless in \"Flash Gordon\" (1936), \"Flash Gordon's Trip to Mars\" (1938), and \"Flash Gordon Conquers the Universe\" (1940).\" These roles provided departures from the usual ones that Strange and Middleton played. A variety of motley characters show up one night during a thunderous downpour at Amos Bradford's Black Raven Inn. Bradford (George Zucco, who played Professor Moriarty in \"The Adventures of Sherlock Holmes\") is a rather suspicious character himself who specializes in smuggling felons across the border into Canada. Racketeer on the run Mike Bardoni (Noel Madison of \"G-Men\") arrives after Whitey Cole. Cole (I. Stanford Jolley of \"Ghost of Zorro\") has broken out of prison and wanted to exact revenge on Bradford. \"I was so anxious to get square with you that I busted out,\" says Cole as he holds Bradford at gunpoint, \"I could've knocked you off when I just came in but I had to face the judge when he handed me my rap and I want you to do the same.\" When Bradford's oafish handyman, Andy (Glenn Strange of \"Red River\"), enters the inn, he distracts Cole long enough for Bradford to disarm him. Andy ties Cole up and stashes him in Bradford's room. Cole believes that Bradford double-crossed him. Bradford defends his behavior. \"All of a sudden you got too smart to take orders,\" he points out to Cole, \"When I saw what was coming, I protected myself.\" Another ambitious gangster, Tim Winfield (Robert Middlemass of \"Cain and Mabel\"), has forced Bardoni out of the rackets after Bardoni built them up, and the authorities want to arrest Bardoni. Bardoni wants to get across the border before the law catches up with him. The next guest at the Black Raven is a long-suffering, milquetoast bank employee, Horace Weatherby (a spectacled Bryon Foulger of \"Sullivan's Travels\") who has embezzled $50-thousand so that he can finally enjoy life to the hilt. There is a hilarious moment when Weatherby argues with a roadblock watchman (Jimmy Aubrey of \"Swamp Woman\") during the storm about when the bridge to Canada will be rebuilt. When he arrives at the motel, Weatherby clutches a satchel for dear life and arouses Bardoni's curiosity. As he is registering, Weatherby neglects the satchel for a split-second and Bardoni knocks it off the counter and presto it falls open and wads of bills can be seen. The next two guests are an unmarried couple, Allen Bentley (Robert Livingston of \"The Lone Ranger Rides Again\") and Tim Winfield's estranged, under-age daughter Lee (Wanda McKay of \"Raiders of Ghost City\"), who are trying to elope across the border into Canada so that they can get married. Lee's father has thwarted their efforts to obtain a marriage license. The last guest to show up is none other than infamous Tim Winfield, and he calls up the state police about the same time that the storm knocks out the telephone lines. Winfield recognizes Weatherby and appropriates the $50-thousand from the unwilling bank employee. Not long afterward, Andy discovers Winfield's body, but they cannot find the loot. When the sheriff (Charlie Middleton) shows up about 34 minutes into this 65 minute opus, the lawman arrests Allen Bentley because Lee's father had slapped Bentley in the presence of both Bradford and Andy. Bradford steadfastly refuses to believe that Bentley killed Tim Winfield. \"I'm not going to have that boy take a rap,\" Bradford vows to Bardoni, \"for a murder he didn't commit.\" Nevertheless, Bentley escapes from the sheriff's custody with the help of Lee and Bradford. In no time at all, the sheriff finds Bentley locked up in the basement with Weatherby and Andy where Bardoni had put them while he searched for the $50-thousand. As the triumphant sheriff returns with Bentley in custody, Andy discovers another corpse\u0097this time Bardoni. Clearly, Bentley couldn't have killed Bardoni. George Zucco plays a sinister character, but he spends most of his time defending young Bentley. This is one of Zucco's more sympathetic villains and the actor anchors this melodrama with his commanding presence. Sam Newfield handles the complicated Myton plot with aplomb. Rarely does a moment go by without some important bit of business being inserted into the action. Despite its low-budget origins, \"The Black Raven\" ranks as a well-written yarn. Just about everybody is implicated in Winfield's murder. The revelation of Winfield's killer comes as something of a shock because of all the red herrings and the meticulous characterization. Newfield likes to let one character speak and show another character's reaction so that he can throw you off the scent of the guilty party. Poetic justice is served in the long run. Altogether, this underrated romp is pretty good considering its meager budget.",
         "The Black Raven is another movie that IMDb has incorrectly listed as a \"Horror/Mystery\". \"Mystery\" - I'll give you. \"Horror\" - None that I saw. The basic story: Several varied travelers are forced to stay at an inn by a thunderstorm that has washed out the roads and bridges. One of the guests has $50,000 that he stole from the bank where he worked. When one of the guests is murdered, it seems that everybody had a motive. And to complicate matters, the $50,000 is missing. Who did it? You'll have to watch to find out. The movie stars George Zucco and Glenn Strange. Both were veterans of both B-pictures and mainstream horror. The performances of Zucco and Strange, as well as most of the rest of the cast, is superior to what you normally find in a PRC production. The film has tons of atmosphere. The big, dark inn, the thunderstorm, the hiding places, and the characters' motivations create a terrific atmosphere for a mystery thriller. The inn, with it's many guest rooms and cellar makes a great setting for a murder. The problem I had while watching The Black Raven wasn't so much with the movie, but with the DVD I have. The Alpha DVD is VERY dark in some places. It's all but impossible to tell what is going on. The worst is that one of the dark spots occurs during the final events of the movie leading up to the killer being revealed. What a shame, because otherwise this would have been a highly enjoyable little murder mystery. For what it's worth, I'll give the movie a 5/10. It would probably be a point higher if I had been able to see exactly what was happening. Also, I'll give the Alpha DVD a 2/10. I know this is an old film that has probably been given very little care, but the transfer was unacceptable even by Alpha's standards.",
         "The Black Raven is both the name of an Inn near the Canadian border and it is the underworld nickname of its owner George Zucco. At one time a kingpin racketeer Zucco now is retired and owns this rural hideaway which some of his associates use when they're fleeing the country. On one dark and stormy night when a local bridge washes out, several unexpected guests arrive including political boss Robert Middlemass hot on the heels of his daughter Wanda McKay who is eloping with Robert Livingston in one of his few non-western roles. Middlemass is the first of several murders that night before Sheriff Charles Middleton gets it all solved by a dying confession and the elimination of a few cast members. Although this is a typical PRC poverty row product as always George Zucco exudes menace and keeps this film moving along nicely. Might be worth a look.",
         "Dear reader, do you like the _mefistofelic Zucco? A once known character actor, he had nonetheless some leading roles; a few. And the intelligent, phlegmatic guy from BLACK RAVEN suits daddy Zucco just well. A nice lead in a short, rapid flick, in a very humble and unassuming class of mystery flicks. They ask average competence (and no budget) to make for average fun. At least they sometimes had the decency to secure a notable lead\u0097a Karloff, a Lugosi or at least a Zucco or other 'B' glory. Such flicks are no cinema\u0097just like a newspaper isn't literature; it's stuff to be consumed. It's useless to rate them; they're just their class. For something smarter, check elsewhere. BLACK RAVEN is a short flick about a tempestuous evening near the Canadian border. Zucco plays the owner of the place where all the characters gather and a plot is dressed up. This mystery movie has nothing even remotely original or memorable\u0097just a short story shortly told. You know I have found a kind word for other flicks of this class\u0097in previous comments\u0097and I'll oblige this time too, basically repeating my recommendation\u0097if rightly assessed, BLACK RAVEN offers what's expected from this genre. Not to be preferred to anything else. But if you were expecting in any way something better, or classier, then, my lad, get the freak out of here!",
         "***SPOILERS*** Fate brings six people together one night at the Black Raven Inn thats on the Canadian USA border. The first person who shows up is escaped convict Whitey Cole, I. Stanford Jolly, who has a score to settle with the Inn's owner Bradford, George Zucco. Having been double-crossed by Bradford and losing his half of the Black Raven Inn Cole wants him to pay for his backstabbing but is subdued by Bradford and his handyman at the Inn Andy, Glen Strange, and tied up and held captive in the basement until the police come to arrest him. Soon another customer arrives Mike Bardoni, Noel Madison, a wanted hood who's trying to make it across the border to Canada to escape the law. The next four persons who arrive at the Inn is Horace Weatherby, Bryon Foulger, a bank clerk who just embezzled $50,000.00 from his bank and the couple of Allen Bently, Bob Randell, and his fiancé Lee Winfield, Wanda McCay, who are also trying to elope to Canada to escape Lee's domineering and gangster father Tim Winfield, Robert Middleass. Winfield also arrives at the Inn in order to stop his daughter from going through with her marriage to Allen. Winfield is also the man who brought Bardoni down as a top gang leader in the world of organized crime and you just can imagine what happened when the two men end up in the same room together. Cole unties himself and escapes into the woods as Winfield recognizes Weatherby from his picture in the newspapers as the bank embezzler and gets him to give him the $50,000.00 so, as he tells Weatherby, he'll return it to the police and nothing would happen to him. Earlier in the movie Brdoni noticed the money Weatherby was carrying in a satchel and wanted to take and keep the loot for himself but as it turns out both Winfield & Bardoni end up getting murdered, who did it? \"The Black Raven\" isn't one of George Zucco's best but it would be watchable only if the lighting in the movie was better. It looked like the movie was filmed in a mineshaft with some scenes so dark that it was impossible to make out who was in them. There was also an attempt of having some humor in the film with a bumbling sheriff, Charlie Middleton, and a cowardly Inn worker Andy. Glen Strange who played Andy is almost twice as big, at six foot seven inches, as anyone in the movie and him being scared to death of every little sound and shadow came across as phony as a three dollar bill. It was left up to Bradford as well the audience, the dopey Sheriff was no help at all, to figure out who the killer or killers were and the ending when he was discovered by Bradford did surprise me.",
         "Old dark house mystery from poverty row studio PRC starring George Zucco as a guy who runs a hotel on the American side of the Canadian border, where he helps criminals flee the country. One dark and stormy night a group of strangers stop at the hotel to wait out the bad weather. Then a crooked politician with connections to several people in the group shows up and promptly gets himself murdered. You had me at George Zucco, PRC. This is an enjoyable little B movie with a decent cast. In addition to the always terrific George Zucco, the cast includes Byron Foulger, Noel Madison, Wanda McKay, Charles Middleton, and Glenn Strange as Zucco's simpleminded sidekick. It's cheaply made and the story isn't particularly original, but it's just an hour so it won't kill you to give it a shot.",
         "What do you get when a prison escapee, a thief, a gangster, and a crime boss meet one stormy night at an out-of-the-way inn? The Black Raven which is the name of not only this movie but this inn and also the pseudonym by which George Zucco is evidently known in more nefarious circles. There's no plot to this movie. The rain has washed out the bridge to Canada and is forcing these folks, plus a couple trying to elope, to stay at the Black Raven Inn. They've all got separate agendas until it's known that there's $50,000 floating around and that changes everything. There is some terrific atmosphere and a semi-eerie old dark house setting. There is also some unwelcome comic relief, which is a staple of these 1940s mysteries, this time mainly from handyman Glenn Strange. It's nothing too special but enjoyable B fare.",
         "Zucco, with his British accent, was usually a heavy -- a mad scientist or Professor Moriarty. Here, he's a man more or less of probity, although he has a secret past involving cheating his partner and seeing that the partner is convicted and sent up for the embezzlement. Now, however, Zucco runs a legitimate boarding house near the Canadian border. During a terrific thunderstorm that drenches the plastic studio greenery, all the bridges to Canada are washed away and a number of guests pile up at Zucco's Black Raven Inn, mostly escapees from the states. They're a diverse lot. First to show up is Zucco's ex partner, recently escaped from the slams and now ready to take violent revenge on Zucco. Next, a mousy clerk, Bryan Foulger, who has several thousand dollars he stole from the bank where he worked as a teller. A sneering gangster wanted for murder shows up and demands that Zucco arrange his transport across the border. Then an innocent young couple who have just eloped and are headed towards another country where they will be free of the interference of the girl's rich and nasty father. The rich and nasty father shows up last and makes a great pain of himself because, by coincidence, he owns the bank that Foulger, the timid teller, has fleeced and now he wants the money back. The angry, domineering bank owner is the first to go, by unknown hands. The movie's pace is so fast that his daughter isn't given any chance to grieve. Nobody else is particularly upset either. Everyone seems to have a motive to bash him in the head. A determined sheriff, who seems to have the IQ of a parsnip, shows up and recklessly blames the young would-be groom. But another murder takes place, and then another. It's nice to see George Zucco as a reasonable and half-way decent man, miscreant though he may be. But he puts little into the role. He's wooden, machine processed. The others -- all of them -- act like actors being paid to act in a low-budget B movie produced by PRC studios, which is not MGM. I kept thinking of what someone like James Mason would have done with the role. The young girl is Wanda McKay who had been a model and never did develop much of a movie career, probably because she changed her birth name, Quackenbush, which would have been memorable. She's cute as hell though. The groom's haste in getting her across the border is understandable. And the atmosphere is appealing -- a windy downpour beating against the windows and everyone trapped inside the inn. The set dresser, alas, didn't exert himself. The interior of the inn itself isn't very spooky and apart from one or two conspicuous shadows, the lighting is flat and uninspired. Watch it when you can't sleep and are too dopey to care.",
         "George Zucco runs a little country inn called the Black Raven. He himself is also known as the Black Raven—a mysterious underworld figure whose services include assistance to those hoping to slip quietly over the nearby border into Canada. He has guests: his former partner has busted out of prison to come and get revenge on him; a gangster on the lam (Noel Madison) wants help getting to Canada; a bank clerk (Byron Foulger) stops on his way to Canada with a briefcase full of money; and an eloping couple (Wanda McKay and Bob Livingston—billed here as Robt. Randall) stop for the night, or at least until the storm lets up. Hot in pursuit is the eloping girl's father, who also happens to be a powerful and shady political figure and a bitter rival of the fleeing gangster. When one of these guests turns up dead and the bag of money goes missing, the Raven has a house full of suspicious characters throwing around accusations and digging around for the money. The action moves along pretty fast and the plot mostly holds together. The dialog is never particularly original but contains a certain amount of dry humor— Foulger: \"Oh, dear, how awful. How'd it happen?\" Zucco: \"Evidently someone didn't like him.\" Zucco is good and is basically the hero—although we know he operates outside of the law, he takes a certain interest in protecting the young couple in particular. Glenn Strange is the Raven's handyman; it's kind of funny to see him as comic relief, as he shivers at shadows and falls down stairs. Charles Middleton is also essentially a comic figure as the clueless sheriff. (Here he has the authoritative voice but none of the brains of the Emperor Ming.) The cast give enthusiastic performances, the storm effects and lighting create the right atmosphere\u0085it's lots of fun.",
         "Here's a perfect movie for a dark and stormy night, primarily because it takes place on a, well, dark and stormy night. The atmosphere of this flick might be it's best recommendation, with the added emphasis of a washed out bridge and travelers stranded at the Black Raven Inn. Great atmosphere throughout, even if you have to strain through some of the scenes where it's so dark you can't tell what's going on - part of it's charm so to speak. George Zucco does the lead honors for this PRC programmer, with an unusual assist by veteran 'B' movie and TV Western character actor Glenn Strange. Strange is strange as a comedic foil, out of character for him so his bits fall flat, even as he tumbles down a set of stairs a couple of times. Byron Foulger is well cast in his role as a milquetoast bank cashier on the lam with a fifty grand stash of stolen money. That provides him with all the motivation he needs to pull off a murder that you might see coming - but then you might not - as there are plenty of suspects in the death of businessman/gangster Tim Winfield (Robert Middlemass). Did anyone else think it just a bit odd that Winfield wound up at the exact same hotel on the Canadian border as his runaway daughter and fiancée? Speaking of which, I found it curious but appropriately correct for the era to have Lee Winfield (Wanda McKay) and Allen Bentley (Robert Livingston) sign in as guests for separate rooms, since they weren't married yet. You know, they could have just as easily been returning from Canada as newlyweds, and could have used that as a ruse to really freak out old man Winfield. That would have been something, huh? I've read on some of the other posts that this is a hard one to get hold of, but it's just one of many on a great sixty DVD/two hundred fifty film box set from Mill Creek Entertainment as part of their Mystery Collection. It's tucked way back in the latter third of the package, but worth picking out for an early look see. If it's a dark and stormy night, your timing will be perfect.",
         "This is the sort of film that is more of a stage play, meant to showcase talents of up and comers in schools and community theaters. It is a basic mystery in a secluded area, with shady characters to serve as suspects, including a cliché young hero and heroine. Unfortunately, the romance is gone from this one, as the pair already are engaged before we meet them. Instead of the romantic older film plot of boy meets girl, it is the modern movie plot of boy already has girl. We know the modern movie anti-romance plot is because movies are often viewed by couples who already met. The industry today is based on placating the already decided couple instead of single men. So the movie has the \"atmosphere\" elements of the old stage play mystery mixed with modern commercialism. The comic relief character is usually what makes these movies watchable, and here \"Andy\" does a credible job of comic relief. He is both engaging and entertaining. He helps to make the movie flow. The story flows much better than most such movies, particularly the modern ones. There isn't anything memorable, just good popcorn and soda fun.",
         "Ever-delightful George Zucco, that great genre character-star of the Golden Age of Hollywood, is front and centre in this zippy, enjoyable PRC programmer. He plays Amos Bradford, the proprietor of an inn near the U.S. / Canada border whose side business is smuggling criminals across the border. A disparate group of individuals - a milquetoast embezzler (Byron Foulger), a racketeer (Noel Madison), a couple (Robert Livingston, Wanda McKay) attempting to elope, her big shot politician father (Robert Middlemass), and others - gather for an eventful night of murder (during a terrible rain storm, naturally) at Zuccos' establishment. This is actually quite fun, and it does keep you on your toes regarding the mystery aspect of the story (written by Fred Myton); since there are a few shady types hanging around, and there is more than one motive for wanting the first victim out of the way, the viewer doesn't automatically focus on one character. A strong sense of humour also helps matters a lot, with Amos coming off as a very unflappable and sardonic man, who has a genuine interest in figuring out whodunit. Much of the comedy relief is provided by none other than Glenn Strange, who plays Amos' excitable, bumbling assistant, and he's pretty amusing. Overall, the cast is good. Also appearing are Charles Middleton as a humourless Sheriff and top character actor I. Stanford Jolley as the slimy prison escapee Whitey Cole. \"The Black Raven\" has solid atmosphere, an excellent pace (clocking in at BARELY over an hour long), and a bittersweet wrap-up. It's good fun for any fan of thrillers and horror films from this era. Seven out of 10.",
         "\"You'll have to turn back! The bridge is washed out!\" This is always followed by the friendly suggestion, \"You can always stay at the Black Raven right down the street\" With that raven's feather in his cap, the man turning drivers back sends these poor travelers possibly to their doom to this dark inn run by George Zucco. Among the travelers are a couple eloping against the will of her father and a single middle aged accountant heading to Canada on vacation. Before long, the bride to be (Wanda McKay) is confronted by her pompous father (Robert Middlemass) who also recognizes the single accountant (Byron Foulger) as an accused embezzler. Bizarre creeping figures make for a spooky evening as thunder and lightening darken the rain-soaked night. It's the spooky Glenn Strange lurking in the hallways, frightening Foulger while Zucco offers support to McKay's groom-to-be (Noel Madison). It's no shock when Middlemass is found dead, discovered right after the spooky music utilized in several PRC horror films is played over and over again. Cheezy fun, this dimly lit \"Old Dark Inn\" horror yarn is thrilling and short with the perfect atmosphere for murder and mayhem. I can just hear the director on the wind and rain machine barking \"Faster!\" to the technical workers on the set. \"Oh dear, how did this happen?\", suspect Foulger asks to which Zucco dryly replies, \"Obviously, somebody didn't like him!\" Zucco gets some really funny lines, telling one of his paranoid staff members, \"With your mind, you could see the statue of liberty doing a conga!\" Veteran film villain Charles Middleton goes onto the right side of the law for a change to play the sheriff, but when it comes down to it, on a dark and stormy night, anybody could have done it! There are a lot of patches of simply the suspects roaming around the hotel as the music plays with no dialog at all, and although this slows it down a bit, it really doesn't matter. It's all over in an hour, giving chills, laughs and overall, a memorably macabre atmosphere that ends up being harmless fun.",
         "George Zucco is grand in \"The Black Raven\", giving a dignified and poised performance rising above his budget as always. The rest of the cast is also good with Glenn Strange especially noteworthy as Zucco's bumbling helper. The production is cheap of course but features some fine thunderstorm effects, with an astonishing amount of water filmed very expertly. By stripping away any excessive humor or cuteness or any other gimmicks and focusing on being a basic mystery, this film succeeds so that you really won't notice any budget issues. Fundamental soundness in its production and the sheer stature of Zucco's work make \"The Black Raven\" a surprisingly good movie.",
         "A group of strangers are brought together in an old, dark house and must contend with two murders and $50,000 in stolen money. These dark, moody, creepy mysterious movies apparently were the rage back in the early 40s. There are tons of them. Even Abbott & Costello made a couple! This one is no exception. Lots of shadowy things going on. These types of films may have originated from some English live theatre that are still popular to this day in London. Unsure. Even WC Fields has a line in a movie where he turns a picture into a \"drawing room drama!\" It's a very watchable movie. The down side is that available prints are not so pristine. You can actually see the celluloid warping while you watch!",
         "A group of strangers holed up at a quaint lodge (The Black Raven) during a fierce storm discover that one of the guests has embezzled a large sum of money and is carrying the stash en route to Canada. Predictably, murder and subterfuge soon follow as the parties vie for the tainted bounty. Solid cast includes Zucco as the inn's apparently benevolent manager, Glenn Strange (a sort of 1930's version of Mike Lane) his lanky, trusted goon and Byron Foulger as the cashed-up fugitive. Wanda McKay and Bob Randall play an eloping couple, pursued by the bride's possessive father (Middlemass) who has vetoed the nuptials. It's the typical assortment of guests each brining their own travails to bear upon the common intrigue and nobody is above suspicion. Zucco is a masterful thespian and his patient, assured (not to mention immaculately attired) presence easily eclipses the surrounding mediocrity, an otherwise average tale that plays the clichéd formula 'dark & stormy night with strangers' with few innovations or surprises."
      ],
      "genres": ["Mystery"],
      "productionCompanies": ["Sigmund Neufeld Productions"],
      "summaries": ["A group of strangers are brought together in an old, dark house and must contend with two murders and $50,000 in stolen money."],
      "budget": 0
   },
   "movielensId": 173357,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1943-05-31",
      "dvdReleaseDate": null,
      "directors": ["Sam Newfield"],
      "runtime": 61,
      "movieId": 173357,
      "title": "The Black Raven",
      "mpaa": "",
      "actors": [
         "George Zucco",
         "Wanda McKay",
         "Noel Madison",
         "Robert Livingston",
         "Byron Foulger",
         "Charles Middleton",
         "Robert Middlemass",
         "Glenn Strange",
         "I. Stanford Jolley"
      ],
      "imdbMovieId": "0035679",
      "originalTitle": "The Black Raven",
      "genres": ["Mystery"],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of strangers are brought together in an old, dark house and must contend with two murders and $50,000 in stolen money.",
      "tmdbMovieId": 86772,
      "avgRating": 1.75,
      "releaseYear": "1943",
      "numRatings": 2,
      "posterPath": "/fdhyHyRj6VnWuhG1VEnXMUki1ZK.jpg"
   }
}