{
   "tmdb": {
      "original_language": "ko",
      "keywords": [],
      "imdb_id": "tt6343000",
      "video": false,
      "title": "Life Risking Romance",
      "recommendations": [],
      "backdrop_path": "/4DyfQSRxVuY2avz6Bm7zzDYsMmy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "",
               "gender": 1,
               "credit_id": "585b4b4c92514175ad0777d2",
               "name": "Ha Ji-won",
               "profile_path": "/f6PHSPJBTjuNsRlmDMVsbGnWg0G.jpg",
               "id": 83220,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Rok-hwan",
               "gender": 2,
               "credit_id": "58a5cfc9c3a3683d67006af9",
               "name": "Chun Jung-myung",
               "profile_path": "/pCiBw5r2XgRsrC75xkTJpHrP3Hj.jpg",
               "id": 93994,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "585b4b7192514159410324fc",
               "name": "Chen Bolin",
               "profile_path": "/eRDmuLHY4mSOEsB6lHeisfVO951.jpg",
               "id": 64440,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jung Yoo-mi",
               "gender": 1,
               "credit_id": "58a5cffec3a3683d74006b30",
               "name": "Yoon So-hee",
               "profile_path": "/25RXr7ZbhdT2g2YC5d6JdrUHM4J.jpg",
               "id": 1351407,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "585b4ba59251415941032524",
               "name": "Oh Jung-se",
               "profile_path": "/8buE6s1PHT91RoEnLfil0WFABYf.jpg",
               "id": 998412,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "585b4bbbc3a368384300dc34",
               "name": "Song Min-jung",
               "profile_path": "/mblmnCsf0qzHTcZdzncRhN3UDwN.jpg",
               "id": 1183550,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "585b4be4c3a3682f580804a7",
            "name": "Song Min-gyu",
            "profile_path": null,
            "id": 1725968,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.342812,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 431251,
      "vote_count": 3,
      "budget": 0,
      "overview": "Je-In (Ha Ji-Won) is a mystery novel writer. She chases after a serial killer with her longtime friend Rok-Hwan (Chun Jung-Myung). Rok-Hwan is a detective. A handsome and mysterious man, Jason (Chen Bolin), appears in front of them. ",
      "similar": [],
      "original_title": "목숨 건 연애",
      "runtime": 103,
      "poster_path": "/6Djme5Vq1FxkM9Whq8Q90ielOgF.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "(주)비에이엔터테인먼트",
         "id": 84678,
         "origin_country": ""
      }],
      "release_date": "2016-12-14",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Min-Gyu Song"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Ba-da Kim",
         "Min-Gyu Song"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt6343000/",
      "coverLink": null,
      "actors": [
         "Ji-won Ha",
         "Jeong-myeong Cheon",
         "Bo-lin Chen"
      ],
      "reviews": [
         "Life Risking Romance is a mixture of romantic comedy, suspense and murder mystery. Accomplished actress Ha Ji-Won plays the female lead, mystery novelist Han Jae-in (Jane Han) who has run out of creative ideas and decides to try to discover the identity of a real life serial killer so she'll have a plot for her next novel. She's assisted by police detective and childhood friend, Seol Rok-hwan (Sherlock Holmes). The main suspects are a neighborhood burglar, who is definitely a thief and may also dabble in murder, handsome FBI agent Jason Chen, who was stationed in Miami when some similar murders happened there, and Detective Rok-hwan himself, who may be using his position in the police force to hide crimes. It's fair to say that this mixture of genres works well at times and not so well at other times. The comedy has some good moments, but relies too much on fart jokes. The romance is a love triangle between Jane, the FBI agent and Sherlock Holmes. Both would-be suitors have their strong points, but it's a little hard to disregard the fact that either one could be a serial killer. As a murder mystery, there are too few suspects to leave room for more than passing doubt about who the real culprit is. On the positive side, all of the actors do a very good job with the material they are given, Ha Ji-Won looks as fabulous as ever, and there is real chemistry between the leads. Jane has a good future with either boyfriend, if only she can figure out who is the murderer - before it's too late.",
         "A crime writer is trying to find inspiration to write her new novel by trying to find crimes where there are non. That leads to get her into trouble more than once, to the point that she is chased by a real serial killer. After she convinces her policeman best friend that her foreign neighbour is the serial killer, she embarks on a journey to solve the mystery and catch him. Okay, the movie is a so so, though it was funny and the twist was really convincing and unpredictable, as it makes you rethink what you speculated about who is the killer and then turn the tables on you again once more. The performances were okay, but the romance was weak (the first one, but in the end you get why). The English dialogues were too many, but that can't be the real problem. In the end, it's just an okay movie so 4 out of 10.",
         "\"Life Risking Romance\" (aka \"Mok-sum Geon Yeon-ae\") turned out to be a double treat for me. First of all it is a South Korean romantic comedy, and secondly it has one of my favorite South Korean movie stars on the cast list, that being the talented Ji-won Ha. Granted, I had not heard about \"Life Risking Romance\" prior to finding it by sheer luck. Picking it up, it was immediately clear that this was going to be some kind of comedy. And after having read the synopsis and seeing who was in the movie, this was a definite must watch for me. The characters in this movie are rich in detail, lovable and hilarious at the same time. And the individual characters do add a lot of flavor to the movie. And there are some really hilarious moments when Han Je-in gets nervous and accidentally farts; fart comedy is always hilarious. The cast in the movie was quite good, with a combination of talented actors and actresses. Aside from Ji-won Ha, then it was also very nice to see So-hee Yoon in this movie. The people in the movie were doing great jobs with bringing their characters to life on the screen. The story in the movie is about criminal writer Han Je-in (played by Ji-won Ha) whom believes that the handsome new tenant Upstairs might be a serial killer, and takes matters into her own hands to investigate the matter. And it was actually a good storyline, because it was well-written, well-thought through, had some nice twists and surprises to it along the way as well, and it wasn't overly predictable. There are many funny scenes throughout the course of the movie, and the scenes are enhanced by a great character gallery and an equally great acting performance from the cast. The pacing of the movie is quite good, because there is a wonderful combination of comedy, action, suspense and character development going on as the movie progress. So there isn't really a dull moment from start to end of the movie. \"Life Risking Romance\" is a great combination of comedy, romance and a pinch of thriller mixed together into one entertaining mixture. The combination works out great, because of writer Ba-da Kim and writer/director Min-Gyu Song had come up with something wholeheartedly entertaining and funny at the same time. This is indeed a very South Korean movie in every sense, and I mean that in a good way. And if you are familiar with South Korean cinema then you know what I mean by that."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["BA Entertainment"],
      "summaries": ["A detective fiction authoress makes a lot of romantic and funny stories with a criminal police and a fascinating sweet guy when she traces a serial killer,"],
      "budget": 0
   },
   "movielensId": 173377,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2016-12-14",
      "dvdReleaseDate": null,
      "directors": ["Song Min-gyu"],
      "runtime": 103,
      "movieId": 173377,
      "title": "Life Risking Romance",
      "mpaa": null,
      "actors": [
         "Ha Ji-won",
         "Chun Jung-myung",
         "Chen Bolin",
         "Yoon So-hee",
         "Oh Jung-se",
         "Song Min-jung"
      ],
      "imdbMovieId": "6343000",
      "originalTitle": "목숨 건 연애",
      "genres": [
         "Romance",
         "Thriller",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Je-In (Ha Ji-Won) is a mystery novel writer. She chases after a serial killer with her longtime friend Rok-Hwan (Chun Jung-Myung). Rok-Hwan is a detective. A handsome and mysterious man, Jason (Chen Bolin), appears in front of them. ",
      "tmdbMovieId": 431251,
      "avgRating": 3.5,
      "releaseYear": "2016",
      "numRatings": 1,
      "posterPath": "/6Djme5Vq1FxkM9Whq8Q90ielOgF.jpg"
   }
}