{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2417854",
      "video": false,
      "title": "Lucky Bastard",
      "recommendations": [
         253346,
         60152,
         53897,
         17025,
         17731,
         143146,
         232078,
         44352,
         64802,
         54704,
         96551,
         84338
      ],
      "backdrop_path": "/4VNdu9ysMVozuDRgkACvpX31KXC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Ashley Saint",
               "gender": 1,
               "credit_id": "52fe4c559251416c75117353",
               "name": "Betsy Rue",
               "profile_path": "/ijVVm6V486kul5o8bMZbT1kOW2B.jpg",
               "id": 76886,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe4c559251416c75117357",
               "name": "Don McManus",
               "profile_path": "/8JOjJkZBQmhVb6n8yHw70LIgC7i.jpg",
               "id": 79025,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kris",
               "gender": 2,
               "credit_id": "52fe4c559251416c7511735b",
               "name": "Chris Wylde",
               "profile_path": "/zbeK3p6KP7G5S0gQRQ5u00eE35q.jpg",
               "id": 588231,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Dave G.",
               "gender": 2,
               "credit_id": "52fe4c559251416c7511735f",
               "name": "Jay Paulson",
               "profile_path": "/z3g4eWlY0EQG3IFn729lIHPjBQf.jpg",
               "id": 88597,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Casey",
               "gender": 0,
               "credit_id": "52fe4c559251416c75117363",
               "name": "Catherine Annette",
               "profile_path": "/DwilufxfB8gEue7N3uAN97q9CL.jpg",
               "id": 1025021,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Suzanne",
               "gender": 1,
               "credit_id": "52fe4c559251416c75117367",
               "name": "Deborah Zoe",
               "profile_path": "/89QuHw5Gxoi1wLQWAp8iA6o5aKY.jpg",
               "id": 139597,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Josh",
               "gender": 0,
               "credit_id": "52fe4c559251416c7511736b",
               "name": "Lee Kholafai",
               "profile_path": "/aOqGlw5qL1nHcCRkPCn505iDV1P.jpg",
               "id": 928674,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Nico",
               "gender": 0,
               "credit_id": "52fe4c559251416c7511736f",
               "name": "Lanny Joon",
               "profile_path": "/4G0okfvoALMcbvZtnnuoyreVntS.jpg",
               "id": 124495,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Maitre D'",
               "gender": 0,
               "credit_id": "52fe4c559251416c75117373",
               "name": "Angela Shin",
               "profile_path": null,
               "id": 1291951,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Devin",
               "gender": 0,
               "credit_id": "52fe4c559251416c75117377",
               "name": "Clint Brink",
               "profile_path": null,
               "id": 1092011,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c559251416c75117343",
               "name": "Robert Nathan",
               "profile_path": null,
               "id": 171050,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c559251416c75117349",
               "name": "Lukas Kendall",
               "profile_path": null,
               "id": 1163403,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c559251416c7511734f",
               "name": "Robert Nathan",
               "profile_path": null,
               "id": 171050,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.402428,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 180850,
      "vote_count": 13,
      "budget": 0,
      "overview": "Lucky Bastard is a \"found footage\" thriller about a porn website run by Mike (Don McManus) that invites fans to have sex with porn stars. Jay Paulson plays Dave, an eager young fan given a chance to have sex with the fabulous Ashley Saint (Betsy Rue). But everyone gets more than they bargained for in the seemingly mild-mannered Dave... with gruesome results. The film is captured by the \"Lucky Bastard\" porn cameras for a fresh take on the \"found footage\" genre",
      "similar": [],
      "original_title": "Lucky Bastard",
      "runtime": 94,
      "poster_path": "/zd6wl22lGRZZgZmkxwlHVeLkcJo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-02-14",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "This will not end well.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Nathan"],
      "runtime": 94,
      "synopsis": "Darkness. Police explore a crime scene, a San Fernando Valley house. We view the footage of their crime scene video. They find bodies, one after another -- What the hell happened here? One week earlier. The same house. An attractive young woman sits on a couch. This is Casey (Catherine Annette). She is interviewed by Devin (Clint Brink), filming her for an adult video -- but Casey underestimated the appetite of Devin and his cohort Josh (Lee Kholafai) for violent sex. They are interrupted by another porn star, the savvy Ashley Saint (Betsy Rue), who tries to rescue Casey -- but is jumped and assaulted by Josh. It is a violent, terrifying would-be rape. But it is also completely fake. A blooper happens and the performers break out in laughter. Days later, Ashley stops by the company's office to see the proprietor, Mike. Mike invites her to do the companys website Lucky Bastard, in which a lucky fan gets the chance to have sex with a porn star. Ashley flatly refuses, finding the concept loathsome, unsafe and unprofessional -- she is a single mother and her idea of adult content is doing her taxes and shopping at the grocery store. Mike shows her an innocuous application video by one fan, Dave G. (Jay Paulson), and bribes Ashley into the appearance. The company sets out to film the segment. Mike travels in his S.U.V. with Casey and Ashley, as well as Kris (Chris Wylde), the website cameraman, to pick up the contest's winner. Casey, Mikes latest girlfriend/porn star/plaything, asks if she can use a camera as well, and her footage joins with Kriss and cameras in the car to record the proceedings. The crew picks up the Lucky Bastard, Dave G, at the Amtrak station, where Mike and Dave immediately get off on the wrong foot. Dave has worn a Dodgers T-shirt, and Mike chastises him to change it (Major league baseball will sue our balls off!). The extent of Mikes belittling, insulting attitude towards his site's viewers becomes clear. Really? Kris asks. Right off the bat with the contemptuous prick? Inside the car, the filming goes no better: Dave is awkward, trying to please -- but uncomfortable with the interview that Mike insists is part of Lucky Bastard. They take Dave to a restaurant to film him dining with Ashley, where Dave argues that people like him never watch this portion of the website anyway -- we skip to the sex. They're interrupted by the maitre d (Angela Shin) who says they cannot film an adult production on the premises. As Mike argues with the maitre d, Dave tries to talk to Ashley and, in the background, clearly says the wrong thing. Ashley looks horrified, gets up and walks to the car. Ashley explains to Mike that Dave asked her out on a date and knew personal details about her -- what is he, a stalker? Casey suggests that Dave simply apologize, and his heartfelt explanation of being well-meaning and nervous convinces Ashley to give him another shot. The company relocates to a house -- the very same house as in the prologue, which, we learn, was outfitted with cameras for a reality show and thus is set up to film everything that takes place. Ashley and Dave film their sex scene, which becomes a fiasco. Dave climaxes prematurely -- that is, almost immediately, without even taking off his bathrobe -- and pushes Ashley to the floor in a panic. This time, Ashley is furious. She yells at Dave (you cant push a woman!) and rages to Mike that the whole thing is sick and a new personal low. She locks herself in a spare room, effectively freezing the production. Mike pleads with her to let him in. She opens the door and he apologizes, heartfelt; he offers to send Dave home at once and Ashley gratefully agrees. Dave, however, is enraged that he is not being given an opportunity to finish his sex scene -- Im the lucky bastard, he insists. He attempts to steal the video footage of his failure but Mike screams at him (Its mine! I paid for it, you signed the form!) and now Daves humiliation is complete: he has been insulted, belittled, revealed as sexually dysfunctional, physically intimidated, and exposed as weak in every way. And the whole thing is soon to be broadcast on a website. Mike orders his assistant Nico (Lanny Joon) to drive Dave to the station, and Nico -- out of discomfort and fear -- makes the fatal mistake of leaving the car cameras running. You think Im gonna do something? Dave asks. No, Nico replies, Id just feel more comfortable with them on.' Dave has finally had too much: he goes to pee in the bushes -- a ruse to get a rock--comes back, and bashes Nicos head in. Dave is now a monster, unleashed. Back at the house, Mike has summoned a male porn star -- Josh, from the prologue -- to film a scene with Ashley so he at least has something to show on the website. Dave infiltrates the house and, in his rage at being humiliated, one by one stalks, captures, and kills (by baseball bat or handgun) Mike and the crew. Each time, it is a comeuppance for the insults that Dave earlier endured. Finally it is just Ashley and Dave. But she alone has the strength, wits and sex appeal to outwit the deranged Dave. She seduces him, tricking him into untying her. They have sex, and after he climaxes -- whimpering and gentle -- she crushes his genitals, scrambles for the gun, and blows his brains out. She screams a primal scream of agony, then sits, shaken and shocked to be alive. What now? She looks right into the camera, which Dave had left running to film his conquest. She has a wry, angry, knowing look. She has had a complicated emotional relationship with the camera and her role in front of it. For her, that role is over. She gets up and turns the camera OFF.",
      "writers": [
         "Lukas Kendall",
         "Robert Nathan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2417854/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTA5Mzc2MjE1MDleQTJeQWpwZ15BbWU4MDA5MDMzMDEx._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Don McManus",
         "Jay Paulson",
         "Betsy Rue"
      ],
      "reviews": [
         "Lucky Bastard is a \"found footage\" thriller about a porn website run by Mike (Don McManus) that invites fans to have sex with porn stars. Dave (Jay Paulson) is an eager young fan given a chance to have sex with the fabulous Ashley Saint (Betsy Rue). But everyone gets more than they bargained for in the seemingly mild-mannered Dave... with gruesome results. I am not a fan of the found footage subgenre in horror (if this can be called horror). Since its modern birth with \"Blair Witch Project\", few of those entries in this category have been better than average. This, I must say, might be the exception. Not only were the cameras not overly irritating, but it actually made sense for the plot of the film to have so many filming at once. The film starts with a rather graphic sex scene by non-porn standards (perhaps not surprising for a film of this subject matter) involving actress Catherine Annette. Now, this scene notwithstanding, Annette is an actress to watch -- she has excellent screen presence and steals scenes, even eclipsing star Betsy Rue (with all due respect to Rue, who more than holds her own). The nudity is a bit extreme, earning the film an NC-17. But, again, this is about porn so that may be expected. Don McManus is awesome, very funny and I love the beard. He is a veteran actor, though perhaps not well known. He is not going to become much more well known from this film, but he should -- he has a great personality, a great look about him, and he is the one character in this movie I really found myself identifying with (whatever that might say about me). In the background is producer Jim Wynorski, whose involvement is not entirely clear to me. I can frankly say this is the best thing with Wynorski's name on it that I have seen in over a decade, probably longer. Also worth notice is editor Tony Randel, a \"Hellraiser\" veteran. People rarely notice editors, but Randel is worth every penny. Although the plot of this film is rather simple, it was brilliantly scripted. Every camera is accounted for, scenes are made to flesh out characters without dragging on too much. Everyone came to the set ready to act, and this was expertly executed. Well worth a watch.",
         "Looking at the crazy title, I didn't watch this movie title for weeks after the release. A member in a movie discussion forum posted naked scenes of actress Catherine Annette. Though the first few mins of this movie is slow, I failed to move away...never seen story, limited characters but story is impressive. You will surely love it! The movie starts with crazy bondage sex scene with beautiful actress Catherine Annette (I guess she never done it before and will never do it again)! A simple character turns a big villain changes the story unexpectedly!... While the other reviewers written differently , I suggest you to watch full movie! I love to see sequel for this movie again!",
         "I was expecting a very low budget flick with bad acting filmed on a camera phone. A soft porn disguising itself as a thriller. Not even sure why I watched except something in the trailer told me maybe I was wrong. And I was. Now I'm not going to claim this was great art or anything but it was entertaining and kept my interest til the end. I'm not much for found footage movies, can't stand them really but they did find a way to use a better quality then most by having it take place in a reality show house equipped with cameras everywhere. I think that really helped me enjoy this \"found footage\" So don't let the FF term keep you from watching. I expected acting to be on the porn level but found it to be much better and believable. The dude who played the lucky bastard was really good. Both when he played the shy kind of frustrated nerd all the way through to the other side. I think I enjoyed his performance most, watching that transition and thinking of the frustrated nerds I've known. Yeah I could see that happening! Overall a decent flick, much better then I thought it would be. I'll give it a 6/10",
         "Robert Nathan's Lucky Bastard fought strict censor restrictions in order to keep its NC-17 rating, effectively making it the first NC-17 found footage film ever made. Wisely so, because an R-rated Lucky Bastard would've been far more inferior than the NC-17 version we got as the final cut. Despite the film being exercised in the genre I run hot and cold with, Lucky Bastard finds incredible ways to be a gripping and suspenseful outing on a genre I wouldn't completely give up on just yet. Just last night, I watched Earth to Echo, a new found-footage adventure for young children that serves as this generation's E.T.. Not only am I fully confident in saying that this is the first and only time the mention of that film and Lucky Bastard will appear in the same review, but I am also saying that through these two films, I have found a reinvigorated sense of what the found footage genre can be if direction and approach are placed in the forefront of the film over gimmicky ideas and momentarily substantial little quirks. Both films have the ability to leave lasting impressions on viewers, especially Lucky Bastard in its often dirty and deeply disturbing nature. Following lowlit shots of a crime scene, the film opens where a young, attractive woman named Casey (Catherine Annette) is being interview for a potential porn video by two men. Shortly after the interview, we see her being viciously raped until another porn star named Ashley Saint (Betsy Rue) walks into the home before becoming overpowered by both of the men. However, a flub by one of the men causes for the staged porn shoot to cut, which is then when we see how this entire setup works. These \"rape porn\" videos are shot by a loyal cameraman and managed by the cocky and sleazy producer Mike (Don McManus), who is also dating Casey, but of course not exclusively. Following the shoot, Mike approaches Ashley about the idea of doing a shoot for his \"Lucky Bastard\" website, a site where a random and ambitious fan and subscriber of the series is picked to have sex with a porn star. After much convincing, being that some of Ashley's rules in the industry are no anal sex and no amateurs, she finally agrees, recognizing that she has two young children and several bills that need to be paid. The applicant they settle on is \"Dave G.\" (Jay Paulson), a shy and squirrelly soul, who is clearly nervous about his first time being on camera and shaken when in the presence of the beautiful Ashley. Little else about the film can be said without leading into grave spoiler territory accept that Dave's behavior eventually begins to take a toll on the cast and crew of the \"Lucky Bastard\" shoot, leading to some incredibly unforeseen consequences. Lucky Bastard defines the rich elements of unpredictability in a film, so much so that just when you think screenwriters Lukas Kendall and Nathan are writing themselves into a corner, they miraculously find a way out and are able to construct another intricate and tense setup just as gripping as the first. Nathan fearlessly orchestrates this idea to the fullest extent, not only bringing to life the smuttiness of the porn industry, but also emphasizing that we (you know who you are) are the people that keep this industry in business. Because we crave and view strange and off-kilter pornography like this is why guys like these are in the business. Should we feel ashamed or should we keep on buying lotion and watching? In reviewers' rants about why Lucky Bastard somehow suffers from a lack of originality, let's hope they don't forget to recognize the great performances at hand here that come from more than Betsy Rue as the porn star, who clearly isn't a helpless, damsel in distress. The performance of the hour comes from Don McManus, who delivers the role of a sleazeball porn producer to such extreme effect, whether he's using his slickness to propel a scene forward, anger to scold and demean, or fear to convince and persuade. McManus shows the extreme diversity of an actor's emotional leverage in one, ninety minute project to the degree that some have a hard time conveying in over a decade in the business. Then there's Paulson, who we can't forget, plays the role of the innocuous and sweet man who doesn't know any better to a vindictive soul with similar leverage and effect to McManus. The unexpectedly refined and winning performances are what keeps Lucky Bastard engaging throughout. However, what keeps the film riveting, never boring, and a rousing great time is just the episodic structure of scenes you didn't expect or predict flowing so well together to create an intense and gripping final product. There is such a cluster of clever ideas and a barrage of different camera angles that work to make the film a consistently exciting great time. Few first time directors can make such an ambitious, gifted product, but Nathan - whose credits include working on the original staffs for shows like ER and Law & Order - uses incredible realism and quietly-vocalized questions to his advantage, creating a tense and well-structured piece of cinema from a genre I previously thought was long gone dead. Starring: Don McManus, Jay Paulson, Betsy Rue, Chris Wylde, Catherine Annette, Lee Kholafai, and Lanny Joon. Directed by: Robert Nathan.",
         "From the perspective of a life-long die-hard movie enthusiast, I really enjoyed Lucky Bastard and find myself surprisingly haunted by some of the imagery and the darkness of the story's main antagonist. It would be easy to dismiss Lucky Bastard as something trite and low-brow and seemingly not worth the time to pop some corn. Any movie in which the backdrop is the adult film industry suffers an immediate stigma and a lot of closed minds unwilling to consider it as a legitimate movie-going experience. That is unfortunate because there is much to treasure here, from the frequently hilarious dialogue to the spot-on performance of Don McManus to the shocking moments of violence that seem totally plausible in today's world. Lucky Bastard is a highly entertaining exercise in the found-footage genre, lending the impression that we are watching real people in a real situation. Unlike other found-footage movies that focus on the supernatural and therefore become questionable in their realism, Lucky Bastard unfolds with specific and tangible reality. Some may question the acting ability of the cast, but don't be fooled by knee jerk critical reactions. These actors know what they're doing to sell the concept of the movie, as do the artists behind the camera. The very premise, that of a young man who wins a date with his favorite adult film star and visits the set of an adult website to perform in a scene, is 200% believable in the p*rn-saturated cyber reality we live in today. And if you're paying attention, the movie addresses something far beyond the on-screen dalliances of a hopeful everyman and his dream woman. It's ultimately about the dangers of exploitation and the risk of gleefully humiliating so-called geeks, people we label without really knowing them or what they are capable of unleashing. When you consider the facts of today's world in which troubled young people walk into shopping malls and schools and IHOPs to open fire with automatic weapons, Lucky Bastard presents a disturbingly potential reality of what can and does happen when you don't know what you're really dealing with. To give away Lucky Bastard's plot turns would do a disservice to the prospective viewer. I would simply say give the movie a shot if you want to be entertained, amused, titillated, and ultimately shocked. The movie will gently carry you along for a while, making you laugh, misleading you into a lazy state of casual observation until the first shock comes. The latter half of the film is far from humorous, and there are moments that will resonate, especially when you think about the internet-obsessed guy next door who seems harmless yet a little creepy. Lucky Bastard puts a fresh spin on the found-footage genre and is effective in delivering laughs, surprises, and an ick factor that you'll think about after it's over. It's also worth mentioning that it's one of the few thrillers I can think of that delivers gruesome events in bright daylight, and that stylistic choice really stood out to me and helps distinguish Lucky Bastard as a unique and believable tale. I think this movie has a very strong appeal to a young, hip audience, and I'm really hoping it can get the attention it deserves and rise above those who would carelessly dismiss it. Check it out!",
         "This movie was absolutely terrible. Save your money. If pretentiousness has ever been necessary in describing a film, this would be a prime example. It seems the only people that actually enjoyed this movie are those closely involved in its production. I'm sorry, but pornography and 'lost footage' just don't gel together to make a satisfying experience (I never felt 90 minutes go by this slowly). While attention to detail was evidently the focus during filming, the product as a whole is easily defeated by a lack of focus in polishing the script. However, in contrast to the odd subject matter, I seriously don't think it would have made a difference. If you want a great film that involves pornography, simply save your hard-earned dollars and go rent Boogie Nights (1997).",
         "After excitedly ordering this movie, I was finally able to view it last weekend. Both I and my co-viewer thought it was excellently acted and a suspenseful flick which was surprisingly better than we both expected. My viewing tastes tend toward edgy fare and I collect NC-17 rated movies (which are too few and far between unfortunately), and this is one of the best I have seen in the last couple of years. The production value was good and was obviously not hindered by budget. My favorite character was Ashley, nothing like a kick-ass no-holds-barred female to command attention. Kudos to the actors, writers, and director--great job! P.S., let the haters hate; they are going to anyway. I always have to wonder why people comment on films that they haven't even seen--why do we care about your opinion based on nothing but your own personal bias? Watch the movie, THEN comment.",
         "'Lucky Bastard' is a porn website that invites its members to have sex on camera.Shy and awkward Dave G. is chosen by porn producer Mike to have sex with porn star Ashley Saint.But it seems that Dave G. is not as innocent as he appears.I must say that I quite enjoyed \"Lucky Bastard\".It's a surprisingly clever and absorbing found footage thriller with plenty of sexual activity and graphic nudity.The acting by Don McManus,Jay Paulson and Betsy Rue is especially remarkable.The script offers some surprises,unfortunately the film should be more tense.Still if you are tired of conventional found footage horror/thrillers you may give \"Lucky Bastard\" a chance.7 murders out of 10.",
         "Smarmy, burnt out middle-aged porn king Mike (Don McManus) runs his own adult film empire in L.A. that specialize in things like live streaming rape-fantasy scenarios. One of their other sites - \"Lucky Bastard\" - offers subscribers a chance to come in and film a sex scene with one of their actresses. Site favorite Ashley Saint (Betsy Rue), a single mother of two who's not lived a charmed life and adopted a tough exterior as a result, decides to do the job for 1500 bucks. They screen a bunch of applicants who send in submission videos and finally settle on an awkward, geeky redhead named David G. (Jay Paulson), who claims to be well-educated and an army vet. Once David is picked up for the shoot, his odd behavior and constantly- changing stories raise some red flags for the perceptive porn queen, who's faced a dangerous stalker in the past and knows David fits the m.o., but her suspicions are all but ignored by everyone else. They - along with a few cameramen (David Wylde, Lanny Joon) - then go to a rented Hollywood hills mansion filled with surveillance cameras for the shoot and then things take a violent turn. After David finds himself unable to perform for the cameras (well, he actually \"performs\" a little too quickly if you catch my drift) and is exposed as a virgin, he's humiliated and mocked by the crew, Ashley refuses to \"act\" with him a second time and Mike kicks him out of the mansion. They'll all soon regret their cruel treatment of the already- unhinged amateur when he comes back armed and ready to kill in order to retrieve the embarrassing footage he did shoot. Also getting caught up in the crossfire are Casey (Catherine Annette), Mike's much-younger porn starlet girlfriend who's fighting a losing battle trying to prove she's more than just a piece of ass, as well as a bitchy real estate agent (Deborah Zoe) who apparently rents properties by the hour and the porn stud (Lee Kholafai) called in to replace David. If you're sick of found footage movies and mockumentaries set in dreary abandoned asylums and dark haunted houses, this at least marks a change of pace to that played-out formula. Aside from some crime scene footage at the beginning telling the eventual fates of some of the characters, it's filmed entirely during the day in bright, sunny California. Unlike most other films of this type, there's fairly strong acting (especially from Rue and McManus) and a decent (though dialogue-heavy) screenplay. If you've ever seen any behind- the-scenes footage on adult film sets or documentaries about the people who make and act in these kinds of films, you'll realize just how well- researched this is. The characters in this one are believable personalities that are true to life and each are fairly well-defined and fleshed out. The thriller / horror elements and violent backlash of the psycho toward the end are, unfortunately, far less taut and disturbing than I think the filmmakers intended, mostly due to the shooting format. I'm not really sure the \"found footage\" route was the right way to go for this kind of material. There's clearly a message being conveyed here, so at least this has a focused point of view and something to say. There's an opening text that tells us \"For too long the adult entertainment industry has pushed the boundaries not only of obscenity but common sense. Those who play with fire... eventually get burned.\" That in itself sets this up as message movie meant to expose the dangers of the porn industry. Fair enough. The film does develop a sort of victim / victimizer parallel between the money-centered porn veterans who are completely resigned to what they do and the fresh faces in the industry who are treated as being disposable with no regard whatsoever for their feelings. Again, this seems somewhat true to the industry based on what I've heard from many - though not all - of the people who have worked in the industry. One thing that did take me by surprise was that this was directed and co-written by an extremely successful TV producer with five Emmy nominations to his name and not an ambitious amateur like I initially thought. The producer was prolific B movie / soft corn porn king Jim Wynorski, and this is certainly more thoughtful than the brainless T&A films he's typically associated with. Because of full frontal male and female nudity, lots of raunchy dialogue and two simulated sex scenes (which are about on par with what you'll see late night on Cinemax these days), this earned itself an NC- 17 rating. That unintended irony there is that this rating is likely to draw in a crowd of viewers who might not like - or will even be offended by - what this has to say.",
         "Sometimes, \"found footage\" films feel like the writers/directors were just trying to cash in on a craze and make a film that doesn't necessarily require a script in order to get a big return or just get a film out there\u0085and sometimes they're even worse. \"Lucky Bastard\" is a thriller with no thrills and a horror with no scares. The actors looked lost on who exactly their characters are suppose to be and just, instead, settle for cheesy acting, it seems like the director had no idea about yelling \"cut\" or having the editor trim scenes, and the entire concept of bringing in tension was entirely foreign to the production. The entire film is just one long and terrifyingly bad example of how to not make a thriller. Every scene lasts way too long and the actors look like they are trying, and failing miserably, at improvising every scene. Then, as if the production was literally trying to make an awful film, they only include the moments that are, on paper, meant to be the thrilling part near the end of the film. The film wastes an entire hour without establishing anything but the most basic of its premises and completely forgetting to seed the ground in order for terror to sprout. \"Lucky Bastard\" only had one thing in its favor\u0085it cured my insomnia. Hello! My name is Rev. Ron and if you feel like reading more of my rants, ramblings, geek references, bad jokes, and other movie reviews (like a more in-depth look at \"Lucky Bastard\" and other films that actually remember to include the frightening stuff) you can visit my blog at revronmovies.blogspot.com. If you hate me now because my opinion on this film differed from yours, you don't need to visit."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Vineyard Haven"],
      "summaries": [
         "Lucky Bastard is a \"found footage\" thriller about a porn website run by Mike (Don McManus) that invites fans to have sex with porn stars. Jay Paulson plays Dave, an eager young fan given a chance to have sex with the fabulous Ashley Saint (Betsy Rue). But everyone gets more than they bargained for in the seemingly mild-mannered Dave... with gruesome results. The film is captured by the \"Lucky Bastard\" porn cameras for a fresh take on the \"found footage\" genre.",
         "A fan is invited to take part in a porn video with his favourite porn star. He is romantically rejected, and goes on a killing spree on location."
      ],
      "budget": 0
   },
   "movielensId": 173371,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-02-14",
      "dvdReleaseDate": null,
      "directors": ["Robert Nathan"],
      "runtime": 94,
      "movieId": 173371,
      "title": "Lucky Bastard",
      "mpaa": "NC-17",
      "actors": [
         "Betsy Rue",
         "Don McManus",
         "Chris Wylde",
         "Jay Paulson",
         "Catherine Annette",
         "Deborah Zoe",
         "Lee Kholafai",
         "Lanny Joon",
         "Angela Shin",
         "Clint Brink"
      ],
      "imdbMovieId": "2417854",
      "originalTitle": "Lucky Bastard",
      "genres": [
         "Thriller",
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Lucky Bastard is a \"found footage\" thriller about a porn website run by Mike (Don McManus) that invites fans to have sex with porn stars. Jay Paulson plays Dave, an eager young fan given a chance to have sex with the fabulous Ashley Saint (Betsy Rue). But everyone gets more than they bargained for in the seemingly mild-mannered Dave... with gruesome results. The film is captured by the \"Lucky Bastard\" porn cameras for a fresh take on the \"found footage\" genre",
      "tmdbMovieId": 180850,
      "avgRating": 1.75,
      "releaseYear": "2014",
      "numRatings": 2,
      "posterPath": "/zd6wl22lGRZZgZmkxwlHVeLkcJo.jpg"
   }
}