{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0087537",
      "video": false,
      "title": "Chaos",
      "recommendations": [4500],
      "backdrop_path": "/62ccituMurNYkw73iwRQot11YOQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "52fe469b9251416c91059dd5",
               "name": "Franco Franchi",
               "profile_path": "/A2vthWrCZQYWOpsi0eKu6VvGEsy.jpg",
               "id": 127040,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "52fe469b9251416c91059dd9",
               "name": "Ciccio Ingrassia",
               "profile_path": "/qUAEOlrZk2e6U5mnEeomcLFfvx7.jpg",
               "id": 53462,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "52fe469b9251416c91059ddd",
               "name": "Omero Antonutti",
               "profile_path": "/n56lKaO4eyFTEgvqCxNoXFDW6Mw.jpg",
               "id": 27208,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "52fe469b9251416c91059de1",
               "name": "Claudio Bigagli",
               "profile_path": "/c2HBprEaFtHQsWOKr2SEXKjGcE2.jpg",
               "id": 119950,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "52fe469b9251416c91059de5",
               "name": "Massimo Bonetti",
               "profile_path": "/6UnOH3XPGJHDJfZRm0674HmGcfO.jpg",
               "id": 128250,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "52fe469b9251416c91059de9",
               "name": "Tony Sperandeo",
               "profile_path": "/55uYr7gWmI92nYQIcebZkTI2dMf.jpg",
               "id": 126975,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 1,
               "credit_id": "52fe469b9251416c91059ded",
               "name": "Margarita Lozano",
               "profile_path": "/d4RgbbQMfRJ2K3bOF8B2mpGoYMl.jpg",
               "id": 16314,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "52fe469b9251416c91059df1",
               "name": "Orazio Torrisi",
               "profile_path": null,
               "id": 1091591,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "52fe469b9251416c91059df5",
               "name": "Carlo Cartier",
               "profile_path": "/A2qOKNy44D3ooVyLmYEQfzC0kL7.jpg",
               "id": 147165,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "52fe469b9251416c91059df9",
               "name": "Biagio Barone",
               "profile_path": null,
               "id": 147152,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "52fe469b9251416c91059dfd",
               "name": "Laura Mollica",
               "profile_path": null,
               "id": 1288760,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 2,
               "credit_id": "5a9c8113c3a3680bb903595a",
               "name": "Domenico Gennaro",
               "profile_path": "/uIlHQ3JTUvT8DO9x1kQBMAMu4yN.jpg",
               "id": 553182,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 0,
               "credit_id": "5a9c814a0e0a2605c60387ca",
               "name": "Giovanni Marsala",
               "profile_path": "/fOfzWhW1wose8eESL0knX0ZLo3n.jpg",
               "id": 1884406,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe469b9251416c91059da1",
               "name": "Vittorio Taviani",
               "profile_path": "/m6LbjdSX1gBkckAHxtvM4TSESsy.jpg",
               "id": 24281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe469b9251416c91059da7",
               "name": "Paolo Taviani",
               "profile_path": "/su9WmmAKq43ICIFxRlbAQIE3qwQ.jpg",
               "id": 24279,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe469b9251416c91059dad",
               "name": "Paolo Taviani",
               "profile_path": "/su9WmmAKq43ICIFxRlbAQIE3qwQ.jpg",
               "id": 24279,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469b9251416c91059db3",
               "name": "Vittorio Taviani",
               "profile_path": "/m6LbjdSX1gBkckAHxtvM4TSESsy.jpg",
               "id": 24281,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469b9251416c91059db9",
               "name": "Luigi Pirandello",
               "profile_path": null,
               "id": 1202096,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe469b9251416c91059dbf",
               "name": "Tonino Guerra",
               "profile_path": "/5fO9Jrbnp0LbvVisSXhLJiVvxaL.jpg",
               "id": 15191,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469b9251416c91059dc5",
               "name": "Giuliani G. De Negri",
               "profile_path": null,
               "id": 332350,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe469b9251416c91059dcb",
               "name": "Nicola Piovani",
               "profile_path": "/1TY1fOqJiv3KqxQdVyUdbMqwabM.jpg",
               "id": 9245,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469b9251416c91059dd1",
               "name": "Giuseppe Lanci",
               "profile_path": null,
               "id": 24287,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.336726,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 38164,
      "vote_count": 6,
      "budget": 0,
      "overview": "Five stories center around a werewolf, a feudal landlord, peasants, a ghost, and a mother and her sons.",
      "similar": [],
      "original_title": "Kaos",
      "runtime": 188,
      "poster_path": "/c5TgKbwMclmFMPnwxOjVMbFdx0E.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Filmtre",
            "id": 28504,
            "origin_country": ""
         },
         {
            "logo_path": "/4VVSVkcclvNiYzEO8Pxi7CxeiBt.png",
            "name": "RAI 1",
            "id": 7398,
            "origin_country": "IT"
         }
      ],
      "release_date": "1984-11-22",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Paolo Taviani",
         "Vittorio Taviani"
      ],
      "runtime": 188,
      "synopsis": null,
      "writers": [
         "Luigi Pirandello",
         "Paolo Taviani"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0087537/",
      "coverLink": null,
      "actors": [
         "Margarita Lozano",
         "Orazio Torrisi",
         "Carlo Cartier"
      ],
      "reviews": [
         "Just wanted to add a brief comment that Kaos is the name of the estate that Pirandello grew up in and I believe also spent the last part of his life in. It's set in a gorgeous dramatic location - seeing it gives you a heightened sense of his perception of the world. The two or three buildings sit on top of a cliff that faces another cliff and the two face the ocean. Pirandello is buried there under a favorite evergreen. Unfortunately, that tree blew away in a coastal storm in fall of 1997.",
         "The Taviani Brothers evoke the mystery, drama, and stark beauty of Sicily in this wondrous three-hour film, with its four earthy stories and sublime epilogue. In \"The Other Son\" a demented Sicilian mother (Margarita Lozano) longs to hear from her sons who have emigrated to American and forgotten her,. Memories of a traumatic rape experience as a young woman prevent her from being able to accept the love of her only devoted son who follows her around with his cows. \"Moon Sickness\" tells about a young bride who discovers that her husband likes to howl at the full moon. She is not without an erotic moonsickness of her own which makes her crave sex wit her cousin when the husband is unable to perform his marital duties. \"The Jar\" features comedians Franco Franchi and Ciccio Ingrassia in a classic comic narrative about a mean landowner's large broken olive jar and the jar-mender who gets trapped inside and their ensuing battle of wits. \"Requiem\" deals with rural shepherds who want to have a graveyard to bury thir dead. In the epilogue \"Conversation with Mother\", we see playwright/storyteller Luigi Pirandello returning to his native Sicilian town after years of success on the mainland. He encounters the spirit of his mother who recounts a fabulous fairy-tale journey taken when she had been a child. It is a stunning twenty-minute sequence that must surely rank with the best moments in the history of Italian cinema. The images of the children rolling down the mountain of pumice on the \"Pumice Island\" are of a poetic lyric intensity. The shot of Pirandello sitting silently in the chair that no longer contains the mother he had been speaking to is also utterly moving. Nicola Piovani's passionate and transporting musical score (he would later do the music for LIFE IS BEAUTIFUL)adds immeasurably to the the experience of this powerful work of art.",
         "Once Sicily was the center of our western world, and this film shows us all the beauties of far, far away, together with a Pastorale worthy of a Beethoven Symphony. No No, Nicola Piovani composed the unforgettable music all by himself. This film is timeless, with an imagery, thanks to master Giuseppe Lanci, that is as well sober as breathtakingly beautiful. There is not one weak actor and the stories are from Luigi Pirandello, who aimed to make one gorgeous novella for each day of the year. KAOS of the Taviani-brothers could, or maybe even should, be watched every day of the week. This must truly be the most beautiful cinematic achievement ever.",
         "Kaos is one obvious masterpiece of the Taviani brothers. Unfortunately I can not explain the title. But I don't think there is a clear explanation or important message in any of the stories either, in contrast with Kobayashi's Kwaidan (1964), which consists clearly of four stories about ghosts. Kaos seems to deal with family or legacy in general. There are five fairy-tales from Luigi Pirandello about ordinary people and the curious small worlds (or illusions) they find themselves in. I'm not going to reveal exactly what happens in the stories. It's just fantastic and a little nostalgic to watch the strange events and behaviour of different people for three hours without fancy special FX. Credit to cinematographer Giuseppe Lanci (Nostalghia, 1983) and composer Nicola Piovani of course, who did a surpassing job. The performances of the actors are great and never overdone. That wouldn't be appropriate for such a sober work of cinema that could have taken place 200 years ago. It may be not an important film, but it IS unforgettable, timeless and will become one of your personal favourites. 10 points out of 10 :-)",
         "\"Kaos\" (Italian, 1984): Told are five stories, separate but woven together by location (an incredible, ancient, crumbling, sun bleached land) and other unique poetic devices. They are told over 188 minutes. I suggest a short break after each story. They are all unique. Each has separate value, and is worth absorbing. Directed by Paolo & Vittorio Taviani. These unsentimental folk tales are loaded with humanity's weakness, strength, silliness, pettiness, and plenty of important symbolic lessons ALWAYS worth chewing on. When our Old People aren't there to pass along these lessons, at least we have the film makers. The screen is our fire. The seats are our logs. The film team is our story teller. The darkened room is our night.",
         "Artfully directed, lusciously photographed, and magnificent scored (in fact, I would say Nicola Piovani's music for this movie is some of the finest I've ever heard in my life), \"Kaos\" nevertheless leaves something to be desired when it comes to the five tales it tells. The first one, \"L'Altro Figlio\", is the strongest one emotionally, but it's also quite predictable after a point; you will guess why the mother has denounced her \"other son\" before it is revealed. The second, \"Mal Di Luna\", has an intriguing premise, but goes pretty much nowhere with it; when it's over, we're back to where we started. The third, \"La Giara\", is surprisingly my favorite: it's too slowly paced to work as a comedy, but it works better as an allegory, and it builds to an exhilarating musical sequence that is better seen than described. Besides, it's fascinating to watch the famous Italian comic duo Franco and Ciccio, both noticeably older, acting more mature than you may have ever seen them before! The fourth tale, \"Requiem\", is, frankly, tedious, and the weakest of the five. The epilogue, \"Colloquio Con La Madre\", is the part I was most looking forward to, mainly because of Pauline Kael's description of it as a \"full-blown epiphany that sends you out dazed and happy\". It takes quite some time to reach to that point, but yes, the way this story captures a life-defining moment of sheer happiness will stay in my mind for a long time. Despite my reservations, the experience of seeing and, above all, listening to this movie is not one to be missed. *** out of 4.",
         "Yes, there's four films with an epilogue.. But there's also a prologue! Don't you remember when the peasants walks in the mountains, and then found a male bird laying on eggs? \"You rascal! You shouldn't lay on eggs!\" And then they began to throw the eggs on the poor bird. Suddenly, someone yells: \"Stop!\" and then binds a bell around the bird neck and throws it up in the air and yells: \"Musica!\" (Music in Italian) This bird is seen between the short films, and you can even hear the bell!! After this, \"L'altro figlio\" (The other son) begins.. Yes, this film is a truly masterpiece and my number one film!! I've seen it 24 or 25 times now. Sometimes, I close my eyes and just listen to the beautiful Italian language..",
         "Which, unfortunately is impossible for three hours. I've seen it two times in the cinema. The characters are so good, and are given all the time and space to develop starting with MariaGrazia. I really can't think of a movie that's made with more love and dedication. La Giara is a rare but welcome break and watch how Franchi and Ingrassia interact, watch the beauty of baby Bata's eyes in Mal di Luna. Just find out all those details and you won't be disappointed. Having seen Italy after watching KAOS was a feast of recognition, it's really like that, the villages where time stands still, the people, go and see it and you won't be disappointed.",
         "I watched this film twice in the 1980s -I think on BBC-but it may have been on channel 4 at the time and was completely captivated by it. it has a haunting quality to it that is hard to surpass and will always stay with you.. Nicola Piovanni composed the music sound score and this Maestro of Music to mood -(see if you can, Caro Diario -Dear Diary Dir.Nanni Moretti as a more modern example of the art) is virtually unknown to the general public over here . Very Sad!.. It is also a complete nonsense that in this technically advanced digital age it is impossible to find a print of this CLASSIC movie -that all film buffs really ought to see-with English SUBTITLES! Spanish ,French and Dutch subtitle versions are around and findable on DVD but ALAS... non comprarlo Inglese!-How Insular! In addition, A Bande Originale -Soundtrack \"KAOS\" was released on Cd in the early 90s on the Milan label (Europe-USA and S.America?), but again the niche British public not catered for. Bizarrely, when shown on TV in the 80s the movie carried English subtitles-so how does this work then? Anyway back to the film. Enjoy the opening visually stunning shots of the Crow \"eagling\" its way through mountain landscape and let the accompanying music sink in and you're hooked!.without going into detail-thats for you to discover-the Taviani Bros really bring out the spiritual essence of the Sicilian persona characterised in Pirandello's daily Novellas.It is a flighted sentiment soaring over a gravitated earthy reality-Sicilian Style.This is Cinema at its most alluring.Do see it if it becomes available.",
         "This is in my opinion the best movie ever made about Mediterranean. I think it transgresses the boundaries of the art of film and confronts the viewer with the essential void and the chaos of the world. And does that from the place from which the human civilization entered the world but which is almost deserted and alone in front of the great blue abyss. That place is isolated and cruel but also full of uniquely intense life and nostalgic beauty. The music is perfect and the light is as it should be: sharp and devastating. Don't miss this one if you have the opportunity to see it! One of the movies which change your view on the world.",
         "I watched Kaos last night for my Italian Culture class. There are 4 parts but the first 3 struck me particularly. The first one \"L'otro Figlio\" or \"The Other Son\" was a sad story but I really liked it. The main character for this segment, Mariagracia, gave a riveting performance. The second story \"Mal di Luna\" or \"Moon Sickness\" is a werewolf story. This is where the movie starts to get a bit bizarre. Newlyweds Sidora and Bata live in the sicilian countryside and every full moon, Bata is enchanted by the moon and it rules him. He howls and barks like a wolf and it causes him great pain. Sidora totally freaks out and doesn't stand by him at all... The third story \"La Giara\" or \"The Jar\" is extremely bizarre but I found it entertaining. This guy named Don Lollo who looks like what Mick Jagger would look like if he were an Italian man, acquires this huge clay jar that the town will put olive oil in. One night they come out and it's broken into 2 pieces. As a result, Don Lollo hires this eccentric potter to come fix this jar with his \"magic glue\" After a long series of events, the mad potter gets stuck inside the jar. It ends up being pretty funny... All in all, I liked it. I think the editing between stories could've used a little work, but overall I thought the settings seemed very realistic. I really like the creative shots that the movie had. Most of the people seem like real sicilian people, not just random actors. I will rate it 8 out of 10 :) ********",
         "\"Kaos\" has been the movie that has marked the return of Franco Franchi and Ciccio Ingrassia to the cinema, after a parenthesis of some years, during which they had above all participated to variety in television. Shows of happening that they had allowed the two actors to resume their classic repertory that, to the cinema, seemed not to have more much space. \"Kaos\" has represented for Franco Franchi and Ciccio Ingrassia the definitive attestation of their interpretative abilities, already appreciated from the public who had them always follows, but does not from the critics, that placing them in that comedians zone, above all those coming from the Avanspettacolo, in which Toto' was passed also. Perhaps has been a sign of the destiny that Franco Franchi and Ciccio Ingrassia has had their higher professional acknowledgment interpreting the transposition of a story - \"La Giara\" - of writer Luigi Pirandello, sicilian, born to Agrigento (Akragas). Who best of Franco could have interpreted the craftsman who materially does not succeed to get rid from the obtained result thanks to its abilities? Who best of Ciccio could have interpreted the owner of that good that cannot use? \"La Giara\" it is the metaphor of that impossibility to use a good (the art of the comedy) that Franco and Ciccio possessed, but of which they could not draw all the benefits: the acknowledgments of the critic.",
         "i viewed the three stories again when going to Sicily for a holiday. the films capture the heat, the beauty, the sweetness, the bitterness, the poorness, the dryness, the variation, the spell. the movies are great and the country and the people are even greater.",
         "I saw Kaos, yesterday evening with friends who didn't know it or don't remember it. At this time, Italian cinema produces masterpieces. The emotional power acts after years, specially during the \"novel\" ends this movie, when Pirandello : at his top, comes back into the family house, re-open it, sees again, the only women he loves and remembers his trip, his family, his feelings : the splendor of childhood, the wildness of this isle, the warm of being protected & loved by his entire family in dramatic circumstances... Well : the music was written by Mozart himself. The beginning of this part is a kind of \"Sergio Leone period : once upon in time...\" a western like \"I\"m back\" without guns and an harmonica. No action, but only emotion which grows again & again My POW ? A very great movie upon Sicilia, Mens, Women, family, land... See by two directors who knows emotion in movies are more important than 3D effects... God (Ford & Griffith) bless them Sorry my American & English are poor, but I'm just a french guy. See this movie and enjoy it (don't forget a bunch of Kleenex) you will never see that again.",
         "My experience watching \"Kaos\" was not as rapturous as that of many who have reviewed it here. This is not, by any means, a bad movie, but it does have some shortcomings that marred the overall impression for me. Among the movie's strengths are its high production values, as evidenced by the gorgeous photography (including wonderful aerial shots of mountainous crags and deep valleys), meticulously assembled locations (invoking the poverty of the region so perfectly that they must have cost a lot of money), and the lovely music that punctuates and provides transitions among the various stories. It's obvious that this is a team that spared no expense or effort to create the best film they could. The movie's primary weakness --and it is not a small one-- is that the stories are neither particularly engrossing, nor are they told in a way that creates any real suspense for the viewer (including the viewer who has read not one word of Pirandello). The script blends humor and pathos in an interesting way, but somehow there isn't much depth to the performances, all of which are competent if not electrifying. Joined to the weakness of the stories one must also note the bloated length of the movie. There are doubtless many ways that this film could have been edited down into something less unwieldy, but none of them seem to have been given any real consideration in the design or execution of \"Kaos.\" Thus we are left with an endurance test of sorts -- one which dilutes rather than strengthening the overall impact of the movie. People who have been ordered by their physicians to avoid stress at all costs will find this gentle and attractive movie easy to watch; those who yearn for stronger, tighter and more challenging stuff on their screens will not be overly impressed by \"Kaos.\"",
         "Four Pirandello stories and an original epilogue form a portrait of Sicily, linked by the flight of a raven - bird of ill omen - over the landscape with a tinkling bell around its neck. The film-making is perfect in its calm effortlessness and quiet simplicity, always finding the essence of a situation. Often, the camera makes small, revealing horizontal pans, then pans back and reveals again, as the first subject has changed. Every episode is infused with a sympathy for whatever simple inescapable sorrow everyone is afflicted with - peasants, grandees, men in uniform - which often seems to seep into them from the land. Even the happiest character in the film - a lawyer - is in bed recovering from an operation. Each story has layers of meaning and a melancholy twist - even the comedic episode finishes on a note of tragedy. The first story opens as the country is being drained of its men - they're off the America - leaving the parched landscape to the sullen women. An interesting moral dilemma is raised: how if a woman is raped by her husband's murderer and has a child which grows up to look exactly like its father? The bitter irreconcilability stands for the rift between the old land and the new. In the second story, possibly the finest, a newly married woman discovers that her husband goes berserk, wolf-man like, every full moon. She uses the occasion as an excuse to bring her former lover to her room while her husband rages outside. There's a step forward in the moral arc of the film - reconciliation is possible when you come to understand someone else's suffering. The Jar is remarkable, not so much for the diabolic overtones of the hunchback who gets trapped inside the giant olive jar he has just mended, as for the surprising bitterness of the landlord whose success is made mockery of by thoughts of death. Death itself is the subject of the fourth story in which an old man sits over his grave and literally waits for it to come in order to lay claim to the land he will be buried in. Since the land, on which generations become established, becomes in effect composed of the dead, there is a subtle moral question of a man's rights here, suffused with ghostly mysticism - an issue we have lost sight of in the modern world. The Epilogue is almost too sublime to describe. It may be the most perfect, most meaningful 20 minutes ever put on film. In it, Pirandello himself, weary now of life, travels to his childhood home in Sicily, drawn by the spirit of his mother. She tells him again the story of the journey into exile by boat when she was a girl, only this time filling in some crucial forgotten detail. The span of time held in our mind here is breathtaking - backwards from an old woman long dead who is reflecting on the memory of an intense childhood experience; forwards to her son, now old himself and aware of his own impending death, trying to capture some meaning in it all that is the spark of life, knowing that this spark itself will soon go out. The climax to his mother's story - cascading down a white cliff of powdery white pumice into an azure sea is an image so beautiful, so mixed of elation and despair, that no more words in the film are possible, nor necessary.",
         "There's no shortage of whimsy, enchantment or madness in this quartet of stories from backwoods Sicily, adapted from the writings of Luigi Pirandello. In the first a troubled old woman recounts a painful episode from her past and explains why she can no longer face her only honest son; the second tells of a newly married husband afflicted with insane, bestial longings each month during the full moon; a hunchbacked handyman in another story mends a large terracotta jar using a magic adhesive, only to find himself unable to climb out from inside it. There's no unifying thread between each segment besides an obvious love of folk tales and filmmaking, and the lack of any consistent narrative focus can make the three-plus hour running time a major test of stamina. The final story is by far the weakest, but the dreamlike epilogue, with Pirandello himself recalling a long lost childhood memory, is worth the challenge. The film was shot (in lovely rustic earth tones) on location in Sicily."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Filmtre",
         "Rai 1",
         "MK2 Productions"
      ],
      "summaries": [
         "The film consists of four stories plus epilogue, set in 19th-century Sicily. THE OTHER SON - A mother spends her life waiting for news from her two sons (emigrated to America) while ignoring her third, because he is the reincarnation of the bandit who raped her. MOON SICKNESS - a newly-wed peasant girl discovers that her husband goes mad every full moon. She arranges for a male friend to protect her, but they end up in bed together just as the moon emerges from behind a cloud. THE JAR - a rich landowner hires a master craftsman to repair a giant olive jar, but the craftsman gets trapped inside. REQUIEM - villagers band together in an attempt to force their landlord to let them bury their dead. CONVERSATIONS WITH MOTHER - the writer Luigi Pirandello talks with his aged mother about a story he always wanted to write, but which he never managed to capture in words.",
         "Five stories by Luigi Pirandello set in turn-of-the-century Italy."
      ],
      "budget": 0
   },
   "movielensId": 173367,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1984-11-22",
      "dvdReleaseDate": null,
      "directors": [
         "Vittorio Taviani",
         "Paolo Taviani"
      ],
      "runtime": 188,
      "movieId": 173367,
      "title": "Chaos",
      "mpaa": null,
      "actors": [
         "Franco Franchi",
         "Ciccio Ingrassia",
         "Omero Antonutti",
         "Claudio Bigagli",
         "Massimo Bonetti",
         "Tony Sperandeo",
         "Margarita Lozano",
         "Orazio Torrisi",
         "Carlo Cartier",
         "Biagio Barone",
         "Laura Mollica"
      ],
      "imdbMovieId": "0087537",
      "originalTitle": "Kaos",
      "genres": [
         "Mystery",
         "Romance",
         "Drama",
         "Comedy",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Five stories center around a werewolf, a feudal landlord, peasants, a ghost, and a mother and her sons.",
      "tmdbMovieId": 38164,
      "avgRating": 3.625,
      "releaseYear": "1984",
      "numRatings": 4,
      "posterPath": "/c5TgKbwMclmFMPnwxOjVMbFdx0E.jpg"
   }
}