{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "underwater scene",
            "id": 158247
         },
         {
            "name": "screening room",
            "id": 165419
         },
         {
            "name": "cocktail party",
            "id": 199939
         }
      ],
      "imdb_id": "tt0454914",
      "video": false,
      "title": "Perhaps Love",
      "recommendations": [
         71476,
         217437,
         59444,
         86409,
         67793,
         48261,
         93387,
         27060,
         40974,
         118178,
         45418,
         140613,
         287420,
         37984,
         40977,
         122611,
         43152,
         45472,
         33840,
         129070
      ],
      "backdrop_path": "/87pQ9I12PICtzFDqd0vD7V95ULo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sun Na",
               "gender": 1,
               "credit_id": "52fe4689c3a36847f8104755",
               "name": "Zhou Xun",
               "profile_path": "/hIOJS7EX6qBormh7Q6KNmtBlWlC.jpg",
               "id": 71057,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lin Jian-dong",
               "gender": 2,
               "credit_id": "52fe4689c3a36847f8104759",
               "name": "Takeshi Kaneshiro",
               "profile_path": "/ci0hluuIRGFGqSDp2kkqXczvywD.jpg",
               "id": 43661,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Nie Wen",
               "gender": 2,
               "credit_id": "52fe4689c3a36847f8104751",
               "name": "Jacky Cheung",
               "profile_path": "/n3zdB09qfGem9V0wftu1MXagqP.jpg",
               "id": 25245,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Monty",
               "gender": 1,
               "credit_id": "533fb54e0e0a262b5c000c2e",
               "name": "Hong Jin-hee",
               "profile_path": "/6KxXjDf5fLazCGygqjhfEJI9G3D.jpg",
               "id": 1295460,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Producer",
               "gender": 2,
               "credit_id": "533fb5580e0a262b4c000ba5",
               "name": "Eric Tsang",
               "profile_path": "/xJJZEKanRVgB7u5G3Fg7Xj9Fuoz.jpg",
               "id": 26724,
               "order": 4
            },
            {
               "cast_id": 23,
               "character": "Lin's Manager",
               "gender": 1,
               "credit_id": "544949ab0e0a26748f001ed5",
               "name": "Sandra Ng Kwun-Yu",
               "profile_path": "/hIQWKC82xAQHvO5Cm4J31ZZLEEh.jpg",
               "id": 88495,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4689c3a36847f810475f",
               "name": "Peter Chan",
               "profile_path": "/zg3cqkxlB4Ybm1yFbRD5N0CU9fM.jpg",
               "id": 56739,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5310c43d925141103500127d",
               "name": "Christopher Doyle",
               "profile_path": "/u7xRErdN6ya9qzOG8PVa2QshZFC.jpg",
               "id": 1357,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "533fb5760e0a26361f000e06",
               "name": "Oi Wah Lam",
               "profile_path": null,
               "id": 231750,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "533fb57f0e0a262b5c000c34",
               "name": "Raymond To",
               "profile_path": null,
               "id": 238409,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "533fb58b0e0a26362c000db4",
               "name": "Peter Chan",
               "profile_path": "/zg3cqkxlB4Ybm1yFbRD5N0CU9fM.jpg",
               "id": 56739,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "533fb5920e0a26361c000dca",
               "name": "Andre Morgan",
               "profile_path": null,
               "id": 71018,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "533fb59b0e0a26361f000e11",
               "name": "Zoe Chen",
               "profile_path": null,
               "id": 1127724,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "533fb5a40e0a262b4c000bb3",
               "name": "Peter Kam",
               "profile_path": null,
               "id": 66053,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "533fb5ad0e0a26361c000dd0",
               "name": "Leon Ko",
               "profile_path": null,
               "id": 78991,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "533fb5b60e0a26361f000e19",
               "name": "Peter Pau",
               "profile_path": "/pWDiUIJB2OpROUNgcMvcX4pZOwu.jpg",
               "id": 1633,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "533fb5c00e0a263622000ddb",
               "name": "Eric Kwong",
               "profile_path": null,
               "id": 64490,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "533fb5c80e0a26361c000dd7",
               "name": "Wenders Li",
               "profile_path": null,
               "id": 130500,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "533fb5d10e0a262b4c000bbc",
               "name": "Kenneth Yee",
               "profile_path": null,
               "id": 550956,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "533fb5d90e0a262b92000c02",
               "name": "Pater Wong",
               "profile_path": null,
               "id": 961865,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "533fb5e20e0a26361c000ddd",
               "name": "Dora Ng",
               "profile_path": null,
               "id": 64495,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.073189,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 44458,
      "vote_count": 23,
      "budget": 0,
      "overview": "A love triangle develops during the making of a musical in mainland China.",
      "similar": [
         1903,
         713,
         1278,
         38,
         116,
         194,
         1578,
         28468,
         42888,
         19913,
         599,
         1213,
         2270,
         167073,
         55721,
         544,
         289,
         222936,
         433310,
         329103
      ],
      "original_title": "如果‧愛",
      "runtime": 108,
      "poster_path": "/bzSwWkQxD7uggfz4cA5JGkYfKyg.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Applause Pictures",
            "id": 5346,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ruddy Morgan Productions",
            "id": 6137,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Morgan & Chan Films",
            "id": 12183,
            "origin_country": ""
         }
      ],
      "release_date": "2005-12-01",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Ho-Sun Chan"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Oi Wah Lam",
         "Raymond To"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0454914/",
      "coverLink": null,
      "actors": [
         "Takeshi Kaneshiro",
         "Xun Zhou",
         "Jacky Cheung"
      ],
      "reviews": [
         "Rather than calling \"Perhaps love\" a musical, it is better to call it a love story with musical elements. As far as that goes, the song and dance sequences are satisfying, although not elating. Like many that came before it (including Truffaut's \"Day for night\"), \"Perhaps Love\" is structured as a movie about making a movie. It manipulates the situation to its fullest by having the story in the movie that is being made replicate almost exactly the story of the people making it \u0096 the director, male and female leads, in an all-too-familiar perpetual triangle. Crisp cutting traversing the three dimensions \u0096 the making of the movie (the present), flashbacks (the past) and the story within the movie being made (the allegory) \u0096 creates a fascinating kaleidoscope of lavish beauty from which emotions flare. Kaneshiro Takeshi and Zhou Xun, playing two top stars that shared a past that one tries to forget with icy resolution while the other clings on to with fiery desperation, work together splendidly to bring life to an often-told tale. Jacky Cheung cuts quite a powerful \"Phantom\" figure playing the director who brought the actress to fame and fortune. Ji Jin-hee is comfortable in a role of the muse in Tales of Hoffman, but appearing in many guises. The use of the trapeze in the grand finale is a clever move, bringing to mind quite a few classic movies with the circus as background. The mellowed ending lifts this movie one notch above conventional romance melodramas, sending the audience away with reflections on the protagonists' as well as their own fleeting passage through life.",
         "Why do we like to put movies in categories? Why do we have to compare such a splendid movie with other musical movies? All movies are different. Just because Perhaps Love is not as musical as other musical movies does not mean it is worse than those movies. I personally loved the movie. the characters performed beautifully, the songs were original and empathetic. The plot seemed simple, yet complex and deep. The idea of 'film making' in a film is clever and well fitted. The costumes were designed exceptional as we see clear contrast between the past in BeiJing and the present new Sun Na. The introduction was philosophical. Life is a movie. you could be the protagonist on someone's movie, or just a glimpse of the face. The love between the 3 people seemed simple yet extremely complex. and the twist at the end of sad yet realistic. In conclusion, Perhaps Love is a masterpiece. it needs more explorations to be completely understand, but i think it's worthwhile. Good Job!",
         "I love this movie. First of all, please do not compare it to Moulin Rouge. Yes, it's opening made it look like a boring musical, but actually the singing and dancing are just eye candies for the audience. The love story presented is simple. I don't even think it as a romance movie. I think of it more as a drama about love more. I guess the reason I felt this way is because I watched the Chinese version (better communication compared to English sub.) and I was in a situation that questioning my own love life. This movie gave me another perspective looking at love relationship. Don't you feel related to any one of them, or part of? How many of us really have something true? Why do you think Sun Na and Lin Jian Dong still break up at the end of movie? Answers can be diverse and it all depends on your own experience. Yes, Sun Na was once Jian Dong's true love. She messed it up. He loved her ten years ago and still presently, but more complicated with hatred, revenge. There is no way they will be together any more. It looks like the movie is talking about a love triangle, but I think it's talking about love in general. I relate it to real life. People can be running away not just from poverty, they can be running away from a bad love relationship, bad family relationship to start a new love relationship. How many of us had relationship like Sun Na and Nie Wen's? (Gain from each other's strength, not necessary in a bad intention.) I bet there are a lot. Anyway, the movie is beautiful. Zhou Xun has always been great. Takeshi did a good job in this film surprisly. Director Chan, I'm waiting for your next great work! No pressure :) When I got time, I will write more. See you.",
         "I fell in love with the introductory analogy. Life is like the movies, in which you are the director, producer and the star. In your life, there are other co-stars, and of course, that significant other. But what if you happen not to be sharing the limelight in your other's life? Editing is always a pain, and in the final product, you will then learn if you are sharing the same billing, get relegated to a cameo, or in the worst case, get cut out entirely and lie on the floor of the editing room. Similarly to my 2004 movie of the year, Eternal Sunshine of the Spotless Mind, this film too takes a look at the trying to forget someone in your life entirely. Except in this one, there is no faux-pas scientific methods, but done by sheer human will and pretense. This is a musical within a musical, and a beautifully choreographed one at that. First thoughts will be, hey, it looks like Moulin Rouge, with big colourful sets, dancers, singers, stunts, and songs with meaningful lyrics. Yes, and given similar themes like Love and Hate, but Perhaps Love tells its own story. The soundtrack befits the musical, and I won't be surprised if anyone adapts this for the stage too. Japanese heartthrob Takeshi Kaneshiro plays Lin Jian Dong, a struggling film student when he met his love in Beijing. When the film begins, he's already an accomplished actor, and chances upon that same love in his latest movie collaboration. He's not the least surprised at being given the cold shoulder, and goes all out to try and win her back. But exactly what his motivations are - love, revenge, closure, that one pleasure filled fling, remained to be seen. Much is said about his ability to sing (or lack thereof), but I felt that he sang convincingly in this movie, and fleshed out his role as the pained lover realistically. When his final intentions are revealed, you can't help but to emphatise - yes, that perhaps what he did was justified. Contrasting Kaneshiro's character is Jackie Cheung's Nie Wen, the auteur director with his mood swings. His current lover and muse is Jian Dong's love in Beijing, and he comes to discover this fact after filming begins. He feels cheated upon, hurt, and channels his raw emotions onto the film. There should be no doubt as to Cheung's singing prowess - powerful is the one word summed up, though I thought it's always the same song? Between the two male leads, his is surprisingly magnanimous, and shows true courage as compared to Jian Dong. Chinese actress Zhao Xun plays Sun Na, the woman caught between the two men. One is her lover in a past she wants to forget, while the other is her lover who brought her stardom in the present world. It's a highly complicated-in-emotions role, one which explores, and for those in love, might have felt in one way, or at some points in time. When you feel your love is holding you back, would you give it all up to pursue your dreams? Sun Na is one such woman, who will stop at absolutely no cost, and jump on every available opportunity presented, to seek fame and fortune. And it is she who walked out of Jian Dong's life at least twice, to be with an American director, and later, with Jian Dong's assistant director friend, before we currently see her in the present. Ignoring Jian Dong when they meet in their new film, she can't help but feel her icy walls being broken down by his persistence, though Jian Dong had assistance from Korean Jin Ji-hee's role as Montage, a spirit who interacts with all characters and weaves in and out of the plot, bringing about a feel that there's always that higher being involved in events that unfold in life. And the way the characters interact is probably fused so seamlessly into the musical, within the musical. Unable to express themselves freely, they do so through the musical's story, premise, and lines. It doesn't feel contrived, but the entire narrative seemed flawless. Even the flashbacks doesn't mar the pacing of the film, but brings about a natural progression and revelation of character development and events. Perhaps Love is a truly wonderful experience, especially for those who have been in the same ship before. Its ending isn't typical, but one which perhaps is the most realistic an ending can be for the characters involved. Peter Chan has crafted a beautiful masterpiece of a musical for the Hong Kong film industry. Catch this on the big screen before its run is over!",
         "I saw this movie aboard the plane when I flew back from Beijing to Amsterdam. I saw it on a very bad small 10\" (or so) screen, with crackly sound and with a lot of annoying kids around me. Still I have not enjoyed a movie this much for quite some time. It's much -and I really mean MUCH- better than most of the stuff Hollywood chunks out and I bought it on DVD the day I got back! For everyone who has ever felt the feeling of losing a love or having an unreachable love, this movie will be very recognizable. It greatly depicts the pain and suffering that can come from true love and although the movie isn't always as easy to follow, it will captivate you and keep you hooked right up to the end. Apart from the wonderful story, the great backgrounds and superb acting made me an instant fan of Asian cinema. I'd seen a couple of more well known Asian films (like Il Mare for example), but this one opened my eyes entirely. I hope to see more movies like this soon and I recommend it to anyone who can appreciate a good love story!",
         "I've recently watched Perhaps Love again, and the film was even more beautiful the second time around. I've come to find that there are very very few films that successfully capture the struggle of love on-screen, so I was very (and pleasantly) surprised that an Asian film managed it so well. The chemistry between the actors felt real and I loved the soundtrack! Probably the weak points were the choreography and the effects (especially the ending sequence). Btw, the director, Peter Chan, has stressed in interviews that Perhaps Love is NOT a musical, but a love story, so viewers shouldn't be going in and expecting a fare like Moulin Rouge. I liked the way reality and illusions, past and present, were hard to separate in the movie (eg no different usage of colors), because it reflected the inner struggle of the characters; Sun Na, who refuses to believe that her past affects her present; Nie Wen, who thinks that illusions can solve reality's problems; Jian Dong, who cannot separate the past from the present. The saddest part was when Sun Na, after receiving her memoir from Monty, recalled the film that Nie Wen had always wanted to make -- \"a simple love story\" -- and she said \"If that film was ever made, I've always wanted to be in that film...\", which reflected her inner yearning for a simple love story of her own, but it never came true. But why did she disagree so strongly with the location of that film that Nie Wen said it would be filmed at? (Qingdao? and Qinghai?, sorry can't remember the exact names) Perhaps it's because even though Nie Wen and Sun Na longed for the same thing in a whole, they also longed for different things that they could not agree upon. There are so many things to discuss about the movie, but I think most of it is subjective; if you know how much love can confuse, hurt, give hope and stumble, you'd probably like Perhaps Love too. Words won't do it justice! All in all, Peter Chan did a great job in capturing the emotions of the characters. Worth a second and third watch!",
         "It's really wonderful to see such an emotional film so beautifully executed. I thought that this film has the eye-candy of Molin Rouge but with a far more convincing performance from all of the actors involved. There literally isn't a weak link in the chain, and I think it really is very original and genre defying, and refreshing to see such a gorgeous film come out of Asian cinema that's not a kungfu film. It's too bad that the buzz for this film hasn't really started in the states, but I'm hoping that more people will hear about it. It's soooo much better than Seven Swords or Anything \"Asian\" that Hollywood has served up recently. And far more entertaining.",
         "This is a splendid film about the lost of love, the memory of love, the pursuit of love, and the truth of love. It tells a triangle love story. What I like about this film is not how touching the triangle love is, but how touching this story is told. It's directed by a famous Hong Kong's director Peter Chan, and staring by the handsome Takeshi Kaneshiro (\"House of Flying Daggers,\" \"Turn Left Turn Right\"), the talented Zhou Xun (\"The Little Chinese Seamstress,\" \"Beijing Bicycle\"), the remarkable singer and actor Jacky Cheung, and the Korean heartthrob Ji Jin-hee. Ten years ago, in Beijing, a Hong Kong film student Lin Jian-dong (Takeshi Kaneshiro) fell in love with an energetic girl Sun Na (Zhou Xun). Sun Na left Jian-dong to pursue her dream to be a movie star, leaving Jian-dong devastated. Ten years later, both of them become big movie stars and their paths cross again when they co-star in a musical. However, the musical's director Nie Wen (Jacky Cheung) also loves Sun Na. Will the old love prevail or will it simply break more hearts? At the beginning, when the music and dancing started, I thought this film is another Hollywood style cheesy musical. I am not a big musical fan, so I got a little worried. That concern quickly disappeared because the heart wrenching story and the marvelous performance settled inside me, deeply. The music and the songs actually move me profoundly. The film brilliantly blends together the musical which two lead characters are filming and the movie itself. The characters are enacting their love affairs through the musical they are playing. I am glad that Takeshi Kaneshiro speaks perfect Chinese in the film, not like how Zhang Ziyi speaks English in \"Memoirs of a Geisha.\" Heck, even Ji Jin-hee speaks darn good Chinese (perhaps dubbed). I shed so many tears together with those characters during the screening of this film. I wonder why. Perhaps, love?",
         "This movie is a stunning masterpiece that showcases a whole new versatility for Asian Cinema. It takes the brash exuberance of Moulin Rouge, the musical-bizaro world of Cirque du Soleil, the color palate of Amelie and ratchets up the imagery and the volume to achieve new heights in cinematography. Farah Kahn leaps to the top of the list of my favorite choreographers of this new century. Easily some of the smoothest vocalists of China's pop and ballad scene have been assembled plus a handful of triple-threat actors weigh in to truly pull off this brave work. This is a beautiful film and my favorite foreign film of the new year.",
         "This is one of the most beautiful movie shot between Chinese mainland and Hong Kong. I was always looking forward to a \"singing in the rain\" of China. Now it is there. In my memory, no one is to be compared to Chow yun-fat in Hong Kong movies. But this one really shaken me. Both main characters are to be praise by two thumbs up. The face is Hong Kong movie festival has awarded Zhou Xun with a best actress in a leading role, who acted as Sun Na in the film. Also the plot is fine, ranging between reality and music play. That is something that China has been lack of for years...... Passion will pass away instead of people, that is what I think, the saddest thing of this grown-ups' fairy tale. Satisfying.... 8/10",
         "I watched this movie during its recent release in Singapore. I'm not particular musical fan. But this movie is really worth to watch. It's simple story, about love triangle, but I guess the credit goes to its wonderful, simple and touching delivery. Its flashback delivery makes this movie unique. Frankly speaking, it was kinda confusing at the beginning but as the story flows, you may feel the movie touch slowly. Started with how Lin Jian Dong (starting Takeshi Kaneshiro) acts together with Sun Na (starring Zhou Xun) in musical love triangle show, that actually tells the story about their love journey a decade ago. And the movie director Nie Wen (starring Jacky Cheung)trapped in love triangle between the lead actor and actress. With Takeshi's handsome face, Zhou Xun's good acting and not to mention Jacky Cheung's beautiful and clear voice, it's indeed a good movie to catch!",
         "I like the actors and actress, the set design, the costumes, the songs and dancing. The frames are beautiful. I like the photography, the angles were special. I feel the characters are like communicating with the viewers directly, in a good way - it's the point of view I guess. The dancing segments are wonderful. I particularly like the dancing in the lanes of old Shanghai (the Shanghai Studio Backlots), those street girls, and the wondering Kaneshiro... It's fantastic. A first-class musical scene and performance and design. However, I don't think it's a real musical. Maybe it's not good to judge a film from genres, but it would have felt much better if there were more dancing and singing scenes. The story is perfect for a musical, I mean, simple, melancholy, dramatic. There are simply not enough musical scenes. And it seems to me the girl should dominate the singing, and also Takeshi Kaneshiro. But it seems to me Jacky Cheung is the one who really sings and sings the most - he is a superb singer, but... And the story - I don't think it's organized as a commercial film, but this is obviously a 'commercial-style' of a film. I imagine it would be more enjoyable if the story were told in a clearer way, especially at the beginning, and were told more like a musical with more dancing and singing. So when the viewers walk out of the cinema, their mind still enjoys the visual beauty of the stage and dance, the lingering music and songs, and then feel a bit melancholy of the story - the enjoyment of cinema.. Still, I like the film. I've never seen a better Chinese musical.",
         "Why do I love Asian cinema? because the continent seems to be the biggest place in the world where people are in love with film. they break the rules they break the bounds and they make things that nobody else is doing. A musical of sorts, this is the story of an actor who once wanted to be a director, an actress who once loved the actor but now is now involved with her director, and the director who loves the actress even though he knows she may leave him. They are all making a musical film which in movie tradition parallels the triangle that exists in real life.. Its an often jaw dropping, eye popping emotional film. To be sure it doesn't always make complete sense, partly because the frame work confuses things a bit too much, and partly because I don't think all of the elements are there, but at the same time the music, the images and the emotion just carry you along. Many people here on IMDb compare it to Moulin Rouge but I don't think thats fair since this film really only compares to that film in that they are musicals. This is a movie musical that knows what it is and knows how to use the conventions of movies and musicals to great effect. Honestly I'll have to watch it again to determine how much I like it- and yet at the same time I want to go out and show it to people. I want to show it to people and explain- you want to know why I love movies here watch this or If you want to know what a movie is suppose to be watch this. Its magical- from the opening narration about how we are all the directors of our lives- to the final fade out this is pure movie magic. If you love movie or musicals you do want to see this....",
         "Perhaps Love is an unusual film from the East in that it is a musical. Jacky Cheung plays an acclaimed movie director, Nie Wen, who gave the major break to his girlfriend Sun Na (Zhou Xun) years ago. Once again, he's cast her in a musical film which tells of a love triangle between the leading lady to be played by Sun Na, her former boyfriend played by Lin Jian-Dong (Takeshi Kaneshiro) and a circus director played by Nie Wen. Little does Nie Wen know that there are too many similarities between his script and real life, as Sun Na and Lin Jian-Dong have a past from 10 years before. Our film unravels, showing the parallels between Nie Wen's film and flashbacks of the story between Sun Na and Lin Jian-Dong. Despite the potential for it being clichéd and full of the boring old scenes from other romantic stories, it does turn out to be innovative and full of a few twists to keep the interest going. Plus Nie Wen's musical film gives some beautiful songs and choreography that occasionally bridge fictional and real life, so good in fact, that they would fit in well in some good West End/Broadway musicals. Jacky Cheung, fresh from his almost endless tour round Asia in the stage musical production, Snow.Wolf.Lake, demonstrates in the movie why he is the king of the musical stage in Asia. His unique, powerful singing voice shines like a heavenly king's should. Takeshi Kaneshiro was a pop star in his youth and sings well (and just in case you wondered, not at all like the drunken scene in House Of Flying Daggers when Zhang Ziyi dances). But the acting honours go to Zhou Xun, who didn't actually have many singing parts, but her acting shone through as exceptional. She effectively plays three characters in this movie (Sun Na in her youth and as the diva, and the character in Nie Wen's film), and she makes the transition between those characters so effortlessly. She is for me a real talent in the making, a Zhang Ziyi but with real acting ability aside from looking innocent. It is no wonder then, that she won the HK Film Critics Award in 2006 for best actress, beating a whole host of stars and is up for the same category the coveted Hong Kong Film Awards in April 2006. Peter Chan's visionary directing is as strong as ever. The film has some amazing sets, costumes and choreography that brings it to life. The cinematography is almost Christopher Doyle-esquire. Given Chan's other recent success (as producer) being Dumplings in the Three... Extremes films, I'm now looking forward to what Chan has to offer next. The film is bound to create some more interest in Chinese musicals in the future, and I'm hoping that we'll see a film version of Jacky Cheung's Snow.Wolf.Lake. And there is an appetite for it internationally too, as Perhaps Love was widely praised when it closed the 62nd Venice Film Festival. In Hong Kong, it received good reviews, is nominated for 11 HK Film Awards and was Hong Kong's official entry into the Oscars (although it hasn't been nominated) This is a gorgeous film and definitely worth watching. One for an emotional tug on the musical heartstrings.",
         "this movie is really great, with great cast and also use a lot great song.but since it not very popular back then in china, so it not got very succeed, the story follows three lines, back to pass, now and future, three different people because of dream love memory, be together and serpent,which bring the scene of the story, what is love, i give you all my heart before, but right now i have my new life, what should i choice, if i don't love you any more, is that mean i should hate you or forgot you, what is love really mean for man, for woman, how to show i love you, by be with you? by sending you to a better place?what is the memory will do for the love?thats the mean topic of the story.",
         "Perhaps Love is one of those movies that gets better with age. 6 years ago, I first popped in the huge DVD box set and honestly not only did I not get it, but it was a snooze-fest. That's coming from someone who enjoys and embraces Wong Kar Wai movies since the tender age of 17 years old. Something about musical and whatever, this film just didn't click. Now fast forward the time machine and countless experiences, it is 2011. Perhaps Love is not just any other good film, but it is a wonderful, emotional and simply amazing movie experience. It is a film that constantly makes you think, reflect and the inner turmoil of Jacky Cheung, Zhou Xun and Takeshi Kaneshiro are all heart wrenchingly felt. The musical aspect adds to the atmosphere and the story telling, in fact Jacky Cheung's role as the present lover who can do nothing about his partner being unfaithful is most likely his most difficult and complicated role to date. Zhou Xun is amazing as always, but it is Kaneshiro that really surprises me. His eyes hides years of sadness, frustration and unrequited love, is simply breathtaking to endure. In creating Perhaps Love, director and producer Peter Chan has created something very special, immensely original and startlingly realistic. This is truly one of those films that will be re-watched again and again in the years ahead. Quite frankly it is a small piece of cinematic gem\u0085 Neo rates it 9.5/10 www.thehkneo.com",
         "Saw the movie last night at the Malaysian premiere with Peter and Takeshi present at the before-buffet and screening. Personally, I did not enjoy the movie. Don't get me wrong, I love musicals, and I thoroughly enjoyed Moulin Rouge. There were a lot of things in Perhaps Love that tried to be like Moulin Rouge but just didn't quite get there. For example, the opening sequence with fast choppy editing and fast-paced choreography. The only problem here is that at least Moulin Rouge gave a clear premise of what the movie was going to be about as oppose to in Perhaps Love, which throws you into a song with no clue at all. The one thing that fell flat was that even though the storyline about the love triangle was simple, the way it was revealed was confusing and there were a lot of scenes that just seemed like a waste of time and wasn't moving the movie along. Perhaps it needs to be explained to me, but generally, movies don't need to be explained and should reveal itself. The formula of a good musical is that it is pretty straightforward and what makes a musical work are strong songs that explain the storyline. The music in Perhaps Love was weak in the sense that it all sounded like Mando-pop ballads and didn't move the story along at all. At some points in the movie, I was thinking whether it can even be justified as a movie musical due to the fact that the only musical numbers were songs from the movie being made within the movie. From memory, there were only about 5 songs through the 2 hours! I usually enjoy choreographed pieces and musical numbers but when it came to the musical scenes in Perhaps Love, I started feeling uncomfortable due to the fact that the extras looked a tad unprofessional and the whole thing was cheesy as oppose to it being a serious, dramatical love story. Visually, though, the shots were well done and sets/costumes and even the acting was strong so I'll give it a few stars there but other than that, it just got tedious and I pretty much was waiting for the ending to arrive.",
         "I had high hopes when I went into the theatre-- having seen the trailer I was as hyped as the next person to see great talent participate in the making of a story with a beautiful premise. However, it's disappointing to see this talent laid waste by the poor composition of songs-the words are chunky and cheesy, probably because it was composed with a more western theme. I wouldn't find it difficult to imagine the same melodies with French or English lyrics. In Mandarin, they just sound strange. The musical items were also cut together badly-- far too quickly to be enjoyable, and the shots of the actors looking anguished lasted far too long. The special effects are the next disappointment. Suffice it to say, it is highly obvious where the special effects start and stop. It's not Moulin Rouge, and it's not In the Mood either, inspite of the occasional (and very similar) slow waltz theme. Altogether, and hour too long to tell a simple story.",
         "I love musicals.. somehow I have doubts for this one. I expected to see a musical, albeit one without any plots. Musicals are born that way, actors sing to what they suddenly feel like. If you look for a plot in a musical, you're going into the wrong movie. However, this film is.. I can't describe really what it is. It's a musical, yes, and there's a story. I didn't like the way the music is performed in the movie, though. They depended too much on the play-within-play idea to present the music. All the musical performances happened within the 'film' that the three characters were involved in. You can see that whenever the characters are singing, they are doing it in the 'film', and not in the real life situation. I was expecting a performance to come out from the feeling of that character - like Chicago, when Roxie feels like it, she would suddenly sing to the tune 'Roxie Hart' - of course then the song \"All That Jazz\" is still done in a 'performance' within the movie. In fact, Tsai MingLiang's The Wayward Cloud, sex and other things aside, would make a better musical - the leads would suddenly change clothings and sing whenever they feel like it. Am i making sense here? Instead of that sort of thing, I wish that the characters would just sing when they're happy (like that scene in \"Singing in the Rain\") or when they feel sad, and not doing it because the characters are 'in a movie set'. It just takes the notion of Musical away. Yes, there is a plot, probably better than other musicals, but then the plot is not strong enough on its own. The music is great, at times touching. Jacky Cheung is an amazing singer, and I didn't know Takeshi could sing that well either (plus good looking and can speak canto, oh my..) The slow love songs are the most beautiful. The cinematography are obviously beautiful and carefully arranged. There are many dancing scenes that are nicely choreographed (except that I wished the singers would dance with the background dancers too, instead of them singing in the middle, doing nothing). I wished also that there would be more singing done by more characters instead of just Jacky or Takeshi, and the other Korean guy, whats his name..? Nevertheless, its a really good try by an Asian director trying to go global. I just wished it would be less Broadway and more unique Chinese/Asian (the setting are all 20s Harlem sort of feel).And I also really wished there were more people singing. I like the Korean guy's character because he's exactly what musical is all about - who that person is doesn't matter, what matters is that he sings whenever he wants to! So I think it's a good watch, just to see how Asia can make a musical, too. Plus, the music/costumes/set/cinematography are just too nice to miss.",
         "It is quite fortunate that the soundtrack was not composed by the likes of an Andrew Lloyd Weber, or Oscar & Hammerstein, for that would have made the film entirely forgettable. As it is, the shockingly superior brilliance of Kam & Lo has garnered this film no less than one Oscar. Guaranteed. Returns pointers to supported interfaces. The IEnumWIA_FORMAT_INFO interface, like all COM interfaces, inherits the IUnknown interface methods. Returns S_OK if successful, or an error value otherwise. Applications use the IWiaDevMgr::EnumDeviceInfo method to enumerate property information for each available Microsoft Windows Image Acquisition (WIA) device. The IWiaDevMgr::EnumDeviceInfo method creates an enumerator object, that supports the IEnumWIA_DEV_INFO interface. Not currently implemented. Applications must call the IUnknown::Release method on the interface pointers they receive through the ppIEnum parameter.",
         "This movie was no doubt very unclear, so it leaves plenty to the audiences imagination. A good thing, yes for some movies, but in this case...no. When certain movies decide to leave things unclear and let's the audience to interpret it themselves, there is a significant reason why they do that. But for this movie, there simply isn't. I found it more funny then actually dramatic. The music was good but for a musical, it doesn't make the audience want to learn and dance to the songs. Comparing it to the Moulin Rouge, there is no doubt the Moulin Rouge is much better, music and theatrical wise. I found it a bit dragged on and how there was no real significance overall in the story. This movie is not a waste of time, it has it's moments only because of the great performances from the main 3 characters, so the verdict of \"Perhaps Love\" 5/10 Chow",
         "Musicals, are almost a completely new genre in modern HK films. Bearing that in mind, the performance in this movie is satisfactory, and at times you might be able to find something surprisingly good. Having said so, I do feel that when I'm talking about a musical film, I'm seeing movements, dances, flashes and swiftness. This I find a bit lacking in the film, and the music itself doesn't really make an impression. I agree with other comments in here that the main characters should be more involved when in the \"musical mode\". The film successfully created a sense of deep sadness thoroughly, from beginning to end, oozing out from EVERY character. But really, the story is extremely simple. It brought on the heartache from the very beginning and it was just there until the last minute of the film. If you enjoy such tear-jerking moments you will like it, but for me, I soon started to long for something....some sort of happenings to fill up the gaps between the numbers. That brings us back to the music, because if the numbers are good enough the audience would soon forget the plot. In terms of singing performance, Jacky C obviously steals the light from everybody else. In fact, it is just a one-horse race. The rest of the cast have easier scores, probably due to their vocal limitations. But this film does give a different flavour from the recent Hollywood mainstream musicals. It is more feminine, more subtle, and perhaps that would work better for the markets over here.",
         "Hi movie fans! this movie was really nice. i watched nearly every Takeshi Kaneshiro movie since 1997 and i can say: i am a fan. this movie continues that tradition of beautiful love story movies he often does. its really touching, with great music and bombastic actors (they are acting really great). its full of sad elements and i can guarantee that emotional people will cry ;) wonderful... as Takeshi is half Chinese and half Japanese you shouldn't be wondering why you see him in Chinese movies and in a lot of Japanese movies too :) the movies i like most with him are: turn left, turn right; house of flying daggers and of course the VG's of Onimusha."
      ],
      "genres": [
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Applause Pictures",
         "Morgan & Chan Films",
         "Ruddy Morgan Organization, The"
      ],
      "summaries": ["A love triangle develops during the making of a musical in mainland China."],
      "budget": 0
   },
   "movielensId": 173435,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "2005-12-01",
      "dvdReleaseDate": null,
      "directors": ["Peter Chan"],
      "runtime": 108,
      "movieId": 173435,
      "title": "Perhaps Love",
      "mpaa": null,
      "actors": [
         "Zhou Xun",
         "Takeshi Kaneshiro",
         "Jacky Cheung",
         "Hong Jin-hee",
         "Eric Tsang",
         "Sandra Ng Kwun-Yu"
      ],
      "imdbMovieId": "0454914",
      "originalTitle": "Ru Guo · Ai",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["VWsyd_YgrfI"],
      "plotSummary": "A love triangle develops during the making of a musical in mainland China.",
      "tmdbMovieId": 44458,
      "avgRating": 3,
      "releaseYear": "2005",
      "numRatings": 3,
      "posterPath": "/bzSwWkQxD7uggfz4cA5JGkYfKyg.jpg"
   }
}