{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "window cleaner",
         "id": 178861
      }],
      "imdb_id": "tt0049906",
      "video": false,
      "title": "Up in the World",
      "recommendations": [
         38381,
         56837,
         38364,
         24109,
         38384,
         61643
      ],
      "backdrop_path": "/p987RdkhHcVgpDncULk9i4avYK7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Norman",
               "gender": 2,
               "credit_id": "52fe46b49251416c9105ce89",
               "name": "Norman Wisdom",
               "profile_path": "/m1dq7C65PJhFwD5WQmaCdVDXpuO.jpg",
               "id": 76379,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jeannie Andrews",
               "gender": 0,
               "credit_id": "52fe46b49251416c9105ce8d",
               "name": "Maureen Swanson",
               "profile_path": "/tmPu6gbEtGudZE0hPWZh38ZuIAX.jpg",
               "id": 85346,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maj. Willoughby",
               "gender": 2,
               "credit_id": "52fe46b49251416c9105ce91",
               "name": "Jerry Desmonde",
               "profile_path": null,
               "id": 102514,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sir Reginald",
               "gender": 0,
               "credit_id": "52fe46b49251416c9105ce95",
               "name": "Michael Caridia",
               "profile_path": null,
               "id": 1080225,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Fletcher Hethrington",
               "gender": 2,
               "credit_id": "5aa59c1f0e0a26076002739d",
               "name": "Colin Gordon",
               "profile_path": "/lpL3lCnGHtXWuAcktJ8YBon0DgJ.jpg",
               "id": 14263,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lady Banderville",
               "gender": 0,
               "credit_id": "5aa59c3bc3a3687c03026658",
               "name": "Ambrosine Phillpotts",
               "profile_path": "/f1P4wLHBEJ64NcguyX1FkE0IVMQ.jpg",
               "id": 84406,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Maurice",
               "gender": 0,
               "credit_id": "5aa59c540e0a26075702d458",
               "name": "Michael Ward",
               "profile_path": "/qLxoDzsxYp8MbIlvOvHTzdxjcJg.jpg",
               "id": 30581,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sylvia",
               "gender": 1,
               "credit_id": "5aa59c71c3a3687c0c02aabd",
               "name": "Jill Dixon",
               "profile_path": null,
               "id": 96760,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Conjuror",
               "gender": 0,
               "credit_id": "5aa59c8dc3a3687bff02cc12",
               "name": "Edwin Styles",
               "profile_path": null,
               "id": 1004886,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Yvonne",
               "gender": 1,
               "credit_id": "5aa59cafc3a3687c060266a1",
               "name": "Hy Hazell",
               "profile_path": null,
               "id": 1060504,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mick Bellman",
               "gender": 2,
               "credit_id": "5aa59cd00e0a26075702d4cc",
               "name": "William Lucas",
               "profile_path": "/7tsAi4tED9eMOIRIiRrw2grWbkL.jpg",
               "id": 101720,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Wilson",
               "gender": 0,
               "credit_id": "5aa59ce70e0a26075d02c670",
               "name": "Lionel Jeffries",
               "profile_path": "/z9S89Tq1cG9jPFTujD44b8fumVH.jpg",
               "id": 30706,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Harper",
               "gender": 2,
               "credit_id": "5aa59cff0e0a26075402b95c",
               "name": "Cyril Chamberlain",
               "profile_path": "/uzW3In13T5boQXyCTLpvllw1ukp.jpg",
               "id": 115606,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Prison Warder",
               "gender": 2,
               "credit_id": "5aa59d4fc3a3687c2502c447",
               "name": "Michael Brennan",
               "profile_path": null,
               "id": 119667,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Max",
               "gender": 0,
               "credit_id": "5aa59d6a0e0a26074d028732",
               "name": "Eddie Leslie",
               "profile_path": null,
               "id": 1163386,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "537385eac3a368150f00135d",
            "name": "John Paddy Carstairs",
            "profile_path": null,
            "id": 185050,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.290275,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 38389,
      "vote_count": 5,
      "budget": 0,
      "overview": "Norman is a window cleaner who has to clean a manor house with hundreds of windows. He is distracted by the son of the house who persuades him to go into town. When some villains try and kidnap the young heir Norman fights them off but the heir has banged his head and can't remember Norman's heroic stand",
      "similar": [],
      "original_title": "Up in the World",
      "runtime": 87,
      "poster_path": "/ypcuEd07CIl07J5XK4BfNddn5zg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Rank Organisation",
         "id": 364,
         "origin_country": ""
      }],
      "release_date": "1956-01-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Paddy Carstairs"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Jack Davies",
         "Henry Blyth"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049906/",
      "coverLink": null,
      "actors": [
         "Norman Wisdom",
         "Maureen Swanson",
         "Jerry Desmonde"
      ],
      "reviews": [
         "\"Up in the World\" is the first Norman Wisdom film that I've ever seen (I'd never even heard of him until watching it, although it sounds like he was a fairly famous comedian in his day). If this one is any indication, then the rest of his movies must be a hoot. What I mean is that \"UITW\" nearly made me die laughing. It casts Norman Wisdom as working-class Norman, who gets a job as a window washer for some rich snobs. Employed by them, he proceeds to do the sorts of things that we most often associate with Insp. Clouseau and Gilligan, all the while riling the stuffy owners; that whole sequence when he interrupts the meeting is very likely to make you hoarse from laughter. But when some thugs try to kidnap the son, he has to take charge. One thing that I should identify is that I watched this movie dubbed in Russian and I still laughed my head off. You literally don't need to know what they're saying to have a good time, you just need to see what Norman is doing. I guess that having him develop a relation with the maid did give the movie a humanizing aspect, but the truth is that you could watch \"UITW\" with the sound off and still get belly laughs. I definitely recommend it.",
         "Out of work Norman goes to the labour exchange. The window cleaner of Lady Banderville has had an accident and they need a replacement. However a gang of criminals want the job to be able to gain access to the Banderville estate and kidnap the young son, Sir Reginald. Norman finds it difficult to get on with both staff and employers but within the staff there is a member of the gang plotting the kidnap of poor Reginald. Norman Wisdom comedies all run to the same formula in different settings. This involves the working class lad being put down by the snobbish upper-classes as he accidentally makes them look foolish -\u0096but always comes good in the end. Here we see him as a window cleaner to an upperclass family with all the various scrapes he gets into \u0096 but this has the kidnapping which gives it the feel of a reasonable plot to fall back on. The comedy is as good as it got for Wisdom and this is one of his better films (although not his best). The various routines and pratfalls are standard but enjoyable. The fact that the plot is quite good too (despite the holes) is a bonus but not important. Happily Norman's wooing of the usual attractive lady is limited to one brief song. The majority consist of various funny scenes and a good, if totally unrealistic, football match. Wisdom is on form and still looks as young and naïve as he makes himself out to be. Desmonde is as usual, every inch the upper class man looking for the fall. Swanson makes a pretty and unobtrusive love interest. The only bit of the cast I hated was Caridia who was really unpleasent as the spoilt brat. He did the role well but I felt that someone that spoilt and upper class should have some sort of comeuppance at the end of the film. Overall this is good for all Wisdom fans and many first timers may be won over by this mix of gentle comedy and whimsy.",
         "No, you will more likely keep off the chair rolling under the table. A gangster topic, a space topic, a war topic, a supermarket topic, a burlesque topic or a hospital one - Mr Norman Wisdom did it all. And did them all with heart. This movie sticks to the gangster topic. Norman Pitkin delivers again. In \"Up in the World\" he has quite a bunch of hilarious scenes: dressing up as a woman twice (!), throwing bombs with tear gas (!), performing Rock-and-Roll (!), escaping from a prison on a stormy day using a grotesquely long ladder (!), etc. My favourite one is with the Rock-and-Roll dance. Hope, there are enough exclamation marks to rate this movie rather high. Such comedies are fading away in today's hectic cybernetic world. To me they are the best of the best, because they remain childish and amusing in a very pleasant way. This kind of comfortable family entertainment is being almost lost and completely forgotten. That's atrocity. To give it the highest mark would be very subjective, but it's my choice and my advice: 10 out of 10. Thanks for attention.",
         "I just watched this on Wednesday night (Tonight) and i have to say a really enjoyed it. My favourite bit, well thats hard to choose actually, em it has to be the bit where, well i can't choose they all just wee bits you can't really write down! My least favourite bit by far is the singing bit, i dislike the way Norman randomly breaks into song in some of his movies, but then again, he has a good singing voice and if i were the same, i'd like to show it to the world like Norman does! Basically in this film Norman applies for a window cleaner job at a big house with hundreds of windows, but is constantly stopped by sir Reggie (who sometimes during the movie i'd love to punch in the face but less annoying as the film progressed) who is later kidnapped and Norman tries to save him but is mistaken to be the kidnapper and is put to prison but is later found to be a hero and everything ends well, with Norman getting married to his girlfriend! Very good family comedy, 7/10.",
         "I quite like Norman Wisdom, there is something very endearing about him, not just because he's funny but there's his wide eyed innocence and naivety that is really quite infectious. These infectious traits are put to perfect use here, as Wisdom is on top form in a very funny and sweet performance with one of his most likable characters. The slapstick comedy which involves ladders and broken windows is standard and perhaps not that original, but I for one find it amusing and memorable. Up in the World also has a more solid plot than most Wisdom films, and the football match is one of my favourite scenes of the film. The part where he breaks into song is quite sweet, I think Wisdom has quite a nice singing voice. It isn't only funny though, the scenes with Michael Caridia(who is quite good) and the hamster are quite sentimental in a touching way. Up in the World looks lovely with the sets and photography striking, the dialogue sparkles, the pace is snappy, the direction is good and the music has just the right dose of quirkiness. All in all, a very nice film and one of my favourites of a talented and pleasurable entertainer such as Norman Wisdom. 8.5/10 Bethany Cox",
         "This is another \"fish out of water\" Norman Wisdom comedy, where he plays a window cleaner at a lavish, huge country estate. He is the new target of the mischievous child Sir Reginald and generally causes havoc with the other people. There is a sub plot about kidnapping Sir Reginald, something that his family always seems frightened about. Norman eventually agrees to take Sir Reggie to London to a nightclub to see a magician. Norman even wreaks havoc there. Norman Wisdom is a good physical comedian and he plays this role rather well. In this film he is the star, with his pratfalls and sight gags. There is a love interest but thats very secondary to Norman's mishaps. If you like Norman Wisdom, slapstick comedy, British comedy or just plain silliness, you should watch this as well as other Norman Wisdom comedies. It doesn't hurt to laugh.",
         "The irrepressible Norman Wisdom goes \"Up in the World\" from poster hanger to window washer at a lavish estate, and the estate is lavish indeed as the film's exteriors were shot at the magnificent Woburn Abbey in Bedfordshire. Norman again tangles with his old nemesis, Jerry Desmonde as the estate manager, and finds a new foil in a spoiled young heir, Michael Caridia. Although Norman never falters, the film does. An extended soccer match wears on, and an involved kidnapping plot has few gags. However, the finale's Marx-Brothers-like mayhem leaves an elegant hall in shambles, as befitting the ever-bumbling Mr. Wisdom. \"Up in the World\" is formula Norman, which is not all bad. Norman is fired over and over; he sings the title song, one of his own composing; and he falls for a young housemaid, who is in the mold of the young ladies Norman always falls for. Michael Ward, who played a fussy photographer in \"Man of the Moment,\" amusingly returns as a fussy uncle here, and Lionel Jeffries pops up in a funny cameo. Mr. Wisdom never lets us down; whether dangling from a window, fooling around in a queue, or doing battle with Jerry Desmonde, his comic talents are pitch perfect. If only the movie had been worthy of him. However, lesser Wisdom is better than no Wisdom, and \"Up in the World,\" while not a great classic, is acceptably entertaining."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Rank Organisation, The"],
      "summaries": [
         "Norman is a window cleaner who has to clean a manor house with hundreds of windows. He is distracted by the son of the house who persuades him to go into town. When some villains try and kidnap the young heir Norman fights them off but the heir has banged his head and can't remember Norman's heroic stand.",
         "A friendly window cleaner works at an English country estate where he saves the owner's son from kidnappers."
      ],
      "budget": 0
   },
   "movielensId": 173757,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-01-01",
      "dvdReleaseDate": null,
      "directors": ["John Paddy Carstairs"],
      "runtime": 87,
      "movieId": 173757,
      "title": "Up in the World",
      "mpaa": null,
      "actors": [
         "Norman Wisdom",
         "Maureen Swanson",
         "Jerry Desmonde",
         "Michael Caridia"
      ],
      "imdbMovieId": "0049906",
      "originalTitle": "Up in the World",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["OJA1QoJX9cQ"],
      "plotSummary": "Norman is a window cleaner who has to clean a manor house with hundreds of windows. He is distracted by the son of the house who persuades him to go into town. When some villains try and kidnap the young heir Norman fights them off but the heir has banged his head and can't remember Norman's heroic stand",
      "tmdbMovieId": 38389,
      "avgRating": 4,
      "releaseYear": "1956",
      "numRatings": 1,
      "posterPath": "/ypcuEd07CIl07J5XK4BfNddn5zg.jpg"
   }
}