{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt4447518",
      "video": false,
      "title": "Tiger Raid",
      "recommendations": [],
      "backdrop_path": "/opyngA8wB6wzGpYOF2o8p595xvB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Joe",
               "gender": 2,
               "credit_id": "57120565c3a368673d0026da",
               "name": "Brian Gleeson",
               "profile_path": "/o0Zic3R5sz2Mmrnz2CfvRuZYulY.jpg",
               "id": 63364,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Paddy",
               "gender": 2,
               "credit_id": "571205ba9251413367000cf0",
               "name": "Damien Molony",
               "profile_path": "/tRIrDMXl6m79xoMbfFECYizZVEu.jpg",
               "id": 1240398,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Shadha",
               "gender": 1,
               "credit_id": "571204afc3a36860a8007a33",
               "name": "Sofia Boutella",
               "profile_path": "/btLeUFNIGTxG7FecTMRztSALj6L.jpg",
               "id": 568657,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Ruby",
               "gender": 0,
               "credit_id": "5804b781c3a3686e9a006c03",
               "name": "Rory Fleck-Byrne",
               "profile_path": "/cra6Pud2jFOBUbuslpg7VwGG4Ds.jpg",
               "id": 1267122,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56fc3fd8c3a36808c200379d",
               "name": "Simon Dixon",
               "profile_path": null,
               "id": 1598732,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5712043dc3a36860a8007a2c",
               "name": "Si Bell",
               "profile_path": null,
               "id": 1164437,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "571204659251410a68002451",
               "name": "Simon Dixon",
               "profile_path": null,
               "id": 1598732,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57120471c3a36866360025c2",
               "name": "Mick Donnellan",
               "profile_path": null,
               "id": 1606499,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5712047dc3a3684122007c78",
               "name": "Gareth Coulam Evans",
               "profile_path": null,
               "id": 1606500,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.697403,
      "production_countries": [],
      "id": 390587,
      "vote_count": 2,
      "budget": 0,
      "overview": "While on a covert mission, two cold blooded mercenaries form an unlikely bond as they race across the desert in the dead of night. When their violent and desperate world implodes, past atrocities come to the surface threatening to tear each of them apart.",
      "similar": [],
      "original_title": "Tiger Raid",
      "runtime": 92,
      "poster_path": "/gXfdb6TCInS6Tu3HMHQleZUaaLm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2016-10-07",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Simon Dixon"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Simon Dixon",
         "Mick Donnellan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4447518/",
      "coverLink": null,
      "actors": [
         "Brian Gleeson",
         "Damien Molony",
         "Sofia Boutella"
      ],
      "reviews": [
         "I just cannot understand why this film is generating 10* reviews. If constant yelling, bickering and swearing makes a good film then, yes, it's excellent but a poor plot, manufactured situations, some bizarre cut scenes and a set of most unlikely relationships makes this film depressing viewing along with 88 minutes I'll not get back. I found myself hoping that it might just turn the corner and go instantly from mediocre to brilliant in an instant but it never happened and I just ended up not bothering whether, in the end, A killed B, B killed A or C killed them both. Just not bothered.......",
         "Tiger Raid is one of those maddening films that smolders but never burns..... Its frustrating watching this film as excellent performances are handed in by the cast. Performances made more impressive when you consider that the majority of the interaction takes place between two key characters, mostly in small enclosed spaces. There is so much potential in this film for a mercenary Middle Eastern take on a Usual Suspects meets Reservoir Dogs, hybrid mix. Sadly, the smoldering tension that builds and the questions that start to come to the surface, never ignite in a meaningful way. Instead, what is offered up, for the most part, feels nihilistic and empty. I know that's a message, in itself but it feels more than a little rhetorical, given the \"money for hire killers\" context. In my opinion, an admirable effort from the cast but the script leaves much to be desired. Seven out of ten from me.",
         "This is kind of film where you just gotta use words such as \"powerful\" and \"gripping\". It has several very genre breaking plot twists and it was extremely refreshing experience after all the crappy AAA titles I saw this year. Film has only 4 characters. One of those 4 is in it for less than 10 seconds. Over 90% of screen time is just two guys ... talking. And if someone described this film to me that way I might not even have seen it. So, let us add that both guys are neurotic psychopathic killers, and rapists, who keep switching from close partners to trying to murder each other over and over. Throughout the film you really want to side with each of them at different points and its hard to decide which one, or perhaps both, or neither, should survive in the end. And just when you almost make up your mind, third character enters to complicate things further. Its a must see movie. Just see it.",
         "Joe (Brian Gleeson) and his junior friend Paddy (Damien Molony) work as mercenaries for Dave in Iraq. Their goal is to kidnap the daughter of a rich man. Much of the film is conversation between the two. We discover a lot of things that set us up for the final confrontations of the film which include the daughter (Sofia Boutella). Joe owes Dave while Paddy's loyalty has not been tested. First off, there is no tiger, and the \"raid\" consists of killing one guy watching a monitor screen. This is a psychological drama with internal conflict, being played out in Iraq. There are a lot of boring scenes of guys with heavy Irish accents engaging in \"locker room\" talk. I believe the twists at the end makes the film worth sitting through, you may not. Guide: F-word. No sex or nudity.",
         "An extreme, immersive, breath holding, visceral, all-consuming viewing experience,Tiger Raid is a film that is so much greater than the description, or sum, of its phenomenal parts. Damien Molony and Brian Gleeson star as Paddy and Joe, two mercenaries on a mission to carry out the kidnapping of a rich businessman's daughter, Shadha (Sofia Boutella). The pair play their part in the 'tiger raid' wearing painted on bandit-like black masks, working together for the first time and beginning the job with mutual distrust. Teasing and testing each other, they immediately engage in a dangerous, relentless, psychological dance. Set in the war-torn Middle East, against a vast and empty backdrop, the film's opening has an almost apocalyptic feel, and as they begin to converse, the words of the two men could be as a result of some 'new world order'. But the action is not set in the future, this is now, and the context Paddy and Joe exist within, overseen by an invisible boss 'Dave', has its own rules. But they each have their own versions of reality within that world, and as they collide and constantly challenge each other, a sparking kinetic energy continuously grows between them. An undeniably dark, and very disturbing, intense and suspenseful roller coaster, the layered plot unfolds with twists and turns. As the raid progresses, the already 'volatile situation' between the two men becomes increasingly chaotic and threatening, and after the kidnapping the dynamic shifts as external forces and revelations about Paddy and Joes' pasts uncover even darker truths. Throughout the film the close-up intimacy of the drama between these dark souls takes place against an empty, unending background, giving the feel of them being on the edge of life (and on the edge of their lives) and heading towards their final judgement. There is also something overwhelmingly profound and beautiful, emotionally powerful and pure about the film from the outset. The hauntingly penetrating score and the photography, delivering sweeping panoramas, and close- ups, magnifying and contextualising the characters' inner and outer worlds, heighten the beauty that both transcends and permeates the whole journey. The soundtrack is potently sublime, other worldly, almost celestial in places. These are not religious themes, but they speak to the deeper, even poetic, soul of the film. The performances are both vivid and subtle, all three actors embody their characters utterly and completely. Damien and Brian Gleeson imbue Paddy and Joe with vibrant and shifting shades, evoking emotion for these characters, in places where you shouldn't find yourself moved at all. But their journey, their revelations, their damaged, hidden hinterlands and histories, lay heavily, even painfully, in the heart. Adapted from Mick Donnellan's play 'Radio Luxembourg', the tonal and tense, multi-layered, intelligently constructed story translates to the screen seamlessly, the largely two person plot ceaselessly compelling and absorbing. The story and character arcs are so richly textured, they are almost impossible to entirely compute in one viewing. The film's essence remains and its meaning continues to unfold long after it is over. An up close uncategorisable character piece with strains of psychological thriller, this intimate yet immense film also oozes quality and creative integrity from edge to edge. It's incredibly performed, beautifully made by first time director Simon Dixon, stunningly shot by Si Bell, and Dean Valentine's deliciously permeating score is both impactfully pulsating and exquisitely sublime. Part of the film's power is down to this synergy and the care in every heartbeat of the film from performance to production. Very much an Indie and with nothing manufactured, mainstream or mass produced about it, this is far from easy, end of the day, escapism. But it is an alive, artistic, affecting experience. And It deserves to be experienced. However tempting it might be to try to reference it to another film, there really is no film quite like it. Head spanglingly immersive, pitch black but beautiful, hauntingly profound, moving, brave and indelible, Tiger Raid is more than worth the watch.",
         "If you are expecting a straightforward thriller, don't watch this! It is a haunting psychological drama that will stay with you for days. For example, the casual violence displayed by Joe and Paddy while they were discussing the 'higher' things in life - love, politics, religion - I found truly disturbing. I found that this film haunted me, that I spent time mulling over the characters and events, even considering different endings and the consequences for the characters. My feelings about the main characters, Paddy and Joe, were in a constant state of flux as more was revealed about their pasts and personalities. There are tremendous performances by all the actors, but especially Brian Gleeson and Damien Molony, giving real depth to the characters. They were ably supported by the beautiful, haunting soundtrack and wonderful visual camera work.",
         "Irish TV broke new ground in 2010 thanks to the writings of Stuart Carolan on RTE Love/Hate. Through the writings of Carolon and performances of Tom Vaughan-Lawlor, Killian Scott Irish television had entered a new era. That is how it feels when you watch Simon Dixon's script unfold here through the performances of Brian Gleeson and Damien Molony. My initial thoughts when watching it last night was like tragic Shakespeare play unfolding before me with a powerful performance by Brian Gleeson.He is his father's son when it comes to acting talent, simply brilliant. If it I had one criticism it would be the pace of how Dixon concludes the story. But outside of that cinematography captures the landscape beautifully, lighting and stunt coordination are also excellently executed. It would be unheard of before Love/Hate for an Irish co-production to attempt such a film. Well done to Simon Dixon and the team, looking forward to watching this space"
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller",
         "War"
      ],
      "productionCompanies": [
         "Dixon Baxi Evans",
         "Samson Films",
         "Cinepeak"
      ],
      "summaries": ["Two mercenaries ride a wave of pitch-black camaraderie as they travel through the desert night on their way to carry out a kidnapping in Iraq. As the raid progresses, their frenzied world turns in on itself as past misdeeds come to the surface, and violently threatening to tear them apart."],
      "budget": 0
   },
   "movielensId": 173751,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-10-07",
      "dvdReleaseDate": null,
      "directors": ["Simon Dixon"],
      "runtime": 92,
      "movieId": 173751,
      "title": "Tiger Raid",
      "mpaa": "",
      "actors": [
         "Brian Gleeson",
         "Damien Molony",
         "Sofia Boutella",
         "Rory Fleck-Byrne"
      ],
      "imdbMovieId": "4447518",
      "originalTitle": "Tiger Raid",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["ZQDlpAwUnwE"],
      "plotSummary": "While on a covert mission, two cold blooded mercenaries form an unlikely bond as they race across the desert in the dead of night. When their violent and desperate world implodes, past atrocities come to the surface threatening to tear each of them apart.",
      "tmdbMovieId": 390587,
      "avgRating": 2.25,
      "releaseYear": "2016",
      "numRatings": 4,
      "posterPath": "/gXfdb6TCInS6Tu3HMHQleZUaaLm.jpg"
   }
}