{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shipwreck",
            "id": 2580
         },
         {
            "name": "fisherman",
            "id": 5420
         },
         {
            "name": "tuna",
            "id": 161197
         }
      ],
      "imdb_id": "tt0023594",
      "video": false,
      "title": "Tiger Shark",
      "recommendations": [],
      "backdrop_path": "/gGftIQZO6DubJgSBAEcvOxH66DG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Mike Mascarenhas",
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc27d",
               "name": "Edward G. Robinson",
               "profile_path": "/af1aBRi4UccaxtmDPWEtlfy1vXE.jpg",
               "id": 13566,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Pipes Boley",
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc281",
               "name": "Richard Arlen",
               "profile_path": "/8aj00UfI8CFZ75tGR2TkfpRqJz9.jpg",
               "id": 29760,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Quita Silva",
               "gender": 1,
               "credit_id": "52fe4aafc3a36847f81dc285",
               "name": "Zita Johann",
               "profile_path": "/kVZhqYE32ZQ8t56MhTdwCJypFCz.jpg",
               "id": 78828,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Muggsey, a Barber",
               "gender": 1,
               "credit_id": "52fe4aafc3a36847f81dc289",
               "name": "Leila Bennett",
               "profile_path": "/1nsV0bjvJD6DIMhofXsXrjaPcjz.jpg",
               "id": 33006,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc28d",
               "name": "J. Carrol Naish",
               "profile_path": "/iHUIlLxzgkZSMvapdxLhBZe82B.jpg",
               "id": 30686,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Fishbone, a Crewman",
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc291",
               "name": "Vince Barnett",
               "profile_path": "/vOvZ6SSFHNKRwxGwVbp7bA2vX2l.jpg",
               "id": 13357,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Manuel Silva, a Crewman",
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc295",
               "name": "William Ricciardi",
               "profile_path": null,
               "id": 1046029,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4aafc3a36847f81dc261",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4aafc3a36847f81dc267",
               "name": "Houston Branch",
               "profile_path": null,
               "id": 235355,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc26d",
               "name": "Wells Root",
               "profile_path": null,
               "id": 96253,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc273",
               "name": "Tony Gaudio",
               "profile_path": null,
               "id": 8713,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aafc3a36847f81dc279",
               "name": "Thomas Pratt",
               "profile_path": null,
               "id": 29997,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.693008,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 109262,
      "vote_count": 3,
      "budget": 0,
      "overview": "A Portuguese tuna fisherman (Edward G. Robinson) catches his bride (Zita Johann) with his first mate (Richard Arlen).",
      "similar": [
         597,
         11210,
         810,
         3600,
         8358,
         11324,
         3176,
         15472,
         109424,
         332567,
         87827,
         205775,
         5689,
         27902,
         10191,
         27578,
         578,
         9806,
         71805,
         667
      ],
      "original_title": "Tiger Shark",
      "runtime": 77,
      "poster_path": "/3GePbdEK5QgPeTHunIxFnyCFFvb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "First National Pictures",
         "id": 3245,
         "origin_country": ""
      }],
      "release_date": "1932-09-24",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "Jungle holds no terrors for these bloodthirsty white-belled cannibals!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Howard Hawks"],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Houston Branch",
         "Wells Root"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023594/",
      "coverLink": null,
      "actors": [
         "Edward G. Robinson",
         "Richard Arlen",
         "Zita Johann"
      ],
      "reviews": [
         "All the old-time Hollywood studios recycled their scripts, turning previously-filmed properties into remakes and then re-remakes. More so than any other studio, Warner Brothers were notorious for re-re-re-remaking their previous films with only very slight changes in setting and dialogue. \"Tiger Shark\" is an historically significant film, as this movie provided the original template for a plot line which Warners recycled about two dozen times ... each time with just enough changes to fool the audience into thinking they were seeing an original plot. Except for stories which are in the public domain (such as Cinderella), \"Tiger Shark\" holds the all-time record for being re-made MORE OFTEN than any other movie ... each remake being \"disguised\" as a new movie. The basic plot is this: an older man with a physical handicap falls in love with an attractive young woman who owes him a favour. She marries him, more out of a sense of obligation than for love. Then she becomes attracted to a handsome young man who works alongside her handicapped husband. The young man returns her attraction, and they start having an affair. The husband discovers his wife's infidelity, and then (in the climax of the film) he and the younger man duke it out. That's the plot of \"Tiger Shark\", starring Edward G. Robinson, and it's also the plot of two dozen other Warners films which are uncredited remakes of \"Tiger Shark\". Compare this film to \"Manpower\" (1941), also starring Robinson. In \"Tiger Shark\" he plays a one-handed fisherman, with a hook at the end of his left arm. In \"Manpower\" he plays an electrical lineman with a limp. In both films, his love interest is a younger woman with a European accent: Zita Johann here, Marlene Dietrich in \"Manpower\". Robinson's younger rival in \"Tiger Shark\" (played by Richard Arlen) is basically the same character as Robinson's rival in \"Manpower\" (George Raft). The climax of \"Tiger Shark\" is a fight on the seashore; the climax of \"Manpower\" is a fistfight at the top of a telephone pole during a lightning storm. Once you allow for the change of setting, they're both the same film. I could make the same connections between \"Tiger Shark\" and about two dozen other Warners films, not all of them starring Robinson. \"Tiger Shark\" benefits from some excellent direction by Howard Hawks. Richard Arlen is unfairly forgotten nowadays, but he was the closest thing Hollywood had to Harrison Ford before Harrison Ford came along. (I'm referring of course to the modern Harrison Ford, not the silent-film actor of the same name.) Arlen gives a good performance here. Zita Johann is excellent here, hampered only by her thick accent. She retired early from films to marry the producer John Houseman, long before Houseman became an Oscar-winning actor. Johann's most famous role is the female lead in \"The Mummy\" opposite Boris Karloff. When Johann published her autobiography in the 1980s, the publishers' promo material played up the fact that Johann had co-starred with Karloff, but they managed to avoid mentioning *which* Karloff film she'd been in: apparently they were afraid we would think that Zita Johann was a \"scream queen\" actress who only starred in horror films. I'll rate \"Tiger Shark\" 7 out of 10 on its own merits, or 9 points if you're an aspiring screenwriter who wants to study this film so you can learn how a single plot line can be reworked repeatedly.",
         "Edward G. Robinson plays a one handed fisherman making his living on the California coast. Even with a hook for a left hand he does pretty good in his line of work. But that steel hook isn't exactly quail bait. One of his crew is lost to the sharks during a voyage and he brings the news home to his daughter Zita Johann. She's back home after having run away from the fishing life and has had a pretty rough go of it. Though she doesn't love him, Johann marries Robinson and then another Robinson's crew, Richard Arlen comes in to complicate things. Other reviewers have mentioned the gazillion times Warner Brothers recycled the plot of Tiger Shark in other locales. But actually Robinson had done a version of They Knew What They Wanted back in 1930 entitled A Lady to Love. That's the real origin of this plot. The fishing boat scenes are realistically handled and the principal players do a good job. But this story has been told better and told better by Mr. Robinson himself.",
         "You wouldn't know this was a Howard Hawks movie if you hadn't read the credits. It was a bit early in his ouevre for his obsessions to have firmed up. There isn't much in the way of a solidary professional male group into which a tough wise-cracking woman earns her way. There's male rivalry, though, and Quita is sui generis, with broad features and a low voice, prefiguring maybe Lauren Bacall, although by no means as devastating looking. The plot is rudimentary, going back to Camelot at least. A tuna boat out of San Diego, with Mike (Robinson) as skipper. He loses a crew member on a trip, comes home and breaks the news to the daughter, whom he is meeting for the first time. She's had a tough life. Mike, a generous outgoing likable guy with a scarcely believable Portugese accent, falls for her. She agrees to marry him but warns him that she doesn't love him. Mike doesn't care. He's not exactly a Jungian thinking type. On their wedding night, Mike throws a big bash at his colorful apartment on the docks. There is dancing, singing, eating and drinking. There are even family members, although how they sneaked into a Hawks film we'll never now. His later characters will not have much in the way of family background. Alas, over time, Quita and another of Mike's crew, Pipes (a funny nickname already!), come to feel a certain warmth for one another. When Mike discovers this he becomes enraged and tries to throw Pipes to the very sharks that took Mike's own forearm. \"Them!\", Mike hollers, \"they of the sea! They decide everything.\" Unfortunately for Mike, they decide in Pipes' favor. As Mike is bleeding to death, he retains his good cheer, showing a big smile as he nods gently off, \"They . . . decide everything.\" Again, it really isn't very Hawksian. Later in life, Hawks claimed that he always tried to have his heroes live at the end of the movie because, \"Why would anybody want to kill off characters that the audience likes?\" A perfectly reasonable question -- for another guy who was never a Jungian thinking type.",
         "Exciting film about a love triangle on the Monterey coast with Edward G. Robinson and Richard Arlen best friends and tuna fishermen. Robinson falls for bad girl Zita Johann who of course falls for handsome Arlen. Familiar storyline but Robinson is excellent as the Portuguese fisherman who battles the sea and the sharks to make a living. Arlen was a so-so actor but very handsome, and Johann had a strange exotic look. She's best remembered for The Mummy with Boris Karloff. Vince Barnett is funny and J. Carroll Naish has one scene. Leila Bennett plays a barber for some reason with pretty Toshio Mori as her assistant. Inez Palange plays a neighbor. Good film all around. But the highpoint is the truly remarkable footage of tuna fishing in a stormy sea.",
         "I had once taped this one off Italian TV (during a lengthy Howard Hawks season of films shown in English but with Italian subtitles) but my VCR developed a fault and the recording was subsequently unwatchable! I sure am glad to have caught up with it now\u0085 First of all, Edward G. Robinson is the whole show here: his portrayal of the central character, a Portuguese fisherman who sees himself as the best in the business and speaks in amiable broken English (his catchphrase is: \"Absolutely indeed\") is first-rate and it was also quite funny to watch him sporting an earring. The plot is predictable enough (a woman comes between two best friends and the situation is resolved through tragedy) but that may be because the same elements were recycled so many times, even by Warner Bros. themselves, over the years: SLIM (1937), THE WAGONS ROLL AT NIGHT (1941), Raoul Walsh's MANPOWER (1941; with Marlene Dietrich coming between Edward G. Robinson and George Raft), etc. Even more importantly, however, the imprint of director Howard Hawks is all over it: the vivid recreation of a man's world, the bonds which grow stronger through the everyday adversity which that entails, the invasion of a woman into this enclosed world which sets about the inevitable tragedy, etc. In fact, the brotherly (or even father-son) relationship seen here between Robinson and his younger protégée, Richard Arlen, is reprised in many another Hawks film \u0096 Pat O'Brien and James Cagney in CEILING ZERO (1935), Thomas Mitchell and Cary Grant in ONLY ANGELS HAVE WINGS (1939), Walter Brennan and Humphrey Bogart in TO HAVE AND HAVE NOT (1944), John Wayne and Dean Martin in RIO BRAVO (1959), etc; the unceremonious intrusion of the female character onto a perfectly ordered way of life is also seen enacted by Katharine Hepburn in BRINGING UP BABY (1938), Jean Arthur in ONLY ANGELS HAVE WINGS, Barbara Stanwyck in BALL OF FIRE (1941), Lauren Bacall in TO HAVE AND HAVE NOT, Joanne Dru in RED RIVER (1948), Margaret Sheridan in THE THING FROM ANOTHER WORLD (1951), Angie Dickinson in RIO BRAVO, Elsa Martinelli in HATARI! (1962) and Paula Prentiss in MAN'S FAVORITE SPORT? (1964); early on, the \"boys\" in TIGER SHARK are gathered around drinking and singing to their hearts' content \u0096 a similar instance occurs also in ONLY ANGELS HAVE WINGS, RIO BRAVO and HATARI! Besides Robinson's performance and the fascinating early look at the Hawksian themes elaborated on more fully in his later films, TIGER SHARK is also notable for its exciting fishing sequences especially the rather grisly (for their time) shark attacks; the scene where Robinson loses his hand to one of the marauding beasts is particularly effective. Actually, this viewing of TIGER SHARK has reminded me of several notable films which Robinson appeared in around the same time but with which I'm not all that familiar having watched them only once years ago, namely TWO SECONDS (1932), THE MAN WITH TWO FACES (1934), John Ford's THE WHOLE TOWN'S TALIKING (1935), Hawks' own BARBARY COAST (1935), THE LAST GANGSTER (1937), A SLIGHT CASE OF MURDER (1938), THE AMAZING DR. CLITTERHOUSE (1938), CONFESSIONS OF A NAZI SPY (1939), THE SEA WOLF (1941) and MANPOWER!",
         "Sorry, I forgot to add a point to my comment that was rather an important one, at least to me. Tiger Shark was shot in the early 1930s and there are some interesting scenes of men sailing their boat into a school of tuna, guided by a lookout, then lining up in the leads and pulling the fish in using flexible poles, one at a time. The scenes are authentic and exciting. Alas, they are history. Tuna fisherman now use \"long lines.\" (Koreans and Japanese have huge industries built around this technique.) The fishing boat now needs a smaller crew (less expensive) because there no longer any mano a mano contests between fish and man. The crew simply strings out long fishing lines, guided by sonar, more than a mile long, with baited hooks fixed to the lines at short, regular intervals, set for a given depth. This has proved far more lucrative than fishing exclusively for tuna with poles. The long lines have a tendency to clean everything that swims out of the sea; not just tuna but sharks, sea turtles, porpoises, and game fish like marlin (which can't be legally sold). By the time they are harvested, many of the animals are already dead, especially the air-breathing turtles and porpoises. The industry has become much more efficient and without passion. Mike probably wouldn't have approved but the organization that would now own his boat would have.",
         "Edward G. Robinson is Mike, a Portugese immigrant who makes his living as a fisherman in \"Tiger Shark,\" a 1932 movie also starring Richard Arlen and Zita Johann. Mike loses his hand while trying to save Quita's (Johann's) father from a shark, but he does manage to save his buddy Pipes. He falls in love with Quita when they meet, and, seeing that she is alone, he eventually proposes. She accepts but says that she does not love him. He apparently doesn't notice that one of his mates, Pipes,(Richard Arlen) has a crush on Quita, so Pipes is around a lot. This is a very dated and movie with stiff performances from everyone but Robinson. The character of Mike is very stereotypical now, but probably wasn't back then - the paunchy immigrant, kind of dumb, with false bravado, and don't forget about the hook for a hand. Very similar to \"They Knew What They Wanted.\" There are endless scenes of fishing, which these men did with poles and harpoons, not nets. It looked dangerous, and I guess if Quita's father died and Mike lost his hand, it was. The pretty Roumanian actress Zita Johann, who was married to John Houseman, is effective as Mike's shy, young and grateful bride - but after she spots handsome Pipes, she realizes gratitude can only take one so far. Here she's dressed plainly with little makeup - but one can see that with the Dorothy Lamour treatment, she probably looked very exotic. Arlen, of \"Wings\" fame, is pretty hunky. He died in 1978 and worked practically until his last breath, giving him a career span of 57 years. His heyday, however, was in the silent era. Edward G. Robinson is excellent as always, but the film just doesn't hold up today. Robinson proved early on that he could do just about anything, though in the '30s, he was most often cast as a thug. When you see Mike in action toward the end of the movie, you'll realize this role isn't that far from what he did as Little Caesar. I can't really recommend this unless you're interested in fishing circa 1932.",
         "Portuguese fisherman (Edward G. Robinson) loses a hand to a shark and later loses his young wife (Zita Johann) to his best friend (Richard Arlen). He doesn't like it. A simple plot that was reused by Warner Bros. many times over the years. It's an okay early film from Howard Hawks. Worth watching for Robinson's colorful performance. Eddie G's sporting an earring and a hook for a hand, folks. It's not Shakespeare but it's hard to look away. Real maritime footage is a plus. Classic horror fans will recognize Zita Johann from The Mummy, which was released this same year. She's a lot more subtle in this than in that film.",
         "The plot of this film is nothing to write home about. Other reviewers have aptly summed it up as the quintessential love triangle. There are two things that make this film rise above 4 or 5 stars out of ten. The first is the great footage of commercial fishing as it was practiced circa 1930. It really was man versus the sea back in those days. There is also some footage of how the fish is delivered and then processed once the fishing boat docks. The second thing that makes this an interesting film is the odd combination of Edward G. Robinson on the way up, Richard Arlen on the way down, and Zita Johann in one of her few film appearances before she shrugged her shoulders and walked away from film after she decided she didn't need all the irritation she had to deal with as a Hollywood star. Edward G. Robinson was a newcomer to talking films, having only one credited film appearance in silents, that being in 1916. Not a classicly good-looking man, he was fascinating to watch in almost any role because of his talent for drama as well as comedy. Richard Arlen was a great leading man over at Paramount, and even retained his position at that studio for a few years after sound came in. He had the looks, he had the voice, but his popularity fizzled nonetheless. Zita Johann does not have, as others have mentioned, a thick accent. Her diction is perfect, and she has exotic looks that can only be compared to Kay Francis. Thus these three are thrown together in this film in exactly the way you'd believe them to be. Robinson as the likable fisherman, Mike, with a big heart who can't get a girl to love him because he is missing a hand that was taken by a shark. Zita Johann is the daughter of a fisherman on Mike's boat who falls overboard and is killed by a shark. Mike nurses her back to health - she is ill at the time her father dies - and takes care of her in general so that she feels beholden to marry him, plus she thinks she is through with love and feels that Mike will do as well as any man. Finally there is Arlen as Pipes, handsome friend of Mike. He and Mike's new wife fall in love but do not want to hurt someone that they feel has been very good to them. There are two big problems with this plot. In execution, the problem is that we don't see any relationship build between Mike's wife and Pipes. She just announces to Pipes one night that she loves him and that is that. I realize there is not much room for character development in a 75 minute film, but they could have let this build a little bit. In concept, the whole fact that someone as likable as Mike would not be able to attract a woman just because he is missing a hand is a bit much. Women have not now nor have they ever been attracted to men just because of looks. Character counts a good deal more. This is a case of a man writing about women as though they were men. In summary, if you run across this one it is always worthwhile to see Edward G. Robinson in action, but don't lose any sleep if it never comes your way.",
         "Tiger Shark (1932) *** (out of 4) A lonely fisherman (Edward G. Robinson) marries a girl out of pity only to see her fall in love with his best friend. Director Howard Hawks does a very good job at showing off a wide range of emotions from sentiment to laughs to some very intense shark attack scenes. Robinson clearly steals the show with his touching performance but the supporting roles are good too. Another highlight is seeing the old time assembly line of having the fish removed from the boat and cleaned all in the matter of minutes. Apparently Warner loved this story so much that they remade it three times within the next ten years including Robinson returning in Manpower.!!!",
         "When Spencer Tracy played the Portugese fisherman in MGM's \"Captains Courageous\", he dealt with wags laughing at him for his Chico Marxx hairdo. Here, Edward G. Robinson has the same job and the same issue. If, unlike, Spencer Tracy, he didn't win an Oscar for his performance, he still rates an \"A\" for giving an excellent portrayal in an entertaining if sometimes over-the-top and gruesome melodrama. The story of Portugese fisherman Robinson starts when he is revealed to be one of three survivors of a capsized boat off the coast of Baja California in shark infested waters. Robinson immediately disposes of one of them into the briny sea after attempting to steal their water supply. The other sole survivor is young Richard Arlen who fights off the sharks right before one of them bites off Robinson's hand, leaving him an American version of Captain Hook. Robinson and Arlen become buddies and share many adventures together. Later, Robinson must visit young Zita Johann to tell her that her father was killed at sea, and ends up marrying her. But Arlen strikes her fancy in spite of her initial rejection of him, and when Robinson sees them in a romantic clinch, he plots revenge. Set on the Mexican Pacific coast for its fishing sequences and near San Diego for its dramatic story, \"Tiger Shark\" is an enjoyable mix of action and melodrama. Robinson provides a very layered performance as the rather ruthless fisherman who is loyal to his crew members but deadly to his foes. His final scene really sums up what is inside this character as he faces his own mortality. The film was remade several times by Warner Brothers, most notably as \"Manpower\" (1941), where Robinson played basically the same role, co-starring George Raft and Marlene Dietrich. That version switched the story from deep sea fishing to the world of men who repair electrical lines, and was used as a major plot device in the Warren Beatty gangster bio \"Bugsy\".",
         "This film is essentially the same movie that was remade MANY times in the 1930s and 40s. While the setting has changed, the essential plot elements were used again and again in such films as MANPOWER (1941) and DANGER LIGHTS (1930). For a really good discussion of this, try reading the review by F. Gwynplaine MacIntyre (Borroloola@earthlink.net). While he says that TIGER SHARK was the first of these types of films and I think it the earlier film DANGER LIGHTS (and perhaps some even earlier ones), his analysis of the genre is very insightful and so I don't want to just rehash what he wrote. The movie seems in the 21st century to be a very predictable relic and nothing more. While it is mildly entertaining, the plot itself just seems silly and over-the-top in many ways--especially in how it portrays tiger sharks as the impossible to stop killing machines! As far as the acting goes, it's a one man show--with Edward G. Robinson dominating all the scenes as a Portuguese-born fisherman. At times this portrayal is pretty good but at other times the character just seemed histrionic and overplayed. Robinson fans certainly won't remember this as one of his better films. My advice is if you are a huge fan of Warner Brothers or Edward G. Robinson films, certainly you should watch this movie. Otherwise, it's very skip-able and one that might provide a few unintended laughs.",
         "Edward G. Robinson (Mike), Richard Arlen (Pipes Boley), Zita Johann (Quita Silva), Vince Barnett (Fishbone), William Ricciardi (Manuel Silva), J. Carroll Naish (Tony), Leila Bennett (Muggsey), Maurice Black (Fernandez), Sheila Bromley (Red), Edwin Maxwell (doctor), Toshia Mori (lady barber), Henry Otho, Harry Semels, Pedro Regas, Hector Sarno (crewmen), Inez Palange (Mike's neighbor). Director: HOWARD HAWKS. Screenplay: Wells Root. Based on the story, \"Tuna\", by Houston Branch. Photography: Tony Gaudio. Film editor: Thomas Pratt. Art director: Jack Okey. Costumes designed by Orry- Kelly. Music: Bernhard Kaun. Music director: Leo F. Forbstein, conducting The Vitaphone Orchestra. Marine supervisor: Captain Guy Silva. Stills: Mac Julian. Assistant cameraman: Carl E. Guthrie. Assistant director: Richard Rosson. Sound recording: C.A. Riggs and A.D. Mair. Associate producer: Bryan Foy. Copyright 3 September 1932 by First National Pictures, Inc. Released through Warner Brothers Pictures, Inc. New York opening at the Winter Garden: 22 September 1932. U.K. release: 4 March 1933. 8 reels. 77 minutes. SYNOPSIS: A triangle love story between the boastful skipper of a tuna boat, the daughter of a deceased crewman, and a sailor whom the skipper has rescued from the sea at the cost of his left hand. COMMENT: Here's Edward G. Robinson hamming it up for all he's worth in this awful fishing yarn which is not only a waste of time, but unduly gruesome and cruel to boot. I beg pardon. There is one redeeming feature. Her name is Zita Johann, the exotic heroine of one of my favorite cult films, The Mummy (1932). In fact, The Mummy was Miss Johann's very next movie, but what a contrast to her role in this time-wasting tosh. True, she does what she can with this poorly-written cliché of a role, but she'so hemmed in by loud-talking Robinson, nondescript Arlen and unfunny funnyman Barnett, she's given little chance to make any but the most superficial impression. Hawks's disinterested direction doesn't help. At times, he even forgets the story entirely and turns the movie into a boring (and often hideous) documentary about tuna fishing. As for Robinson, this is undoubtedly his worst performance ever. His constant attempts at a funny accent are never less than appalling. I repeat: If it were not for Zita Johann, this movie would be qualified for instant dismissal in the nearest trash bin.",
         "***SPOILERS*** Edward G. Robinson looking as well as talking like a Mexican Bandito then a Portuguese fisherman is \"Mighty\" Mike Mascarehas the greatest fisherman this side of the Pacific Ocean. Mike who earlier in the movie lost his left hand to a tiger shark who bit it off while he was knocked out trying to rescue his fishing partner Manuel \"Manny\" Silva, William Ricciardi, who was devoured by a school of sharks tailing his boat. Fully recovered with a hook for a hand, that comes in handy in scratching his back, Mike goes to see Manny's daughter Quita,Zita Johann, to tell hr the terrible news about her dad ending up as shark bait and never, in being lost at sea, to be seen again even at his own funeral! It's then that Cupid's arrow strikes Mike through the heart and he falls madly in love with the pretty Quita even though she tells him she's not in love with him. This doesn't seem to matter to Mike who feels that he can win over Quita's love after he marries her and shows her what a great fisherman, as well as lover, that he really is. Finally giving into Mike and marrying him it soon turns out that Mike's good friend, who saved Mike from bring eaten alive by sharks, All-American looking Pipes Boley,Richard \"Dick\" Arlen,gets Quita's attention and despite Pipes doing his best to avoid it the two fall in love with each other. It's later that Mike recovering from a drunken binge finds both Pipes and Quita in each other arms that he plans to do both lovers in before his next planned, with Quita joining in,fishing trip! ****SPOILERS****Mad and drunk with revenge Mike attacks and knocks out Pipes and plans to feed him to the sharks with the crewmen on his boat locked up in their cabins helpless to do anything to save him. It just happens that Mike's leg got tangled in a rope and he ends up in the water with a bunch of hungry sharks about to have him for lunch. Pipes now recovered from the beating he got from Mike jumps into the shark infested water and rescues him only after he goes into shock and later dies of his injuries. It's in the last moments of his life that Mike finally realizes just what a jerk he was telling him and Quita how sorry he was for all the trouble he caused for them. A fitting ending for a man who never knew who his true friends were until he faced death straight in the eye and was saved by the very one -Pipes- he just moments before tried to murdered.",
         "How many times has this plot been used? The older guy--hearty, well-liked, a good man--wins the pretty young thing, but she's attracted to his best friend. It's like \"They Knew What They Wanted,\" with Edward G. Robinson changing Charles Laughton's Italian accent to Portuguese and becoming an ace fisherman instead of a vintner. He's wonderful, in a showy yet subtle performance, and the beautiful Zita Johann is a prize worth fighting for. The writing isn't wonderful, though--we never understand why this lying blowhard is so popular, and the third side of the triangle, Richard Arlen, is given no personality at all. Howard Hawks must have liked the maritime setting, or just being on a boat, because there are yards of irrelevant footage of tuna fishing, leading to a climax that's not very clearly edited (just how does Arlen get out of this, and why does Eddie G. do such a turnaround?). But it leads to a moving big finale. It's atmospheric, with lots of outdoors shooting that makes it seem less studio-bound, and Robinson is always worth watching.",
         "Those of us who read the entire book \"Moby Dick\" will remember interminable scenes devoted to descriptions of whale hunting and harvesting. That's how \"Tiger Shark\" seems: lots of extended scenes of tuna fishing and processing the catch. It really does serve to set a mood, and of course it juxtaposes the everyday life of a fisherman with the out-of-the-ordinary plot. And anyone with an interest can see how tuna fishing was actually performed in the Thirties. Big deal. For me, the movie started dragging from the git-go. I found Edward G. Robinson's unconvincing Portuguese patois boring from the first line, and his mother-lode of innocent jibber-jabber seemed grafted artificially onto the Robinson persona while never actually gelling. (John Wayne had a more successful outing with an accent when he played a Swede in an early film.) Then this Pipes-Quita romance comes along. Comes from out of nowhere. Suddenly she's in love. PUH-leese. A little poetic motivation might help things. Add the sappy ending. Yep, a solid \"3\"."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["First National Pictures"],
      "summaries": [
         "Mike is a great tuna fisherman though he lost a hand to a shark years earlier saving Pipes Boley. Now Mike is happily married to Quita and doesn't notice that Pipes and Quita are falling for each other.",
         "A tuna fisherman marries a woman who doesn't love him."
      ],
      "budget": 0
   },
   "movielensId": 173805,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-09-24",
      "dvdReleaseDate": null,
      "directors": ["Howard Hawks"],
      "runtime": 77,
      "movieId": 173805,
      "title": "Tiger Shark",
      "mpaa": "",
      "actors": [
         "Edward G. Robinson",
         "Richard Arlen",
         "Zita Johann",
         "Leila Bennett",
         "J. Carrol Naish",
         "Vince Barnett",
         "William Ricciardi"
      ],
      "imdbMovieId": "0023594",
      "originalTitle": "Tiger Shark",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A Portuguese tuna fisherman (Edward G. Robinson) catches his bride (Zita Johann) with his first mate (Richard Arlen).",
      "tmdbMovieId": 109262,
      "avgRating": 3,
      "releaseYear": "1932",
      "numRatings": 1,
      "posterPath": "/3GePbdEK5QgPeTHunIxFnyCFFvb.jpg"
   }
}