{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "devil",
            "id": 14999
         },
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "trick film",
            "id": 211467
         }
      ],
      "imdb_id": "tt0000614",
      "video": false,
      "title": "The Red Spectre",
      "recommendations": [
         31338,
         128359,
         194091,
         196595,
         171430,
         188417,
         196372,
         196123,
         195617,
         119961,
         195292,
         195584,
         119958,
         119984,
         119959,
         19037,
         119977,
         137412,
         189055,
         195635
      ],
      "backdrop_path": "/fwTUE7TmVzutaOxcq9lWBofSfig.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 3,
            "character": "",
            "gender": 0,
            "credit_id": "554c7e15c3a3685e5b0040de",
            "name": "Julienne Mathieu",
            "profile_path": null,
            "id": 1119494,
            "order": 1
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ae19251416c910c8c8b",
               "name": "Segundo de Chomón",
               "profile_path": "/2AwyXxegB4Mbf86JatXAQpD5Vlh.jpg",
               "id": 41616,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ae19251416c910c8c91",
               "name": "Ferdinand Zecca",
               "profile_path": null,
               "id": 1079361,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.608561,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 150396,
      "vote_count": 8,
      "budget": 0,
      "overview": "A demonic magician attempts to perform his act in a strange grotto, but is confronted by a Good Spirit who opposes him.",
      "similar": [
         31135,
         71676,
         52520,
         140607,
         622,
         460793,
         10527,
         568,
         597,
         37724,
         19,
         54138,
         158852,
         157336,
         56292,
         155,
         81003,
         68726,
         75612,
         101299
      ],
      "original_title": "Le spectre rouge",
      "runtime": 8,
      "poster_path": "/b2BO4mipJZgidWD568DKv8j1ugZ.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Pathé Frères",
         "id": 21594,
         "origin_country": ""
      }],
      "release_date": "1907-01-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Segundo de Chomón",
         "Ferdinand Zecca"
      ],
      "runtime": 9,
      "synopsis": null,
      "writers": ["Segundo de Chomón"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0000614/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "The first decade of the twentieth century saw the production of dozens of brief \"trick films\" which pushed the boundaries of the new medium, and France was the capital of this activity. Georges Méliès is the best known creator of these films, but The Red Spectre, which was produced at the Pathé Studio as a collaboration between Méliès' fellow pioneers Ferdinand Zecca and Segundo De Chomon, is perhaps the most bizarre and fascinating of them all. Or at least, allowing for the fact that so many of these films are lost, it certainly ranks with the best of the survivors. It is better seen than described, genuinely dreamlike in its images and transitions, and quite strange, but quite satisfying as well. The action lasts only about 8 or 9 minutes, but when it's over you feel as if you've been permitted to visit another world. When The Red Spectre was first exhibited the black & white footage was hand-colored to produce a dazzling effect, and happily, this material survives: a color print was discovered in a junk-yard in Mexico, and purchased for $25.00! Our setting is a mysterious underground grotto, and our \"host\" is a demonic magician who seems to be toying with the souls or spirits of several captive women. He causes them to levitate, then burst into flames; he captures their ashes in bottles, brings them back to life in miniaturized form, etc. The magician is opposed throughout by a Good Fairy who resembles Peter Pan (portrayed by a woman, as Peter traditionally is on stage). The precise meaning of the action is difficult to determine at times, but the central conflict amounts to a struggle between the forces of Good and Evil. One effect is especially notable: when the wicked magician produces three glass bottles, each holding a tiny woman prisoner, and brings them downstage to allow for a close-up, the scene instantly reminds latter day viewers of a similar sequence in The Bride of Frankenstein (1935). Did James Whale see this film, or is the similarity a coincidence? Notable, too, is the depiction of a device very much like television-- strongly suggested by the evil conjurer's magic screens, each of which depicts a series of moving images. Here's a real cinematic milestone: a film that predicts the coming of T.V., and, on top of that, attributes its invention to a demon!",
         "The Red Spectre is a trick film from France in the style of Georges Méliès; although this one was directed by Ferdinand Zecca. It has all of the visual invention you would expect and it also has a nice red coloured tint which is perfect for its atmosphere. It's set in an underground cavern and features a demon warlock. This evil character possesses souls of several women. He manipulates them in several ways and generates television-like screens. All the while he is counterbalanced by a female nemesis that thwarts his evil actions and ultimately destroys him. It may be a short film but it's full to the brim with visual ideas. Characters appear and disappear, are shrunken and burst into flames. Walls are constructed and turn into giant monitors and rock faces move aside to show a cavern full of hell-like fires. It's relentlessly inventive basically. Worth seeing if you like the visual innovation of the earliest days of cinema.",
         "If you've seen any of Georges Melies films there probably isn't anything here that you haven't seen before and, apart from one brief sequence, this film is pretty dull as a result. The film takes place in an underground cavern where a skeletal demon amuses himself by conjuring up a couple of hypnotised girls whom he wraps in plastic sheet before levitating them. The sheets burst into flames as they hover before the demon makes them disappear. A good spirit then appears to repeatedly spoil the demon's fun. This goes on for the best part of ten minutes and, to be honest, it gets a little tedious after a while. The one good sequence comes when the demon places three jars on a table then carries the table towards the camera. It's an unusual shot for 1907 and is quite effective - as is the demon's make-up.",
         "I must say I had expected more of this, though I did quite enjoy myself. I came across a version without music, but I'm sure it's not intended that way, so I chose some Spanish guitar songs from Pepe Romero to play as soundtrack, and it sufficed for the greater part. The 'story' was pretty hard to follow, although all there seems to be going on is a horned reaper / magician performing his black arts on some harmless, innocent women (but are they ever...?), but in the end he meets his demise through one of them. It's full of visual playfulness and ingenuity that makes it quite pleasing to the eye, though I had expected a little more in terms of different settings and such. Still, this is very much up my alley. 8 out of 10.",
         "\"Le spectre rouge\" or \"The Red Spectre\" is a French silent film from 1907, so this one has its 110th anniversary and it is a collaboration between Segundo de Chomón and Ferdinand Zecca, two of the greats from the early days of film, even if their names don't mean anything to most people today. It's their loss as these two were highly prolific and successful back in the day. And there work here looks spectacular in terms of effects, costumes and even colors. The red referenced in the title was nothing short of amazing and this movie was certainly far ahead of its time. But that is also a problem because the medium was not yet ready for the minds of SdC and Zecca and the evidence are these 9 minutes here. Without the use of sound or at least intertitles, it is virtually impossible to understand even very basically what was going on. Such a shame as this little film looked so good. But story trumps everything and that's why eventually I give it a thumbs-down. Not recommended.",
         "Before I go into this film I would like to point out that it and another film by the same person entitled \"Satan at Play\" appear to be one and the same, though I haven't seen the latter. Still, IMDb gives both titles a page, and both titles have reviews written on them. They must have made a mistake, because the still from \"Satan at Play\" that I've seen is the exact same still from this film! Still I'm confused because the grotto shown in the stills on this IMDb page look purple; the version I saw the grotto was kind of brownish. Have I seen \"Satan at Play\" \"The Red Specter\" or both? You tell me. Now to the film (the one I saw, with the light brown color). It's all about a mysterious specter who puts on a diabolical magic show. First he makes women appear and disappear. After that he levitates a few after rolling them up in tarp, then makes the tarp catch on fire. Then, he comes up close to the camera and shows us the spirits of the girls he levitated in bottles. After that he proceeds to make movie screens out of bricks, (a trick Chomón also used in \"Magic Bricks.\" Throughout the magic act he is constantly visited by a rival magician, who at the end destroys him. For 1907 this was actually a full-length feature, at 10 whole minutes long. The beginning is entirely tinted red, but later other colors come into play. The demon's makeup is really quite beautiful a ghastly, and the sets are pretty good. There is not really much of a plot, and it's basically just a magic show, a long one at that. 10 minutes is a long time for a simple trick film and the acts can get tiresome for such a long amount of time. It's still a nice film, and fans of Georges Méliès's work should give it a look.",
         "Also, the story for this is somewhat confusing; if I hadn't seen the brief plot summary on Letterboxd, I wouldn't know (until near the end anyway) that this was about a Good Woman fighting the devil or a demon of hell or whoever this guy in a robe and skull-face is. It seemed if it was about a woman who might have even been this demon's boss, or maybe even some annoying underling, screwing with this Demon-Man has a penchant for bottling up women (literally, you can see this in full close-up, and that's how it seems - a full 8 years before Griffith did it in in Birth of a Nation you get a close-up, albeit in camera and with separate shots without a cut). But at any rate, this is a fun short because the filmmaking is clever and inventive: we're seeing the process this devil takes with his female wares/prisoners, and it's through blazing red and orange colors (thanks silent film technology!) and with a magician's eye for trickery. By the end 'good' does prevail, but the joy is in the evil, if that makes sense; it's filmmakers reveling in the villainy of this Demon, or at least playing with the line between showing something as being *bad* as in a devil, or something that is... enjoyable to do, like, uh, bottling up women and making them prisoners. Or slaves. Or, I don't know what. This is simply cool, and it also empowers women to fight Satan's ways at the end of it all! How to do that, well, don't look at this for answers to that question, just watch magic tricks!",
         "\"The Red Spectre\" is simply a themed stage magician's routine enhanced by trick photography. One needn't trouble over any real plot line, and there isn't any point to what happens to the women in the routine; they're all Lovely Assistants assisting the magician! Notice how they pose becomingly in their pretty costumes, preen, dance and nod to the audience? Even the three shown miniaturized in the milk bottles look quite happy and pleasant, since they're just doing their job of being decorative parts of the act. The \"Good Fairy/Spirit\" looks more like a rival magician (notice her bat-winged cape), and far from being a contest between Good and Evil, it's more a challenge between equals. This adds a bit more narrative, an element of conflict, but really doesn't seem intended to convey any deep significance. The sorceress is almost another Lovely Assistant, just with a more active role and showing more leg. Notice that far from deploring his dark powers, she appears to absorb them herself at the last by assuming his cloak after having vanquished him. This is a charming example of stage technique of the time, and the final scenery effects and beauty pageant are quite delightful. Just watch it as an old-time magic act and it makes perfect sense!",
         "The Red Spectre (1907) ** 1/2 (out of 4) Mildly entertaining French film from director Ferdinand Zecca was clearly influenced by the work of Georges Melies. In this film, in what appears to be Hell or something like it, a skeleton brings to life a couple women and then begins to do various tricks with them. That's pretty much everything you need to know in regards to the story as everything else is just one trick after another. There are a few good things about this film but at the same time it's just so easy to see that it's no where near the league of Melies and you have to feel that the French master was doing this type of film a decade earlier and doing it much better. I think the biggest problem is that there's really no strong pacing and after a while the 9-minute running time just feels like it's dragging along. There are several of the tricks, which simply aren't that entertaining and for one good example just check out the one where the skeleton wraps a woman up in some sort of tarp. How the trick was done is easy to spot. There are some good things however and this includes the scenery, which is quite nice to look at. The biggest highlight has to be the very good tinting and especially the reds."
      ],
      "genres": [
         "Short",
         "Fantasy"
      ],
      "productionCompanies": ["Pathé Frères"],
      "summaries": [
         "In a strange grotto deep in the bowels of the earth a coffin uprights itself, dances, then opens, and out steps a demonic magician with skeletal face, horns, and cape. He wraps two women (who appear to be in a trance) in fabric, levitates them, and causes them to burst into flames and disappear. As he gathers their ashes in a pitcher a Good Spirit [a young woman who resembles Peter Pan] appears, shakes her head No, and reveals the \"souls\" of the two women in a secret compartment deeper within the cave. The Good Spirit vanishes in a puff of smoke. The magician then produces 3 glass bottles on pillars, takes them downstage close to the camera, and reveals 3 tiny women in them; one woman beats a tambourine while the other two sway. The magician pours ashes (?) into the bottles, but the Good Spirit reappears and makes these trapped figures disappear in a flash, angering the magician, who chases her away. He makes an easel appear. There is an odd sort of screen on it bearing the Pathe rooster logo. The magician then invents channel-surfing, causing three different \"shows\" to appear on the screen in rapid succession. The Good Spirit reappears and causes this strange television set to vanish, but the magician creates two more in turn, each more elaborate than the last, with various images of persons and dogs flashing across their screens. Finally, the Good Spirit reveals to the evil magician an area within the cave where there are four pillars and a tableau of distinguished-looking ladies (goddesses?). She takes the magician downstage, forces him to the ground, pours a pitcher of something on him (ashes? Holy water?) and turns him into a lifeless skeleton, which she reveals to the camera. Three tall flames appear in the foreground, and the film is over.",
         "Deep into the unfathomable chasms of Hell, enfolded by the eternal darkness of a metaphysical space/time dimension, a malevolent spirit manifests out of thin air, and without delay, commences an unholy ritual. Suddenly, five condemned women appear--and through a series of dark incantations combined with ancient sorcery--the demon manages to extract their immortal souls. Before him, three mournful sacrificial urns await to seal their fates, while visions of a life that is no more, echo within the cavernous purgatory. Undoubtedly, such is the work of humanity's arch-enemy, nevertheless, a benevolent light-bearing spirit who is ready to thwart the fiend's plans intends to defend the lost souls, in a great battle between Good and Evil. Is there an escape from the abysmal pits of Tartarus?",
         "A demonic magician attempts to perform his act in a strange grotto, but is confronted by a Good Spirit who opposes him."
      ],
      "budget": 0
   },
   "movielensId": 174183,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1907-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Segundo de Chomón",
         "Ferdinand Zecca"
      ],
      "runtime": 8,
      "movieId": 174183,
      "title": "The Red Spectre",
      "mpaa": "G",
      "actors": ["Julienne Mathieu"],
      "imdbMovieId": "0000614",
      "originalTitle": "Le spectre rouge",
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A demonic magician attempts to perform his act in a strange grotto, but is confronted by a Good Spirit who opposes him.",
      "tmdbMovieId": 150396,
      "avgRating": 2,
      "releaseYear": "1907",
      "numRatings": 1,
      "posterPath": "/b2BO4mipJZgidWD568DKv8j1ugZ.jpg"
   }
}