{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "trick film",
            "id": 211467
         }
      ],
      "imdb_id": "tt0223622",
      "video": false,
      "title": "The Magic Lantern",
      "recommendations": [
         195960,
         190694,
         230964,
         127098,
         190574,
         195092,
         230951,
         195114,
         196534,
         190563,
         143770,
         196625,
         148547,
         120037,
         120036,
         90839,
         131933,
         231040,
         189578,
         195073
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "",
            "gender": 0,
            "credit_id": "58b4b65ac3a3685f1e001c0e",
            "name": "Georges Méliès",
            "profile_path": "/cjQ3IvPbkNArGjhj4dkGqEwOgdW.jpg",
            "id": 11523,
            "order": 1
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4bb29251416c7510b145",
            "name": "Georges Méliès",
            "profile_path": "/cjQ3IvPbkNArGjhj4dkGqEwOgdW.jpg",
            "id": 11523,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Fantasy",
         "id": 14
      }],
      "popularity": 0.611783,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 147746,
      "vote_count": 10,
      "budget": 0,
      "overview": "Two impish clowns construct a magic lantern. They prop it up at an angle, and use it to project pictures onto a wall. When the picture show ends, they open up the lantern to reveal a group of dancing girls inside - and this is only the first of the indications that this lantern really is magical.",
      "similar": [
         31135,
         52520,
         140607,
         460793,
         10527,
         568,
         597,
         37724,
         19,
         54138,
         158852,
         157336,
         56292,
         155,
         81003,
         68726,
         75612,
         101299,
         87421,
         383498
      ],
      "original_title": "La Lanterne magique",
      "runtime": 5,
      "poster_path": "/lRP9udvPhQaUG0UG6gc40vEgrX0.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Star-Film",
            "id": 7159,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Georges Méliès",
            "id": 37046,
            "origin_country": ""
         }
      ],
      "release_date": "1903-01-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Georges Méliès"],
      "runtime": 3,
      "synopsis": null,
      "writers": [],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0223622/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "After Robert W. Paul's \"The Countryman and the Cinematograph\" (1901), as well as the Edison Company's remake of Paul's film, \"Uncle Josh at the Moving Picture Show\" (1902), Georges Méliès's \"The Magic Lantern\" is the earliest film that I know of that self-reflexively has as its subject a cinema screening. Self-reflexive films have been of exceptional interest to me and that this one is very early makes it even more precious. Aside from the self-reflexive element, this is a typical trick film by Méliès. He had previously used the tricks he employs here, including the multiple-exposure technique used for the projected film-within-a-film. Paul also used the same technique in his film. Moreover, both self-reflexive films were, as would often be the case, comedic. Yet, there are notable differences between this film and Paul's film. First, Méliès's film doesn't take place in a theatre, but rather is supposedly set in a nursery, and the characters we see are toys that have come alive. Second, the projector of the motion pictures is a magic lantern with circular vignettes projected upon a black wall. The circular framing was typical of magic lantern slides, but what is projected are certainly not slides, but are motion pictures. It's a curious choice that Méliès would pretend the magic lantern capable of projecting motion pictures, although magic lantern shows were commonly used between films in exhibitor's programs back then (including in Méliès's shows at his Robert-Houdin Theatre), and the magic lantern was a notable precursor of cinema in respect to the projection of images. The third and more important distinction between Paul's film and Méliès's is in their insight into the medium. \"The Countryman and the Cinematograph\" was ingenious for its time in this respect, as it explored film's doppelgänger role and its deceptive nature. \"The Magic Lantern\" also takes up the doppelgänger theme: the film-within-the-film begins with a bewigged eighteenth century man and woman kissing (in a medium close-up shot reminiscent of the Edison Company's \"The Kiss\" (1896), which must have set the standard, as cinema's first kissing scene, for such framing) and then dissolves to images of our two toy characters. As was the case in Paul's film, the characters are astonished to find themselves watching their doubles. Although Méliès had discovered many cinematic tricks in the nearly eight years since he attended the Lumière brothers' first commercial screening on 28 December 1895, he still revealed cinema's greatest trick to be its nature of reflection. To top it off and depart from ground already touched upon in Paul's film, the magic lantern is taken apart to introduce six dancing girls. Another dancing girl (Zizi Papillion) comes from out of frame to perform some can-can kicks and other acrobatics. They leave, but then even more dancing girls turn out from the magic lantern, with Papillion returning for more can-can kicks, at which point the two toys fight for her affections. Toy soldiers come to break this up, but soon we're back to more dancing girls. It's not a very sophisticated conclusion, but it's light entertainment typical of Méliès's trick films, and, besides, Zizi Papillion had quite a kick.",
         "Here's another very brief (4 min.) movie from the stage conjurer Georges Méliès, not as elaborate as his famous Trip to the Moon, but sweet and funny. The Magic Lantern features Punch and Pierrot, two painted Commedia Dell'arte clowns, cavorting in a child's bedroom with over-sized props. The clowns assemble an enormous magic lantern, place a candle inside it, and project moving images onto the wall. After viewing a selection of brief film clips, including a kissing couple, the clowns collapse the sides of the lantern to reveal a surprising number of dancing girls inside. (After all, if it's a Méliès film there must be chorus girls!) A vigorous dance is performed, and one spectacularly athletic brunette dancer seizes the moment and steals the show. At that point, a fight breaks out between Punch and Pierrot over the girl's affections. The other girls flee, and gendarmes arrive. I won't spoil the ending, but it's safe to say the cops soon regret their attempt to intervene.",
         "This creative little feature is one of the more entertaining of Georges Méliès's many short visual effects movies. It has some witty ideas that are put onto film with good craftsmanship and plenty of energy, and it is not without some light but subtle commentary as well. It starts with two clowns setting up a \"Magic Lantern\", and then they use it both as expected and in unexpected ways. There is quite a variety of visual effects, and almost all of them are executed carefully and nearly seamlessly. The tricks with the dancing girls might be particularly impressive, since it clearly took some doing to make them work. The pace also builds nicely, from an easygoing start to increasingly manic activity. It works well, and makes for good entertainment.",
         "This might be a film from the early days of cinema but Melies was already a seasoned practitioner of the infant art back in 1903 and it shows in this relatively sophisticated special effects short. The premise is simply - as all films were back then: two clown dolls create a magic lantern in a child's bedroom and project moving images onto a bedroom wall before revealing a small army of dancing girls concealed in the lantern. The film begins to resemble a variety show at this point before culminating in a fairly surreal sequence featuring an abnormally tall figure taunting the police who arrived to break up the clowns who began fighting over the affections of one of the dancing girls. The film is quite amusing, but even at less than five minutes it seems a little overlong.",
         "Georges Melies really outdoes himself in The Magic Lantern. We see two clown-like men assembling a giant projector lantern where we see film of some couples talking. Then it opens to reveal some dancing girls followed by one particularly athletic one. Then they close and open the lantern to reveal some more girls, this time some slow ballet dancers. Then the police come as the clowns close the box lantern again. When it opens again, we see a jack-in-the-box-like creature moving his neck up and down constantly. At this, the police run away as all the dancing girls come back as we fade out. While enjoyable, I wish the version I saw had some music scoring instead of complete silence. Well worth a look for Melies fans.",
         "Two men in classic French clown dress build a giant movie camera. After many trials they finally are able to project a scene on the wall. It is a couple of lovers trying to smooch. After being bored, they take the sides off the projector and inside are a group of female dancers. One particular is more talented than the others and proceeds to outshine them. This ends and is repeated with ballerinas this time and that same woman. The dancing is shaky at best, but it is visually OK.",
         "Magic Lantern, The (1903) ** 1/2 (out of 4) aka La Lanterne magique Two clowns create a magic lantern (more like a projector), which allows them to see what they're doing on the outside world. When the open the lantern seven women jump and and the film turns to song and dance. The most interesting aspect of this film is the early use of projecting one image onto the same scene in a movie. This wasn't the first time this trick had been done but it looks very good here. The film runs just under five minutes, which is actually too long because the second half of the film, dealing with the dancing, is all rather boring. For those new to the director this is probably one you should keep for later."
      ],
      "genres": [
         "Short",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Georges Méliès",
         "Star-Film"
      ],
      "summaries": [
         "Two impish clowns construct a magic lantern. They prop it up at an angle, and use it to project pictures onto a wall. When the picture show ends, they open up the lantern to reveal a group of dancing girls inside - and this is only the first of the indications that this lantern really is magical.",
         "The scene represents the interior of a toyshop. Punch makes his entry dancing a characteristic step, and his friend Pierrot follows shortly after performing a step to the tune of \"Bedelia.\" The latter holds a candlestick and he shows his friend Punch that it gives no more light while quoting some words of the familiar song. \"You wish some light, say Punchinello. \"I will give you some, and at the same time I will show you something most astonishing.\" He asks Pierrot to give him a lift. Then both bring a platform and construct section by section a huge magic lantern. Punch puts inside of it a large lamp, lights it and opens the slide, thereby throwing upon the wall a large white disc within which pictures in varying subjects begin to appear. At first a grand personage with his consort is shown, then follows two eccentric characters, and afterwards the pictures of Pierrot and Punch highly magnified. These moving pictures dissolve one into the other upon a white background, a new feature in cinematographic work. Punch puts out the light in the lantern and the views disappear, when suddenly the sections of the lantern fall apart and out of them come forth six dancing girls who do a four-step. And as they finish a charming eccentrique makes her appearance and does a very pretty turn. The magic lantern, which had been shut up by Punch, again opens and out of it emerges an entire corps de ballet, and they all execute a dance together. The \"premiere danseuse\" comes on and mingles with the dancers; Punch and Pierrot become her suitors, they quarrel and soon engage in a hard fight, the sight of which causes the dancers to flee in terror. A body of policemen arrive. Pierrot and Punch hide in the lantern. The policemen examine it on every side. Suddenly the lantern opens, but the occupants have vanished and have been replaced by a monster, who extends himself and contracts and at the same time executes some ludicrous contortions. The policemen at this strange sight flee in hopeless confusion, the corps de ballet returns and dances among the remains of the lantern and around the monster, who continues to contort himself in a peculiar fashion.",
         "In this brief \"trick film\" two clowns assemble an enormous magic lantern which first projects moving images, then emits dancing girls."
      ],
      "budget": 0
   },
   "movielensId": 174173,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1903-01-01",
      "dvdReleaseDate": null,
      "directors": ["Georges Méliès"],
      "runtime": 5,
      "movieId": 174173,
      "title": "The Magic Lantern",
      "mpaa": null,
      "actors": ["Georges Méliès"],
      "imdbMovieId": "0223622",
      "originalTitle": "La Lanterne magique",
      "genres": ["Fantasy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two impish clowns construct a magic lantern. They prop it up at an angle, and use it to project pictures onto a wall. When the picture show ends, they open up the lantern to reveal a group of dancing girls inside - and this is only the first of the indications that this lantern really is magical.",
      "tmdbMovieId": 147746,
      "avgRating": 2.5,
      "releaseYear": "1903",
      "numRatings": 1,
      "posterPath": "/lRP9udvPhQaUG0UG6gc40vEgrX0.jpg"
   }
}