{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0000447",
      "video": false,
      "title": "Life of an American Fireman",
      "recommendations": [
         129303,
         49273,
         126124,
         118014,
         85221,
         88421,
         129863,
         126204,
         132377,
         105352,
         184882,
         100247,
         131933,
         179236,
         128368,
         179000,
         148547,
         104398,
         114444,
         84270
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "The Girl",
               "gender": 0,
               "credit_id": "52fe4684c3a36847f81035ff",
               "name": "Vivian Vaughan",
               "profile_path": null,
               "id": 1074092,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "The Fireman",
               "gender": 2,
               "credit_id": "52fe4684c3a36847f8103603",
               "name": "Arthur White",
               "profile_path": null,
               "id": 185974,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "The Fire Chief",
               "gender": 0,
               "credit_id": "52fe4684c3a36847f8103607",
               "name": "James H. White",
               "profile_path": null,
               "id": 1037658,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4684c3a36847f81035e3",
               "name": "George S. Fleming",
               "profile_path": null,
               "id": 1074091,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4684c3a36847f81035e9",
               "name": "Edwin S. Porter",
               "profile_path": "/a4SNGzbD9Fb8U82vJnSpFRGebbl.jpg",
               "id": 44866,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54d28ada9251413fd000036b",
               "name": "James H. White",
               "profile_path": null,
               "id": 1037658,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 1.57701,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44341,
      "vote_count": 27,
      "budget": 0,
      "overview": "Porter's sequential continuity editing links several shots to form a narrative of firemen responding to a house fire. They leave the station with their horse drawn pumper, arrive on the scene, and effect the safe rescue of a woman from the burning house. But wait, she tells them of her child yet asleep in the burning bedroom...",
      "similar": [
         21385,
         37724,
         54138,
         52520,
         140607,
         56292,
         155,
         68726,
         75612,
         101299,
         87421,
         383498,
         91314,
         271110,
         240832,
         49026,
         10527,
         568,
         597,
         19
      ],
      "original_title": "Life of an American Fireman",
      "runtime": 6,
      "poster_path": "/tWzJ0D6egvM3nzyUgncEnYkLOWy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Edison Manufacturing Company",
         "id": 18758,
         "origin_country": ""
      }],
      "release_date": "1903-01-21",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "George S. Fleming",
         "Edwin S. Porter"
      ],
      "runtime": 6,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0000447/",
      "coverLink": null,
      "actors": [
         "Vivian Vaughan",
         "Arthur White",
         "James H. White"
      ],
      "reviews": [
         "\"Life of an American Fireman\" is a landmark early story film, which features techniques and style that its director Edwin S. Porter and the Edison Company would use later in 1903 for the more famous \"The Great Train Robbery\". As with that film, \"Life of an American Fireman\" employed an action plot (rescue from fire instead of train robbers) and covers a large space—from the fire department to the burning building—requiring a series of shots and an ordering of spatial and temporal relations as the action progressed and allowing for dramatic excitement within its nine scenes and 425 feet of film. Until recently, \"Life of an American Fireman\" was an especially misunderstood early film. The Museum of Modern Art (MoMA) acquired a print that consisted of fifteen shots, with crosscutting between the film's original final two scenes of the rescue of the mother and child from the fire. Despite it contradicting the Edison Company's catalogue description and early cinema film-making strategies adopted elsewhere by Porter and the Edison Company, the print led to erroneous histories and appreciation of the film. It's since been established that the Library of Congress paper print of nine shots and no crosscutting is an authentic representation of the film that the Edison Company produced and distributed, and that the MoMA print had been reedited in more modern times to conform to new editorial sensibilities. While the film was innovative for its part in the development of the story film, especially in America, it was just as much a product situated in its time as any other, with no such anachronistic crosscutting. (Although there are a few early examples of brief and undeveloped crosscuts, it didn't become a common editing practice until a few years later, perhaps, most remarkably employed by D.W. Griffith at Biograph.) The film's final scene is a temporal replay, or overlap, of the previous scene; that is, we first see the rescue in its entirety from the interior view of the building and then see it again in its entirety but from the exterior view. (By the way, there's a continuity error when the mother opens the window in the final scene after it hadn't been opened until the fireman opened it in the previous scene.) As Charles Musser (\"Before the Nickelodeon\") has also pointed out, slighter overlaps appear from shots two to three (an alarm is pulled in shot two, but shot three begins with the firemen asleep), between shots three and four (the firemen are seen twice sliding down the pole), and from shots four to five (the horse-drawn fire engines race off at the end of shot four and then begin their charge again in shot five after the gates are opened). Georges Méliès employed similar overlapping in \"A Trip to the Moon\" (Le Voyage dans la lune) (1902) when the rocket lands on the moon. Porter had used temporal replays in his earlier film \"How They Do Things on the Bowery\" (1902) and continued to do so in \"The Great Train Robbery\" and subsequent productions. Another oddity in this film from a modern perspective, but which was common practice in early cinema, was the tendency to show an action from one camera angle from its beginning to its end, from inaction to until the action is completed or to begin shots about when or even before figures enter a frame and remaining on the scene until all or nearly all of them leave the frame. This has been called an \"operational aesthetic\"; that is, early filmmakers were more concerned with staging and capturing the process of operations in the action, as opposed to more cutting to action in progress to create excitement by pacing. The panning in shot seven is an interesting exception, as the camera comes to action at the site of the burning building already in progress. Two other interesting scenes in this film are the close-up insert shot of the fire alarm and the opening scene-within-a-scene showing the fireman's dream. The dream may be his longing for his wife and child, or it may be a premonition of the peril of the mother and child from the burning building to come, or it may be both. The double-exposure photography and its use for scenes-within-scenes had been around for a while by 1903. An early example of its use is George Albert Smith's \"Santa Claus\" (1898). Méliès was also quite fond of it, and Porter had previously created such dreams in \"Jack and the Beanstalk\" (1902). The fire rescue genre of early cinema dates back to the Edison Company's \"Fire Rescue Scene\" (1894), a single shot-scene staged in the cramped \"Black Maria\" studio. In numerous actualities, or documentary films, cameramen took to chasing firefighters and recording their actions in containing fires. An earlier story film to use the fire rescue plot was the British film \"Fire!\" (1901) made by James Williamson, which contained five scenes in 280 feet of film. Its scenes of horse-drawn fire engines racing and the rescue of persons from a burning home are strikingly similar to those in \"Life of an American Fireman\". Musser suggests other sources of inspiration for Porter may have been Selig's 450-feet \"Life of a Fireman\" and Lubin's 250-feet \"Going to the Fire and Rescue\" (both 1901). Apparently, Lubin, in turn, made an imitation of Porter's film in 1904 with the same title.",
         "At Edison's Company, he experimented with longer films, and was responsible for directing the first American documentary or realistic narrative film, The Life of an American Fireman (1903). Though it's among the earliest story films (but by no means the first as often alleged), The six-minute narrative film combined re-enacted scenes and documentary footage, and was dramatically edited with inter-cutting between the exterior and interior of a burning house. Edison was actually uncomfortable with Porter's editing techniques, including his use of close-ups to tell an entertaining story. For action, excitement, & suspense, Life of an American Fireman rates awfully high, improving on all that went before, borrowing from what came before wherever it was already thrilling.",
         "This short feature creates a pretty good sense of excitement and suspense. It seems to have been well-crafted, although the print is not always very clear now. It could almost be called a big-budget picture for its time, due to all the vehicles and equipment that they used in it. The first part of the film might be the most impressive, as the line of horse-drawn fire engines with all of their equipment race to the scene of the fire. The vantage point for the camera is well-chosen, and it does well in conveying the urgency of the situation. As it goes on to show the fire-fighters battling the blaze, the settings are believable, and they also seem rather detailed, although much of the detail is now obscured by the physical deterioration of the film. This was an ambitious effort for 1903. It still works well, and it is also an interesting look at the past.",
         "THE LIFE OF AN AMERICAN FIREMAN is one of the earliest narrative films. It was made in 1903 by Edwin S. Porter. The extremely short film tells of the life of an American fireman. In the finale, he races to save a girl from a burning building. Arthur White stars as the fireman. The film is very fascinating, as it gives a look at a bygone era. It is fascinating to see horse-drawn fire trucks. And this was just at the beginning of the 20th Century!",
         "Director Edwin S. Porter ignites things early in Life of an American Fireman with little let up in this 1903 display of narrative filmmaking. Porter literally juxtaposes (early split screen) exposition before sounding the alarm for the smoke eaters to jump into action. After some firehouse mobilization we are treated to a stunning parade of galloping fire engines in what looks to be a twelve alarm fire. Arriving at the fire (actually more smoke) engulfed home the firemen battle their way into the house to save woman and child. Fireman has all the visual and circumstantial elements of suspense and action. It is the Towering Inferno of its day filled with human drama and in the balance moments. Porter's action is both non-stop and engrossing and if he needed any indication that this stuff had a future for making money he need look no further to the crowd quickly multiplying to watch the racing fire chariots in a top rate action film from this early period of film.",
         "Firefighting films was probably one of the most popular early film genres of the silent era. This is understandable; audiences were normally treated, when this film was made, to short snippets of everyday life: babies being fed, dancers performing, etc. This film is far, far from being the first of these firefighting films (years before, in 1896, Edison made many different films that were static shots of firemen racing to the rescue, and several fire rescue scenes) but this is one of the very first films to actually make a story out of it. Unlike Edison's previous static scenes of fire rescues, this film has multiple shots; nine in all, and manages to tell an exciting story at the same time that can be easily followed. While Edwin S. Porter made some ground-breaking steps in the making of this film, it cannot be denied that the film is a remake actually of James Williamson's \"Fire!\" drama from 1901. Two years earlier, that film was much simpler: instead of nine shots there are four; the film is shorter with a running time of five minutes instead of seven; the pace itself is faster. Porter's remake is much more elaborate and expanded on Williamson's ideas. The film begins with a postman (I think it's a postman) dreaming about the fire starting through the use of a matte shot. He sounds the alarm, and the firemen come and save the mother and child. It's a pretty simple story but the way it's told is more important. Yes, it is sometimes a drag; I find watching it with music makes it much more enjoyable. While there isn't much to it, it was one of the most well-known movies of its era, and thus is a must-see for silent film buffs.",
         "This film, with nine shots lasting around six minutes, is often seen as a dry run for director Edwin S Porter's major breakthrough with The Great Train Robbery, released later the same year. Both use themes with plenty of opportunity for action and movement, and indulging audiences' taste for experiencing danger vicariously. But Life of an American Fireman is more interesting for the storytelling ideas that didn't make it into the later film or, indeed, into the developing language of mainstream narrative cinema. The film opens rather oddly on an optical effects shot of a dozing fireman, with his daydreams of a happy woman and child, presumably his own family, in a fuzzy circular mask to his right, a device borrowed from graphic art. This reverie is rudely interrupted by a striking closeup of a street fire alarm. The firemen then spring into action, speeding through the streets of a wintry New York City and its suburbs. They rescue a woman and child from a house fire, creating a thematic link back to the beginning and reinforcing the image of the fireman as heroic protector of families and communities, as befits his emerging role as a public servant – an integrated, professional fire service for the city had only existed since 1898. The depiction of the rescue exhibits the oddest structure to modern eyes (although there's something of the same thing going on when the fire engine leaves the station). First we see a woman in a smoke filled bedroom crying for help at the window and then collapsing on the bed. A fireman bursts through the door, lifts the woman and carries her through the window down a now-waiting ladder. Seconds later he returns through the window, lifts a previously unseen child from the bed and disappears through the window again. Porter then shows us the same sequence of events again from outside the house: the fireman enters the house, the woman appears at the window, the fireman descends carrying her. Watch the bottom of the frame as they reach safety (yes, it's another of those crowded long shots): the woman recovers and begins gesticulating distraughtly. That's why the fireman returns up the ladder for the child. The conventions of continuity editing shortly to be defined by D W Griffith and others dictate that consecutive events with a causal link take place in a single continuous time frame when depicted from different angles or even in a different location. This governs the principles of cross cutting, which would certainly be the default if a modern film maker were to shoot this story, cutting away to an exterior shot to show the recovering victim motivating her rescuer to return to the burning room, and then back to the interior again to show him lifting the child. In fact continuity editing is just as artificial and conventional an approach to narrative as the one demonstrated here. Continuity editing creates the illusion of continuous time by cutting together shots that were invariably filmed at different times, and sometimes in completely different places. Yet it is now so fluent and familiar it seems natural, and so hegemonic that films that deliberately break its rules are seen as marked, experimental or trying to make a specific point: for example Rashômon and films inspired by it, which repeat the same events from different perspectives with subtle differences in order to challenge the audience's acceptance of the truth of what is shown on screen. So intolerably odd did Life of an American Fireman seem to a later distributor that it was reedited to inter-cut the shots, which led to it's being hailed, rather ironically, as an early example of cross cutting. An examination of a paper print version in the 1990s revealed Porter's original montage. Porter's film was very likely inspired by an earlier film from Britain's Brighton school, Fire! (1901), shot in Hove by James Williamson. This depicts an essentially similar sequence of events in only six shots, and though Williamson is less adept at handling the action than Porter, with much faffing around harnessing the horses and less exciting depictions of the fire engines racing through the streets, the burning bedroom (near-identically laid out to Porter's though with a male rather than a female victim) looks much more perilous, with real flames. There's no repeated continuity during the rescue sequence but instead an excellent early example of a 'match on action', with the cut between the interior and the exterior made precisely at the moment when the fireman first emerges through the window, logically linking the two shots. Williamson stays with the exterior to show the fireman returning for the child.",
         "Edwin S. Porter and his colleagues, James H. White and George S. Fleming, expand their ambitions. While Life of an American Fireman does not compare with the contemporary works of Ferdinand Zecca or George Melie, it shows the workman-like techniques of the Edison company. The film is a straight-forward tell of a fire company responding to a fire. Much of the film is the driving of the fire engines, focusing on the movement and action of the race to the fire. When the firemen get to the house on fire, a fireman, played by co-filmmaker James H. White, races up the ladder, into the room. He rescues a woman and her daughter, then fights the blaze. Interestingly, the same action is then shown again, but from the perspective from outside of the house. This is a less elegant and dramatic way of presenting the action than later directors would employ. As later films by Griffith and Porter himself would prove, cross-cutting between the two locations builds drama and tension. Overall it represents a step foreword for the Edison filmmakers, yet was still far behind the inventiveness and wizardry of the contemporary European filmmakers.",
         "Kenneth MacGowan in his book \"Behind The Screen\" discusses this film at length. He was familiar both with the controversial print and the paper print in the Library of Congress.He didn't think that the evidence of the paper print was conclusive.At the time, a movie could be copyrighted only as a collection of still photos, which is why the paper prints were made.For that purpose, it didn't matter whether they were in the final edited form,or even if there was more footage than in the released version.MacGowan thought that a hastily assembled negative was used to make the paper print,with all of the footage shot from one angle together.Porter therefore had more time for final editing without delaying the copyright process. The question is, if the existing copy was reedited, who did it and why? Certainly not during the silent era? by the time such editing became more common, this picture was an obsolete relict of a primitive era.And if reedited then, where are the title cards? They weren't in use in 1903 when the picture was made,but came into general use a few years later. So why \"modernize\" the movie in one way, but not another? It seems strange that they were not added. MacGowan admits that there is certainly a question about the complex editing, but points out that Porter took exactly the shots he needed for it.And as to why he never used it again, there are two factors. It may have been too advanced and confusing for the audiences of 1903,just as later audiences found the more complex editing of Griffith's \"Intolerance\" even more confusing.And there is evidence that Edison disapproved of Porter's editing.Edison involved himself in every aspect of his companies' operation, insisting on personally approving each piece of music that went on his records,for example.Which didn't help sales, as he didn't have very good taste.Edison's word was law, and Porter would have bowed to it without complaint. In addition, the Edison Catalogue of that time specifically stated that after the woman was carried out of the room by the fireman, there was a dissolve to the outside of the building,the woman pleads for the fireman to rescue the child, and he returns up the ladder.The copyright version shows the fireman carrying out the mother and returning immediately to rescue the child in one continuous shot with no dissolve to the outside.Since the catalogue is so specific on this point it would certainly seem that there was inter cutting not shown in the copyright print.",
         ". . . as opposed to the grand documentary suggested by the Edison title. I've seen many bits and pieces from this 6 minute, 45.28 second crazy quilt in other Edison shorts from the previous decade (some from possibly ACTUAL fire runs with REAL firemen!). The long ending sequence at the prop house with smoke machines and histrionic actors was especially familiar to Edison peep show viewers who were repeat dupes--I mean, customers. If you watch this mish-mash closely, it makes little sense. The part I find most ludicrous is the lingering shot of the alarm being sounded by someone pulling the lever inside a fire box. This alarm box is located on a city sidewalk, and the fire turns out to be in the suburbs at a frame house five or ten miles away! Presumably, old Tom's entertainment empire henchmen thought so little of their viewers' intelligence that they would assume a passerby could see a fire, saunter for an hour or two till reaching the big city call box, pull the alarm, wait for three different convoys of fire vehicles to reach the country, arriving just as the lady of the house (who has apparently been stumbling around in the smoke FOR 3 HOURS!) finally collapses onto a conveniently placed bed. I've heard of the suspension of disbelief, but Thomas Edison figured his suspenders reached to the moon!",
         "Yes these existed already 112 years as well. This is a documentary (or is it a drama movie?) by Porter, Fleming and Edison, three of the most famous early silent film pioneers in the United States. With that background, I can also forgive them for the very patriotic title as lives of firemen in other countries would not look any different. Here we see how they arrive at the scene, rescue the woman caught upstairs in the smoke and flames and finally extinguish the fire. Scenes of carriages riding to fires were very famous contents in the early days of filmmaking and these 7 minutes here include this as well. Obviously, they had no cars back then. Maybe worth a watch for historic reasons, but other than that, this was a fairly boring and predictable watch. Thumbs down."
      ],
      "genres": [
         "Short",
         "Action"
      ],
      "productionCompanies": ["Edison Manufacturing Company"],
      "summaries": [
         "Porter's sequential continuity editing links several shots to form a narrative of firemen responding to a house fire. They leave the station with their horse drawn pumper, arrive on the scene, and effect the safe rescue of a woman from the burning house. But wait, she tells them of her child yet asleep in the burning bedroom . . .",
         "It would be difficult for the exhibitor to conceive the amount of work involved and the number of rehearsals necessary to produce a film of this description. We were compelled to enlist the services of the fire departments of four different cities, New York, Newark, Orange, and East Orange, N. J., and about 300 firemen appear in the various scenes. From the first conception of this wonderful series of pictures it was our aim to portray the \"Life of an American Fireman\" without exaggeration, and at the same time to embody the dramatic situations and spectacular effects which so greatly enhance a motion picture performance. The work of American fire departments is known throughout the world, and the fame of the American fireman is echoed around the entire world. He is known to be the most expert, as well as the bravest, of all fire fighters. This film faithfully and accurately depicts his thrilling and dangerous calling and emphasizes the perils he encounters when human life is at stake, every movement of the brave firemen and their perfectly trained horses from the moment the men leap from their beds in response to an alarm until the fire is extinguished and a woman and child are rescued after many fierce battles with flame and smoke."
      ],
      "budget": 0
   },
   "movielensId": 174241,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1903-01-21",
      "dvdReleaseDate": null,
      "directors": [
         "George S. Fleming",
         "Edwin S. Porter",
         "James H. White"
      ],
      "runtime": 6,
      "movieId": 174241,
      "title": "Life of an American Fireman",
      "mpaa": "",
      "actors": [
         "Vivian Vaughan",
         "Arthur White",
         "James H. White"
      ],
      "imdbMovieId": "0000447",
      "originalTitle": "Life of an American Fireman",
      "genres": ["Action"],
      "youtubeTrailerIds": ["9Pw0dV-nC38"],
      "plotSummary": "Porter's sequential continuity editing links several shots to form a narrative of firemen responding to a house fire. They leave the station with their horse drawn pumper, arrive on the scene, and effect the safe rescue of a woman from the burning house. But wait, she tells them of her child yet asleep in the burning bedroom...",
      "tmdbMovieId": 44341,
      "avgRating": 3.5,
      "releaseYear": "1903",
      "numRatings": 2,
      "posterPath": "/tWzJ0D6egvM3nzyUgncEnYkLOWy.jpg"
   }
}