{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "women",
            "id": 515
         },
         {
            "name": "ice",
            "id": 1445
         },
         {
            "name": "water",
            "id": 4237
         }
      ],
      "imdb_id": "tt3591696",
      "video": false,
      "title": "The Dark Below",
      "recommendations": [],
      "backdrop_path": "/t85fNn5Nv9kSBRmF7frnvVbq14W.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 1,
               "credit_id": "55abd7bac3a3682ffc0078c3",
               "name": "Veronica Cartwright",
               "profile_path": "/8s31kdotRrghkH4DkxpRZCmELYd.jpg",
               "id": 5047,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "55abd7e8c3a36872650012b5",
               "name": "Lauren Mae Shafer",
               "profile_path": "/ws27ptm6bm48SQ7VTFM5VpNyMNC.jpg",
               "id": 150832,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Ben",
               "gender": 0,
               "credit_id": "55abd7f8c3a3682ffc0078ca",
               "name": "David G.B. Brown",
               "profile_path": null,
               "id": 1488534,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "55abd7a1c3a36872650012ae",
            "name": "Douglas Schulze",
            "profile_path": null,
            "id": 232672,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 1.065407,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 349948,
      "vote_count": 6,
      "budget": 0,
      "overview": "The Dark Below is an experimental thriller set on Michigan's Great Lakes.",
      "similar": [
         10196,
         1991,
         2652,
         2675,
         2057,
         663,
         841,
         3981,
         1091,
         86834,
         57201,
         425,
         58595,
         27022,
         928,
         278154,
         394117,
         10946,
         48340,
         193610
      ],
      "original_title": "The Dark Below",
      "runtime": 75,
      "poster_path": "/xr5KSvalARLWJeqfpWRPQ6b4mdV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Dead Wait Productons",
         "id": 59374,
         "origin_country": ""
      }],
      "release_date": "2016-06-01",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Silence is the most powerful scream",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Douglas Schulze"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Douglas Schulze",
         "Jonathan D'Ambrosio"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3591696/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODc2NTAwMjMwM15BMl5BanBnXkFtZTgwMjA1MTc2NjE@._V1_UY268_CR5,0,182,268_AL_.jpg",
      "actors": [
         "Lauren Mae Shafer",
         "David G.B. Brown",
         "Veronica Cartwright"
      ],
      "reviews": [
         "Overall an excellent film for the survival genre. If you liked \"Buried\" or \"127 Hours\" then this film is probably right up your alley. The cinematography is beautiful and the score fantastic. There is a lot of use of slow motion which can be frustrating but it's generally used for an artistic purpose. Much of the film feels like a memory because of that and the cinematography. It's not a perfect film and there's a thing or two I would've done differently but I enjoyed watching and would watch it again.",
         "Just came out of the premiere in L'Etrange film festival, in Paris. The theater was full, promising plot, expectations high up. Yet, what a disappointment. I admit it is about an experimental thriller, and budget is rather tight, but at least you expect some sort of coherence in the story. The film is almost unspoken, so that the soundtrack takes over as a role play, although even the music is out of swing, off line. Plenty of details impossible to believe, like the tempos underwater without oxygen, long staying in freezing waters eyes wide open and yet no sign of damage or deep frozen fingers that can get cured miraculously overnight...film concept though is good, yet bad resolved. Just as well its 75 minutes length made it easier to go through.",
         "A woman (Lauren Mae Shafer) struggles for survival beneath a frozen lake while a metrosexual killer (David G. B. Brown) stalks her from the surface and we slowly find out they are not strangers. The mad genius behind this film is writer-producer-director Douglas Schulze, who has been a rising force in the world of indie horror. But although we tend to associate a film mostly with the director, Jonathan D'Ambrosio really deserves as much credit for \"Dark Below\", with his serving as co-writer, editor and art / production design. His fingerprints are all over this one. The film has a slim cast, with the most notable name being Veronica Cartwright. The lead, Lauren Mae Shafer, may be building a reputation among horror fans with her roles in \"Mimesis\" (also from Douglas Schulze and co-starring Brown) and \"Secrets in the Walls\". A few others show up in flashbacks, but are really unimportant. Shafer virtually carries the entire film on her shoulders. The creators make a very bold decision going for the complete lack of dialogue, which makes it almost like watching a symphony rather than a film – this, in turn, makes it very much a showcase for composer David Bateman. The modern silent film, as well as the plot of using a woman's expert swimming abilities against her, are absolutely original. Originality is rare in any genre, but especially in horror. (Can we stop making zombie movies yet?) If any criticism could be thrown at the film, it would be to ask: did it need to be feature-length? Already very short by feature standards, it could have been a longer short film just as effectively. I suppose for marketing purposes, you would prefer to have the feature. Few theaters, at least outside of festivals, screen short films. (Maybe they should.) All in all, an original and innovative film. It may not appeal to all audiences, but those who want to see something different and who have a little patience (this is not a bloody slasher film) will be rewarded.",
         "WOW. Was privileged enough to see this unique gem at Fantasia International Film Festival. Along with Turbo Kid this was my favorite film of the entire festival. I have been a fan of Doug Schulze's work since the film Mimesis and was really looking forward to this. The film did not disappoint. It's a surreal dream like story of a woman trying to survive the night being trapped beneath ice. If you're claustrophobic or have a fear of water you might want to avoid. But what's so amazing about the film is that there is no dialogue in the entire feature. You heard me. Just three spoken words right at the beginning. And I didn't even notice it until the lights came up and someone told me. The film is strikingly visual, well acted and non-stop suspense. In a day of tired formulaic movies this is very unique. Rush out to see it.",
         "There's a frigid game of cat and mouse that takes place, as you're introduced to a woman assaulted by a dangerous man. He's cold, uncaring and very methodical about his process, but it's what you're shown that makes the movie gripping. Without any words, other than three whispered in the very beginning, you are taken through every step that lead up to the attack. Douglas Schulze took an idea and made it a musical masterpiece. Through images and score, The Dark Below reveals a history of secrets, lies and a precarious obsession with water. You endure a voyeuristic fight for the heroine's life, while also finding yourself struck dumb, yet fascinated!. There was but one issue held with the movie and it has to do with icy waters. Sadly, details can't be provided without giving away spoilers, and that's not what I do. Just know that what is done cannot be undone, no matter how great the medical science. The movie is alluring, the story is fabulous and the thrills are very cool! (pun intended) The Dark Below releases later this year. Be sure to see it!",
         "Where to start? This resembles a bad television film more so than an actual feature. Thin plot, weak characterizations, no explanation of the characters motivations and minimal exposition.Toward the end of the film you start to realize what is occurring; however, by that point, you just don't care. Basically for nearly 90 minutes you watch characters who don't care about do things that don't make much sense. Coupled with the near total lack of logic in the plot, this film is like watching a documentary about a subject for which you have no interest. Bad film that can easily missed.",
         "This movie was pure CRAP!!! If you are in a tussle with a serial killer, you aren't going to be silent. If you find evidence of the serial killer's, you are not going to be silent. If your daughter wakes up from a coma, you aren't going to be silent. Pure crap!!! Would have been a little better if it had dialogue.",
         "A film without dialogue, i don't know what the producer was trying to achieve it could have so much better as a talkie, the story line was quite good and the actors did a descent job but the lack of verbal chatter was off-putting, the music score was OK, but at times it seemed like stepping back in time to the golden silent era of movie making especially scenes with the victim and her mother, it had a descent ending but as a talkie it would have been great"
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Dead Wait Productons"],
      "summaries": ["A woman struggles for survival beneath a frozen lake while a serial killer stalks her from the surface."],
      "budget": 750000
   },
   "movielensId": 174475,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-06-01",
      "dvdReleaseDate": null,
      "directors": ["Douglas Schulze"],
      "runtime": 75,
      "movieId": 174475,
      "title": "The Dark Below",
      "mpaa": "",
      "actors": [
         "Veronica Cartwright",
         "Lauren Mae Shafer",
         "David G.B. Brown"
      ],
      "imdbMovieId": "3591696",
      "originalTitle": "The Dark Below",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["aR4g9BMqA58"],
      "plotSummary": "The Dark Below is an experimental thriller set on Michigan's Great Lakes.",
      "tmdbMovieId": 349948,
      "avgRating": 2,
      "releaseYear": "2016",
      "numRatings": 1,
      "posterPath": "/xr5KSvalARLWJeqfpWRPQ6b4mdV.jpg"
   }
}