{
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 0,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1830238/",
      "coverLink": null,
      "actors": ["David Firth"],
      "reviews": [
         "Salad Fingers, a singularly disturbing Flash cartoon by David Firth is a unique experience. A series of bizarre animations that are mere random messes to those who are simply too lazy to think hard, but beautiful and bewildering to those who wish to interpret and analyze them and those who appreciate art. Salad Fingers is set around a lonely, mentally disturbed mutant who resides in a wasteland with only his finger puppets and his imagination as company. We hear that the world around him perished during a great war. He sees and does strange things that often end him up in surreal and frightening situations. As we follow him through his nightmarish experiences, we grow to like him and care about him, despite his sickening habits and hobbies. It is hard not to feel sorry for him when he breaks down and feels miserable and alone. Salad Fingers is truly a one-of-a-kind Flash series. No other series I can think of has been this surreal, strange or beautiful. Many have tried to mimic it, yes, but that has not always ended well.",
         "On coming across Salad Fingers I was completely grossed out by the initial look of the cartoon series, yet as I watched more of the episodes I became completely engrossed in the cartoon. While others look at it as: disturbing, freaky, creepy, vile and disgusting, and wish it to be banned, those who believe it shows or expresses nothing at all. I find it extremely deep, haunting and meaningful. I find it extremely artistic and is a great image to what society might become in years to come. It's a perfect example of modern day pop art. Salad Fingers is a perfect example of the common person suffering from post-apocalyptic loneliness after all his surroundings have been destroyed by the war. What we see is Salad Fingers day to day life, acting out sheer surrealist and twisted story lines that succeed in making the viewer feel incredibly uncomfortable. We see him driven to insanity and we see the delirious mind-set in which he suffers to live through, and yet, we feel sorry for him, as we witness what alienation and loneliness can do to a person's mind, we observe his mind and his thoughts and feelings, and we see the symbolisation of the mind in it's darkest manner. I have never come across a Flash series quite like this, it really does open your mind to what the world is coming to, what we're doing to the Earth, and in time what we could do to ourselves if we succeed in perishing our world. People who appreciate art, and appreciate a profound storyline will enjoy Salad Fingers: contrary to the belief it's an absurd cartoon with little meaning.",
         "Ah, Newgrounds. A website that used to be a big thing back then in the early 2000s, but which ended being overshadowed by the websites that appeared during the following years such as Youtube, and during the present time is often considered as the place where so many poorly made point-and-click horror games filled with cheesy jump scares can be easily found. But such kind of generalization would be unfair. After all, some really good stuff originally debuted on Newgrounds...The work of some animators such as Harry Partridge and Max Gilardi had its humble beginnings on this website. And one those creators was David Firth, whose most iconic work is this web series, which showed that while flash animation was mostly used for silly shorts filled with references and shocking humor (Not that there is anything wrong with that) it also can be used in a darker, more haunting manner. The eerie atmosphere and the creepy (yet strangely endearing) protagonist are the strong points of \"Salad Fingers\" making it an interesting watch on its 10 weird but fascinating episodes, getting progressively creepier in each chapter. Yes, it could be somewhat self-indulgent at moments, and yes, the bleak nature of the plot are definitely not something that could be easily enjoyed for every viewer, but personally, I liked this series. I liked its mood, animation style and characters, and I think is such a shame that there are not so much horror-themed animations as this one, since even to this day, most viewers still feel that cartoons should be always comedies. But fortunately, from time to time shows like dared to be different instead of imitating what everything else keeps doing. And I am more than thankful for that. 8/10",
         "Is a sad thing that (Despite the existence of television shows as \"The Simpsons\", \"Daria\", \"Spawn\" and \"The Maxx\") many people still consider animation as \"kiddy stuff\". This kind of mentality annoys me a lot, and it only served to limit all the potential western animation ever had. If it wasn't for this biased perception, the western animation industry would be just as big (if not bigger) and more varied than the anime industry from Japan. Sadly, thanks to many self proclaimed \"moral guardians\", soccer moms, bad imitators of Disney and Hanna Barbera, and people who thinks that kids are morons unable to handle anything more complex than stuff like Barney the Dinosaur or Pokemon, animation in this side of the world never had the chance to reach its full potential, despite some admirable efforts worth of recognition. Fortunately, thanks to the advent of the Internet, now is possible to see and appreciate the works of many different independent animators which have on the web far more creative freedom they would have on regular television. David Firth is one of those talented web animators, and Salad Fingers is probably his most iconic and fascinating creation, a creepy and surreal series of shorts about an strange characters who who inhabits a desolate world, having any sort of weird \"adventures\" in each chapter. It might sound like a very simple concept, yet the incredibly haunting atmosphere, and the weird but somehow endearing main character are able to make \"Salad Fingers\"a unique, totally fascinating series, perfect for those viewers who enjoy the weird and unconventional material the Internet is able to offer. Animations like this are a breath of fresh air in a time when it seems there is nothing new under the sun. In a time when both horror and animation seem stagnated due the biased perceptions the general public had towards both genres, I say thanks for creative and atypical creators like David Firth, who definitely deserve far more credit and recognition.",
         "The reviewer at the bottom of this list had it right. Salad Fingers is great mood. But what does it actually show? The world it portrays is a world of ONLY the Shadow; The Shadow and isolation - nothing more. But this is a purge: it does not show the truth of the world: only Miyazaki does that. Spirited Away does it best. A world of only shadow appeals only to those who blind themselves to light. *** I still give this 7 for the mood and for nostalgic reasons. I like it when the red water comes out. **** I refer to the Shadow as Jung described it; that hidden, darker aspect of the unconscious.",
         "Another reviewer wrote, \"it really does open your mind to what the world is coming to, what we're doing to the Earth, and in time what we could do to ourselves if we succeed in perishing our world. People who appreciate art, and appreciate a profound storyline will enjoy Salad Fingers: contrary to the belief it's an absurd cartoon with little meaning.\" Art is a slippery concept. There are artistic elements here: the character quirks and gentle psychosis of salad fingers, the dream-like, minimalist animation. But mere creation of a mood does not, in my mind, rise to the level of art. I don't mean to condemn the attempt with my low rating. Experiments must be made. But this is a failed experiment, and because it lacks any structure, conventional narrative, or beauty, there's nothing left to like after that failure. There is no profound storyline. Salad Fingers does not speak to human experience, not even the experience of delusional psychotics. There is no reasonable, interesting, apparent interpretation of the events, no way to make sense of it. (And don't tell me that \"not making sense is its sense!\" Kafka did that right. This is not Kafka.) It's a bunch of random creepy stuff thrown together, made independently without any story or plan.",
         "The animation in the Salad Fingers cartoon isn't bad. The problem is, it's incredibly strange. I love weird things, I love The Addams Family, The Corpse Bride, Eating Raoul, etc. but Salad Fingers is weird to the point where not only is it not funny, it's just more annoying and dull than anything else. The story of Salad Fingers appears to be that Salad Fingers was a normal guy, but after a nuclear bomb was dropped, he is the lone survivor and is getting sick - mentally and physically - from radiation. As he is the lone survivor in what looks to be post-war Britain, he has gone mad and begun inventing imaginary playmates for himself. There is an interesting plot here, but one of the other reviews seems to think it was a cartoon made to raise awareness of the environment and pollution. Clearly it is just meant to be comedic and to appeal to those out there who love creepy things, not everything has a message behind it. Salad Fingers has little, if any, soundtrack. It has one, maybe two, voice actors. For an independent cartoon you can see that effort has obviously been put in, but there are some moments to recall that are not only strange, but perverse and disgusting, frankly pointless: 1) Salad Fingers picks up a rusty spoon and says aloud, \"the feeling of rusty spoons against my salad fingers is almost orgasmic\". What the hell? 2) Salad Fingers pokes himself with a dead nettle plant and says \"the nettle makes the milk squirt from my teat.\" Uh, what the hell again? 3) Salad Fingers' \"birthing scene\" in the last couple episodes... ugh. 4) he appears to murder a small child and then dreams of being in a meat locker. 5) He pops a sowbug named Bordois open with his finger. 6) he stabs himself and says, \"I like it when the red water pours out.\" Sometimes it's best just to listen and not see for yourself. Honestly, avoid this cartoon, it's a waste of time to watch, is at times something only psychopaths would find humerus, it's just not worth it. Its current 8.3 out of 10 rating makes me very worried for society."
      ],
      "genres": [
         "Animation",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [],
      "summaries": ["The adventures of Salad Fingers, an unspecified mutated creature driven to madness by his loneliness."],
      "budget": 0
   },
   "movielensId": 174485,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-05-09",
      "dvdReleaseDate": null,
      "directors": ["David Firth"],
      "runtime": 52,
      "movieId": 174485,
      "title": "Salad Fingers",
      "mpaa": null,
      "actors": ["David Firth"],
      "imdbMovieId": "1830238",
      "originalTitle": "Salad Fingers",
      "genres": [
         "Animation",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["wpVTORX_ifk"],
      "plotSummary": "The adventures of Salad Fingers, an unspecified mutated creature driven to madness by his loneliness.",
      "tmdbMovieId": 425916,
      "avgRating": 3.86364,
      "releaseYear": "2004",
      "numRatings": 11,
      "posterPath": "/xQEW2Dn2X8ZXgUjT8hrkwovAOea.jpg"
   }
}