{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "pokémon",
            "id": 11451
         },
         {
            "name": "celebi",
            "id": 11452
         }
      ],
      "imdb_id": "tt0287635",
      "video": false,
      "title": "Pokémon 4Ever: Celebi - Voice of the Forest",
      "recommendations": [
         33875,
         36218,
         10991,
         34065,
         12599,
         34067,
         47292,
         36897,
         25961,
         16808,
         10228,
         39057,
         50087,
         150213,
         350499,
         88557,
         227679,
         115223,
         137773,
         382190
      ],
      "backdrop_path": "/gYAXJet8ab1bo3247dvunF4NQ2W.jpg",
      "revenue": 28023563,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ash Ketchum (voice)",
               "gender": 1,
               "credit_id": "52fe45049251416c75048de1",
               "name": "Veronica Taylor",
               "profile_path": "/28EFUb3bPWJaWYzZIxurGCrDpHk.jpg",
               "id": 67830,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Misty (voice)",
               "gender": 1,
               "credit_id": "52fe45049251416c75048de5",
               "name": "Rachael Lillis",
               "profile_path": null,
               "id": 67832,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Meowth (voice)",
               "gender": 1,
               "credit_id": "52fe45049251416c75048de9",
               "name": "Maddie Blaustein",
               "profile_path": "/UJ5MREG89nf7XPjzhm2jzbnqeA.jpg",
               "id": 73043,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Pikachu (voice)",
               "gender": 1,
               "credit_id": "52fe45049251416c75048ded",
               "name": "Ikue Otani",
               "profile_path": "/zFOhkOTby060i4pxpCRKR53SuLT.jpg",
               "id": 73044,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45049251416c75048df3",
               "name": "Jim Malone",
               "profile_path": null,
               "id": 73051,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048df9",
               "name": "Kunihiko Yuyama",
               "profile_path": "/9z3LqqCMRZWyptfIZnlAdG7CnaZ.jpg",
               "id": 65429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45049251416c75048dff",
               "name": "Hideki Sonoda",
               "profile_path": null,
               "id": 25761,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45049251416c75048e05",
               "name": "Norman J. Grossfeld",
               "profile_path": null,
               "id": 67943,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e0b",
               "name": "Alfred R. Kahn",
               "profile_path": null,
               "id": 67944,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e11",
               "name": "Takashi Kawaguchi",
               "profile_path": null,
               "id": 73045,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e17",
               "name": "Masakazu Kubo",
               "profile_path": null,
               "id": 73046,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e1d",
               "name": "Yukako Matsusako",
               "profile_path": null,
               "id": 73047,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e23",
               "name": "Takemoto Mori",
               "profile_path": null,
               "id": 73048,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e29",
               "name": "Choji Yoshikawa",
               "profile_path": null,
               "id": 65431,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e2f",
               "name": "Shinji Miyazaki",
               "profile_path": null,
               "id": 73052,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e35",
               "name": "Hisao Shirai",
               "profile_path": null,
               "id": 12186,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e3b",
               "name": "Yumiko Fuse",
               "profile_path": null,
               "id": 73053,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e41",
               "name": "Toshio Henmi",
               "profile_path": null,
               "id": 73054,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e47",
               "name": "Yutaka Henmi",
               "profile_path": null,
               "id": 73055,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e4d",
               "name": "Yutaka Ita",
               "profile_path": null,
               "id": 73056,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45049251416c75048e53",
               "name": "Yukiko Nojiri",
               "profile_path": null,
               "id": 73057,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 10.107117,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12600,
      "vote_count": 105,
      "budget": 0,
      "overview": "All your favorite Pokémon characters are back, and are joined for the first time by the legendary Pokémon Celebi and Suicune, in this latest exciting Pokémon adventure! In order to escape a greedy Pokémon hunter, Celebi must use the last of its energy to travel through time to the present day. Celebi brings along Sammy, a boy who had been trying to protect it. Along with Ash, Pikachu, and the rest of the gang, Sammy and Celebi encounter an enemy far more advanced than the hunter left behind in the past. This new enemy possesses a Pokéball called a “Dark Ball,” which transforms the Pokémon it captures into evil and far stronger creatures. When Celebi is captured, the fate of the entire forest is threatened. Let POKÉMON 4EVER transport you to a world of adventure as Ash, Suicune and the rest take action to save the day!",
      "similar": [
         436931,
         36897,
         10991,
         34067,
         25961,
         382190,
         10228,
         34065,
         245170,
         16859,
         4935,
         8392,
         128,
         129,
         51739,
         430447,
         149871,
         10515,
         81,
         149
      ],
      "original_title": "劇場版ポケットモンスター セレビィ 時を越えた遭遇（であい）",
      "runtime": 75,
      "poster_path": "/bqL0PVHbQ8Jmw3Njcl38kW0CoeM.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "2001-07-06",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/iGoYKA0TFfgSoZpG2u5viTJMGfK.jpg",
         "name": "Pokémon Collection",
         "id": 34055,
         "poster_path": "/j5te0YNZAMXDBnsqTUDKIBEt8iu.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.pokemon.com/us/movies/movie-pokemon-4ever-2002/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Kunihiko Yuyama",
         "Jim Malone"
      ],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Hideki Sonoda",
         "Michael Haigney"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0287635/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZDZiYjc3MWYtODE5Mi00MDM5LWFkZTAtNjAzZmUxMzc4ZGQxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Veronica Taylor",
         "Rica Matsumoto",
         "Rachael Lillis"
      ],
      "reviews": [
         "I can't see the point in burying a movie like this in sulfuric sarcasm, when it is in no way intended to be anything more than a vehicle to entertain children and prepare them for the next line of merchandise to beg madly about. This is a fun movie. My children sat quietly through the entire thing and loved every minute of it. Granted, the villain is a bit over the top with his silly costume and maniacal laugher, but this is a lot more easier to take than the dark, gloomy, and very morbid Pokemon 3. My children have been watching Pokemon since it started and they are soon getting to the ages where they will \"put off the childish things\" and move on to others. I am glad that we got to enjoy this together.",
         "Another Pokemon movie has hit the theaters, and again, I'm hearing the same old, \"Pokemon is dead, blah blah blah.\" The franchise's detractors couldn't be more wrong. Kids are still playing the trading card game, they're still watching the TV series, they're waiting for the Game Boy Advance games, and they want to see \"Pokemon the 4th Movie.\" That said, \"Pokemon The 4th Movie\" introduces us to two more \"legendary\" Pokemon: Suicune, the \"north wind\" of lore, and Celebi, guardian of the forest (and star of the show). Celebi transports itself and a boy named Sam 40 years into the future, to the present day, where Pokemon trainer Ash, his faithful Pikachu, and his friends Brock and Misty are traveling through Johto. Sam and Ash become fast friends, once they discover the other's mutual love for Pokemon (Sam's vintage Pokeball with screw-on top is a great moment). Together, they decide to protect Celebi from the villain of the story, the Team Rocket agent aptly named Vicious, who is hell-bent on capturing Celebi for his own ends. Will Ash and Sam be able to protect Celebi from Vicious' Dark Balls? Where does Suicune fit into the picture? Will Jessie, James, and Meowth have bigger parts in this movie than before? And just who is Sam, really? Like with the first 3 movies, if you go into the movie deciding that you're automatically going to hate it no matter what simply because it's Pokemon (or just because your child/niece/nephew/younger sibling/et cetera \"dragged\" you into it), then you're going to hate it because you've decided that you want to hate it. That may be, but to blindly trash \"Pokemon The 4th Movie\" simply because it is a Pokemon movie, and especially without having seen it, is just plain stupid. Even non-fans can enjoy this movie without having to know every last detail of the world of Pokemon. I'm not saying that you WILL become a Pokemon fan because of this movie, but you CAN indeed enjoy it, if you'll let yourself. Unlike the first 3 Pokemon movies, \"Pokemon the 4th Movie\" is being distributed by Miramax, who I've heard is also working on securing the rights to the 5th Pokemon movie, which was released this past summer in Japan. Miramax claims to have some boffo-aggressive marketing strategy for \"Pokemon The 4th Movie,\" but all I've seen so far is a feeble limited release, which doesn't include the usual Pikachu short in the beginning, which I was really looking forward to this time. I hope that Miramax will see fit to put the Pikachu short, called \"Pikachu's Exciting Hide-and-Seek,\" onto at least the DVD/VHS release, if not with a future wider release of \"Pokemon The 4th Movie.\" I hope that the current release is just the tip of the iceberg for this very entertaining film.",
         "I just returned from the un-expectantly entertaining Pokemon 4. It is a matter of great wonder to me that others did not find the rich storylines in the film as enlightening as I did. I suppose the unfortunate reality is if a film doesn't cater to the 'lowest common denominator', its success domestically (and more and more in foreign markets) is questionable at best. At first I wish to address the flaws. The animation, as has been pointed out before, is at best sub-par. But where they skimped on artistry in the drawings of the characters, the storyboard simulated camera angles and image composition are superb. The film lover will note the use of techniques from film auteurs such as Orsen Wells (note the second part of the opening scene, which is quite obviously an homage to the master) or Sam Peckinpah (pay close attention to scenes leading up to the first Pokemon Battle and try to tell me you aren't reminded of Straw Dogs). I also thought the sound was pretty crummy. That aside, the film was a pure masterpiece. As in the preceding three Pokemon movies, the story centers on the loveable 'Pikachu'. Pikachu looks like an overfed mouse that can use his powers to fight other Pokemon, sometimes to the death. All Pokemon (Japanese for 'The Monster who lives in the pocket') have special powers. It has been said that Pikachu is the most powerful of all of these, but to find out that one must become a 'Pokemon Master'. As a parent, I am still confused to what that really means, and I suspect that in 10 years, the entire lexicon of Pokemon movies and television programs will be required viewing in the more credible Psychology and Philosophy departments in Universities around the world. Countering the hero that Pikachu presents us is yet another Pokemon, who is called 'Meowth', brilliantly voiced by the multi-talented yet under-rated Addie Blaustein. Meowth, unlike every other Pokemon can speak in English (who only know and converse in Japanese. As a side note, I hope in the DVD version the English translation of the Pokemon's conversations will be provided). Meowth travels with a hapless game of criminals called 'The Rocket Team', who battle with Pikachu and his owner Ash to become Pokemon Masters. Within these two characters lie the classic storyline of the Epic struggle between good and evil, truth and deception, black and white. It is highly recommended that the casual fan revisit the entire running of the TV series in order (including the surreal yet awe inspiring Jhoto Journeys) and the films before returning to this work. Nine out of 10. Near perfection in my book.",
         "As a Pokémon fan I enjoyed this movie very much. It introduces new legendary Pokémon (as each movie does) and adds depth to the relationships between its characters. I however do not expect those who are not Pokémon fans to enjoy it(This includes MOST adults). Some of the lines were corny, but that can be somewhat unavoidable when dubbing the movie over to English. The animation was beautiful, although there were a couple parts that did not look good. And although the villain is kind of corny, I think that the movies have done a good job of cycling through different types of villains, and I guarantee you that they aren't all like this one. Those who did not like it, I say to each his own, but Pokémon fans will love it.",
         "I so love this movie! The animation is great (for a pokémon movie), the cgi looks so awesome. I love the music in the movie. So great they kept the Japanese music. As for the story: its great. It has a great feeling of friendship. Celebi is a very cute and powerful pokémon. Ash is really great in this movie, and I like his friendship with Sam. The only thing I didn't like was Suicune's appearance, he just suddenly pops up, helps Ash & co a bit and leaves. They could have made his part in the movie a little bigger. But overall, awesome movie! Can't wait to own the USA version on dvd!",
         "Of the first four Pokemon feature films, Pokemon 4ever has the strongest Disney vibe, and I feel like it is a good choice for the youngest pokemon viewers. For the more adolescent fans (however many there are), I am more dubious to recommend this. Pokemon 3 may have been dark, but the story was imaginative and had some wisdom and emotional depth. Whereas Pokemon 3 could almost have been a family movie, Pokemon 4ever is easily just a kids movie. Pokemon 4ever takes Ash and friends out of the darkness and back into sunlight. As beautiful as this fourth entry is, it is also quite corny. All pokemon movies integrate a new legendary pokemon into the story. Pokemon 4ever showcases Celebi; a forest spirit who is chirpy, but nothing more. Celebi has about as much personality as the sugar fairies in Fantasia. She may be a pokemon, but a character she is not. Equally unmemorable is the cackling antagonist, who dresses like the terminator's second cousin and behaves like a shallow Disney villain. Pretty much the entire film takes place in the Johto region forest, (having been aired at the end of the fourth season) This is a visually spectacular piece of landscape, which becomes the setting for a less than spectacular storyline. Pokemon 4ever, may be concise and simple in plot, but not only is it rather shallow, but it feels strangely rushed. Pokemon 4ever also has the kind of syrupy ending that tries to pull to emotions out of us which it has not earned. The pokemon world can offer a variety of strong story possibilities, but this movie does not exploit them. This is essentially a Disney movie, that has pokemon in it. My conclusion is that Pokemon 4ever is a visually strong but thinly written entry in the adventures of Ash Ketchum.",
         "I have always enjoyed the Pokemon movies. Yes, I know, all of them are very corny, mediocre in some certain areas and sure, even though they're aimed at little kids they're too adult in some fields to be able to guard them with the statement,\"Hey, lighten up, it's a kids movie,\" but all that aside, aren't they still good pieces of entertainment? In my opinion, they are so and I enjoy them greatly. This one is just as enjoyable as the previous three, and certainly cuter. It has some really sweet and touching moments since it is the introduction of the lovable, fresh Pokemon Celebi. It's not the best Pokemon movie, but I do enjoy it more than the third installment, even though the third is not bad, and the entire series is just entertaining, harmless, popcorn family fun and should be considered nothing more, nothing less. This film has some high marks of intensity and interest, especially around the climax/ending, as do all the installments, and the characters, while a bit more lackluster than the previous three, I thought, are still likable and humorous. This films is the lowest rated and most criticized of the four feature length adaptions, and it doesn't deserve that.",
         "Pokemon 4ever is just a kids' version of Princess Mononoke. Celebi is even called the \"Spirit of the Forest.\" The monster is just like the Nightstalker from Mononoke. There is a healing lake, Suicune looks like the spirit and acts like the wolf gods from Mononoke. The only good thing about the movie was its revelation at the end. If you pay close attention to foreshadowing, you can guess the secret as I did.",
         "Out of these Pokemon films (which are in order of best to least for me): Pokemon The First Movie, Pokemon 4Ever, Pokemon Heroes, Pokemon 200 and Pokemon: Entei and the Unknown, this is probably the one most concerning the environment, arguably the most beautiful and the most calming one. Whether these are good points for you or not, \"Pokemon 4Ever,\" still has entertained many. As well as the three points covered above, this pokemon film includes good humour and good CGI (as well as anime). The time travelling theme of the film is represented in a good way and Team Rocket (the comic reliefs/rubbish baddies) end up with quite good gags and end up being more main characters than sidekicks. The flaws are, as always, the rather unnecessary violence and action and the baddie is pretty uninteresting, even more so than a few Pokemon film baddies. A strange pokemon is being tracked down by a pokemon hunter in a forest. A young boy tries to save the pokemon and it takes him somewhere... Meanwhile, Ash, Brock and Misty are entering a large forest... Curious? Watch the rest... Good for all Pokemon fans and \"American\" anime movie fans, enjoy \"Pokemon 4Ever\"! :-)",
         "The film begins with a fantastic chase through the forest. The whole forest is beautifully created, and the anime style fits in nicely with the stylized CGI. The plot is fairly simple. A boy saves a time traveling Pokemon and is brought forward 40 years where he meets Ash and co. They must battle a Pokemon hunter that wishes to enslave the super awesome Pokemon. It's a fun movie that actually adds to the relationships of those in the Pokemon universe. Once again it has an obvious eco message, but you also get to see a huge CGI woodland monster type thing, so I ain't complaining. Again, this is just for Poke fans, but may be entertaining enough for those outside their comfort zone.",
         "Whoever says pokemon is stupid can die. This movie is superlative. I Even shead a tear when Celebei died. I DON'T CRY Much! This film is a touching animated thriller. In this fourth installment of pokemon, Ash and friends must stop the bad jerk from making Celebei the ultimate evil weapon with his dark ball. In the time, Sam and Celebei travel through time and continuously are hunted by game hunters. I like the part with the double battle and Sam has the apricorn pokeball (if you've played pokemon gold, silver, or crystal, you know what it is.) I also enjoyed having miramax in charge instead of Warner Brothers. Putting the mini movie at the end was a great idea. The pokemon in this movie come to life more than ever.",
         "Before I begin, I'd like to say that I'm a huge fan of Pokémon. The games are always amazing, the anime is outstanding (half the time, though that's a discussion left for another say), and the TCG is incredible. However, the movies have been less than great. While they aren't outright awful, they just aren't good. Another thing I should note is that I'm reviewing the Japanese version instead of the English dub. Celebi: A Timeless Encounter, is just a forgettable film. That's the best way to describe it. This was made during the first real dark period of the anime, where less and less quality was apparent. If there is one thing that symbolizes that time, this movie is it. The plot revolves around Satoshi (Ash) meeting Yukinari (Sam) who just happens to have traveled 40 years into the future because he saved Celebi from a poacher. Now the two must protect Celebi from a masked man known only as Vicious (Iron-Masked Marauder). Throughout the film, we slowly see a friendship form between Satoshi and Yukinari that doesn't really go anywhere, as well as with Celebi who does just about nothing until the middle of the film, and still doesn't do much even then. Sure there are other characters, but they do just about nothing for the whole film. The animation is good except for the CGI, which is just awful, and everywhere. The acting is just mediocre and forgettable, though not awful. The soundtrack is forgettable, except for the ending song which sometimes get stuck in my head. Almost everything about this film is forgettable except for the ending, which is amazingly bad and stupid. The English version, from what I've heard, is even more stupid and confusing. In short, It's just forgettable. On a ending note, what kind of a title is \"4ever\"?",
         "The early Pokémon movies sure have their charm. This one is no exception. It's a slight step down from \"The Power of One\" and \"Spell of the Unknown,\" but still a very worthy addition to the series. There are a few flaws. There are some stupid scenes which include Ash jumping on the boat while it's leaving, Misty twisting her knee, a pointless berry-picking scene, and a few others. Also, the villain, while certainly intimidating, is as clichéd as can be. However, the film makes up for that in many other ways. Celebi is a very cool Pokémon, and the mythology behind her is intriguing. The forest and the scenery in it is beautiful to look at. Some complain about the CGI, but I quite liked it. \"Sammy\" was a likable character, and I liked his relationship with Ash. I hope Ash later learned that \"Sammy\" is...you know. As to be expected, the final half-hour is action-packed and full of excitement, even if it doesn't quite match the Charizard/Entei battle from #3. Suicune's entrance was pretty awesome, too. While not quite as exciting as #2 or as dark and ambitious as #3, this still has plenty to offer for any Pokémon fan. RATING: B",
         "The fourth installment in the Pokemon film series is quite a different one. With more of a time travel feel to it, this movie will entertain most fans of the show at it's use of this phenomenon. Attempting to show to use more of a moral about friendship this film does...and that is quite a little overdone. It should be noted that time paradoxes were very much avoided, and they ought to be commended for that. Still, it contained a little too much childishness for comfort, being not an example that Pokemon isn't just for kids. If you,like my father, are watching it for the sake of your child's happiness...don't worry. You'll be entertained somewhat and will not sit through as long of a film as the other three. Still not nearly the best they can do, your family Pokemon fan will like it.",
         "The 4th Pokemon movie made me cry when Celebi died. Don't you dare say that Pokemon sucks! I don't like it when people say that.... I've liked Pokemon for 5 or 6 years, so everyone should enjoy Pokemon, including this movie and other Pokemon movies. So, without further ado, please say that Pokemon is great and should be enjoyed by people for all ages. And also, why do Pokemon-haters give low ratings for all or most of the Pokemon movies? I don't understand.... They shouldn't do that.... There's absolutely no reason why people should just vote without proving that Pokemon sucks besides the fact that: 1) Pokemon is for little kids ONLY. 2) Pokemon is stupid. and 3) People shouldn't like Pokemon. I think this is why people don't like Pokemon.",
         "I was a big Pokemon fan back when it was initially popular. I've not had a fix for a while and I decided that this, the fourth Pokemon feature film, would be good enough. It exceeded my expectations. Ash, eternal jailbate tease Misty, and Brock enter a mysterious forest in their ongoing travels which is inhabited by many rare Pokemon. Out of the blue a young boy appears with his newly befriended Celebi. He's time-traveled 40 years to escape a cruel Pokemon hunter but is soon on the run again when a new villain from Team Rocket turns up. The gang follow, keen to learn about Celebi and keep him safe. Jesse, James, and Meowth tag along in the background and provide the usual comic relief. Pokemon 4Ever feels a lot like a Hayao Miyazaki film with it's environmental message, forest setting/imagery, and beautifully detailed animation. The plot is also clever and has a surprisingly touching twist. I was very impressed with this sequel and I highly recommend it. The Western version of the film contains an extra scene at the end, explaining the twist with a little more clarity as it was originally only hinted at in the end credits, but not too many kids would hang around during the credits, so I can see why the Weinsteins would insist on it. But, for a change, it's not a Miramax alteration that voids the integrity of the film.",
         "The original gang consisting of Ash, Pikachu, Misty and Brock travel to a forest were legendary Pokémon are said to exist. There they find a young boy named Sam who with the powerful Pokémon Celebi has time-travelled forty years into his future. Together Celebi, Sam and the gang become good friends until a villain known as the 'Iron Masked Marauder' arrives looking to capture Celebi. I am 21 right now, and I grew up on the wonderful adventures of Pokemon. I cherished every single moment as a child of ten or eleven...I really did. This movie may not have the greatest of animation or the greatest storyline but it does have one thing that a lot of great animations lack today...Heart. The story is beautifully told and it genuinely makes the audience feel as if there is something truly wonderful out there... I did not expect the end twist as to who 'Sam' will grow up to be...I was totally caught off guard and you know what, it was a wonderful surprise....The one flaw I saw was...maybe it's because I am a lot older now...But as an audience member, you realise what is happening and then the characters tell you what is happening... But, apart from that a wonderful tale of Man and his Pokemon.",
         "Not one of the better pokemon movies. Two legendary pokemon come into the story. You do get to see how strong Celebi can be, though he turns evil first. Suicune also makes an appearance, he didn't seem that powerful. The Marauder didn't have many strong pokemon at all, except for that taranitar? Some fight scenes with his pokemon may have made it better. Ash and Pikachu meet the much younger Professor Oak, though they don't realise it. Misty I was thinking had it at the end but she didn't get close. I saw this in the credits. Don't expect much here, the worst of the series so far.",
         "The movie seemed to appeal me because of the new type of Pokemon Celebi. But the plot was out of course and didn't have as an interest as the other movies. It was a waste of money and time. The same corny humor and cliche bad guys. The movie was of no use to make if you wanted to make Pokemon famous. The movie should better not associated with animes such as Dragonballz, Digimon, or Yu-Gi-Oh. The drawing and settings are of no level rising to the standards of original anime. It is a shame even to talk about this movie. I bet Pokemon fans will be disappointed with the outcome of the movie and give up on Pokemon. Digimon is more of an anime and doesn't fall anywhere close to Pokemon.It's second movie is coming out late 2002.",
         "Don't get me wrong, Shigeru Miyamato is a complete game genius, but that's with games. He didn't go far enough with this movie. This is the same as the Pokemon series- dumb. Corny jokes from annoying animals who repeat their names. You wanna know what I suggest? Parents, leave your kids in the movie theater that shows Pokemon, and then take off to see The Transporter. Yeah, that's much better. In other words, don't waste a good 79 minutes on this lame movie.",
         "Wow. This movie bored the pants off me when I saw it. Bland, pointless and unmoving. Apparently, Ash and co. can travel through time with the help of \"The Spirit of the Forest\" ('Princess Mononoke' much??) There, they meet a dorky kid named Sam, and the \"plot\" begins. So Tom (Ash) and Huck (Sam) get high with nature, become hippies and try to free Celebi (the \"Spirit\") from some weirdo hunter guy. I don't even know what else went on. It all went by in a blur. Ash's friends were hardly in it, and all the fight scenes were boring. After saving the day, Ash and his infamous friends, must return to their time, while watching Sam float away with Celebi (that scene was just creepy. O-O;) Then, after returning to their time, Ash learns that his new friend is actually his rival's grandpa. And I think that's it. Pretty retarded isn't it? If you love your children, you won't expose them to this. (1 out of 10.)",
         "Celebi: Voice of the Forest (2001) has an interesting friendship and time travelling story. If you love Pokémon and also happen to enjoy time travelling stories, it is quite certain that you may like this one! In this one, the movie narrator finally introduce the characters and Pokémon Universe in brief. Its plot is also not as rush as before and it is a little more like the TV anime series which is good. Most of all, there are plenty of adorable forest Pokémon which is lovely and the time-travelling concept is absolutely clever! Unfortunately, I don't really like the 3D graphic incorporated into this film which I felt it is overly done. Overall, the forest is indeed beautiful but not until a 3D monster appears, which does not blend well with its surrounding. They also tried to let Ash to steal the spotlight even though this animated feature isn't about him so these are at least the two turn offs. Nonetheless, Celebi: Voice of the Forest (2001) is quite sweet to watch and it is interesting. I didn't want to spoil it for you but if you haven't seen it I could only hint that it isn't predictable!",
         "Young Sam is walking in the forest when he comes across a rare pokèmon being hunted. Trying to protect the tiny Celebi, Sam suddenly finds himself engulfed in a light before vanishing to safety. They appear back again 40 years later in the same clearing just as Ash and his friends are in the area. Sam tells them of the Celebi and the new friends set out to find it again in order to protect it. This will be a task harder than they imagine though as, unbeknownst to them, The Iron Masked Marauder is after the Celebi with his black pokeball to turn it evil and thus into the most powerful weapon ever. I'm not a Pokèmon fan (mainly because I have had sex at some point in my life \u0096 a typical clue that one will not be the target audience for this) but I didn't hate the first movie so when this came on and I was very bored I decided to watch it. The first film had potential because the central character had dark value that threatened to actually create a strong narrative (it didn't of course but it had some good moments). With this film the plot seems to be mostly about introducing a new pokèmon for the fans to care about. This means that there aren't even any vague themes to interest me and the story is very much simple characters in a simple story of bad characters and good characters doing bad and good things respectively. It relies almost totally on the monsters and constant \"action\" to hold the interest and I suppose in this regard it will suit young children ho really just need colour, movement and noise. The animation is reasonably good but the pocket monsters themselves are quite bland with lots of soft edges and no real threat or grit about them \u0096 the evil Celebi in its nest is the exception though as it is well done. Meanwhile the human characters are simplistic and delivered in big sweeping gestures and with voices to match. Adults hoping the characters will offer them something to focus on will perhaps not be surprised to learn that there is not. For kids then and has very little for those members of the audience looking for more than just colourful monsters running around the place in a simplistic narrative frame. I'm sure pokèmon fans will love it, but then they would, wouldn't they?",
         "Overall, a really cool film for us Pokemon fanatics--the new Pokemon are fun to watch and follow along on their new adventure----however, anyone who happens to be an obsessive-compulsive paranoid hoarder of TRAINER CARDS should NOT see this film.",
         "I never in my entire life have seen such crude animation,and a boring plot.The only reason i gave this a 5 was it was 1 hour! also the e reader card isnt anything special its just a bribe to get you to go see this horrible japan cartoon,plus this shows the pkmn craze has died alot sonce 1999."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Family",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Pikachu Project 2001",
         "Shogakukan",
         "4 Kids Entertainment"
      ],
      "summaries": [
         "This movie centers around the new pokémon Celebi, a one-of-a-kind veggie-like bug whose only kin are celebi from other points in time. The movie begins in the past where a young boy named Sam attempts to save Celebi from a hunter. In a reciprocal effort, Celebi uses his power and transports itself and Sam to the present, Ash Ketchum's time. Sam and Ash become good friends as they fight to save Celebi from the new Team Rocket villain, the Iron-Masked Marauder and his darkball, which turns pokémon evil and augments their powers to the maximum. Yet, one rare pokémon isn't safe without help from another - thus enters Suicune, a.k.a. the North Wind.",
         "Ash must stop a hunter who forces the mythical Pokémon Celebi to help him destroy a forest."
      ],
      "budget": 0
   },
   "movielensId": 174543,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2001-07-06",
      "dvdReleaseDate": null,
      "directors": [
         "Jim Malone",
         "Kunihiko Yuyama"
      ],
      "runtime": 75,
      "movieId": 174543,
      "title": "Pokémon 4Ever: Celebi - Voice of the Forest",
      "mpaa": "PG",
      "actors": [
         "Veronica Taylor",
         "Rachael Lillis",
         "Maddie Blaustein",
         "Ikue Otani"
      ],
      "imdbMovieId": "0287635",
      "originalTitle": "劇場版ポケットモンスター セレビィ 時を越えた遭遇（であい）",
      "genres": [
         "Adventure",
         "Fantasy",
         "Animation",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["DvQ7dEwjqWk"],
      "plotSummary": "All your favorite Pokémon characters are back, and are joined for the first time by the legendary Pokémon Celebi and Suicune, in this latest exciting Pokémon adventure! In order to escape a greedy Pokémon hunter, Celebi must use the last of its energy to travel through time to the present day. Celebi brings along Sammy, a boy who had been trying to protect it. Along with Ash, Pikachu, and the rest of the gang, Sammy and Celebi encounter an enemy far more advanced than the hunter left behind in the past. This new enemy possesses a Pokéball called a “Dark Ball,” which transforms the Pokémon it captures into evil and far stronger creatures. When Celebi is captured, the fate of the entire forest is threatened. Let POKÉMON 4EVER transport you to a world of adventure as Ash, Suicune and the rest take action to save the day!",
      "tmdbMovieId": 12600,
      "avgRating": 1.92857,
      "releaseYear": "2001",
      "numRatings": 14,
      "posterPath": "/bqL0PVHbQ8Jmw3Njcl38kW0CoeM.jpg"
   }
}