{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "women",
            "id": 515
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "girl",
            "id": 14659
         },
         {
            "name": "apartment building",
            "id": 33347
         },
         {
            "name": "apartment",
            "id": 33632
         },
         {
            "name": "evil",
            "id": 156075
         },
         {
            "name": "murder castle",
            "id": 232625
         }
      ],
      "imdb_id": "tt3424690",
      "video": false,
      "title": "Havenhurst",
      "recommendations": [
         401065,
         333318,
         357054,
         256095,
         415908,
         298157,
         427733,
         407547,
         463320,
         110285,
         455549,
         168243,
         416987,
         408755,
         403848,
         352128,
         347757,
         388243,
         248576,
         460123
      ],
      "backdrop_path": "/taD7rT1ZFjGKcJlcaeDGifvd35D.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Jackie",
               "gender": 1,
               "credit_id": "576bd59e92514165fc0025f8",
               "name": "Julie Benz",
               "profile_path": "/3ymRPOitD5IKXZgDLoy8FLRGQCn.jpg",
               "id": 35551,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Eleanor",
               "gender": 1,
               "credit_id": "576bd5aac3a3686ec6000021",
               "name": "Fionnula Flanagan",
               "profile_path": "/bQPNTSyBXdfwOXcwjCdzFXDSDVO.jpg",
               "id": 58068,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sarah",
               "gender": 0,
               "credit_id": "576bd5b2c3a368649100262d",
               "name": "Belle Shouse",
               "profile_path": "/5CRzzbRDknFrCTm2tPgh3vrSGBJ.jpg",
               "id": 1308561,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Tim",
               "gender": 2,
               "credit_id": "576bd5cdc3a36863d1002958",
               "name": "Josh Stamberg",
               "profile_path": "/g9RVuzJiWYdbfyllZEDgGbUM9xL.jpg",
               "id": 21882,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Danielle",
               "gender": 1,
               "credit_id": "576bd5e7c3a3686ec6000060",
               "name": "Danielle Harris",
               "profile_path": "/q3wQP4ZwVjfBerFK0iVZPzaF5BL.jpg",
               "id": 21320,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Tammy",
               "gender": 1,
               "credit_id": "576bd5f4c3a3686ec6000072",
               "name": "Dendrie Taylor",
               "profile_path": "/mGFSoz0U4wkGGrt8ZFeEXnLOYr6.jpg",
               "id": 81462,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "576bd5fe92514150e7000056",
               "name": "Toby Huss",
               "profile_path": "/7uCGyBMPRtPQjwc4ZxelUyricXc.jpg",
               "id": 18271,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ezra",
               "gender": 2,
               "credit_id": "576bd611c3a3686f13000046",
               "name": "Matt Lasky",
               "profile_path": "/yFJpwI2zeZiyHdzrdVaZueIe0Hc.jpg",
               "id": 101088,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Paula",
               "gender": 1,
               "credit_id": "576bd61b92514156bf0029d6",
               "name": "Jennifer Blanc",
               "profile_path": "/uasHB6t757gRtUFToPDpHkulo59.jpg",
               "id": 130024,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Hal",
               "gender": 2,
               "credit_id": "576bd62fc3a368639100241f",
               "name": "Brian Howe",
               "profile_path": "/bIyWNR7ZRKE7e8OZCwv6orqzrpu.jpg",
               "id": 1990,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Mike",
               "gender": 2,
               "credit_id": "576bd638c3a3686ec60000aa",
               "name": "Currie Graham",
               "profile_path": "/t3zqU6jnV7kuRpxzIV04yJCVXzK.jpg",
               "id": 156590,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Jen",
               "gender": 1,
               "credit_id": "576bd64bc3a3686f1300007c",
               "name": "Carrie Armstrong",
               "profile_path": "/lP1Gcifg2deGO8GicwfNfCIFbAt.jpg",
               "id": 168800,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Alexis",
               "gender": 0,
               "credit_id": "576bd670925141511200007d",
               "name": "Gwen Holloway",
               "profile_path": "/o9lbYX7Ircntyi8McG6IaFZgx6w.jpg",
               "id": 79075,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "576bd6899251416630002735",
               "name": "Jennifer Lafleur",
               "profile_path": "/4IbIjltoyEeanQxjGjLpi8KOWn4.jpg",
               "id": 1287658,
               "order": 13
            },
            {
               "cast_id": 7,
               "character": "Jed",
               "gender": 2,
               "credit_id": "576bd608c3a3686ec6000085",
               "name": "Douglas Tait",
               "profile_path": "/srV2pY6rPyTpHGW5saOhdbRfcrv.jpg",
               "id": 51301,
               "order": 14
            },
            {
               "cast_id": 12,
               "character": "Rick",
               "gender": 0,
               "credit_id": "576bd64292514150aa000074",
               "name": "Deep Rai",
               "profile_path": null,
               "id": 1640396,
               "order": 15
            },
            {
               "cast_id": 14,
               "character": "Heather",
               "gender": 0,
               "credit_id": "576bd65492514165fc002665",
               "name": "Natasha Goss",
               "profile_path": null,
               "id": 1496051,
               "order": 16
            },
            {
               "cast_id": 15,
               "character": "Captive",
               "gender": 0,
               "credit_id": "576bd66692514150e70000a9",
               "name": "Eric Heister",
               "profile_path": null,
               "id": 1640398,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "576bd6cdc3a3686fda00008f",
               "name": "Andrew C. Erin",
               "profile_path": null,
               "id": 87776,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "576bd6d892514151410000ad",
               "name": "Daniel Farrands",
               "profile_path": null,
               "id": 78136,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "576bd6f2925141517400009c",
               "name": "Andrew C. Erin",
               "profile_path": null,
               "id": 87776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "576bd702c3a3686f990000bf",
               "name": "Mark Burg",
               "profile_path": null,
               "id": 2145,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "576bd70a92514156bf002a58",
               "name": "tomandandy",
               "profile_path": null,
               "id": 60891,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.049712,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 403368,
      "vote_count": 37,
      "budget": 0,
      "overview": "A troubled young woman takes up residence in a gothic apartment building where she must confront a terrifying evil.",
      "similar": [
         357096,
         15069,
         22307,
         979,
         948,
         4771,
         238636,
         445954,
         984,
         9411,
         10651,
         2749,
         123109,
         18587,
         26390,
         8090,
         15762,
         12150,
         1586,
         2832
      ],
      "original_title": "Havenhurst",
      "runtime": 80,
      "poster_path": "/bXJt4mSbDcp7N08zePZuOSUZhFm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Twisted Pictures",
            "id": 2061,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Protocol Entertainment",
            "id": 38538,
            "origin_country": ""
         }
      ],
      "release_date": "2016-08-22",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Evil Lives Here",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew C. Erin"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Andrew C. Erin",
         "Daniel Farrands"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3424690/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTA1M2Y4MjAtNGRjNC00NTE1LWI2NGYtMmEyMzM4NGJlMmE0L2ltYWdlXkEyXkFqcGdeQXVyMTg0MTI3Mg@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Julie Benz",
         "Belle Shouse",
         "Josh Stamberg"
      ],
      "reviews": [
         "The ending was so botched, I can't help thinking the crew itself got \"evicted\" half way through the filming (read, ran out of money or fell apart). Despite the weird behavior of several characters, the story had a good potential till it suddenly, stupidly, untimely took a twist that is so used and abused, it doesn't even elicit a chuckle anymore. It just made an impression that the crew abruptly pulled the plug in the middle of all the action. Movies like this make me wonder how someone gets so much money, convinces a bunch of talented people to participate (most of the actors, the operator was pretty good), and is not held accountable for making bad script decisions that inevitably cut any hope for a good payout. Anyway. If you are reading this review, be smarter than me and trust the low rating: it is not an underrated gem. You would waste your time.",
         "\"Our rules are simple.You stay sober, you lead a good life, and you don't fall back into your old habits.Then, you are welcome to stay here until the day you die. And if I don't lead a good life? Then your stay at Havenhurst would be terminated.\" Are you a recovering addict and you're offered to stay at \"Havenhurst\" as aftercare, you'd better make sure you do not slide back into your bad habit. The result is an eviction from this gigantic baroque looking building in downtown New York. A normal eviction would involve you packing your bags and closing the door behind you in an agitated mood. If your stay is terminated at \"Havenhurst\", the eviction is quite painful and final. But you can be sure of one thing. You won't fall of the wagon ever again. The person who moves to \"Havenhurst\" is Jackie (Julie Benz), a recovering alcoholic who's responsible for the death of her lovable daughter because of her addiction. After she gets fired from rehab, she'll get a further follow-up in this luxurious looking hotel. Apparently, a whole bunch of ex-addicts are staying there. As said before, there's only golden rule in this building. The residents shouldn't start again with their bad habits. This is explained by Eleanor (Fionnula Flanagan), landlady of this shelter. A distinguished-looking elderly woman who clearly shows her sympathy towards the inhabitants and who obviously cares about their welfare. In retrospect, she appears to be mother of two less peaceful sons. Even a link is made with the notorious Herman Mudget (better known as H. H. Holmes, one of the first documented serial killers from the 1800s). In itself the film wasn't so bad but it wasn't really impressive either. It's a mixture of a few superficial ideas and concepts already used in other movies. The house is a maze of secret corridors and entrances in the walls, just like in \"House Bound\". The final destination of the victims and the denouement is again similar to \"The Hoarder\". The basement reminds you of \"The Texas chainsaw massacre\". And of course again you'll witness a little bit of detective work when Jackie realizes that some guests disappear without a trace. Unfortunately, there are also plenty of elements which aren't explained. There's the disappearance of Jackie's girlfriend Danielle (Danielle Harris). A brief event and a reason for Jackie to initiate an investigation \"Havenhurst\". And her relationship with the helpful agent isn't explained either in detail. The biggest disappointment for me was the horror content of the film. You can't really call it horror because it isn't actually frightening. Gory scenes can be counted on one hand. There is only one explicit scene and it's also kind of implausible at the same time. And to be honest the physical strength of the killer who moves throughout the building via cleverly designed mechanisms, is a bit exaggerated. His new victims are hurled through the room as if they weigh nothing. At one point I thought it was a paranormal phenomenon with a superhuman strength. And how is it that other people haven't heard that something was wrong? The walls are apparently paper thin so you can easily hear every suspicious noise or moaning. But apparently only Jackie can hear it. \"Havenhurst\" is no more than a thriller containing a gloomy mystery. A sort of horror for beginners. Unfortunately, there is not such a refuge in reality. Otherwise, more people would admit they have a problem so they are sure of a place in such a majestic building. Without a serial killer of course. More reviews here : http://bit.ly/1KIdQMT",
         "It all starts with the script -- and this one stinks. Seemingly inspired by the true story of H.H. Holmes, the Torture Doctor of Chicago, who murdered anything up to 200 people, most of them in his mansion/castle full of blind corridors, rooms that could only be opened from the outside, equipped with secret gas lines, and a basement used for dissection, Havenhurst bears many similarities. The movie opens with a great hook but alas, after that it's all downhill. A dopey story that is annoying more than scary, there are good actors in this movie with nothing to do but react to manufactured scares lifted from so many other (better) movies. A great musical soundtrack that is wasted on this inane story. The viewer wants so much to become immersed in the story but the only reaction is how soon does this godawful thing end? The one rave review which this movie gets on IMDb would appear to have been written by someone connected with the production who also knows of a bridge in Brooklyn that is for sale. With so many low budget horror movies being released, there are far better choices than this flick to spend one's money on.",
         "Imagine you are a recovering addict, either from alcohol, pills, or hard-core drugs. You finish your rehab and are sent to live in a lovely brownstone. Once you're there, you notice tenant after tenant disappearing right under your nose, and even though you try to get the police involved, they are completely disinterested. If that is the case, you are living in \"Havenhurst.\" Jackie has just completed her rehab (for alcoholism) and she is moved into Havenhurst. She is also looking for her very dear friend, Danielle, a photographer, who suddenly disappeared. As luck would have it, she is moved into Danielle's recently \"vacated\" apartment. Weird things begin to happen and she desperately tries to piece together the mystery of Havenhurst. The few things I liked about this film were the style, the look, the story, and the pacing. However, this was all undone by unbelievable actions and non-reactions by the characters. Jackie is NEVER in a hurry. Even when gut-wrenching screams are heard coming from her next door neighbors, she manages to do the 100-meter mosey, acting neither alarmed, surprised, or even caring. This is never reported to the management and most times never to the police. The detective and police also got on my nerves. In today's times, they will investigate an ant fart, but screams, wailing, and disappearances bring about as much interest as an ad for swimwear featuring Hillary Clinton. And the ending--oh lord, the ending. All of us serious horror movie watchers know you usually just have to \"go with the flow.\" However, I could not in this movie, and it RUINED it for me. Rated \"R\" for disturbing images, horror violence, simulated sex, and brief nudity. I did not particularly care for it; you might. This one is a toss-up.",
         "What could potentially have been a very interesting and unique horror movie, ended up being a generic storyline suffering at the hands of the writers. The story did have potential, but writers Andrew C. Erin and Daniel Farrands might have had ideas that were great, but they just failed to transcribe those idea over into something that would translate into something great and interesting on the screen. No, the story just permeated mediocrity and half-heartedness all the way through. Furthermore, it didn't help one bit that the storyline was completely devoid of anything even remotely scary. What did work out quite well in favor of the movie was the house and the design idea behind it. There were some very interesting ideas and concepts here that were quite nicely brought to life on the screen. But again, it just lacked that element of horror. \"Havenhurst\" also had some adequate acting performances to boast it, although they were struggling with a very inadequate script, and it was weighing the actors and actresses down visibly on the screen. For a horror movie, I will say that \"Havenhurst\" belongs more in the mystery genre with just a hint of thriller to it. Which are the tags of the genre here on IMDb. I just sat down to watch it because I thought it was going to be a horror movie. So I was naturally very disappointed with the end result. \"Havenhurst\" is a mediocre movie that came and went without any fanfare and without leaving any impressions in the horror genre, because it just wasn't equipped with fangs or nails.",
         "A troubled young woman takes up residence in a Gothic apartment building where she must confront a terrifying evil. Director Andrew C. Erin (Embrace of the Vampire) brings us this film from a screenplay co-written with Daniel Farrands (Amityville: The Awakening). We also get music from tomandandy (Mothman Prophecies, The Strangers and a couple Resident Evil films), some of the best in the business. Farrands may be best known for writing \"Halloween: The Curse of Michael Myers\" or for being involved in various documentaries about 1980s film franchises. He would appear to love that 1980s slasher feel, and (if so) it definitely comes through here. Although ostensibly a haunted house story, this is really a slasher at heart. The film opens with a pulse-pounding score, superior gore effects and a dazzling cameo from horror goddess Danielle Harris. Unfortunately only a cameo rather than anything approaching a \"supporting\" role, but the rest of the cast is just great. We have powerful acting from Julie Benz (Dexter, Buffy, Two Evil Eyes), and an evil maternal instinct from Fionnula Flanagan (The Others, Trash Fire). What sells the film more than anything is the cinematography, as the colorization is rich, and provides a nice palette against which to tell a moving story. The apartment offers up the best possible use of space -- sometimes overly spacial and intricately ornate, sometimes claustrophobic, and with a few nods to other horror classics such as \"The Shining\" and even \"Psycho\". The exterior aerial shots look great, and it left me wondering if this is a real building or if some crafty CGI is used. In recent years, public discourse was concerned about the so-called surveillance state, and those fears come to life here. We even have secrets behind the walls (reminiscent of \"Crawlspace\") and a plot twist that ties this (fictional) film to the upcoming (factual) \"Devil in the White City\". Although this story of murder and disappearance could be in any era, this surveillance aspect makes it especially timely, even if not intended by the writers. I highly recommend \"Havenhurst\". Though it seems to have been pushed back a year, it will be an early strong contender for great horror films of 2017. The film should be available widely starting on February 10, 2017.",
         "In films like Havenhurst, the most convenient thing to do is to focus on the pros, and hoping them to partially compensate the usual problems of a horror B-Movie, made with a certain visual style and adequate handling of the suspense, but pre-fabricated characters and little imagination. The main one of those pros is Julie Benz, a veteran of the fantastic genre whom I have always considered an excellent actress with a remarkable emotional range; and even though Havenhurst doesn't represent a big histrionic challenge, it's always positive to count with a credible and expressive performer under any situation. As for the screenplay of Havenhurst, it keeps a mystery regarding the cause of the deaths; sometimes, we are presented evidence of a supernatural entity, and in other occasions, we are inclined to think it's the work of a human (or semi-human) killer. Said mystery isn't particularly complicated or compelling, but it was useful to fill in the 80 minutes of the film. Regarding the gore, it's appropriately juicy, but not as frequent as I would have preferred. In conclusion, Havenhurst is a mediocre film, but it didn't bore me, and I can give it a slight recommendation, specially to other fans of Benz's. But frankly, I would have preferred to re-watch some \"Darla-centric\" episodes of Buffy the Vampire Slayer.",
         "This has a great premise, is well acted and directed but there are a couple really awful moments. As a reminder, if a monster/psycho is stalking you and you manage to knock him out/down, KILL HIM! Don't get up and run. I know this is a horror film but it happens a couple times so it really ruins any realistic momentum. Finally, that ENDING! Ugh! After all we go through, the little girl escapes, returns to the apt--and decides to \"join the family\"? No reason given, and then it's over. Really a disappointment.",
         "HAVENHURST takes not only its inspiration but it's foundation from the real life historical details surrounding Herman Webster Mudgett, a.k.a. H. H. Holmes, \"one of the first documented serial killers in the modern sense of the term\". Taken as a whole, what is so incredible about the original, real, Mudgett story is that, if you were to read it as a novel rather than as an account of recorded historical facts, you simply wouldn't believe it. Mudgett comes across, literally and completely unbelievably, as an antebellum comic book supervillain. Dashingly handsome, obviously a genius, a graduate of the University of Michigan's Department of Medicine and Surgery at age 23, he was possessed of an infinite supply of charm, intelligence, chutzpah and urbanity that allowed him to charm anyone and apparently pull off any con. Turning his collection of deceptive skills to good use, he was seemingly able to generate large sums of money at will. But what's a supervillain without a lair? By the age of 28, Mudgett had amassed enough fortune to build a massive hotel building, a three- story block-long affair that was nicknamed \"The Castle\" simply because it was so enormous (for the time). While the street-level floor housed conventional commercial shops, the upper 2 floors \"\u0085 contained his personal office and a labyrinth of rooms with doorways opening to brick walls, oddly angled hallways, stairways leading to nowhere, doors it could only be opened from the outside\u0085\", and so on. Like Capt. Nemo, he never allowed any one individual to gain significant knowledge of any large part of the construction project. Reads like a Stan Lee origin story, doesn't it? Within the walls of The Castle, in the middle of Chicago no less, \"somewhere between 9 and 200\" people were killed as part of a variety of for-profit schemes involving life insurance scams, skeletal models for medical schools, and model organs. To help with operations, he invented his own alarm systems to monitor people moving about within his building. The Mudgett story goes on and on in this same vein. If you saw it as a movie, you simply wouldn't believe it. It's just too outlandish. And you need to keep in mind that he accomplished all of this and was dead by execution by the age of 34. Even the account of his own hanging is excessively ghoulish. As part of the Mudgett story, it's known that it had been his intent to build more than one hotel. This intention provides the foundation for the movie HAVENHURST; HAVENHURST is another one of Mudgett's \"specialty hotels\". For the purposes of the movie, it's a different family running it and their motivations are different from what Mudgett would understand, but it's pretty much \"second verse, same as the first\". The connection to the original Mudgett story serves to highlight two points. Firstly, truth really is stranger than fiction. The original Mudgett story is intrinsically more fantastical and made even more so by the fact that it is entirely real. The writer of HAVENHURST basically goes head-to-head on the story and simply can't create a fictional story that can stand on the same playing field with the historical one. And secondly, a basic movie through-line composed primarily of slicing and dicing people, for whatever reason, is just not enough to carry a movie. HAVENHURST does draw a little extra spark from its roots in appalling historical facts but then just falls flat. It's all been said and done far better by Mudgett himself in the real world before the movie even begins. The movie literally depends on its audience being completely ignorant of the historical facts surrounding the Mudgett story in order to have anything to serve up to the audience; if you know the Mudgett background, HAVENHURST is simply a tiresome exercise in tiptoeing through the intestines. Having to depend upon audience ignorance in order to have something to give is a bad plot strategy. While they can't save the movie from its own intrinsically limited playbook, Julie Benz and Fionnula Flanagan, who were also together in the TV series DEFIANCE, do provide some quality acting to help relieve the boredom. Ms. Flanagan has been providing quality acting since 1965, if memory serves, and it's interesting to see how much atmosphere she's able to create in what is otherwise a vacuum of interest. And lastly a note for the makers of HAVENHURST... You should at least do 10 minutes of research if you're going to make a movie based upon historical facts, people, and events. You want to exploit historical facts, not trip over them. Mudgett took pains to provide soundproofing in his kill rooms. Some of his methods of killing could take days and probably involved lots of screaming. Having eerie screaming from behind walls and echoing up as the victims disappear down hidden chutes as a primary scare effect just conflicts with historical facts. You certainly wouldn't have heard them in a Quality Mudgett Hotel.",
         "Let me start off by saying that the only reason I gave this film a go was because I like Julie Benz from the Dexter series. I find her to be very attractive in a naive kind of way in her role from the series. But omg, how bad was this film, let me count the ways. Number one, Benz plays a recovering alcoholic who moves into the building (the title of the movie) only to learn that that whoever breaks the rules while living there of their past lifestyles, (hence drinking again) will pay a severe penalty for it. The film is just plain awful, Benz has no range of character the story makes absolutely, no sense, and the whole time I just ended up screaming at my 70in TV, from scenes where she clearly had the upper hand and because of a very poor script, she winds up doing something stupid to get caught. I so hate that. Stay clear of this of this one, its only make you mad at how bad a writer can be and how bad writing results in bad acting.",
         "This could have been a Gothic horror but sadly it fails. It all starts promising with the dissapearance of a tenant. But once her best friend starts to investigate this flick has nothing really to offer. It never becomes scary or bloody or at such a house even creepy. I admit, the beginning do shows some red stuff and in the basement there's a gory shot but overall something is missing to make it worth searching out. And the acting was okay but being low profile on the horror it makes it after a while hard to sit through. All characters and cliches are in this flick but it doesn't work out, it's all predictable. Gore 0,5/5 Nudity 0,5/5 Effects 2,5/5 Story 2,5/5 Comedy 0/5",
         "At first quick glance, one might expect The Bramford of Rosemary's Baby infamy was being flown over upon demon wings, but then it is realizes]d that this is yet another impressive Gothicesque building arising stoically into the darkly clouded sky, so named Havenhurst. If one could imagine an organization like AA punishing drunks for intoxication, or torturing junkies for getting high, all the while being observed on hidden cameras for any sign of an offense, it aptly captures the general plot herein, while a huge goon dishes out the discipline, or so-called \"tough love\" onto a bloody silver platter complete with viscera, of the offenders who are quite literally turned inside out. A pretty brunette named Jackie seeks refuge at this deadly rehab center for her alcohol addiction after losing her daughter in a car accident. Signing her lease, she essentially commits her life to this lethal institution, incrementally learning its deadly secrets from its history with the nation's very first serial killer, H. H. Holmes, the plethora of secret hatches which Havenhurst is honeycombed with, escape routes, false walls, and observations holes, all overseen by the mysterious Eleanor who reminds Me of one Dorothea Puente, and her two faithful killer sons Ezra & Jed. One in charge of maintenance, the other of executions, or ridding this veritable murder castle of unpleasant offensive elements. The place is like a maze reminiscent of The 7th Guest, as every darkened hallway, elevator, and room carries own puzzle, levels of Hell creating one monstrous edifice seeped in blood. Once in awhile, one must ask oneself if these revenants to-be residents are deserving - and actually in the majority of cases, they certainly are, case in point a rotten couple of lushes mentally and emotionally abusing their daughter Sarah, whereupon it becomes physical, her friend Ezra steps in to terminate the problem, then eventually turns on Jackie when she violates the rules with her compulsive embibement. Overall, with shades of Nightmare on The The 13th Floor and tie-ins with the true crime case history of Holmes, even including influences of The Cecil, Havenhurst is sure to chill for claustrophobic, voyeuristic, sanguinous thrills. ∞",
         "Havenhurst is a sprawling Gothic building that has been turned into a halfway house for recovering addicts. Its latest tenant is Jackie (Julie Benz), an ex-alcoholic who discovers that her new abode harbours a horrifying secret: it was once home to one of America's first serial killers, H.H. Holmes, and someone seems to be following in his bloody footsteps. To be honest, there's not a whole lot of originality going on in Havenhurst, the plot taking the well worn 'creepy old house with a secret' format (complete with hidden passageways and trapdoors) and adding a little Saw-style punishment for good measure, as meted out by cold-hearted landlady Eleanor (Fionnula Flanagan) and her sons whenever their tenants fall off the wagon. Despite a strong central performance and just a smidge of gruesome gore, the film never really delivers the chills, failing to get the pulse pounding with its hackneyed attempts at eerie atmospherics (the whole building could do with better lighting) and predictable jump scares (I lost count of how many times a creepy figure would suddenly rush past the camera in the foreground or behind a character). In short, Havenhurst is by no means a terrible film, just not all that inspired. 5.5 out of 10, rounded up to 6 for bumping off Danielle Harris, horror's most over-rated scream queen, as soon as possible.",
         "Julie Benz & Danielle Harris in the same film? Yes please, I thought when the credits began but alas it wasn't meant to be. Harris may possibly have been there as a favour to someone as her total screen time is barely 60 seconds. Havenhurst is a gigantic apartment building for people to put their lives back together. It's full of former alcoholics, drug addicts and various criminal types and that's where our heroine moves in seeking her missing best friend. If you play nice it's a great place to live but should you return to your old ways you'll find yourself in a world of trouble. Julie Benz is an incredible actress, a tour de force and is always fantastic to watch. It's rare to see her as the leading lady so it was nice to see her get her chance here. She does a brilliant job and the movies concept is actually quite intriguing especially near the end where a big twist occurs. I walked away from this feeling that something was missing, maybe the delivery wasn't on point, maybe it was too short or maybe the finale didn't appease me. Regardless Havenhurst is a decent enough watch and could potentially see a sequel or even a franchise. The Good: Julie Benz Great twist Very original The Bad: Awful cover Feels incomplete somehow Things I Learnt From This Movie: Julie Benz doesn't age, seriously it's getting ridiculous Danielle Harris may well have been in the movie more than I realised, she's just so tiny maybe I missed her",
         "I watched this one despite its weak rating because I really liked Julie Benz and Fionnula Flanagan in \"Defiance\". But even they couldn't haul this one over the finish line. What's so sad is that there was real potential here, given the historical connection the writers were going for. The matriarch of the clan is presumably descended from the infamous H. H. Holmes (actually named Herman Webster Mudgett) whose murderous exploits are usually connected to his \"castle\" in Chicago in myth and lore (though the murder that sent him to the rope had nothing to do with the castle and took place in Philadelphia). Given the bizarre stories surrounding Holmes, there was almost limitless potential in a story inspired by his life. Instead, we find ourselves caught midway between Halloween and House of 1000 Corpses, dialed down for a mainstream audience. The entire synopsis of Havenhurst could be summed up as \"Almost, but not quite\". Character development was sacrificed on the altar of interminable, plodding setup of ... interminable plodding conclusion that employs the same devices as every other slasher flick, but with less of the gratuitous gore that usually comes with the genre. And that's a shame, because there was real potential in these characters. Benz seemed to be reprising her role in Defiance, but lacked the grim determination (and pragmatism) of her character there. Flanagan was as despicable and loathsome as you'd expect, but was handicapped by dialogue that read like daytime TV and a script that had her filling in the blanks so you had some idea what you were seeing. The kid could have been a multi-layered composite, but all that was lost in trying for the \"surprise\" ending that surprised nobody. Even the detective that spent most of the film investigating the place (off the books, but on the clock of course) phones it in when he arrives on scene for the second time with a whole precinct in tow, takes a quick tour, doesn't even bother questioning the suspect and then leaves quietly despite being told not half an hour before that \"there's a secret room in the basement with all the evidence you need\". And apparently there was no budget for extras either, because despite being in a building with a minimum of 11 floors, with multiple rooms on each, in the largest city in the country we never see ANY of the residents other than the ones who are about to get killed. Granted it adds to the creep factor, but the only reason I can see for this omission is that it saves them having to explain why nobody has reported the bloodcurdling screams at all hours of the day and night before now. All in all, a great concept that failed in its execution.",
         "If you are going after a bunch of killers then \"take a gun\"! Dughhh. And #2, when you knock the bad guy down, keep hitting him till he's dead.. That one always gets me and is never done in movies. Someone knocks down the bad guy and then runs away just to have to do it all over again and again and again. Not even the lovely Julie could save this thing.",
         "However, something between brainstorming and filming must have gone awry. The opening scene I missed the fact that I was seeing a cameo because I was instead infuriated that the junkies looked like they had just put on freshly purchased clothes and pulled the sleeves down 'sloppily'(as junkies do). Luckily, this was the worst of the acting... but possibly the most consistent part of the plot. I don't intend to go through the film scene by scene but there are a few things that it seems most of these reviews are just overlooking. Overall the main problem with the plot is the false leads. There are nearly seven theories that they gave credence to before they revealed what was actually going on. Unrelated to any of the evidence, so don't bother. From here on is where the spoilers are, and I'll try to limit it as much as I can bear.(I lied, it gets pretty laden... but there is more to pick out than what I put to words if you want to give the movie a shot for that sort of a reason) I didn't hate this movie, but just because I found enjoyment doesn't merit it a decent work... and this one nearly gave me anxiety. The characters start figuring out what is going on. By start, I mean that basically all they know is that they are being watched while they're in the halfway-house and that it is somehow related to tenants disappearing. So, the only logical thing to do is to gather all of the evidence you can and openly discuss it in the room, right? At one point a character gets film developed at an offsite store and takes them all of the way back to Havenhurst before looking at them... after which she makes a call on the phone inside the room to tell a detective to come look at them. Once what is actually going on is known, it is confirmed that there was no logical reason for characters(some weighing near 170lbs) to be flying across the room. During the second 'attack' scene this happens to a character without even having been touched. Later there are times when the bad-guy sends someone freefalling ten stories down a shoot and the first thing they see when they sit up is him creeping around the corner. Okay, maybe he uses the other shoots for travel and just doesn't reel as long as some months-sober lady with a fresh hangover. Nope, the next scene she kicks him down a sewer ladder, he falls from the top to the concrete between nine and fifteen feet below. Main character does nothing more than pull herself up the last rung, close the drain behind her and check the exit door and he's already climbed back up the ladder, struggled with the opening, and presumably made it all the way back down the ladder because he's crashing -down- through the ceiling on top of her. At one point she cracks him over the head with a skillet and he doesn't even flinch, ten minutes later she hits him with her foot and he lets go of a sewer ladder and her other leg(both hands). There is a whole thing about the main characters missing friend comparing photos of what is sometimes one way and sometimes another throughout the building, but they decided to also(in fact, more so) focus on how the dimensions of the building are not the same as they 'used to' be... without any mention of why the older photos existed, it is later revealed that this building PRECEDED the one made famous by the families long-dead infamous bloodthirsty ancestor. Someone who appears in a couple of photos in the time when you had to sit there throughout the exposure so as not to screw up the shot. Subtract ten-fifteen years off of these later photos and that is when they are implying he already had Hofbräuhaus converted and actively capturing people. So even for decoration, these photos of 'before the passageways in the walls' should not have existed. The last thing I can't forgive is the fact that he has an entire wall of tools but decided to hang a die-bar on the peg-board??? She's walking around with it in one hand and using it like a pry- bar, which is maybe what the crew thought it was a prop for. That's not the type of tool someone would have in a custom built area with frames/supports sourced in-house, it's a 30-75lb(this one is admittedly a smaller version) specialty item for moving pressing equipment to where they can be bolted(to assemble something like what you saw crush the Terminator in the first movie). Here's a hint in case you ever find yourself running from a murderer and you come across naught but a die-bar hanging from a ply-board wall, to open or finagle something with it, pry with the pointy end. The slanty end is for leveraging between the tip and the widest part(you will likely be alternating which end is the fulcrum if you use this for what it is intended for) something that weighs more than half of the people on a given factory shift put together and moving it around a hopefully smooth surface. So in that sense I guess I could be wrong, if there were a slight gap under the gate she likely could have taken one steady lift on the end of the handle(pivoting the tip off of the floor) and flung the entire thing off of the hinges... being as strong as she is, at least.(look out little girl!)",
         "I rarely write spoiler filled reviews, however for 'Havenhurst' I decided I simply had to to do it justice. I was quite blown away by this film. It started out with a very generic opening scene that we've all seen a thousand times before, and I thought to myself \"here we go again.\" But then as things began to move along I found myself more focused than I usually am while watching a horror movie. Usually the story is so mundane that I find myself drifting off into other thoughts and really struggling to focus. 'Havenhurst' didn't have me doing that. By about the 2/3 marks though I would still have considered it only a slightly about average horror flick. Then the final third commenced and I was absolutely hooked. Coincedentally, this is the second film in a row I've watched (I won't say the name of the other film so as not to spoil that one) where the theme has been someone working within the walls of a house/building with the intention of killing people. And even when I was watching the first of those two films I was thinking that this is becoming quite a common trend in horror movies lately. Rightly so too, because it a very creepy subject. Afterwards you can't help but look at your own walls, or attic, or basement in a different and uncomfortable way. The ending to 'Havenhurst' is what absolutely sold it for me. The whole time I had thought the young girl was a very suspicious character, but I couldn't quite put my finger on how they were going to link her in. They did it masterfully. I was also incredibly pleased to see that they didn't feel obliged to give us a happy ending. Happy endings are the death of horror films in my opinion, they simply should not exist. 'Havenhurst' ticked that box too. In a world that is severely lacking in good modern horror films, 'Havenhurst' is a breathe of fresh air. It's creepy, will keep your attention, has some genuinely tense and uneasy horror scenes, a well written story and a brilliant ending to top it all off. What more could you ask for? A sequel, perhaps.",
         "I can not in my wildest imagination understand who would give this anything more then two stars.... The story at its core has potential, but holy Christ is it misused... None of the characters are even vaguely believable or interesting - the script is utterly terrible and full of clichés to the degree where your completing sentences in your head half the time - the \"scary\" characters are at best kinda funny and the low budget is embarrassingly evident, in everything from the obviously fake hand being stabbed to the meaningless repetitive aerial shots of the so called havenhurst building... You can watch it for free on Netflix right now, but it only really works as background noise while doing something fore fulfilling with your life simultaneously. Anyone associated with this project should seriously consider a career change 0_o",
         "This was Dreadful in every way except the set design. I love Juli Benz but this movie was not good enough for someone with her talent. Terrible script, the worst directing actors I have seen in years so much so that I can't believe these actors - some of which are well known - allowed it. Each take felt like the first, and were over acted, cheesy, and painful. The scream queens are in this (actresses who often do B horror movies) but they have gotten a lot older and yet were still playing younger parts and dying in horrific, ridiculous ways. Stay away from this one, there are so many other films that are more worth your time.",
         "Well first of all I wanted to enjoy this movie as a Danielle Harris fan but nothing against her in this movie but its another bottom shelf tragedy in the DVD store that has all been done before. I expected a lot better as the movie started off pretty good but went a little too downhill so my overall rating is 3 0ut if 10 Aye (Geordie Accent). Hope you enjoy this movie as much as me and my family felt very disappointed and threw the horror channel on instead. A true horror fan will understand from the very beginning and will know where from the movie will end from the opening,these movies have to incorporate a new environmentally fresh ideas or sometime, I would not recommend this movie as a birthday gift or anything only fit for the trash can full of yesterdays carcass. Enjoy!",
         "The title has some flair to it, doesn't it? But the movie itself has almost no distinguishable flavor. It's dime a dozen or painting by the numbers (no pun intended). The start is really powerful as with most Horror movies. But it's kind of the Highlight of it all. There are some interesting effects after that, but there is not really a big suspension as to what will happen. Doing something so expected could make you feel, you should rate this lower. Or not watch at all in the first place. Then again, some Horror fans do like these sort of \"haunted places\" (in movies that is, I reckon), so there is something here for you guys. If you're not in that particular group of people, better stay away from this.",
         "A woman is in a sobriety program after her drunk driving ended up killing her daughter. She moves into a huge Gothic style apartment where other addicts reside trying to better themselves. If anyone has a slip and falls off the wagon the house removes them fast. She tries to find out where the house takes these people who are never seen again. This is loosely based on a late 1800's serial killer H.H. Holmes who built a murder house and claimed to kill over 200 people but was closer to 10 in reality. The house in the flick does have some cool trap doors and hidden rooms where some sick surgeries take place. There are some good gore effects but they are only utilized a couple of times. Not much time is spent giving any background to the story or even the characters really, which makes you kind of step back a bit, instead of immersing yourself into the story. I didn't like the ending but a sequel could fix everything. 5 twitching torsos out of 10.",
         "The film opens with Danielle (Danielle Harris) and her boyfriend doing lines in a half-way house that looks like a Stephen King hotel. Soon she meets someone in an elevator almost as ugly as Steven Tyler and disappears from the script. Her alcoholic friend Jackie (Julie Benz) occupies the same room after rehab. The room appear to be a combination of \"1408\" and \"Hold That Ghost\" (both films I recommend). Things are not quite right and Julie becomes curious involving a little girl (Belle Shouse) and a police officer friend (Josh Stamberg). This was a nice flat in the middle of NYC. Something like this would rent for millions. I know I wouldn't screw up. What happens in the film is that it goes from what appears to be a decent ghost horror thriller and morphs into a dumb slasher. At this point any mystery is immaterial. The script just died. Acting was phoned in. Soft 3 stars. Guide: F-word, sex, nudity (Jennifer Blanc-Biehn again)"
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Protocol Entertainment",
         "Twisted Pictures",
         "Parismony Pictures"
      ],
      "summaries": ["A troubled young woman takes up residence in a gothic apartment building where she must confront a terrifying evil."],
      "budget": 0
   },
   "movielensId": 174519,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-08-22",
      "dvdReleaseDate": null,
      "directors": ["Andrew C. Erin"],
      "runtime": 80,
      "movieId": 174519,
      "title": "Havenhurst",
      "mpaa": "",
      "actors": [
         "Julie Benz",
         "Fionnula Flanagan",
         "Belle Shouse",
         "Josh Stamberg",
         "Danielle Harris",
         "Dendrie Taylor",
         "Toby Huss",
         "Matt Lasky",
         "Jennifer Blanc",
         "Brian Howe",
         "Currie Graham",
         "Carrie Armstrong",
         "Gwen Holloway",
         "Jennifer Lafleur",
         "Douglas Tait",
         "Deep Rai",
         "Natasha Goss",
         "Eric Heister"
      ],
      "imdbMovieId": "3424690",
      "originalTitle": "Havenhurst",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Ele3lxqK3wc"],
      "plotSummary": "A troubled young woman takes up residence in a gothic apartment building where she must confront a terrifying evil.",
      "tmdbMovieId": 403368,
      "avgRating": 2.92857,
      "releaseYear": "2016",
      "numRatings": 7,
      "posterPath": "/bXJt4mSbDcp7N08zePZuOSUZhFm.jpg"
   }
}