{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "mountain",
            "id": 1262
         },
         {
            "name": "mountain village",
            "id": 2802
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "based on tv series",
            "id": 10988
         },
         {
            "name": "young boy",
            "id": 11336
         },
         {
            "name": "pokémon",
            "id": 11451
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "fighting",
            "id": 14955
         },
         {
            "name": "based on video game",
            "id": 41645
         },
         {
            "name": "pikachu",
            "id": 201952
         },
         {
            "name": "anime",
            "id": 210024
         }
      ],
      "imdb_id": "tt0235679",
      "video": false,
      "title": "Pokémon 3: The Movie - Spell of the Unown",
      "recommendations": [
         12599,
         12600,
         33875,
         10228,
         36897,
         36218,
         34065,
         34067,
         16808,
         47292,
         25961,
         39057,
         50087,
         245170,
         227679,
         20455,
         150213,
         350499,
         88557,
         11052
      ],
      "backdrop_path": "/4uVrT0guBqyeo1E9pjpMhRgHLBW.jpg",
      "revenue": 68411275,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ash Ketchum",
               "gender": 1,
               "credit_id": "52fe43de9251416c750213f1",
               "name": "Veronica Taylor",
               "profile_path": "/28EFUb3bPWJaWYzZIxurGCrDpHk.jpg",
               "id": 67830,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Misty / Jessie / Wigglytuff",
               "gender": 1,
               "credit_id": "52fe43de9251416c750213f5",
               "name": "Rachael Lillis",
               "profile_path": null,
               "id": 67832,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Brock / James / Squirtle",
               "gender": 2,
               "credit_id": "52fe43de9251416c750213f9",
               "name": "Eric Stuart",
               "profile_path": "/3aTpgbntEzsaPCfVFY5ZddZxqBR.jpg",
               "id": 67833,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43de9251416c750213ff",
               "name": "Michael Haigney",
               "profile_path": null,
               "id": 65428,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43de9251416c75021405",
               "name": "Kunihiko Yuyama",
               "profile_path": "/9z3LqqCMRZWyptfIZnlAdG7CnaZ.jpg",
               "id": 65429,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43de9251416c7502140b",
               "name": "Kunihiko Yuyama",
               "profile_path": "/9z3LqqCMRZWyptfIZnlAdG7CnaZ.jpg",
               "id": 65429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43de9251416c75021411",
               "name": "Takeshi Shudo",
               "profile_path": null,
               "id": 65430,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.262154,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 10991,
      "vote_count": 192,
      "budget": 16000000,
      "overview": "When Molly Hale's sadness of her father's disappearance get to her, she unknowingly uses the Unown to create her own dream world along with Entei, who she believes to be her father. When Entei kidnaps Ash's mom, Ash along with Misty & Brock invade the mansion looking for his mom and trying to stop the mysteries of Molly's Dream World and Entei!",
      "similar": [
         128,
         62211,
         888,
         40807,
         390734,
         351460,
         553,
         81,
         436931,
         10228,
         1267,
         36897,
         378064,
         44363,
         376660,
         9823,
         234004,
         80038,
         13754,
         14003
      ],
      "original_title": "劇場版 ポケットモンスター 結晶塔の帝王 ENTEI",
      "runtime": 93,
      "poster_path": "/5ILjS6XB5deiHop8SXPsYxXWVPE.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "suomi",
            "iso_639_1": "fi"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TV Tokyo",
            "id": 3034,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "4 Kids Entertainment",
            "id": 3035,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kids' WB",
            "id": 89163,
            "origin_country": ""
         },
         {
            "logo_path": "/r2EGQhzBsx7GON251DPpfsWtaj2.png",
            "name": "Nintendo",
            "id": 12288,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Oriental Light and Magic (OLM)",
            "id": 66289,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pikachu Project 2001",
            "id": 89164,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pikachu Project",
            "id": 12653,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shoakuken",
            "id": 89165,
            "origin_country": ""
         }
      ],
      "release_date": "2000-07-08",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/iGoYKA0TFfgSoZpG2u5viTJMGfK.jpg",
         "name": "Pokémon Collection",
         "id": 34055,
         "poster_path": "/j5te0YNZAMXDBnsqTUDKIBEt8iu.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://movies.warnerbros.com/pk3/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Kunihiko Yuyama",
         "Michael Haigney"
      ],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Norman J. Grossfeld",
         "Michael Haigney"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0235679/",
      "coverLink": null,
      "actors": [
         "Veronica Taylor",
         "Eric Stuart",
         "Rica Matsumoto"
      ],
      "reviews": [
         "The other day, I was looking through some old boxes filled with old stuff of mine. In this box was my original NES, some games, and all of my Pokemon stuff. Including each of the films on VHS (well, the first three and Mewtwo Returns). I remember watching the movies when I was still a Pokemon passionate, and wanted to see if I could get that same rush still, four years later. Well, with the first two, no chance. The third one, Pokemon 3: The Movie, however, was different. Again, this review is coming from an 18 year old high school graduate. And even four years later, Pokemon 3 still delivered the thrills. Loaded with excellent animation, some tense battle scenes (Charizard vs. Entei, anyone?), and a heartwarming theme that children can embrace, I recommend Pokemon 3 to anyone who wishes to rediscover their childhood or for anyone who is just up for some great animation. 9/10",
         "I'm at the point now where I can name the well-known Pokemon, but I still consider myself mostly Pokemon-illiterate. I never much cared for the TV show, and I don't play video games anymore. So why, you may ask, would I go to see the movies? Well, I confess that I love seeing animation on the big screen. I don't know if they spend more money or what, but animation to me almost always looks better on the big screen. I loved the first movie, didn't like the second. And now that I've seen the third, I gotta gay I love it, too. The \"Pikacu and Pichu\" short is, just like its two predecessors, merely a showcase for more Pokemon. Didn't leave an impression. The feature, however, is great. Entei is now my second favorite character from these movies, second only to Mewtwo. Like Mewtwo, Entei has a reason for doing what he does, even if it is misguided. Also, he (again, like Mewtwo) is one of the reasons why you must experience this film in the best sound system possible, because his voice comes out of all the rear surround speakers. Ralph Schuckett does another good job with the musical score, and the two songs I heard I LIKED. I also liked the use of the little girl Molly and her imagination as the reason for the happenings, and the inclusion of Ash's mom, no doubt making this a more personal battle for Ash. Oh yes, the animation is quite nice (best of the three), and the action rarely lets up once it starts! No doubt some will bash this simply because it is Pokemon, but all I can say is if you can get past \"Pikachu and Pichu,\" TRY giving it a chance--even if you know nothing about Pokemon, you might still enjoy it. I sure did.",
         "Seeing how many adults despise Pokemon, my comments might strike those as the ramblings of a social oddball. But so what? My child likes Pokemon and I happen to like the Pokemon show, it's not always great but it good to see a show that teaches kids to strive for a goal that is not reachable in half an hour. Name any other children's show where the characters take an entire season to reach a stated goal. In a funny way this show is more realistic then any other children's show on American TV. The program is very tolerant of people's differences and celebrates everyone's unique talents. And I like the different Pokemon creatures and my son and I enjoy playing the N64 Pokemon Stadium 2 game together. He really enjoys explaining the different Pokemon to me as we play. I have a friend who runs tours at a local science museum using the Pokemon as a way to get the kids into natural history and sciences. It really sparks some of the children into learning more. That said, the movies have been a different story. The first was a very dark movie and the second, although better, still had a strange apocalyptic undercurrent more typical of Japanese animation for older audiences. I missed the light hearted nature of the TV show. The new one is different, the story is more suited to young audiences and it's mostly more coherent to adults who are with the young ones. (Although the kids will have to explain some plot elements to you if you haven't kept up with the show.) The film also has a much better story than the first two. There is still quite a bit of large scale fighting at the end but it's not the end of the world stuff of the first films. Do I recommend the film to regular audiences? No, but I do suggest to parents that you don't make excuses to not take your child. This should not be the torture you may have experienced with the first two.",
         "Pokemon 3 was definitely entertaining. I will say it was not as good as I thought it was going to be, considering how the first two were insanely enjoyable kids movies, but if you liked them you are sure to like this one for the same reasons. This movie, was still, great like the others, and I enjoyed watching the newly introduced Pokemon and characters. To me, the humor could have been left without, as usual, the sad scenes, were not as tear-jerking like in Pokemon 4Ever and the first movie, and the action was watered down a bit than what it was in the first two. There was really nothing spectacular, but every Pokemon lover has to know that it doesn't take a masterpiece to entertain, because of course the Pokemon series aren't masterpieces, but they still deliver great entertainment. The plot to this movie was that the new legendary Pokemon, Entei, in this movie was able to speak with his mind. He was guarding over this girl Molly, for she believes he's her father. There's the Pokemon called the Unown, who are causing chaos all across this little town in the mean time. This movie's plot sounds so corny and stupid, but it's really not. This was a great film, and anybody who's fans of the first two feature length films or Pokemon in general absolutely needs to see the third and fourth installments.",
         "This is definitely the best of the pokemon films. Unlike the previous movie which depended mostly on juvenile action, this one gives us strong imagery, emotion, and a better use of Pokemon to advance the plot. Even though like Pokemon 2000, this movie feels a bit short, I think the story works well enough. Even though the dialog is juvenile as one might expect, somehow it feels less hokey than Pokemon 2000. Just as it was in the previous two films, Team Rocket acts as a comic relief, by constantly making reference to the fact that they are in a movie. In a way, they have become good guys, but I think the filmmakers are a little confused about what to do with them. The rest of the movie works fine. No movie will ever be as good as the show but, the Pokemon spirit does manage to come alive here for an entertaining hour and a half.",
         "Being a fan of the pokemon TV show, I really wanted to see this movie, and it was worth it. It told the wonderful story of a girl named Molly, and how her mom was taken by the Unown(by the way, in the original version, her mother was institutionalized instead of taken by the Unown) Molly's father loved her dearly, and he (too,) was taken by the Unown, and when the Unown saw Molly miserable, they made all her dreams a reality. The whole landscape was turned into ice and her home was a castle. The Unown created the legendary Entei, who took the place of Molly's father. Ash, Team Rocket and everyone else tries to convince Molly her world isn't \"real\" and she needs to get back into the \"real\" world. I really adored how innocent Molly was and how her parents loved her. She is my favorite pokemon movie character. Entei was well done, and I liked his purple fire balls and the battle he had with Charizard. Great to see Charizard back, by the way! (It returned again when Ash was getting the Rising Badge from Clair in Master Quest, but that's another story) The computer animation with the Unown was nice as well. The crystal tower was good, and it was kind of reminds me of Emerald City from \"The Wizard Of Oz\". We also see Molly become older, and the first anime/movie appearences of Kingdra, Teddihursa and Flaafy. (Watch the credits, and you'll see she got a real Teddihursa) \"Pikachu and Pichu\" was another good short, with LOTS of interesting pokemon and all-around cuteness. \"Pokemon The Movie\" was pretty bad with the 2nd and 4th movies better, and this WAY better. Go see it! You won't be sorry! A 9/10.",
         "I'll admit it. I'm 21 years old and I enjoy Pokemon. With that aside, let me say that Pokemon 3: The Movie is actually one of the better films I've seen this year. As usual the short, this time entitled \"Pikachu and Pichu\", is a throwaway. Pikachu goes exploring the \"big city\" and meets up with the Pichu brothers (cute little Pokemon who resemble Pikachu). Together they have a series of misadventures, mostly running from a large dog Pokemon named Hounddower. This short serves only to introduce new Pokemon for the kids to get excited over. What makes it worse is that the \"short's\" running time clocks in at a lengthy 22 minutes. However, if you can survive that, you are in for a treat. The feature, entitled The Spell Of The Unown, begins with a young girl named Molly and her father reading a bedtime story. We can see that the girl loves her father very much. We soon learn that the father is a famous Pokemon researcher who is investigating the ancient Pokemon call \"Unown\". While escavating a temple, where the remains of the Unown were found, he mysteriously vanishes. When Molly learns about her fathers disappearance, she sinks into a deep depression feeling that she is truely alone (her Mother had also disappeared several years earlier). Molly happens upon the remains of the Unown (which resemble letters of the alphabet) in her father's study. She spells out the names \"Mama\" and \"Papa\" with the Unown and begins to cry. The Unown come to life and give Molly the power to create her own dreamworld where she can have anything she wants. She brings to life an ancient Pokemon called \"Entei\" to be her surrogate father and promptly begins to turn her house and the rest of the countryside into a magnificent crystal palace. Enter Ash, Misty, Brock, Team Rocket, all those cute little Pokemon, and some old friends and you have the beginnings to a great movie. This movie has a lot going for it. The animation is well done, the colors are exceptionally vibrant, and even the American added CGI effects look much better in this as compared to the first two movies. The story line in Pokemon 3, which borrows liberally from Star Trek, Alice in Wonderland and The Neverending Story, has a much more dark tone than the first two and feels more like an actual movie rather than an extended episode of the TV series. It deals with such adult oriented issues as loss, loneliness, and depression. However, it is still perfectly suited for kids as there is no language and very minor cartoon violence. All in all Pokemon 3 is a great movie to take your kids to, or just to take yourself to if your in the mood for a great action/fantasy anime movie. I give it an 8/10.",
         "Spell of the Unown excited me just as much as Mewtwo Strikes Back. It has everything. New powerful Pokemon in the form of Entei & Unown (Plus all the rest.), Team Rocket, Pikachu, Tears, Laughter, Dreams, Battles, Awesome Animation, Totodile, Charizard. You name it. It contained everything that makes Pokemon great. Weirdly Wonderful. All Pokemon fans will love it, young & old. (I'm 23.) 10/10",
         "In my opinion, Spell of the Unown (2000) is one of the best earlier Pokémon films. It is my favorite as a child and still is today because of its hidden power; it has the ability to captivate with its rich Pokémon mythology and to move our hearts with loving messages. Compared to the first two films, this film can standalone without the aid of other short films or sequels to enhance the story. The film does feel short though, so additional scenes and increment of total running time would be nice because the story moves a little too fast in the beginning, which may be confusing to those who are new to the Pokémon Universe. Thankfully, the whole movie turns out an interesting fantasy dream. The visually pleasing animation and beautiful imagination would appeal the majority especially dreamers. There are also more action than before, more variety of Pokémon and it is fun to watch. Ending this post, I must mention that I certainly loved the animated short Pikachu & Pichu that comes with Spell of the Unown (2000). Featuring the Pichu Brothers and plenty of other second generation Pokémon, it is super endearing and light-hearted! Their lively adventure makes the whole animated feature perfect!",
         "\"Pokemon The Movie 3: Spell Of the Unown\" Is a wild action packed adventure that finds Ash Kecthum, out to rescue his mother from a pokemon named 'Entei\". This could've been a great action movie, if the idiots at Warner Bros hadn't choped it to a mesely 91 minutes. However the much darker feel, and fasted paced dramatic story reamin intact. I recomend this one! 8/10",
         "Wow. I don't even really remember that much about this movie, except that it stunk. The plot's basically; a girl's parents neglect her, so this sicko PokeMon pretends to be her dad. Am I the only one disturbed by that? Then, this weirdo PokeMon kidnaps Ash's mom to pretend to be the girl's. I don't care if he was trying to make the girl happy, that's just gross. There was no real plot. The girl was just a whiny brat who wanted things her own way. She played with Unowns, was the \"daughter\" of Entei and apparently could grow and shrink in age on a whim with the help of her \"dad\". That's pretty much all I can remember, but I think you can take it as a hint, and not see it. (Or if you do see it, don't expect much.) 1 out of 10. Seriously. If you want a PokeMon movie, rent \"PokeMon; the First Movie\".",
         "This third Pokemon movie is too abstract for younger kids to follow and too repetitious to entertain older kids. The message of the film-- about dealing with loss-- is subverted by the return of the young girl's father during the film's credits. Team Rocket provide some amusement, but they're not really part of the small plot, so they don't appear very often.",
         "Pokemon 3 is little more than three or four episodes of the TV series, strung together without the usual commercials. The story is typical of Pokemon (conflict, fighting, and a resolution where all are happy in the end), and there is nothing original or unusual in the animation. Some of the holes in the plot are filled in (over the closing credits!) without explanation, and everything is just a bit too sweet. Why see it on the big screen? The only reason is to be a part of your child's world. Both of my sons enjoy Pokemon, and by my showing an interest in what they like, we are closer. Seeing a film in a theatre is still different than seeing it on the tube, and my sons enjoy the full movie-going experience. I gave the movie a 4, mostly from my children's point of view.",
         "How did this get a low score this movie was so good, the only reason it gets minus a point because its pokemon. This movie was so amazing. There is nothing better than a talking giant dog making a girl a god. There seriously isn't anything better. Ash can get annoying because of his stupid little voice but thats it. Even pikachu and pichu short was good. This one had a great plot, unlike the first. I watched this movie like 10 times when i was a kid. I suggest watching this and the second movie then the anime first series. Nothing besides that. THE BEST POKEMON MOVIE, ONE OF THE BEST ANIME OVAS.",
         "I didn't mind this movie Pokemon 3: The movie. I did see the first ever pokemon the movie and i did find that boring. I never saw the 2nd one and i didn't i'll ever see it because pokemon isn't my cup of tea. Although i did watch the 3rd one and it did get me into it. I give this movie at least 5 out of 10.",
         "For me and my generation of people (well most of us), were raised on a steady diet of Muppets and Ninja Turtles. Looking now at the desperate kid scene, I feel glad in my youth I was able to indulge in caricatures who not only had some partial education, but also didn't say they're name every single frickin'n time they talked. Because, after seeing this third enstallment in the Pokemon saga (I was a little lenient for the first 2), I keep on getting the feeling that what Trey and Matt on South Park were showing in that episode of Chinpokomon wasn't satire, but is as proportionally correct to today as is the billboard on the beach in Jaws. That is the feeling I got watching this movie. I haven't watched Pokemon in a number of months (needed a break really), and I realized now why I stopped watching. The pokemon each say there names every time they talk, they do stupid little dances, and teach things that were already learned in the first 2 Pokemon movies (that tire sequence at the beginning is as original as the formula in See Spot Run). Not to mention if you are one of the few somewhat smart people watching the movie that don't know the names of the creatures, relax; the kids in the theater mention they're names every time they come on the screen. At the end I came to this conclusion: Unless you have zombified kids (the type that wander around the house repeating the 'gotta catch em all' slogan that gets repeated more than the word kill in David Berkowitz's mind) who love the show, I suggest staying home and using natural paioti to get halucinations instead of watching the repeated pokemon here. And for kids who might think they want to see this but haven't watched Pokemon in a while, stay away and see Spy Kids. F+ (for some so-so anime).",
         "It still lacks the cinematic style from the first, however it is a definite improvement from its predecessor. As always, this is slightly biased as I am a massive fan of the franchise. A young girl who's father mysteriously disappears is left alone and sad. Through her sorrow, the mysterious Unown feed off of this and grant her the ability to create a dream reality where she can find happiness, but at a cost of destroying the world. Instantaneously you are thinking \"well that just sounds like the fable 'The Snow Queen'\", to which you are right. Substitute a snow castle for a crystal palace, add in Pokémon and surreal dream manipulation and you are in for an imaginative adventure. The reason why I like this instalment the most is because it has a story that feels complete. It's creativity and rapid runtime (way too short in my opinion) makes for an emotional plot that revolves around the fear of loneliness. In order to keep this consistent with the franchise, we have energetic Pokémon battles embedded within the narrative, a corny pop song for the introductory credits (I just despise them...) and a child-friendly message about friends and family. Plenty of battles in this entry, the most in the trilogy, and all of them feel electrifying as the monsters fight to the sound of pounding electronic pop music. The final showdown between Charizard and Entei was well animated and chaotic. The sweetness and innocence that exhumes from Molly was a nice addition, and the dream worlds she creates looked creative. The animation of the Unown to make them look 3D was terrible, I hate it when animation includes 3D textures on a 2D background. The plot structure does start to become formulaic, and after this entry the future of the series continues the trend of utilising a legendary Pokémon as the pivotal plot point of a story. Overall, this third instalment rounds off the original trilogy in an creative and emotional way.",
         "Very emotional maybe almost to me because missing someone you know in your family in your life can be sad so I can understand it, but I know it can be stressful without someone. This type of story was like a family type like a combination of maybe Mother's Day type way or something, but this was pretty good to me. One of my personal favorites.",
         "The beginning of the film perfectly sets the tone, with a father and daughter playing pretend. The whole film plays on the psychology of the daughter after she loses her father to the unown. The glorious visual 3D effects on top of the painted backdrops make for a visual feast that I compare to frozen's \"let it go\" tower creation. Only with a sea shell aesthetic. The daughter experiences the vast amounts of things she can do based on belief and power. The moral of the story is the heart that beats throughout. Its the understanding of a broken family. The questions of how to handle it. Its beautiful moral ambiguity. The story is immersive as any grand adventure. This film has been IMMENSELY underrated and abused by critics.",
         "In this 3rd theatrical outing for the expansive Pokemon franchise a young girl named Molly is devastated at the loss of her dad when he is hurled into oblivion by strange Pokemon breed Unown, who then grant Molly's wishes by turning her mansion estate into a giant crystal castle, covering the once beautiful town of Greenfield in a crystalline growth in the process. The Unown materialize the form of Entei, a legendary Pokemon to replace her missing dad and prevent her from being completely orphaned. Ash, Misty, Brock, and Pikachu are travelling to Greenfield when they are caught up in the Unown chaos, as are Team Rocket who are never too far behind. Ash's mother is stolen away by the Unown as a replacement mother for Molly. It's now up to the gang to infiltrate the crystal castle and find out how to stop the Unown from causing further damage. Pokemon 3 had a lot going for it but sadly loses control in the final 25 minutes with repetitive action and a rather one-note climax which doesn't have as much pay-off as the rest of the film might had fooled you into thinking it had. However, as usual, the muted scenes over the end credits are wonderful and make it a worthwhile entry overall. While being better than the first movie it's not as good as the second.",
         "The third time was definitely the charm here. This was a great Pokémon film for several reasons, not the least of which is it being a darker and stranger adventure than usual. The plot involves a little girl named Molly who lost her parents and is granted wishes by the unknown. She now lives in her strange little world with Entei as her father. Entei captures Ash's mother to grant her wish to have a mother. The story is more serious than you would expect from Pokémon, and the film benefits from it. The sense of tragedy was there as you could really feel for Molly. Of course, it was also quite personal for Ash. The weird dream-world Ash and the gang go through is very strange and gives the film a surreal quality. The whole film takes place in virtually one setting, but they really manage to make it work. The Pokémon battles were top notch. The battle between Charizard and Entei, in particular, is one of the best and most nail-biting battles ever in the series. The ending where Molly finally comes to her senses (and is reunited with her real parents during the end credits) is very moving, and the music is as good as you could expect. This is about on par with \"Pokémon 2000.\" Both are great for different reasons. The dark tone of the movie might not appeal to younger fans of the series, but for older fans, it really is a stand-out. RATING: A-",
         "Returns some of the darkness of the first film. Here we find a bunch of legendary Pokemon making one young girl's dreams come true. Not as nice as it sounds when her imaginary world is a nightmare for the rest of the earth. Pokemon 3 does a lot of things right, such as limiting the number of Pokemon, allowing for more story. It also brings Ash back his Charizard for a while, which only makes sense, since he doesn't have any powerful Pokemon at this point in the continuity. Team Rocket are reduced to such a joke that even they question their appearance by breaking the 4th wall. More CGI, which doesn't quite mix with the simple anime style, adds something new but not essential.",
         "What an enjoyable film! I don't understand all the hate and backlash this has gotten. If you hate Pokémon, and your insist on down voting, go do it on 7 or 8, where everything is bright, cheery, linear, Hollywood garbage. This is beautiful. The story isn't complex, but it's much more layered then other animated films. The colors are beautiful, and the animation is very well done, with tastefully placed CG, but mostly wonderfully detailed classic animation. The story contains good lessons about faith and family. The battle scenes are long and epic. The style is so dark and artistic that it's simply a treat for the eyes. My only complaints come with some the dialog being a little cheesy, and that it's way to short. (The feature itself is only 70 min) With more time they could have gone more places and really developed the characters and story arcs more. But all in all, a wonderful film, defiantly among the best of the Pokemon series, and among my favorite anime films of all time. A must see for all young people, anime fans, Pokémon fans, and anyone with a general interest in animated film! 10/10 as far as Pokémon is concerned",
         "Ugh this film made my head reel. BADLY. But i will admit it, it wasn't bad from the last time I watched it. Fun new Pokémon. Ash is acting a little more like a teenager then the ten year old he really started out to be. Pikachu, which Im glad to say is still with us with his famous sayings. (even if we don't really understand them - but hey, if it ain't broke don't fix it!!) The only part that I didn't really like (which is a shame as its the main part) is the character Molly Hale. Who really I think came off a little too spoilt. Now I know its the main part that she bends the world to her will as her father died and she never knew her mother. But for me that never quite did it. She just ended up annoying me. Entri also REALLY annoyed me, (carm down dear irmalicious, your getting a little annoyed over a cartoon you probably haven't watched for the best of five years, anyway) couldn't the unknown created a better father figure? I mean kidnapping Ashs Mom Delia was probably not the smartest thing to do. After seeing Ash and his trusty crew save the Pokémon world, wouldn't be the smartest thing to do. It would be like kicking a rhino in the backside. Also Entri sounded liked a microphone! Not a bad movie for a Pokémon fan. If only they made Molly a tragic tearaway and Entri a hot six foot then yeah I might watch it a bit more.",
         "I liked the pikachu short. It gets you into the movie. The last few days have been spent watching pokemon 5,6 & 7. Family and friendship were mentioned throughout the movie. As she lost both her parents she tried to make up for it by creating her own which didn't work out well. The unown are quite powerful. Even in the mind of a child a lot of damage was done. Her father disappeared as soon as he came into contact with them, he might have had better control over them. The were a few battle scenes. The Charizard and Entei fight showed how strong Entei was, though not a real pokemon just her vision from a book. A movie about friends and having dreams to achieve."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Family",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "4 Kids Entertainment",
         "Kids' WB",
         "Nintendo"
      ],
      "summaries": [
         "Professor Shuri is a scientist looking for rare Pocket Monsters. He reads a storybook to his daughter Mi about the powerful Pokemon Entei. Shuri is currently searching for the heiroglyph Pokemon \"Unknown\". While searching through some ancient artifacts, Shuri awakens Unknown and is sucked into it. Mi next awakens Unknown while looking for her father. Unknown bonds with her and turns her mansion into a Crystal Tower. The crystallization begins to spread. Unknown lives to serve Mi and creates an Entei with the personality of her father to make her happy. When Mi next desires a mother, Entei kidnaps Satoshi's mother Hanako to give to Mi. Satoshi, Kasumi, Takeshi, and of course Pikachu set out to get her back.",
         "Molly Hale, a young girl living in the town of Greenfield, discovers her father, Professor Spencer Hale, has disappeared whilst investigating the mysterious Pokémon species, the Unown. Upon receiving his findings, Molly's tears summon the Unown, who transporter her father to another direction. They begin bringing her dreams and wishes to reality, summoning Entei, another mythical Pokémon, who takes on the role of Molly's protector and father figure. Her mansion transforms into a giant crystal palace and spreads across the town. Meanwhile, Ash Ketchum, Misty, and Brock arrive in town, joined by Professor Oak and Ash's mother Delia, who has a past with the Hale family. But, things take a personal turn when Entei kidnaps Delia to play the role of Molly's new mother, and Ash and friends must venture into the world of the Unown to save her and Molly.",
         "When Molly Hale's father goes missing, the strange Pokemon that he was studying come to Molly by the power of the strange little blocks. The Pokemon, the Unown, create Entei to act as Molly's father, and, because of her wish to have a mother too, Entei only goes and kidnaps Delia Ketchum, who just happens to be Ash's mom. So Ash, Misty and Brock go to the Hale mansion to stop these strange events once and for all...before time runs out for life as we know it.",
         "In the town of Greenfield, a young, lonely girl's dreams and wishes are brought into reality by a collective of reality-warping Pokémon."
      ],
      "budget": 16000000
   },
   "movielensId": 174533,
   "movielens": {
      "languages": [
         "English",
         "suomi",
         "日本語"
      ],
      "releaseDate": "2000-07-08",
      "dvdReleaseDate": null,
      "directors": [
         "Michael Haigney",
         "Kunihiko Yuyama"
      ],
      "runtime": 93,
      "movieId": 174533,
      "title": "Pokémon 3: The Movie - Spell of the Unown",
      "mpaa": "G",
      "actors": [
         "Veronica Taylor",
         "Rachael Lillis",
         "Eric Stuart"
      ],
      "imdbMovieId": "0235679",
      "originalTitle": "劇場版 ポケットモンスター 結晶塔の帝王 ENTEI",
      "genres": [
         "Adventure",
         "Fantasy",
         "Animation",
         "Action",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Molly Hale's sadness of her father's disappearance get to her, she unknowingly uses the Unown to create her own dream world along with Entei, who she believes to be her father. When Entei kidnaps Ash's mom, Ash along with Misty & Brock invade the mansion looking for his mom and trying to stop the mysteries of Molly's Dream World and Entei!",
      "tmdbMovieId": 10991,
      "avgRating": 2.27778,
      "releaseYear": "2000",
      "numRatings": 9,
      "posterPath": "/5ILjS6XB5deiHop8SXPsYxXWVPE.jpg"
   }
}