{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "dog",
            "id": 15162
         }
      ],
      "imdb_id": "tt0161220",
      "video": false,
      "title": "Air Bud 3: World Pup",
      "recommendations": [
         21518,
         21661,
         24794,
         20737,
         9973,
         276530,
         140109,
         39920,
         40344,
         36986,
         27933,
         156468,
         68486,
         124042,
         336893,
         40163,
         20378,
         14749,
         68927,
         261339
      ],
      "backdrop_path": "/qerYJxVp6Ht3qwl6uom643fw0tm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Josh Framm",
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e00861d",
               "name": "Kevin Zegers",
               "profile_path": "/8IZWHzUElVhAyRqzWiCXzf7MHL4.jpg",
               "id": 7431,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Jackie Framm",
               "gender": 1,
               "credit_id": "52fe43f7c3a368484e008621",
               "name": "Chilton Crane",
               "profile_path": "/lw0XvdkqR8VxVUrHP4HcNBKSNZr.jpg",
               "id": 86530,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Andrea",
               "gender": 1,
               "credit_id": "52fe43f7c3a368484e008625",
               "name": "Caitlin Wachs",
               "profile_path": "/r8bYp4ZmCJQudpg5CouJeeX3nUk.jpg",
               "id": 85156,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Coach Montoya",
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e008629",
               "name": "Miguel Sandoval",
               "profile_path": "/x0mn76606kpJtzzl0B2nfJlZXkE.jpg",
               "id": 30488,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "5331470a9251410b4b0010b7",
               "name": "David Glyn-Jones",
               "profile_path": null,
               "id": 1239289,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Coach Sterns",
               "gender": 2,
               "credit_id": "550322c39251413d9f004bd0",
               "name": "Fred Keating",
               "profile_path": "/91GKcd5vOAZQkaexe8BtzmPR3Xv.jpg",
               "id": 963962,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e008607",
               "name": "Bill Bannerman",
               "profile_path": null,
               "id": 84220,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f7c3a368484e00860d",
               "name": "Mick Whiting",
               "profile_path": null,
               "id": 86529,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f7c3a368484e008613",
               "name": "Robert Vince",
               "profile_path": null,
               "id": 61244,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.874347,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 20755,
      "vote_count": 45,
      "budget": 0,
      "overview": "In this second heartwarming and hilarious sequel to the popular favorite, Air Bud masters two new starring roles: soccer (real football) player and fatherhood. Loaded with laughs and cool soccer action, Buddy teams up alongside U.S. women's soccer greats.",
      "similar": [
         9655,
         9291,
         22881,
         8923,
         2300,
         10637,
         323677,
         86130,
         10474,
         11287,
         9598,
         9563,
         11528,
         2323,
         13416,
         11544,
         16859,
         37136,
         5925,
         1374
      ],
      "original_title": "Air Bud 3: World Pup",
      "runtime": 83,
      "poster_path": "/vELV96fYh44AhwtYkcPGJxhrqet.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-12-12",
      "vote_average": 4.5,
      "belongs_to_collection": {
         "backdrop_path": "/3iROV2GdrAFz6lbrGneQLt8lc7K.jpg",
         "name": "Air Bud Collection",
         "id": 97445,
         "poster_path": "/6uJ2GXA5kBskJx6emTuHyp2S3ww.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill Bannerman"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Kevin DiCicco",
         "Mick Whiting"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0161220/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODM3NzQ4MzA2Nl5BMl5BanBnXkFtZTgwMTI4OTY4ODE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Kevin Zegers",
         "Dale Midkiff",
         "David Glyn-Jones"
      ],
      "reviews": [
         "With a new term comes another football season to get through but this year a new player from England (Emma Putter) offers some hope to the team of no-hopers who's previous best player was a dog. Josh however immediately falls for his new teammate \u0096 just as his dog has fallen for her dog. As Josh frantically tries to control his hormones and still play for the team, a pair of thieves are eyeing up Air Bud as a good money spinner if they can kidnap him away from the Framm's. However things are even more complicated by the news that Air Bud is much, much better than Josh at convincing females to have sex with him and thus puppies are on the way. Having watched one Air Bud I yet again showed the world how stubborn and stupid I am by returning to watch part 3. Obviously I was worried about how I would cope picking up the narrative having missed out on seeing Golden Retriever. Essentially the plot is a lazy mess of Home Alone criminals, dogs hitting balls with their noses and teenagers fumbling awkwardly towards their first awkward fumble. Needless to say it is a fairly uninteresting and uninspiring film that will keep your young children entertained but, when you think about it, so would a rattle snake but would you put your young 'uns in front of that? The film is boring and it pretty much falls flat at every step. The plot is rubbish; the teenage romance is bland as you like and the attempts at humour would have failed too but luckily the film decided not to even try to be funny. The sports action is same old same old and is not enough to cover all the cracks. The cast range from the serviceable to the hilariously bad. Zegers is bland but suits this type of film as a clean-cut youth. However he performs like Orson Welles in his prime when compared to his co-lead Bouck who leads a family of bad accents with a terrible version of English that would have given Mr Fogg a run for his money in terms of how fast she takes it round the world \u0096 is it LA? English? Irish? Australian? She is cute but she wanders all over the place and the nearest she gets to English is a sort of forced posh cockney that would make Dick Van Dyke laugh. The rest of the cast are not as awful as her but nobody marks themselves out even though this is the sort of film where some adult normally gives knowing winks all the way through to at least appeal to the adult audience. Generally rubbish then but I suppose the very young children it is aimed at will like it \u0096 but are you really so hard up for kids entertainment that you need to put them in front of this? Laughably basic at times and boringly bland at others, this is one to just ignore.",
         "At least if you're a Disney fanatic (well, of the variety who loves their live-action films as well as the animated stuff), if you're a kid, if you're a kid at heart almost to the extent that you hardly realize you're an adult, if you love absolutely any film that features animals, especially when they're doing tricks, or if you're just not too demanding, Air Bud: World Pup is somewhat enjoyable to watch. I'm a Disney fanatic. I enjoyed this film enough, and I'll gladly watch it again. But boy does it have a lot of problems. The main flaw arises from a combination of too many characters, too many plot threads and not enough time to take care of them all. In the space of 82 minutes, we've got adults getting married, teens falling in love and trying not to be awkward at it, teen competition for love and jealousy, preteens playing spy games, dogs falling in love, dogs playing soccer, dogs having puppies, manipulative parents who'll do anything to make their kids win being taught a lesson by their kids, housekeeper dilemmas, and crooks cooking up and executing elaborate plots. I'm probably forgetting something, but that's 10 big plot issues to be dealt with, with less than 10 minutes per thread to deal with them, and presumably weave them into a coherent whole that's both not too complicated--this is a kids' film, after all--and that's also humorous and heartwarming. Not surprisingly, director Bill Bannerman, on his first turn being completely in charge (he has a lot of previous second unit experience), wasn't quite up to the task. I'm sure it didn't help that there were at least three screenwriters involved, and probably dictating producers, as well. The end result is that Air Bud: World Pup is extremely choppy. Events occur with little justification, and worse, often little explanation. People figure out and do things primarily because they need to--and fast--so that everything can arrive where it needs to arrive in less than 90 minutes. From one cut to the next, time might jump ahead six months or so. We have both adults who seem like maybe they're mentally disabled and kids who just intuitively figure out what a dog is thinking and rush into some unexpected action. Some of the threads should have simply been removed, because it's difficult to become too engaged in the film when as soon as you're introduced to an idea, it's already passed you by. Also not helping is the fact that one of the threads is basically a rip-off of One Hundred and One Dalmatians (1961), minus a Cruella De Vil character. And another problem is that given the way the film is edited, I have to assume that the dog, Air Bud, probably couldn't do much with the soccer ball. Unlike the first two films, a dog playing a sport is almost an afterthought here, and when we see him, it's in very quick glimpses; every once in a while, these snippets appear to be even aided by computer animation. Yet, for someone like me, there's a cheesy charm to Air Bud: World Pup. The script and performances often teeter between ridiculous, hokey and kinda clichéd. I tend to like that combination. It makes the film both a bit predictable and subtly bizarre. And at times, like the ending, when the film completely abandons consistency and basically becomes a commercial for the U.S. Women's Soccer Team, Air Bud: World Pup is so blatantly tacky that you can't help but love it.",
         "I love this movie. It is an excellent kid movie. And i hope that everyone will at least watch it. I was bored and so i looked through the movies and found Air Bud barely used on our Shelf. So i was like what the heck.Expecting it to be a bad movie.But it was excellent. I also agree that \"Tammy\" is and looks like a dork. and they need to find a different model. Well i hope you will at least try the movie.And remember even if you are not a kid. You can still watch it. Cause i am 11 and i still watched it. And liked it. Well i don't know what else to write. Cause i do not want to tell you what happens. But in order to have this posted it has to be at least ten lines. And i don't know what else to write. Hang on i am going to see if it is done know.It is.",
         "This was the first \"Air Bud\" movie to be released direct to video I believe, not that the series was ever that great to begin with. Here we have Buddy learning to play soccer and that's mostly it. I was thinking that at least this movie didn't have the dog farts of \"Space Buddies\". Instead, it just has a man farting. This is seriously one of the most out of place scenes in a movie I've witnessed in a long time. There's this part where a rich guy is just farting for no reason. We need to stop with the farts in these movies. The main kid character dates this one girl and we get the same lessons about being yourself and everything. There's a dog catcher or someone who tries to kidnap the puppies but is so bland I don't care. The team with Buddy manages to rise to the ranks way too quickly and it would have been interesting to see more of that. This is just a boring direct to video Disney movie and it's probably even worse than the notorious animated Disney direct to video sequels. At least they had something good to begin with. *1/2",
         "I feel like the only reason this movie exists is to have Air Bud learn soccer and to introduce Air Bud's pups. (not the buddies) This movie really didn't need to exist. It's not terrible, it's just kind of okay. Air Bud is still endearing and the soccer games are fun to watch but Josh (the boy from the last movies) and his relationship issues are boring to watch. They're pointless and could be written out entirely. Heck, they don't even show his girlfriend in Air Bud: Seventh Inning Fetch, so what was the point of that? Did they really need that pointless filler in an 83 minute movie? Okay maybe they did but it could've been filled with anything else.",
         "Of all the movies in the \"Air Bud\" franchise, this is certainly one of them. It has a huge advantage over the other's right up front—Soccer is a sport a dog could legitimately play. It's low to the ground, the ball fits between a dog's legs, it's high speed, and you can use your face. Arguably it's a little physical for them but seriously who is going to slide tackle a dog? I was very concerned he wasn't wearing shin-guards though, and maybe a mask. There could have been a serious injury to our beloved Buddy. But we should get to the movie itself. The baddies here are dog catchers I think. They drive a dog catcher van and seem to be at the beginning. But then their motivation is unclear later. They make it their mission to catch \"Baby\" the lady dog of the film. Why? Initially because she loses her collar, and then\u0085 I don't know. I can't figure out when they switch from doing their jobs to being baddies but they are suddenly jamming puppies into a hamper to sell. It's very confusing. Not as confusing as a Swiss Army knife with a dog whistle in it. But that exists in this movie. No, it seriously does. It's vital to the plot. I searched the internet but couldn't find one, if someone does I would love to have it. Why didn't he just give him a standard whistle around his neck like every other dog movie? He never uses the knife function. Cruella Deville would have been a more effective villain. To the rest of the movie\u0085 so Buddy meets a girl dog! Baby is a darker lady (Buddy got that jungle fever) in a rich family (Buddy is a gold diggah). He dates her behind his family's back, because as cool as Josh has been about Buddy being the only one competent in sports, he knows they'd never approve of their relationship. Though at least they'll be pure-breds am I right? I can't imagine the shock if Buddy met a black lab. So, the current oldest child has to play a sport already. Josh is still around so we'll have him do it. First, Andrea has started playing on the soccer team. And that team has zero dogs the entire movie because she isn't the oldest. YOU WAIT YOUR TURN ANDREA! She's coached by \"megahottie\" (according to Josh) Elizabeth Tudor. Elizabeth is a rich British girl with a terrible fake accent. The actress was born in Florida, I have trouble believing she's even been to England. It's just\u0085 terrible. I can't even tell why she's British. Because she's rich and likes soccer? Anyway, Josh is immediately smitten (or terrifyingly obsessed depending on your point of view). He watches her. Non-stop. Every practice. Well, the camera acts like it's her. Maybe it was actually one of the little girls. Then they form a soccer team. They're not good. Josh joins so that he can watch Elizabeth some more. Later, Josh finally goes to a party at her house (discovering she was rich) and takes advice from a kid who might literally have a mental delay. He spends every game standing in front of the opposing goal (no off-sides call?) hoping the ball bounces of him in a beneficial way. Luckily, it seems to do so a surprising amount. It's a terrifying look into the world before you could search the internet for \"how to talk to girls\". Anyway, Buddy decides to play soccer. I skipped a bunch but I'm on a word count limit here, and it's a Buddy movie you can fill in the details. He's great. As well he should be for the reasons discussed supra. They win games. BUT WAIT! There's something in the rulebook that says that dogs can't play soccer! Or, they add it to the rulebook. Or something. The point is when one player can't play they disqualify the entire team. After letting them drive all the way to an away game. \"This dog has played for two other Fernfield High teams!\" This is short lived as the evil commissioner has a change of heart after his kid calls him a wimp. Dogs can play soccer again! This entire exchange has all the tension of finding a jersey for Buddy. We all know he's going to play, it's in the title. You never think \"will he or won't he\" you think \"how much of the movie are we going to spend with this?\". Also, Buddy has puppies in this time. No one questions the fact that he's been sleeping with this dog secretly while they aren't married. No one questions either family for not spaying or neutering their pets. Baby is just suddenly \"not feeling well\" and then crapping 8-week-old puppies all over the place. They come out 8-weeks-old and grow to be a year old within the next two weeks of soccer tension. The cover indicates that they might play soccer, but they never do. They just get their own jerseys and play amongst themselves. Why not? Josh's team has zero subs and we've established dogs can play. Might as well flesh out the rest of the team. I can't imagine how they're running so much otherwise. Thing happen with the puppies, the Brit, Buddy, and Josh are late. How did they even play without them? They don't have any subs. Anyway\u0085 They win the championship! Shocker. Buddy is always such a hero. So now he can be called upon by adults. It's World Cup time luckily (if he had to wait three years for the next World Cup he'd die). It's a shootout which leads you to think we're going to have Buddy take that final shot. But he plays goalie! Which\u0085 WHY?!?! He never played goalie before! I died a little inside right then.",
         "You guessed it...it's soccer this time. Little Sister Andrea has grown up and her new English female coach intrigues young Josh so he and his buddy Tom join up with the soccer team, only to learn quick that Buddy is a great player. Would you be shocked to find that there is someone trying to dog-nap Buddy..wow! yes, a dog catcher is trying to steal him, for some strange reason. Buddy has met soccer girl Emma's dog Molly (the dogs real name is Emma - hmmm weird)and he knocks that bi-atch up (hey thats not a curse word she is a female dog). Anyway 6 puppies come along and the dog nappers are in Heaven. The kids go on a mission to save the doggies and just like parts 1 and 2 Buddy comes last minute to save the team and take them to the championship...awe how sweet. This was horrible, Kevin Zegers is the only reason to watch it. All of the rest of the cast has been replaced anyway except the referee's and his sidekick Tom played in all 3 films by Shayn Solberg. Shane returns later too, but this is Kevin's farewell to fur film. They even have a different house here, which might be because Patrick is in the picture (but in later films you will see the old house is back and a whole different story told as if this film didn't even happen). I hate how cheesy this film is. It's so much like those crappy Disney TV shows with kids that can't act and bad music and cheesy songs that even Miley Cyrus would gag at. The direction was so basic and dull and the dog can't play soccer and the editor must have had to work like crazy to make it look like he could be a goalie. The whole game scenes are ridiculous, the people playing doesn't even try, it's so cheesy. At least in the first two films they tried to make the games believable. All three are basically the same movie with minor differences. This movie was silly, it ripped off 101 Dalmatians AGAIN. The whole dog catcher side story was stupid. At one point the dog catcher is setting outside the mansion wanting a dog and Josh blows a dog whistle and dozens of dogs come to the mansion and the catcher doesn't even notice them. Another stupid thing was when everyone was looking for the missing dogs and the kids were missing their game to look, the parents go on to the game...umm yea, you just know the dog's gonna come and join the team the last few minutes and win don't you? Oh wait thats right you have seen this happen before at the basketball as well as the football game..my bad! Kevin Zegers is the only reason to add this film to your collection, he is an amazing actor, most of the cast are once again a bunch of nobodies, Miguel Sandoval did do a great job as the coach.. worst of the three, just for kids, nothing new....2/10 stars",
         "I saw this one afternoon on one of the movie channels. I was dubious at first after reading the synopsis on my remote control, but I kept watching and was pleasantly surprised. OK it didn't have an a-list cast but the acting was bearable. OK it was about a dog playing football and saving the winning penalty. But it is a kids film, meant for children to entertain and amuse, and it entertained me and had its few giggling moments. I have seen a couple of the 'Air Bud' movies and this is by far the best one. Its easy viewing and kills a few hours. Something to stick the kids in front of, just make sure during the credits you don't hear 'I want a dog!'",
         "I suppose that to say this is an all-out terrible movie would be unfair, but it's pretty bad. The sub-Disney storyline involves dogs playing soccer and falling in love (aw, how cute!) The acting isn't bad, but definitely could be better, especially that of young Canadian actor Kevin Zegers, who, during the whole movie, looks embarrassed, like he doesn't even want to be there. Anyway, kids will love it, but parents beware!",
         "Dogs rule! The air bud movies totally show that, and i love the fact that they used soccer! I would have liked to see Mia Hamm, but the other superstars are great too. A few of the actors are cheesy, but the animal training is great! But lets just hope that next time they include a yellow lab... haha! lol Also, \"Tammy\" (the sister's friend) is a dork and they should have used someone else. Josh is kind of cute, (lol) but he keeps acting stranger and stranger. It's like he's out grown them. This is one of the best air bud movies, but it has a few flaws. However, i recommend it",
         "I really enjoyed this movie. I have seen most of the other air buds and am wondering what sports they will come up with next. Tennis, Gymnastics? well i am a soccer player and really did like it, especially as a kid. In the movie it also makes a point that no matter what you are you can do anything. Out of all of the Air Buds, this is by far my favorite. I suggest it for family's. Also another good Air Bud movie I liked was Air Buddies. Some people may not like that one because the dogs talk but that was my other favorite. It is more for kids than adults but some may still enjoy it. i don't know what to write so i am just typing stuff sorry. I hope you enjoy this movie and find this helpful.",
         "A great feel-good movie for the family, but make sure you have cotton wool ready for your ears because the kids will start squealing at the adorable puppies. This film pretty much has the same concepts and basic plot line as the first two. Buddy and his owner Josh start playing soccer, and Buddy falls for a new golden retriever in town (and Josh for her owner). Buddy becomes a father and a couple of horrible men try to steal the puppies to sell them. Not exactly brilliant cinema, but it is almost guaranteed to put a smile on dog lovers' faces, and kids and younger teens will love it (the latter not least because the boy who plays Josh is really cute).",
         "This is Air Bud's third sports movie. this time Josh is playing soccer, and to help him improve, yep, Air Bud will help him every step of the way. though he finds himself stuck in sports and his love, a female golden retriever. with his newborn pups, Shooter,Zak,Duke,and Striker. the sports generation has never looked so good!",
         "This movie is good, but disappointingly is nowhere near as good as the first airbud. The storyline is predictable and cheesey and you don't even see much of Josh Framm's legs! The hot teenage Kevin Zegers is the best thing in this movie. Michael (aged 17)"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Dimension Films",
         "Keystone Family Pictures",
         "Air Bud Productions"
      ],
      "summaries": ["A boy and his dog take on the world of soccer."],
      "budget": 0
   },
   "movielensId": 174539,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-12-12",
      "dvdReleaseDate": null,
      "directors": ["Bill Bannerman"],
      "runtime": 83,
      "movieId": 174539,
      "title": "Air Bud 3: World Pup",
      "mpaa": "G",
      "actors": [
         "Kevin Zegers",
         "Chilton Crane",
         "Caitlin Wachs",
         "Miguel Sandoval",
         "David Glyn-Jones",
         "Fred Keating"
      ],
      "imdbMovieId": "0161220",
      "originalTitle": "Air Bud 3: World Pup",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["UY9XLHw4BkQ"],
      "plotSummary": "In this second heartwarming and hilarious sequel to the popular favorite, Air Bud masters two new starring roles: soccer (real football) player and fatherhood. Loaded with laughs and cool soccer action, Buddy teams up alongside U.S. women's soccer greats.",
      "tmdbMovieId": 20755,
      "avgRating": 2.25,
      "releaseYear": "2000",
      "numRatings": 6,
      "posterPath": "/vELV96fYh44AhwtYkcPGJxhrqet.jpg"
   }
}