{
   "tmdb": {
      "original_language": "ru",
      "keywords": [{
         "name": "bug",
         "id": 15037
      }],
      "imdb_id": "tt0113138",
      "video": false,
      "title": "Gagarin",
      "recommendations": [
         4962,
         104522,
         207247,
         83234,
         69916,
         217698,
         185354,
         157474,
         246166,
         176408,
         210861,
         136052,
         85924,
         216658,
         163890,
         339675,
         46994,
         166092,
         216729,
         69910
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4dd5c3a368484e200505",
            "name": "Alexij Kharitidi",
            "profile_path": null,
            "id": 1198799,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 1.705118,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 214157,
      "vote_count": 8,
      "budget": 0,
      "overview": "A young caterpillar yearns to fly like the butterflies and birds, but cannot launch himself high enough to do so ... until a couple start playing badminton nearby.",
      "similar": [
         21385,
         66819,
         31135,
         66872,
         10527,
         81003,
         460793,
         67111,
         568,
         597,
         37724,
         19,
         54138,
         52520,
         158852,
         140607,
         157336,
         56292,
         155,
         68726
      ],
      "original_title": "Гагарин",
      "runtime": 3,
      "poster_path": "/3B0sZsDWUmW6tT6ZcGvydHyXJtA.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1994-01-01",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Aleksey Kharitidi"],
      "runtime": 3,
      "synopsis": null,
      "writers": ["Aleksey Kharitidi"],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0113138/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "Given the nature of its premise and the country of origin being Russia, it's a fairly logical guess that the title is a reference to Yuri Gagarin, the Russian cosmonaut who became the first man to climb into a glorified tin can and be shot into orbit around the Earth. This is a very cute, often funny and sometimes poignant cartoon about getting what you wish for. That it doesn't always turn out as you wish it to is the ironic twist here. This can be found on one of the Spike and Mike Festival of Animation compilations and is well worth looking for. Highly recommended.",
         "The cartoon is done with sparkling humour and at the same time with love. The caterpillar looks very touching and naive, but when it finally gets out of the shuttle-cock where it got to learn to fly one can't help laughing at the poor dizzy thing. The more cartoons like this one the better.",
         "This is a rather short and very simple Russian cartoon. It was nominated for the Best Animated Short Film Oscar in 1996, though it did not win--that award went to WALLACE AND GROMIT IN A CLOSE SHAVE. While there is nothing earth-shaking about the animation of GAGARIN (being done with rather simple but effective artwork), it is effective and sweet--and viewers can't help but like the cute little main character. The film is all about a scared little caterpillar. Unfortunately, he'd like to fly but is hesitant. So naturally, he is accidentally battered about when he climbs into a badminton shuttlecock--going on a very dizzying ride.",
         "\"Gagarin\" is an Oscarnominated Russian short film from 1994 and at 3.5 minutes it is really short. The director and writer here is Alexij Kharitidi and he was in his mid 30s when he shot this film over 20 years ago. Sadly, he did not manage to build a great filmmaking career on his work here and I must say I am surprised because for a 200-second film this was a pretty decent achievement. A caterpillar crawls into a badminton ball and gets dizzy fairly quickly being glad the second he got out of it. But he does not know yet what life has in store for him. It was nothing really outstanding, but we had a cute little story here, a likable main character and I also somewhat like the retro animation style. I would even say that I enjoyed this one here more than the Wallace & Gromit film that beat this one here in terms of the Oscars. Go see it, there's millions of worse ways to spend 3.5 minutes."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy"
      ],
      "productionCompanies": ["Second Frog Ltd."],
      "summaries": ["A young caterpillar yearns to fly like the butterflies and birds, but cannot launch himself high enough to do so - until a couple start playing badminton nearby."],
      "budget": 0
   },
   "movielensId": 174617,
   "movielens": {
      "languages": [""],
      "releaseDate": "1994-01-01",
      "dvdReleaseDate": null,
      "directors": ["Alexij Kharitidi"],
      "runtime": 3,
      "movieId": 174617,
      "title": "Gagarin",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0113138",
      "originalTitle": "Гагарин",
      "genres": ["Animation"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young caterpillar yearns to fly like the butterflies and birds, but cannot launch himself high enough to do so ... until a couple start playing badminton nearby.",
      "tmdbMovieId": 214157,
      "avgRating": 2.85,
      "releaseYear": "1994",
      "numRatings": 10,
      "posterPath": "/3B0sZsDWUmW6tT6ZcGvydHyXJtA.jpg"
   }
}