{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0348816",
      "video": false,
      "title": "7 Days in September",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4d67c3a36847f825ee29",
            "name": "Steven Rosenbaum",
            "profile_path": "/mcKlXv6pqRO2RRJgZr0NkY8IB4U.jpg",
            "id": 1193473,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.037655,
      "production_countries": [],
      "id": 175910,
      "vote_count": 1,
      "budget": 0,
      "overview": "A documentary about behind the scenes and what was going on in the streets of NY during and 7days after 9/11.",
      "similar": [],
      "original_title": "7 Days in September",
      "runtime": 94,
      "poster_path": "/3uauCS7Ows759M0NEyDeOPKeIfX.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2002-09-06",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "Documentary",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Rosenbaum"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Bruce Kennedy"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0348816/",
      "coverLink": null,
      "actors": [
         "Jim Goetz",
         "Dave Goldberg",
         "Bruce Kennedy"
      ],
      "reviews": [
         "The emotions that it releases are almost overwhelming and subjectivity is lost in the storm. The images even now strain credulity and one's mind rebels at the insanity of the events. Director Steven Rosenbaum does an excellent job of editing the footage from 27 filmmakers who recorded that infamous and tragic day and its aftermath.",
         "7 Days in September is documentary from director Steven Rosenbaum.It presents the experiences of a diverse group of regular Americans in the wake of the terrorists attacks of September 11, 2001. It features footages from 27 filmmakers done in the area surrounding the World Trade Centers shot as early as 10:05 a.m. on the day of the tragedy.It shares the collective experiences of people on the way 9/11 changed their respective lives and how they view the world and New York. It was a very emotional documentary.People who are looking for something subjective as well as political will definitely be disappointed.Although the visuals aren't really that much,the documentary presents what emotions people were going through during and after the event. It recreates what those days felt with excruciating precision like the the wild panic, the moments of funereal calm, the spontaneous blossoming of solidarity and fellow feeling.And most of all,it represents the tremendous human spirit and generosity New Yorkers showed after their World Trade Center was destroyed.Overall,it is a very powerful documentary of that unforgettable and history event in the country.",
         "A great film. I never heard of this film until A&E showed it tonight. The different film makers add so much realism that you feel like you are there on September 11, 2001. Anyone who has been to Manhattan will feel like that they are back their again on their worst nightmare. Films like this are why ultimately the universe is a friendly place as Albert Einstein said more the 50 years ago. The terror factor that is being passed around currently in the political arena makes this film so much more topical then when it happened three years ago. The emotions from every viewpoint are astonishing. Everyone should look at this link to see what New Yorkers think about why it happened. I agree. http://www.truthout.org/docs_04/090204J.shtml",
         "This expression was used by John Reed in the XXth century to comment the Russian Revolution of 1917. What happened on the 9.11.2001 suits perfectly for the XXIth century. This documentary is made of private shootings, so if you look for big drama shoots, you may be deceived. In addition, the terrible day count for maybe one third of the time, the remaining addressing the later days. Finally, you don't see much but you hear a lot. What I kept in memory is this terrible \"dust wall\" after the falls: Like a wave, it is slowly coming, and as soon as it gets you, you step in an totally other world: no sun, no sky, only this gray matter! A bit like the novella \"The Mist\" from Stephen King! Sadly, it is no more fiction!"
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Camera Planet"],
      "summaries": ["This documentary from director Steven Rosenbaum presents the experiences of a diverse group of regular Americans in the wake of the terrorist attacks of September 11, 2001. Featuring footage from the area surrounding the World Trade Center shot as early as 10:05 a.m. on the day of the tragedy, SEVEN DAYS IN SEPTEMBER looks at the way 9/11 changed the lives of a firefighter's wife, a Muslim-American woman, an 11-year-old boy, and many others."],
      "budget": 0
   },
   "movielensId": 174903,
   "movielens": {
      "languages": [""],
      "releaseDate": "2002-09-06",
      "dvdReleaseDate": null,
      "directors": ["Steven Rosenbaum"],
      "runtime": 94,
      "movieId": 174903,
      "title": "7 Days in September",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0348816",
      "originalTitle": "7 Days in September",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A documentary about behind the scenes and what was going on in the streets of NY during and 7days after 9/11.",
      "tmdbMovieId": 175910,
      "avgRating": 3.5,
      "releaseYear": "2002",
      "numRatings": 1,
      "posterPath": "/3uauCS7Ows759M0NEyDeOPKeIfX.jpg"
   }
}