{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1198199",
      "video": false,
      "title": "Think Of Me",
      "recommendations": [],
      "backdrop_path": "/cl51e2ZS264XEY0ejfOK2rLsDlq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Angela",
               "gender": 1,
               "credit_id": "52fe4a1f9251416c750de7df",
               "name": "Lauren Ambrose",
               "profile_path": "/zEdW3X6MHTDVG4jizKfVebVTmCH.jpg",
               "id": 54470,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Sunny",
               "gender": 1,
               "credit_id": "52fe4a1f9251416c750de7e3",
               "name": "Audrey P. Scott",
               "profile_path": "/zNZZtnLazlRF362feXVKfv53EKl.jpg",
               "id": 1018982,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe4a1f9251416c750de7e7",
               "name": "Dylan Baker",
               "profile_path": "/6r8DkPjWQDVe3Ak1peMeOHhtXqL.jpg",
               "id": 19152,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Louise",
               "gender": 1,
               "credit_id": "52fe4a1f9251416c750de7eb",
               "name": "Penelope Ann Miller",
               "profile_path": "/6wjG6NUBKc6Ca4KX6G6V4t6sU2.jpg",
               "id": 14698,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Ted",
               "gender": 2,
               "credit_id": "52fe4a1f9251416c750de7ef",
               "name": "David Conrad",
               "profile_path": "/3w7ZEmlk42anhEZgKvuNZmFFJba.jpg",
               "id": 43479,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a1f9251416c750de7d5",
               "name": "Bryan Wizemann",
               "profile_path": null,
               "id": 1018980,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a1f9251416c750de7db",
               "name": "Bryan Wizemann",
               "profile_path": null,
               "id": 1018981,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5861ef19c3a3681a650353d2",
               "name": "Lauren Ambrose",
               "profile_path": "/zEdW3X6MHTDVG4jizKfVebVTmCH.jpg",
               "id": 54470,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5861eee8c3a3681a6f039871",
               "name": "Mark Schwartzbard",
               "profile_path": null,
               "id": 1183644,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5861ef2492514115c003a69f",
               "name": "Blythe Robertson",
               "profile_path": null,
               "id": 1728384,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5861ef2b9251414e3a014cec",
               "name": "Mike S. Ryan",
               "profile_path": null,
               "id": 1464835,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5861ef3392514115cf039b46",
               "name": "Peter C. Selig",
               "profile_path": null,
               "id": 1728385,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5861ef3a92514115c703b5ca",
               "name": "Brent Stiefel",
               "profile_path": null,
               "id": 1023141,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "5861ef439251414e3a014d05",
               "name": "Alicia Van Couvering",
               "profile_path": "/3tVRIRrhk1ACGWHxawksJmuwudJ.jpg",
               "id": 139137,
               "department": "Production",
               "job": "Co-Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.917447,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 98870,
      "vote_count": 2,
      "budget": 0,
      "overview": "As things unravel for a struggling single mother in Las Vegas, she must decide what she's willing to give up to get by.",
      "similar": [],
      "original_title": "Think Of Me",
      "runtime": 103,
      "poster_path": "/hX3eU0wLRnM2bEjbGg4Gt2mGGbe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Votiv Films",
            "id": 34455,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Two Tall Boots",
            "id": 84845,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Deep in the Heart Pictures",
            "id": 84846,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ballast Films",
            "id": 84847,
            "origin_country": ""
         }
      ],
      "release_date": "2011-10-15",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.thinkofmemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Bryan Wizemann",
         "Mike S. Ryan"
      ],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Bryan Wizemann"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1198199/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg4NTk3MTczMl5BMl5BanBnXkFtZTgwMDQ0MjA2MDE@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Lauren Ambrose",
         "Audrey P. Scott",
         "Chanel Flowers"
      ],
      "reviews": [
         "This is a beautiful film. Thoughtful, poignant, honest, raw and real. We need more films like this. I will admit, I only watched it because I am a fan of Lauren Ambrose because of her work in \"Six Feet Under\" but once I started it, the film itself completely took me by surprise. Ambrose is once again a wonderful actor with her subtle yet real performance. It is amazing she doesn't work more but then it's nice she isn't over-exposed. But that said, the script, direction, music and camera work reeled me into this world and I found myself truly mesmerized. As someone who does not enjoy the sequels and remakes saturating the film world today, watching something like this reminded me of why I love film. Bravo, to all involved. This is a work of art (which is probably why no one has heard of it.) Ah... someday, I hope, that will change. With films like this, perhaps it will be sooner than later.",
         "Watching this slow-moving, quietly painful film, I had two things at the back of my mine. One was my own mother's struggles as an educated but not very practical single mother decades ago and the other was a recent news item about a judge who took a Guatemalan immigrant's child away from her on the grounds that she had \"abandoned\" the child by... being arrested as an illegal immigrant. In other words, watching this woman struggle to take care of her daughter while making a series of bad decisions all along the way was also watching the real story of innumerable women, some like her, some not so much, who find it almost impossible to do the one thing they most want to do: take care of their children. It is painful to watch, not least because some of the women in this situation will make all manner of damaging decisions out of desperation and the film just shows some of the issues that can prompt that desperation: not getting child support, trying to work two jobs, unexpected expenses which are catastrophic on a tight income, etc. It is easy to get impatient with this character in a number of cases, but it is also clear that, in her own sloppy and ill-prepared way, she is trying; trying and often being thwarted. There is one central developing dilemma which gives the story something of a spine, but really overall we're left with the sense that, rather than being this woman's main story, it is one episode out of many in what will always be a life of uncertainty and limited choices. The film is shot in a gloomy, unadorned way with no background music or other overt cinematographic touches and so it is overall an unsparing experience. Echoing after it is the awareness that some women will triumph in similar situations, others will end up overwhelmed and making all manner of bad decisions - if a choice made when boxed into a corner can be called a decision.",
         "For the most part (and, honestly, with very few emotionally redeeming qualities) this is a dismally sombre and even sad film. It's not a bad film. It's just dreadfully sad. I have to admit that I haven't seen very much of Lauren Ambrose since the end of \"Six Feet Under.\" One thing I learned from \"About Sunny\" is that she's most definitely grown up. She put on a very powerful performance in this, as single mother Angela, struggling to make ends meet - and generally not succeeding very well - as she seeks to raise her daughter Sunny (played by a young actress named Audrey P. Scott.) This is a desperate situation. It's a classic example of being caught between a rock and a hard place. Angela has a job, but it doesn't pay well. Sunny has a learning disability (dyslexia?) but Angela has no resources to help her with it. She has to take a second job at night, meaning she leaves Sunny alone a lot. She's not getting child support from Sunny's father, she makes dreadful decisions as she becomes more and more desperate. The whole movie (which starts out on a pretty down note) just seems to be a downward spiral. The question is: downward from what? How much lower could it go? I don't need to go into a lot of details, except to say that - again - this is a sombre and very sad movie. For most of its run time it doesn't really seem to be going anywhere, other than documenting Angela's struggles, but in the end Angela is faced with a gut-wrenching ethical dilemma. Without saying what it is, I'd say that as a viewer you're torn at the end. I think she made the right choice, but what does the future hold for her and Sunny? How will it get any better? Or are these two just on a one way trip to nowhere. But - sadness aside - this is a good movie. Ambrose's performance is powerful and she draws you into Angela's life. You feel sorry for her. Perhaps none of this desperation is her fault, and you know that she wants to be a good mother to Sunny. Even when she lashes out, you know that it's out of frustration, and not because of any lack of love for her daughter. With an interesting lead character, and a good performance form Lauren Ambrose in the role, this is definitely worth watching. It's just not a movie you'd want to watch on a day when you need a pick-me-up! (7/10)",
         "This movie was realistic and not sugar coated. It's about a single mother's struggle to take care of her child, trying to earn a respectable living. There are scenes that make you wonder if she has always done that or is considering taking an easier, quick money route but she continues to work low paying mainstream jobs. She tries her best to be a good mother and take care of her daughter, despite her fears and frustrations. Some people may find it easy to judge this woman, when she starts to breakdown. Her character does some things that may seem unsympathetic but strongly comes through as a real person. She is on her own, with no one to help her and does love her child. The little girl's acting is the best I have ever seen for a child actor. She doesn't go over the top with coaching and doesn't even seem like she is acting.",
         "About Sunny (2011) A slice of life realistic story about a young mother and her daughter living on the edge of subsistence in Nevada. Lauren Ambrose (who was Claire in \"Six Feet Under\") is terrific, not overplaying a slightly hardened but still sympathetic character. The story is mostly about how things go a little bit wrong, not through stupidity (as in some movies like this where the leading female makes huge mistakes) but through some smaller misjudgments. The daughter is terrific, too, and so we see a tension and tolerance in her relationship to her mom, who clearly loves her but is always a bit short on patience. The one real twist, which is a bit forced into the plot, is a relative of a co-worker who has some designs on the girl. This, too, is played with some subtlety, though the idea is just unlikely and sudden enough to force you to go along with it. It's not inevitable. Even so this other plot is a small part of what really happens, with the growing feelings you have for the main two people. It's clearly a low budget indie film, and is produced by Ambrose, so you can see some smart attempts at moving her career forward. And she pulls it off with a heart wrenching, cinema-verite story that is maybe just a hair to close to the truth for many people to make it comfortable. How easy it is to watch more terrible tragedies (from \"Goodfellas\" to \"Pulp Fiction\") and how hard to see what might be true (here and in \"Julia\" which makes for a weird, imperfect parallel). Surprisingly solid.",
         "'Think of Me' is a portrait of a young single Mom, 'Angela', (convincingly played by well-known stage actor Lauren Ambrose), and her nine year old daughter, 'Sunny' (starring the talented child actor, Audrey Scott, seen before in Disney's 'Secretariat'). The script and direction is by Bryan Wizemann, who has a few short films under his belt and is now tackling his second feature film since 2005. Wizemann's basic strategy is to catalog the misdeeds of incompetent parent Angela, as she aimlessly attempts to stay afloat in present day Las Vegas with her daughter. Angela is sort of like a water downed version of Casey Anthony, a child-like narcissist who inflicts emotional rather than physical damage on her daughter, who suffers from learning disabilities. In addition to the slow-moving plot, much of the film's verisimilitude is dependent on whether one believes in the plausibility of the central character. Angela is so much in her own world, that she doesn't recognize that she has problems. Certainly when it comes to Sunny, she's in big time denial regarding the fact that her daughter is unable to read. Her defensiveness on that point is believable, but I still had a difficult time believing that such a character would not stoop to pursuing grander illegal pursuits or in contrast, seek help from others, to support herself. For example, at the beginning, Angela picks up a man at a strip joint and goes home and has sex with him. The scene is obviously designed to introduce us to the idea that Angela's actions are thoroughly narcissistic, since Sunny walks in on them afterward, exposing her to all the unseemliness. What's odd is that Angela is not a prostitute and merely asks the man for a $100 to help her out. This is the only time we see Angela having sex or having any dealings with men on a romantic or sexual level. It's odd that she never resorts to prostitution since she is so desperate for money. On the other hand, perhaps prostitution is one step below her moral code. You would think by trying to find a boyfriend, that would be a good strategy for Angela to lift herself out of her isolation. But that strategy never seems to occur to her. When her boss at the telemarketing firm asks Angela to come in with him on a dubious investment scheme, she doesn't hesitate to have her ex-husband wire her $2,000 from her child support funds, which she promptly loses after some neighbors come over for Sunny's birthday party, and one of them presumably makes off with the money. Again, is she so obtuse that she would so easily get involved in such a scheme? Most people wouldn't—even those down on their luck would be a little bit skeptical; but then again, there are gullible people falling for scams all of the time. While prostitution is out, Angela contemplates insurance fraud, by asking a young neighbor to dump her car, so she can file a bogus claim. Although she changes her mind, Angela goes through with finding a second job as a cleaning woman. The problem is that she ends up working in the same building as her first job and when her boss from the first job notices her cleaning inside the company offices, early in the morning, he (like the rest of us) find that awfully strange--and promptly sends her packing. Perhaps the most alienating action we can attribute to Angela (in terms of alienating us as an audience), is her decision to drive out to a deserted area with Sunny and put the family dog out on the streets. From this point on, it's hard to have much sympathy for Angela, as we can see the devastating effect her decision has on Sunny. The film's denouement mirrors Angela's decision to give up her dog. This time, however, it involves Sunny. Angela ends up getting involved with a co-worker from the telemarketing firm who has a side business involving illegal adoptions. He tells gullible Angela that his \"sister\" (Louise) is just down from Canada and will pay her $20,000 to take little Sunny off her hands. In perhaps the best scene in the film, Louise (after having met and bonded with Sunny a few times) calls on Angela at a motel and makes a bid to adopt her. **SUPER SPOILERS AHEAD** Angela decides to give Sunny up but at the last minute, on a lonely stretch of highway, changes her mind. In one respect, we feel relieved, since it's a horrible thing for a mother to give up her child in such a way. But we feel equally horrible, since we know Sunny will be doomed to endure Angela's continual bad parenting for the unforeseeable future. My ultimate question regarding 'Think of Me' is, \"what is the point\"? Angela scores few points as a sympathetic character so we can care little about her. Perhaps Wizemann's strategy is to shock—proffering a portrait of a young woman as empty vessel. Can it be that a woman whose soul is virtually blank, can do as much damage as the parent who's guilty of physically abusing their child? 'Think of Me' often proceeds slowly in a cinema-verité style. Lauren Ambrose does well in conveying Angela's selfishness but I kept asking what are the protagonist's motivations. Perhaps the point is that there are no motivations—she acts that way simply because that's the way she is. The protagonist feels like an anomaly precisely because she has no goals like most normal people do. Can anybody be so naïve, gullible, narcissistic and nasty at the same time? Perhaps Mr. Wizemann will argue that there are people out there like Angela. Actually, I'm not so sure. But even if there are, I'm not so sure why I should really care.",
         "A most depressing saga which examines the minutiae in the bleak life of a sad and pathetic woman who abuses not only herself but especially her young child. It's difficult to fathom whether or not the film might be attempting to romanticize in some sort of bizarre manner such a degrading existence as it offers no resolution but rather leaves the viewer wondering, as the film concludes, whether or not these two lives will continue to spiral down their seeming path toward self-destruction. And while the cast puts in creditable performances, they fail to overshadow the grim situation portrayed nor are able to engender any real compassion for the characters by holding out any possibility for some sort of positive resolution.",
         "About Sunny moves quite slowly, yet at the same time gradually weaves a rather gloomy plot: In the outskirts of Las Vegas, a single mother repeatedly makes bad decisions that adversely affect her economic and psychological well-being. As the consequences of these bad decisions exacerbate her situation, she becomes even more desperate, and her misguided behavior escalates. In the process, things turn from bad to worse for her nine-year-old daughter who can hardly get the proper care she needs. The movie successfully builds up the pressure with each small unpleasant incident, and in so doing, slowly incorporates the viewer into the depressive world that it depicts. That accomplishment renders About Sunny as one of these dark movies whose influence does not wear off shortly after the ending. Serdar Kaya"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Votiv Films",
         "Ballast Films",
         "Deep in the Heart Pictures"
      ],
      "summaries": ["As things unravel for a struggling single mother in Las Vegas, she must decide what she's willing to give up to get by."],
      "budget": 0
   },
   "movielensId": 175053,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-10-15",
      "dvdReleaseDate": null,
      "directors": ["Bryan Wizemann"],
      "runtime": 103,
      "movieId": 175053,
      "title": "Think Of Me",
      "mpaa": "",
      "actors": [
         "Lauren Ambrose",
         "Audrey P. Scott",
         "Dylan Baker",
         "Penelope Ann Miller",
         "David Conrad"
      ],
      "imdbMovieId": "1198199",
      "originalTitle": "Think Of Me",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["cAJyxRlSGik"],
      "plotSummary": "As things unravel for a struggling single mother in Las Vegas, she must decide what she's willing to give up to get by.",
      "tmdbMovieId": 98870,
      "avgRating": 3.33333,
      "releaseYear": "2011",
      "numRatings": 3,
      "posterPath": "/hX3eU0wLRnM2bEjbGg4Gt2mGGbe.jpg"
   }
}