{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt2286988",
      "video": false,
      "title": "Sleeping with the Fishes",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Alexis Fish",
               "gender": 1,
               "credit_id": "56edfd2ac3a368226e008fb8",
               "name": "Gina Rodriguez",
               "profile_path": "/s1m3BmHGRaWQN5QJyZHHgdjqCQP.jpg",
               "id": 180486,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Dominic Sebastiani",
               "gender": 2,
               "credit_id": "56edfd44c3a3682260008bdb",
               "name": "Steven Strait",
               "profile_path": "/5GAhJBBbZsDmxMXSOXahkJXceyt.jpg",
               "id": 54815,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Kayla Fish",
               "gender": 1,
               "credit_id": "56edfd679251412b33001743",
               "name": "Ana Ortiz",
               "profile_path": "/wMwPs5CVcmW6PjriAqUpr5O1AcS.jpg",
               "id": 38333,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Summer",
               "gender": 1,
               "credit_id": "56edfd7ec3a368224e00886a",
               "name": "Taylor Black",
               "profile_path": "/bb35VIXBarNRF4RBSf5CG0p3WRZ.jpg",
               "id": 1010799,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Mrs. Wasserstein",
               "gender": 0,
               "credit_id": "56edfd959251416a2a00105a",
               "name": "Orfeh",
               "profile_path": null,
               "id": 120829,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Freddy Fine",
               "gender": 2,
               "credit_id": "56edfdadc3a3682260008c00",
               "name": "Robert T. Bogue",
               "profile_path": "/mnu4n4aPRL5YDmC6GXVWjgmasjw.jpg",
               "id": 187712,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Louis Belsky",
               "gender": 0,
               "credit_id": "56edfdc79251413a8f0062b8",
               "name": "John Cariani",
               "profile_path": "/bdE7RAXV8PjKuhAbvMTrIqHeoxh.jpg",
               "id": 1237356,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Estella Fish",
               "gender": 1,
               "credit_id": "56edfde19251414dba006b52",
               "name": "Priscilla Lopez",
               "profile_path": "/g85E86rGIeP4sFPBptuvZAGF5Qz.jpg",
               "id": 170918,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Jude Warren",
               "gender": 0,
               "credit_id": "56edfdfb92514142e5000791",
               "name": "Monica Steuer",
               "profile_path": null,
               "id": 187536,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "Guest at Bat Mitzvah",
               "gender": 0,
               "credit_id": "56edfe15c3a3682253008dfe",
               "name": "Giovanna Cappetta",
               "profile_path": null,
               "id": 1593164,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "Dr. Leonard Fish",
               "gender": 0,
               "credit_id": "56edfe2bc3a3682251008eba",
               "name": "Tibor Feldman",
               "profile_path": "/6NR8t0gDsgoQKtL8mYUYmuEjRq6.jpg",
               "id": 1192389,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "Mo Stout",
               "gender": 0,
               "credit_id": "56edfe3ec3a368226500865a",
               "name": "Stephen DeRosa",
               "profile_path": null,
               "id": 1587937,
               "order": 12
            },
            {
               "cast_id": 12,
               "character": "Mr. Wasserstein",
               "gender": 0,
               "credit_id": "56edfe579251416a2a001089",
               "name": "Tom Morrissey",
               "profile_path": null,
               "id": 1593166,
               "order": 13
            },
            {
               "cast_id": 13,
               "character": "Daniel",
               "gender": 2,
               "credit_id": "56edfe6cc3a3682259007bae",
               "name": "Michael Sirow",
               "profile_path": "/6MvQFJrkSLctyOOMSYBw1BNkFnH.jpg",
               "id": 929065,
               "order": 14
            },
            {
               "cast_id": 14,
               "character": "Casey",
               "gender": 0,
               "credit_id": "56edfe7f9251412f26001792",
               "name": "Melissa Navia",
               "profile_path": null,
               "id": 1333690,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56edfea4c3a3682265008670",
               "name": "Nicole Gomez Fisher",
               "profile_path": null,
               "id": 1391625,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56edfeadc3a3682253008e1e",
               "name": "Nicole Gomez Fisher",
               "profile_path": null,
               "id": 1391625,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56edff879251412f260017cd",
               "name": "Courtney Andrialis",
               "profile_path": null,
               "id": 1593167,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.255118,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 291375,
      "vote_count": 2,
      "budget": 0,
      "overview": "A woman's journey of self-discovery and the dynamics of her zany family.  Alexis Fish (Gina Rodriguez) is left broke and broken-hearted after the death of her cheating husband, working as a phone sex operator and a walking meatball hero. As she returns to her hometown of Brooklyn for a distant aunt's funeral, she fears to admit to her family and overbearing mother (Priscilla Lopez) that her life is a mess. With help from her quirky sister Kayla (Ana Ortiz) and a new love interest (Steven Strait), Alexis realizes she must let go of her past to define her own future.",
      "similar": [
         258480,
         10735,
         27586,
         244772,
         401898,
         858,
         634,
         3981,
         112160,
         437557,
         17130,
         43923,
         11634,
         141,
         394117,
         376867,
         297762,
         242224,
         370663,
         376660
      ],
      "original_title": "Sleeping with the Fishes",
      "runtime": 95,
      "poster_path": "/q5ttEWDahMNaMa04ljFS4FeeWvc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Unikki Production",
         "id": 74445,
         "origin_country": ""
      }],
      "release_date": "2013-08-10",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nicole Gomez Fisher"],
      "runtime": 101,
      "synopsis": "SLEEPING WITH THE FISHES is a comedy which captures one girls journey of self-discovery and the dynamics of her zany family. With its fair share of ay dios mio and oy vey moments, the film comes to life with colorful characters and one-liners that can only be found in a Latino Jewish home in Brooklyn. As SLEEPING WITH THE FISHES opens, its safe to say Alexis Rodriguez Fish (Gina Rodriguez) has seen better days. The recent death of her cheating husband has left her both broke and broken-hearted. Trying to climb out of debt, Alexis has been reduced to juggling humiliating odd end jobs including a walking meatball hero and phone sex operator. Unhappy with the direction she is headed, Alexis struggles to find her way as the life she once knew, unfortunately no longer exists. When she receives an unexpected call from her quirky, comic-book obsessed older sister, Kayla (Ana Ortiz), to come home for a distant aunts funeralAlexis realizes her life might just get worse before it gets any better. Dreading the notion of going home, Alexis fears admitting to her family, especially her well-intentioned but overbearing mother, that her life is un desastre. (a disaster) Once home, Alexis is immediately confronted by her mother (Priscilla Lopez) about her life and the choices shes made since her husbands death. Suddenly re-immersed in her Latin and Jewish roots, Alexis feels like a fish out of water. With family tension quickly growing, Kayla tries to get Alexis back into her former career as a party planner with a job helping coordinate a superhero-themed Bat Mitzvah. Not exactly the answer to her prayers, Alexis is hesitant to take on the project. But with encouraging words from her father (Tibor Feldman), she ultimately gives ina decision which leads to a promising new romance with Dominic (Steven Strait). With love on the horizon and a new found understanding for her dysfunctional family, Alexis is finally able to let go of her past and begin defining her own future. A slice-of-life, SLEEPING WITH THE FISHES features an incredible Latino cast of established and rising talent who come together to tell a relatable and comically poignant story.",
      "writers": ["Nicole Gomez Fisher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2286988/",
      "coverLink": null,
      "actors": [
         "Gina Rodriguez",
         "Steven Strait",
         "Taylor Black"
      ],
      "reviews": [
         "I think low ratings of this movie (under 5) are quite unfair. There are very funny moments in this movie and in spots it's heart warming. The actors put forth convincing performances and convincing performances (as a cast) in any movie these days ar least earns the movie a 3 minimum and only serious debacles could make that rating lower. This movie is a fun diversion that explores family issues in a non-threatening way. You become emotionally invested in the characters instead of emotionally burdened. Gina Rodriguez has a very lovable girl next door quality in this movie. It isn't a must see movie but if you are channel suffering and find this most likely it is the best movie you haven't seen yet that is on. So give it a chance. A ten point rating system is a little restrictive. This movie is just barely a 7 while other movies I have rated 7 are really a 7.5",
         "I caught this inexplicable mess on cable. This is a very silly motion picture: the dialogue is atrocious, the millennial sarcastic snark is unbearable, and the US Latino code switching would make any Spanish-speaking foreign national kick a hole in their flat screen. We are the only country in the world that puts out this kind of goofy trash. The two female leads who play the sisters are moderately attractive but amateurish actresses. The rest of the cast are straight out of the Summer stock central casting. The sisters are supposed to be half-Jewish on their father's side, although the complete lack of humor in the film makes this unrealistic. There's some banal themes about body image, \"fat-shaming\", and the main character is a widow who seems more like a whiny girlfriend whose boyfriend left her for someone better looking. Woody Allen creating the model for this type of film 40 years ago and very rarely is anyone able to imitate it, much less come up with something new, funny or say anything interesting about the human condition. Congratulations, I guess...",
         "I was looking forward to this one for awhile because Gina Rodriguez is such an awesome actress, but it's not exactly the greatest movie. I read an interview where the director, Nicole Gomez Fisher, said she ended up stepping into the role of director because she really wanted to get her script made but the movie had no budget. Well it really shows, it's not a very cinematic movie. Basically he gist of the movie is that Alexis Fish (Rodriguez) is a young recently widowed woman whose life is spiralling out of control. She's lured back home to where her demanding Latina (I don't think we ever got a hint as to what type of Latina her mom was either she was just \"Latina\" which is sort of annoying, not all latinos are alike, but anyway), and Jewish father live. Her sister helps her get back on track career wise and she meets a cute guy and starts flirting with someone for the first time since her husband died... This is a pretty basic movie with a pretty basic plot. It is pretty lowbudget as well. Not an awful movie but a pretty paint by the numbers one. Watch if you like Gina Rodriguez or Ana Ortiz, who is honestly the best part of the movie playing Alexis' elder sister."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [],
      "summaries": [
         "As SLEEPING WITH THE FISHES opens, it's safe to say Alexis Rodriguez Fish (Gina Rodriguez) has seen better days. The recent death of her cheating husband has left her both broke and broken-hearted. Trying to climb out of debt, Alexis has been reduced to juggling humiliating odd end jobs including a walking meatball hero and phone sex operator. Unhappy with the direction she is headed, Alexis struggles to find her way as the life she once knew, unfortunately no longer exists. When she receives an unexpected call from her quirky, comic-book obsessed older sister, Kayla (Ana Ortiz), to come home for a distant aunt's funeral-Alexis realizes her life might just get worse before it gets any better. Dreading the notion of going home, Alexis fears admitting to her family, especially her well-intentioned but overbearing mother, that her life is \"un desastre.\" (a disaster) Once home, Alexis is immediately confronted by her mother (Priscilla Lopez) about her life and the choices she's made since her husband's death. Suddenly re-immersed in her Latin and Jewish roots, Alexis feels like a fish out of water. With family tension quickly growing, Kayla tries to get Alexis back into her former career as a party planner with a job helping coordinate a superhero-themed Bat Mitzvah. Not exactly the answer to her prayers, Alexis is hesitant to take on the project. But with encouraging words from her father (Tibor Feldman), she ultimately gives in-a decision which leads to a promising new romance with Dominic (Steven Strait). With love on the horizon and a new found understanding for her dysfunctional family, Alexis is finally able to let go of her past and begin defining her own future. A slice-of-life, SLEEPING WITH THE FISHES features an incredible Latino cast of established and rising talent who come together to tell a relatable and comically poignant story.",
         "A woman's journey of self-discovery and the dynamics of her zany family."
      ],
      "budget": 0
   },
   "movielensId": 175111,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-08-10",
      "dvdReleaseDate": null,
      "directors": ["Nicole Gomez Fisher"],
      "runtime": 95,
      "movieId": 175111,
      "title": "Sleeping with the Fishes",
      "mpaa": "",
      "actors": [
         "Gina Rodriguez",
         "Steven Strait",
         "Ana Ortiz",
         "Taylor Black",
         "Orfeh",
         "Robert T. Bogue",
         "John Cariani",
         "Priscilla Lopez",
         "Monica Steuer",
         "Giovanna Cappetta",
         "Tibor Feldman",
         "Stephen DeRosa",
         "Tom Morrissey",
         "Michael Sirow",
         "Melissa Navia"
      ],
      "imdbMovieId": "2286988",
      "originalTitle": "Sleeping with the Fishes",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman's journey of self-discovery and the dynamics of her zany family.  Alexis Fish (Gina Rodriguez) is left broke and broken-hearted after the death of her cheating husband, working as a phone sex operator and a walking meatball hero. As she returns to her hometown of Brooklyn for a distant aunt's funeral, she fears to admit to her family and overbearing mother (Priscilla Lopez) that her life is a mess. With help from her quirky sister Kayla (Ana Ortiz) and a new love interest (Steven Strait), Alexis realizes she must let go of her past to define her own future.",
      "tmdbMovieId": 291375,
      "avgRating": 3,
      "releaseYear": "2013",
      "numRatings": 1,
      "posterPath": "/q5ttEWDahMNaMa04ljFS4FeeWvc.jpg"
   }
}