{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0466103",
      "video": false,
      "title": "Dust",
      "recommendations": [
         109354,
         204690,
         88491,
         285021
      ],
      "backdrop_path": "/yjyNqZFtbVOwcGZdbpD3WmQxpVO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fdc3a368484e0af0d7",
               "name": "Алексей Подольский",
               "profile_path": "/nPGlrsYKLyshRAedRKbpDIfWjqM.jpg",
               "id": 985073,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fdc3a368484e0af0db",
               "name": "Pyotr Mamonov",
               "profile_path": "/tKh4S9Lg3TVkGseH1fXNdtAVCaR.jpg",
               "id": 86637,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fdc3a368484e0af0df",
               "name": "Gleb Mikhailov",
               "profile_path": null,
               "id": 985081,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fdc3a368484e0af0e3",
               "name": "Nina Yelisova",
               "profile_path": null,
               "id": 985082,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fdc3a368484e0af0e7",
               "name": "Mikhail Balinsky",
               "profile_path": null,
               "id": 985083,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fdc3a368484e0af0eb",
               "name": "Oleg Novikov",
               "profile_path": null,
               "id": 985084,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fdc3a368484e0af0ef",
               "name": "Larisa Pyatnitskaya",
               "profile_path": null,
               "id": 985085,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe46fdc3a368484e0af0d3",
            "name": "Sergei Loban",
            "profile_path": null,
            "id": 937230,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.151963,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 65104,
      "vote_count": 9,
      "budget": 0,
      "overview": "The genre of the film DUST could be called fantastic realism or existential drama with elements of the fantastic. Dust means the haste in which people live. Dust is a common misconception, the natural clogging up of the brain. Specks of dust how scientists perceive people, scientists who think they know more than anyone else about the universe.",
      "similar": [
         3134,
         11564,
         8810,
         281,
         10017,
         133805,
         2142,
         22323,
         294963,
         298312,
         948,
         14433,
         12162,
         1359,
         4771,
         431,
         8923,
         101,
         205,
         141
      ],
      "original_title": "Пыль",
      "runtime": 107,
      "poster_path": "/c0NttwZbJcgp7ifWizo0Y9afpm2.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [],
      "release_date": "2005-06-17",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.dust.kinoteatrdoc.ru",
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sergey Loban"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Marina Potapova"],
      "originalLanguage": "Russian Sign Language",
      "imdbLink": "http://www.imdb.com/title/tt0466103/",
      "coverLink": null,
      "actors": [
         "Aleksey Podolskiy",
         "Pyotr Mamonov",
         "Gleb Mikhaylov"
      ],
      "reviews": [
         "This sci-fi take on present-day Russia was made on a shoe-string budget by a group of video and performance artists SVOI 2000, known for their situationist antics. After its release, it didn't take long to send ripples of enthusiastic talk throughout the Russian alternative scene. The cast consists almost entirely of little-known but talented and well-placed actors, the big exception being Pyotr Mamonov, lead singer of the legendary band Zvuki Mu and one of the major Russian counter-culture icons of the past two decades, who brilliantly plays a sullen and mysterious professor involved in secret scientific research conducted by the FSB (post-Soviet KGB). The main character (the term \"protagonist\" doesn't quite fit), Alyosha, a toy-factory worker who lives under the supervision of his grandmother, is recruited as a subject in the research, and this brief experience sends his dreary, sedate life into turmoil. A chase ensues as Alyosha finds himself wandering around Moscow in pursuit of a fleeting glimpse of something that he is unable and unwilling to let go, while the FSB staff, annoyed at this unforeseen complication, chase him. This trippy, dark, existential, confrontational and quintessentially Russian gem combines hilarious and mind-cringing characters and situations with surrealist dream and hallucinatory sequences, and is thickly layered with cultural and social references of varying depth and subtlety. It is greatly enhanced by a masterful score of experimental electronic music. A must for anybody interested in the contemporary Russian underground cinema.",
         "\"Pyl\" is made with incredibly low budget(they said,3000 USD),but much more interesting than some recent Russian \"comedies\" or \"melodramas\". They are sometimes well-made,but don't surprise those who knows old Russian popular films in Soviet period. The story develops around a young, not at all attractive, quite ordinary man Alyosha,whose troubles(including dangerous experiments on innocent citizens in the name of Nation) and simple desires can be understood by everybody in the world. But there is nothing \"dramatic\" between him and people around him. All that makes this film funny,expressive and critical is his inner vision and his lonely struggles for his own self-image. Probably no one has ever took such a story for a full-length fiction film after 1930s, when cinema began to depict people and its surroundings mainly from outside,to gorily, cherish or criticize visible world only by showing or reconstructing it more expressively than it really is(Sometimes filmmakers added voice-over narration for the same purpose). In \"Pyl\", on the contrary, visible world looks boring,banal and hiding nothing spiritual behind it.Alyosha feels its total meaninglessness better than anybody because of his inferiority complex and the sense of powerlessness in it.But when this boring world is reflected in Alyosha's nightmare,it obtains strange charm of absurdity. So his choice of his own vision(ideal self-image)is not only psychologically justified,but also logical from aesthetic point of view. \"It's an overall Hell\",says the professor to him,warning the risk of death or getting madness. But our ordinary hero chooses his meaningful illusion than meaningless desert called \"reality\". Director Sergei Loban,probably, doesn't approve Alyosha's regressive choice. So he added very interesting \"postscript\" when credit titles flow. Victor Tsoi's famous rock of Perestroika time \"We're waiting for changes\" sounds with the illustration of sigh languages by an unknown young man.",
         "This is a very interesting film about the 1990s Russia and the miserable life of a small ordinary guy in it. It continues the theme of the \"small man\" in Russian literature (Dostoyevsky's \"Poor people\"/\"Бедные люди\", Checkov's Akaky Akaievich) as well as in movies (\"Chuchelo\", \"Small Vera\"/\"Маленькая Вера\"). The main character is not only unattractive, poor, unintelligent and weak. In some social state like Germany or Sweden he would probably just live a small quiet life without much to talk about. However, in the harsh realities of the planned->market economy transition and the rise of crime in the Russia's 90s, he is also constantly abused by everyone around him. His grandmother dominates him and forces him to eat as if he were a 3 year old, controls his every step and picks clothes for him to wear; random punks on the street insult him for no reason and punch him in the belly; even the state, represented by KGB officers, uses him for an experiment without payment and even explaining the possible dangers of the experiment, and then threatens to put him in jail for the attempts to find out the truth. This movie is a sad portrayal of the less pleasant things \"small people\" face in their ordinary lives, especially in less stable societies. A good watch for psychologists btw. I'm giving the movie 8/10 and not 10/10 because of the shaky camera (the whole movie must have been shot with a hand camera) and the muffled sound (did they even work on the sound? Seem like they've just recorded it with that very hand camera and that's it)."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": ["SVOI 2000"],
      "summaries": ["The genre of the film DUST could be called fantastic realism or existential drama with elements of the fantastic. Dust means the haste in which people live. Dust is a common misconception, the natural clogging up of the brain. Specks of dust how scientists perceive people, scientists who think they know more than anyone else about the universe."],
      "budget": 3000
   },
   "movielensId": 175291,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "2005-06-17",
      "dvdReleaseDate": null,
      "directors": ["Sergei Loban"],
      "runtime": 107,
      "movieId": 175291,
      "title": "Dust",
      "mpaa": null,
      "actors": [
         "Алексей Подольский",
         "Pyotr Mamonov",
         "Gleb Mikhailov",
         "Nina Yelisova",
         "Mikhail Balinsky",
         "Oleg Novikov",
         "Larisa Pyatnitskaya"
      ],
      "imdbMovieId": "0466103",
      "originalTitle": "Пыль",
      "genres": [
         "Comedy",
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["rPdFn2fDtwQ"],
      "plotSummary": "The genre of the film DUST could be called fantastic realism or existential drama with elements of the fantastic. Dust means the haste in which people live. Dust is a common misconception, the natural clogging up of the brain. Specks of dust how scientists perceive people, scientists who think they know more than anyone else about the universe.",
      "tmdbMovieId": 65104,
      "avgRating": 3.61111,
      "releaseYear": "2005",
      "numRatings": 9,
      "posterPath": "/c0NttwZbJcgp7ifWizo0Y9afpm2.jpg"
   }
}