{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0485270",
      "video": false,
      "title": "Ratchagan",
      "recommendations": [],
      "backdrop_path": "/eVNVGrWXnfDr14AQKiqsa6odQgv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "",
               "gender": 2,
               "credit_id": "54e621f0c3a3685fdd000330",
               "name": "Nagarjuna Akkineni",
               "profile_path": "/7BFYOPgrD9SstSPBdxky3dOZbq8.jpg",
               "id": 149958,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "",
               "gender": 1,
               "credit_id": "54e621fb92514121f60004de",
               "name": "Sushmita Sen",
               "profile_path": "/r1Y3yZhV5cBsct6s8jtoJI5PCic.jpg",
               "id": 88138,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "54e62202c3a3685fda000308",
               "name": "S. P. Balasubramaniam",
               "profile_path": "/mwWui8FbgNp60HBaJzgECiCz3ky.jpg",
               "id": 584585,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "54e6220dc3a3685fda00030a",
               "name": "Raghuvaran",
               "profile_path": "/dti8YuJ6UQiKjIAZNtfHzGMkuoN.jpg",
               "id": 237697,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "54e62219c3a3685fe50002e4",
               "name": "Girish Karnad",
               "profile_path": "/nezTKL7fVaTg2dFCQtvzDm92Ynj.jpg",
               "id": 83593,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "54e62221c3a3685fd4000321",
               "name": "Vadivelu",
               "profile_path": "/fD38IPlzEvbmxEAhvGnrwVHKuhQ.jpg",
               "id": 91549,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "54e6222992514121f80002f9",
               "name": "Subhalekha Sudhakar",
               "profile_path": "/zXfWsgOtp3fFUAnD18VgWrh0bov.jpg",
               "id": 544980,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "54e6223092514122010002cc",
               "name": "Ajay Rathnam",
               "profile_path": "/35WBKzY6qvQqaWx4oOXWyi9e7Fo.jpg",
               "id": 583977,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "54e62238c3a3685fea00028d",
               "name": "Chinni Jayanth",
               "profile_path": "/sgEyge60q6nKtgJnb3LT77u23G5.jpg",
               "id": 584123,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "54e6225c92514121ed000329",
               "name": "R. N. Sudarshan",
               "profile_path": null,
               "id": 1341188,
               "order": 10
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "54e6226ac3a3685fdd000337",
               "name": "Sukumari",
               "profile_path": "/2PUWc7VUbDEKqMrk8lyoVChcBLk.jpg",
               "id": 389667,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "54e6227992514121f60004e6",
               "name": "Alphonsa",
               "profile_path": "/vDK9P8tsWBQXltSQ5YAsm2SLeTn.jpg",
               "id": 1332744,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54e6229fc3a3685fd6000345",
               "name": "Praveen Gandhi",
               "profile_path": null,
               "id": 1399184,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54e622ab92514121f00002f1",
               "name": "A. R. Rahman",
               "profile_path": "/vRkSrUAI2qyMMtpAAggAcxBJjPC.jpg",
               "id": 5288,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "54e622bf92514121fb0002dc",
               "name": "K. T. Kunjumon",
               "profile_path": null,
               "id": 545007,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.007932,
      "production_countries": [],
      "id": 179848,
      "vote_count": 0,
      "budget": 0,
      "overview": "Ajay (Nagarjuna) is an unemployed youth who always gets into trouble because of his temper. This loud and angry young man gets heated up when he encounters anyone committing a crime; he takes the law into his own hands, beats them up and then gives them some free advice. Ajay’s father (S. P. Balasubrahmanyam), who works for a insurance firm, is very unhappy with his son’s attitude, and tries his best to change Ajay's attitude through a meditation expert but he fails in this matter as the expert suggests that Ajay's anguish is reasonable. Ajay meets Soniya (Sushmita Sen) through his father, and Soniya falls in love with him. What Soniya likes about Ajay is his temper and anger when he encounters anything which is against law. Soniya gets Ajay’s father's help to get Ajay to love her. Still, Ajay is not interested in her and seriously rejects her at first; but he later changes his mind after going through some unusual situations, and love blossoms between them.",
      "similar": [],
      "original_title": "Ratchagan",
      "runtime": null,
      "poster_path": "/xkNyNPJJdmslYKnD1vYSPhPmyxh.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1997-10-29",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "INR ",
      "directors": ["Praveenkanth"],
      "runtime": 0,
      "synopsis": null,
      "writers": [
         "K.T. Kunjumon",
         "Crazy Mohan"
      ],
      "originalLanguage": "Tamil",
      "imdbLink": "http://www.imdb.com/title/tt0485270/",
      "coverLink": null,
      "actors": [
         "Nagarjuna Akkineni",
         "Sushmita Sen",
         "Girish Karnad"
      ],
      "reviews": [
         "\"Well it's finally here, after a long wait we get to see a tamil movie. Ratchakan!\" - so much has been said about this film in 1997 It's said to be the most expensive tamil movie so far. It's also said that it has a different story from any other Indian movie; Looking at the title one may think that Ratchakan is something like a younger-character version of Indian or a movie with a patriotic theme; but it is NOTHING like that. It's just another stylised love action story with some glamorous conventions of the late 90s meant to appeal to couples in their 20s or 30s in those times. The story goes something like this... Ajay(Nagarjun) an unemployed youth always gets into trouble because of his temper. He gets heated up when he sees anyone committing a crime; he takes the law in his own hands... beats them up and then gives them some free advice. Ajay's father, played by S. P. Balasubrahmanyam, is very unhappy at his son's attitude, and tries his level best to change Ajay but he fails in this matter. Ajay meets Soniya(Susmitha Sen) and she falls for him instantly. What Soniya likes about Ajay is his temper. Soniya gets Ajay's father S.P.B's help to get Ajay to love her. Ajay is not interested in her at first; but later changes his mind and falls in love with her. Soniya's father Sriram(Girish Karnad) a businessman, has no objection to his daughter's relationship... But has one condition; which is , Ajay must control his temper for 90 days and not get into any fight what so ever, even though he sees a crime happening in front of his eyes. If Ajay doesn't succeed he can't marry Soniya. With a heavy heart Ajay agrees to the condition, and Sriram offers Ajay a job in his factory. Sriram actually has his own problems in his factory; 10 of his workers are working with his rival Easwar(Raghuvaran). Easwar is trying to put Sriram out of business and so his 10 people create havoc in the factory by killing old workers and \"ragging\" new workers. So when Ajay comes to work in Sriram's factory these 10 people do the same to Ajay. Ajay keeps cool, trying to keep his promise to Sriram. But Sriram hopes otherwise; he WANTS Ajay to break the promise and beat up the 10 people and throw them out of the factory; At the same time, Sriram hopes that the imminent marriage between Ajay and Soniya would get cancelled, since he doesn't want his daughter to be married to a \"gangster/street fighter\" like Ajay. So Sriram keeps on hoping that Ajay will somehow \"burst out\" so that his plans will succeed. Will Ajay break the Condition? Will Sriram's plan succeed? Will Easwar's plan succeed? Watch the movie and find out for yourself! Overall an average movie; but here are the credits: A.R. Rahman music is the BEST ever (9 songs altogether), The music picturization of the songs are Excellent. There are some good & dramatic action scenes; one in particular, is the scene is where Soniya has to drive a 20-wheel oil tanker (ordered by Easwar to do so) and if the tanker's speed goes below a certain speed limit the tanker will explode into flames. (elements of Hollywood movie SPEED). However poor execution marred the potential of the action elements in the movie . Nagarjun seems too old for action movies and spends time running around & dancing with a very young Susmitha Sen. Susmitha's acting in not convincing but does her glamour job very well . So if you like action movies and don't bother about the story or the actors; then this movie is for you. As my last words this is a Romance- Action movie; since there are no other tamil movies showing now this movie will be a great pass time and especially the music by AR Rahman is one for the finest in his career.",
         "Ajay (Nagarjuna) is an unemployed youth who always gets into trouble because of his temper. This loud and angry young man gets heated up when he encounters anyone committing a crime; he takes the law into his own hands, beats them up and then gives them some free advice. Ajay's father (S. P. Balasubrahmanyam), who works for an insurance firm, is very unhappy with his son's attitude, and tries his best to change Ajay's attitude through a meditation expert but he fails in this matter as the expert suggests that Ajay's anguish is reasonable. Ajay meets Soniya (Sushmita Sen) through his father, and Soniya falls in love with him. What Soniya likes about Ajay is his temper and anger when he encounters anything which is against law. Soniya gets Ajay's father's help to get Ajay to love her. Still, Ajay is not interested in her and seriously rejects her at first; but he later changes his mind after going through some unusual situations, and love blossoms between them. Ajay (Nagarjuna) is an unemployed youth who always gets into trouble because of his temper. This loud and angry young man gets heated up when he encounters anyone committing a crime; he takes the law into his own hands, beats them up and then gives them some free advice. Ajay's father (S. P. Balasubrahmanyam), who works for an insurance firm, is very unhappy with his son's attitude, and tries his best to change Ajay's attitude through a meditation expert but he fails in this matter as the expert suggests that Ajay's anguish is reasonable. Ajay meets Soniya (Sushmita Sen) through his father, and Soniya falls in love with him. What Soniya likes about Ajay is his temper and anger when he encounters anything which is against law. Soniya gets Ajay's father's help to get Ajay to love her. Still, Ajay is not interested in her and seriously rejects her at first; but he later changes his mind after going through some unusual situations, and love blossoms between them. Soniya's father Sriram (Girish Karnad) is an industrialist who owns the Daewoo automotive manufacturing facility. He has no objection to his daughter's relationship with Ajay, but has one condition: Ajay must become employed in his factory, control his temper for three months, and not get into any fight whatsoever, even if he encounters a crime happening in front of his eyes. If Ajay cannot do this he will not be allowed to marry Soniya. With a heavy heart Ajay agrees to the condition; Soniya's love for Ajay deepens and Sriram offers Ajay a job in his factory. Sriram actually has his own problems with his factory in loss; ten of his workers are working with his rival and younger stepbrother Gnaneswar (Raghuvaran), and they hamper the progress of his factory with frequent, pre-planned mishaps. This leads to the factory's property loss. Gnaneswar is the son of Sriram's stepmother who gets deceived by Sriram and loses his share of his father's common business empire. Further, in unusual circumstances, Gnaneswar spends some years in jail and returns with a planned conspiracy and vengeance on his stepbrother Sriram. Gnaneswar is now trying to put Sriram out of business, so his ten men create havoc in the factory by killing old workers and ragging new workers. So when Ajay comes to work in Sriram's factory, these ten men do the same to Ajay. Ajay keeps cool, trying to keep his promise to Sriram. But Sriram hopes otherwise; he wants Ajay to break the promise and beat up the ten men and throw them out of the factory. At the same time, Sriram hopes that the imminent marriage between Ajay and Soniya will be cancelled, since he does not want his daughter to get married to an angry street fighter like Ajay. So Sriram keeps on hoping that Ajay will somehow burst out. When Ajay's father is murdered, he banishes the ten men from the factory. Meanwhile, Gnaneswar kidnaps Soniya and blackmails Ajay and Sriram that Soniya is going to kill herself (to save Ajay from Gnaneswar) and destroy Sriram's factory by bombarding it with a truck armed with a powerful Russian explosive. The rest of the film concerns the manner in which Gnaneswar spends his time in jail and develops his own business empire to crush Sriram, how Sriram's criminal deeds and false motives are exposed to his daughter, what happens to Easwar and Sriram's business empire, and how Soniya is rescued by Ajay."
      ],
      "genres": [
         "Action",
         "Romance"
      ],
      "productionCompanies": ["Gentleman Film International"],
      "summaries": ["Ajay an angry young man falls in love with soniya daughter of a bigshot."],
      "budget": 150000000
   },
   "movielensId": 175589,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-10-29",
      "dvdReleaseDate": null,
      "directors": ["Praveen Gandhi"],
      "runtime": 0,
      "movieId": 175589,
      "title": "Ratchagan",
      "mpaa": null,
      "actors": [
         "Nagarjuna Akkineni",
         "Sushmita Sen",
         "S. P. Balasubramaniam",
         "Raghuvaran",
         "Girish Karnad",
         "Vadivelu",
         "Subhalekha Sudhakar",
         "Ajay Rathnam",
         "Chinni Jayanth",
         "R. N. Sudarshan",
         "Sukumari",
         "Alphonsa"
      ],
      "imdbMovieId": "0485270",
      "originalTitle": "Ratchagan",
      "genres": [
         "Drama",
         "Action",
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ajay (Nagarjuna) is an unemployed youth who always gets into trouble because of his temper. This loud and angry young man gets heated up when he encounters anyone committing a crime; he takes the law into his own hands, beats them up and then gives them some free advice. Ajay’s father (S. P. Balasubrahmanyam), who works for a insurance firm, is very unhappy with his son’s attitude, and tries his best to change Ajay's attitude through a meditation expert but he fails in this matter as the expert suggests that Ajay's anguish is reasonable. Ajay meets Soniya (Sushmita Sen) through his father, and Soniya falls in love with him. What Soniya likes about Ajay is his temper and anger when he encounters anything which is against law. Soniya gets Ajay’s father's help to get Ajay to love her. Still, Ajay is not interested in her and seriously rejects her at first; but he later changes his mind after going through some unusual situations, and love blossoms between them.",
      "tmdbMovieId": 179848,
      "avgRating": 3,
      "releaseYear": "1997",
      "numRatings": 1,
      "posterPath": "/xkNyNPJJdmslYKnD1vYSPhPmyxh.jpg"
   }
}