{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt5003654",
      "video": false,
      "title": "24×36",
      "recommendations": [],
      "backdrop_path": "/cWHrUQfdwbDg9w3K5cjwy6FJ2nZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Himself - Poster Artist",
               "gender": 0,
               "credit_id": "56d68c1a92514112cd001cfe",
               "name": "Sharm Murugiah",
               "profile_path": null,
               "id": 1585272,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Herself - Poster Artist",
               "gender": 0,
               "credit_id": "56d68c1ac3a3681e50017bdb",
               "name": "Tracie Ching",
               "profile_path": null,
               "id": 1585273,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Himself - Poster Artist",
               "gender": 0,
               "credit_id": "56d68c1a9251411884004a14",
               "name": "Matthew Chojnacki",
               "profile_path": null,
               "id": 1585274,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Himself - Poster Artist",
               "gender": 0,
               "credit_id": "56d68c1bc3a3681e4a018908",
               "name": "Mat Weller",
               "profile_path": null,
               "id": 1585275,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "56d68c97c3a3681e4401b74c",
            "name": "Kevin Burke",
            "profile_path": null,
            "id": 1585276,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.713427,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 385305,
      "vote_count": 10,
      "budget": 0,
      "overview": "A documentary exploring the birth, death and resurrection of illustrated movie poster art. Through interviews with a number of key art personalities from the 70s and 80s, as well as many modern, alternative poster artists, “Twenty-Four by Thirty-Six” aims to answer the question: What happened to the illustrated movie poster? Where did it disappear to, and why? In the mid 2000s, filling the void left behind by Hollywood’s abandonment of illustrated movie posters, independent artists and galleries began selling limited edition, screenprinted posters — a movement that has quickly exploded into a booming industry with prints selling out online in seconds, inspiring Hollywood studios to take notice of illustration in movie posters once more.",
      "similar": [],
      "original_title": "24×36",
      "runtime": 81,
      "poster_path": "/3pGFlpDBsLv0p6KPQLl53HVTbJp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2016-03-05",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "A movie about movie posters.",
      "adult": false,
      "homepage": "http://24x36movie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kevin Burke"],
      "runtime": 82,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt5003654/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNjAyOTk1NDUxNl5BMl5BanBnXkFtZTgwNjg4NzgwMDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Paul Ainsworth",
         "Dave Alexander",
         "Andrea Alvin"
      ],
      "reviews": [
         "Finally got round to watching this on Sky last week and loved it, was nice to here artists talking about there work and likewise from the fans,For someone new to the print hobby it gave a fair bit of information about the hobby itself.I liked that it didn't just focus on official prints but had a good mix of both official and unofficial work.",
         "A documentary exploring the birth, death, and resurrection of the illustrated movie poster. Early on, the film tells us a great truth: posters are often more iconic than any one scene of a movie. \"Jaws\" comes to mind, as do others, where it is the poster that has become the popular image. And yet, do any of these names sound familiar: John Alvin (1948-2008), Bob Peak (1927-1992), Reynold Brown (1917-1991), Richard Amsel (1947-1985), Drew Struzan (b. 1947). Probably not, though they were the giants of the poster art world. The studios saw the posters as advertising, not art. And while that is true in the strictest sense, it left many great artists unappreciated. More often than not, no signatures were allowed on the posters, and the work from the earliest years in now anonymous. Who painted the great posters of Frankenstein's monster? We will never know. As anyone who lived through the 1980s-1990s knows, in the late 80s, there was a shift to photography, with the idea that artistic posters might suggest an animated film. This claim that pops up again and again, and sounds absurd on its face, but one scene actually has a focus group looking at posters and making the exact same comment. The \"art\" in poster art took a dive in the 1990s, leaving us with \"floating heads\" and the same layout was used over and over again. For horror fans, this was evident in the teen horror films (\"Scream\", \"Last Summer\") and has not really stopped. Even the more creative posters today seem to rehash the same poses and images over and over and over. Is poster art dead? No. Because \"24x36\" covers a longer history, a new trend. Not just the history of lithographs and the decline of posters, but its new resurgence thanks to the rise of Mondo, its eccentric leader Rob Jones, and the new art from specialty Blu-ray labels like Scream Factory and Arrow Video. And this generation of artists, such as Gary Pulling, are not anonymous. \"24x36\" is a much-needed piece of film history. There are many biopics, and there have been focuses on the special effects. Those behind the scenes are finally getting their due. But what of the painters and sketch artists who really drove the images into our collective, pop culture imagination? Now their story can be told!",
         "So I finally got past the title. It's a phenomenally crappy title, given that the standard \"movie poster\" size is a one-sheet, which is 27\"x40/41\" The trick is this movie spends way more time focusing on \"unofficial\" movie-related screen-prints which *are* 24x36, which is a bit of a disappointment. I'd rather they spent more time documenting the history of movie posters and the stories behind those posters, than focusing on some random artists doing unofficial work.",
         "A fascinating subject poorly documented. Some horrible audio at least distracts from the complete over use of adobe after effects. Almost all the interviews are unbelievably badly recorded, it almost seems like they forgot to bring a mic and just did it all in camera. Some of the animated posters are a nice idea but it gets old quickly. Still watchable but could do with a few fixes here and there.",
         "I don't know how this one flew under my radar, because movie posters are one of my many passions, and a documentary about just that very thing would have immediately stuck in my head. But alas, I somehow missed this one. And I'm not entirely sure how I came across it now, but it looks like it was released back in 2016, but I guess it's never late than never. So let's dig in. I think the topic of movie posters, and their ever-changing and evolving style is such a brilliant idea for a documentary. It's a topic that's rarely ever discussed anymore, except when complaining about the prices that any new Mondo release goes for. As for the state of movie posters in general, it's pretty sad, and I know I'm not the only one who really dislikes where they are right now with the big studios. Movie posters used to be an art form, just look at any of them beginning with the 20's going on through the 80's. Each decade offered a different style, but each very much an artistic endeavor, with the work being done in the 80's being a critical and commercial high point. Once we got into the 90's, it all started to change, with photography creeping into the format more and more and hand-drawn or painted artwork going out the window. And it's only gotten worse with Photoshop, where every single new film is either a floating head of the star, or a badly rendered collage of images from the film. Just look at most of Marvel's superhero films. Though I am loving DC's Wonder Woman marketing campaign and their colorful almost art deco approach to her posters, as well as Kong: Skull Island's classic artistic approach. Personally I found this documentary to be highly enlightening, and thoroughly entertaining. It's not perfect, but a very fun way to spend 2 hours of your life, especially if you're an artist or collector of movie memorabilia. For the most part, I really enjoyed it, but I felt that it devoted too much time to the state of modern-day posters today rather than the art and skill of it in decades past. Meaning, a good chunk of this film's running time is pretty much spent on Mondo and other's like it, which is cool because they are the ones who reinvigorated the \"hand-drawn movie poster\" movement, but I really would have liked to have learned more about the older posters and their artists, which they do touch on early on, but I guess not enough for my liking. At the same time it was interesting getting to see in person the artists that I currently follow, some of who's work adorns my walls, and their thoughts on the current movement and where it's headed. It also brings up an issue that I have with these new posters, and that's the flippers who buy the extremely limited quantities out within seconds and immediately flip them around for ridiculous fee's on eBay in a matter of minutes. I knew I wasn't the only one who had an issue with this and I was glad to hear from the artists themselves how it pretty much makes them sick that some (flippers) are only in it for the money and take so much away from the collectors who just want one to hang on their wall, not for profit. It's good that most new companies out there that do the same thing are mass producing them instead of limited runs of 100 like Mondo, that way anyone can get one if they want. I like that idea. Definitely worth a watch and it's a fun one at that. Just wish so much time hadn't been spent on the current movie poster crisis, and instead focused on the classics and their lasting appeal compared to the over- Photoshopped nightmare we're currently in. But I get it, trust me I do. There's a resurgence and an urgency and art about the movie poster format and it's because of companies like Mondo and others. Hell, I still try to grab one from time to time because some of them are just too killer. One thing's for sure, watching this will definitely get you into wanting to track down some old favorites, or even check out what new artists are doing with them these days. www.robotGEEKSCultCinema.blogspot.com",
         "The fact the film focuses on about 15 minutes total on some of the most important Poster Artists that ever lived, and barely mentioned and completely ignored some iconic greats I can overlook. What one cannot overlook is when you set out to create Movie Poster Art, a noble cause, but fail to create art that at least \"equals\" the art that preceded it, is an epic failure. Perhaps it is a bit much to ask artists of today who approach their art as fanboys instead of Craftsman. Bob Peak, Reynold Brown, Lettick, Struzan, McCarthy, Frazetta, McGinnis, all had extensive studio and 'life\" Painting skills and were highly dedicated craftsman. A lack of art history is clearly displayed coupled with an arrogance that is quite astounding from all the artists, including the head Honcho Poster Chief Mondo Rob, who spoke as if he were Saul Bass, Bill Gold, and Jesus all wrapped in omnipotent art saving flannel. Elvis exuded less arrogance. Frazetta and Peak would cut the hearts out of all these cats. Talented Children lacking soul and depth, but that is art today, watered down pastiche for the masses and stripped of Blood, Sweat, and Craft. Jeff Koons replaces Caravaggio, and Mondo replaces real movie art with mediocre visuals and packages it all on artisanal paper. Welcome to the 21st Century.",
         "A film of two halves. We see the development of film posters as advertising to sell movies. It was not regarded as art. We see the work of notable poster artists of the recent times. John Alvin, Richard Amsel, Drew Struzan. People who worked on Jaws, Star Wars, ET, Raiders of the Lost Ark, Blade Runner, Alien. In the 1990s, the art of the film posters declined. We got floating heads lit in various ways. The film posters showed you the stars of the film, such as Face/off. Horror movies were no different. Exhibitors, video shops wanted the faces of the stars. Even if a director wanted some fancy art work he would discover that power ultimately lay with the film executives and they all went for something identical. The second half of the film was about money. The value of old film posters, the rare ones exchanging for thousands and those companies recreating posters for classic films whether it is done legitimately or not. Some companies such as Mondo have been instrumental in the resurgence of movie artwork. An interesting, novel subject matter but I felt lacking somewhat. I wanted more on the history of the film poster."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History"
      ],
      "productionCompanies": [
         "Snowfort Pictures",
         "Post No Joes Productions"
      ],
      "summaries": ["A documentary exploring the birth, death, and resurrection of the illustrated movie poster."],
      "budget": 0
   },
   "movielensId": 175647,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-03-05",
      "dvdReleaseDate": null,
      "directors": ["Kevin Burke"],
      "runtime": 81,
      "movieId": 175647,
      "title": "24×36",
      "mpaa": null,
      "actors": [
         "Sharm Murugiah",
         "Tracie Ching",
         "Matthew Chojnacki",
         "Mat Weller"
      ],
      "imdbMovieId": "5003654",
      "originalTitle": "24×36",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A documentary exploring the birth, death and resurrection of illustrated movie poster art. Through interviews with a number of key art personalities from the 70s and 80s, as well as many modern, alternative poster artists, “Twenty-Four by Thirty-Six” aims to answer the question: What happened to the illustrated movie poster? Where did it disappear to, and why? In the mid 2000s, filling the void left behind by Hollywood’s abandonment of illustrated movie posters, independent artists and galleries began selling limited edition, screenprinted posters — a movement that has quickly exploded into a booming industry with prints selling out online in seconds, inspiring Hollywood studios to take notice of illustration in movie posters once more.",
      "tmdbMovieId": 385305,
      "avgRating": 3.5,
      "releaseYear": "2016",
      "numRatings": 2,
      "posterPath": "/3pGFlpDBsLv0p6KPQLl53HVTbJp.jpg"
   }
}