{
   "tmdb": {
      "original_language": "ko",
      "keywords": [],
      "imdb_id": "tt1500177",
      "video": false,
      "title": "Dooman River",
      "recommendations": [],
      "backdrop_path": "/930JFKXTVHwGNpyqsI8uDwXWJXx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Chang Ho",
               "gender": 0,
               "credit_id": "52fe49579251416c910aa233",
               "name": "Jian Cui ",
               "profile_path": null,
               "id": 932489,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Soon-Hee",
               "gender": 0,
               "credit_id": "52fe49579251416c910aa237",
               "name": "Lan Yin ",
               "profile_path": null,
               "id": 932490,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Grand Father",
               "gender": 0,
               "credit_id": "52fe49579251416c910aa23b",
               "name": "Jin-Long Lin ",
               "profile_path": null,
               "id": 932491,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53111e9c925141104d0016f8",
               "name": "Xu Wei",
               "profile_path": null,
               "id": 1067113,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "531497edc3a36829c40057be",
               "name": "Zhang Lu",
               "profile_path": "/kk9w0amH247uVIv51xJKLy6UpCS.jpg",
               "id": 118674,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a36510f0e0a264cbe1cf5e7",
               "name": "Zhang Lu",
               "profile_path": "/kk9w0amH247uVIv51xJKLy6UpCS.jpg",
               "id": 118674,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.191101,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "KR",
            "name": "South Korea"
         }
      ],
      "id": 85709,
      "vote_count": 4,
      "budget": 0,
      "overview": "Chang-ho, 12, becomes friend with a North-Korean immigrant about the same age who just crossed the Dooman river, border between North-Korea and China. His mute sister and his wise grand-father will get along with him in a series of misfortunes.",
      "similar": [],
      "original_title": "두만강",
      "runtime": 90,
      "poster_path": "/a73bO24CocrvIukBoOvwIaUuh2o.jpg",
      "spoken_languages": [
         {
            "name": "한국어/조선말",
            "iso_639_1": "ko"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [],
      "release_date": "2010-08-28",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Life is hard.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lu Zhang"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Lu Zhang"],
      "originalLanguage": "Chinese",
      "imdbLink": "http://www.imdb.com/title/tt1500177/",
      "coverLink": null,
      "actors": [
         "Jian Cui",
         "Lan Yin",
         "Jin-Long Lin"
      ],
      "reviews": [
         "This is my first review ever on this site, so I'm gonna allow myself to give this a 10/10 and highly recommend you to watch it. I had the great opportunity to watch a screening of this movie with the director, Zhang Lu, present. It was one of those extra credit type of things and I'd been skipping class too often to not jump at a chance like this, so I went in not knowing what this movie was about or what it would be like - though I had a feeling I was going to cry a lot. And yes, yes I did. I won't give you a summary of the movie because it held too much information that was not blatantly given out, so my summary will probably be wrong here and there. Instead, I'll tell you how the director started out his career, and hope that he doesn't mind and hope that I don't tell it wrong (because he spoke in Chinese and had a translator say it back in English, so there might be some things lost in translation.) From the ages 27-37, Zhang Lu felt like he wasted his life. He spent his time at home cooking for his kids, taking care of them, and doing not much else while his wife went out to work and support the family monetarily. One day his director friend comes up to him and asks him to write a screenplay for him, because the stories Zhang Lu had been telling him were interesting. Zhang Lu told him no, but afterwards felt like there was a new purpose to his life and wrote the screenplay anyways. When he met up with his friend later and gave him the screenplay, his friend went to the bathroom and cried for ten minutes. At the time, he thought to himself, \"if my screenplay made someone cry for that long, it must not be good.\" (I cried enough for the entire audience, btw.) But his friend took the screenplay anyways and tried to get it approved by the Chinese government, because it had to be back then. They told Zhang Lu's friend no, so his friend asked him if he could write another one, a \"fake\" version\" to give to the censorship bureau, though he would continue to direct the original one. So Zhang Lu wrote him a second one and his friend got it approved. But afterwards, Zhang Lu found out that his friend was actually shooting the second one and got upset, asking him why he would shoot the fake one and not the real one when he told Zhang Lu he would. His friend told him he'd probably get fired for shooting the original. So Zhang Lu told him, no! He said, what could be so hard about shooting the movie? I could shoot the movie! And so he did. Boom. Obviously the movie he shot wasn't Dooman River, and this story maybe has no relation at all to Dooman River. But it's a cool story anyways, and Dooman River is a great movie. So. Watch it. Bye.",
         "Most movie financiers lust after leaving their fingerprints on the film stripes, manipulating how the story should develop, which actor(s) to take, where to shoot\u0085 And this film is just to my amazement, though the project is partly supported by French money, I saw NO accidental French journalist doing secretive investigation in the border village, NOR gone-astray French tourists being Nosey Parker to stay in one of the houses sprouting up. And thus, the original chilly flavour generated from both the weather and the ruling parties, and also the villagers' warm human touch of the northern region is well-kept. I wild guessed that the fund provider was so open-minded to allow the director, ZHANG Lu, run his imagination and creativity freely. Yet, while asking him this question, I got this answer: French is not his language, he said in humorous tone, and so he might have mis-grabbed the meaning when it was uttered. What enlightening truth: lost in translation, so fortunately."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Lu Films",
         "Arizona Films",
         "Arte France Cinéma"
      ],
      "summaries": [
         "Chang-ho, 12, becomes friend with a North-Korean immigrant about the same age who just crossed the Dooman river, border between North-Korea and China. His mute sister and his wise grand-father will get along with him in a series of misfortunes.",
         "A 12-year-old Korean-Chinese boy living on the Chinese side of the North-Korean Chinese border takes up with a North Korean boy his age who is in China to find food for his sister who is ill, against the backdrop of starvation and death just across the border in North Korea. All the while in the village, cross-border tensions result in persecution, rape, and insanity."
      ],
      "budget": 0
   },
   "movielensId": 175715,
   "movielens": {
      "languages": [
         "한국어/조선말",
         "普通话"
      ],
      "releaseDate": "2010-08-28",
      "dvdReleaseDate": null,
      "directors": ["Zhang Lu"],
      "runtime": 90,
      "movieId": 175715,
      "title": "Dooman River",
      "mpaa": "",
      "actors": [
         "Jian Cui ",
         "Lan Yin ",
         "Jin-Long Lin "
      ],
      "imdbMovieId": "1500177",
      "originalTitle": "두만강",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Chang-ho, 12, becomes friend with a North-Korean immigrant about the same age who just crossed the Dooman river, border between North-Korea and China. His mute sister and his wise grand-father will get along with him in a series of misfortunes.",
      "tmdbMovieId": 85709,
      "avgRating": 2.5,
      "releaseYear": "2010",
      "numRatings": 2,
      "posterPath": "/a73bO24CocrvIukBoOvwIaUuh2o.jpg"
   }
}