{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3620516",
      "video": false,
      "title": "A Genius Leaves the Hood - The Unauthorized Story of Jay Z",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.084231,
      "production_countries": [],
      "id": 332543,
      "vote_count": 2,
      "budget": 0,
      "overview": "On the surface, 'A Genius Leaves The Hood-The Unauthorized Story of Jay Z' chronicles how hip-hop's most successful rapper of the past two decades reached the top; but at its core, the film attempts to divulge the savvy and cunning business acumen of a mogul who decided that being at the top of the charts wasn't enough. This 60-minute unauthorized biography explores the mind of a man who never played by the rules and admits it. This film uncovers the price Mr. Carter paid for his success through recent controversies including the racial debate of the Barneys deal, feud with Harry Belafonte and clashes with community activists over the construction of the Barclay Center. The film also explores rumors of association with the Illuminati, a highly publicized separation from the Roc-A-Fella crew, his estranged relationship with rapping mentor Jaz-O and break up with business partner Damon Dash.",
      "similar": [],
      "original_title": "A Genius Leaves the Hood - The Unauthorized Story of Jay Z",
      "runtime": null,
      "poster_path": "/tHOfHT0Y5asvIwiyUNNCM4BRrSY.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2014-03-21",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 58,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3620516/",
      "coverLink": null,
      "actors": [
         "Jonathan Burks",
         "Bill Adler",
         "Chris Atlas"
      ],
      "reviews": [
         "Could have been a lot better but as far as unauthorized documentaries without the main subject themselves it's pretty good. It doesn't shy away from looking at Jay-Z critically displaying both positives and negative aspects to his character One of the ppl being interviewed says something like \"We know of Jay-Z the businessman and hustler, but we don't know anything about the person behind Jay-Z\" and that's this movie's biggest flaw, we get to know all the chessmoves Jay-Z pulled to get to where he's at, but we don't get to know why and what's his motivation if there's anything beyond money and power that drives him. We hear about messed up deals he did with various people but we don't get his reasoning why, or if he actually had good intentions in certain political and business deals that hurt the community, or if it was just for profit. The documentary even goes so far to suggest that Beyonce and Jay-Z's relationship could be a way for them both to gain even more power and success. Without either Bey or Jay talking about there relationship, this all becomes merely speculative. It does have some key-players tho like Jaz-O who was instrumental to Jay-Z's career as well as DJ Clark Kent and other behind the scenes dudes in the music-industry, wouldn't have mind seeing Beanie Sigel, Bleek or any of the rocafella artists interviewed tho. But a lot of people interviewed are merely music-journalists who don't know Jay on a personal level, that's why this documentary falls a bit short but still is a well-crafted doc that might be worth checking out if you have the time: which you probably do as it's only 57 minutes long.",
         "This documentary was made by people who knew jay-z a long time ago and are most likely bitter they're not in his life anymore. I was surprised to see kim osario (or whatever), former someone at the source magazine, talking bad about jay-z . I Guess all former source mag workers are bitter ( ala Benzino) people that are mad at the very people they tried to get on the cover of ther magazine, when it was relevant. Surprisingly jaz -o doesn't go too hard on jay, but you know what hes there for, to basically say jay-z shitted on me, his mentor. Sprinkled through out with moody music to over dramatize some of the mostly negative interviews , This doc just has a negative tone thats hard to ignore.",
         "That documentary was hilarious and pathetic. Sounded like a bunch of disgruntled haters that are mad. Sometimes when you grow, you grow past some people. Doesn't mean you are better just going to another level and sometimes you have to leave certain things and people behind. It's business, not personal. Everyone has a past, the only difference is that Jay is a public figure and his wrongs are on display. People, especially \"US\" are so quick to judge people on their past, but if someone dug in your closet, who knows how many skeletons would fall. Jay has never been dishonest about his past and how he got there. That documentary was nothing more than a way to try to taint his rep. #crabsinabarrel",
         "This is a very well put together documentary on the life of Jay-Z. It talks about his rise through the \"Mercy\" Homes to him battling against other music rappers like Dame Dash and Camron on who will control their record label. I remember most of these artists were super huge at the time. The only thing I didn't care for were the djs, reporters, and music executives interviewed. It seems like these \"friends\" are critical and bashing him. I don't think any one person can be that \"evil\". I just think people change and grow up. I do think they should give him more credit on how he's been about to use his success into other business that may be closed off to young black men.",
         "Minds will be opened, perhaps even changed once you watch this film.Jay Z has managed to protect his image over the years. As a fan, I've followed Jay Z throughout his whole career but still don't know who he really is ... Who ever directed this movie definitely did their research and reached out to the right people from Jay- Z's past. Jay Z had to make a lot of choices to reach his level of success, it was interesting to see the choices he made in the film. Jay Z definitely believes in the power of association and unfortunately a lot of his friends who helped build him as an entertainer - did not make it into his blueprint for life. I think we are all guilty of outgrowing our friends at some point in our life..."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Moguldom Studios"],
      "summaries": [
         "A Genius Leaves The Hood: The Unauthorized Story of Jay Z uncovers the price Mr. Carter paid for his success through recent controversies including the racial debate of the Barneys deal, feud with Harry Belafonte and clashes with community activists over the construction of the Barclay Center. The film also explores rumors of association with the Illuminati, a highly publicized separation from the Roc-A-Fella crew, his estranged relationship with rapping mentor Jaz-O and break up with business partner Damon Dash.",
         "On the surface, \"A Genius Leaves The Hood: The Unauthorized Story of Jay Z\" chronicles how hip-hop's most successful rapper of the past two decades reached the top; but at its core, the film attempts to divulge the savvy and cunning business acumen of a mogul who decided that being at the top of the charts wasn't enough. This 60-minute unauthorized biography explores the mind of a man who never played by the rules and admits it. This film uncovers the price Mr. Carter paid for his success through recent controversies including the racial debate of the Barneys deal, feud with Harry Belafonte and clashes with community activists over the construction of the Barclay Center. The film also explores rumors of association with the Illuminati, a highly publicized separation from the Roc-A-Fella crew, his estranged relationship with rapping mentor Jaz-O and break up with business partner Damon Dash. Through in-depth interviews with friends, former business partners, music industry executives, authors and journalists, this exploratory biopic gives the novice, the fan, the critic and the non-believer an uncensored look at Jay Z's journey from Marcy Projects to Madison Avenue and beyond. As a drug dealer, turned rapper, turned CEO, turned author, turned sports agent, viewers will discover what drove Jay-Z to seek unlimited wealth, how he positioned himself to achieve this wealth and whether criticism is warranted for someone who successfully pursued the American dream."
      ],
      "budget": 0
   },
   "movielensId": 175725,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-03-21",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 175725,
      "title": "A Genius Leaves the Hood - The Unauthorized Story of Jay Z",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "3620516",
      "originalTitle": "A Genius Leaves the Hood - The Unauthorized Story of Jay Z",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "On the surface, 'A Genius Leaves The Hood-The Unauthorized Story of Jay Z' chronicles how hip-hop's most successful rapper of the past two decades reached the top; but at its core, the film attempts to divulge the savvy and cunning business acumen of a mogul who decided that being at the top of the charts wasn't enough. This 60-minute unauthorized biography explores the mind of a man who never played by the rules and admits it. This film uncovers the price Mr. Carter paid for his success through recent controversies including the racial debate of the Barneys deal, feud with Harry Belafonte and clashes with community activists over the construction of the Barclay Center. The film also explores rumors of association with the Illuminati, a highly publicized separation from the Roc-A-Fella crew, his estranged relationship with rapping mentor Jaz-O and break up with business partner Damon Dash.",
      "tmdbMovieId": 332543,
      "avgRating": 3.5,
      "releaseYear": "2014",
      "numRatings": 1,
      "posterPath": "/tHOfHT0Y5asvIwiyUNNCM4BRrSY.jpg"
   }
}