{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt5609734",
      "video": false,
      "title": "Bye Bye Germany",
      "recommendations": [],
      "backdrop_path": "/mDQeWnpowL9r0RDRh9uvNfTerOI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fränkel",
               "gender": 2,
               "credit_id": "587420f2c3a36817310111c3",
               "name": "Anatole Taubman",
               "profile_path": "/ykaA067K1LYyERSGTM98qzSw2Rl.jpg",
               "id": 62892,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "David",
               "gender": 2,
               "credit_id": "58742103c3a36817700147f8",
               "name": "Moritz Bleibtreu",
               "profile_path": "/rol9YK1QeR2mkrqAJ0F9RsDTMqp.jpg",
               "id": 677,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Lubliner",
               "gender": 2,
               "credit_id": "587421129251410e730136dd",
               "name": "Joel Basman",
               "profile_path": "/lU8EmVc3tSVC3TfxBm0u4XzuEgl.jpg",
               "id": 223477,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Fajnbrot",
               "gender": 2,
               "credit_id": "58742121c3a36817310111df",
               "name": "Tim Seyfi",
               "profile_path": "/3AAgrT7l7shdMvaHJMVfsZBFB0h.jpg",
               "id": 18734,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Sara Simon",
               "gender": 1,
               "credit_id": "5874212f9251410e6d0137c8",
               "name": "Antje Traue",
               "profile_path": "/4DOG5KCd1MQr8h5GJc9hQsG8JmN.jpg",
               "id": 43202,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Kleinschmitt",
               "gender": 0,
               "credit_id": "587421409251410e62013446",
               "name": "Joachim Paul Assböck",
               "profile_path": "/3f7qlYM8BD6W8zJTmMGzdmhEBa3.jpg",
               "id": 51651,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Gerda Schütz",
               "gender": 1,
               "credit_id": "5874215fc3a368176801626c",
               "name": "Heike Hanold-Lynch",
               "profile_path": "/eXd4pykz6jDov6pSj2I6AaGtep5.jpg",
               "id": 1008395,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "587420e09251410e65013d7a",
               "name": "Sam Garbarski",
               "profile_path": "/9uVyp4Xv0ygOAZ4ocYqkSXcC8vj.jpg",
               "id": 19983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5936e9b59251417263000d3f",
               "name": "Michel Bergmann",
               "profile_path": null,
               "id": 1829555,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5936e9bcc3a3684b97000d19",
               "name": "Michel Bergmann",
               "profile_path": null,
               "id": 1829555,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5936e9cbc3a3684c0d000bcb",
               "name": "Sam Garbarski",
               "profile_path": "/9uVyp4Xv0ygOAZ4ocYqkSXcC8vj.jpg",
               "id": 19983,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 2.99945,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 434166,
      "vote_count": 7,
      "budget": 0,
      "overview": "David Berman and his friends, all Holocaust survivors, have only one purpose: to go to America as soon as possible. For this they need money. Close to his aim, David is not only deprived of his savings but also overtaken by his shady past.",
      "similar": [],
      "original_title": "Es war einmal in Deutschland",
      "runtime": 102,
      "poster_path": "/voHSbvdqkyplJkrhp9E6SvUOBt7.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Entre Chien et Loup",
            "id": 3984,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Samsa Film",
            "id": 790,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "IGC Films",
            "id": 91140,
            "origin_country": ""
         }
      ],
      "release_date": "2017-04-06",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sam Garbarski"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Michel Bergmann",
         "Sam Garbarski"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt5609734/",
      "coverLink": null,
      "actors": [
         "Moritz Bleibtreu",
         "Antje Traue",
         "Tim Seyfi"
      ],
      "reviews": [
         "\"Es war einmal in Deutschland...\" (which means literally \"Once Upon a Time in Germany\") or \"Bye Bye Germany\" is the newest work by writer and director Sam Garbarski and this is not the first time he worked with lead actor Moritz Bleibtreu here. But first thing first: It runs for a bit over 1.5 hours and Garbarski worked on the script too, together with Michel Bergmann, who also wrote the original material this film is based on and you probably wouldn't expect that his most known work so far is an Otto Waalkes film. The subject here is entirely different already. Maybe you can already read from the title that this is another German film dealing with Nazi Germany and the Holocaust. But there is one crucial difference here, namely that this film played after the war and focuses on the lives of those Jews who stayed in Germany. Compared to the hundreds if not thousands of movies playing during the war, this makes for a nice difference. But they made nothing of this premise sadly, it became a really disappointing watch. Bleibtreu is frequently a much better actor than here and he makes the already pretty bad script look worse. The film never really decides if it wants to tell one individual story or deliver from the historic perspective. As a consequence, it does a bit in both fields and comes really short twice. There are more glaring weaknesses here like the same as above as it wants to tell an impactful story about the days past World War II or be relevant in retrospective focusing on the protagonist's ways of survival during the war. The interrogation scenes are the worst. It's basically all the same: Traue acting like yes we know you are a Jew and were a victim, but you also did bad things with Bleibtreu's permanent response were sarcastic remarks that depict him as the victim. They basically included in 30 minutes what could have been told in five. And when we see the two in bed together near the end, really all is lost as if the private conversation before wasn't bad enough already. Also apparently they thought the audiences to be complete idiots, but guys let me assure you that the place were Nazi criminals were held captive was Nuremberg and if you make this fact and look like something nobody knows about in the scene where she sends the witness back, then it is ridiculous because those who actually don't know would ever think of watching this film. Yeah well and the final words depicted on the screen before the ending credits added more randomness and showed a desperate attempt in making this film relevant from a historic perspective. It was along the lines of \"X (insert number here) Jews stayed in Germnany after World War II. Not one of them could tell their kids why.\" Did the filmmakers ask them all? Did they all have children? Sorry but how cringeworthy was that. It's stuff that your teacher marks red if you write it in a history exam for lack of proof. Pretentious, it is. Not a good film from start to finish. A shame what they turned this decent idea into.",
         "Es war einmal in Deutschland \u0085 (Once upon in Germany, not Bye Bye Germany) is a brilliant movie set in Germany in 1946, right after all the atrocities that Germany committed. I really think that Germany forgot really fast the Holocaust and its gas chambers, and now the country is considered a modern and Eco-friendly country, but let's not forget that 75 years ago the whole country supported happily the humiliation and deportation of millions of people, the mass killings, and the gassing of men, women, and children (for the guilt and responsibility of the German common people in the Holocaust please read Yehuda Bauer's \"Rethinking the Holocaust\"). For that, I never understood why there are hardly any films about the Holocaust made in Germany, when, considering the magnitude of the tragedy, Germany should be doing 1 movie a day about the Holocaust (until reaching the 11 million). The really good German-speaking films critical movies about the Holocaust are actually not German: Die Fälscher (Stefan Ruzowitzky, 2007) is Austrian, Berlin'36 (Kaspar Heidelbach, 2009) is also Austrian, and the director of Es war einmal in Deutschland \u0085 (Sam Garbarski) was born in Germany but he is actually Belgian. Es war einmal in Deutschland \u0085 is a funny, sad, and moving film that will make you laugh and cry. I don't think that here in Spain (I live in Madrid) the public really got the movie. If you don't know what a \"Kapo\" was, or what was happening at \"the ramp\" in Auschwitz (the majority of the Spanish public hardy know anything about the Holocaust) or what \"Lechaim\" means, you are going to miss some good points about the movie and some very good Jewish black humour. The music of the film (composed by Renaud Garcia-Fons) is really beautiful. The cinematography (Virginie Saint-Martin), too. The cast is absolutely AMAZING. Everybody is shining. Moritz Bleibtreu (Knockin' on Heaven's Door)'s performance is superb. And Anatole Taubman, Tim Seyfi, Mark Ivanir (Schindler's List), Antje Traue (Woman in Gold) are amazing too. Go and see this movie today! You will learn some new things about the Holocaust, the biggest crime against Humanity. 10/10"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Samsa Film",
         "IGC Films",
         "Entre Chien et Loup"
      ],
      "summaries": ["David Berman and his friends, all Holocaust survivors, have only one purpose: to go to America as soon as possible. For this they need money. Close to his aim, David is not only deprived of his savings but also overtaken by his shady past."],
      "budget": 0
   },
   "movielensId": 175973,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2017-04-06",
      "dvdReleaseDate": null,
      "directors": ["Sam Garbarski"],
      "runtime": 102,
      "movieId": 175973,
      "title": "Bye Bye Germany",
      "mpaa": null,
      "actors": [
         "Anatole Taubman",
         "Moritz Bleibtreu",
         "Joel Basman",
         "Tim Seyfi",
         "Antje Traue",
         "Joachim Paul Assböck",
         "Heike Hanold-Lynch"
      ],
      "imdbMovieId": "5609734",
      "originalTitle": "Es war einmal in Deutschland",
      "genres": [
         "Comedy",
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "David Berman and his friends, all Holocaust survivors, have only one purpose: to go to America as soon as possible. For this they need money. Close to his aim, David is not only deprived of his savings but also overtaken by his shady past.",
      "tmdbMovieId": 434166,
      "avgRating": 3.5,
      "releaseYear": "2017",
      "numRatings": 2,
      "posterPath": "/voHSbvdqkyplJkrhp9E6SvUOBt7.jpg"
   }
}