{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "moon",
            "id": 305
         },
         {
            "name": "nudity",
            "id": 2483
         },
         {
            "name": "exploitation",
            "id": 2804
         },
         {
            "name": "nudism",
            "id": 10031
         },
         {
            "name": "sexploitation",
            "id": 10053
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "outer space",
            "id": 12405
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0056293",
      "video": false,
      "title": "Nude on the Moon",
      "recommendations": [],
      "backdrop_path": "/5xA6qL6hL93FemsrW57gvUyEdz2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1004,
               "character": "Cathy / Moon Queen",
               "gender": 0,
               "credit_id": "52fe47ddc3a36847f814c7e5",
               "name": "Marietta",
               "profile_path": null,
               "id": 1039467,
               "order": 0
            },
            {
               "cast_id": 1005,
               "character": "Professor Nichols",
               "gender": 0,
               "credit_id": "52fe47ddc3a36847f814c7e9",
               "name": "William Mayer",
               "profile_path": null,
               "id": 1039468,
               "order": 1
            },
            {
               "cast_id": 1007,
               "character": "Dr. Jeff Huntley",
               "gender": 0,
               "credit_id": "53ab39b9c3a3684bcf00043d",
               "name": "Lester Brown",
               "profile_path": null,
               "id": 149923,
               "order": 2
            },
            {
               "cast_id": 1010,
               "character": "",
               "gender": 0,
               "credit_id": "53ab39dfc3a3684bb9000453",
               "name": "Pat Reilly",
               "profile_path": null,
               "id": 1334284,
               "order": 3
            },
            {
               "cast_id": 1012,
               "character": "",
               "gender": 0,
               "credit_id": "55f3904fc3a3686d07001993",
               "name": "Ira Magee",
               "profile_path": null,
               "id": 1508534,
               "order": 4
            },
            {
               "cast_id": 1013,
               "character": "",
               "gender": 0,
               "credit_id": "55f390579251417f76000fec",
               "name": "Lacey Kelly",
               "profile_path": null,
               "id": 1102549,
               "order": 5
            },
            {
               "cast_id": 1014,
               "character": "",
               "gender": 0,
               "credit_id": "55f390609251414a5d0017de",
               "name": "Shelby Livingston",
               "profile_path": null,
               "id": 99973,
               "order": 6
            },
            {
               "cast_id": 1015,
               "character": "",
               "gender": 0,
               "credit_id": "55f39069c3a3686cfd0017ef",
               "name": "Robert W. Kyorimee",
               "profile_path": null,
               "id": 1508535,
               "order": 7
            },
            {
               "cast_id": 1016,
               "character": "",
               "gender": 0,
               "credit_id": "55f39075c3a3680a0d001a5e",
               "name": "Joyce M. Geary",
               "profile_path": null,
               "id": 1508536,
               "order": 8
            },
            {
               "cast_id": 1017,
               "character": "",
               "gender": 0,
               "credit_id": "55f39082c3a36871ec001853",
               "name": "Charles Allen",
               "profile_path": null,
               "id": 1508537,
               "order": 9
            },
            {
               "cast_id": 1018,
               "character": "",
               "gender": 0,
               "credit_id": "55f3908b9251417f76000ffe",
               "name": "Evelyn Burke",
               "profile_path": null,
               "id": 1508538,
               "order": 10
            },
            {
               "cast_id": 1011,
               "character": "Lady in Parking Lot",
               "gender": 1,
               "credit_id": "558b724bc3a3687e680019e4",
               "name": "Doris Wishman",
               "profile_path": "/5L9OwxpsxxSJL8RlhwapzfFCSLk.jpg",
               "id": 116656,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47ddc3a36847f814c7d5",
               "name": "Doris Wishman",
               "profile_path": "/5L9OwxpsxxSJL8RlhwapzfFCSLk.jpg",
               "id": 116656,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47ddc3a36847f814c7db",
               "name": "Doris Wishman",
               "profile_path": "/5L9OwxpsxxSJL8RlhwapzfFCSLk.jpg",
               "id": 116656,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47ddc3a36847f814c7e1",
               "name": "Raymond Phelan",
               "profile_path": null,
               "id": 1039466,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53ab3988c3a3684bb900044f",
               "name": "Raymond Phelan",
               "profile_path": null,
               "id": 1039466,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55f390a89251414a56001747",
               "name": "Jack Caplan",
               "profile_path": null,
               "id": 1508539,
               "department": "Writing",
               "job": "Idea"
            },
            {
               "gender": 0,
               "credit_id": "55f390b59251414a5d0017f9",
               "name": "Martin Caplan",
               "profile_path": null,
               "id": 1508540,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "55f390bfc3a3686d270016ac",
               "name": "Doris Wishman",
               "profile_path": "/5L9OwxpsxxSJL8RlhwapzfFCSLk.jpg",
               "id": 116656,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55f390cec3a3686d03001998",
               "name": "Daniel Hart",
               "profile_path": null,
               "id": 211391,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55f390db9251414a6700166b",
               "name": "Raymond Phelan",
               "profile_path": null,
               "id": 1039466,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55f39100c3a36871ec001871",
               "name": "Ivan McDowell",
               "profile_path": null,
               "id": 1508541,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.407613,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50977,
      "vote_count": 4,
      "budget": 0,
      "overview": "A rich rocket scientist organizes an expedition to the moon, which they discover is inhabited by nude women.",
      "similar": [
         112160,
         634,
         8967,
         858,
         141,
         437557,
         17130,
         9946,
         50124,
         43923,
         10679,
         288036,
         80752,
         28468,
         242224,
         1826,
         8675,
         129139,
         41282,
         258480
      ],
      "original_title": "Nude on the Moon",
      "runtime": 83,
      "poster_path": "/jI3SF3xBJ7AJvJi59wKUHMqglmw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Moon Productions",
         "id": 63074,
         "origin_country": ""
      }],
      "release_date": "1961-01-01",
      "vote_average": 3.3,
      "belongs_to_collection": null,
      "tagline": "A truly different adventure!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Raymond Phelan",
         "Doris Wishman"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Jack Caplan",
         "Raymond Phelan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056293/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZmYyNzYxYjYtYzNlZC00OWY2LWI4YjAtYWNmMGViMjM3NjFiXkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Marietta",
         "William Mayer",
         "Lester Brown"
      ],
      "reviews": [
         "Doris Wishman belongs to that category of film directors that include Russ Meyer, John Waters, Herschell Gordon Lewis and Ed Wood. These are film-makers who make movies that are simply uncategorizable. Either you get it or you don't. In \"Nude on the Moon\" the moon looks suspiciously like the Coral Castle in Florida and is inhabited by a bunch of nude women with flabby bodies and bad hair. Nothing much happens. You just get to ogle. The movie is about boobies. Never has nudity been more wholesome. This is a nudie pic for the whole family. Your children can sit and watch it and laugh right along with you. There's nothing offensive. What a great way to dispel unhealthy attitudes towards the human body! You can teach your kids not to have a snickering, lewd attitude towards their bodies and to accept them as a natural part of life. Then they'll get bored and leave to go do something else while you sit there amazed that such a wiggy movie ever got made. With a Doc Severenson theme song! I also appreciated how this movie so accurately depicts what life is like on lunar nudist colonies. If any of you have ever been, you will understand. Don't you get sick and tired of Hollywood misrepresenting nudity in outer space? I do.",
         "If there were an Oscar category for most sincere performance in a ridiculous movie (and there should be!), Lester Brown and William Mayer would surely have been nominated for their work in Doris Wishman's \"Nude on the Moon,\" a jaw-dropping sci-fi \"nudie cutie\" in which Brown and Mayer play a pair of intrepid astronauts who discover the first interplanetary nudist colony. Brown, a handsome Wishman veteran who also appeared in Doris's \"Blaze Starr Goes Wild\" (1960), \"Gentlemen Prefer Nature Girls\" (1962), and \"Behind the Nudist Curtain\" (1964), plays dedicated young scientist Jeff Huntley, who decides to use his $3 million inheritance to finance a trip to the Moon along with mentor and colleague William Mayer (i.e., the \"Professor.\") One of the amazing things about the film is the amount of time and care devoted to its exposition and set-up. The extended opening sequence is surprisingly well written, and is easily on par with any sci-fi \"B\" movie from the early sixties. Brown and Mayer are credible and convincing throughout, which only makes the lunacy (no pun intended) all the more surreal. Their straight-faced, deadpan performances help make the film the giddily preposterous gem that it is. Top billing is afforded nudie model \"Marietta,\" who appears in the double roles of Brown's secretary, Cathy, and the Moon Queen. She was obviously cast on account of her physical attributes, yet she's actually a decent actress, and her brief scenes as Brown's lovestruck secretary are sincere and believable. The film opens with a cheesy and inexplicably lengthy shot of the twinkling heavens as might be viewed from the moon, accompanied by Judith J. Kushner's catchy title song, \"Moon Dolls,\" sung by Ralph Young, who would later partner with Belgian singer Tony Sandler to form the famous recording duo of Sandler and Young. (Another interesting footnote: Doc Severinsen of Johnny Carson's \"Tonight Show\" not only contributed to the musical score but also appears in the cast list, though I challenge anybody to recognize him as one of the half-naked \"moon men.\") One of the great things about this movie is the sunny, Florida-travelogue photography. And there are one or two beautiful and almost breathtakingly unconventional shots of our heroes driving along rain-slicked Miami blacktop under a menacing canopy of thunderheads. There's also a clever in-joke that occurs whilst our intrepid astronauts drive through Miami Beach on their way to the launch pad. Just as Clint Eastwood walked past a movie marquee advertising the Eastwood-directed \"Play Misty for Me\" in Don Siegel's \"Dirty Harry,\" Brown and Mayer drive past Miami Beach's Variety Theater, the marquee of which is emblazoned with the title of another Doris Wishman film, \"Hideout in the Sun\" (in \"Nuderama!\") The great drive-in movie critic Joe Bob Briggs listed \"Nude on the Moon\" as one of his \"Sleaziest Movies in the History of the World,\" however I would respectfully disagree. For sheer sleaze, the film hardly measures up to Wishman's \"Bad Girls go to Hell\" (1965), \"The Amazing Transplant\" (1970), or her latest offering, \"Satan was a Lady\" (2001). In spite of the liberal above-the-waist nudity, \"Nude on the Moon\" is one of the least sleazy movies I've ever seen. I've seen many films with far fewer bared breasts that were a thousand times sleazier. If anything, this most famous of Wishman's films strikes the viewer not with its venality but its astounding innocence. One of the most interesting things about the film was that it was shot at the oddball south Florida tourist attraction, Coral Castle, the bizarre history of which is detailed in Florida journalist Eliot Kleinberg's entertaining book \"Weird Florida.\" Coral Castle was also used as a location in James L. Wolcott's \"Wild Women of Wonga\" (1958) and Herschell Gordon Lewis's obscure fantasy opus, \"Jimmy, the Boy Wonder\" (1966). Cult fans will immediately recognize blonde cutie Shelby Livingston in a non-speaking part as one of the fetching \"Moon Dolls.\" Shelby is best remembered for her role as disaffected housewife Bea Miller, who gets her arm hacked off in H.G. Lewis's southern-fried gorefest, \"Two Thousand Maniacs.\" A delirious mixture of campy humor, harmless nudity and Florida kitsch, \"Nude on the Moon\" is a priceless cinematic gem from a more innocent time. A silly, wonderful, charming little film.",
         "Wow! This movie has it all! Get this: Two scientists go to the moon, in the dodgiest of rockets, and discover nudie (well, okay, topless then) space girls! One of them falls in love with the Empress of the Moon ( a dead ringer for his secretary back on Earth). The professor has got to be seen to be believed. See the two men sitting next to each other and communicating with each other via radio headsets! See the worst space suits ever! See the amazing professor enthuse about plants as moon girls play topless volley ball! Witness very spacey dancing from some of the weirder lunar lovelies! The only movie that makes the Queen of Outer Space seem like 2001! A true kitsch classic, and you can take that from a man who knows his cheese. Nineties remake, anyone?",
         "It takes a lot to make me laff out loud during a movie, but this flick certainly did the job. Beyond-belief atrocious acting; a \"script\" that'll make you pine for the wit and wisdom of Edward Wood; special effects that make \"Plan 9\"'s look like \"The Matrix\"; a bunch of topless, football-tossing, antenna-sporting, average-looking-at-best \"moon babes\"; a virtual lack of synchronized dialogue; and an annoyingly catchy theme song all add up to one completely unbelievable experience. Just wait till you see the two \"scientists\" talking to each other in their Earth-bound spaceship, using microphones despite the fact that they are SITTING RIGHT NEXT TO EACH OTHER!!! You'll fall right off your Barcalounger! Seriously, though, folks, despite the laffs, this one was kinda hard to sit through. It really is baaaaaaaaaaaaad! Do yourself a favor and watch \"Queen of Outer Space\" for the 15th time instead!",
         "The best thing about 'Nude On The Moon' is the title, which promises kitsch fun that the movie never quite delivers. It's one of those \"legendary\" cult movies that you only really watch so that when someone at a party asks you if you've seen it you can say \"yes, I have\". The late Doris Wishman made a few Chesty Morgan pictures and other sexploitation movies that fans of the genre rate highly, but this is from her early, much more innocent nudie period. Watching this movie you must keep in mind that it was a big deal at the time to get to see some breasts in a movie. That's the only reason this film exists! Instead of the usual peek at clean living nudists concept quite common during this period, Wishman uses a sci fi \"twist\" to basically make yup, you got it, a clean living nudists movie. Only these gals are \"Moondolls\" and live on (obviously!) the Moon. The movie only goes for 70 minutes but the two knucklehead scientists (Lester Brown, William Mayer) take 20 minutes to get to the freakin' moon, and another five are wasted before we get see any naked women. Well okay, no-one's actually naked, just topless. Most of the Moondolls aren't that fetching, but their queen/goddess (played by Marietta) is actually pretty hot and has a great pair of lungs. The younger and stupider scientist doesn't seem to notice that she looks like his secretary back home, Cathy (played by, yes, Marietta), who of course is secretly in love with him, but I'm sure you can guess how the movie will end waaaaay before he does. I've sometimes heard 'Nude On The Moon' being inexplicably described as \"sleazy\", it's anything but. Russ Meyer it ain't! The movie is so lightweight and innoffensive nobody but a total prude would even blink at it. Unfortunately this makes it very dull viewing.",
         "Well... what can I say, the title gives it away, sort of. It's just a bunch of topless girls on the Moon (well actually, someone's backyard), and a duo of lousy and unprofessional astronauts who have enough money for rocket fuel yet cannot afford air-locked helmets. Oh and one of them falls \"deeply in love\" with the alien queen, though she never spoke to him. Maybe it was his first time seeing a topless woman. All in all, the only reason this movie was made is to show topless women in a time when such a thing was extremely rare in cinema. As such it is now outdated, and watched for camp value, or if you have a fetish for 60s women, but then again there are a lot better 60s sexploitation flicks out there.",
         "I've seen hundreds of B-grade movies and have never seen one as hilariously \"bad\" as this one! There were parts I laughed harder at (the scientists talking to each other on CB's when they're right next to each other, the topless moongirl who eats the candy bar wrapper instead of the candy bar) than ANY other movie I can think of! Monty Python included! Just to give you a little taste, when they leave Florida in their rocket and land on the moon, the \"moon\" looks exactly like Florida with palm trees and grass and trees and everything! Too funny for words. If you are an enthusiast of B-grade cinema, I couldn't recommend a film more frighteningly \"perfect\" in everything movies of this type have to offer! Laughs galore, off-the-wall plot, horrendous scenery and costumes, awful acting... it's amazing!!",
         "Nude on the Moon (1961) * (out of 4) A couple scientists invent a rocket-ship and head off for the moon. Once there they love the fact that there are naked woman standing around everywhere. This Doris Wishman film, for some reason, has a minor cult following but I really wouldn't tell you why. Some people talk about the various changes or firsts that were done with this \"nudist\" picture but I guess they were watching something other than me. Yes, most nudist pictures in their Golden Era just had a camera wondering around and capturing whatever nudity they could. In my humble opinion, the \"nudist\" film has to be the worst sub-genre ever made and certainly has the most number of awful films. Perhaps I'm being too hard on nudist films because, after all, it wasn't as easy to see nude bodies as it was today but at the same time you'd think directors would come up with better ways of showing it. I mean, the stories to these films are just downright awful and the majority of the time we're just given the thinest of plots and a cheap reason to capture the nudity. This film does feature a wrap-around story with the scientist making the rocket and so on but it doesn't add anything to the film other than a longer running time. I will at least admit that the majority of the people naked here are good looking, which is a step up from some of the movies I've seen but outside of this there's no reason to watch NUDE TO THE MOON unless you're just trying to see everything Wishman did.",
         "Leave it to the ever-daffy Doris Wishman to concoct one of the single most campy and inane soft-core nudist romps to blithely bounce its way onto celluloid. The ridiculous story alone promises one heck of a gut-busting good bad time: Brilliant scientist Dr. Jeff Huntley (hunky Lester Brown) and his friend Professor Nichols (a lively and engaging performance by William Mayer) go to the moon on a rocket ship they built themselves and discover that it's inhabited by shapely naked telepathic women. While this picture is loaded with wall to wall topless gals (buxom brunette Marietta in particular provides a yummy eyeful as the Moon Queen), said plentiful nudity gets presented in such a pleasant and unabashed way that it somehow comes across as sweet and harmless rather than crude and leering. Moreover, the dubious science (bet you didn't know that the moon has an abundance of verdant green foliage on it!), the laughably chintzy (far from) special effects, the incredibly shoddy bargain basement space suits, and the sheer jaw-dropping absurdity of the plot further enhance this honey's considerable kitschy charm. Raymond Phelan's vibrant color cinematography gives this picture a pleasing lush look. Daniel Hart's peppy jazz score and the groovy lounge theme song both hit the swinging spot. A complete dippy hoot and a half.",
         "*Spoiler/plot- 1961, Nude on the Moon, When the NASA moon missions first landed August 1969 on the moon, they only found a dead rock. They should have gotten there back in the swinging' 1960s, when Doris Wishman, the film's director, did. The moon was filled with delightful nudists enjoying themselves! The amazing moon-ladies are just like earth-women, except for their extraordinary telepathic powers and cute head antennae, and their penchant for nudist life. *Special Stars- Marietta as the moon goddess. Doris Wishman directed this special kind of film genre of the time. *Theme- Moon people are not inhibited. Earth people are. *Based on- South Sea Island travelogues. *Trivia/location/goofs- The film was made at the tourist stop, Coral Castle in Florida. The USA astronauts moon suits are hilarious. They are made of studded canvas, ant sprayer bottles and toy helmets. Doris Wishman directed five films to advertise the benefits of being a 60's nudist. Interesting to see what was the normal nude body type in the society then, heavy than todays plastic surgery soaked society. When Dr. Huntley and the Professor are driving to the launch site, they pass the Variety Theater, which is showing Hideout in the Sun (1960). That film, which was Doris Wishman's first movie (Nude on the Moon was her second). *Emotion- Great camp and not the nudist kind, either.",
         "This movie has a great premise! Astronauts undertake on a mission to the moon. When they reach their destination, it appears to be overrun by dishy females in the nude. Setups for dramas of life and death, of love and betrayal... but no payoffs! The great disappointments of this gem of the sixties is that it forgets its story upon reaching the moon. Instead we see lots and lots of barely dressed girls having a good time. This plot-turn would be quite understandable if they were in fact nude, but compared to modern times, we see no more that one might hope for at a public beach. However the dialogues are amusing, and the production-design is unforgettable. \"Nude on the Moon\" leaves one with the hope for a modern remake (true to the title) that dares to challenge modern day Hollywood from its current puritan \"make war not love\" attitude and show the american youth that it is no bigger shame to flash their butts and on celuloid. Unfortunately: they dont make them like this anymore!",
         "A year after Jack Kennedy proposed going to the moon, this little thing appeared, presumably in the few city theaters that skirted pornography laws by showing fake documentaries of nudist camps. Some camps encouraged filming in a combination of exhibitionism, funding of their camp and (for some) promoting the paradigm. Porn crusader Doris Wishman's first films slid into this genre, stretching it by adding a story. The story in this case is in the class of several others that are designed to be acceptably cheesy. In this case, two clearly inept scientists doze off while in their \"ship.\" We see things from the younger scientist's mind, where he imagines just what you'd expect: a destination with simple, lovely topless women. Like \"Robot Monster\" and a dozen others I've seen this year, most recently \"Harriet the Spy\" which shares other characteristics with this. The oddest thing is how unattractive (and old) are the women, though the men are thoroughly buff. Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.",
         "This is a remarkable look at what passed for racy in 1961. Though it promises sex, it actually delivers a healthy suntanned nudist colony travel flick set in South Florida. The amount of cheap is astounding! The rocket ship interior is actually an old DC-6 prop job probably left to rust at Opa Locka airport near Miami. The moon colony is Florida's wierdball Coral Castle (though the director did manage to not show the traffic passing on nearby US 1.) The space helmets and rockets are toys available in any toy store of those years (I played with some in the film as a kid.) and the spacesuits are paper mache. I doubt the producers paid any of the nudie cuties (some not so cute), probably harvested from an actual nature colony, several of which are still located in the area. Science is totally ignored as the moon has not only Earth gravity, but also blue skies and white fluffy clouds that look like, um, South Florida. And the supposedly unmarried star actor hasn't bothered to remove his wedding ring. The best thing about the film was the cool 1959 Pontiac convertible the stars drive to the spaceport, even if it does have a dent in the left side. Still, the film was good for a laugh, and a sense of awe of what could be passed off as a theatrical flick in those days. Get it from Netflix. What can you lose?",
         "\"Nude on the Moon (1961)\" - A Review (incl. major SPOILERS) Recently, I've had the pleasure of viewing a true masterpiece of lunar (s)exploration with a friend of mine. (A female friend ... damn your assumptions! #feminism) I will not go into the fact I was able to predict the story 15 minutes into the movie - the protagonists flies to the moon, falls in love with a \"moon doll\", comes back to Earth, realises his secretary looks similar to the alien and gets together with her (because physical resemblance obviously suffices). I will also not go into the fact that the dialogue felt like a single pace dialogue between \"Siri\" and the Google assistant, because dialogue became irrelevant once they laid eyes on the anthropomorphic semi-naked aliens and was replaced by sporadic phrases like \"Get a good shot of her!\", \"Take a picture again from a different angle!\" and \"We have a lot of useful data!\". (I presume the last of these sentences was supposed to be followed by \"... for a nude calendar!\".) I could also talk about how the two token men and little children on the moon (the only fully naked individuals in the entire film) were probably placed there by the director(s) to hide the fact (s)he is making a soft porn movie. (Yes, a female (co-)director ... damn your assumptions! #feminism). But I won't ... just as I won't go into the fact the director invented all kinds of activities for these lunar beauties, so that their breasts could get a little more screen time. Instead, I will talk about what I think really happened. Consider the following details: 1) The movie shows that the secretary of these two delusional entrepreneurs is madly in love with the ambitious protagonist, who unfortunately only has science on his mind (at least until he's on the moon and gets hit by gold fever and then gets hypnotised by the lunar ladies - something his colleague continuously tries to prevent by reminding him \"Jeff! We are here #forScience!\"). 2) All the \"useful data\" is lost as they leave the moon in a rush due to oxygen shortage (though they never truly inhaled anything from their oxygen tanks), i.e. the camera with nude pictures was left behind. Thus they were never able to prove that they were on the moon - not that pictures of topless ladies under Earth-species palm trees are much proof. 3) At the end, they point out that NASA investigated their space craft and don't believe it ever left Earth (or is even capable of it.) 4) Before the landing on the moon, they pass out, so they actually miss it. There's one way we can make sense of all this. I believe they were never truly on the moon! The secretary faces two problems: She's not being noticed by her love, and there's a risk she may lose him in a failed rocket launch due to his delusions. So what can she do? Days before taking off to the moon, the secretary drugged the many mysterious liquids you see and hear bubbling away as the boys discuss most intriguing science (such as the spacecraft not being able to survive temperature fluctuations on the moon after actually having been in much colder space and on a hotter Earth). As they get into the useless piece of scrap metal, the drugs begin to work and they pass out. Time for the real \"trip\" to begin! They get out of the rocket and explore Miami. The environment is the exact same they saw when leaving Earth, but they believe it is the moon, pick up regular rocks and believe them to be gold. But now: Showtime! The secretary takes off her top and hires a few FKK enthusiasts (non-Germans: look it up!) to also play along. (You can tell they usually wear a bra because of conspicuous tan lines). She plays the mute queen of the moon and the drugged protagonist falls for it. She gives him everything he desires in a woman: Naked breasts and no talking! (#feminism) Once he decides he is absolutely in love, she makes them think they are running out of oxygen. They arrive back on Earth. He's love sick, sees her, pictures her as the naked mute queen and apparently thinks \"That'll do\". Her plan worked! There are numerous other clues that support this story, such as the obviously fake and sloppy model of the Earth they see after the launch - no doubt it was placed there by the secretary. Voila, mesdames et messieurs. *curls beard*. This is undoubtedly how it happened. It appears Hercule Poirot once again exercised his little grey cells to solve yet another complex mystery.",
         "If you have to watch a dull 1960's nudie/topless movie I'd recommend \"Orgy of the Dead\" written by Ed D. Wood, Jr. anyday, anytime over this horrible flick. Both are pretty rotten, but \"Nude on the Moon\" doesn't have as much going for it. I lost track of how many times the opening theme song was played in this 70 minute movie. \"Nude on the Moon\" is nothing special.",
         "Nude on the Moon is currently available as part of Joe Bob Briggs' \"Sleaziest Movies in the History of the World\" video series. And they don't come any sleazier than the films directed by the prolific Doris Wishman, who's been churning out soft-core and hard-core since the early 1960s. A series of cheesy special effects transports the main characters to the Moon, which looks more like an unpaved highway. Amazingly, it turns out that the moon is inhabited. Even more amazing, given the temperature extremes on the lunar surface, is that everyone is naked. My Rating:1/10",
         "This has got to be one of the cheesiest films ever. But it's great for that alone! Awful script (what there is of it), awful \"effects\", and awful-looking bodies! But hey, what else do you want for night-time viewing?! Watch it, it's an experience.",
         "This must be be one of the most wickedly funny films ever made - and I have to hand it to the Yanks because I really don't think any other country could come up with anything more ridiculously sublime - only in the land of the free and the home of the brave could an elderly randy scientist inherit enough cash from a deceased relative to mount his own personal moon landing project - and be accompanied of course by his equally randy but impoverished protégé. What follows is delightfully preposterous yet totally inevitable: a range of fairly well endowed women wearing bikini briefs and nothing else, who, when presented with a chocolate bar eat the wrapper and discard the chocolate. As another commentator has observed (I paraphrase ) if this is pornography it is pornography for all the family - totally inoffensive; and yes, if you are really hard up, possibly a bit of WM if you can cast your mind back to what was available in 1961.",
         "First, there are no nudes in the film exactly. In the day, it was likely considered a porno film but all you get to see are some topless men and women. Second, it's not NUDE but, perhaps, nudes, as there are about a dozen of these scantily clad men and women. As for the movie, it's about what you'd expect for an old fashioned porno film--a bit of skin, little in the way of plot or production values and a really silly film. In other words, it's less titillating and more laugh-inducing. The film is about a couple amateur rocket scientists who decide to beat NASA to the moon. You mostly see a lot of bad acting, dull plot and stock footage in the first half and then a lot of topless ladies from then on...and all of it is handled clumsily. In fact, the actors don't even talk--their voices are just pasted onto the film and the lips don't even seem in sync at all! The only reasons to see this are to either have a good laugh or see one of the only films ever made at the weird Coral Castle in Homestead, Florida."
      ],
      "genres": [
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Moon Productions"],
      "summaries": [
         "Dr. Huntley and Professor Nichols are able to complete their work on a moon rocket because of an unexpected inheritance. They travel to the moon, but find a lush garden paradise rather than a barren wasteland. They are captured by virtually naked telepathic humanoids and taken in front of the Great Council. The Moon Goddess decides they should be allowed to continue their experiments, and Dr. Huntley begins falling in love with her. Professor Nichols worries about getting Huntley to return to earth.",
         "Two men pilot their own rocket to the moon. They find it inhabited by people wearing briefs. (The people are actually semi-nude on the moon.) The first 25 minutes is dedicated to the two men planning the trip. The next 35 minutes is a type of musical voyeurism. They go home but forget to take the evidence, and no proof that they went anywhere.",
         "A rich rocket scientist organizes an expedition to the moon, which they discover is inhabited by nude women."
      ],
      "budget": 0
   },
   "movielensId": 175989,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1961-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Doris Wishman",
         "Raymond Phelan"
      ],
      "runtime": 83,
      "movieId": 175989,
      "title": "Nude on the Moon",
      "mpaa": "",
      "actors": [
         "Marietta",
         "William Mayer",
         "Lester Brown",
         "Pat Reilly",
         "Ira Magee",
         "Lacey Kelly",
         "Shelby Livingston",
         "Robert W. Kyorimee",
         "Joyce M. Geary",
         "Charles Allen",
         "Evelyn Burke",
         "Doris Wishman"
      ],
      "imdbMovieId": "0056293",
      "originalTitle": "Nude on the Moon",
      "genres": [
         "Comedy",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["j10DGbmMvWE"],
      "plotSummary": "A rich rocket scientist organizes an expedition to the moon, which they discover is inhabited by nude women.",
      "tmdbMovieId": 50977,
      "avgRating": 1.5,
      "releaseYear": "1961",
      "numRatings": 1,
      "posterPath": "/jI3SF3xBJ7AJvJi59wKUHMqglmw.jpg"
   }
}