{
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 175,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181199/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ3NTk2MDk3N15BMl5BanBnXkFtZTcwMzgwNjgyMQ@@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Mili Avital",
         "Alan Bates",
         "James Frain"
      ],
      "reviews": [
         "Wow. Somehow I had gone through the winter without seeing a trailer for \"Arabian Nights,\" which was why I was all the more astounded when I caught it on tv that Sunday night. This is pure myth-and-magic candy, people, but unlike most effects-laden tv-series, it gets better. A lot better. Okay, so it gets a little anachronistic at parts, but what really blew me away was the frame tale that held it all together. Scheherazade was played to an intelligent, beguiling perfection by Avital, and Scott was simply spectacular as the half-mad Schariar. These two had great chemistry, and their interactions made for some electric, yet subtle, scenes. Their characters -- and characterizations -- were great, better and more complex than what you normally get in this genre of telemovie-making. It's a beautiful escapist fantasy with lead characters to root for. Music was on point, direction was well-stylized (though gimmicky and will probably be dated in a little while), performances top-notch without the actos taking themselves too seriously. If you want some classy, sexy, mystical entertainment, give \"Arabian Nights\" a try. You won't regret it.",
         "\"Arabian Nights\" is continuing proof that it is possible to put together a highly entertaining, superbly-acted television program with a cast of primarily lesser-known actors and actresses. The performances in the movie are almost uniformly first-rate. For example, John Leguizamo is hilarious and totally believable as Aladdin's genie(s), and far better than Robin Williams' portrayal in Disney's \"Aladdin.\" Mili Avital is enchanting as Scheherezade, and Dougray Scott and James Frain are terrific as the warring brothers Schariar and Schazenan (an interesting re-telling of the original base story line). The ever-reliable Rufus Sewell and Alan Bates give very enjoyable portrayals of Ali Baba and the Storyteller, respectively, and Jason Scott Lee gives a very amusing turn as Aladdin. I particularly enjoyed the segment of the constantly fighting Princes of Yemen, Ali, Ahmed, and Hussain (played with gusto by relative unknowns Alexis Conran, James Callis, and Hari Dhillon). While it is the acting that really shines in \"Arabian Nights,\" the set designs and costuming are truly magical. The special effects are also very good considering the budget limitations of the small screen. If you're going to rent or buy this on video/DVD, be careful to find the 175 minute version. I don't know what they cut from the shorter version, but honestly you won't want to miss ANY of this marvelous TV movie. I really hope that Hallmark decides to do a sequel to this with a few more of the tales from the Arabian Nights. There is certainly a precedent for it with the \"Sarah, Plain and Tall\" films.",
         "I want to take this opportunity to say \"Arabian Nights\" is perhaps one of the best made-for-TV movies I have ever seen! It is a wonderful mixture of fantasy, special effects and marvelous tongue-in-cheek comedy, and should be seen by anyone who has ever thought he/she already knew this classic story! My only regret is that it isn't a full-length motion picture, as the big screen would have absolutely come alive! Congratulations to its producers, director and stars!",
         "This was a fabulous production. No movie can do justice to the entire story of \"Arabian Nights\", but this did an admirable job. The visual effects were stunning and the actors were well cast. The way the production moved back and forth between the stories and the storyteller's (and listener's) situation was very creative (reminded me of \"The Neverending Story\"). The humorous sections and modern jokes were unexpected, but fun and not overdone. My only complaint was that the end came too soon -- after 4 hours I still wanted more.",
         "Some of these network special-effect tv movies have been rather cheesy in the past, but I was very impressed with Arabian Nights. Not only am I a Dougray Scott fan, but the story was done quite well. There's a point about halfway through when you wonder if the stories will come together and if the Sultana will survive after each story. But in the end, the stories all fall together and actually make sense to what is going on in each scene. Well done!",
         "One could think of a TV series, especially one intended for young audiences, that its quality will not match that of a movie for the big screen. That is false for Arabian Nights. Starting with a solid and well-balanced plot, good acting, superb photography and truly inspired music, plus beautiful filming locations, fantastic dressings, special effects and some touches of humor on an epic drama, all you get is top quality entertainment for all the family.",
         "EXCELLENT! EXCITING! BEAUTIFUL! CAPTIVATING! BREATH TAKING! These are just a few of the words that I can think of to describe the television film of Arabian Nights. My whole family just loved it. This production was absolutely perfect in every way imaginable, from start to finish; ABSOLUTE TOP QUALITY. I deeply respect and appreciate all of the creative hard work that went into making this wonderful entertaining epic. I wish that there would be a way I could say thank you to all of these creative people that brought this to the television audience.",
         "Spoilers herein. One key to master storytelling is the art of folding. That includes all sorts of techniques of overlapping narrative, spanning from overarching metaphor to stories within stories. It is an ancient technique, as old as any story we know. It is especially present in the 'Arabian Nights' stories, signified by what's inside the lamp. The writer of this film understood the singular advantage of the material and made changes to emphasize the folds: the warring genies played by the same actor; the many bleeds between the framing story and the inner stories, and most particularly in the outer framing layers. The whole thing could be what we see from the magical giant, or what his wife whispers in his ear, or how the interloper makes love... or what the teller in the market tells, and that's well before you get into Scheherezade's double nesting: telling the story to her kids and/or telling to her husband. Once you have that, you have a success. Add in some beautiful faces (Vanessa Mae), some lush (but somewhat comic) costumes and really successful locations, and you've got something that works, even in the face of imperfect directing and pacing. One thing that's wonderful about these stories, the originals, is how they cover the 'orient.' This is extended here in referencing locations an peoples in various Arabian locations plus, Persia, Africa, China, even Tibet. Ted's Evaluation -- 3 of 3: Worth watching.",
         "Lush and colourful mini-series based on the classic \"1001 Nights\". The framework works nicely; the harried sultan, initially all sweat and paranoia, set on the path to redemption by his new wife Scheherezade (Mili Avital, who is just exquisite), who must maintain his interest by telling him stories or be executed. It left me wanting more, so by that measure at least the film is a success. Cameos and star turns abound in this enormous production and refreshingly for a Hallmark miniseries, the slant is more English than American. The humour and dialogue can be just a bit twee at times (one almost expects Hugh Grant to peep around the curtain at any moment) but like Turkish delight, this film is sweet but not sickening",
         "Arabian Night also belongs to one of the fantasy-movies which you can also put in the table with Sinbad and the 10th Kingdom. Arabian Nights is a very interesting and nice movie to watch because it takes you to a world of fantasy and mystic, in which the stories told by an Arabian woman, form actually the movie. So we will find the famous stories about Ali Baba and Aladdin and his wonderlamp. The other day i bought this movie and i don't regret it. I think that a 8 out of 10 is a qualification Arabian nights deserves because i enjoyed it 3 hours long. Don't think too much and let yourself lead back to the old legends of the Middle East, you won't regret it.",
         "Im a movie freak, i watch movies all the time expecially TV movies... but when it comes to fantasy movies im all over them. i recorded this movie and watch it hundreds of time and nevergotired.. this is the kind of movie that it doesn't matter how many times you watch it you;ll enjoy it and even be surprise by the ending cuz its pefect everything falls in!!! And the actors all are Perfect for the movie, the scene, and the time in history!! And a perfect movie to watch with your family.",
         "For a TV production, this rendition of \"The Arabian Nights\" is far above the average in almost every respect. The CGI is magnificent, the acting is superior - particularly by the versatile and underutilized John Leguizamo as a bad-tempered genie and his overweight, barely competent supernatural rival, and the Peter Barnes's narrative structure is unusually sophisticated for Hollywood. So the problems with this production are especially regrettable. The various threads of the story are confusingly presented, with needlessly abrupt and disorienting cuts from one to another. This certainly interefered with my enjoyment. The other problem, which may not bother others, is the very frequent use of modern allusions (like a comic monkey-wrench in the hands of a genie) and ironic attitudes. This sort of thing can be amusing in moderation, or in an animated cartoon like Disney's \"Aladdin\" where no level of realism is expected. But here it clashes with the gorgeous imagery and the generally \"realistic\" style of storytelling. As somebody else has mentioned, there's also a problem with pacing. Events, while never boring, often lose their momentum in magnificent visuals and trivial dialogue. Altogether, though, \"The Arabian Nights\" is well worth seeing, though some of the bizarre images may disturb very young children. Otherwise it really is a show \"for the entire family.\"",
         "I have been worked in the production in this movie, pity my name is not on credits being Assistant to Production Manager and somewhere, transport coordinator and 2nd. unit assistant at war scene's. The whole production was a great experience for me and fun most of the times if you ignore the non stop work and run.... Unfortunately it was the only movie shoot at Antalya Film Studios which is a great and brand new studio. We have been working over 3 months at locations in Cappadocia where I live now. I do watch the film time to time and still enjoy fully, knowing the inside information the set and the characters etc. I did buy a lot of props from the movie and have pictures, raw video materials etc. Do you think one can sell those on e-bay etc. I have more than plenty... So I can spare some out. If you did not watch the movie yet its well worth it to find a copy and watch. Happy viewing, Murat",
         "It was one of the most enchanting movies I've ever seen. It draws you in and holds you there. It has everything, action, romance, comedy. You cheer for the good guy, and boo the bad. None of the damsels are in distress, they heal it. three thumbs up.",
         "This is (once again) a loose version on the Nights theme, and is not the story collection known by most fans of the works. There are so many departures from the original that it would be ridiculous to list them all; however the dropping of the character of Dunyazad, Shahrazad's little sister to whom she actually tells the stories, is not only a great shame but it has created a problem, because it has left Shahrazad telling the stories directly to the King; thus making the film script less credible than the original. Shahrazad is depicted as being the first potential victim of the Sultan's wrath, rather than the one to break the mold of his killing spree; thus making Shahriar seem more of a nice guy than he actually was. A handy way of removing the most distinctive characteristic of one of the cruellest kings in literature also partially removes Shaharazad's underlying motive for telling the stories in the first place, because in the original Shahriar's track record has been proven and the city has been nearly decimated of available young ladies. However, the chosen script has been acted well and looks visually stunning, helped by magnificent Turkish and Moroccan backdrops. In the first part of the film Shahrazad tells the tales of \"Ali Baba\", \"The Hunchback\" and \"Aladdin\". Only the first half of the tale of \"The Hunchback\" is told, which is a shame because it has been done well; and I was looking forward to \"The Story of the Tailor\". Curiously the character of \u0091the Christian' was replaced with a totally out of place Englishman (who just happened to be wandering through Basrah in the 11th century). In this movie Aladdin's cave is filled with terracotta warriors rather than treasure! These warriors are guarding the lamp, which is therefore quite easy for Aladdin to find because its position behind the statues is obvious. The second part of the film concludes the story of \"Aladdin\" (rather slowly) and tells the tales of \"The Sleeper Awakened\" and \"Prince Ahmed and the Fairy Peri Banou\". \"The Sleeper Awakened\" is in fact a telling of a part of the original, this version ending with the Polonius-like death of the eves-dropping Haroun Al-Raschid. Also in this part an invented dispute between Shahriar and his brother Shahzaman becomes more and more intrusive. NB. Shahriar was a Persian king; not an Arabic sultan - and his capital may have been Ctesiphon. It certainly was not Baghdad, which was not built until 762 AD, 121 years after the end of the Sassanid dynasty. Whilst this is enough of an inaccuracy, the original story actually implies that he ruled the eastern half of the Sassanian empire and Shahzaman the western half, so his capital may well have been much farther east - after all we are told in the prologue that Shahriar \"lived and ruled in India and Indochina\".",
         "Since much is made in Arabian Nights of a cliffhanger ending that keeps you wanting more, it's ironic that after being thrilled by part one of Arabian Nights, Part 2 was not shown in New York when a war between ABC and Time Warner caused the ABC station to go off the air the night part two was supposed to air. I've been seething about it ever since, but at long last I have seen the whole thing (on the sci-fi channel, even though there's nothing remotely science fiction about the Arabian Nights) and I am thrilled. Arabian Nights is one of the best of those elaborate, special effects-laden fantasy TV movies Robert halmi Sr. has been producing since the success of Gulliver's Travels. The bookend story of the original book has been expanded, so the loose-knit collection of stories feel tightly woven together by the urgency of Scheherazade's plight. The stories themselves are wonderful, beautiful and magical and displaying the amazing sort of imagination one sees in the movies of Hayao Miyazaki. The movie is less star-studded than a lot of Halmi's films, or at least, many of the stars, being of eastern or African origin, aren't famous in the U.S., although for all I know they are all huge stars somewhere in the world. The cast is marvelous, particularly Mili Avital as Scheherezade and John Leguizamo in two very funny roles as as the movie's genies (although the genie of the lamp is a bit too hard to understand). This movies that is so amazing that it seems a shame it's TV movie status means it gets less notice than some inferior Hollywood fantasy. It is a must-see movie.",
         "The movie was a real turnon. I thought the costumes were Realistic for the period. The story though an old one is timeless. I truly enjoyed it . I have a few of Vanessa Maes CDs and appreciate her violin expertese.I had no idea she was so pretty. And young.",
         "Normally I put TV productions into a category of their own; very few of them stand a comparison with productions made for the big screen. There are however a notable few exceptions; most of them Brittish, like \"Prime Suspect\", \"Walking with Dinosaurs\" and \"Queer as Folks\". \"Arabian Nights\", a Jim Henson Production, is yet another one. I won't try to fool you; there are tracks left from the TV format and its commercial breaks. But the casting is good, the acting is excellent and the story is told in a quick but relaxed pace, with some interesting quirks. In short: It has all the sence of wonder you expect from a good story book.",
         "i bought this movie on dvd in a discount shelf, and it was worth every cent. i see ppl keep complaining about the story of aladdin, which _is_ originally a chinese story. and the book, is just a collection of fairytales from around the world, not only persian ones.",
         "Special effects vie with the actors in this spectacular mini-series. The essence of the long favorite tale of a sultana who thwarts death by telling tales of imagination and adventure is excellently protrayed. The tales (Ali Baba, Aladdin, etc.) are exotically diverse and entertaining. The level of humor injected is charming without being over the top.",
         "I wanted to see what sort of performance Dougray Scott would give in a movie that was not a blockbuster-type. Granted he is talented and i felt he gave an admirable performance as the Sultan who couldn't trust his own shadow let another person. One thing that put me off though was the accents, both his and Sheherazade's accents were awful - he sounds much like his characters from movies such as MI2, ever after etc they could have made an effort and had him learn to speak in a manner befitting someone from the middle east. Pronunciation of the Arabic language was really awful. Simple words like harem and Allah (God) were horribly mispronounced. The special effects were awful but i suspect that was because of a minute budget. John Leguizamo did a great job as both Genies, specially the part where the 2 of them are groaning about their familial relations - reminded me of my own family. I was surprised to see Andy Serkis in the lineup and wondered how i had missed him since the Lord of the Rings trilogy is one of my favorite films of all time. Mili's Sheherazade physically was beautiful and somewhat believable in her role, i wish she had been more expressive though since Dougray Scott (accent aside) portrayed the anguished sultan to perfection. All in all a fun, silly movie to watch if you need to get your mind off something :-) Enjoy !",
         "The movie is called Arabian Nights, however the original name for the story was \"Stories of 1001 Nights\". And the whole story happens in Persia( Shahrzad was the name of the queen) and the story was originally written in Arabic( official language of Iran in that era). The story was supposed to be before Islam otherwise a lot of things would be different; But a lot of Islamic symbols are used in the movie. Alladin is an Arabic name and was not Chinese(as shown) same for Pricess Zubaida (again Arabic name) and not Chinese. The Story of Alibaba goes on in Baghdad and not Damascus. Harun-Al-Rashid was in Iran( Khorasan) and definitely after Islam. I know he was not in the story.",
         "Leave it to US TV to take a centuries old collection of tales of action, erotica, fantasy and humour and give it the most wooden treatment so far. You know you're in trouble when even the basic premise is modified, supposedly to suit a modern audience, thereby taking away all significance of the original tales. Ill attempts at slapstick humour serve no purpose, loosing all the humour of the originals. Only the good locations, sets and special effects save it from being completely awful. Better read the tales, preferably in Sir Richard Burton's classic translation.",
         "I have to add my praise to the many rave reviews for this outstanding miniseries. My family and I have watched this wonderful adaptation of the \"1001 Nights\" many times since we first saw it on Foxtel about four years ago and it has become one of my children's favourite programs and they know most of the script off by heart now. I have a high regard for the many excellent Hallmark fairytale productions, but this is far and away their best. There is just so much to admire about it -- a funny, witty script, stunning locations, truly lavish costumes, superb makeup, excellent use of CGI effects, and above all, terrific performances from a star-studded cast, especially by the stunning Mili Avital and the very charismatic Dougray Scott, who carry so much of the story. And of course there are several other well-known stars -- like Andy Serkis and James Callis -- to be spotted in minor roles, a couple of years before they became famous. I MUST select for special mention the brilliant dual performance by the great John Leguizamo as the two genies in the Aladdin story. His portrayal of the whining, obese Ring Genie is hilarious, and his Lamp Genie shows how CGI and good acting can work together to create an awe-inspiring character. How did he not get an Emmy for these performances?? The use of CGI is very good in this episode -- I love the cunning way that the smoke comes off the tips of the Lamp Genie's ears and fingers, and how it makes a smoke-ring every time he says a word with \"O\" in it. Very clever. I also roundly applaud the decision to cast so many actors from Asian and African backgrounds, notably in the wonderful \"Alladdin\" story -- Jason Scott Lee and Vanessa Mae are both terrific, Vanessa Mae is utterly gorgeous *and* proves herself an excellent actor, and it's lovely to see screen veteran Bert Kwouk (Kato from the Pink Panther movies) as the Caliph. Why Jason Scott Lee not a MUCH bigger star, I have no idea -- he is truly marvellous in this role. This is to all intents and purposes a flawless production and the best film or TV version of the Arabian Nights stories that I have ever seen. The adaptations are remarkably faithful to the original tales -- and I have read the entire Mardrus and Mathers' 4-volume translation, so I know what I'm, talking about -- but the script also has many witty additions. The exchanges between Aladdin and the Genie of the Lamp are hilarious, especially when the Genie mocks Aladdin for asking for a flying machine. This is a gold-plated family classic which ought to be in the DVD collection of every school and of every family who cares about good, imaginative entertainment. 10 out of 10",
         "This movie with its many popular tales told throughout was incredible. Don't let the length put you off as it almost did me. In the end I felt it could have been longer it was that enjoyable. The popular tales of Ali Baba and Aladdin, along with a few other I didn't recognize were fantastic. Each story was able to flow into the next using characters from the previous story, until the last 2 tales after Aladdin.(The only small miscast was that of Aladdin, Lee, while his acting was believable, did not seem to strike me as an Aladdin.) Each tale has a point, coming together in the end. Spellbinding entertainment."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Hallmark Entertainment",
         "Studio Babelsberg",
         "RTL Television"
      ],
      "summaries": [
         "Long ago, the Sultan Schariar has gone mad after his traumatizing near assassination in which his wife collaborated and died at his hands as a result. Now he has a paranoid suspicion of women which he plans to express in a diabolical plan, and that is to marry a woman from the harem and then have her executed the very next morning. To prevent this, the Grand Vizier's daughter and a childhood friend of the Sultan, Scheherezade, offers herself to be that bride. Now, she must gamble that her plan will work as she tries to cure his madness by telling him story after wondrous story which include the tales of Ali Baba and the Forty Thieves and Aladdin and his Wonderful Lamp. All the while, the Sultan's villainous brother is making plans of his own and Scheherezade's stories are more useful against him than anyone can anticipate.",
         "To cure a prince's murderous madness, Scheherezade tells him a series of wonderous stories."
      ],
      "budget": 0
   },
   "movielensId": 176171,
   "movielens": {
      "languages": [
         "English",
         "Polski",
         "Español"
      ],
      "releaseDate": "2000-04-30",
      "dvdReleaseDate": null,
      "directors": ["Steve Barron"],
      "runtime": 175,
      "movieId": 176171,
      "title": "Arabian Nights",
      "mpaa": "NR",
      "actors": [
         "Mili Avital",
         "Dougray Scott",
         "Jason Scott Lee",
         "Vanessa Mae",
         "Alan Bates",
         "James Frain",
         "Tchéky Karyo",
         "John Leguizamo",
         "Rufus Sewell",
         "Jim Carter",
         "Hugh Quarshie",
         "Amira Casar",
         "Andy Serkis"
      ],
      "imdbMovieId": "0181199",
      "originalTitle": "Arabian Nights",
      "genres": [
         "Drama",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["1fRtB-bBGdI"],
      "plotSummary": "Scheherezade puts herself in danger to save Sultan Schariar, her childhood friend, from the madness that has gripped him since the death of his cheating wife at his own hands.",
      "tmdbMovieId": 18098,
      "avgRating": 4,
      "releaseYear": "2000",
      "numRatings": 2,
      "posterPath": "/vpIDK57iDCCv0DB6Ogq1QlrmQUI.jpg"
   }
}