{
   "tmdb": {
      "original_language": "ru",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1047845",
      "video": false,
      "title": "Travelling with Pets",
      "recommendations": [48012],
      "backdrop_path": "/nxh70pCKnPrr0VMlLscLD0Wcw7U.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sergei",
               "gender": 2,
               "credit_id": "52fe46cdc3a368484e0a4761",
               "name": "Dmitriy Dyuzhev",
               "profile_path": "/rdYf1uxhov2QOa1gGD6OqOrk0Ha.jpg",
               "id": 224079,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Natalie",
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a4765",
               "name": "Kseniya Kutepova",
               "profile_path": "/2OZgCg7qkJhKkvuE87NNh4sglh0.jpg",
               "id": 238697,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Klavdiya",
               "gender": 1,
               "credit_id": "52fe46cdc3a368484e0a4769",
               "name": "Anna Mikhalkova",
               "profile_path": "/fSOfpjLYf87VBoqpmv09eITtMVW.jpg",
               "id": 81003,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Priest",
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a476d",
               "name": "Evgeniy Knyazev",
               "profile_path": null,
               "id": 1146800,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Natalia's husband",
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a4771",
               "name": "Vadim Afanassiev",
               "profile_path": null,
               "id": 1146801,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Olga",
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a4775",
               "name": "Sofiya Dudarchik",
               "profile_path": null,
               "id": 143694,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a475d",
               "name": "Vera Storozheva",
               "profile_path": null,
               "id": 143679,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a477b",
               "name": "Arkadiy Krasilshchikov",
               "profile_path": null,
               "id": 1146802,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a4781",
               "name": "Sabina Eremeeva",
               "profile_path": null,
               "id": 1146803,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46cdc3a368484e0a4787",
               "name": "Oleg Lukichyov",
               "profile_path": null,
               "id": 1146804,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.261464,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 64197,
      "vote_count": 5,
      "budget": 0,
      "overview": "Plucked from an orphanage as a literal love slave, the now adult Natalija (a luminous Kseniya Kutepova) serves her ape-like husband by tending his prized cow—whose milk they sell to customers on passing trains. When hubby suddenly drops dead, however, Natalija’s narrow life of cows and rails finally starts opening up. Dumping his body at the local hospital, dropping by church to say a few prayers and trading in the cow for a pet goat, she slowly eliminates all trace of his former hold on her, searching out a new life in the freedom that emerges.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485
      ],
      "original_title": "Puteshestvie s domashnimi zhivotnymi",
      "runtime": 97,
      "poster_path": "/fZlvSGtAVfnXkJCY3Gnev05rUFk.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [],
      "release_date": "2007-06-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vera Storozheva"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Arkadiy Krasilshchikov"],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt1047845/",
      "coverLink": null,
      "actors": [
         "Kseniya Kutepova",
         "Dmitriy Dyuzhev",
         "Evgeniy Knyazev"
      ],
      "reviews": [
         "This was the best of 12 films I saw at the 2007 Warsaw film festival. If you liked 'Euforia' or 'The Return', you'll love this. A woman is stuck in the middle of nowhere in the middle of Russia, living in a shack by a railway line. Her husband dies and all she has are a few animals for company and a guy she gets a lift to the mortuary with. She must learn to live on her own and decide her life for herself. While it may sound simplistic, the film is very lyrical and very moving, with some very funny moments and moments of sheer pathos. Cinematography is great, acting too and the overall atmosphere is almost haunting. Well worth an hour and a half of your time.",
         "Young Natalia's unappealing husband, a railroad worker, keels over as a train passes by. He's dead, and her life begins. Storozheva's feminist portrait, not set in any clearcut time, feels slight but is beautifully shot and the young Kseniya Kutepova, who plays Natalia, has definite star quality. Things initially are pale gray, in tune with Natalia's hitherto joyless life. She uses a railroad trolley to take her husband's body to the morgue and exchanges the family cow, a symbol of her servitude, for a white goat. Young Sergei (Dmitri Dyuzhev), an estranged husband with a spoiled young daughter, it turns out, gives Natalia a ride in his pickup and before long they're having a roll in the hay back at her place. When she's done and he won't go, she shows who's boss by pointing a shotgun at him. The relationship is off and on for a while. Sergei is hunky and director Storozhova doesn't mind showing him off nude from all angles. He's one of those sensitive brutish types that pop up in Russian films. He's also highly sexed. That's fine with Natalia, whose never known sexual pleasure before, and she lets him back into her life and even gets friendly with his little daughter, despite the latter's annoying manner. But Sergei seals his doom when he says he wants to marry Natalia, get a cow, and turn her into a housewife. This is the limit of his mindset--and, apparently, of how Storozheva wants to represent men in the film. Natalia is dreaming of other things. She has already gone around in a wedding dress just for fun, dressed up in rust and pink to set off her red hair, is immediately taken up by a group of train riders who stop over, and is hit on by the men. She goes on a brief ride, chased by her dog, then jumps off. Later she goes on a solitary ferris wheel ride and her radiant face symbolizes her impending liberation. Natalia has been compared to Tilda Swinton (she has her alabaster skin and auburn hair) but she also resembles the young Meryl Streep. This is a nice vehicle for her, and the film itself has won some festival prizes. Eventually Natalia takes a (symbolic?) boat ride to an orphanage (she was raised there herself, it seems) and adopts an enterprising boy of 10 or 12 with her coloring. In the final scene Natalia is returning homeward in her boat and the boy and her dog are falling in love with each other. This seems a transparent and naive depiction of woman's liberation; what weakens it is the unspecific, fable-like setting and narrative. But technically it is flawless, the images lovely, keyboard music germane, and Ms. Kutepova a winner. Seen at the San Francisco International Film Festival 2008",
         "Your classic art movie - the red head girl is pursuing a remarkably durable and buoyant red balloon, when her cow-milking rail worker \"master\" croaks in the background of the grey, 'scope frame. This is not going to be a fun movie. The conventions of the \"serious\" Russian cinema get topped up with a dose of seventies feminism, as the girl slave-wife asserts herself, burying her keeper and using his milk churn of money to acquire a dog, a goat and a flat screen TV, rejecting the rugged single father truck driver in favour of raising an orphan that she recruits from her old institution and takes away in the row boat she has been tarring throughout the picture. Guaranteed festival prize winner. The minimal plot is tricked out with vista shots of isolation & misery occasionally disrupted, as when the strain makes an unscheduled stop disgorging passengers who are taken with her appearance in the scarlet suit. Miss Kutepova manages to work up some interest, playing it all po-faced in her first major role. Murky Ruskie colour of the kind we hoped we had seen the end of with glasnost. The film is too long and too slow but has mood and craft skill going for it. The raunchy bits help. What happens to the TV?",
         "I find it unfathomable that so many films today are made without the benefit of a cogent script. \"Travelling With Pets\" is another that fits in this category. Minimal dialog throughout. Basically, we watch the day to day life of an eccentric/borderline insane woman who buries her husband and has what might or might not be considered a relationship with a man who gives her a ride in his truck. She buys a flat panel TV but cannot get any reception and her manfriend tells her she needs an antenna and proceeds to install it on her roof. Wow! Just doesn't getting anymore interesting that that, huh? It is a strange little movie and much of the woman's bizarre behavior is never really explained. The whole thing really doesn't amount to much of anything. The fine cinematography is the sole reason that I remained in my seat. Not enough to recommend, though. 4/10",
         "I don't want to blame this movie because director is woman and that's not a reason why I didn't enjoy this movie. I really didn't understand what director wanted to say or talking about. About fate of Russian women, about loneliness, about necessity to be strong and use men only for child producing? I like this strange mood in this movie, great actors, but this movie pretends smarter than it is. Basically, I had strange feeling that director really doesn't understand what she wants to say with this movie and all strange things are just because they look strange. It's a some kind of so-called pseudo-intellectualism what we can see in many many European independent movies. And people don't want to say that they didn't understand this movie just because there are many critics who will find this movie so useful. And very deep. And very actual. Let's call things in their real names."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Slon"],
      "summaries": [
         "Hatalie was 16, living in a foster home, when she was bought by a rough and unstable man. They lived at a remote station, and their loveless marriage lasted 19 years, until he died. Now free, Natalie is discovering her first love when she meets Sergei.",
         "Natalie was lonely in her loveless marriage until she met Sergei."
      ],
      "budget": 0
   },
   "movielensId": 176137,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "2007-06-25",
      "dvdReleaseDate": null,
      "directors": ["Vera Storozheva"],
      "runtime": 97,
      "movieId": 176137,
      "title": "Travelling with Pets",
      "mpaa": "",
      "actors": [
         "Dmitriy Dyuzhev",
         "Kseniya Kutepova",
         "Anna Mikhalkova",
         "Evgeniy Knyazev",
         "Vadim Afanassiev",
         "Sofiya Dudarchik"
      ],
      "imdbMovieId": "1047845",
      "originalTitle": "Puteshestvie s domashnimi zhivotnymi",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Plucked from an orphanage as a literal love slave, the now adult Natalija (a luminous Kseniya Kutepova) serves her ape-like husband by tending his prized cow—whose milk they sell to customers on passing trains. When hubby suddenly drops dead, however, Natalija’s narrow life of cows and rails finally starts opening up. Dumping his body at the local hospital, dropping by church to say a few prayers and trading in the cow for a pet goat, she slowly eliminates all trace of his former hold on her, searching out a new life in the freedom that emerges.",
      "tmdbMovieId": 64197,
      "avgRating": 4,
      "releaseYear": "2007",
      "numRatings": 1,
      "posterPath": "/fZlvSGtAVfnXkJCY3Gnev05rUFk.jpg"
   }
}