{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "paula dupree",
         "id": 208422
      }],
      "imdb_id": "tt0036975",
      "video": false,
      "title": "Jungle Woman",
      "recommendations": [
         35911,
         3210,
         59589,
         18100,
         61430,
         99545,
         51787,
         59566
      ],
      "backdrop_path": "/mr3159wdgPOLHLiAxOiOfEulG20.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Paula Dupree - the Ape Woman",
               "gender": 0,
               "credit_id": "52fe49099251416c910a0a8d",
               "name": "Acquanetta",
               "profile_path": "/iul7SNeqM4wfO8E84kGRUNFY4Yg.jpg",
               "id": 131056,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Beth Mason",
               "gender": 1,
               "credit_id": "53d9d48dc3a3681ecd000e7a",
               "name": "Evelyn Ankers",
               "profile_path": "/aZhMrtu0xN2hkZDsbpuot86EeBa.jpg",
               "id": 30133,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. Carl Fletcher",
               "gender": 2,
               "credit_id": "53d9d496c3a3681ed9000f43",
               "name": "J. Carrol Naish",
               "profile_path": "/iHUIlLxzgkZSMvapdxLhBZe82B.jpg",
               "id": 30686,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Coroner",
               "gender": 0,
               "credit_id": "53d9d4a2c3a3681ee5000e12",
               "name": "Samuel S. Hinds",
               "profile_path": "/3VrGfCOsIdEvsbJPodAEqHRsmp1.jpg",
               "id": 17756,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Joan Fletcher",
               "gender": 1,
               "credit_id": "545cf1d50e0a26472d0014a8",
               "name": "Lois Collier",
               "profile_path": "/gFd8fBjm0eDPjGue0TonUKIg3ys.jpg",
               "id": 126834,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Fred Mason",
               "gender": 2,
               "credit_id": "545cf1e30e0a261fb600461c",
               "name": "Milburn Stone",
               "profile_path": "/iXXFPiVm23BySExJ00kFllDYQFB.jpg",
               "id": 86356,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "District Attorney",
               "gender": 0,
               "credit_id": "545cf1f1c3a3685362003df2",
               "name": "Douglass Dumbrille",
               "profile_path": "/ggD9NRWlRDofqVhVR6XaTHvLhp4.jpg",
               "id": 34748,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Bob Whitney",
               "gender": 0,
               "credit_id": "54b1298cc3a368094a001a2c",
               "name": "Richard David",
               "profile_path": null,
               "id": 566280,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Miss Gray",
               "gender": 1,
               "credit_id": "54b129a49251417479001ada",
               "name": "Nana Bryant",
               "profile_path": "/iZBZsi9gAFIBEB6QPi4Pfb7jGiE.jpg",
               "id": 88461,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dr. Meredith",
               "gender": 2,
               "credit_id": "54b129bbc3a36841380016ab",
               "name": "Pierre Watkin",
               "profile_path": "/s9Z72wx6hJ2BwG6feVC6s4TcWrb.jpg",
               "id": 30216,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "George",
               "gender": 2,
               "credit_id": "54b129cb925141746c001bc1",
               "name": "Christian Rub",
               "profile_path": "/pbXqN3qxPMiMZ8hS5hD39qKK1nH.jpg",
               "id": 985275,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Dr. Walters",
               "gender": 2,
               "credit_id": "54b12a04925141747e001c03",
               "name": "John Carradine",
               "profile_path": "/iv9pZ2JRddIUNe2RgYAKmUR55WO.jpg",
               "id": 8516,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Willie",
               "gender": 0,
               "credit_id": "54b12a1ec3a36841380016b9",
               "name": "Edward M. Hyans Jr.",
               "profile_path": null,
               "id": 1411789,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49099251416c910a0a89",
               "name": "Reginald Le Borg",
               "profile_path": null,
               "id": 100793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545cf1ab0e0a261fbd00448d",
               "name": "Bernard Schubert",
               "profile_path": null,
               "id": 102358,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.611601,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84710,
      "vote_count": 4,
      "budget": 0,
      "overview": "Paula the ape woman (Acquanetta) is alive and well, and running around a creepy old sanitarium run by the kindly Dr. Fletcher (J. Carrol Naish), also reverting to her true gorilla form every once in a while to kill somebody.",
      "similar": [
         84708,
         84711
      ],
      "original_title": "Jungle Woman",
      "runtime": 61,
      "poster_path": "/udZ3hvhC52su7UQrGsIyDxK7IQA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1944-06-01",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "RAPTUROUS BEAUTY!...FURY OF A BEAST!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Reginald Le Borg"],
      "runtime": 61,
      "synopsis": null,
      "writers": [
         "Henry Sucher",
         "Bernard Schubert"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036975/",
      "coverLink": null,
      "actors": [
         "Evelyn Ankers",
         "J. Carrol Naish",
         "Samuel S. Hinds"
      ],
      "reviews": [
         "Jungle Woman is one of several ape woman movies made by Universal in the 1940's. In this one, the ape woman, Paula is living in a sanatorium but the people there don't realise she is going out at night to kill people in her ape form. Her victims include a resident of the sanatorium, who first gets the blame for her previous victim. This movie is creepy in parts and despite this, it is not the best of Universal's horrors made at this time. The cast includes J Carrol Naish (The Monster Maker), Evelyn Ankers (The Ghost of Frankenstein), Acquanetta (The Lost Continant) and Milburn Stone (Invaders From Mars). Though not brilliant, Jungle Woman is worth a look at. Rating: 3 stars out of 5.",
         "Sequel to CAPTIVE WILD WOMAN is often said to be one of Universal's worst horror films, and with some good reason. For one thing the first 15 or 20 minutes agonizingly drone on and on with flashback sequences from the first movie, and has to be seen to be believed (it actually feels like you're watching 3 different films at times). Acquanetta returns as Paula the Ape Woman and it's hilarious to watch her terrible acting performance, especially the robotic way in which she delivers her lines! At least the original had her mute throughout; this one gives her a lot of dialogue she can't handle. Along with the unintended laughs to make things survivable, at least this one features the competent J. Carrol Naish as the latest scientist trying to experiment with Paula, and to its very slight credit director Reginald LeBorg directs a couple of scenes in a Val Lewtonesque manner (such as Paula's creepy attack on a row boat and her eerily stalking her victim through the woods). I've never understood why these films didn't take more advantage of using more of their Ape Woman woman in full makeup to keep things more lively. ** out of ****",
         "This is the second in a series of three ape woman movies Universal made; at the moment I've only seen the first two. This film does follow the events of the first, but it could probably be seen by people who hadn't seen the first, since it does recap things. It starts with a man walking towards a house, and he is attacked. We see him in silhouette struggle with his attacker, a woman. He sticks her with something, and she collapses. After a newspaper headline explaining a Doctor is faced with a Coroner's inquest, we meet Dr. Fletcher, the man on trial for the death of a woman named Paula. The inquest is a somewhat awkward framing device for the movie. Dr. Fletcher, Fred Mason and Beth Colman (these latter two character returning from the first movie) recall certain events surrounding Paula. Their recollections are, at least to start with, mostly clips from Captive Wild Woman (1943), although Dr. Fletcher's character has been edited into that footage. It grows somewhat awkward when Fred Mason testifies about a conversation he had with Dr. Fletcher about past events: we're watching a recollection of a recollection. It turns out Dr. Fletcher discovered that the ape Cheela, who had seemingly died from a gunshot wound near the end of the first film, still had some vital signs. Dr. Fletcher nursed Cheela back to health, and upon hearing something about Dr. Walter's experiments, also buys Dr. Walter's estate, including the sanitarium from the first film. The recollections about Cheela and Paula are complicated by something Fred Mason tells Dr. Fletcher, information that was not in the first film that I recall. Mason says that before he brought Cheela to the US from Africa, he'd heard stories of a Doctor in Africa who turned humans into animals. It was rumored that Cheela was one of those animals. If that was true, then it would mean that Paula was a woman who'd been turned into an ape, and then turned into a woman who sometimes reverted to being an ape. Cheela escapes, and Dr. Fletcher and his incredibly annoying (and poorly acted) helpmate Willie go searching. They find Paula instead. In the first film, once Paula had reverted to being an ape, she could only turn back after Dr. Walters gave her a series of treatments. In this film, she can turn back and forth; whether she can do so at will is not clear. Also unclear is whether she turns completely into an ape, or into an ape-woman: a halfway stage we'd seen her in in the first film. There is something much later in the film that definitely suggests the latter possibility is the correct one. Paula is uncommunicative until she meets Bob, the sweetheart of Dr. Fletcher's daughter. She is instantly smitten. While this copies an element from the first film (Paula is obsessed with a man, and her jealousy makes her dangerous and animalistic), in the first film her obsession was at least somewhat justified. Mason had been kind to her while she was an ape in Africa, and on the ship all the way to America. Her obsession with Bob seems to be only that he is the first reasonably attractive young man she's met since becoming human again. There's a scene in which Dr. Fletcher has someone compare Paula's fingerprints to those found on a lock which had been violently broken. He discovers that the patterns of the fingerprints are identical, except in size - one is at least twice the size of the other - and a somewhat \"anthropoid\" character of the larger one (or both?). Do apes have fingerprints? I don't know; I do think that scene could have been fleshed out a little more, and could have been interesting. There were a couple strange things about the inquest. Dr. Fletcher had accidentally killed Paula by giving her an overdose of a sedative; the overdose was because he injected her while they were struggling. It would seem that would have been a defense in itself. Thus, Dr. Fletcher, Fred and Beth would not have had to bring up the story of Paula being an ape- woman. However, the court is willing to believe the story of Paula being an ape-woman if it can be proved, which seems a bit incredible. What is strange in connection with that, is that the coroner says if Paula was not human, then the court would have no jurisdiction for murder charges. Certainly she was human enough! Again, the defense would logically be that the death was accidental (and arguably self-defense as well).",
         "A sequel can sometimes be either a virtual remake of the original film, it can devote some of the running-time to re-telling the first film's plot in compressed form (via scenes lifted directly from that one) and, other times, the second entry could cheat by borrowing action scenes from the preceding effort and pass them off as its own. However, this is the only case I know of where a film is all three at once (though, technically, the animal footage here is part of the flashback framework, they were still ripped off from an earlier non-related picture)! Universal's three-movie \"Ape Woman\" franchise is surely among the most maligned to emerge during the vintage horror era (even by hardened buffs) but, maybe because I was in a receptive frame-of-mind, I recall enjoying CAPTIVE WILD WOMAN (1943; directed by, of all people, Edward Dmytryk!) back when I had watched it and certainly did not mind catching up with the two sequels now i.e. the film under review and THE JUNGLE CAPTIVE (1945), which followed on the very next day! To get to the matter at hand: this, then, follows the pattern of THE MUMMY'S TOMB (1942), Universal's third movie in the Egyptology stakes but actually the second 'episode' in their \"Kharis\" saga. Anyway, the film has a complex structure in that we begin with the titular figure's demise, of whose murder the 'mad doctor' (who is not really) of this one, J. Carroll Naish, is accused, then we go into a flashback to learn how we got there but, corroborating his evidence, as it were, are the hero and heroine of the first film who relate their own experiences by recounting the events of CAPTIVE WILD WOMAN! Amusingly, Universal 'scream queen' Evelyn Ankers receives top billing here but she only appears during these basically expository scenes and, of course, the 'stock footage' though not in JUNGLE WOMAN's narrative proper (that is to say, Naish's recollections)! Incidentally, I wonder what John Carradine, star of CAPTIVE WILD WOMAN (1943), made of the fact that, unofficially, he also had this on his resume'! When I said that this was more a remake than a sequel was due to its having the 'monster' (once again played by Acquanetta but, unwisely taking a leaf from BRIDE OF FRANKENSTEIN {1935}, she is made to speak – except that we are never told in this instance just who taught her – and, boy, is she wooden!) once more instantly fall for the doctor's daughter's fiancé and grows insanely jealous of the girl. By the way, in a reversal of \"Dr. Jekyll & Mr. Hyde\", here the monster turns human without the use of drugs, so that the girl is found prowling the grounds of Naish's sanatorium by a simple-minded patient (who, subsequently doting excessively on Acquanetta, unsurprisingly becomes one of her victims). At one point, the Ape Woman swims underwater and capsizes the lovers' canoe, an act which is actually blamed on the oafish orderly who is currently missing – even if the former makes no secret of her impulsive affections for the impossibly bland leading man (unfortunately, a constant thorn in the side of the Golden Age of Horror!). Curiously, the film naively (since the original film had already established the transformation as a fact!) attempts to follow the psychological Val Lewton route by never showing the monster (except once amidst the flashback footage and again in the very last shot – even her death is played out in the shadows, though the images of a female figure leaping on the doctor only to be injected with an overdose belies the animal noises on the soundtrack!) but, for all that, the film remains mildly enjoyable – certainly eminently watchable – along its trim 60-minute duration, largely owing to Naish's grey-haired presence (though he is not quite running on full cylinders here, as in the same year's THE MONSTER MAKER) and the unmistakable Universal Studios atmosphere.",
         "This film begins with a bang, as a man is attacked by a ferocious female something, shown in silhouette. We then see the distinguished Doctor Fletcher refusing to speak on his behalf at an inquest on the dead person, who he says was not human. This leads into flashbacks of his investigations into the strange history of Paula Dupree, the Ape Woman. Acquanetta outdoes her previous appearance as Paula in the first movie, with the addition of some dialogue and more screen time. Her unexpected, sultry introduction of herself to the hero, after everyone assumed she was mute or catatonic, is quite a surprise, and not welcomed by the fellow's fiancée, who happens to be Dr. Fletcher's daughter. The influence of Val Lewton's Cat People is quite apparent, as the jealous Paula begins stalking the couple, in some very effective sequences. Acquanetta may have been limited as an actress, but she is just right for the part of the beautiful but savage Paula. The scene of Doctor Fletcher finding her sobbing in her room, as she sees the happy couple through her window, is startling and memorable. Some genuine menace is built up, as Paula obsessively pursues the hero Bob, while fending off advances from the Doctor's slow-witted assistant, Willie. This may well be the best of the three Ape Woman features, and is definitely worth the time of any Forties horror movie fans.",
         "Note this may contain a *SPOILER* Paula Dupree the ape woman was introduced in the film CAPTIVE WILD WOMAN. While CAPTIVE WILD WOMAN was an okay B horror film from Universal, its central character wasn't interesting enough to warrant two sequels. JUNGLE WOMAN confirms this. It's hard to believe that the top brass at Universal thought they had a potential new monster to ad to their ranks along with The Mummy, Dracula, Frankenstein Monster, etc. When this film was first released, it was part of the top half of a double bill with THE MUMMY'S GHOST, with JUNGLE WOMAN receiving the emphasis in the ads. Now, I don't think anyone would consider THE MUMMY'S GHOST an outstanding picture, but it provided the kind of escapist thrills war time matinee audiences expected from Universal. So those who sat through THE MUMMY'S GHOST, and then sat through JUNGLE WOMAN, must of felt a bit let down by this rather uneventful film.Also, many were probably mislead by the films ads that promised something more along the lines a female Tarzan type picture than a horror film. The film opens well, with a spooky nighttime sequence. Dr. Fletcher is searching the grounds of his sanatorium carry in a syringe. He is stalked and attacked (we see this as shadows on a wall) by a lithe female figure. Dr. Fletcher then plunges a syringe into the attacker. The film then cuts to a coroners hearing where we learn Dr. Fletcher is being questioned in the death of Paula Dupree. We learn Dr. Fletcher accidently injected too much of the sedative he hoped would only subdue her and she died as result of an overdose. Dr. Fletcher then recounts for the prosecutor the strange story of Paula Dupree. Universal pinched a lot of corners when making this film. A good ten mins. of footage from this film is repeated footage from the first film. During his testimony, Dr. Fletcher tells how he was able to revive the dying Cheela the ape and nurse it back to health. We see none of this. Then he tells us how Cheela the ape escaped one night. Once again we see none of this. Why? Because filming these scenes would mean calling back Ray Corrigan and his ape suit and they would have to pay him. The film really starts when searching for Cheela, Dr. Fletchers dumb witted house boy Willie discovers Paula wandering around the grounds. Willie regards finding Paula as like finding a lost puppy; he mutters things like \"Doc! Look what I found!\", \"Isn't she beautiful\" \"Can I keep her?\" \"I found her first\". Through out the rest of the film, the story meanders from one non-event to another. The director appears to be trying to ape (no pun intended) THE CAT PEOPLE by only showing Paula in her ape woman form either unseen or in shadows. Of course this makes no sense because the effect is ruined because early on we see flashbacks from CAPTIVE WILD WOMAN of in all her ape woman glory. He even blows a scene ripped from the CAT PEOPLE where Paula stalks Dr. Fletcher's daughter through the woods. Its atmospheric, but it is ruined by Paula walking with her head hunched in her shoulders, bug eyed, and walking stiffly like a wind up doll. The film even repeats the effective opening scene. I could go on and on but I have taken up to much space already. On the plus side; Acquanetta projects just the right animal sensuality for the role. J. Carrol Naish gives his customary professional performance. But as Willie says to Dr. Fletcher in a line often sighted by the films detractors: \"Aw! Its a gyp!\"",
         "Sequel to Captive Wild Woman that is often cited among fans as one of the worst, if not THE worst, of Universal's classic horror films. I can't find much good to say about this to argue against that opinion. Frankly, this stinks. I wasn't much of a fan of Captive Wild Woman in the first place so I am a little perplexed as to why it needed a sequel, let alone two (there's another film following this one!). Once they decided to make a sequel, one would hope they would try to improve on the first movie in some way. Instead we get this thing, told through flashback, that utilizes way too many clips of the first movie. If you have to pad the runtime of a movie that's barely an hour, maybe you just shouldn't make that movie. Evelyn Ankers, Milburn Stone, and Acquanetta all return from Captive Wild Woman. It helps that this movie has the great J. Carrol Naish in it, as well as solid actors like Douglas Dumbrille and Samuel Hinds. Eddie Hyans plays a simple-minded lab assistant named Willie who provides some unintended laughs for his \"Which way did he go, George\" method of acting. But this is a snoozer for anyone who's seen Captive Wild Woman or anyone who comes into this expecting some kind of cheesy \"beast-woman\" fun. The lack of any attempt at making this a real monster movie and the constant clips test your patience. It's a very cheap and ho-hum movie that I wouldn't recommend to anyone but those looking to see every film in Universal's classic horror catalog, regardless of quality.",
         "Jungle Woman (1944) * 1/2 (out of 4) Dr. Carl Fletcher (J. Carrol Naish) is on trial for the murder of Paula (Acquanetta) when several people are brought into testify including Beth Mason (Evelyn Ankers). Soon we are told how Paula ended up coming to the home of Dr. Fletcher and why things spun out of control. JUNGLE WOMAN is a sequel to CAPTIVE WILD WOMAN and is the second of the three film series. For the most part you can't help but call this one of Universal's worst films right down there with SHE WOLF OF London. Even if you don't consider it one of the worst it's hard to defend me calling it one of their laziest films. I say lazy because a lot of this film is just flashbacks to the first movie and this just adds a very cheap feel to the picture. One has to wonder why they needed to use the flashbacks since I'm sure most people would have already seen that movie. Or, if they were going to use flashbacks, they could have used less of them to get people caught up on the story. I would also argue that the entire courtroom scenes were boring and didn't add anything to the picture. The most shocking thing about JUNGLE WOMAN is the fact that there's not too much footage of the ape woman. Did CAPTIVE WILD WOMAN not meet the studio's box office expectations so they went cheap here? I'm really not sure but even capable actors like Naish and Ankers just come across as boring here. Milburn Stone also returns and of course there's Acquanetta who is completely wasted here.",
         "\"Jungle Woman\" is a B-movie from Universal. And, with so many of Universal's monster films, this one often completely contradicts the previous film, \"Captive Wild Woman\"...so much so that it's hard to say that \"Jungle Woman\" is a sequel exactly...though the half-ape woman, Paula Dupree (Acquanetta) is in each. But instead of being the product of the evil Dr. Walters (John Carradine), she's the result of more benign experiments by Dr. Fletcher (J. Carrol Naish). The film begins with Dr. Fletcher killing Paula in silhouette (a cheap technique in order to not have to use make-up to make Acquanetta look like an ape). At the inquest, he's hesitant to explain why he did this but eventually he tells...and you see a lengthy flashback which last the rest of the film. Dr. Fletcher rescued a dying ape...healing it and somehow using glands to make the ape look like a hot woman with an inexplicable accent*. She is beautiful and intelligent but one thing she still lacks is a conscience. Because of this, when she inexplicably falls for Paul, she's determined to kill his girlfriend. And, she also kills the hospital's attendant, Willie, because he was so annoying! Then, she kills chickens and a German Shepherd...but in all these cases you see none of this...again all apparently to save money or, perhaps, because Acquanetta wasn't exactly a great thespian and she was used very sparingly throughout the movie. So is this any good? Well, the mood is good but the film really could have used some ape/human make-up...something other the tiny scene at the end where she appears to be sporting wolfman make-up! I think they were trying for the Val Lewton experience where you never see the creature...but it just didn't work as well here. Not a terrible film, however, just one that could have been a lot better. For fans of B-horror films, it's worth seeing...most others will find it all a bit silly. A sad portion appeared to have been taken from \"Captive Wild Woman\" that bothered me. You see a tiger and lion fighting each other...ostensible for the audience's amusement. Pretty sick and cruel stuff. *Despite her exotic name and Universal marketing her as 'The Venezuelan Volcano', Acquanetta was from Wyoming....and her exotic accent a phony.",
         "\"Jungle Woman\" is an unnecessary sequel to the superior \"Captive Wild Woman\" but it's not a bad film in its own right. J. Carrol Naish - a fine character actor - is one of the leading characters as a scientist who attempts to steady the ape woman, Paula. The flashback part of the film is confusing and should have been removed from the screenplay. Evelyn Ankers is given top billing but is only involved in the beginning and end of the film and her screen time is very limited. There is a fair bit of incident but it beggars belief how a further \"Ape Woman\" film was commissioned.",
         "Jungle Woman picks up shortly after the events in Captive Wild Woman. After the gorilla Cheela is shot, Dr Carl Fletcher (J Carrol Naish) takes the body and discovers a faint heartbeat. He's able to revive the animal. The gorilla escapes at about the same time that a strange woman named Paula (Acquanetta) is discovered wander Dr Fletcher's sanatorium grounds (coincidence?). Paula develops strong feelings for Dr Fletcher's daughter's fiancé. So strong, in fact, that she sets out to do harm to the Dr's daughter, Joan. Joan is in real danger. Paula may be more than she appears. I haven't seen Captive Wild Woman in at least 10 years so I don't remember much about it. I do, however, remember being disappointed. I felt the same way about Jungle Woman. It's just not very good and is often quite dull. There are way too many long stretches of the film where nothing much happens. I actually found myself getting bored. The film feels longer than its brief 61 minute runtime. On the positive side, the movie looks fantastic. Even in their cheaper productions, Universal movies always look remarkable. The cinematography is on par with what you'll find in the best of the Universal horror films. Had Jungle Woman been made by a studio like PRC, it wouldn't have looked half as good. Another positive is the acting. I was especially impressed with Naish. He's always proved to be a very capable actor. I don't, however, understand how Evelyn Ankers got top billing for Jungle Woman. I swear she was on screen for less than 10 minutes. Finally, another positive when compared with Captive Wild Woman is fewer lion taming scenes. Lion taming in Jungle Woman takes up about 5 minutes – compared with what seemed like half the movie in Captive Wild Woman.",
         "***SPOILERS*** Second of the Paula the \"Jungle or Ape Women\" trio has Paula ,Acquanetta, fall in love with wild animal trainer the handsome Fred Mason,Milburn Stone, who's life she saved when the lions and tigers he was handling under the big top turned on him almost mauling Fred to death. That's when Paula was in her other incarnation as Cheela the friendly lady gorilla sprung to his rescue. After Cheela's death Dr. Carl Fletcher, J. Carroll Nash,who witness this amazing event had the lady ape's body brought back to life in human form christening her Paula Dupree. As we all saw at the beginning of the flick Dr. Fletcher killed in self defense Paula when she attacked him trying to prevent him form putting her to sleep with a strong animal sedative. Now on trial for murder Dr. Fletcher is to tell the court the reason for his actions that in fact had to do with a love triangle between Paula the ape woman and her former trainer Mason as well as his wife Beth, Evelyn Anker, that a love sick Pula had it in for and tried to murder. There's also Paula secret lover the mentally challenged sanitarium orderly Willie,Eddie Hyans, who tried to make it with her by giving her extra ham and cheese sandwiches, that he stole from the commissary, who ended up getting his neck broken by Paula's super human gorilla strength. ***SPOILERS*** Second of the three \"Paula the Lady Gorilla or Ape Woman\" movies that has Paula killed in the end where she's discovered after death to be an ape not human being! Thus exonerating the guilt ridden Dr. Fletcher of murdering her or it. But in it also being just too good of a thing-A sexy lady ape-to let go. Paula was to be reincarnated and return for a third time at bat in 1945's \"Jungle Captive\" with Vicky Lane not the exotic and sexy looking Acquanetta in the leading role.",
         "Acquanetta pretty much just stands around, looking like a zombie, recites a few lines then stares back into space again. This follow-up to \"Captive Wild Woman\" has her as a transformed ape who falls in love with hero Milburne Stone, hating his fiancée Evelyn Ankers, aka \"the scream queen\" and obviously out to kill her. Shadowy photography is more interesting than Acquanetta's lack of a performance, added onto with a mentally retarded man who appears to be imitating Lon Chaney Jr's brilliant performance in \"Of Mice and Men\". There really aren't any chills because it all seems so phony, told in flashback and poorly written. Even attempts to give it a psychological background comes up empty. This is one that ranks among the worst of the dogs of cinema and nothing other than two robots and an unseen man making wisecracks while it is playing could make this any more watchable.",
         "Jungle Woman is the follow up Captive Wild Woman.Acquanetta returns as Paula the Ape Girl. This time scientist De Carl Fletcher played by J Carroll Nash has revived her as Cheela the Gorilla at his sanatorium but she morphs back into Paula without any surgical assistance.The doctor has a lovely daughter Joan >Lois Collier< who is his secretary. She is engaged to a nice looking young fellow Bob Whitney >Richard David<. When Paula meets the young man she finds her voice. She also sees the doctors daughter as a romantic rival who must be eliminated.Paula finding her voice is when this film is really torpedoed. Acquanetta made it through the first film because all that was required of her was to flash a threatening glare and occasionally show anger. Delivering dialog was definitely not her strong suit.The fact the the script is laughably bad certainly doesn't help. SPOILER: The film is show in flashback as Dr Fletcher is on trial for murder. Much of the action is from Captive Wild Woman. At first Fletcher will not reveal why he injected Paula with a drug to kill he. However, his supporters which include Fred Mason >Milburn Stone< and Beth Mason >Evelyn Ankers along with his daughter Joan and Bob reveal to the court Paula's to animistic nature. The prosecutor >Douglass Dumbrille< is dubious but when the judge >Samuel S Hinds< orders a re examination Paula's body the court finds that Paula has reverted to her half ape/half girl state. Dr Fletcher is vindicated and goes free. One of the worst of Universals WWII horror flicks, Jungle Woman is only to be watched as part of the Paula the Ape Girl series.",
         "Considering this is from Universal Studios in the 1940's, I expected a bit more from this film. Not much going for it, even if it was one of those campy monster films. I admit that I liked the interiors of the hospital--what a hallway--that thing was a wide as highway!! And I liked the staircase also--lol. This film is not scary or anything, so I can't figure out why they even made it in the first place.",
         "1944's \"Jungle Woman\" was the first of two sequels to \"Captive Wild Woman,\" to be quickly followed by a second, \"The Jungle Captive,\" which ended the trilogy (producer Ben Pivar went on to do The Creeper series with Rondo Hatton). Unlike the other two, this title was never included in the SON OF SHOCK television package, receiving relatively little airplay over the years (Pittsburgh's Chiller Theater showed it only once, following 1952's \"Mesa of Lost Women\" on Sept 24 1977). Acquanetta may be back, but saddled with dialogue this time, gives a lackluster performance not helped by her risible lines (nowhere near as good as Kathleen Burke's Panther Woman from \"Island of Lost Souls\"). The entire film consists of wall to wall talk, awkwardly structured as a courtroom drama featuring a pointless love triangle and a couple murders. The opening 20 minutes (out of 60) are just a recap of \"Captive Wild Woman,\" made up of footage shot for three different films; by the time the story proper begins, we're saddled with a simpleton character (Edward M. Hyans Jr.) who doesn't get bumped off soon enough (expediency appears to have been the studio's only motivation). The few attack scenes take place off screen, and Paula Dupree's fate is depicted in shadows. J. Carrol Naish, between Oscar-nominated roles in 1943's \"Sahara\" and 1945's \"A Medal for Benny,\" is clearly marking time, following a similar turn in PRC's \"The Monster Maker\" (\"House of Frankenstein\" was just around the corner). \"The Jungle Captive\" could only have been better, even without Acquanetta, whose career quickly petered out after leaving Universal (following \"Dead Man's Eyes\").",
         "Universal Pictures must have had some contract commitments they were trying to fill or the budget was real tight. What I can't believe is that there was much of a demand for a sequel to Captive Wild Women which introduced us to Paula the Ape woman who went from beautiful Acquanetta to a guy in a gorilla suit. We thought she was done for at the end of Captive Wild Women, but she's back now and living at J. Carrol Naish's asylum. She doesn't revert to being an ape any more, but Acquanetta is still a Jungle Woman and reverts to animal behavior when someone poaches on what she stakes out. A lot of the same cast members of the previous film testify at a coroner's inquest presided over by a most embarrassed Samuel S. Hinds and Douglass Dumbrille. Now Acquanetta sets her jealous eyes once all the flashbacks are over which account for about half the film on poor Lois Collier who has a man the Jungle Woman wants. Thank God Universal didn't inflict a third film on the movie-going public.",
         "No need to waste time on this sequel mess. Apparently, Universal needed to meet product demand for wartime audiences. So they took a hunk of 1943's Captive Wild Woman and cobbled together some surrounding footage to make something of a story. The result comes across like Val Lewton on a really bad day. The supposedly scary scenes are done in Lewtonesque shadow, but come across as more clumsily cost-cutting than artful. Too bad so many distinguished players (Hinds, Dumbrille, Naish) are wasted in what must have been an embarrassment. I just hope Ankers & Carradine got compensated for the reuse of their earlier footage. But I doubt it given studio dominance of the period. No need to go on. Suffice that this is about the nadir of human-into-animals that were so popular at the time. As Lewton knew, horror needs more than shadow; it needs concept, dread, and mood, elements in short supply here."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": ["Paula the ape woman (Acquanetta) is alive and well, and running around a creepy old sanitarium run by the kindly Dr. Fletcher (J. Carrol Naish), also reverting to her true gorilla form every once in a while to kill somebody."],
      "budget": 0
   },
   "movielensId": 176215,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-06-01",
      "dvdReleaseDate": null,
      "directors": ["Reginald Le Borg"],
      "runtime": 61,
      "movieId": 176215,
      "title": "Jungle Woman",
      "mpaa": "",
      "actors": [
         "Acquanetta",
         "Evelyn Ankers",
         "J. Carrol Naish",
         "Samuel S. Hinds",
         "Lois Collier",
         "Milburn Stone",
         "Douglass Dumbrille",
         "Richard David",
         "Nana Bryant",
         "Pierre Watkin",
         "Christian Rub",
         "John Carradine",
         "Edward M. Hyans Jr."
      ],
      "imdbMovieId": "0036975",
      "originalTitle": "Jungle Woman",
      "genres": [
         "Drama",
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Paula the ape woman (Acquanetta) is alive and well, and running around a creepy old sanitarium run by the kindly Dr. Fletcher (J. Carrol Naish), also reverting to her true gorilla form every once in a while to kill somebody.",
      "tmdbMovieId": 84710,
      "avgRating": 1.5,
      "releaseYear": "1944",
      "numRatings": 1,
      "posterPath": "/udZ3hvhC52su7UQrGsIyDxK7IQA.jpg"
   }
}