{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0118662",
      "video": false,
      "title": "Ayn Rand: A Sense of Life",
      "recommendations": [],
      "backdrop_path": "/p5140Y3Y6iyt6uWnnuFqwXH4H2w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe479fc3a36847f813fc9b",
               "name": "Michael Paxton",
               "profile_path": null,
               "id": 939416,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe479fc3a36847f813fca1",
               "name": "Michael Paxton",
               "profile_path": null,
               "id": 939416,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.798612,
      "production_countries": [],
      "id": 49645,
      "vote_count": 3,
      "budget": 0,
      "overview": "Ayn Rand was born in 1905 in St. Petersberg, Russia. She escaped to America in 1926 amidst the rise of Soviet Communism. She remained in the United States for the rest of her life, where she became a much respected author of The Fountainhead and Atlas Shrugged. The themes of freedom and individualism were to be her life's passion...",
      "similar": [],
      "original_title": "Ayn Rand: A Sense of Life",
      "runtime": 145,
      "poster_path": "/8csiFTFkikhW7XgonmWhibH3tRo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-02-13",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "A life more compelling than fiction.",
      "adult": false,
      "homepage": "http://www.aynrandasenseoflife.com/asol.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Michael Paxton"],
      "runtime": 145,
      "synopsis": null,
      "writers": ["Michael Paxton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118662/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0ODQ0NzczNF5BMl5BanBnXkFtZTcwNDIyNTAyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Sharon Gless, Michael S. Berliner, Harry Binswanger | See full cast and crew »"],
      "reviews": [
         "The memorable, and ultimately appalling, thing about Ayn Rand: A Sense of Life,the new film biography of the right-wing novelist-philosopher, is that it is perfectly true to its subject. Just as Rand, who was born in 1905 in Leningrad as it was convulsed by revolution, declared that she had not changed her ideas about anything since the age of 2½, this reverential documentary presents her thoughts as uncontested truth. The evangelical tone is set by filmmaker Michael Paxton, quoted in the press material as saying that he first found Ayn Rand when he was an adolescent trying \"to find a book that would answer all of my questions and give my life meaning.\" A Sense of Life contents itself with interviewing her friends and acolytes. It acknowledges that she was much criticized, and even considered a crank, but her critics don't appear on screen and their views are not explained. But neither Rand nor the film should be dismissed, if only because she is widely read and her ideas have been deeply influential. They lie behind much neo-conservative commentary, which recasts democracy -- essentially an untidy contest of ideas and interests -- as a secular religion (she called it Objectivism) where competing points of view are greeted with adolescent impatience. But more particularly, Rand's influence helps explain the concealed romanticism of much right-wing commentary, which replaces iconic figures from other belief systems with buccaneering businessmen and entrepreneurs. As this film unwittingly makes clear, Rand herself was one of the great romantics. A worshipper of Hollywood, and partly successful screenwriter, she laments that the film version of her novel The Fountainhead \"lacked the Romanticism of the German films she had loved as a youth.\" That these films were the precursors of fascism seems to have escaped the notice of Rand and her disciples. This appealing simplicity, a charming oblivion to her own contradictions, gave Rand a widespread following among those looking for answers, even as it exasperated intellectuals. She believed that each individual has a sacred core of personal talents and dreams which can be expressed in a free society. People may choose to co-operate, but these choices must ultimately serve their self-interest. If an action is truly selfless, she often said, it is \"evil.\" Her reasoning was that selflessness in one's own life can be enlisted by political systems such as communism that call on human beings to sacrifice themselves for the state. These views were apparently burned into Rand's consciousness by the horrors she witnessed during and after the Russian Revolution -- a period the film recalls through family photographs and archival film footage. She decided that capitalism was the only hope for mankind. \"Capitalism leaves every man free to choose the work he likes,\" she declares on screen, oblivious to the deadening monotony of most people's jobs, not to mention unemployment. Like her spiritual successors she prefers the grand and distant vista, and does not approach closely to see the outcasts and victims who are part of every great undertaking. She loved \"the view of the skyscrapers where you don't see the details,\" declares the film, unselfconsciously. This made her a formidable popular writer. She was seriously able to declare that Marilyn Monroe seemed to have come from an ideal, joyful world, that the star was \"someone untouched by suffering.\" The hero of her last novel, Atlas Shrugged,was the direct descendant of Cyrus, the hero of a boy's adventure story she read at the age of 16. Like most libertarians, she had a deeply childish world view. Never beautiful, Rand's intensity (and searching black eyes) seduced more than a few men. According to Harry Binswager, one of her academic admirers, \"her idea of feminity was an admiration of masculine qualities.\" This was also Hitler's idea of feminity, and Rand's screenplays invariably include an idealized hero or heroine standing on a distant promontory, Leni Riefenstahl-style, but these fascinating parallels are of course not examined in A Sense of Life. Rand had a powerful, if not searching, intellect. In many on screen interviews seen in the film, she gives apparently convincing answers to her critics. But the answers are always framed in absolutes -- \"man wants freedom, suffering has no importance\" -- which are essentially empty postulates. But they have an attractive ring. A Sense of Life is worth seeing because its naive presentation of Rand is consonant with Rand herself. In fact, it feels like nothing so much as an in-house biography of the founder of some fundamentalist religious sect. It acknowledges its subject's imperfections (her infidelity to her husband of 50 years, for example), but only to declare them redeemed by her quest for truth. Rand was, of course, a lifelong atheist. But her work is a testament to the yearning for belief. The film concludes on a lingering shot of a poster for Atlas Shrugged,\"Don't call it hero worship: it's a kind of white heat where philosophy becomes religion.\" Or, perhaps, the ashes that are left when you turn up the temperature on a new belief system to the point where human community and compassion are burnt away. Conrad Alton, Filmbay Editor.",
         "Let's face it. Every documentary is biased. No matter how objective (forgive the situational wordplay) a documentary filmmaker wants to be in presenting his/her subject, he/she has a point of view, or else why bother making the film at all? The problem here is not Michael Paxton's bias, although he is clearly an adoring fan of the writer/philosopher. The problem is that in painting a portrait of this equally celebrated and vilified woman, he never shows, and only barely tells of, the vilification. As a result, he doesn't give viewers, not even her most ardent admirers, reason to celebrate her. The film mentions in passing some of her flaws as a person, and repeatedly talks of the criticism surrounding her ideas. But we never hear any of the criticism, any of the arguments against, anything at all to cast her in the light of \"defender of the faith,\" or defender of anything at all, for that matter. She states her case time and again, in interviews, in excerpts from her novels and philosophical works, etc. But we're left with a feeling of \"Great. Why should I care?\" Not many people will see this film -- 2 1/2 hour docs rarely draw the masses in theater, on video or anywhere else -- so I'll make a rather simplistic analogy. Think of \"Star Wars\". How compelled would we be to root for the good of the force if we hadn't heard Darth Vader expound on the power of evil (the Dark Side)? How can you convince anyone of any point, positive or negative, without at least presenting the counterpoint? Viewers who already adore Rand will no doubt cheer this film. For them, it's very palatable candy. Her detractors shouldn't waste their time. But a documentary is supposed to educate viewers in some way, and the uneducated will get nothing more than a biography and an unquestioned statement of philosophy. That's not much for any doc, but especially for one this long.",
         "I've been interested in Ayn Rand ever since I read \"Atlas Shrugged\" when I was only 22 years old. I didn't quite get everything Ayn was trying to say in that book at the time, and I chalked it up to my lack of life experience given my youth. When I was 40, I ran across this documentary on public TV. I figured that since 18 years had passed, watching this documentary combined with my maturity would enable me to understand Ayn Rand. This biography is a very sanitized version of Ayn Rand's life. The biography is accurate if not complete, since there is a lack of balance in the presentation due to the absence of information that shows the flawed and even somewhat \"kookie\" facets of the woman. For example, she encouraged her followers to smoke to highlight mankind's dominance over fire. The film also makes out her relationship with her husband, Frank, to be an ideal romance that lasted for decades. In fact, Ayn cheated on Frank for years with colleague Nathaniel Branden. To give her credit, she was true to her philosophy in being \"objective\" about the affair in the sense that she insisted that both her and Branden's spouse know what was going on. She ceased being objective, though, when Branden tired of her and began having an affair with a younger woman. She threw Branden and his research out the door with all of the emotion of any human being whose heart was being \"subjectively\" stomped on. I bring these points up not for the purpose of character assassination. Instead, I think that that it is difficult to get a balanced view of someone whose life work was pronouncing how life should be lived without examining the both the flaws and triumphs in that person's own life. The documentary did give me some insight into Ayn Rand's philosophy, though, and I'll have to say that she seems to be someone who threw the baby out with the bath water at every turn. As a youth in Russia, prior to the Russian revolution, she saw the failure of the Russian orthodox church to connect with the parishioners and help their lives in any way. This caused her to become an atheist without causing her to explore if it was in fact that this particular institution of religion was the failure, rather than the concept of God. After the revolution she saw the utter failure of the policies of Communism, and this caused her to believe that pure unadulterated capitalism is the only economic system that works, not bothering to realize that there might be a middle ground that looks out for society's weaker members while also rewarding enterprise and hard work. The fact that Ayn was what is an \"odd bird\" in 21st century America - an atheist capitalist - can only make me wonder what she would have to say about today's situation of fundamentalist Christian dogma intertwined with cut-throat capitalism that has become today's Republican party. If you are interested in learning the main points about Ayn Rand's life, this is a good source for the facts and even some insights - particularly good are the clips from her appearances on the Donahue show shortly before her death. However, realize that this biography is somewhat sanitized.",
         "I may not agree with most of Ayn Rand's philosophy, but I do consider her a great fiction writer, and I found this documentary tremendously interesting in all aspects. \"The Fountainhead\" is one of my favorite books of all time, as it speaks of mediocrity becoming the highest standard by which all is compared - just watch \"American Idol\" some time and see it in action. She was right. The book was a tremendous eye-opener for me as an artist. I didn't know much about her until I saw this; she was a most fascinating and unusual woman. The documentary covers Rand's life and work in great detail. It includes her affair with Nathaniel Branden, which didn't seem to keep her from loving her husband - her interview after her husband's death (I believe with Phil Donahue) was remarkable as she speaks about her lack of belief in an afterlife. If she believed in it, she goes on to state, she would have contemplating killing herself in order to join him. I have to admit that my favorite part of the documentary was a description of the making of the film \"The Fountainhead.\" Rand was apparently a woman first and a philosopher second. She adored Gary Cooper from the time she first came to Hollywood and worked as an extra in silent films. Thrilled that he would be starring in \"The Fountainhead,\" there is a photo of her gazing lovingly up at the tall and gorgeous Cooper. I don't remember how many years it took Rand to write the hero's final speech in the book...but after it was filmed, Cooper admitted he really hadn't understood it. As intellectual as she was, I doubt it changed her opinion of him.",
         "As someone who spent a lot of time reading and thinking about Rand's ideas many years ago, I found this film very informative and entertaining. It presents Rand with just the right breath of grandeur. It shows her the way I like to think of her. Like Thomas Jefferson, flaws in Rand's personal life throw a bit of shadow on her intellectual triumphs. This is not to suggest that Rand's achievements come close to Jefferson's. But, like Rand, his lifestyle contradicted his life's major achievement: the Author of The Declaration of Independence was a slaveholder. In Rand's case, the champion of individualism surrounded herself with a \"Collective\" of yes-men (and -women) that systematically excluded anyone who didn't toe the line on matters of philosophy, religion, aesthetics, and even cigarette smoking. Incredibly, this champion of \"independent judgement based on facts\" would actually forbid her followers from reading things written by people she deemed \"evil.\" But, just as a tribute to Jefferson might not dwell on slavery at Monticello or mention Sally Hemmings, this love letter to Ayn doesn't explore her problematic social life or her peculiar band of followers. But I still think this documentary earned its accolades from the film industry. Ayn Rand probably would have approved of the film herself.",
         "I find this film to be little more than veneration for a woman who claimed she had no time for veneration but was more than willing to have people worship her. Rand was a hypocrite. At the end of her life she took Medicare for her lung cancer which was due to her lifetime of smoking. Thats not even mentioned in the film. I gave Rand's ideas my full attention for some 3 months a few years ago and was intrigued by them before coming to the conclusion her ideas are badly flawed. I read the Fountainhead and a number of her essays but didn't get far with Atlas Shrugged, by then I'd had enough. I'm a geriatric nurse, and I meet many people near the end of their lives and I meet their families, and see the quality of their relationships (or lack there of) and I can tell you, consistently, its those who live and care for others and open themselves and receive the care of others who have the happiest lives. I see it again and again and again. There's a name for it, its called love. Rands \"individualism\" is suicidal for the individual, the family and society. I'm rating this film so low because it does little more than promote these ill gotten ideas.",
         "Documentary (narrated by Sharon Gless) about the life and times of author/philosopher Ayn Rand. Movies goes into exhaustive detail about her coming here from Russia, her \"objectivism\" philosophy, her books, her whole entire life. The film is too long (2 1/2 hours) and gets repititous at times (we hear about every single aspect of objectivism--it's not necessary and really weighs the movie down). Nonetheless, it is interesting and (I think) worth seeing for people who like or are interested in Rand. If you don't like her stay away.",
         "This film was nominated for Best Documentary - Academy Award and has received numerous awards. It is not 'shallow' at all, but is instead a true story of one of the most heroic women of our age. It tells the events of a young girl born in the squalor of Communist Russia who came to America embracing its ideals and becoming one of he most widely read authors and philosophers in American history. He book 'Atlas Shrugged', according to the US Library of Congress, is rated by Americans as the second most influential book, with only the Bible rated higher. Her books increase in sales each year and sell hundreds of thousands of copies annually. Her early book 'the Fountainhead' was, and still is selling widely and was made into the famous movie staring Gary Cooper and Patricia Neal. This film is a powerful inspirational one that any one will find informative and motivating as a true story of a great American heroine. It contains commentary by those closest to her, and is considered by most the best presentation of the actual events of her life.",
         "This documentary presents a well organized and concise picture of one of the most important thinkers of our time. If you don't know much about Ayn Rand, this film is worth watching, if only to be introduced to her ideas. Even though her philosophy is more aligned with the founding principles of America than that of any other 20th century thinker, she is all but discarded in American public schools. The popularity of twentieth century anti-mind/anti-humanism philosophies, amongst the Ivory Tower, has muted the voice of Ayn Rand in the classroom. If you grew up in the United States, you probably missed out on her side of the debate altogether. Rand's ideas are worthy of your consideration, and they're highly worthy of serious critical review. I hope you will take the review of this film written by ChrisWN with an entire shaker of salt. The size of the shaker is up to you, but you should know that the immature ranting of ChrisWN is typical of those who despise Ayn Rand. Let the fatuous nature of his writing be the measure by which he should be taken seriously as a film critic or as a critical thinker. And, further, let his ramblings be recorded as representative of the opposite of Ayn Rand's devotion to reason.",
         "Ayn Rand has helped me to have an integrated view of life. She teaches for reason and trade, instead of faith and force. She is against mysticism, which rules by means of guilt, by keeping men convinced of their insignificance on earth. She is against the dogma of man's poverty and misery on earth. She teaches you to face the universe, free to declare your mind is competent to deal with all the problems of existence and that reason is the only means of knowledge. Ayn Rand states that intellect is a practical faculty, a guide to man's successful existence on earth, and that its task is the study of reality (as well as the production of wealth), not contemplation of unintelligible feelings nor a special monopoly on the \"unknowable\". She is for that productive person who is confident of his ability to earn his living - who takes pride in his work and in the value of his product - who drives himself with inexhaustible energy and limitless ambition to do better and still better and even better - who is willing to bear penalties for his mistakes and expects rewards for his achievements - who looks at the universe with the fearless eagerness of a child, knowing it to be intelligible - who demands straight lines, clear terms, precise definitions - who stands in full sun light and has no use for the murky fog of the hidden, the secret, the unnamed, or for any code from psycho-epistemology of guilt. Her words will help people to free themselves from fear and force forever. Thanks Ayn for you direction. She has given me an integrated view of life. I hope, by reading her books, you get it too."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": [
         "AG Media Corporation Ltd.",
         "Copasetic Inc."
      ],
      "summaries": ["Ayn Rand was born in 1905 in St. Petersberg, Russia. She escaped to America in 1926 amidst the rise of Soviet Communism. She remained in the United States for the rest of her life, where she became a much respected author of The Fountainhead and Atlas Shrugged. The themes of freedom and individualism were to be her life's passion, and would win her a devoted following among readers. Her books continue to sell over 300,000 copies each year. Upon her arrival in America, Ayn Rand applied for a screenwriting position at the DeMille Studios in Hollywood. On that same day, a chance meeting with DeMille brought her to the set of The King of Kings where she was hired as an extra for the film. But, it wasn't until her 1936 Broadway success, Night of January 16th, that she first achieved fame as a writer. The play, a courtroom drama that was tried before a jury drawn from the audience each night, had two endings for each verdict. Although a success, it was Ayn's first struggle to keep the integrity of her script intact from those who did not share her vision."],
      "budget": 0
   },
   "movielensId": 1780,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-02-13",
      "dvdReleaseDate": "1999-10-19",
      "directors": ["Michael Paxton"],
      "runtime": 145,
      "movieId": 1780,
      "title": "Ayn Rand: A Sense of Life",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0118662",
      "originalTitle": "Ayn Rand: A Sense of Life",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Ayn Rand was born in 1905 in St. Petersberg, Russia. She escaped to America in 1926 amidst the rise of Soviet Communism. She remained in the United States for the rest of her life, where she became a much respected author of The Fountainhead and Atlas Shrugged. The themes of freedom and individualism were to be her life's passion...",
      "tmdbMovieId": 49645,
      "avgRating": 3.24662,
      "releaseYear": "1998",
      "numRatings": 148,
      "posterPath": "/8csiFTFkikhW7XgonmWhibH3tRo.jpg"
   }
}