{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119305",
      "video": false,
      "title": "Homegrown",
      "recommendations": [
         61418,
         14578,
         21119,
         157036,
         81844,
         25576,
         59232,
         13119,
         15398,
         17207,
         19033,
         51321,
         18856,
         76297,
         33175,
         112969,
         89904,
         10896,
         27265,
         14256
      ],
      "backdrop_path": "/7tygwODX38gnQ0xQElzFlnRhyzJ.jpg",
      "revenue": 271375,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Marsden",
               "gender": 2,
               "credit_id": "52fe47089251416c7508ba73",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Carter",
               "gender": 2,
               "credit_id": "52fe47089251416c7508ba77",
               "name": "Hank Azaria",
               "profile_path": "/oesvgZ1ubYSmLYmFtRYz7q7Zht2.jpg",
               "id": 5587,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe47089251416c7508ba7b",
               "name": "Kelly Lynch",
               "profile_path": "/2ZbV0mppAxxyh4mIG4HKTHfLkDM.jpg",
               "id": 6473,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe47089251416c7508ba7f",
               "name": "Jon Bon Jovi",
               "profile_path": "/pqqJ2JN4vbXQBsjwzDDw8cSK2XL.jpg",
               "id": 32362,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Harlan Dykstra",
               "gender": 2,
               "credit_id": "52fe47089251416c7508ba83",
               "name": "Ryan Phillippe",
               "profile_path": "/8MlC0rqhMpDxnfFjmw2DKOhdVpB.jpg",
               "id": 11864,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Polizist",
               "gender": 2,
               "credit_id": "52fe47089251416c7508ba87",
               "name": "Judge Reinhold",
               "profile_path": "/dra8yOHLV8yqXSdwBueXeaDsLXV.jpg",
               "id": 777,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Gianni Saletzzo",
               "gender": 2,
               "credit_id": "52fe47089251416c7508ba8b",
               "name": "Ted Danson",
               "profile_path": "/wWm9eDLuPDw29R76KAjg6gIE9dS.jpg",
               "id": 12836,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Malcolm / Robert Stockman",
               "gender": 2,
               "credit_id": "52fe47089251416c7508ba8f",
               "name": "John Lithgow",
               "profile_path": "/uquz3dZ0fs0lAK57lCXwxaslVkb.jpg",
               "id": 12074,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Sierra Kahan",
               "gender": 1,
               "credit_id": "52fe47089251416c7508ba93",
               "name": "Jamie Lee Curtis",
               "profile_path": "/c4poMDwQ0nUj81m4WPriiv96ExZ.jpg",
               "id": 8944,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Christina",
               "gender": 1,
               "credit_id": "583f66b39251417f74000690",
               "name": "Maggie Gyllenhaal",
               "profile_path": "/dgFGI8y7QUKkwI1o0pJaZtjR30m.jpg",
               "id": 1579,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Jake",
               "gender": 2,
               "credit_id": "59e392fd9251410b670003d4",
               "name": "Jake Gyllenhaal",
               "profile_path": "/wRgIPBzVzIIhWcdJAduPOKJJHsL.jpg",
               "id": 131,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47089251416c7508ba99",
            "name": "Stephen Gyllenhaal",
            "profile_path": "/sGBf5Pz5Mxwd2eLWZemCxSe6mQX.jpg",
            "id": 15912,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.517685,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17133,
      "vote_count": 22,
      "budget": 0,
      "overview": "Three laborers on a Northern California marijuana plantation become increasingly paranoid when they learn that their boss has been murdered. They know enough to run, taking with them enough of the crop to pay them for services rendered. Hooking up with go-between Lucy in the next town, they plot their next move.",
      "similar": [],
      "original_title": "Homegrown",
      "runtime": 102,
      "poster_path": "/baTGnGmmNXEdYH7e2fLcrmIqAbq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-01-01",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stephen Gyllenhaal"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Jonah Raskin",
         "Stephen Gyllenhaal"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119305/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NjEzNzYyMl5BMl5BanBnXkFtZTYwMjM1Njg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Billy Bob Thornton, Hank Azaria, Kelly Lynch | See full cast and crew »"],
      "reviews": [
         "Homegrown is a very nice and inspirational film about three farmboy dope growers and their \"community\" of likeminded folk. After their boss Malcolm (John Lithgow) is assassinated, the hapless and frequently high trio have to try and improvise to get paid. Homegrown is also a strongly feminist movie, in the best sense of the word, in that all the women are in fact the real actors behind the events as they unfold. What do our three hapless heroes do when they get in trouble and need a place to crash? Lucy (Kelly Lynch) is the first port of call, and she isn't afraid to use sex to get any info she needs. Who is really taking care of business when the community is threatened to be invaded by mafiosi? All in all, this is a very inspirational movie. It makes you feel you want to go out and grow some of your own herb. I can see how a lot of people got nervous about a movie where the main characters are pot growers. However, if you take into account that pot is just another plant, it's hard to see what the trouble is about. The producers tried to sell this as a \"comedy\", and there are plenty of laughs, but don't wait for canned laughter or any other cues. There are several marijuana inspired songs, Bob Marley's \"Smoke Two Joints\" and Musical Youth's \"Pass The Dutchie\", just to name two. It is more of a caper/suspense/comedy movie.",
         "This is a pretty good movie heavily influenced by John Huston's \"The Treasure of the Sierra Madre\" with Humphrey Bogart, but original in its content and conflict. It is not so much a comedy as a quirky drama, like Treasure, though its point is not as sharp at the end. You should see Treasure (again) before or after seeing this.",
         "A fun romp...a lot of good twists and turns! (and we were not even baked!) Didn't know this movie even existed until watching the extra trailers on a Monty Python DVD...(oddly it was there along with The City of Lost Children, and The Adventures of Baron Munchauhsen) The plot keeps you wondering throughout. The acting was awesome...Hank Azaria shows his talent again, Bill Bob is Billy Bob...(wecis?) Definitely worth watching.",
         "This film was marketed as a comedy but anyone who went into it expecting \"Half Baked\" was probably dissapointed. Instead of a mindless stoner-comedy, we get a good solid film that is equal parts drama/comedy/thriller. It's the story of a group of pot farmers who, after seeing their boss murdered, decide to cash in the crop for a cool 3 million. Needless to say, things turn out to be a bit more complicated than expected and getting the money takes a back seat to getting themselves out of this bind that they have done such a good job of getting themselves into. The three central characters, Jack (Billy Bob Thornton), Carter (Hank Azaria) and Harlan (Ryan Phillipe) are working for Malcomn (John Lithgow), manning the pot farm, when Malcom is killed by his own helicopter pilot. Thinking they know way more than they actually do, they decide to take charge of the situation and finish out the job. Jack poses as Malcomn (none of Malcomn's customers have ever actually seen what he looks like) and becomes the natural leader while Carter and Harlan bumble around doing the grunt work. Things go a little over Jack's head when mob boss \"Gionni the wop\" (played hilariously by Ted Danson) enters the picture. Pretty soon it's paranoia time for the three stooges and their mutual girlfriend Lucy (Kelly Lynch), fighting off rippers, avoiding hitmen, and trying to find a buyer, all without getting caught by the feds (all the local cops are paid off). There are many plot twists in Homegrown and the acting is great from a huge ensemble cast. Hybrids like this rarely work completely and Homegrown does sputter occassionally. There are a few scenes that leave you wondering if they are supposed to be funny. One thing that is highly overlooked and misunerstood about this film is how it makes you feel just like the characters. It totally succeeds in putting you in the same boat with them and making you feel the same things that they are feeling. All in all, I give this movie a 9/10 and I highly reccomend it. It DOES NOT glorify the use and distribution of marijuana (many would like to argue that point) but merely uses it as a backdrop for what is going on. Give it a run. I especially reccommend this one to Billy Bob Thornton fans. He is so perfect in his role that you can almost smell the weed on him.",
         "Well, it's a weird movie. That Stephen Gyllenhaal seems to LIKE weirdness, really. The fact that the film is billed as a comedy should not be considered an indictment. A film is made because someone decided to try to share this particular story with you--NOT because he wanted to add another movie to some given drawer/shelf in a video rental store, nor because he wanted to make things easy for the marketing department. I know the film wasn't well-promoted, but looking at the movie itself, I think it's actually a pretty innovative piece of work. What really makes the film work is the ambiguity and (ok, I admit it) PARANOIA of it. If you've found yourself wondering what any particular scene adds to this movie, I fear you've fallen victim to lack of imagination. The characters never know \"who knows what,\" and that is the single most essential premise of the movie. The film uses a far stronger perspective of first-person perspective than such bubble-gum fare as the Matrix. When the hapless dope-growers meet the first distributor they're looking to do business with, they don't know whether he's \"in on everything.\" When BB Thornton talks to Sienna, he has no idea what SHE knows about the situation...and in fact, no matter how you choose to interpret that particular scene, you really ought to acknowledge that perhaps the \"reality\" (cinematically speaking) is the complete opposite of what you first thought when you watched it. Almost every meaningful dramatic scene in the film is completely ambiguous in possible interpretation. At least up until the climax. This is a film that truly does get better with repeated viewings, IF you have the patience for a movie that doesn't spell everything out for you. If you want a heavy musical score and a didactic moral \"point,\" stick with Spielberg. He'll never disappoint. If you want to WONDER what the characters are really up to in a film, check this one out. The cast is terrific, the story is novel if not earthshaking, and the polish and presentation are first-rate. It has a few minor editorial flaws--I could've done without Lithgow's late appearance, or some of the \"feel-good\" moments laced into the script early on, but I certainly don't think someone else would have done a better job with the concept and script...unless Kubrick or Fassbinder were still alive. 8.5 out of 10.",
         "The first half hour of \"Homegrown\" was rather boring and not absorbing, but as the film progressed, so did my interest in the characters and the plot. Several scenes are really scary and you fear for the main characters who you actually grow attached to. The story is about three hired hands on a hidden illegal marijuana farm in southern California. They witness the murder of the farm's owner, Malcolm (John Lithgow), and they take over the weed for their own. The three rather simple-minded farm hands soon get swept up into a scary world of mafia and local interest, while all of the time trying to convince everyone that Malcolm is still alive. While the movie had several faults and a slow beginning, it turned out to be worthwhile. 7/10 stars.",
         "The tabloid fodder and poor film choices aside, it's still pretty clear why Billy Bob Thornton is considered a quirky actor of genuine merit. Here he heads up a strong cast of low-keyed eccentrics, and he's the best thing in the picture--a bona fide movie star for perhaps the first time. Director/co-writer Stephen Gyllenhaal is an odd filmmaker: the subjects he's drawn to and the crazy spin he puts on the situations can be fascinating, even while he takes his time mounting his story. \"Homegrown\", about three not-too-bright marijuana growers who try taking over their boss' business affairs after the guy is murdered, is a rather thin black comedy helped by a frazzled, funny last-act. For the first hour, however, there doesn't seem to be a whole lot happening, even though the actors hold interest. It's sadly too disconnected and too minor to make the grade. ** from ****",
         "A fun romp...a lot of good twists and turns! (and we were not even baked!) Didn't know this movie even existed until watching the extra trailers on a Monty Python DVD...(oddly it was there along with The City of Lost Children, and The Adventures of Baron Munchauhsen) The plot keeps you wondering throughout. The acting was awesome...Hank Azaria shows his talent again, Bill Bob is Billy Bob...(wecis?) Definitely worth watching.",
         "Not your ordinary movie, but a good one. Billy Bob is very funny in this movie, the way he talks, what he says etc. I was kind of surprised when i saw it, cause i just thought it was a normal comedy, but it was more than that. It had a very good story, great characters and a good balance. Favorite part: Probably when Billy Bob is running around in his robe shooting at the rippers",
         "Another example of a really good small film that didn't get the promotion or distribution it deserved. Billy Bob Thornton just gets better and better. This little film about the Northern California Dope Growers, is great. I disagree with the categorization of the film as a comedy. It is more of a drama with moments of comic relief, but it certainly entertains. There are no great life lessons to be taken from it. (well maybe there is one lesson. If you're doing something illegal, it's best not to have a gunfight in the parking lot thus calling attention to yourself) An incredibly good cast, cleverly written and well performed I'd give this one a solid 8."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Lakeshore International"],
      "summaries": ["Life is good for Jack, Carter and Harlan, three inept ne'r-do-wells who help run master dope-grower Malcoms flourishing marijuana plantation somewhere in northern California. But then Malcom is suddenly bumped off by a mysterious assailant, after a moment of panic, the naive trio decide to take over the business themselves. However, their lazy days on the dope farm have ill prepared them for the high-stakes game of finding buyers for millions of dollars of contraband. As they plunge into a shadowy new world of duplicity, double-dealing and danger, they soon find that they have gotten in way, way over their heads. But driven on by increasing greed and paranoia, it's too late to back out."],
      "budget": 0
   },
   "movielensId": 1824,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "1998-09-01",
      "directors": ["Stephen Gyllenhaal"],
      "runtime": 102,
      "movieId": 1824,
      "title": "Homegrown",
      "mpaa": "",
      "actors": [
         "Billy Bob Thornton",
         "Hank Azaria",
         "Kelly Lynch",
         "Jon Bon Jovi",
         "Ryan Phillippe",
         "Judge Reinhold",
         "Ted Danson",
         "John Lithgow",
         "Jamie Lee Curtis",
         "Maggie Gyllenhaal",
         "Jake Gyllenhaal"
      ],
      "imdbMovieId": "0119305",
      "originalTitle": "Homegrown",
      "genres": [
         "Drama",
         "Action",
         "Comedy",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Three laborers on a Northern California marijuana plantation become increasingly paranoid when they learn that their boss has been murdered. They know enough to run, taking with them enough of the crop to pay them for services rendered. Hooking up with go-between Lucy in the next town, they plot their next move.",
      "tmdbMovieId": 17133,
      "avgRating": 3.05853,
      "releaseYear": "1998",
      "numRatings": 504,
      "posterPath": "/baTGnGmmNXEdYH7e2fLcrmIqAbq.jpg"
   }
}