{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "insomnia",
            "id": 4142
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "cafe",
            "id": 14766
         }
      ],
      "imdb_id": "tt0116141",
      "video": false,
      "title": "Dream for an Insomniac",
      "recommendations": [
         14167,
         82520,
         181756,
         43079,
         63437,
         59940,
         34128,
         38349,
         33135,
         46286,
         298031,
         5187,
         73700,
         46989,
         18451,
         39806,
         26626,
         171698,
         102639,
         39213
      ],
      "backdrop_path": "/pDvVWPCQ6pqPVhD99XXxBuM14q.jpg",
      "revenue": 24,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Frankie",
               "gender": 1,
               "credit_id": "52fe44c99251416c9101cd99",
               "name": "Ione Skye",
               "profile_path": "/oiVKhuD2s4kNVnnAYUICtCjdzoC.jpg",
               "id": 3126,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Allison",
               "gender": 1,
               "credit_id": "52fe44c99251416c9101cd8f",
               "name": "Jennifer Aniston",
               "profile_path": "/4d4wvNyDuvN86DoneawbLOpr8gH.jpg",
               "id": 4491,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "David Shrader",
               "gender": 2,
               "credit_id": "52fe44c99251416c9101cda1",
               "name": "Mackenzie Astin",
               "profile_path": "/vmcRaz9K4cX4iOUcMSHsLcw0Two.jpg",
               "id": 60060,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rob",
               "gender": 2,
               "credit_id": "53e9121bc3a368398d003bd1",
               "name": "Michael Landes",
               "profile_path": "/xsA2xoqoAIqFzFhkFqasacIyyOj.jpg",
               "id": 57428,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Uncle Leo",
               "gender": 2,
               "credit_id": "52fe44c99251416c9101cd9d",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Juice",
               "gender": 0,
               "credit_id": "53e91234c3a368398d003bd4",
               "name": "Sean Blackman",
               "profile_path": null,
               "id": 1352286,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "B.J.",
               "gender": 0,
               "credit_id": "53e91248c3a3683995003b87",
               "name": "Michael Sterk",
               "profile_path": null,
               "id": 1352287,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44c99251416c9101cd95",
               "name": "Tiffanie DeBartolo",
               "profile_path": null,
               "id": 1031288,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53e91260c3a368399f003c51",
               "name": "Tiffanie DeBartolo",
               "profile_path": null,
               "id": 1031288,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.341696,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32284,
      "vote_count": 14,
      "budget": 0,
      "overview": "A girl with insomnia who works in a coffee house has impossibly high standards for her love and fears she will never meet a worthy man. Then in walks a new employee and they click - until she discovers he has a girlfriend. Undaunted, she moves to L.A. with a friend sure that he will dump the girlfriend and follow her. She puts all her faith in fate and hopes for the best.",
      "similar": [
         16980,
         979,
         23949,
         226,
         8443,
         1024,
         9769,
         638,
         2210,
         9962,
         9777,
         19913,
         1903,
         38,
         4771,
         281,
         50544,
         19053,
         11065,
         10575
      ],
      "original_title": "Dream for an Insomniac",
      "runtime": 90,
      "poster_path": "/Ak6Rz4dULyXPjPRKSl0z5xA8xJR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tritone Productions",
         "id": 29692,
         "origin_country": ""
      }],
      "release_date": "1996-04-18",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "A dreamer who couldn't sleep. An author who couldn't write. A friend who couldn't help but help.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Tiffanie DeBartolo"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Tiffanie DeBartolo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116141/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMTk3MjUzOV5BMl5BanBnXkFtZTcwNDU2MzczMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ione Skye, Jennifer Aniston, Mackenzie Astin | See full cast and crew »"],
      "reviews": [
         "While the acting gets a little corny at times, the vibe is definitely prevalent in this movie. It's got a good feeling. Simple plot, easy to follow, and while some of the time I found myself looking at my shoes, I was drawn into it. By the time Frankie meets David, I was hooked. The beginning is a little slow, and that's lethal for those out there with ADD. But I know for sure that myself as well as most of my friends have wished for the type of relationship Frankie and David have in this flick. You have seen the physical dramas where the girl is kidnapped and needs rescuing, and you've seen the emotional dramas where the girl is in the abusive relationship and he saves her from it and you've seen the really far-fetched movies where there's some kind of Monster/ Cyborg/ Evil Psycho trying to Kill/ Maim/ Eat her and the lead male saves her from it, but rarely, if ever, do you see one of these well-written, not so surreal movies wherein the girl wears real clothes, people make mistakes, and things are sometimes awkward. On purpose. It's refreshing to see, even if it means getting corny at times. There are few ways around cornball moments in life. Making life into film or even the dream of life and avoiding them is near impossible. Personally, I'd recommend this movie to anyone looking for a serious, rewarding, real-life type fictional romance. Give it a chance. See the whole thing. And don't you DARE look at your shoes.",
         "I'll admit that amongst my rabid obsession with horror films and morbid dramas, lies a deep love for witty romance films. I loved this one. The dialogue and characterization was surprisingly well done, and the story, although old, was played out well. The cast was excellent, too. Ione Skye is so beautiful, and very talented. She played the lonely girl perfectly. I cannot imagine a better actress for her part...her eyes said something to me while watching, as did her heart and soul she put into this role. Jennifer Aniston, whom I'm not a big fan of, was actually well written, and her knack for switching accents though out the film was quite funny. The standout character was David, played by Mackenzie Astin. He's a nice guy, plain and simple. His dialogue was witty, charming, and never went over the pretentious mark. His character actually meant something to me, and for once, I agreed with his role. I think he has a bright future ahead of him, and I even think he is a better actor than his older sibling, Sean. I loved the romance that built between David and Frankie. Even though we have seen this kind of mushy clap trap on screen several times before, it just seemed to work differently here. Overall, this is a surprisingly sweet, well acted and non-pretentious romance film that deserves more recognition. I loved it, very much.",
         "A charming little movie, made just around the time \"Friends\" (and Jennifer Aniston) were becoming huge. Jennifer Aniston, sporting her then famous 'The Rachel' haircut, is good in a supporting role; but it is Ione Skye that really shines. A lovely, independent little romantic comedy drama, that managed to find a place in my heart (I know - aw shucks and all that). Favourite line, issued by Ione Skye after the guy of her dreams has given her a cup of hot milk to help her slip (paraphrase): \"You're not going to make me drink any more warm white fluids ... are you?!\" WICKED!",
         "This is a great film: witty, charming, well-acted and wonderfully written. The characters are all played to perfection by an array of very talented young actors (especially MacKenzie Astin, who plays David). It has the perfect mixture of laughter and sorrow, sweetness and elegance. I particularly like this film because it relies on dialogue, characterization , and cinematography, three primary elements in filmmaking which have recently hidden themselves behind special effects, poor attempts at acting by egotistical actors, and weak plotlines like those of a dimestore romance novel. However, this film has a tight, entertaining plot, a cast of excellent actors, a wonderful cinematographer, and last but not least, heart.",
         "Captivating from beginning to end, this romantic comedy will woo language-lovers everywhere. A swift kick to the intellect, with a sugary-sweet story on the side. Quick dialogue, a solid cast, an almost surrealistic atmosphere and one of the most fitting soundtracks of the decade. There's little to complain about, maybe a few lines here and there that I believe could've been excluded from the script, but nothing detrimental to the over-all feel of the film. What I love most about the movie (aside from the obvious eye-candy of it being filmed both in black & white and color) was its undeniable originality. Of all the romance I've seen, this remains one of my absolute favorites. And it was the tiny little details that made it so. This woman did her homework, and she's delivered it with style. Favorite Lines: \"My grandmother used to call it a fi-fi. I mean, isn't that nice? A fi-fi?\" \"Never settle for anything less than extraordinary. Because, if you do, life will suck...\" \"Come on, would you want to do it with someone whose last name is the worst day of the week?\"",
         "One of the sweetest movies I've ever seen. It was a perfect, sweet, different kind-of feel good movie.",
         "Dream for an Insomniac is not a bad movie, nor is it a particularly good one. Writer/Director DeBartolo in her first attempt at doing either produces a film that has bright moments, a few good ideas, very little meaningful dialogue, and some moderately entertaining scenes. The black-and-white to color transition when Frankie first meets David Schrader is perhaps the most metaphorical and artistic achievement this movie makes. It is unfortunate that it is neither touching as a metaphor nor very artistic. The majority of the film centers around the interplay between Frankie and David. The interaction between the characters is labored and unbelievable, the dialogue being little more than witty banter and archaic quotes swapped back and forth. If DeBartolo had any intentions of the audience empathizing with the characters she failed to write them in such a way to elicit such empathy. Frankie remains reminiscent of a love-struck schoolgirl throughout the film, a glutton for punishment, while David Schrader feels two-faced, reluctant to leave his girlfriend but quite friendly and flirtatious with Frankie, who is quite obviously in love with him. If these characters existed in the real world, they would both seem too neurotic, emotionally unstable, needy, and self-centered to spend time getting to know. And yet in spite of this, DeBartolo manages to put together a film that is not terrible. Aniston's character, an aspiring actress who speaks in false accents during conversations to become believable in them, provides a solid supporting character that is much needed throughout the film. Juice, the slacker musician, finds his way on screen just about exactly when some comic relief is due. Some of the conversations, especially the one concerning the Holy Trinity of rock and roll, seem similar to something that could actually be heard in the real world, or at least the world of Generation X. And the subplot of Rob, the coffee-shop waiter reluctant to tell his father that he is a practicing homosexual, is actually quite endearing and entertaining. Dream for an Insomniac would have been a much better film had DeBartolo stepped down the massive intellectual undertones running rampant in the dialogue, given both main characters a healthy dose of Prozac, and focused on the basic but meaningful theme of romance in the 90s instead of showing off her obviously impressive knowledge of memorable quotes through her characters. If anything less than extraordinary is a waste of your time, then so is Dream for an Insomniac. If, however, you are willing to settle for a decent first attempt at a movie by a newcomer to writing and directing, lay down a couple of bucks for this film at your local video store.",
         "Unlike the other review for this film, I completely enjoyed this movie. From it's wonderful dialog to it's wonderful storyline. It's very rare to find an Indie Romantic Comedy that is this good, and I'd consider myself a pro on romantic comedies. It's my favorite genre, and Dream For An Insomniac is easily in my top 10 favorite Romantic Comedies of all time.",
         "OK - I agree Jennifer's accents were not that funny. But she did a convincing job as the friend who is in reality. She contrasts and complements the lead. now ione (i think thats her name )she plays Frankie - sometimes recites her lines perfectly, other times she strains to get them out w/o making it seem forced. but her positives outweigh the negatives, and when she needs to be on target she is. The guys were outstanding, though BJ was too gay. Roberto was played brillantly, i'm glad the guy has gotten past union square. but the award if i had one should be given to Mackenzie Astin, who was fabulous as David. He was just simply outstanding doing everything right! Good movie - got a different view of love - from the quirky side. it was fun, and gave hope to all that the perfect guy is out there.",
         "I get the impression that this is the director/writer's first film, and I have to say I was impressed. I like the script, although some of the characters seem to be a little exaggerated, particularly Leo. However, for the most part, it was well-written - I'm amazed this was a first try. My friends and I talk like the dialogue in this film so it really rang true to us. I hope she gets to make more films - we'll be waiting for them. The soundtrack rocks, too."
      ],
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Dream for an Insomniac",
         "Tritone Productions"
      ],
      "summaries": [
         "A girl with insomnia who works in a coffee house has impossibly high standards for her love and fears she will never meet a worthy man. Then in walks a new employee and they click - until she discovers he has a girlfriend. Undaunted, she moves to L.A. with a friend sure that he will dump the girlfriend and follow her. She puts all her faith in fate and hopes for the best.",
         "Girl leads a lonely life until she meets the boy of her dreams. The boy, however, has a live-in girlfriend."
      ],
      "budget": 0
   },
   "movielensId": 1902,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-04-18",
      "dvdReleaseDate": "2003-04-08",
      "directors": ["Tiffanie DeBartolo"],
      "runtime": 90,
      "movieId": 1902,
      "title": "Dream for an Insomniac",
      "mpaa": "R",
      "actors": [
         "Ione Skye",
         "Jennifer Aniston",
         "Mackenzie Astin",
         "Michael Landes",
         "Seymour Cassel",
         "Sean Blackman",
         "Michael Sterk"
      ],
      "imdbMovieId": "0116141",
      "originalTitle": "Dream for an Insomniac",
      "genres": [
         "Romance",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A girl with insomnia who works in a coffee house has impossibly high standards for her love and fears she will never meet a worthy man. Then in walks a new employee and they click - until she discovers he has a girlfriend. Undaunted, she moves to L.A. with a friend sure that he will dump the girlfriend and follow her. She puts all her faith in fate and hopes for the best.",
      "tmdbMovieId": 32284,
      "avgRating": 3.26412,
      "releaseYear": "1996",
      "numRatings": 301,
      "posterPath": "/Ak6Rz4dULyXPjPRKSl0z5xA8xJR.jpg"
   }
}