{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0066811",
      "video": false,
      "title": "The Barefoot Executive",
      "recommendations": [
         39526,
         46667,
         35115,
         50717,
         22614,
         22777
      ],
      "backdrop_path": "/dLIeLXOX7aZCGx7dTXTWIAcMQYk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Steven Post",
               "gender": 2,
               "credit_id": "52fe43dbc3a368484e0020dd",
               "name": "Kurt Russell",
               "profile_path": "/rlnFuNkisPpuypARI7QaGCmOY6V.jpg",
               "id": 6856,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Francis X. Wilbanks",
               "gender": 2,
               "credit_id": "52fe43dbc3a368484e0020f3",
               "name": "Joe Flynn",
               "profile_path": "/jUZjkepueZTzW6X4PaaMwPxD95.jpg",
               "id": 23586,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "E.J. Crampton",
               "gender": 2,
               "credit_id": "52fe43dbc3a368484e0020f7",
               "name": "Harry Morgan",
               "profile_path": "/xQlBwecEQEz84k7jDLPGi6FqxRJ.jpg",
               "id": 4073,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mertons",
               "gender": 2,
               "credit_id": "52fe43dbc3a368484e0020fb",
               "name": "Wally Cox",
               "profile_path": "/tU5QNlJQKqE48JACDrBlw4wHW0x.jpg",
               "id": 100019,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jennifer Scott",
               "gender": 0,
               "credit_id": "52fe43dbc3a368484e0020ff",
               "name": "Heather North",
               "profile_path": "/xbYWJVOnBIQSHDBK3YNKrOkmQ5c.jpg",
               "id": 96340,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Farnsworth",
               "gender": 2,
               "credit_id": "52fe43dbc3a368484e002103",
               "name": "Alan Hewitt",
               "profile_path": "/yvbIwqOPKZFsJG9A1AEKHY2tny7.jpg",
               "id": 73943,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Clifford",
               "gender": 2,
               "credit_id": "52fe43dbc3a368484e002107",
               "name": "Hayden Rorke",
               "profile_path": "/mTeOA8C0j4ha8MF1CSfQjdLSni0.jpg",
               "id": 40623,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Roger",
               "gender": 2,
               "credit_id": "57150fb292514146c8000857",
               "name": "John Ritter",
               "profile_path": "/2WIkWe5UASXpZgLQ1pMTtHNJKJX.jpg",
               "id": 27772,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43dbc3a368484e0020e3",
               "name": "Joseph L. McEveety",
               "profile_path": null,
               "id": 101773,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dbc3a368484e0020ef",
               "name": "Robert Butler",
               "profile_path": null,
               "id": 101767,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5715102ac3a368667800d068",
               "name": "Lila Garrett",
               "profile_path": null,
               "id": 1218840,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "57151041c3a3682e65000782",
               "name": "Bernie Kahn",
               "profile_path": null,
               "id": 1441978,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "57151074c3a3682f4500079b",
               "name": "Stewart C. Billett",
               "profile_path": null,
               "id": 1607524,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "575dfb67c3a3687f6300038c",
               "name": "Robert F. Brunner",
               "profile_path": null,
               "id": 226002,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "575dfb6ec3a36806ad000ee7",
               "name": "Charles F. Wheeler",
               "profile_path": null,
               "id": 12119,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "575dfb759251415dd20049bf",
               "name": "Robert Stafford",
               "profile_path": null,
               "id": 109454,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "575dfb7c9251411bc5000367",
               "name": "Ed Graves",
               "profile_path": null,
               "id": 224960,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "575dfb839251411c4d000337",
               "name": "John B. Mansbridge",
               "profile_path": null,
               "id": 12869,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575dfb89c3a36806ad000ef1",
               "name": "Emile Kuri",
               "profile_path": null,
               "id": 17670,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "575dfb8f9251411c1b00032a",
               "name": "Frank R. McKelvy",
               "profile_path": null,
               "id": 1332196,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "57d0be1e92514173ac004d5a",
               "name": "Bill Anderson",
               "profile_path": null,
               "id": 49962,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.011916,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20173,
      "vote_count": 12,
      "budget": 0,
      "overview": "In the great Disney tradition of wild family fun, a young Kurt Russell stars as Steven Post - an ambitious mailroom clerk at a second-rate TV network. With his eye on the boardroom, and getting nowhere with the studio's top dog, he makes a career-changing discovery. His girlfriend's lovable pet chimp can pick a hit show every time! His secret for success turns into a madcap monkey business when he makes vice president and jealous rivals want in on the act. Ride along with narrow escapes and a classic cast featuring Joe Flynn and Harry Morgan in a comedic climb up the corporate ladder that will leave you howling for more!",
      "similar": [],
      "original_title": "The Barefoot Executive",
      "runtime": 96,
      "poster_path": "/AwnVbh6WV6l6Iy3esdy2qFbwgk2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1971-03-17",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "The Secret To Success Is Pure Monkey Business",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Butler"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Joseph L. McEveety",
         "Lila Garrett"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066811/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MzMzNzU1OF5BMl5BanBnXkFtZTcwOTU5OTcyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Kurt Russell, Joe Flynn, Harry Morgan | See full cast and crew »"],
      "reviews": [
         "Although not part of the Dexter Riley series (in fact made just after the first one), it carries Russell where Dexter might have gone after college. The same type of humor skims the surface of this movie but, it is the biting satire that is it's heart. Playing to the pretentious attitudes of people who cater to each other more than their clients, in this case the TV audience, they are completely stumped when an outsider successfully predicts the new favorite shows. But Russell holds a secret that would completely demoralize everyone in charge. Never mind a young mail clerk seems smarter than seasoned pros, but what about a monkey! This movie showed a maturity the Riley series never did, although the concept of a bunch of college slackers was ahead of it's time, and stood out from the rest of the Disney fare at that time. Well worth viewing as it shows Russell at the beginning of his adult career. His comedic timing and relaxed, natural acting talent are quite evident here.",
         "All the way through this film, part of me was saying \"I don't like this kind of film\" while the rest of me was replying \"No, but I'm enjoying it!\" The rather offensive premise here is that the tastes of the great american television-watching public can best be assessed by a chimpanzee. There's a little go at political-correctness, major swipes at TV production values and some great characterisations of TV exec types. I watched it while laying carpet tiles and it made a welcome distraction and a good excuse to take a break. I enjoyed it",
         "I think most of us know what is a Disney film. It is for all the family to enjoy, often taken from a classic story. Don't get me wrong. I love Disney films. Apart from Dick Van Dyke's goddawful accent in Mary Poppins, Disney films are characterised by quality and attention to detail. But a film that launches an attack on the entertainment industry and corporate America, now that is unusual for Disney. The basic plot has been dealt with by other reviewers. It is interesting that corporate America's first reaction to the chimp was first disbelief, then abduction. Was it just coincidence, or was it deliberate, that all the business executives in this film - all the bad guys - wear spectacles that look like goggles? Fascinating was the use of the adjective \"simple\", when an executive says to his chauffeur: \"Will you stop that simple wheezing!\" I liked it so much, I started using it myself. This is one of Disney's forgotten films, true it will never be as spectacular as Lady and the Tramp or Mary Poppins, but it deserves a watch now and again.",
         "One of the funniest comedies I've seen yet. What made this so was the interplay between Wally Cox and Joe Flynn [one of my favorite comics]. The bit on the building ledge was too much and had me rolling. The bellowing company prez was well played by Harry Morgan, a man I well remember from the early 60's sitcom \"Pete & Gladys\" where he played the put upon hubby, Pete Porter. John Ritter performed the snobbish, suck-up nephew to the hilt who, of course, gets his just payment in the end. 4 stars.",
         "A monkey who fills network slots? Just another executive meeting at the networks, you might think, but this is the beauty of the plot that is \"The Barefoot Executive\", a movie made when Disney was in its live action glory. A still-young Russell is a mail boy at one of the big networks who has ideas but the stuffy boss (Flynn) will have none of it. Then, Russell agress to babysit his girfriends' neighbor's pet chimp (probably a '70s thing) who turns out to be a whiz at picking out all the popular shows. One thing leads to another until Russell, playing all the chimp's hunches, finds himself on top of the TV programming world. It's not Prokofiev but for pure fun this movie is a keeper. How can you dislike a movie that not only has Russell and a cute chimp but also the comedic timing of both Joe Flynn and Wally Cox? Their moments together are pure hilarity. Even \"MASH\"'s Col. Potter (aka - Harry Morgan) has plenty of good scenes as a blustering head honcho. For kids and grown-ups who grew up on these movies, there can be no substitutes. \"The Barefoot Executive\" is monkeying around at its best. Nine stars. And we'll get through this if we ALL KEEP COOL HEADS!",
         "Nice, safe family comedy featuring a television network, a cute/funny chimp, and a young Kurt Russell in the prime of his Disney phase. Kurt is a low-level employee with a big television network with high-level ideas. By shear chance, he discovers that his neighbor's pet chimp is able to correctly predict the big ratings winners for each week's programs, and surreptitiously uses the animal to move up within the organization. The chimp demonstrating his disdain for poor programming (clearly enunciated raspberries, followed by screams of displeasure, and culminating in his throwing some destructive object at the screen) sent me into fits of laughter. But it also gave me (as a seven year old) an inkling into how the television industry works, and thereby planted the seeds of a life-long interest in the boob tube. And to this day, I am still wondering what the subject matter of \"Devil Dan\" is, and why it was so much more of a winner program than \"The Happy Harringtons\"... Get the kids away from \"Nickelodeon\" for a couple of hours with this campy treat...",
         "Young idealistic Steven Post (Kurt Russell) wants to get ahead in the TV industry but obnoxious boss Francis Wilbanks (Joe Flynn) constantly ignores him. Then Steven's loving girlfriend Jennifer (Heather North) gets a chimp (don't ask) who can predict what TV shows will be hits (!!!). Steve uses the chimp (without telling anyone) and becomes vice-president of a network in no time (just like real life huh?)...but Wilbanks is VERY suspicious of how he knows what shows will be popular. VERY silly Disney comedy. The humor and slapstick are either stupid and/or predictable, the characters are 1-dimensional and the lines would be laughed off \"The Brady Bunch\" as being too corny...but the kids will like this. Unlike the G rated movies today there's no crude humor, no violence and no jokes about bodily functions. This basically has good clean (if silly) humor. I admit most of the movie had me rolling my eyes but I did keep watching. I actually did laugh a few times towards the end (the reactions of a woman being interviewed on the street were very funny) and it was fun seeing Russell and John Ritter so young. Also Flynn has his moments as does Harry Morgan as the president of the network. North is sweet (but not TOO sweet) as Jen and look for Bill Daily at the end. And the chimp was adorable! So it is silly and predictable with a title song that makes you want to cut your ears off...but it's perfect for the kids. I give it a 5.",
         "The Barefoot Executive may appear to just be a light and fluffy 1960s/1970s-style Disney comedy, and it can certainly be enjoyed that way, but you don't have to dig very far below the surface to find a subtly clever satire of the television industry with a very insider feel. Having worked in radio for a while, and having friends and family who do or did work in television, as well as reading a lot of behind the scenes books on television programs, a lot of the jabs at the industry feel spot on. The humorous premise, probably stemming from a common joke about this, is that a \"monkey\" (actually a chimpanzee here) could pick a television stations' programming and do just as good or even a better job at it. Screenwriter Joseph McEveety and director Robert Butler get the dynamics between various levels of employees right, including the bigwigs. There are nice, continuing threads of intertwined sycophancy, insular ideas, fears of getting canned or demoted over ratings or general incompetence, and self-righteous assertiveness. Some of those things may be contradictory, but nevertheless they're representative of life within the walls of a broadcast media outlet--and probably many other places of employment as well. To an extent, the personal dynamics aspects of The Barefoot Executive are suggestive of an early version of Office Space (1999). But towards the end of the film, The Barefoot Executive nicely diverges into slightly more absurdist territory. Raffles, the chimpanzee, is charismatic and impressive. But an unexpected surprise was the scope and chemistry of the cast, which includes veteran character actors and Disney regulars Joe Flynn and Harry Morgan, veteran television actor Wally Cox, the woman who has supplied the voice of Daphne in most of the Scooby-Doo series and animated films since 1970, Heather North, and in one of his first films, John Ritter. Ritter is on fire here. He steals almost every one of his scenes. And that's quite a feat seeing that the star is an engaging Kurt Russell, who had already made a string of very successful films for Disney.",
         "It'll be fun to see how David Duchovny & Jake Kasdan's excellent new film \"The TV Set\" compares to this film of 35 years ago. Lila Garrett, Robert Butler & the others involved in \"The Rating Game\" aka \"The Barefoot Executive\" had done nothing but live through pilot hell for most of their careers. The people involved in \"The TV Set\" have jumped from pilot hell to feature hell and back enough times. And both sets of film makers manage to make us laugh and laugh a lot. Even the two casts are interchangeable. The cast of one would be equally brilliant in the other film. The intervening years teach us there's still great pain that goes along with the politics of television, and there is great talent.",
         "I could never give a truly bad review to a film with as talented a cast as this one. One of the things I liked about the Walt Disney Studios is that they gave employment to a lot of familiar faces from the big studio era when they were finding it hard to get work. But this was not one of the better efforts from the Magic Kingdom. Disney's All American hero in films at this time was Kurt Russell who plays a kid who is a mail delivery clerk at the UBC network by day and a night school student looking to better himself. By accident he discovers that the chimpanzee his girlfriend Heather North has can pick winning television shows. His taste mirrors that of the American public which is a proposition a lot might agree with. Russell is promoted to a Vice Presidency in charge of programming keeping the chimp's participation a closely guarded secret. But a whole lot of vested interests want to find out. They stop at nothing as you will see. Some might call this film cute and innocuous as most of the Russell Disney flicks were, but I think The Barefoot Executive is the worst of what he did for that studio. To me the whole thing was so dopey and even a cast that has Harry Morgan, Wally Cox, Alan Hewitt, Joe Flynn, and Iris Adrian in it can't sell this one. I will say that Adrian has only a small bit, but it is memorable. John Ritter is also in The Barefoot Executive playing a role that might have led him to be cast as Jack Tripper in Three's Company. Maybe the film did his career some good. I'd see The Barefoot Executive should be seen for the marvelous cast, but I think you'll agree with me when you see how silly it is."
      ],
      "genres": [
         "Family",
         "Comedy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["A young man who works in the mailroom at a TV network wants to move up the corporate ladder but finds himself stymied by his selfish boss. By chance he discovers that his neighbor's chimpanzee has a knack for picking successful TV programs. He uses the chimp's programming skills to land himself a job in the programming department of the network."],
      "budget": 0
   },
   "movielensId": 2032,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-03-17",
      "dvdReleaseDate": "2005-04-12",
      "directors": ["Robert Butler"],
      "runtime": 96,
      "movieId": 2032,
      "title": "The Barefoot Executive",
      "mpaa": "G",
      "actors": [
         "Kurt Russell",
         "Joe Flynn",
         "Harry Morgan",
         "Wally Cox",
         "Heather North",
         "Alan Hewitt",
         "Hayden Rorke",
         "John Ritter"
      ],
      "imdbMovieId": "0066811",
      "originalTitle": "The Barefoot Executive",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["XneZ4N7N_Ek"],
      "plotSummary": "In the great Disney tradition of wild family fun, a young Kurt Russell stars as Steven Post - an ambitious mailroom clerk at a second-rate TV network. With his eye on the boardroom, and getting nowhere with the studio's top dog, he makes a career-changing discovery. His girlfriend's lovable pet chimp can pick a hit show every time! His secret for success turns into a madcap monkey business when he makes vice president and jealous rivals want in on the act. Ride along with narrow escapes and a classic cast featuring Joe Flynn and Harry Morgan in a comedic climb up the corporate ladder that will leave you howling for more!",
      "tmdbMovieId": 20173,
      "avgRating": 2.86382,
      "releaseYear": "1971",
      "numRatings": 246,
      "posterPath": "/AwnVbh6WV6l6Iy3esdy2qFbwgk2.jpg"
   }
}