{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bus",
            "id": 992
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "houston",
            "id": 9609
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "memory",
            "id": 10937
         },
         {
            "name": "senior citizen",
            "id": 163484
         },
         {
            "name": "1940s",
            "id": 207883
         },
         {
            "name": "daughter–in–law",
            "id": 220195
         },
         {
            "name": "elderly lady",
            "id": 241293
         }
      ],
      "imdb_id": "tt0090203",
      "video": false,
      "title": "The Trip to Bountiful",
      "recommendations": [
         46011,
         81619,
         42096,
         59964,
         41773,
         68849,
         42264,
         36006,
         42122,
         26580,
         29933,
         52826,
         80572,
         5333,
         22969,
         42150,
         217268,
         38770,
         30080,
         31561
      ],
      "backdrop_path": "/uA0pqyLEfcwqlpiioTsmFQfj7TD.jpg",
      "revenue": 7218340,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mrs. Carrie Watts",
               "gender": 1,
               "credit_id": "52fe474dc3a36847f812e1bd",
               "name": "Geraldine Page",
               "profile_path": "/zyGpaCsHZUJRUyFUJNlTQ6dBs6F.jpg",
               "id": 41283,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Ludie Watts",
               "gender": 2,
               "credit_id": "52fe474dc3a36847f812e1c1",
               "name": "John Heard",
               "profile_path": "/rz9E9VyZXeyspfCshXFKHIy5rP0.jpg",
               "id": 11512,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Jessie Mae",
               "gender": 0,
               "credit_id": "584f0a05c3a3682a7d001cdb",
               "name": "Carlin Glynn",
               "profile_path": null,
               "id": 203731,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sheriff",
               "gender": 2,
               "credit_id": "52fe474dc3a36847f812e1c5",
               "name": "Richard Bradford",
               "profile_path": "/fGMexQI7Po1AuHO7masqwUWId1P.jpg",
               "id": 1272,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Thelma",
               "gender": 1,
               "credit_id": "52fe474dc3a36847f812e1c9",
               "name": "Rebecca De Mornay",
               "profile_path": "/riQQkeijtaPIAVhPdCcJFPB4FOA.jpg",
               "id": 28412,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Roy",
               "gender": 2,
               "credit_id": "52fe474dc3a36847f812e1cd",
               "name": "Kevin Cooney",
               "profile_path": "/3z2Rte6xznb5Bth6mar42waHc59.jpg",
               "id": 25711,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Second Bus Ticket Man",
               "gender": 0,
               "credit_id": "52fe474dc3a36847f812e1d1",
               "name": "Harvey Lewis",
               "profile_path": null,
               "id": 136218,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Stationmaster Gerard",
               "gender": 2,
               "credit_id": "52fe474dc3a36847f812e1d5",
               "name": "Gil Glasgow",
               "profile_path": "/fEaLdsNue0zMV4PEiWDim6RtcuG.jpg",
               "id": 124087,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe474dc3a36847f812e1b9",
               "name": "Horton Foote",
               "profile_path": null,
               "id": 8483,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "538148b5c3a368059e0060d0",
               "name": "Horton Foote",
               "profile_path": null,
               "id": 8483,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54f070adc3a3687be20016f6",
               "name": "Peter Masterson",
               "profile_path": "/wGha0amyeXy91LRnf7pedI9AOS2.jpg",
               "id": 71732,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "538148c90e0a2624cb008be7",
               "name": "J.A.C. Redford",
               "profile_path": null,
               "id": 66941,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "538148e9c3a368737d001406",
               "name": "Fred Murphy",
               "profile_path": "/oLzSw5wj6X3H5FYIQuXruf8TkaW.jpg",
               "id": 17765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "538148f6c3a36805a1005e6c",
               "name": "Jay Freund",
               "profile_path": null,
               "id": 1177382,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53814904c3a36805a4005ca5",
               "name": "Neil Spisak",
               "profile_path": null,
               "id": 11411,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.600092,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47908,
      "vote_count": 13,
      "budget": 0,
      "overview": "Carrie Watts is living the twilight of her life trapped in an apartment in 1940's Houston, Texas with a controlling daughter-in-law and a hen-pecked son. Her fondest wish -- just once before she dies -- is to revisit Bountiful, the small Texas town of her youth which she still refers to as \"home.\"",
      "similar": [
         11615,
         278,
         1701,
         1368,
         708,
         57201,
         107846,
         13291,
         903,
         483,
         29259,
         300665,
         398924,
         10471,
         12088,
         8438,
         9086,
         15244,
         10447,
         5121
      ],
      "original_title": "The Trip to Bountiful",
      "runtime": 108,
      "poster_path": "/taCCh71ujnnebpcUD709wnnmyCb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bountiful Film Partners",
            "id": 18090,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "FilmDallas Pictures",
            "id": 18071,
            "origin_country": ""
         }
      ],
      "release_date": "1985-12-20",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Masterson"],
      "runtime": 108,
      "synopsis": "Houston, April 1947. \"Mama\" Carrie Watts has lived with her son Ludie and his disagreeable wife Jessie Mae in a small apartment for 15 years. One night they all have trouble sleeping. Jessie Mae nags at Mama persistently, and Mama begs Ludie to let her return home to Bountiful. The next day, Mama takes her latest pension check, packs a bag, and goes to both the train and bus station; at both places, dispatchers tell her that no trips go to Bountiful anymore. She buys a bus ticket for a nearby town and heads off with great excitement, evading Ludie and Jessie Mae. Along the way, she meets a young woman named Thelma, who is sad that her husband is away in the military. Mama complains about Jessie Mae, wishing she still had her own house. Mama abruptly tells Thelma that she did not love her own husband, but rather was always in love with another man; she cries in explaining that she could not marry him because their fathers disliked each other. When Mama makes it to her stop with Thelma, she is shocked to learn that the friend she wanted to see in Bountiful died just days earlier, and that the town itself no longer has any residents. She also realizes that she left her purse on the bus, but the dispatcher calls ahead to have it brought back. Mama blithely wonders with Thelma why her life is filled with trouble yet relief. Thelma takes off to her destination, and Mama lies down to sleep on a bench. Hours later, the town sheriff comes by to tell the dispatcher he'd gotten a call looking for Mrs. Watts. When the sheriff tells her that Ludie is coming to pick her up in the morning, Mama begs to be allowed to see Bountiful, only 12 miles away. She breaks down in tears, explaining that she just wants to see her old home once before she dies. The sheriff calls a doctor to have her sedated. At dawn, with Mama in a much calmer mood, the sheriff agrees to drive Mama to Bountiful. She is dismayed as they drive through the abandoned town, with its handful of buildings overgrown with weeds. He drives her out to her old house, also long since empty, and they chat. Mama eventually becomes emotional, knowing that she has outlived her family and her house. The sheriff leaves Mama alone to walk through the house for a while. Ludie drives to the house and finds her sitting on the porch. She says she got her wish. Ludie regrets not bringing her earlier, saying, \"I just thought it'd be easier if we never saw the house again,\" and he refuses to go in. As they stand outside, Ludie gets upset recalling Mama's father's funeral at the house when he was 10, pointing out that he's never had children, feeling that he's never done good by his mother or wife. He confesses that he's been repressing the memories of his childhood, because they do not help him. Mama wonders what will still be left after they and the house are gone: the river, the fields, the trees, the smell. She tells Ludie they are all part of the land that keeps changing. Jessie Mae shows up and confronts Ludie to tell Mama the new \"rules\" she has for her, such as no more running away. Mama agrees, saying that her trip has been \"more than enough to keep me happy for the rest of my life.\" Ludie suggests that they should all get along better, and gets mad at Jessie Mae for distrusting his mother. Mama takes a last moment to sit on the ground and look at the house, saying goodbye. She quietly cries as Ludie drives them away.",
      "writers": [
         "Horton Foote",
         "Horton Foote"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090203/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNDAyMjY0OV5BMl5BanBnXkFtZTcwNDAxNDMzMQ@@._V1_.jpg",
      "actors": ["Stars: Geraldine Page, John Heard, Carlin Glynn | See full cast and crew »"],
      "reviews": [
         "I came back to read my original review of \"The Trip to Bountiful\" after I viewed the film again the other night. I read the other accounts of the movie and I couldn't help by get very emotional reading the words of praise for Geraldine Page's memorable performance. The night she won the Oscar was big news in New York, where she lived and taught. One news program's crew visited a cafe where Miss Page's students were watching the ceremonies on tv. When F. Murray Abraham opened the envelope and said, \"...and the winner is the greatest actress..\" her students began to scream and cry BEFORE her name was called. They KNEW who had won, and so did I. I wept right along with them, just as I had done when I, a former actor, realized that very few actors would ever reach her level of artistry. I watched \"Bountiful\" over and over in disbelief. Her scenes on the bus with Rebecca de Mornay were wonderful and very touching. I kept wondering HOW did she prepared herself for this?!!! When she rode, with the Sheriff through what was left of Bountiful and uttered, \"My God, will you look at Bountiful...\" Her walk through the old house and her gaze as she looked at the land, the trees and the birds reminded me of a visit to the old country town of my childhood, reminding me that everywhere I've ever been is still there, perhaps in a different form, but it's still there. The reason that she got that standing ovation from the Academy Awards audience, is that it was appropriate to honor greatness and that the Oscar was going to an actor that TRULY deserved to win. In an age that Oscars are won for okay performances, when, in other years, Oscars were truly given to deserving achievements, AND, the competition was much, much stronger. I cannot recommend this picture more. For any aspiring actor that wants to set a goal standard for greatest, he or she must see this performance.",
         "The effects of the aging process is touchingly portrayed by Geraldine Page in this warm human drama set in rural Texas in 1947. Carrie Watts (Page), now a lonely widow, is being taken care of by her son, Ludie (John Heard) and his wife Jessie Mae (Carlin Glynn) in a cramped two-room apartment in Houston. The two women spend all of their time being irritable to each other while Ludie is caught in the middle. Though trying admirably to do the right thing by the two women in his life, the situation is tense. Carrie yearns to return to the family farm where she grew up, hoping to recapture some of the happiness of her youth. She has even tried to run away a few times, only to be stopped by her son and daughter-in-law who, in spite of their differences are only trying to spare her the disappointment of what she may find. Her hometown, Bountiful, now basicly no longer exists. The people just \"used up the land and moved on\". All that remains are a few abandoned and deteriorating buildings, including her childhood home. Nevertheless, Carrie finally succeeds in slipping away. On the way, she meets a young wife, Thelma (Rebecca DeMornay), whose husband is overseas in the military behind enemy lines. As they converse, it is obvious they are both on a quest, Carrie to recapture her youth and Thelma to hold on to hers, not knowing if she will ever see her husband again. Until he returns, she is going back to stay with her parents. The two women form a bond and find each other a source of strength on the long bus ride. Though we hope for Thelma's eventual happiness, somehow we know that only disillusionment awaits Carrie in Bountiful. Filmed as a play with the advantages of outdoor scenery, the entire cast and crew did a splendid job, presenting a difficult subject in a tasteful manner. Page won an Oscar in what was to be her last role shortly before her death. Besides the other supporting players, Richard Bradford was also outstanding as the compassionate Sheriff who helped Carrie obtain her goal. The period pieces, all of those old 40's automobiles and the architecture and scenery, the general \"feel\" of small-town Texas during that era, helped add to the realism of the film. THE TRIP TO BOUNTIFUL should be recognized as a national treasure.",
         "When F. Murray Abraham opened the envelope to reveal the Best Actress winner that year, he said \"I consider this woman the finest actress in the world\", and its hard to argue that point. She owns this movie and no one else would have done it as beautifully. Thank God this movie was done before she passed.",
         "Geraldine Page won the Best Actress Oscar for this film in 1985. And it's no wonder why. The movie almost unfolds as a Broadway play. It may seem depressing at first, but that's the gift that Geraldine has in portraying the emotions of an aging Southern mother who yearns to return to the small town she left in Texas many many years before. For whatever reason, this film hits an emotional chord with me because Geraldine Page reminds me so much of my maternal grandmother. If you're into fast paced, action flicks - or comic farces, you won't like this film. But, if you really appreciate character development that slowly unfolds and develops in a film, you should not pass up this one!",
         "Carrie Watts (Oscar winning Geraldine Page) has been cooped up in a 2 room Houston apartment with her meek son and her outspoken daughter-in-law for twenty years. Getting on in her years, and equipped with a bad heart, her only wish is to see her home on the southern coast of Texas (Bountiful) before she dies. She has often attempted to go there, but always seems to get caught before she can even get on the bus. But one glorious day, she does manage to escape the confines of the apartment and her critical daughter-in-law, and thus, her adventure does begin. Mrs. Watts encounters a delightful young lady (Rebecca de Mornay)and relates her life story, sings hymns to her heart's content, and finally, through sheer will and perseverance, does make it to Bountiful, where she discovers that her one time home is now a timeworn shell. Here, she rediscovers her past, and all of the emotions she experiences and shares with us are to be treasured for generations to come. Geraldine Page is so masterful and in every frame of this monumental film, that we tend to forget that she is even acting. Her character could be our grandmother, our mother, and we come to love this eccentric character as though she were family. One of the most charming movies ever made!",
         "This is a gentle, contemplative little film. It is the story of an old woman's return to her pre-Depression home, and the memories and regrets that the journey invokes. Mother Watts lives with her son Ludie and his wife Jessie Mae in a two-room apartment. Life is cramped. Mother has to sleep on the couch, everybody in the apartment is constantly getting in everybody else's way, physically and emotionally, and the neighbours can hear every word. Mother Watts is a country girl in spirit, having been raised on the land, and her yearning to get away from the rootless, joyless suburbs eventually overwhelms her ... The film is set in the nascent middle-class suburban environment of Houston, Texas in the 1940's. Ludie and Jessie Mae are a typical couple in their early middle years: he is hoping for a salary raise, so that he can afford a house and a car, she inhabits a narrow psychological world of nice clothes, coffee shops and picture shows. Ludie's mother lives with them, and this irritates Jessie Mae intensely. The two women clash repeatedly as Jessie Mae constantly seeks to assert her ascendancy within the household. Mother Watts is a simple soul. She sings the hymns she learnt as a child as she goes about her dreary chores (Jessie Mae does no housework). Mother receives a monthly pension cheque from the government, and this seems to be the only reason that Jessie Mae tolerates her presence. The daughter-in-law clearly regards the cheque as her own property. The old lady inhabits a world of reverie, an intuitive, emotional world of memories. The full moon keeps her awake all night, as it did when she lived in the rural community of Bountiful, some 20 years previously. In the glow of the moonlight, she hankers for that idealised country life. When Jessie Mae switches on the electric light, its harsh glare ends the dream-time abruptly, stark modernism cutting Mother Watts' links with her own personal history. Mother Watts resolves to make one last trip to Bountiful. On her way she encounters obstacles (she has enormous difficulty cashing her cheque) and disappointments (death and progress have transformed the Bountiful of her memories). However, she also meets with the kindness of strangers. Thelma, the young woman who is travelling her way, befriends her and shares confidences with her. Mother Watts reveals that two of her children died in Bountiful - one of diphtheria, one of sheer poverty. The local sheriff (Richard Bradford) undergoes a change of heart and helps the old woman to revisit the place of her dreams. When Ludie and Jessie Mae finally catch up with the wandering old lady, Ludie momentarily glimpses that other world, the world of soil, simplicity and communal spirit. Jessie Mae is of course impervious to Bountiful's charms, and she seems utterly out of place in her white high-heels. The 'message' of this nostalgic little film is that people who live on the land put down roots which sustain them them through hardship and sadness, whereas the shallow urbanites have nothing to bolster their bland existence. Mother Watts may have lost two babies, but she is infinitely more fulfilled than Jessie Mae, who has never had any children. An excellent period feel suffuses the film. The early scenes in the apartment are suitable claustrophobic, helping to develop the theme of 'hemming-in'. By contrast, when Mother Watts begins her bus ride, the screen opens out into an impressive panorama of land and sky. We feel that this will be Mother Watts' final adventure in life, and this elegiac quality is subtly underscored by clever touches: we see her behind a glass panel at the bus station, with the lettering \"Houston Terminal Cafe\" obliterating her face. Geraldine Page is great as Mother Watts, keeping her character simple and humble, and resisting the temptation to 'grandstand'. John Heard impresses in the role of Ludie, the slightly downtrodden son who strives to do the right thing. Again, the characterisation is spot-on ... Ludie is dull and inarticulate, and Heard grounds him in bathos. Carlin Glynn has fun playing the awful Jessie Mae, and Rebecca de Mornay is first-class as the sweet-natured Thelma. A restricted palate can sometimes produce the most powerful effects. The final scene, where Mother Watts gets her fingers in the dirt one last time, is a terrific climax, built up slowly and patiently, and relying purely on the interplay of characters.",
         "All I can say is Ms Page is my favorite.We all miss her.I have watched this movie dozens of times and am struck by what an outstanding performance she gives us in this picture. Yes I do indeed cry everytime I watch this film and think it will always touch me whenever I see it.I have my copy of it but it is becoming rather used so I intend on purchasing another. I don't think the world will ever see the likes of another Geraldine Page,at least not in my life time.What a great loss.",
         "Note, I didn't say movie star as she certainly was not a movie star but was a veteran Broadway actor, a real actor and not a movie face with \"presence\". Charles Bronson once said that what big movie stars have is \"presence\", not acting ability. Page has both of these attributes here in spades, acting and presence. This great film could be my grandmother's story but in reverse, as my grandma had a very caring daughter, my mother, but a resentful son-in-law in my father so I saw a very similar story first hand, which made me appreciate this film all the more. Page did a marvelous job of showing the immense disconnect between two diverse generations, one raised early in the 20th century in an era of intense religious devotion and the other raised 40 years later in a WWII era of emerging personal independence. The resulting conflicts between the loving son's selfish and demanding wife and his self-sacrificing mother was the entire story until her eventful \"trip\" back home to Bountiful, Texas. Wanting and praying so hard to be able to take her last trip home consumed her entire life as she gracefully but tearfully faced her hateful daughter-in-law's cruel harshness each and every day, with her unfortunate son forced to try to act as mediator. John Heard was effective as her concerned son caught in the middle. Page was marvelous in the special way she showed her character's intense religious devotion and principles in how she always treated all people with decency even when they were not that way to her, and in how she tried her best to get along and be friendly in the face of intense dislike and resentment. Understandably, her all-day hymn singing got on her son's wife's nerves, just as my Grandma's incessant hymn singing got on my dad's nerves and forced the same conclusion....both old ladies were practically forced to leave. Page's son loved both women dearly but he was forced to be in the difficult middle ground, wanting to please his jerk wife and his nice mom but was increasingly unable to do so, thus the long bus \"trip\" back home for mom was an inevitable run-away trip that left the son in an even greater mess....now what to do? On her bus trip home, Page's character's \"live and let live\" understanding of humanity, and her awareness that we are all in the same boat here on earth(even though it was God's glorious boat to her)led her to reach out to a fellow bus traveler with immense friendliness and compassion in the best manner of her religion's teachings. Rebecca DeMornay was perfect as that fellow bus traveler, a prim young military wife on her way to her husband. And, even though Thomas Wolfe was right when he wrote that \"you can never go home again\", Page showed the perfect combination of wonder and sad acceptance upon seeing her old, run down, country home place again after so many years away in the big city. Though her caring son finally came to retrieve her back home to whatever improvements he had worked out with his wife, at least she got to see the \"old home place\" one last time. She could now rest in peace no matter what. See this great story just to fill your heart, and to see that people in this country once were just like Page's character, and it was a better place for it. Movies don't get any better than this one. If you loved this film you will also love \"Places in The Heart\".",
         "Geraldine Page is most definatly one of the best actress in American film history. I this film, made just two years before she died, she plays Carrie Watts, a sixty year old living in a two room apartment with her son and daughter in law. For the past five year, Carrie has wanted only one thing, to go back to her hometown before she dies. Unfortunatly, her son and daughter-in-law think its a bad idea. Finding the right moment to escape, Carrie Watts runs away and begins The Trip To Bountiful. A simple plot yes. But the acting is top notch. It's also kind of sad. Not just becuase of its bittersweet plot, but because of the timing. This film was first screened in early 1985 at the Sundance Film Festival, where it recieved great reviews. Released theatrically in the fall of 1985, it did well for an independant film and in March 1986, Page recieved her first Oscar on her 8th nomination, which was accompined by a standing ovation. Hollywood insiders said that Page's carrer would flourish again, and an adaptation of \"The Glass Managerie\" went into development, with Page to co-star with Paul Newman and Meryl Streep. 15 months after the Oscars, Page was dead, A heart attack claimed her life. She won an Oscar for her last leading role.",
         "I knew nothing of this film, the night of the Academy Awards, but what I always remember about that Oscar night, is the moment they announced Geraldine Page as the winner for Best Actress ... the entire audience gave her a standing ovation. You just don't see that very often on Oscar night - not unless it's something special. That really impressed me. So I had to see what it was all about. Well, Geraldine Page, put on a clinic in this movie. She is incredible. I just can't say enough about her performance, so I won't even try. You will just have to see it. It is great to know that a spectacular movie can still be made with a simple but strong story line. No violence, no foul language, no special effects. Pure raw emotion,a big heart, the music and the beautiful photography carried the entire film. If you ever find yourself looking for a simple but magnificent story ... this is it. And don't rent it - buy it!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Bountiful Film Partners",
         "FilmDallas Pictures"
      ],
      "summaries": [
         "Carrie Watts is living the twilight of her life trapped in an apartment in 1940's Houston, Texas with a controlling daughter-in-law and a hen-pecked son. Her fondest wish -- just once before she dies -- is to revisit Bountiful, the small Texas town of her youth which she still refers to as \"home.\" The trouble is her son, Ludie, is too concerned for her health to allow her to travel alone and her petty daughter-in-law, Jessie Mae, insists they don't have money to squander on bus tickets. This prompts \"escape\" attempts each month which coincide with the arrival of Mrs. Watts' Social Security check. Then, Mrs. Watts makes a successful escape and last trip home.",
         "In 1940s Texas, an elderly woman is determined to visit her childhood home for one last time."
      ],
      "budget": 0
   },
   "movielensId": 2069,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-12-20",
      "dvdReleaseDate": "2005-04-12",
      "directors": ["Peter Masterson"],
      "runtime": 108,
      "movieId": 2069,
      "title": "The Trip to Bountiful",
      "mpaa": "PG",
      "actors": [
         "Geraldine Page",
         "John Heard",
         "Carlin Glynn",
         "Richard Bradford",
         "Rebecca De Mornay",
         "Kevin Cooney",
         "Harvey Lewis",
         "Gil Glasgow"
      ],
      "imdbMovieId": "0090203",
      "originalTitle": "The Trip to Bountiful",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["XczocuuAMV8"],
      "plotSummary": "Carrie Watts is living the twilight of her life trapped in an apartment in 1940's Houston, Texas with a controlling daughter-in-law and a hen-pecked son. Her fondest wish -- just once before she dies -- is to revisit Bountiful, the small Texas town of her youth which she still refers to as \"home.\"",
      "tmdbMovieId": 47908,
      "avgRating": 3.80865,
      "releaseYear": "1985",
      "numRatings": 1168,
      "posterPath": "/taCCh71ujnnebpcUD709wnnmyCb.jpg"
   }
}