{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "trip",
            "id": 1820
         },
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "skydiving",
            "id": 10287
         },
         {
            "name": "automobile",
            "id": 11695
         },
         {
            "name": "surprise party",
            "id": 33979
         },
         {
            "name": "austin texas",
            "id": 161188
         },
         {
            "name": "road movie",
            "id": 167043
         },
         {
            "name": "male bonding",
            "id": 167863
         },
         {
            "name": "firework",
            "id": 168697
         },
         {
            "name": "dusty",
            "id": 168700
         },
         {
            "name": "stunt flying",
            "id": 168701
         }
      ],
      "imdb_id": "tt0089126",
      "video": false,
      "title": "Fandango",
      "recommendations": [
         13571,
         20263,
         37943,
         68430,
         40555,
         71623,
         77368,
         23312,
         39233,
         14911,
         33639,
         32940,
         70088,
         18551,
         20942,
         25497,
         30784,
         30653,
         28110,
         39327
      ],
      "backdrop_path": "/HMFlZa8bkMwVGVOWMR8AcgDDjs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gardner Barnes",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003da7",
               "name": "Kevin Costner",
               "profile_path": "/ePo87kGyyY8JZ3z7Zm7Z2GYdmJ8.jpg",
               "id": 1269,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Phil Hicks",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003dab",
               "name": "Judd Nelson",
               "profile_path": "/9H1TSnBEDYl59tFC1EQHccrINsp.jpg",
               "id": 21624,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kenneth Waggener",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003daf",
               "name": "Sam Robards",
               "profile_path": "/xBfl2c80eQtbjKTH6dOwFBnFlE7.jpg",
               "id": 8213,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dorman",
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003db3",
               "name": "Chuck Bush",
               "profile_path": null,
               "id": 85965,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lester Griffin",
               "gender": 0,
               "credit_id": "52fe43e2c3a368484e003db7",
               "name": "Brian Cesak",
               "profile_path": null,
               "id": 85966,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Truman Sparks",
               "gender": 2,
               "credit_id": "52fe43e2c3a368484e003dbb",
               "name": "Marvin J. McIntyre",
               "profile_path": null,
               "id": 13003,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "The Girl",
               "gender": 1,
               "credit_id": "52fe43e2c3a368484e003dbf",
               "name": "Suzy Amis",
               "profile_path": "/b1pjkncyLuBtMUmqD1MztD2SG80.jpg",
               "id": 2179,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Gas Station Mechanic",
               "gender": 1,
               "credit_id": "52fe43e2c3a368484e003dc3",
               "name": "Pepe Serna",
               "profile_path": "/hz2T6EDJt0uRMIqdiiOZe2Tv3bh.jpg",
               "id": 1169,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Trelis",
               "gender": 1,
               "credit_id": "52fe43e2c3a368484e003dc7",
               "name": "Glenne Headly",
               "profile_path": "/a90ZslKOvecuy7doMWXsFc1Aoc4.jpg",
               "id": 21104,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Judy",
               "gender": 1,
               "credit_id": "52fe43e2c3a368484e003dcb",
               "name": "E.G. Daily",
               "profile_path": "/kGnTMLGU7evSMvpoFQ1ImCP0h1H.jpg",
               "id": 15274,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Actor",
               "gender": 0,
               "credit_id": "5545bb799251414c37003457",
               "name": "Dan Hewitt Owens",
               "profile_path": "/urI989TWOf5REqeFwkU0mD8Lu8j.jpg",
               "id": 1320732,
               "order": 10
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe43e2c3a368484e003dd1",
            "name": "Kevin Reynolds",
            "profile_path": "/4t5dwFGkAWrkMeIuoKA9ovoVLv4.jpg",
            "id": 8300,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.516234,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20348,
      "vote_count": 48,
      "budget": 0,
      "overview": "Five college buddies from the University of Texas circa 1971 embark on a final road trip odyssey across the Mexican border before facing up to uncertain futures, in Vietnam and otherwise.",
      "similar": [
         1696,
         2142,
         3134,
         298312,
         141,
         205,
         769,
         773,
         4771,
         11282,
         281,
         19908,
         339692,
         281957,
         395834,
         340485,
         445954,
         10285,
         431,
         681
      ],
      "original_title": "Fandango",
      "runtime": 91,
      "poster_path": "/ddkIBISYmztC56ciDHzfVcXin40.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/mpGWkDeikYLeAR8LVNaixig0vwE.png",
            "name": "Amblin Entertainment",
            "id": 56,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1985-01-25",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kevin Reynolds"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Kevin Reynolds"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089126/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwNTA1MzUxOV5BMl5BanBnXkFtZTcwNDY0NDcyMQ@@._V1_SY317_CR24,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Costner, Judd Nelson, Sam Robards | See full cast and crew »"],
      "reviews": [
         "There is something so magical about this film and how it captures a fleeting moment in every young man's life. It's sentimental in the best way, harking back to lost youth and that transitional moment into adult responsibility. Kevin Costner has never been more charming (indeed I don't think he has ever tried) and director Kevin Reynolds imbuse this with such a touching sensibility and bravura filming style it really pulls at my heart. I discovered it on TV a decade ago and have always treasured the copy I managed to make of it. Why not available on DVD? Every other piece of s**t is. Wonderful. Not for everyone, not perfect but wonderful. The final frame I even used as a background on my PC for a while and the credits song...perfect. \"Have a nice life.\"",
         "I hate to sound like a broken record, but this is my favorite movie of all time. I lost track a long time ago as to how many times I have seen this movie on tape. What a GREAT MOVIE. Kevin Reynolds clearly has this nailed down. Fandango is a movie about 5 fraternity brothers in the early 1970's who call themselves the 'Groovers', who decide to take off on a 'fairwell fandango' as a college graduation right of passage. We learn that they did the same 'fandango' earlier in their collegiate years, and in part, the purpose of this trip is to dig up a relic of that first adventure as the way to close out this chapter of their lives. Along the way, they take part in some wild adventures, deal with being drafted into the war in Vietnam, and meet some unique characters, all of which become the subject of the movie. I love this movie for a number of reasons. #1, it takes me back to my collegiate days, and the craziness that seemed to define them. #2, it allows me to appreciate the people that populated each and every moment of college, as the characters in Fandango are eerily reminiscent of the fraternity brothers, classmates and band members that I spent 4 years of my life with. #3, it makes me realize that life is fairly short, and if we do it right...we'll be the better because of it. The music in the movie seems tailored for every scene, even though there are cuts from great artists like Blind Faith, Elton John and Pat Metheney. In particular, the Metheney works in the film stand out. I cannot help but think of the wedding and final scenes when I am listening to Metheney's cuts from his 'Wichita Falls' and 'Works' tapes. I would highly recommend this movie to anyone who wants to strip off the baggage in life for an hour and a half one weekend, flip the pages back a few years(or more) to the days that were more innocent and raw, and think about the people that were so important to you as you grew up into adulthood. And if you happen to like the shape of Texas like I do, you'll appreciate this movie even more.(see the movie and you'll know what I am talking about) Go ahead....take this wild ride for all its worth. You will not regret it!!",
         "This is the best Road Movie of the 80s. By that I mean better than Midnight Run, Wild at Heart, Planes, Trains and Automobiles, Rain Man and all the other films that belong to that quintessential 80s genre. I love it - Spielberg financed it on the strength of Kevin Reynolds' first feature, Proof, but apparently he was disappointed with the results. Maybe that is because in Fandango there is a lack of Spielbergian sentimentality that has dominated everything he has made post-Jaws. Here, Reynolds counters every up with a down. From the explosive opening in which the group hit the road in Phil's cadillac for a day of revelry in the arid Texas outback (which is perfectly set to Elton John's Saturday Night's Alright For Fighting) I was hooked. The rest of the film is a hangover by comparison, sure, because the opening is so powerful. But the opening is misleading - Fandango is a downbeat film. Reynold's captures the perfect tone for his work by using the dead Texas scenery that is so reminiscent of Malick's Badlands and Hooper's Chainsaw Massacre. In Fandango, which is set in the early 70s, the ghost Vietnam is never far away. Reynolds refuses to let the group forget about War - there is always a sense of the 'last chance' about their odyssey. Everything from the massacre site they visit to the dilapitated set used for the filming of the James Dean classic 'Giant' that they sleep in speaks of death and decay. See the brilliant scene in the Cemetery where they shoot fireworks at each other for further evidence of this. In this respect, Reynolds pays homage to another film I love - The Deer Hunter. This is most obvious in the group's name - The Groovers - which is also shared by the Pennsylvanian Steel Workers of Hunter. Both films have a similar theme - friends who are torn apart by Vietnam. Fandango is an underrated classic - I urge you to see this film - if only to prove Spielberg wrong.",
         "Five friends (the self-named \"groovers\") go on one final fandango before graduating college and going on to life, war, marriage, etc. Their destination is the Texas desert where they plan to dig up Dom, the friend they buried on the night their group was formed. The film is a wonderful mix of poignant life lessons and slapstick hilarity. The crew consists of slacker Gardner, life-troubled kenneth, weenie extraordinaire Phil, overweight divinity student Dorman, and unconscious Lester (the fifth groover). As they wind their way through the Texas scrub on their last adventure, each of them faces the approaching life after college in his own way, reacting to his fears and the failings of his friends in the draft years of the Vietnam War. An unknown Kevin Costner pulls off the role of Gardner Barnes with an easy perfection that would convince you there must be something of Gardner in him. He's utterly convincing as the footloose rascal on a mission to evade life. The other performances are respectable, including that of Judd Nelson in the role of uptight ROTC cadet Phil Hicks who despises the moral ambiguity of the other characters while starving for their affection. Though this movie is not a well-known blockbuster, it holds up well against others of the same genre. Definitely worth the price of a rental, and with the February 2005 DVD release, a good addition to your collection. Good music, good humor, and great fun.",
         "Spielberg disowned his involvement in this (read: 'funding')...it's not hard to see why. -- Spielberg's camera is a lifeless automaton, it simply records stories. His camera has nothing to do with the story itself... Reynolds' camera is self-aware, acknowledged, and is part of the *visual narrative*: an active participant in the art. -- Spielberg's only concern is telling stories...this has no real 'story'. Nothing 'happens': it's all about a state of mind. -- Spielberg deliberately tells everything in the manner of a simpleton's comic book, as neatly laid out storyboards that a mental 10-year old can effortlessly digest...Fandango cannot be described in comic book terms; it is based on the indecipherable chalkboard scrawls of a stoner. Here we meet the Groovers (the Fab Four), plus one inert member (the 'fifth Beatle') who undertake a journey through moviedom, including \"Giant\", \"Ten Commandments\", \"Badlands\", etc. There's no goal -- the 'goal' ends up being a chance to wink at the audience -- other than the journey itself. It's all about living in the moment, the consequences are never encountered. This is everything that \"Stand By Me\" is and so much more. It is visually rooted in constructed memories...note the photographs as bookends. Along the way, Reynolds 'constructs' the war with fireworks and tombstones. This is cinematic eloquence. It is also self-referential; the 'construction' of the wedding banquet is carried out in precisely the same way as the movie itself was made: with a little help from Reynolds' friends. The capper is the ceremony and reception dance. The dance is a fandango, but the musical platform is not, it is the gifted Metheny's \"It's For You\". All of the movie's emotions *visually* swirl and coalesce around the song/dance amalgam and eventually resolve within it...this is beyond mere movie soundtracks: this is a magic carpet ride for the soul. For one minute, a world disappears, and another world constructed just for two takes its place -- a entire world of emotion expressed through the physical action of lovers (a dance, a kiss that almost was, a facial expression of realization), instead of through words. Is the construction 'real', or is it the stuff of dreams? Reynolds lets us decide. It's a shame the boys went on to give us the execrable \"Robin Hood\" and the pointlessly outsized \"Waterworld\". But for one brief instant, they got it oh so right.",
         "It starts looking cool enough, I thought, although not overwhelmingly original: under a blue, blue sky, four young guys, as different as can be, drive to seemingly nowhere in a beautiful car from the roaring fifties. Singing, drinking, screaming. It looks like they're having a lot of fun, which of course will prove to be a doomed mood: their lives are suspended between youth and whatever comes next, just like them driving in the middle of Texas' desert landscapes with the unlikely goal of attending one of the mates' wedding... Everything is on the verge of changing for them; their friendship, the way they lead their lives, the way they consider the future. What Kevin Reynolds achieves here masterfully is making the whole thing look, at first, like just another buddy-movie. Yet I think there is a lot more to it. Fun, slapstick, grotesque situations, and still, every time or so, we're given a hint that those people have no idea where they're going, that they try to ignore the (real) world that's waiting for them. The one most representative of that borderline state and who remains, by default, the big brother telling the others where to go next, is Gardner Barnes, played by Kevin Costner. Very young-looking (to whoever, like me, hasn't seen him in a picture made 16 years ago), he radiates a kind of natural quality, telling us he may just be the most frightened and unsure one of those four mostly-losers. Anyone who has apreciated Costner in at least one movie should definitely have a look at this one. There'll never be anything even remotely tragic in this story, nor any solid insight into any of those old kids. Not even into Gardner, the one with a haunting love on his mind, who claims he's never token a woman seriously. Some moments might strike you as either clichee, heavy or childish... Yet, after the finale, Reynolds has gotten us where we're supposed to be: feeling the dry cut apart from the time where our dreams where, to ourselves, a solid option for what our future might look like. The loss of what kept the world together until this very moment. I should add that, having listened precisely in my beginning twenties to the Pat Metheny Group like mad, I was totally taken away when the whole wedding scene appeared to be choreographed around two of his magic compositions. This movie has something fresh, universal, sincere. It's full of ideas and benefits from a truly inventive photography as well as a from a perfectly well-tuned rythm. Anyone on a day where he feels up to re-live those cheers AND nostalgia, in the company of a bunch of excellent actors, would do himself a favor by taking a while to watch it. And, maybe, reconciliate with that little mix of sadness and joy we think we should have left behind us.",
         "A very underrated and under-seen film - thanks to the clods at Amblin (presumably because no one in the cast resembled an alien). Great acting, writing, and directing (from Kevin Reynolds). One of the only films Costner has ever acted in where he didn't resemble a stick of wood. I love this movie through and through. The sky diving scene (which is apparently what the film is built around, Reynolds' student film 'Proof') is fantastically funny from beginning to end. Marvin J. McIntyre is a true hero. GREAT soundtrack from beginning to end. The opening credits alone are worth the price of the rental. And the climax scene at Waggner's wedding is one of the most romantic and sensitive wedding scenes ever committed to film. Don't miss it.",
         "I stumbled across this movie years ago while flipping thru the channels late one night, and instantly fell in love with it. It's easily one of the best movies of the genre; there's an emotional resonance here that's hard to come by in any movie, let alone one that *appears* to be a standard coming-of-age/buddy/road-trip flick. It's also (in my humble opinion) probably Kevin Costner's finest piece of work next to 'Dances With Wolves'. Costner's role as Gardner is one that seems perfectly suited to him; I can imagine anyone else being able to pull it off. The soundtrack is *perfect*, especially the wedding sequence - besides being a great flick, this movie turned me on to Pat Metheny! The soundtrack, unfortunately, was never released, although I liked the movie enough to assemble the tracks individually. This is one of those rare movies that leaves one with a nice afterglow, even after many viewings....much like 'Diner' or 'American Graffiti'. I've seen 'Fandango' way too many times to count, and am on my second or third VHS copy - I'm hoping this comes out on DVD sometime soon....",
         "I first saw Fandango in 1990 on BBC2 by chance and as I knew I would be out part of the night I also recorded it. In the end I never went out but it was fate that I got to see and also record one of my favorite films of all time. How this film has never made it to DVD or video release is beyond me, but hey who am I. I'm not American and I never went to Vietnam but this film really hit a cord with me especially at a time when the world was going to war with Iraq and people genuinely thought that if it turned into a holy war we would eventually get drafted. I thought this was by far one of Kevin costners best roles as the cocky Gardner Barns who genuinely cared about his friends and what might happen to them, so before they go off to war they go and find a bottle of champagne who they have christened DOM which is their last link with youth and the good times they shared. It is a very subtle and poignant film and the characterization is played superbly. There are some extremely funny moments in this film especially the sky diving scene together mixed with very thoughtful and endearing moments one in particular when Phil shakes Doormans hand and they say goodbye to each other for the last time. All this along with a wonderful sound track by Pat Matheny and Lyle Mays made this a film I cannot speak highly enough of. Go and see it and also by all Pat Mathenys work which I have. Incidentally everyone who I have ever shown this film to have thoroughly enjoyed it and asked where they can get it, alas I could not help with their request.",
         "Love it - Even tho it's hard to say exactly WHY... It might be the fantastic soundtrack, the great shots, the skydiving scene, the wedding scene that makes me cry, the use of 'Can't Find My Way Home\" by Blind Faith (one of my favorite songs) -- but this film is in my top 5 of all time. Occasionally you have to suspend your disbelief to the point of it being painful, but the honesty, the great acting, and the unpretentious feeling of the film and the actors completely draws me in every time. Go rent or buy it. Now. If you ever wanted to throw away all of the pressures and responsibilities of life, only to find yourself choosing to go back to them, you'll love this movie."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Amblin Entertainment"
      ],
      "summaries": [
         "It's 1971 at the University of Texas, Austin. College buddies, facing graduation, marriage, and the draft, skip out of their own graduation party and head to the Mexican border for some adventure, a buried secret, and one last go-around at \"the privileges of youth\".",
         "Five college buddies from the University of Texas circa 1971 embark on a final road trip odyssey across the Mexican border before facing up to uncertain futures, in Vietnam and otherwise."
      ],
      "budget": 0
   },
   "movielensId": 2073,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-01-25",
      "dvdReleaseDate": "2005-02-15",
      "directors": ["Kevin Reynolds"],
      "runtime": 91,
      "movieId": 2073,
      "title": "Fandango",
      "mpaa": "PG",
      "actors": [
         "Kevin Costner",
         "Judd Nelson",
         "Sam Robards",
         "Chuck Bush",
         "Brian Cesak",
         "Marvin J. McIntyre",
         "Suzy Amis",
         "Pepe Serna",
         "Glenne Headly",
         "E.G. Daily",
         "Dan Hewitt Owens"
      ],
      "imdbMovieId": "0089126",
      "originalTitle": "Fandango",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["xY5bKAHWHHQ"],
      "plotSummary": "Five college buddies from the University of Texas circa 1971 embark on a final road trip odyssey across the Mexican border before facing up to uncertain futures, in Vietnam and otherwise.",
      "tmdbMovieId": 20348,
      "avgRating": 3.46802,
      "releaseYear": "1985",
      "numRatings": 641,
      "posterPath": "/ddkIBISYmztC56ciDHzfVcXin40.jpg"
   }
}