{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0053994",
      "video": false,
      "title": "Kidnapped",
      "recommendations": [
         32032,
         43788,
         36339,
         22734,
         93427,
         53205,
         124058,
         22815,
         32073,
         21077,
         188219,
         115834,
         25381,
         142305,
         43335,
         146660,
         68337,
         64984,
         34089,
         33841
      ],
      "backdrop_path": "/yYACdzpRnSmVqKE32Cs7z4YzGbP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Alan Breck Stewart",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff51",
               "name": "Peter Finch",
               "profile_path": "/dQ7jYlTq05FckFujavbEba4rlQK.jpg",
               "id": 29903,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "David Balfour",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff55",
               "name": "James MacArthur",
               "profile_path": "/t2DzrPh00QuOrCbdYzK4SggeG9H.jpg",
               "id": 83128,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Captain Hoseason",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff59",
               "name": "Bernard Lee",
               "profile_path": "/vCLXqcJNAijcVrRrJuoduc5VnSd.jpg",
               "id": 9874,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Ebenezer Balfour",
               "gender": 2,
               "credit_id": "538b0a050e0a2667050015a6",
               "name": "John Laurie",
               "profile_path": "/fOo2XHmHSDSeo7TUpm0l64C6ZOq.jpg",
               "id": 3673,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mr. Shaun",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff61",
               "name": "Niall MacGinnis",
               "profile_path": "/q5eQLCeSDWMJ4ghGJW4f7D6Os5k.jpg",
               "id": 93163,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Cluny MacPherson",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff65",
               "name": "Finlay Currie",
               "profile_path": "/4ezZVGhlabVRIeavptVayV1VJGC.jpg",
               "id": 10027,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Rankeillor",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff69",
               "name": "Miles Malleson",
               "profile_path": "/5Zbh2FzelrTvyGAFfY2Mdeoi7Ps.jpg",
               "id": 47395,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "The Highlander",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff6d",
               "name": "Duncan Macrae",
               "profile_path": "/rBqLzhYB9CRSnoX1MDsH2bvEWTR.jpg",
               "id": 97426,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Colin Campbell",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff71",
               "name": "Andrew Cruickshank",
               "profile_path": null,
               "id": 47397,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Robin MacGregor",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff75",
               "name": "Peter O'Toole",
               "profile_path": "/7esSG4iZHueb5Nh8RBBhtRZLpom.jpg",
               "id": 11390,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mr. Campbell",
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff79",
               "name": "Oliver Johnston",
               "profile_path": null,
               "id": 29308,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Tinker",
               "gender": 0,
               "credit_id": "52fe4628c3a36847f80eff7d",
               "name": "Norman Macowan",
               "profile_path": null,
               "id": 106152,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Woman on the bridge",
               "gender": 1,
               "credit_id": "52fe4628c3a36847f80eff81",
               "name": "Edie Martin",
               "profile_path": null,
               "id": 107539,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff41",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff47",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4628c3a36847f80eff4d",
               "name": "Robert Louis Stevenson",
               "profile_path": "/fGEGp5kpR2mhX89XqAJoJQFGeuG.jpg",
               "id": 29533,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.759881,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43037,
      "vote_count": 7,
      "budget": 0,
      "overview": "Kidnapped and cheated out of his inheritance, young David Balfour falls in with a Jacobite adventurer, Alan Breck Stewart. Falsely accused of murder, they must flee across the Highlands, evading the redcoats.",
      "similar": [],
      "original_title": "Kidnapped",
      "runtime": 97,
      "poster_path": "/atSe9V9JHkKfT5px9qrThOovSQZ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "gd"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1960-01-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 97,
      "synopsis": "Edinburgh, Scotland, 1752. David Balfour (James MacArthur) is a 16-year-old Lowland Scot who is given a letter by Mr. Campbell, a friendly local minister which was written by David's recently-deceased father, to go to the House of Shaws, a dark and dreary mansion in a bleak landscape to claim an inheritance. David never knew that his poor father was related to such a high class family. The following day, David asks a local woman for directions to the House of Shaws and is told not to go there by Jennet Clouston, whom she claims that she was forced out of her home by Ebenezer Balfour, the man residing there whom is a heartless slumlord. David arrives and knocks on the front door where he is greeted not so warmly by his miserly uncle Ebenezer (John Laurie), his late father's heartless older brother. An attempt to arrange a fatal accident when Ebenezer asks David to run up a dark stairway to a nonexistent room to fetch some legal papers, which leads to a dead end, makes it clear that Ebenezer has no affection for his nephew. However, David is not sufficiently on his guard. The next day, a 10-year-old cabin-boy, named Ransome, arrives at the house with a letter. The letter says that they are invited to the nearby shipping post where Ebenezer has some business. David accompanies Ebenezer to a meeting with a seafaring business associate, Captain Hoseason (Bernard Lee). The captain lures David aboard his ship and shanghais him, at Ebenezer's instigation. At sea, David learns from the cabin boy that he is to be sold into indentured servitude and they are on their way to Virginia Colony in the New World where David will reside in a penal colony. However the next day, a thick fog comes up and the ship collides with a small boat. Alan Breck Stewart (Peter Finch), the only survivor of the latter, is brought aboard and pays for his passage, but the greedy captain plots to kill him for the rest of his money. David warns Alan, and the two are able to overcome the murderous crew. Alan coerces Hoseason into turning the ship around and putting them ashore back in Scotland. But the following night, the ship founders in a rough storm, but David manages to jump overboard reach land alone. The next morning, David is acousted by a Gaelic-speaking resident who tells him that he is on the Island of Mull, a Scottish island less than a natucial mile from the mainland. But the Scot brute demands a bribe of five schillings to guide David to a launch point at the village of Torosay to take him to the mainland. David relents and pays him. But after a half-day's walk across the landscape, the guide stops for a rest and demands another five schillings to continue. David refuses realizing that the Scot thug is extorting money out of greed. The guide attacks David with a knife, only for David to subdue his attacker, and continue on alone. After spending the the night with a friendly old resident and his wife, David crosses the island on a ferry to the mainland and finds himself in the desolate and sparcely populated Scottish Highlands. A little later, David has a run-in with a group of redcoats (English army soldiers) where the officer, Colonel Campbell, who is known as the \"Red Fox,\" questions David and what is he doing here. David begins to explain to Campbell about his quest to get back home when Campbell is suddenly shot dead by a sniper. Campbell's troops, despite witnessing the killing, think that David is an accomplice and chase him. While evading the murderous redcoats, David is reunited with Alan, whom was the shooter. While hiding out in a cave, Alan tells David that is is a Jacobite rebel wanted by the authorities after fighting in the recent Battle of Culludon six years earlier. David is still relunctant to trust Alan, but has litte choice as they are both being hunted by the redcoats across the landscape for the murder of Campbell Red Fox. After a few harrowing adventures of evading the redcoats, David and Alan arrive back in David's home village of Essendean. There, David goes to meet with Sir Rankeillor (a lawyer) about his inheritance. Alan suggests a plan to expose David's uncle for the crimes he did. The following night, David finally arrives back at the House of Shaws, where Alan and Sir Rankeillor are with him to help out. Alan knocks on the front door and Ebenezer lets him in. Alan tricks Ebenezer into admitting his crimes within the hearing of Sir Rankeillor where Ebenezer brags to Alan that he never liked his nephew David because there was an old quarrel between him David's father about a girl, David's mother, when David's father had to choose between the money of the Shaws or David's mother, of course David's father chose David's mother and thus walked away from wealth. Ebenezer falls into the trap when he admits about selling David into slavery when David walk in with Sir Rankeillor and Ebenezer's crimes are revealed, which allows David to claim his rightfull inheritance.",
      "writers": ["Robert Stevenson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053994/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzMDkwMDQ4OF5BMl5BanBnXkFtZTcwNzEyNDgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Finch, James MacArthur, Bernard Lee | See full cast and crew »"],
      "reviews": [
         "Walt Disney's 1960 film of Robert Louis Stevenson's _Kidnapped_ is not only the best movie version of the 1886 novel but is also one of the finest cinematic treatments of any of the author's works. Filmed on location in Scotland and featuring an outstanding ensemble of mostly British actors, this _Kidnapped_ is faithful to the spirit -- and even, for the most part, to the letter -- of the RLS masterpiece, which is half adventure tale and half meditation on Scottish history, culture, and character. Director Robert Stevenson (presumably no relation to Tusitala) never dumbed down the story or the 18th-century context, which may account for the movie's present limited appeal. It's atmospherically and thematically darker than the ususal Disney fare, and adult viewers may find it surprisingly rewarding.",
         "Equating Disney movies to \"family entertainment\" is a bit trite, but here it works. Young men looking for adventure in their lives will be as pleased with this film as parents looking for a quality movie to which they can take their kids. This is the brilliant Scottish raconteur Robert Louis Stevenson's tale of two Scotlands, Highland and Lowland, as personified by the dour young Mr. David Balfour and the spirited Highlander Alan Breck Stewart (who proudly \"bears a King's name\"). On the run for their lives in their own native country of Scotland, now occupied by English redcoats and their Hessian merceneries, the protagonists must overcome their mutual distrust of one another, which is based primarily on political differences (but also on cultural differences as well). In fighting to keep their health and lives, they come to respect and even appreciate one another, in part because (ironically) they are from different worlds. The acting is simply first-rate; the producers could not (and did not) rely on special effects to make this movie work. The scenery of the Scottish Highlands is breathtaking. But it's the plot and character development made so viable by the brilliant acting of Peter Finch and James MacArthur that make the movie a stand-out. Rent it, bring it home, and watch it with your girlfriend, your boyfriend, nephews, nieces, aunts, uncles, friends, parent, grandparents, or perfect strangers. By the end of the movie, you'll value the friendship that young Mr. Balfour and the spirited Highlander find for themselves.",
         "I know an honest appraisal when I see one. Add to that droits_de_l_homme is from Scotland so he knows what he is talking about. I just know I have always loved this movie. I have always been a fan of classic writers like Stevenson and Dickens. This Disney movie is long overdue for putting on DVD. Why such a great piece of work with a stellar cast has not been put on DVD before now is beyond me. I bought the VHS many years ago and I am glad I did as it is OOP now. If you are lucky enough to catch it on TV I am sure you will agree it is a masterpiece of family entertainment with an accurate depiction of Scottish history thrown in for good measure. I always hoped this would come out on DVD with Disney talking about the story behind it as he often did when these were made for the Disney TV show.",
         "Kidnapped is based on the novel by Robert Louis Stevenson and has been made several times. This Disney version is excellent. David Balfur's uncle arranges for him to be kidnapped and is taken aboard a ship but gets shipwrecked along the way but eventually manages to get back to Scotland after teaming up with adventurer Alan Breack Stuart. The journey takes them across the Scottish Highlands and face dangers along the way including soldiers in Redcoats. This movie is shot on location in the Scottish Highlands and contains some great scenery. The cast includes James MacArther, Peter Finch, Benard Lee (before his role as M in the James Bond movies), John Laurie (Private Frazer from Dad's Army), Finlay Currie, Nial MacGinnis and Peter O'Toole (Lawrence of Arabia). Excellent parts from all. Watching Kidnapped is an ideal way to spend an hour and a half one afternoon. Excellent. Rating: 3 and a half stars out of 5.",
         "If most people are asked what story by Robert Louis Stevenson they are acquainted with, more than likely they will say either TREASURE ISLAND or DR. JECKYLL AND MR. HYDE or KIDNAPPED. KIDNAPPED is a close second to TREASURE ISLAND as Stevenson's most popular complete novel (DR. JECKYLL is a novella). Like THE MASTER OF BALLENTRAE it deals with the great trauma of Scotland's 18th Century history - the failure of the 1745/1746 Jacobite Rebellion of Bonnie Prince Charlie which came so close to success. But it does not deal straight with the events of those years, but rather with the aftermath for Scotland, for England, and for Scottish society. David Balfour (James MacArthur) is a lowlander - he is from the urban centers of Scotland like Glasgow and Edinburgh and Dundee. These commercial centers play a serious role in his story, for David is returning to the home of his ancestors, which is also a business run by his uncle Ebenezer(John Laurie). He is met by a stingy miser who is hardly welcoming - actually he is quite hostile for awhile. But he gradually acts more quietly, if not more friendly to the nephew. At one point he asks him to retrieve some item in an upstairs section of the house they live in, and the stairs is in disrepair (nearly causing David to fall to his death). That settles it, and David just demands his inheritance and he'll be quit of this inhuman uncle. David goes to bed, and is awaken violently: he unknown men. They kidnap David (hence the title of the novel), and he is soon on board a ship commanded by the frequently drunken Captain Hoseason (Bernard Lee - \"M\" in the Sean Connery \"James Bond\" films) and his first mate Mr. Shaun (Niall MacGinnis). Soon David finds the ship (which is headed for America, where he may be sold as an indentured servant) has picked up a small boat, containing a single man, one Aleck Breck (Peter Finch). Breck is quite secretive of his being alone in such a desolate area, but Hoseason and Shaun suspect he is involved in some type of Jacobite treason. KIDNAPPED is set in the year 1752. Most people think that Jacobite activity ended with the defeat and destruction of Charlie's Highlander army at Culloden in 1746, and the \"clearances\" in the Highland of Charlie's supporters. It didn't. Jacobite activities would continue into the period of the Seven Years War. Stevenson shows that the tide has turned against the hard core of the Jacobites in Scotland - the strength were the Highland Clans, and they were purposely decimated . The lowland clans had hedged about their support (as in THE MASTER OF BALLENTRAE). But most, especially the Campbell family, went fully for the German Hanovarian Royal Family. The Campbells were rewarded, becoming the dominant noble family in Scotland (to this day). And that is the basis for the tragedy that is at the center of the story. A true tragedy and a murder mystery that has never been explained. Alec is actually Alec Breck Stewart, a relative of the Old Pretender and his son Bonnie Prince Charlie. He is in Scotland to contact surviving Jacobite leaders. This does not really sit well with David, a lowlander who had little use for the Highland clans or their leaders. But they become close friends and allies against Hoseason and his crew, and in surviving in Scotland's Highland area (where David is totally at sea). But David is also realistic enough to note his friend's two worse habits: he's a heavy gambler and he drinks too much. They have to make their way south, to get Alec through his mission and back to France, and for David to settle his accounts with Uncle Ebenezer. But they happen to meet with one of the most hated men in Scotland, Colin Campbell, known as \"The Red Fox\". He has been appointed by his cousin the Duke of Argyle to collect rents and help in the clearances. David has separated from Alec when he meets the arrogant Red Fox in the forest of Appin, and he is present when, from out of the forest, a shot is fired killing this man. David flees, and shortly is confronted by Alec. And David, despite his best endeavors, remains uncertain that Alec's secret mission was not tied to this assassination. The \"Red Fox's\" murder was never solved, although a major judicial murder, the hanging of James \"of the Glen\" Stewart, followed within a year (before a judge and jury entirely of Campbells). But it turns Alec and David into fugitives, increasing their dangers immensely. They might end up dangling from English ropes. I'll leave it at this point. Finch and MacArthur make a good pair of friends and adventurers, with Finch also showing Breck Stewart's failings (his temper, his loud mouth, his alcoholism, and his gambling). MacArthur (Helen Hayes' adopted son) also had a great scene regarding a dangerous confrontation with a greedy Highlander (Duncan Macrae) at a river in the highlands. The best recalled scene in this version is a bagpipe contest before one of their hosts (Finlay Currie) that was won by Currie's kinsman, a youngish man who movie goers would see more of later: Peter O'Toole. John Laurie is properly despicable (yet comical, in a pathetic way) as Ebenezer. Although there is a trace of more dignity in the Freddy Bartholemew - Warner Baxter KIDNAPPED from the 1930s, this one is actually the best movie version.",
         "Robert Louis Stevenson, born in Scotland in 1850 and sick with tuberculosis most of his adult life, was one prolific author of books of travel and adventure that are read and enjoyed even today. The imagery he creates in his books is so vivid that cinematic adaption is real easy. In fact this version of Kidnapped won high praise in the British Isles for being remarkably faithful to the book. The story was also filmed on location in Scotland lending a real authenticity to the story. A whole slew of Scots players got work in this one and Australian Peter Finch and American James MacArthur fit right in with them. Impossible for me to believe, but this Walt Disney film did not do as good in America as in Europe. I suppose it was both the accents and the knowledge of the political situation in Scotland post the rising in 1745 that Americans did not appreciate or were ignorant of. This American certainly did. Young David Balfour the heir to the manor of Shores has one big problem collecting his inheritance, the presence of his uncle who is the reigning laird. Uncle Ebenezer who is deliciously played by John Laurie arranges a snatch by a sea captain friend of his and David (James MacArthur) is to be sent to the Carolinas in the American colonies as an indentured servant. On the boat young David whose politics and heritage make him a supporter of the Hanoverian George II who is the reigning King of Great Britain finds himself having to make common cause with Scottish soldier of fortune Alan Breck Stewart who is played by Peter Finch and boasts proudly of bearing the name of the true House that ought to be running things. He's a Jacobite, a supporter of the claim of James III, who is exiled in France and who fought at Culloden with Bonnie Prince Charlie. These unlikely allies affect an escape from the ship and make their way back to the House of Shores to set things right. Being a Jacobite and by dint of that, a traitor in Hanoverian eyes makes it all the more dangerous for both of them. James MacArthur, son of playwright Charles MacArthur and Helen Hayes, was a young Disney star during that period, doing a whole bunch of roles for Disney on the small and big screen. Peter Finch makes his second and last appearance in a Disney film, he was memorable as the Sheriff of Nottingham in Disney's Robin Hood film. They have a good easy chemistry between them and if it were not so the film wouldn't have worked at all. Three other players of note here are Bernard Lee as the sea captain who kidnaps Balfour, Finlay Currie as a fellow Jacobite clan leader who gives Finch and MacArthur shelter, and Peter O'Toole who bests Finch in a bagpipe playing contest. Robert Louis Stevenson died in Tahiti in 1894, but in his short life left us a remarkable output of literature like Treasure Island, Dr. Jekyll and Mr. Hyde, The Master of Ballantrae, and so much more. Though he went to the South Seas for health reasons and a love of adventure, if that can be combined in one individual, his love of Scotland was never shown better than in Kidnapped and in this classic adaption of that story.",
         "As good as cinema has been in retelling the Robert Louis Stevenson classic. It also happens to be my favourite novel, as it was the first I read (age 11) where the central character, David Balfour speaks with my accent and dialect. Furthermore, as a young man growing up I related to David's character, beliefs and values which reflect those of my own upbringing in a loving secure Lowland Scots Presbyterian (Church of Scotland) family. My biggest criticism is that the character of David as portrayed by James MacArthur spoke with the petulance of a spoiled American kid which did not ring true for a country bred but well educated Lowlander ,who is the recently orphaned son of a Dominie (parish schoolmaster). The late John Laurie played Ebenezer Balfour pretty much as I imagined him from reading the book. Peter Finch made a surprisingly good Alan Breck Stewart, and his speech patterns were faithful both to the book and to a Gaelic speaker speaking in Scots. Many of the incidental characters were well cast and acted as well. The two that stick in mind were the Carter (Tinker) and Jennet Clouston, both characters from whom David seeks direction to the House of Shaws. A great piece of wholesome family entertainment that credits the viewer with intelligence and knowledge of Stevenson's understanding of Scottish History.",
         "When I watched this movie as a child, I was amazed and in awe by this adventure story that unfolded before me. In spite of the fact that I'm now older and more critical of the films I view, I couldn't help but admire the acting of Peter Finch and the others. Upon a recent viewing, I realized that much of the depth that makes this film so enjoyable was extremely overlooked in my youth. While the adventure is no \"Jurassic Park,\" the story that unfolds about friendship, courage and determination allows me to recognize this film, not only as a childhood favorite, but as a timeless classic which I think people of all ages can and will enjoy. Rent it, buy it or borrow it--you won't be disappointed!",
         "This comes across as a rather cheaply made movie, minimal production values, and that's a shame, because it has a very fine script delivered by very fine actors, chief among them Peter Finch, who delivers Alan Breck Stewart's lines like the Shakespearean actor he was, rolling those r's and turning the prose into poetry. Yes, the ships at sea look like they're in a bathtub, it's true, and the backgrounds, which could have been beautiful, are not, because the color is not that good. But the script is first rate, and so is the acting, and that wins the day. This is a story of male bonding, of a boy who becomes a man by going through trials under the supervision of a man. The sort of thing Kipling did so well a decade later in Captains Courageous - turned into another first-rate movie, if a less faithful one, with Spencer Tracy and Freddie Bartholomew. This is something of the same thing, except that, rather than riding the high seas, the duo wander through the dangers of the Scottish Highlands. It would have benefited from a better score, but still, I strongly recommend it. It is infinitely better than the sad travesty produced for no discernible reason by Masterpiece Theater.",
         "This a rollicking good story and even if you not seen the movie for many years you are in for a pleasant surprise. The scenery is wonderful and there are wonderful characters in the film and plenty of excitement. The scenes of the grand old ships on the mighty ocean really do look rather like boats in a bath tub but forget all that its a finely paced adventure movie. There are a few of Disneys favourite young actors in it and they are all very good but its Peter Finch who brings that special distinction to the film. He was a brilliant actor and even though its a Disney kids flick he gives it all he has got. Finch is brilliant and it is his film. There is a lovely scene with the incredibly handsome Peter O Toole."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Kidnapped and cheated out of his inheritance, young David Balfour falls in with a Jacobite adventurer, Alan Breck Stewart. Falsely accused of murder, they must flee across the Highlands, evading the redcoats.",
         "The adventures of the kidnapped boy David Balfour and his new friend, the former Jacobite rebel Alan Breck Stewart, in Scotland in 1752."
      ],
      "budget": 0
   },
   "movielensId": 2079,
   "movielens": {
      "languages": [
         "English",
         ""
      ],
      "releaseDate": "1960-01-01",
      "dvdReleaseDate": null,
      "directors": ["Robert Stevenson"],
      "runtime": 97,
      "movieId": 2079,
      "title": "Kidnapped",
      "mpaa": "",
      "actors": [
         "Peter Finch",
         "James MacArthur",
         "Bernard Lee",
         "John Laurie",
         "Niall MacGinnis",
         "Finlay Currie",
         "Miles Malleson",
         "Duncan Macrae",
         "Andrew Cruickshank",
         "Peter O'Toole",
         "Oliver Johnston",
         "Norman Macowan",
         "Edie Martin"
      ],
      "imdbMovieId": "0053994",
      "originalTitle": "Kidnapped",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Kidnapped and cheated out of his inheritance, young David Balfour falls in with a Jacobite adventurer, Alan Breck Stewart. Falsely accused of murder, they must flee across the Highlands, evading the redcoats.",
      "tmdbMovieId": 43037,
      "avgRating": 3.26689,
      "releaseYear": "1960",
      "numRatings": 148,
      "posterPath": "/atSe9V9JHkKfT5px9qrThOovSQZ.jpg"
   }
}