{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "misfit",
            "id": 9789
         },
         {
            "name": "boring",
            "id": 209005
         }
      ],
      "imdb_id": "tt0128214",
      "video": false,
      "title": "First Love, Last Rites",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 40542,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joey",
               "gender": 2,
               "credit_id": "52fe4bd9c3a36847f821673b",
               "name": "Giovanni Ribisi",
               "profile_path": "/jvq2pimmpNdQj8o75Au9RKC7E1z.jpg",
               "id": 1771,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sissel",
               "gender": 1,
               "credit_id": "52fe4bd9c3a36847f821673f",
               "name": "Natasha Gregson Wagner",
               "profile_path": "/g4k8hwH33fbFbCJGzaV57YujCvV.jpg",
               "id": 3270,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Red",
               "gender": 2,
               "credit_id": "52fe4bd9c3a36847f8216749",
               "name": "Donal Logue",
               "profile_path": "/h0JZ8Hyc9p6sY2jQeJkDcax6UY3.jpg",
               "id": 10825,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe4bd9c3a36847f821674d",
               "name": "Robert John Burke",
               "profile_path": "/ctVRWqY0KfSBIpaGulJMbhyE3jy.jpg",
               "id": 31512,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sissel's Mom",
               "gender": 1,
               "credit_id": "53d3c8660e0a26283b001de5",
               "name": "Jeannetta Arnette",
               "profile_path": "/uVaqZLhpTh5OmJDFSv7wim63sV1.jpg",
               "id": 2842,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Adrian",
               "gender": 2,
               "credit_id": "52fe4bd9c3a36847f8216755",
               "name": "Eli Marienthal",
               "profile_path": "/eK4kfRpE12lCoCamBJWyHfWDDbq.jpg",
               "id": 116027,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4bd9c3a36847f8216745",
               "name": "Jesse Peretz",
               "profile_path": "/1oLwXu3xXFzcaMv1hMRb8rrngbn.jpg",
               "id": 130816,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "547defcb9251412d78005b29",
               "name": "Ian McEwan",
               "profile_path": null,
               "id": 36589,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "547defd99251412d7f005d8f",
               "name": "David Ryan",
               "profile_path": null,
               "id": 78550,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.056405,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 118452,
      "vote_count": 1,
      "budget": 300000,
      "overview": "Joey and Sissel are two misfits spending most of their time together talking or having sex. Gradually and slowly their relationships are becoming boring for them.",
      "similar": [
         22705,
         80752,
         106646,
         979,
         14174,
         2149,
         1813,
         4771,
         6075,
         112160,
         4995,
         13885,
         122081,
         86331,
         28468,
         339692,
         627,
         185,
         1278,
         263472
      ],
      "original_title": "First Love, Last Rites",
      "runtime": 94,
      "poster_path": "/wJYpcNbeRqEqPM52nIzBiPgCsgc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Toast Films",
            "id": 40126,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Forensic Films",
            "id": 2813,
            "origin_country": ""
         }
      ],
      "release_date": "1998-08-07",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jesse Peretz"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Ian McEwan",
         "David Ryan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0128214/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NTM3NjQ3Ml5BMl5BanBnXkFtZTYwMjA2NTg5._V1_.jpg",
      "actors": ["Stars: Natasha Gregson Wagner, Giovanni Ribisi, Robert John Burke | See full cast and crew »"],
      "reviews": [
         "The filming of this movie is beautiful and well planned, however it doesn't make up for what, in my mind, the story lacks. At times the peculiarity of the events (and of Robert John Burke's failed attempt at a Creole accent) made me cringe. \"How could anyone be so stupid?\" I asked myself as Joey tagged alongside Sissel's creepy father. Other events that made me borderline-nauseous: the moontanning incident, the rat in the wall, the sex-on-the-pier fiasco. \"The sex-on-the-pier fiasco\" seemed to be Peretz's attempt to finally connect the dream sequences to something physically occurring in the movie, though in my mind, it failed miserably and I got a good hearty laugh out it. Besides the picturesque setting and great camera work, the only other redeeming qualities were Giovanni Ribisi (Joey) and Jeanetta Arnette (Sissle's mom). Natasha Gregson Wagner's Sissel seemed to a bit too psychotic for my tastes. Ribisi seems to have much talent, and Arnette's small role helped add moments of humor and excitement. See this movie for the acting/cinematography, not to be blown away.",
         "I rent a lot of movies. I enjoy a lot of the Independent and offbeat ones. But this one definitely was on my top 10 of hard to keep watching because it was soooo borrrring! Even though every other scene was sexually \"titilating\" I was disappointed. Don't bother!",
         "I rented the movie because I already had the soundtrack and loved it. I was thinking \"How bad can this movie be with a soundtrack like this?\" Well.....it wasn't great. It moved pretty slow for me. It was just....there. It felt like I was just killing time watching the movie. The two main actors are much better than the roles they played. I wouldn't mind seeing the two of them together in a different, better movie. Guess you can never judge a movie by its soundtrack.",
         "FIRST LOVE, LAST RITES is a movie that I know people will be bored with. It is slow for some tastes. Life is slow. This movie is so true to life and it's pacing seems all too real. It's amazing it's a story not of plot but of documenting time. The story inspired a screenplay that I just finished Belmar. It has such a slow core to it and is so atmospheric. Bottom line THIS IS AN ART FILM. (\"A movie simple enough for a child to understand with images strong enought for an adult\"-Roger Ebert. Different people will react differently to this movie. It's for the art crowd and for film students. It's not for the average multiplex movie goer unless they get darring and wana try something new. I hope Jesse Perez makes another movie, the actors were great, well I am a huge fan of Natsha Gerson Wagner. It's a very steamy masterpeace that moves with the charactors and the atmosphere. I have no idea why this film didn't make it big. It sure is a discovery on video!",
         "This simple little flic allows us to share the new worldly experiences of a traveller's love affair in Louisiana. He stumbles into a passionate woman and her peculiar family along with an eel and a creature scratching within the cavity of the wall. What more can a person ask for? Wonderfully paced with some awkward mannerisms from the performers who make it a treat to watch.",
         "This is a strange movie. The young stars spend a lot of time at home being bored, then they have sex, get bored again, listen to a phonograph, have sex, get bored again, talk, talk and talk. Natasha Gregson Wagner looks and sounds so much like her mother sometimes it is eerie. Slow moving, I think it was meant to be that way, perhaps to get the feeling of swampy Louisiana. Wagner's character is very unappealing, and it really hurts the film, but I liked her performance. Offbeat, and it sure doesn't make you feel warm all over. There didn't seem to be much point to the film. No one in the cast but Wagner stands out and the direction is simply bland.",
         "This movie was very basic in the sense that nothing was developed in every sense of a plot . There was no conflicts in the story really. Let me just say that there was no beginning, middle, or end . And when it was over you felt like all you did was watch nothing evolve into nothing.",
         "First Love, Last Rites may say it's directed by Jesse Peretz. And Peretz's pedigree as a former member of the Lemonheads (since when is that something Cool?) and as a commercial and video director may get this film its only real notice. And Ian McEwan may get credit for having written the story the film was based on. And Natasha Gregson Wagner and Giovani Ribisi may be the recognizable faces that would make somebody stop when the movie comes on TV. But only Tom Richmond, the director of photography, really deserves to put this film on his highlight reel. First Love, Last Rites is a slow, contemplative film that doesn't develop into anything. It's possible this might work better for some people than others. Sissel (Gregson Wagner) and Joey (Ribisi) are two kids spending the summer in a one bedroom shack up from the Bayou. They're basically drifting -- Joey from his Brooklyn roots and Sissel from her feuding parents. Basically they listen to records, have sex, and throw garbage around their place. Naturally it smells. Naturally there's a rat in the walls. And naturally they both need outlets. When Joey begins to go into the eeling business with Sissel's father Henry (Robert John Burke), Sissel goes to work at a sugar factory. And things get stressed. The story, by Ian McEwan is 14 pages long. And it's set in England. Why Peretz thought that moving the story to Louisiana and expanding it to 100 minutes is a bit of a mystery. Thanks to the beautiful colors and images Richmond produces, First Love, Last Rites at least feels like it's set somewhere. The fact that the actors all seem a little adrift is something else. It isn't just that the writing doesn't give any character depth to anybody. Ribisi gets to deliver a pointlessly Freudian monologue about the first time he was his parents having sex. Gregson Wagner gets to pout a lot. Burke, as the Vietnam vet father, has the most colorful part and his intensity seems both out of place and strangely pleasant. Even if he feels like he's acting in a different movie, his appearances strengthen the film. None of the actors effectly reproduce any kind of accents. The film that immediately comes to mind after seeing this one is Victor Nuñez's Ruby in Paradise. That, of course, is a better film. Nuñez produces the thing that Peretz most fails at -- authenticity. Ruby features authentic emotions, authentic performances, authentic images, and a plot that grows organically from the surroundings. Gregson Wagner, Ribisi, and Burke are all very sincere in their performances, but no amount of trying can make any of it seem real. A side note: Another review of the film made note of the preponderance of drowning imagery involving Natasha Gregson Wagner. Now, seeing as how much of her appeal as an actress (an actress, let me emphasize, who's beginning to get much too old to keep playing teenagers and innocents) comes from her similarities to her mother, Natalie Wood, isn't the director who keeps showing her drowning a little bit sick? I think so... Neither here nor there, I guess. First Love, Last Rites is a film of greens and blues, of sunsets and squirming eels. It's a film of beautiful pictures and minimal story. The photography is very fine, but it's not enough to give this film more than a 5/10.",
         "Why did I waste ninety minutes of my life on this piece of crap? Badly acted, horrendously directed and utterly devoid of a coherent story (climaxed by the brain-dead lead squashing a rat), how the hell does this thing garner these sort of numbers in here? Anyone giving this thing a 10 must be a masochist, desperately in need of therapy. First love? For whom? Obviously not these two sexaholics (though none of their sex scenes could ignite a candle). Last rites? Who for...the rat? That's about the only thing actually dying in this film whose title itself is a blatant lie. My only consolation is that I found this for 2 bucks in a bargain bin, but I WANT MY NINETY MINUTES BACK! Curse each and every talentless hack who helped birth this hunk of garbage!!",
         "The main virtue of this movie is the cinematography and the languorous mood it creates. The plot on the other hand was nonsensical and boring. The Joey character was good for a young man experiencing his first love, but I found the Sissel character convoluted and hard to follow. There were a lot of parts where Sissel's character was overacted and boring at the same time, and this especially made me not like the movie. I don't recommend this movie."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Forensic Films",
         "Toast Films"
      ],
      "summaries": ["Joey and Sissel are two misfits spending most of their time together talking or having sex. Gradually and slowly their relationships are becoming boring for them."],
      "budget": 300000
   },
   "movielensId": 2127,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-07",
      "dvdReleaseDate": null,
      "directors": ["Jesse Peretz"],
      "runtime": 94,
      "movieId": 2127,
      "title": "First Love, Last Rites",
      "mpaa": "R",
      "actors": [
         "Giovanni Ribisi",
         "Natasha Gregson Wagner",
         "Donal Logue",
         "Robert John Burke",
         "Jeannetta Arnette",
         "Eli Marienthal"
      ],
      "imdbMovieId": "0128214",
      "originalTitle": "First Love, Last Rites",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["oqms7TYyu6A"],
      "plotSummary": "Joey and Sissel are two misfits spending most of their time together talking or having sex. Gradually and slowly their relationships are becoming boring for them.",
      "tmdbMovieId": 118452,
      "avgRating": 2.61364,
      "releaseYear": "1998",
      "numRatings": 44,
      "posterPath": "/wJYpcNbeRqEqPM52nIzBiPgCsgc.jpg"
   }
}