{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spider",
            "id": 3986
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "talking animal",
            "id": 11477
         },
         {
            "name": "drying self with towel",
            "id": 169903
         },
         {
            "name": "animal human communication",
            "id": 169908
         },
         {
            "name": "spiderweb",
            "id": 169909
         },
         {
            "name": "sentimental",
            "id": 169911
         },
         {
            "name": "talking pig",
            "id": 206052
         }
      ],
      "imdb_id": "tt0070016",
      "video": false,
      "title": "Charlotte's Web",
      "recommendations": [
         13382,
         13225,
         31102,
         13675,
         13353,
         13377,
         47951,
         54648,
         15668,
         6878,
         19186,
         43580,
         18846,
         14900,
         15739,
         216971,
         13187,
         21793,
         22660,
         19933
      ],
      "backdrop_path": "/rcFsZsgTwC4fz8Hv0d2MtauO9Rh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Charlotte A. Cavatica",
               "gender": 1,
               "credit_id": "52fe46409251416c75072501",
               "name": "Debbie Reynolds",
               "profile_path": "/p5o3qOl4bFZxrnUxG826cIN0GvP.jpg",
               "id": 8857,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Wilbur",
               "gender": 2,
               "credit_id": "52fe46409251416c75072505",
               "name": "Henry Gibson",
               "profile_path": "/5dmU4muna3kpU2aFM4eU2Ij12Xn.jpg",
               "id": 19439,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Avery Arable",
               "gender": 2,
               "credit_id": "52fe46409251416c75072509",
               "name": "Danny Bonaduce",
               "profile_path": "/2NmscaLKD0FHphQvL7pSe5gTRCQ.jpg",
               "id": 75315,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The Goose",
               "gender": 1,
               "credit_id": "52fe46409251416c7507250d",
               "name": "Agnes Moorehead",
               "profile_path": "/ajpbxYhFVcpGAGMnux9zCwzRYlo.jpg",
               "id": 11025,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Homer Zuckerman",
               "gender": 2,
               "credit_id": "52fe46409251416c75072511",
               "name": "Bob Holt",
               "profile_path": "/7gYjFpxubuucIsMtLK7CWU7W1wy.jpg",
               "id": 33482,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Templeton",
               "gender": 2,
               "credit_id": "52fe46409251416c75072515",
               "name": "Paul Lynde",
               "profile_path": "/aBf0zWCExaZMQa9K6WhzChng6xM.jpg",
               "id": 40209,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe46409251416c75072519",
               "name": "Rex Allen",
               "profile_path": "/nW4Az8MvP87OnGgZbW71FwD9pL9.jpg",
               "id": 106830,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ram",
               "gender": 0,
               "credit_id": "52fe46409251416c7507251d",
               "name": "Dave Madden",
               "profile_path": "/8ZRWtgxcJxDrQHCaRLxD9uu8dNw.jpg",
               "id": 106833,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Fern Arable",
               "gender": 1,
               "credit_id": "52fe46419251416c75072539",
               "name": "Pamelyn Ferdin",
               "profile_path": "/eirueGz9kvztT8SkuArnVV0RoLT.jpg",
               "id": 16059,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Farmer Arable",
               "gender": 2,
               "credit_id": "52fe46419251416c7507253d",
               "name": "John Stephenson",
               "profile_path": "/5atzhAYw83cax7bEgN22YGoEgu1.jpg",
               "id": 15869,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Mrs. Arable",
               "gender": 1,
               "credit_id": "52fe46419251416c75072541",
               "name": "Martha Scott",
               "profile_path": "/ncuwnj0bgG62KlT8RSAhEdssamg.jpg",
               "id": 10022,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Mrs. Zuckerman / Mrs. Fussy",
               "gender": 1,
               "credit_id": "52fe46419251416c75072545",
               "name": "Joan Gerber",
               "profile_path": "/bu3rNMpcxoptlBlKi1xNoxCEhn.jpg",
               "id": 90301,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Lurvy",
               "gender": 2,
               "credit_id": "56c8d780c3a368408c004662",
               "name": "Herb Vigran",
               "profile_path": "/wArAG67tnl4ph5HyHDnaNmL56Cr.jpg",
               "id": 134614,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Jeffrey",
               "gender": 2,
               "credit_id": "52fe46419251416c7507254d",
               "name": "Don Messick",
               "profile_path": "/2JfSTw3cqnsbpcW4ShaNTa4cWH9.jpg",
               "id": 16422,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Henry Fussy",
               "gender": 2,
               "credit_id": "52fe46419251416c75072551",
               "name": "William B. White",
               "profile_path": null,
               "id": 1083646,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46409251416c75072523",
               "name": "Charles A. Nichols",
               "profile_path": "/mcUoZsjU5qvI1N7Y5Kw7UWwHN7y.jpg",
               "id": 106834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46409251416c75072529",
               "name": "Iwao Takamoto",
               "profile_path": "/73b4KnxjllObAutDQ7ybASM4rIV.jpg",
               "id": 106835,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46409251416c7507252f",
               "name": "E.B. White",
               "profile_path": "/lL7BHVxrydz8NDNGsozWheLmfvl.jpg",
               "id": 61480,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe46419251416c75072535",
               "name": "Earl Hamner, Jr.",
               "profile_path": null,
               "id": 61479,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53d3ec440e0a2628380023a2",
               "name": "Joseph Barbera",
               "profile_path": "/A8Lorvx5HirKefQWmhftWGO5VI4.jpg",
               "id": 13594,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53d3ec530e0a26284700227f",
               "name": "Edgar M. Bronfman",
               "profile_path": null,
               "id": 61482,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "53d3ec620e0a2628380023ab",
               "name": "William Hanna",
               "profile_path": "/3rCaagU4QRi0JJhcdbUGKoqEWtG.jpg",
               "id": 13620,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53d3ec7b0e0a26284700228c",
               "name": "Irwin Kostal",
               "profile_path": null,
               "id": 68137,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.682429,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15171,
      "vote_count": 120,
      "budget": 0,
      "overview": "Wilbur the pig is scared of the end of the season, because he knows that come that time, he will end up on the dinner table. He hatches a plan with Charlotte, a spider that lives in his pen, to ensure that this will never happen.",
      "similar": [
         11224,
         9325,
         872,
         224141,
         14128,
         16119,
         407655,
         2005,
         31900,
         18126,
         60405,
         10537,
         15157,
         16367,
         9986,
         45272,
         43600,
         30197,
         1125,
         409447
      ],
      "original_title": "Charlotte's Web",
      "runtime": 94,
      "poster_path": "/aX0r77IQffLo3Efo6sP2ORwIcEM.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Hanna-Barbera Productions",
            "id": 1353,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sagittarius Productions",
            "id": 18170,
            "origin_country": ""
         }
      ],
      "release_date": "1973-03-01",
      "vote_average": 6.3,
      "belongs_to_collection": {
         "backdrop_path": "/1FanC71rFOOJukt95FedjAI5iBk.jpg",
         "name": "Charlotte's Web Collection",
         "id": 263193,
         "poster_path": "/7sg3elvEwetbPtTbMwr9IuegAtD.jpg"
      },
      "tagline": "That humble radiant terrific book is now a humble radiant terrific movie.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Charles A. Nichols",
         "Iwao Takamoto"
      ],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "E.B. White",
         "Earl Hamner Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070016/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NjExNDExNF5BMl5BanBnXkFtZTYwOTI0NjU5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Debbie Reynolds, Henry Gibson, Paul Lynde | See full cast and crew »"],
      "reviews": [
         "So far, I've seen two completely different points of view in the comments for this movie. One was so-so, the other thought it was completely awful. Well, I would like to add a third: I thought it was charming. \"Charlotte's Web\" is my absolutely favourite story, and one of the most treasured books in my personal library. This movie, while far from perfect, does stay very true to the original story (which, in case Negative Nellie may have missed, Disney does NOT do -- even though I love Disney, too). It's true the animation isn't the best, but you have to realize that \"Charlotte's Web\" was made in 1973, WAAAAAY before the computer-animated wonders of the '80's and '90's. The animation in the '70's was still stuck in the Saturday-morning-cartoon format, where, instead of animating every single cel, the animators would animate every third or fifth cel. It saved time, money, and you still got animation -- just not very sophisticated animation. Disney and Max Fleischer were really the only ones that were trying to push animation beyond the extremely confined limits it was once stuck in. So you can't really fault the movie for that, it was a common fault 20 years ago to get stuck in a rut. (It's still happening today, or hasn't anyone watched \"Godzilla\", \"Armageddon\", or \"Starship Troopers\"? Just because the animation is more advanced doesn't mean that it isn't becoming redundant). Other than the animation, \"Charlotte's Web\", taken from a purely entertainment level, is really not that bad. I still enjoy watching this movie, and the voice actors actually closely match the voices I've made in my head for the characters in the book over the years. Especially Templeton. His scene when he comes back from his night of gorging at the fair cracks me up. \"In case you haven't noticed, there are over 8,000 eggs in that tiny little sac.\" \"This HAS been a night!\" HA! The songs seem a little out of place at times, but on the whole, I still find this movie very enjoyable. It's not deep, it's not profound, it's a piece of mindless fluff, with some very nice performances from the voice actors and a lot of very cute moments. It's children's fare, folks, so just take it as such, and it's a lot easier to take. I liked it. So there.",
         "I just rented this for my kids (ages 4 & 6) and had completely forgotten that adults can enjoy it, too. I'm quite weary of the obnoxious Disney-fication of most kids movies these days. (Spare me any more simpering princess stories.) The story of the clever spider who tries to save a pig from becoming breakfast meat is a familiar one and can be appreciated by many. The voice talent here is so superb that the movie doesn't make you rue the day they decided to animate the book. The songs aren't overly saccharine and are actually quite catchy. The movie is worth it alone for Templeton's trip to the fair and \"a fair is a veritable smorgasbord-orgasbord-orgasbord\" song. Debbie Reynolds' Charlotte is warm and wise, Wilber is naive and friendly, and Templeton provides the perfect foil as a spoiled rat who's just in it for himself. Agnes Moorehead as the goose became a sort of comedic extra to make the little ones laugh in the face of the rather adult plot about life and death. Overall, it's a movie for the whole family.",
         "This film didn't completely capture the magic of the beloved E.B. White book I remembered from childhood, but it's head and shoulders above most of the animated fare of its time. The beautiful and poignant book suffers a little under the ham-handed treatment of Earl Hamner Jr. and the obligatory songs, fine as far as songs go, should mostly be gone. All in all, this is a thoroughly enjoyable film, overflowing with the voices of some of the best talent of its time, some of the best animation Hanna Barbera ever did, and a story that never gets old.",
         "When Farmer Zuckerman was going to \"do away with\" the runt of his pig's litter, his daughter tearfully convinces him to allow her the responsibility of raising \"Wilbur\". Wilbur turns into the barnyard joy, and eventually wins not only first prize at the fair, but because of the wisdom of the old spider, Charlotte, becomes a famed attraction. This classic children's story deals with the life cycle and explains, through the farm animals' eyes, that birth, life and eventual death are all natural, and nothing to fear. After a life of work, Charlotte dies, but all are reminded of her \"magic\" when her little baby spiders hatch and go on into the world to live their lives. Debbie Reynold lends her voice to Charlotte, and several beautiful songs envelop this delightful story. This one is right up there with animated Disney Classics, a film every child should enjoy, one of the very best in its class.",
         "This, and maybe one other film, are the only films I've seen that made me cry...and I don't usually cry when watching films; I'm aware too much of how they are made. It's a wonderful translation of the story in the since that all the warmth is there. When fall comes along it FEELS like fall (same as in the animated version of Ray Bradbury's The Halloween Tree). Debbie Reynolds' voice is beautiful for Charlotte and fit the animated character's blue/gray smiling face. I'd dare say the story comes across better than some of Disney's most recent stuff (though I'd still have to bow down to Beauty and The Beast, one of my all-time faves). As far as animation goes, Charlotte's Web proves once again that it's all about story; the most beautiful animation in the world can't save a lousy story...no matter what. And I highly doubt that the new live action version coming out will be half as charming as this animated classic. I could be wrong. I hope I'm wrong...but I doubt it.",
         "This is a truly wonderful children's movie. It tells the story of some barnyard animals who interact one summer, but gently, and on a level a child can understand, also analyzes some deep truths about life itself. The story introduces us to a variety of animals (who possess the ability to talk when humans are absent) with unique personalities. One is a frightened pig named Wilbur (voiced by Henry Gibson) who learns his days are numbered in a pig's cruel fate. Another is the scheming and selfish rat Templeton (Paul Lynde in a great comic relief role). Finally, there's Charlotte the spider (Debby Reynolds) who uses the only tool she has at her disposal to try to rescue her friend Wilbur. There are a variety of other amusing creatures in the barnyard, voiced humorously by wonderful actors who are fun to identify as the movie progresses. Humans have an external role in the action. By that I mean they're on the outside looking in (although there are some subplots about the human characters). Many things that are done by the animals are for the humans' benefit. I love Pamela Ferdin's voice for Wilbur's owner, Fern. Human characters change, like the animals do, in parallel stories that emphasize the story's morals about life. Rex Allen's cool country voice, so familiar from Disney nature movies, is perfect for the narration. Several of the songs are great, too. The haunting title song is as \"lovely and lyrical\" as the web it's describing. \"Mother Earth and Father Time\" beautifully describes the story's main theme. Templeton's mad feast of garbage while singing \"At the Fair\" is lots of fun. This is \"some terrific, radiant, humble\" movie that presents the best of old school cartoon animation. A sweet story of friendship, love, loyalty, and other positive elements. It's being remade as a live action movie, and I'm not certain how that'll translate from animation; but this original version is recommended for fine family viewing.",
         "This animated version of the E.B. White children's classic is short on spectacular animation but long on heart and boasts a wonderful cast of voice talents. Earl Hamner, Jr., of \"The Waltons\" fame, creates a seamless plot which retains the true flavor of the book while cleverly rearranging the order of events and giving some of the better lines to different characters. The story of Wilbur, the runt pig saved by Fern Arable and later shipped to her Uncle Zuckerman's farm, only to discover that he's slated for the butcher's knife, is lively and fun. Charlotte, the wise and well-spoken spider played wonderfully by Debbie Reynolds, devises a scheme to save Wilbur's life. Henry Gibson is right on as the naive and nervous but generally happy Wilbur. Agnes Moorhead shines as the haughty and stuttering goose: \"I'm no flibberty-ibbity gibbet!\" Paul Lynde easily steals the show as Templeton, the smarmy barn rat; his late-night gorge-fest at the fair is a hilarious highlight of the movie. The songs written for the movie are a bit on the syrupy side, but Debbie Reynolds' sweet singing voice and some clever, funny lyrics make them bearable to adults.",
         "I was surprised to find that other reviewers here, especially an admirer of other Sherman & Sherman songs such as those in Mary Poppins, would find the songs in Charlotte's Web to be \"inane\", \"not well written\", \"worst songs ever penned for a movie\", etc. Perhaps it's largely because the first song, \"You and Me\" (6:37) really is unpleasantly syrupy sweet and in the worst early 1970's sort of way, and one of the last ones, \"Some Pig\" (1:19:40), is a somewhat annoying marching band song that only a small child could really enjoy. Some of the others aren't great either -- \"Charlotte's Web\" (38:15) and \"Mother Earth and Father Time\" (54:27, and reprised at 1:25:35) are both on the cloying side and unrewarding, and for adults require either patience or the fast-forward button. But good musicals are measured by their best songs, not their worst. Bearing in mind that this is a children's movie, \"Chin Up\" (22:36) is absolutely magnificent and easily ranks with Sherman & Sherman's best work. \"I Can Talk\" (15:12) and \"Lots in Common\" (30:50) are both excellent and timeless. \"Veritable Smorgasbord\" (58:50, and reprised at 1:11:36) is a lot of fun, though its fun depends a lot on the story, animation, and Lynde's hysterical singing; it wouldn't stand on its own quite as well as the others. Some of them are compromised to varying degrees by the goofy farmyard animal voices singing the songs, but only the most brain-dead Philistine would let that get in the way of enjoying a great children's song. For those reviewers who disliked the songs, it would be interesting to watch their faces while listening to \"Chin Up\" a couple times in a room full of children (after all, this is a children's movie), and then listen to them read their own words. I don't know how they could keep a straight face.",
         "I think every kid has to see this movie. It's a charming and delightful little flick. I wish they would make more movies like this than all the fancy computer effect movies of today. I'm serious, I think this is more impressive as far as animation goes. Charlotte's Web is a great flick to watch. Even though I enjoyed the book more as a child, I still loved to watch this film. I would recommend it for children. It's a little cheesy at times. But it has good lessons and morals. Hence, why I say it's for kids. There are some catchy toons though. Even the adults might still get into it. 8/10",
         "CHARLOTTE'S WEB, in my opinion, is a very touching movie about a special friendship for all ages that will warm your heart and possibly make you cry. I really loved the things that Charlotte (voice of Debbie Reynolds) did for Wilbur (voice of Henry Gibson). If I could have, I would have helped saved Wilbur myself. The only problem is how I would hide him, though. The music was good, everyone was cast perfectly, and the direction was flawless. In conclusion, I highly recommend this very touching movie about a special friendship for all ages to anyone who hasn't seen it. You're in for a real treat and a good time, so go to the video store, rent it or buy it, kick back with someone close to you, and watch it. I guarantee you you'll thoroughly enjoy it."
      ],
      "genres": [
         "Animation",
         "Family",
         "Musical"
      ],
      "productionCompanies": [
         "Hanna-Barbera Productions",
         "Paramount Animation",
         "Paramount Pictures"
      ],
      "summaries": [
         "Based on the beloved children's novel by E.B. White, this is the story of a little pig named Wilbur who was born a runt. Mr. Arable decides to kill him for dinner food but his daughter Fern begs him to let him live. On greater maturity, Wilbut is sold to Fern's uncle, Homer L. Zuckerman, in whose barnyard he's left yearning for friendship, but is snubbed by other barn animals. Wilbur is scared of the end of the season, because he knows that come that time, he will end up on the dinner table. He hatches a plan with Charlotte, a gentle and wise grey spider that lives in his pen, to ensure that this will never happen.",
         "This is the story of a little pig named Wilbur who was born a runt, and Mr. Arable decides to kill him! His daughter Fern begs him to let the helpless little pig live. Her father decides to let Fern keep him as a pet. Wilbur meets a bunch of new friends including Charlotte. Once Wilbur turns five weeks old, Fern has no choice but to sell him to another farm. Mr. and Mrs. Arable calls up Fern's uncle Homer L. Zuckerman. Meanwhile, Wilbur has notice that Mr. Zuckerman and Lurvy are plotting to kill him! So he hatches a plan with his dear friend Charlotte A. Cavatica, a beautiful large grey spider. It's up to Charlotte to save Wilbur's life before he will end up on the dinner table at Christmastime!",
         "A gentle and wise grey spider with a flair for promotion pledges to save a young pig from slaughter for dinner food."
      ],
      "budget": 0
   },
   "movielensId": 2137,
   "movielens": {
      "languages": [""],
      "releaseDate": "1973-03-01",
      "dvdReleaseDate": "2001-06-19",
      "directors": [
         "Charles A. Nichols",
         "Iwao Takamoto"
      ],
      "runtime": 94,
      "movieId": 2137,
      "title": "Charlotte's Web",
      "mpaa": "G",
      "actors": [
         "Debbie Reynolds",
         "Henry Gibson",
         "Danny Bonaduce",
         "Agnes Moorehead",
         "Bob Holt",
         "Paul Lynde",
         "Rex Allen",
         "Dave Madden",
         "Pamelyn Ferdin",
         "John Stephenson",
         "Martha Scott",
         "Joan Gerber",
         "Herb Vigran",
         "Don Messick",
         "William B. White"
      ],
      "imdbMovieId": "0070016",
      "originalTitle": "Charlotte's Web",
      "genres": [
         "Music",
         "Animation",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [
         "QH2vwaiEHRY",
         "6HtYsN1vIf0"
      ],
      "plotSummary": "Wilbur the pig is scared of the end of the season, because he knows that come that time, he will end up on the dinner table. He hatches a plan with Charlotte, a spider that lives in his pen, to ensure that this will never happen.",
      "tmdbMovieId": 15171,
      "avgRating": 3.52143,
      "releaseYear": "1973",
      "numRatings": 6625,
      "posterPath": "/aX0r77IQffLo3Efo6sP2ORwIcEM.jpg"
   }
}