{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stone age",
            "id": 4428
         },
         {
            "name": "tribe",
            "id": 10148
         },
         {
            "name": "cavemen",
            "id": 159955
         },
         {
            "name": "prehistoric adventure",
            "id": 178645
         },
         {
            "name": "prehistoric times",
            "id": 183414
         },
         {
            "name": "neanderthal",
            "id": 191348
         },
         {
            "name": "prehistoric man",
            "id": 192918
         }
      ],
      "imdb_id": "tt0090848",
      "video": false,
      "title": "The Clan of the Cave Bear",
      "recommendations": [
         25190,
         39411,
         25133,
         95630,
         30230,
         206537,
         80346,
         51144,
         26042,
         118430,
         33201,
         433524,
         44000,
         36996,
         22792,
         19809,
         13903,
         20551,
         35066,
         26603
      ],
      "backdrop_path": "/ly7CqVoNNwbS4xcB8GXiX1l23LG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ayla",
               "gender": 1,
               "credit_id": "52fe45ae9251416c7505ec9b",
               "name": "Daryl Hannah",
               "profile_path": "/4LLmp6AQdlj6ueGCRbVRSGvvFSt.jpg",
               "id": 589,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Iza",
               "gender": 1,
               "credit_id": "52fe45ae9251416c7505ec9f",
               "name": "Pamela Reed",
               "profile_path": "/lJgMi6Y4OvB8ZTpopFmJ3Efe5Sq.jpg",
               "id": 14699,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Creb",
               "gender": 2,
               "credit_id": "52fe45ae9251416c7505eca9",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Broud",
               "gender": 0,
               "credit_id": "5623508cc3a3680e0e00de46",
               "name": "Thomas G. Waites",
               "profile_path": "/siYdrSBj0ubxuCZm66lotNulg6M.jpg",
               "id": 15419,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Brun",
               "gender": 2,
               "credit_id": "5623509bc3a3680e1d00da66",
               "name": "John Doolittle",
               "profile_path": null,
               "id": 172725,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Goov",
               "gender": 2,
               "credit_id": "52fe45ae9251416c7505ecad",
               "name": "Curtis Armstrong",
               "profile_path": "/6rsU7P4jwTC41lifKcXHHKU3uXO.jpg",
               "id": 87003,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Grod",
               "gender": 2,
               "credit_id": "562350ec9251417f4700a954",
               "name": "Martin Doyle",
               "profile_path": null,
               "id": 168627,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Middle Ayla",
               "gender": 1,
               "credit_id": "56235120c3a3680e1d00da82",
               "name": "Nicole Eggert",
               "profile_path": "/xkpPODDLjrwcNNaDcWcbnwwPWJs.jpg",
               "id": 44711,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Narrated by (voice)",
               "gender": 1,
               "credit_id": "562351439251413a740084ed",
               "name": "Salome Jens",
               "profile_path": "/8j4USKO81HQSa6fmB086crtnq3S.jpg",
               "id": 86343,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ae9251416c7505eca5",
               "name": "Michael Chapman",
               "profile_path": "/uGg69IydM1NTgbjEHZVVyCDOW8s.jpg",
               "id": 1044,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ae9251416c7505ecb3",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45ae9251416c7505ecb9",
               "name": "Jean M. Auel",
               "profile_path": null,
               "id": 1201714,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "576c70399251411566000859",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "576c705092514107fc000d23",
               "name": "Jan de Bont",
               "profile_path": "/9kPf2LuyLLwCawSGyPIQCX7ighX.jpg",
               "id": 2209,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "576c706992514118ab0006d4",
               "name": "Wendy Greene Bricmont",
               "profile_path": null,
               "id": 10548,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "576c707dc3a3686a8b00094b",
               "name": "Curtis Burch",
               "profile_path": null,
               "id": 136232,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "576c70839251411738000682",
               "name": "Amanda Mackey",
               "profile_path": null,
               "id": 2031,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "576c708c92514107ed000cda",
               "name": "Anthony Masters",
               "profile_path": "/32OGKBShuM420L7FxP1XfXfjqBz.jpg",
               "id": 12510,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "576c7093c3a3686b430008b1",
               "name": "Kimberley Richardson",
               "profile_path": null,
               "id": 16549,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "576c709b9251411519000771",
               "name": "Kelly Kimball",
               "profile_path": null,
               "id": 185777,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "576c70a392514118ab0006f2",
               "name": "Justis Greene",
               "profile_path": null,
               "id": 113982,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.836867,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13853,
      "vote_count": 37,
      "budget": 15000000,
      "overview": "Natural changes have the clans moving. Iza, medicine woman of the \"Clan of the Cave Bear\" finds little Ayla from the \"others\"' clan - tradition would have the clan kill Ayla immediately, but Iza insists on keeping her. When the little one finds a most needed new cave, she's allowed to stay - and thrive.",
      "similar": [
         425,
         35002,
         3591,
         58691,
         17610,
         62204,
         30505,
         18905,
         49519,
         10567,
         18890,
         88751,
         278154,
         10406,
         13363,
         387893,
         24749,
         45361,
         102443,
         27591
      ],
      "original_title": "The Clan of the Cave Bear",
      "runtime": 98,
      "poster_path": "/uqEQ2OUC84hVRQpsbgANlbcX0F8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jonesfilm",
            "id": 22297,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Producers Sales Organization (PSO)",
            "id": 11670,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Guber-Peters Company",
            "id": 4357,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Jozak Company",
            "id": 69888,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Decade",
            "id": 69889,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1986-01-17",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "At The Dawn Of Mankind, A Woman Led The Way.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Chapman"],
      "runtime": 93,
      "synopsis": "Orphaned homo sapiens child Ayla is taken in and raised by a roving Neanderthal band, learns to be a healer and a huntress in the Clan. No English or many spoken words at all.",
      "writers": [
         "Jean M. Auel",
         "John Sayles"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090848/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4NDY4NjYwOF5BMl5BanBnXkFtZTcwODQyODMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Daryl Hannah, Pamela Reed, James Remar | See full cast and crew »"],
      "reviews": [
         "so far, aside from the comments here at IMDB, i have not seen one positive review for this film. i just don't get it. i honestly think it's a political assault against a film that threatens reviewers jealously guarded dogmas. for me the film is escapism at it's finest. it's a film about cave dwellers that doesn't condescend by having the characters speak in english, but instead in subtitled \"neanderthal\". it gives the film believability as far as i'm concerned. it's not a film about great conflicts and battles in pre-history, it's merely a character study about the final days of the neanderthals and how they are threatened by cro-magnons (daryl hannah). it isn't an overly flowery movie. a couple of times it gets down and dirty in it's portrayal of mob rules mentality and racism. maybe the film offends viewers because they see themselves in the characters and don't like the comparison. all of the unpleasant behaviors, although simplified in the movie, still happen today in \"more civilized times\". people are still threatened by anyone different, women still get raped, sexism hasn't gone away and populations are still ruled by ruthless dictators. for me, clan of the cave bear is a totally believeable story of life as it may have been 50,000 years ago. it protrays primitive people with primitave language, laws and beliefs with an honest affection. it's more of a \"documentary\" about daryl hanna's trials and tribulations in her adopted tribe than it is a plotted story. it comes off more like real life. while anyone is entitled not to like the movie for whatever reason, i find the movie highly entertaining and an excellent escape into the world as it might actually have been long ago. it easily holds a spot in my top 50 list for it's totally unique experience. i give it a 10 for bravely going where few films dare to and succeeding admirably without following boring hollywood formulas. it just doesn't deserve it's bad reviews at all. i don't give 10's out to many films either.",
         "I saw this little unknown gem two days ago, and I was just blown away by all the horrible reviews for it back in 1986. I just don't understand why people didn't want to see a healthy Darryl Hannah as the cave girl, Ayla. Maybe it's because, Darryl Hannah didn't appear nude, even though the costumes are scantily. All in all, It is a nice movie to watch. It tugs at your heartstings seeing all of the brutal honesty presented on screen. And that music! Oh, I was the Niagra Falls from the beautiful music. The most heart-breaking scene of this movie is when Ayla is separated from her mother at 2, from a vicious earthquake. The ghastly \"R\" rating is unecessary, altough the rape scene is horrible and graphic, they could have sacrificed for a PG or PG13.Watch this one if get the chance. You won't be disappointed! 1986 98 minutes Rated: R CC.",
         "This is one of the films that I grew up watching, and even now, I love it and admire its beauty as much as I ever did. First of all, comparing movies to their books isn't something we should do, because they are two different forms of entertainment, and can take different liabilities. What is important is if the movie still tells the basic story, and in the case of the Clan of the Cave Bear, it stuck to the original story in a very suitable fashion. I must admit that when I first saw this movie, I did not know that this was from a book. It wasn't until 15 years later that I read the book, and it confirmed my statement that the movie kept the story intact. As far as the acting was concerned, I have to admire a cast that had to convey throughout an entire script in a totally different language, and manage to keep it consistent. Watching the film, you can see that certain gestures always mean the same thing, as well as certain grunts and sounds. Folks, that is the result of a lot of hard work, and to put down that part of the film is like looking at the Empire State Building as just the result of an erector set. The basic story of the movie is to show prejudice against what is new and not understood. Ayla's presence is meant to show the Clan what the future holds, which is the underlying reason why they fear and hate her, though they are unaware of the reasons. Ayla endures many trials throughout the movie in order to gain their trust and approval, which ultimately prepare her for a journey into the world without the Clan. A movie worth watching again and again. The book is great also, by the way, so I recommend them both.",
         "The movie version of 'Clan of the cave bear' isn't really a bad adaption - but the very fact that this is a movie, running less than two hours, forces it to be a very compact version of the book. A lot of the details are left out, which of course is unfortunate. Overall, the acting is quite good. How are we really supposed to act so it will be like neanderthals? Can you really put all their knowledge and way of life and act it out when modern man is so much different (or are we?). Daryl Hannah is probably a good choice for Ayla at the time, and thanks to the 80's still Allowing 'rougher stuff' to be shown, or as I prefer it: more natural, the abuse described in Auel's novel is to most extent included. To sum it up: an OK adaption, but a 2-hour movie does not make this novel justice.",
         "If the movie lacks anything it is the beauty of the photography in films like \"Quest for Fire\" and \"Windwalker\". Otherwise I can't find any serious flaws. It is rare to find a decent movie about prehistoric peoples. \"Quest for Fire\" is the best movie of this kind in my opinion but \"Clan of the Cave Bear\" is a close second. I am not trying to compare \"Cave Bear\" to the books by Jean M. Auel. To me the film takes the best part of Auel's story and makes a pretty good movie. The later Auel stories become more romance novel fodder and to some that may be more entertaining. \"Clan of the Cave Bear\" is not romantic. It captures the brutality of prehistory very well for a fiction film. I've seen documentaries about the Neanderthal and was surprised how accurately \"Cave Bear\" showed that time. The flaws in human nature are shown in all their rawness in this movie. There is prejudice, oppression and abuse in full force. What makes it bearable for me is how the Darryl Hannah character is able to deal with this and eventually over come it. \"Cave Bear\" also shows some of the ritual of stone age culture with the Shaman and the hunting rites of passage. There is some beauty in that culture. But the bottom line for these people is survival and that was a very difficult thing to accomplish. They were scratching and clawing (literally) just to eat and raise children. And sadly we know that they are doomed (except for a few Neanderthals who possibly interbred with Cro-Magnons). This kind of documentary approach in \"Cave Bear\" will not thrill those who want a stone age comedy-romance, \"Caveman\", or a special effects absurdity of prehistoric people fighting lots of dinosaurs, \"One Million BC\", (which is historically impossible). But if you can appreciate an intense story of a young woman's survival in the wild and her experience with a lost stone age culture, then I recommend \"Clan of the Cave Bear\". 9/10",
         "The popularity of DVD has exploded the past couple of years like no new entertainment technology before. We are seeing more and more older films released on DVD for a pittance, like this one, \"Clan of the Cave Bear\", which I purchased for under $6US. There isn't much sound in this film, but the images, all shot in British Columbia, come through really well. The setting in time is prehistoric, during the brief overlap of the Neanderthal and Cro-Magnon humans. Ayla (Daryl Hannah), a very blonde Cro-Magnon, was orphaned as a small girl, wounded, and found by the dark-haired Cave Bear Clan of Neanderthals. Against the wishes of the leader, she is taken in and nursed back to health by the medicine woman. As she grows up we see that she is innately smarter than her adopted family, learns things quickly, begins to innovate. The Neanderthals are portrayed as if they had perhaps an IQ of 80, while Ayla certainly has an IQ of 120 to 140. This causes difficulties for her, because the women are totally subserviant, and one of them showing smarts or initiative is punished. A woman who even touches a hunting weapon is sentenced to die. But when Ayla does to defend a tribesman, she is only exiled in the winter and, if she survives, allowed to come back. She does, but finally realizes her \"spirit\" is different, and leaves to look for her own kind. After she fights and defeats the young \"alpha male\", who earlier had raped her thus giving her a child. Some critics scoff at the primative community portrayed here, but it in fact is very accurate. In the DVD commentary we learn that much of the design for this film came from watching a few crude videotapes that were actually made by the Cro-Magnons during that prehistoric period and were discovered, well-preserved, in far northern sub-freezing caves in the 1960s. Not surprisingly, they were in the Beta format. The whole film is about acceptance of someone different and of change. This is a common theme in many many films over the years, and is closely related to the popular \"Pleasantville\" of 1998. What makes this one different and enjoyable is the setting in time, the depiction of community values of these prehistoric peoples. I rate it highly overall.",
         "If you liked Quest for Fire, you should enjoy this fictional visit to the origin's of civilization. I always loved the film's poster and my wife loved the book(s) but we missed the movie when it was in the theaters, partly because it wasn't receiving good reviews. When we rented this, we expected a turkey (we love to study bad film) but were pleasantly surprised. Simply said, this made a good \"Sunday Morning\" film to wake up to with a hot cup of java. I was a little disappointed that the look Daryl Hanna sports in the film's poster never fully comes to fruition in the movie (it got close in one scene) but none the less it was fun.",
         "I am not going to say it sucked because it was nothing like the book. I am merely going to say that if you have read the book, don't bother because it will only tick you off. And What ticks me off is not that it didn't follow the book closely enough, it didn't follow the book AT ALL. There are scenes that should have happened well after they did, and scenes that happened that would have explained other scenes that were in the movie that aren't. To the above commenter who said that the subsequent books were all romance fodder, first Valley was not, it wasn't until the end that most of the pleasures were added, with small intermittent scenes throughout. Yes, there are a lot of Pleasures scenes in the books, Yes, they could have been done without, but that doesn't mean that the rest of the story is not worth reading. That is not what I am writing a review on, however. I was more upset that the movie didn't even maintain a SEMBLANCE to the book, other than the character's name, almost as if the director skimmed the book, and took pieces from sections without thinking about how they would go together.",
         "When I saw it was on the TV I got up at 2 in the morning to watch this film! I just couldn't wait until the morning! I thought it was really good but advice to anyone is READ THE BOOK! The story is absolutely captivating and involving from the start. Darryl Hannah is a good Ayla (if not a little old - she is supposed to be 12!) and the film does well with the language problem. The hand signals are good and there aren't too many sub-titles. I really like the music as well. I think this is a good attempt at summarising Jean Auel's work (which is really very difficult to film successfully) - But summary is the right word so you are really missing out until you read the novel - there is so much more to it- I think the film could be a little longer - it is a 800 page book! Even though it doesn't live up to the book it's still really good fun to see. I also think that a film of her later books would be a success - especially as the language isn't a problem then. My sister watched it before reading the book and she was hooked, so it's definitely a success whether you are familiar or otherwise with this compelling story. I think it's a real shame that it's deleted in the UK! It should be on TV more often so people have a chance to watch it. On the whole I would advise any fan who is prepared to be open-minded to watch it - you are in for a treat. If you are just going to nit-pick about the plot - Forget It!",
         "I have read Clan of the Cave Bear by Jean M. Auel several times and I have listened to it on book tape as well. The book is magnificent. It is not high English Literature, but it is face-paced, engaging, thorough, realistic and very well researched. I have also read the Valley of Horses and the rest of the Earth's Children Series. However, I put Shelters of Stone down because is pales in comparison to her earlier work in Clan of the Cave Bear and Valley of Horses. When I heard a movie had been made, I was both curious and concerned. Curious because I really enjoy the story and the \"prehistory\" genre - concerned because the vast majority of film adaptations from books are really disappointing. I really enjoy this film and I now include it in my DVD collection. The writers and directors did a very brave and wise thing by subtitling the language of the Clan, rather than making the \"big dumb cavemen\" speak some form of grunting English. They captured the dignity, culture and subtly of the Neanderthals as they were portrayed in Auel's novel, they didn't look like raging men in cheap gorilla suits as they did in Quest for Fire. What could not really be captured was the depth of herb lore and knowledge possessed by Clan, it would not have made for exciting film if a lengthy explanation of plants were included. I thought Hanna did an excellent job. The reason why they could not use a teen-aged girl was most likely the height factor. Ayla is supposed to tower over even the largest man of the clan, \"big and ugly.\" It would have been very difficult to find a teenager who could not only ACT convincingly in such trying conditions, but who would be tall enough in comparison to the Neanderthals. The rape scene is horrible, but is realistic and it was necessary to include it. It is a pivotal point in the novel, a moment in time when Ayla's spirit could have been shattered, she suffers as a result and is the stronger for it. I would not let children watch it though, for that scene. The hunting scene is very well done, it is real and tense and true to the book, so are the clan gathering and the sacrifice of the Cave Bear. I do not understand how a fan of the book could dislike the movie. ***Spoiler*** The only things I disapprove of are the end when Ayla leaves and the lack of explanation of \"Clan memories.\" In the book, Creb dies and Ayla is cast out of the Clan with her loved ones huddled together under the tyrannical leadership of Broud, which is what would have happened to a people who had become incapable of adapting. There was no satisfying reprimand from Brun, ripping the leadership away from his son, Broud. The ending is way too \"Hollywood\" and pink, and I do not know why they bothered to change it. The film is real and gritty throughout, why fluff it at the end? The vision of the shared memories that Ayla and Creb have at the Clan gathering is NOT the same as it is in the book. The vision in the book shows the journey through time from the primordial beginnings of life on Earth to the technological future and possible end. It is the main message of Earth's Children (In my opinion) and it is unfortunate that it was altered in this otherwise very meticulous film. I am very pleased that the film was made, and I am disappointed that it did not get better reviews at the time, it deserved much better. It is quiet and patient and authentic. Real animals are used, no over-the-top musical scores are employed, subtitles and gestures are very well done, casting and costumes are detailed and the camera shots are long and unhurried\u0085. It captures the raw nature of the time. Although I would be pleased to see Valley of Horses made into a film, to see Thonolan and Jondalar and the rest of the interesting characters and wrenching moments depicted, I hope that a sequel is NOT made\u0085 unless someone who is true to the books bothers to pick up the project. Most Hollywood movies are really awful nowadays and I would doubt that a studio and film-making team would be able to do it justice with the cast and the budget, and the patience they would need to do it right."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Producers Sales Organization (PSO)",
         "Guber-Peters Company, The"
      ],
      "summaries": [
         "At a time in prehistory when Neanderthals shared the Earth with early Homo sapiens, a band of cave-dwellers adopt blond and blue-eyed Ayla, a child of the \"Others\". As Ayla matures into a young woman of spirit and courage (unlike other women of the clan), she must fight for survival against the jealous bigotry of Broud, who will one day be clan leader. Based on Jean M. Auel's popular book, there is minimal narration; subtitles translate the Neanderthal gestures and primitive spoken language.",
         "Natural changes have the clans moving. Iza, medicine woman of the \"Clan of the Cave Bear\" finds little Ayla from the \"other\"'s clan - tradition would have the clan kill Ayla immediately, but Iza insists on keeping her. When the little one finds a most needed new cave, she may stay - for now. As it turns out later, she's a bright child, but has a hard time to keep her place in a clan with different customs. She has to hide her intelligence because she's a woman.",
         "A young Cro-Magnon woman is raised by Neanderthals."
      ],
      "budget": 15000000
   },
   "movielensId": 2147,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-01-17",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Michael Chapman"],
      "runtime": 98,
      "movieId": 2147,
      "title": "The Clan of the Cave Bear",
      "mpaa": "R",
      "actors": [
         "Daryl Hannah",
         "Pamela Reed",
         "James Remar",
         "Thomas G. Waites",
         "John Doolittle",
         "Curtis Armstrong",
         "Martin Doyle",
         "Nicole Eggert",
         "Salome Jens"
      ],
      "imdbMovieId": "0090848",
      "originalTitle": "The Clan of the Cave Bear",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "LALkkZEEUAQ",
         "sRx3ElAMfck"
      ],
      "plotSummary": "Natural changes have the clans moving. Iza, medicine woman of the \"Clan of the Cave Bear\" finds little Ayla from the \"others\"' clan - tradition would have the clan kill Ayla immediately, but Iza insists on keeping her. When the little one finds a most needed new cave, she's allowed to stay - and thrive.",
      "tmdbMovieId": 13853,
      "avgRating": 2.60173,
      "releaseYear": "1986",
      "numRatings": 1391,
      "posterPath": "/uqEQ2OUC84hVRQpsbgANlbcX0F8.jpg"
   }
}