{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civilization",
            "id": 2163
         },
         {
            "name": "safari",
            "id": 3513
         },
         {
            "name": "stowaway",
            "id": 3622
         },
         {
            "name": "slapstick",
            "id": 9253
         },
         {
            "name": "tribe",
            "id": 10148
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "kalahari",
            "id": 155296
         },
         {
            "name": "bushman",
            "id": 155297
         },
         {
            "name": "aeroplane",
            "id": 155298
         },
         {
            "name": "tribal",
            "id": 155300
         }
      ],
      "imdb_id": "tt0097443",
      "video": false,
      "title": "The Gods Must Be Crazy II",
      "recommendations": [
         8393,
         14742,
         27281,
         16379,
         8494,
         9452,
         8491,
         27042,
         24746,
         11285,
         2453,
         33657,
         27150,
         62761,
         21512,
         49478,
         19507,
         17236,
         11342,
         12151
      ],
      "backdrop_path": "/mV0e23bsZrEU53hizWRQRGUvv6q.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dr. Ann Taylor",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bf7f",
               "name": "Lena Farugia",
               "profile_path": "/xpkar8HDwWZ13JS6tUwgyyx1ZuZ.jpg",
               "id": 70965,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dr. Stephen Marshall",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bf83",
               "name": "Hans Strydom",
               "profile_path": "/fbekRhSaUvVfDHeSJiYW40bGKiE.jpg",
               "id": 70966,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Xiri",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bf87",
               "name": "Eiros",
               "profile_path": null,
               "id": 70967,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Xixo",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfbb",
               "name": "N!xau",
               "profile_path": "/r340m1PXJoz4YxprkA6fHRGwKEJ.jpg",
               "id": 55674,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Xisa",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfbf",
               "name": "Nadies",
               "profile_path": null,
               "id": 1156383,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Mateo",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfc3",
               "name": "Erick Bowen",
               "profile_path": null,
               "id": 1156384,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "George",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfc7",
               "name": "Pierre van Pletzen",
               "profile_path": "/AkpXJrkIr7Mg9ULdAtyb6niv9E9.jpg",
               "id": 1065660,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Jack",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfcb",
               "name": "Richard Loring",
               "profile_path": "/8EDhAKK1vAMLti29WerkUw0qV6V.jpg",
               "id": 1156385,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Ann's Secretary",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfcf",
               "name": "Lesley Fox",
               "profile_path": null,
               "id": 1156386,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Brenner",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfd3",
               "name": "Lourens Swanepoel",
               "profile_path": "/rlqnnj7jJwQZ8p2iFc3vGwkq7yr.jpg",
               "id": 1156387,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Timi",
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfd7",
               "name": "Treasure Tshabalala",
               "profile_path": null,
               "id": 955879,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a49251416c7503bf8d",
               "name": "Jamie Uys",
               "profile_path": "/aJOs1gdY5WQwaS8E6xf5LQAwsWh.jpg",
               "id": 55668,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a49251416c7503bf93",
               "name": "Jamie Uys",
               "profile_path": "/aJOs1gdY5WQwaS8E6xf5LQAwsWh.jpg",
               "id": 55668,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bf99",
               "name": "Boet Troskie",
               "profile_path": null,
               "id": 68680,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a49251416c7503bf9f",
               "name": "Charles Fox",
               "profile_path": null,
               "id": 50239,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfa5",
               "name": "Buster Reynolds",
               "profile_path": null,
               "id": 55678,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfab",
               "name": "Renée Engelbrecht",
               "profile_path": null,
               "id": 70968,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a49251416c7503bfb7",
               "name": "Collette Russow",
               "profile_path": null,
               "id": 70970,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55cfd4199251413198005e13",
               "name": "Ivan Hall",
               "profile_path": "/gVKIOWeA0aPUNNAt8C1zFrH4cOf.jpg",
               "id": 588157,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.223399,
      "production_countries": [
         {
            "iso_3166_1": "BW",
            "name": "Botswana"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "ZA",
            "name": "South Africa"
         }
      ],
      "id": 11937,
      "vote_count": 116,
      "budget": 0,
      "overview": "Xixo is back again. This time, his children accidentally stow away on a fast-moving poachers' truck, unable to get off, and Xixo sets out to rescue them. Along the way, he encounters a couple of soldiers trying to capture each other and a pilot and passenger of a small plane, who are each having a few problems of their own.",
      "similar": [
         8393,
         9389,
         51515,
         18513,
         227902,
         28807,
         479495
      ],
      "original_title": "The Gods Must Be Crazy II",
      "runtime": 98,
      "poster_path": "/zdKMqYiy7s5eyITRf9Q19WtyBxQ.jpg",
      "spoken_languages": [
         {
            "name": "Afrikaans",
            "iso_639_1": "af"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Elrina Investment",
            "id": 23267,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Weintraub Entertainment Group",
            "id": 6313,
            "origin_country": ""
         }
      ],
      "release_date": "1989-07-01",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/3u6As0EKP2KKPNhzQObCgdYvm7f.jpg",
         "name": "The Gods Must Be Crazy Collection",
         "id": 87805,
         "poster_path": "/3KAJpE2OOimXE5Z15LHARbeA0eC.jpg"
      },
      "tagline": "This Time, Everybody's Going Crazier.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Africa",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jamie Uys"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Jamie Uys"],
      "originalLanguage": "Afrikaans",
      "imdbLink": "http://www.imdb.com/title/tt0097443/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNjY1MjY1OF5BMl5BanBnXkFtZTcwOTExODUyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: N!xau, Lena Farugia, Hans Strydom | See full cast and crew »"],
      "reviews": [
         "This sequel is definitely not as insightful about the nature of man as the original, but there're still more than enough slapsticks, romance and family drama to make up for it. The two children are particularly adorable, their strength comes from their innocence, without the precocity that has become the hallmark of Hollywood. Their storyline is thus the most heart-warming of all. The two soldiers from opposing forces provide much of the slapstick of movie, and they are very good, with exceptionally funny facial expressions. And let¡¯s not count Lena Farugia and Hans Strydom out, who play a doctor of law from New York and a zoologist on assignment ¨C their opposite-attract romance is rather stereotypical but Lena in particular is such a charming delight that I forget how much Strydom looks like Tom Selleck, instead, wonder why Lena had not since made another movie - yes, really sad :( - she could¡¯ve been a big star. So in the end, one very funny little film, worth every penny and more to rent or buy. Keep some band-aids with you while watching, as you may get some stitches in your side.",
         "Series note: While it's not imperative to watch The Gods Must be Crazy (1980) first, it's recommendable. If you watch II before seeing \"I\", it might act as a slight spoiler to I for you. Set an unspecified amount of time after the first film, Part II has Xixo (N!xau) living back with his tribe of bushmen in the Kalahari. His children ask to go with him on a murula-collecting trip. He's reluctant to take his small son, because he says that if his small son is not as tall as his bow, it's too dangerous. His small son talks him into it anyway. But not too long into the trip, Xixo and another bushman find signs of an injured elephant. He sends his kids back home, but a large truck driven by poachers sidetracks them. Xixo's kids end up in the back of the truck, unable to jump off once it starts rolling. Meanwhile, Ann Taylor (Lena Faugia), a lawyer from New York, has traveled to Africa for a convention where she is supposed to deliver a lecture. Her group is staying at a safari lodge. While there, a ranger hits on her and talks her into going for a short safari flight in a two-seater airplane/glider. While away, they run into Stephen Marshall (Hans Strydom), who ends up hooking up with Ann instead. In another thread, there are a number of military vehicles riding along the edge of the Kalahari. We eventually meet two men on opposing sides of the intermittent skirmishes that have been occurring in the area. Like the first Gods Must be Crazy, Part II's plot sounds over-complicated on paper. But also like the first film, writer/director Jamie Uys shows himself to be a master of handling a number of concurrent threads that gradually merge. The film is never confusing or incoherent as it would be in less capable hands. The bad news, however, is that part of the reason for the above is that Uys used the first film as something of a template for this one. The threads--bushmen, military guys, and experienced ranger/Dr. guy with an attractive fish-out-of-water woman with whom there is a budding romance, are direct parallels to the first film, as are the way they develop and merge, as well as some specific comic scenarios. The bushman is searching for something that brings him into contact with the others. There is a wreck of sorts that leaves the fish-out-of-water woman and the ranger stranded in the bush. The woman gets her dress caught on something so that she shows some skin and it emphasizes the building romantic/erotic tensions, the military guys and poachers are bumblers who can't shoot straight, and so on. It's not that any of this material is bad (most of it is quite good, actually) or that I subtract points for formula. It's more that the film is bound to remind you of Part I's similar scenes, and Part I is a work of sublime genius. However, there is a major thematic/subtextual difference from Part I. The first film was a parable-like satire of culture/society/civilization that suggested that maybe we'd made some missteps and should reconsider where we'd ended up culturally. Although there are hints of the same ideas here, Part II's most prominent themes/subtexts are much less ambitious, and maybe less universal, but no less enjoyable. Uys sets Part II almost exclusively in the bush. There are neither the cities nor villages of Part I. Instead, Uys seems to present something of a microcosm of South African culture circa 1989 against a functionally \"abstract\" backdrop. Ann (and the other characters in her \"group\", whom we only see very briefly) represents both suave urbanites and the plethora of tourists who head to the area for eco-tourism. Xixo and his fellow bushmen represent the various native groups who have tried to go about business as usual as much as possible while having to adapt to the ways of non-indigenous (per more current anthropological history, at least) peoples who have come to occupy and often control the natives' land. Stephen represents the non-indigenous who have tried to also adapt themselves to their adopted country and its environment, to live in \"harmony\" with both the natives and the land. The two poachers represent all of the opportunists who have tried to exploit the area and its resources--not intending to do it harm, exactly, but not caring if they do, either, as long as it doesn't affect their profit/comfort margin. And the military guys represent regimentation, political control, and the constant armed conflicts in the area, whether official or not, engaged in by natives and the non-indigenous alike, who have all chosen a non-native lifestyle dictated by ideas of possession, laws/rules, control, force, and so on. While these are not the only groups in the region, they represent the primary conflicting interests that underlie much of the tension the area has experienced in the past (and continues to experience even now, if in a less formal and violent way). While Uys doesn't employ the unusual editing of Part I (with its extreme time/action manipulations during the course of scenes and single shots) to the same extent (there is a bit of it here, but it is very subtle), and he doesn't amp up the spoof nature of the film as much (the bushmen speech isn't so comically exaggerated via overdubs, for example), he present even more beautiful cinematography, with a lot of fantastic desert shots, plus more suspense utilizing native fauna. I think I prefer the score in this film, also. Part II is funny, but the tone isn't quite as \"madcap\", and there isn't quite as much slapstick (although there still is plenty to be had) as Part I. However, this is still a more than worthwhile sequel to a masterpiece.",
         "This sequel has the same innocence and joy of the first one, just not as much. It's nice, but gets a little self-conscious. Part of the joy and purity of the first one is that it hadn't looked in the mirror too much. This one - well, it's still good, it'll lighten your heart to watch it, but you'll check your watch once or twice. The first movie moved on the premise one Coke bottle in the garden of Eden could corrupt it. (They did a totally believable job of it, too, you ought to check out the first picture.) Civilization is a little heavier handed this time. This picture has some of that contrived feel that most sequels have. But it's still a pleasure. How often do you see real joy in a picture, family love, innocence - and lots of laughs? A slapstick cops and robbers type of plot. The kids loved it.",
         "There is a lot of story in this movie, but the thread that follows the two little black kids who get separated from their father is hilarious. Imagine this--a 3 year old and a 4 year old, speaking Xhosa(?) through the whole movie to each other--and yet YOU the viewer know every word they say! No voice-over! No sub-titles, just exceedingly clever script-writing combined with brilliant direction of these two kids. I wish I could afford to buy the two Gods... movies, but until then I keep an eye on TV listings and never miss an opportunity to watch them again and again.",
         "Though not as funny as the original- the refreshing beauty of the children and the determination of the father to find them make this an enjoyable movie. Plus it was nice to see all the wildlife- including the badger from hell. This time there was more chemistry between the leads- believably romantic-- and the nature- how to survive in a waterless place was accurate.",
         "Too many story lines to make this as good as the first one, but it's still a delight. The kids are charming, and the female lead is a wonderful physical comedienne. A pity Jamie Uys didn't make more movies.",
         "The Gods Must Be Crazy II (1989) C-97 min. D: Jamie Uys. N!xau, Lena Farugia, Hans Strydom, Eiros, Nadies, Erick Bowen. Sequel to the hit box-office smash is just as funny, concerning the bushman's quest to find his children, who have been `kidnapped' by a pair of poachers. Meanwhile, two inept soldiers are out to make each other suffer through slapstick catastrophes and a duo of scientists find themselves lost in the desert. Farugia is hilarious as the anti-nature scientist, while Bowen is funny as well (as a Cuban soldier who loses his sense of direction every few minutes). RATING: 8 out of 10. Rated PG for partial nudity, slapstick violence, and strong language.",
         "While the original film would have been very difficult to top, The Gods Must Be Crazy II is certainly a strong movie. The innocence and silliness that was captured so amazingly in the first film was faithfully reconstructed in this film. Xixo was much more commanding in this film, and the two kids who played his children were also quite good. Unfortunately, the film makers had to beat the idea into the ground, and made an terrible third sequel. Alas, sometimes a great idea shouldn't always be built upon.",
         "Sequels rarely come close to the original, and this is no exception. With the exception of N!xau, most of the cast has changed. It's an attempt to recapture the magic of the first movie, but it falls short. Yet, I still love it, and feel it's still a good movie, since there is a weaving of multiple stories. It's a nice film for fans of the original.",
         "While \"Gods...II\" is not quite as hilarious as the first, it is still well worth seeing, especially for the performance of the lovely Lena Farugia. Two questions will come to mind. \"Why haven't we seen her before?\" and \"Why haven't we seen her since?\" Lena Farugia is an American born, New York trained actress living and working in South Africa, with experience as a writer and producer in television. I don't know if she did her own stunts in the movie, but if not, that was one beautiful stunt double!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Elrina Investment",
         "Weintraub Entertainment Group"
      ],
      "summaries": ["Xixo is back again. This time, his children accidentally stow away on a fast-moving poachers' truck, unable to get off, and Xixo sets out to rescue them. Along the way, he encounters a couple of soldiers trying to capture each other and a pilot and passenger of a small plane, who are each having a few problems of their own."],
      "budget": 0
   },
   "movielensId": 2151,
   "movielens": {
      "languages": [
         "Afrikaans",
         "English"
      ],
      "releaseDate": "1989-07-01",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Jamie Uys"],
      "runtime": 98,
      "movieId": 2151,
      "title": "The Gods Must Be Crazy II",
      "mpaa": null,
      "actors": [
         "Lena Farugia",
         "Hans Strydom",
         "Eiros",
         "N!xau",
         "Nadies",
         "Erick Bowen",
         "Pierre van Pletzen",
         "Richard Loring",
         "Lesley Fox",
         "Lourens Swanepoel",
         "Treasure Tshabalala"
      ],
      "imdbMovieId": "0097443",
      "originalTitle": "The Gods Must Be Crazy II",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["XMlTZHg9Z6o"],
      "plotSummary": "Xixo is back again. This time, his children accidentally stow away on a fast-moving poachers' truck, unable to get off, and Xixo sets out to rescue them. Along the way, he encounters a couple of soldiers trying to capture each other and a pilot and passenger of a small plane, who are each having a few problems of their own.",
      "tmdbMovieId": 11937,
      "avgRating": 3.19678,
      "releaseYear": "1989",
      "numRatings": 1832,
      "posterPath": "/zdKMqYiy7s5eyITRf9Q19WtyBxQ.jpg"
   }
}