{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "taxi",
            "id": 444
         },
         {
            "name": "smoking",
            "id": 919
         },
         {
            "name": "office",
            "id": 1438
         },
         {
            "name": "rain",
            "id": 2217
         },
         {
            "name": "gin",
            "id": 2518
         },
         {
            "name": "diary",
            "id": 2913
         },
         {
            "name": "champagne",
            "id": 5165
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "snow",
            "id": 10794
         },
         {
            "name": "lawyer",
            "id": 10909
         }
      ],
      "imdb_id": "tt0033922",
      "video": false,
      "title": "Mr. & Mrs. Smith",
      "recommendations": [
         4175,
         31995,
         31997,
         2762,
         31667,
         30159,
         2761,
         25670,
         1978,
         36049,
         5854,
         15007,
         543,
         52748,
         22527,
         40154,
         161522,
         5780,
         11219,
         8208
      ],
      "backdrop_path": "/qsJSHNoyasOY3P0xsKFKyAfPOjD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ann",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e028811",
               "name": "Carole Lombard",
               "profile_path": "/uUjn5WRFxetiG8JLxbzSb1zAnbe.jpg",
               "id": 2491,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028815",
               "name": "Robert Montgomery",
               "profile_path": "/f4VuWDEgs4X5FKCWaGezqJGTqzE.jpg",
               "id": 19406,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028823",
               "name": "Gene Raymond",
               "profile_path": "/7SPUqMrrbCbp71ICO2z71tCArYc.jpg",
               "id": 117419,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Chuck",
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028819",
               "name": "Jack Carson",
               "profile_path": "/zwo2rrylE7DAo4BQag82EN72QDz.jpg",
               "id": 2672,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Custler",
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028827",
               "name": "Philip Merivale",
               "profile_path": "/d5yMCa4qCUIZdTB82ME1Q7Vewph.jpg",
               "id": 105007,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mrs. Custler",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e02882b",
               "name": "Lucile Watson",
               "profile_path": "/lph8cxn8qWFyt39tG68mfO2AyY8.jpg",
               "id": 83260,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Sammy",
               "gender": 0,
               "credit_id": "52fe448ac3a368484e02882f",
               "name": "William Tracy",
               "profile_path": "/4n4JeFFDsGABybBLZ0gs2DQN1Dy.jpg",
               "id": 83236,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr. Deever",
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028833",
               "name": "Charles Halton",
               "profile_path": "/fQqMqIJRMSqQCM6HET2O34hD2Ar.jpg",
               "id": 2502,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mrs. Krausheimer",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e028837",
               "name": "Esther Dale",
               "profile_path": "/dnnaoECyLuK5havb4YHKunJu7ZT.jpg",
               "id": 34268,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Martha",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e02883b",
               "name": "Emma Dunn",
               "profile_path": "/zowy8TC1ftHwzQsuChsQXPJQa4z.jpg",
               "id": 14033,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Gertie",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e02883f",
               "name": "Betty Compson",
               "profile_path": "/2jWAs7CwIlFOpImFWfRckkUWyiz.jpg",
               "id": 13556,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Gloria",
               "gender": 0,
               "credit_id": "52fe448ac3a368484e028843",
               "name": "Patricia Farr",
               "profile_path": "/p6DPAeP9S9RA7h7iJQptnWGEIrp.jpg",
               "id": 140181,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Proprietor Lucy's",
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028859",
               "name": "William Edmunds",
               "profile_path": null,
               "id": 95967,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Lily",
               "gender": 1,
               "credit_id": "52fe448ac3a368484e02885d",
               "name": "Pamela Blake",
               "profile_path": "/5qR0UOILIv99rlhO8nDHVBj0Qqz.jpg",
               "id": 140180,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e02881f",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028849",
               "name": "Norman Krasna",
               "profile_path": null,
               "id": 89535,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e02884f",
               "name": "Harry E. Edington",
               "profile_path": null,
               "id": 69514,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448ac3a368484e028863",
               "name": "Norman Krasna",
               "profile_path": null,
               "id": 89535,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "553d3f68c3a368066d001b16",
               "name": "Harry Stradling Sr.",
               "profile_path": null,
               "id": 10537,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "573e5cd492514127cc0000aa",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5ab84add92514148e3002c18",
               "name": "Irene",
               "profile_path": "/uqKuNQzRIV4OJQztp2AHuhitWuc.jpg",
               "id": 1012329,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.592554,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24197,
      "vote_count": 47,
      "budget": 0,
      "overview": "Ann (Carole Lombard) and David Smith (Robert Montgomery) are a happily married couple living in New York. One morning, Ann asks David if he had to do it over again, would he marry her? To her shock, he answers he wouldn't. Later that day, they both separately find out that, due to a complication when they married three years ago, they are in fact not legally married. Ann does not mention this to David, and thinks he will remarry her that very night after he takes her out to a romantic dinner. When this does not happen, she angrily kicks David out of their home.",
      "similar": [
         193893,
         25376,
         429733,
         275,
         75780,
         4638,
         96,
         634,
         90,
         2048,
         4771,
         1586,
         1949,
         2252,
         2832,
         281,
         1538,
         1572,
         77949,
         71672
      ],
      "original_title": "Mr. & Mrs. Smith",
      "runtime": 95,
      "poster_path": "/lY3Jd8O8Oz6aMpasPFBzHASzLQd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1941-01-30",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Lombard and Montgomery Get Hitched As They're Getting Unhitched !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 95,
      "synopsis": "DAVID and ANN SMITH have a volatile marriage, to say the least. They also have several \"rules\" concerning their marriage. One is that they will not leave their room until they've patched up after a quarrel. The latest goes on for three days. David, a lawyer, hangs up his whole STAFF while the bickering couple patch it up. Once they've made up, they're back at the usual loving bickering. They also have a rule that once a day they can ask the other a question in which they must answer honestly. Mrs. Smith asks her beloved: \"If they could do it all over again, would he marry her?\" Mr. Smith, believing honesty is the best policy, tells her \"No,\" which is decidedly the wrong answer. That afternoon, MR. DEEVER comes to see David. An officious man, Deever informs David that because of a legal technicality, he and his wife aren't legally married. They'll have to marry again. David's somewhat amused by the whole idea, not realizing that Mr. Deever also goes to see Ann, telling her the same thing. David takes Ann out for a romantic evening, going to the restaurant they used to attend, which has now become somewhat of a hovel. Further, the dress that Ann wore when they were courting doesn't quite fit. When David takes Ann up to the apartment and appears intent upon still sleeping with her, Ann is outraged when she realizes he, too, knows they aren't legally married and intends taking \"advantage.\" Furious, Ann tosses him out of their apartment. David seeks solace at a local club, where carousing member CHUCK BENSON gives him advice. Now David finds himself in a peculiar position. Having stated that morning to Ann that he might not marry her again if he had it to do over, he now has the chance \"not\" to be married but now realizes he does want to be married to her, after all. Thus, David pursues her all over town. Unfortunately, Ann will have none of it. When he threatens to cut her off financially, Ann allows that she's taken a job at a department store. David tries to drag her away physically from her new position. Ann loses the job anyway, when her BOSS realizes she's married, which is against store policy. Meanwhile, David abandons his work, getting behind in his cases. His partner, JEFF, asks to make a dinner date with Ann, hoping to straighten everything out, but, to David's chagrin, Ann shows interest in Jeff and begins dating him. David retaliates by going out with some FLOOZIES arranged by club member chuck Benson, everyone ending up at the same club. David tries to extract himself from the embarrassing situation by giving himself a bloody nose - not an easy task, requiring that he bop himself in the face a few times. Ann leaves with Jeff, angry that David's \"date\" is acting like Florence Nightingale. Ann and Jeff attend an amusement park, getting stuck in a ride in the rain. Jeff starts getting a cold. They go back to Ann's apartment, where Jeff proves ever the gentleman, reluctant to make any moves on Ann. When he has a few drinks, he only gets goofy and she leaves. The following day, David continues following Ann, this time by cab, pretending to the CABBIE that he's a private detective. He follows her into his law office, finding her in partner Jeff's office, along with Jeff's PARENTS. David finds out that Jeff's Parents consider their son engaged to Ann, so David, determined to break this up, starts making it sound as though Ann's a problem. Horrified, Jeff's Parents start believing she's on the \"trashy\" side. Ann and Jeff travel to Lake Placid to meet Jeff's Parents. When they arrive, they find they've been relegated to remote adjoining cabins. David shows up, frozen in the snow, collapsing in front of them. They rush him to a warm bed, where he prattles on, apparently only half conscious. Ann feels sorry for him. When Jeff sees how connected they still are, he politely agrees to withdraw his offer of marriage. Ann is torn, but when she realizes that David is just faking being sick, she's furious with him, confronting him. The two have one of their royal fights. But later, after dinner, Ann worries about David, telling Jeff she intends to make him dislike her once and for all. While David's in an adjoining cabin, Ann pretends that she and Jeff are more intimate than they really are. David rushes in, realizes that she's only pretending. Furious, Ann wants David to stand up to David, but he doesn't. Jeff's Parents show up as all parties are entangled in this most sticky romantic mess. But the bickering David and Ann end up together, after Ann, hoping to escape him on skis, becomes trapped in a room with him when he knocks her back into a chair, skis akimbo. As with their rule, they won't leave the room until they've made up. After a few angry words, Ann begins to calm down and soon they begin to kiss",
      "writers": ["Norman Krasna"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0033922/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU4OTI0NTIwNV5BMl5BanBnXkFtZTgwMzA3ODgwMzE@._V1._CR2,44,340,455_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Carole Lombard, Robert Montgomery, Gene Raymond | See full cast and crew »"],
      "reviews": [
         "As a long-time Hitchcock fan, I avoided this as I would some of his silent dramas, as not typical of his work. However, I just watched one of the funniest, smartest, and sweetest screwball comedies I have ever seen, ranking for me with My Man Godfrey and Miracle of Morgan's Creek. Carole Lombard is absolutely radiant and I found myself laughing out loud many times, something I don't do usually when watching a movie alone. I adored it and I can't see why its rating isn't higher here. Hitchcock excelled as much at comedy as suspense and this one proves it.",
         "According to the Films of Alfred Hitchcock, Carole Lombard prevailed upon Alfred Hitchcock to direct one her comedy films as a favor. Since Hitchcock admired her talent he did so. It's important to remember that this is a Carole Lombard film and view it that way. Viewed as such it's not a bad marital comedy though if one is expecting certain Hitchcock touches they won't be there. Robert Montgomery and Carole Lombard are a constantly spatting married couple. They love each other, but to them arguing is like exercise. In a moment of oneupsmanship Montgomery answers in the affirmative to a question by Lombard as to whether he'd marry her if he had to do it all over again. His words come back to haunt him when Charles Halton from Lombard's hometown in Idaho and says that because of a technicality they're not legally married. Montgomery spends the rest of the film trying to win Lombard back. Some of the best movie comedies have been made on a premise flimsier than this one. Mr.&Mrs. Smith is not the best of comedies, but it is far from the worst. I have a feeling that Alfred Hitchcock may have had Lombard in mind for future projects more of his own taste. I can see her easily in some of his later films. Lombard was only 32 when she died. Pity we'll never know.",
         "It's unfair to look over this film because it is not a true Hitchcock film. It's still a great film, and a great screwball comedy. It is very funny and contains at least two of the funniest scenes I've ever seen, the one where Robert Montgomery plans to have premarital sex with Lombard, thinking she doesn't know that they aren't married, and the restaurant scene, where Montgomery pretends to talk to a really pretty girl who's sitting next to him. You can just barely see Hitchcock in this film - there are a few marvelous camera movements and angles that seem like Hitchcock was sighing, saying, \"God, I'm bored!\" The two leads, Carole Lombard and Robert Montgomery, are wonderful. Everyone else, Gene Raymond as Jeff and Jack Carson as Chuck (he's especially hilarious; I wish he had had even more scenes!), and everyone else, too, is constantly hitting bullseyes. Unfortunately, in the last 20 or 30 minutes of the film, it begins to fall apart, after the plot moves to Lake Placid. First off, it's begins to grow tiresome. Lombard is starting to come off as unnecessarily cruel. The faux drunken mumblings of Montgomery aren't as funny as they're supposed to be. Jeff's parents are getting in the way. At least the final scene makes up for some of that! 8/10.",
         "This film has nothing to do with the current film of the same title. Thank goodness for that! \"Mr. and Mrs. Smith\" is a rarity in that it was directed by that master of suspense, Alfred Hitchcock. The film pays in ways that only a crafty Hitchcock would know how. The director takes Norman Krasna's screen play and gives it an elegant treatment. The idea of a technicality annulling a marriage is at the center of the story. When David Smith is told about it, he sees the possibility of not telling his wife. Ann and David have a strange marriage life. They love each other dearly and they seem to work at maintaining their union as a fun enterprise where they are playful and do unexpected things to please one another. David miscalculates Ann's reaction to his playing a joke and not telling her about their new status. The revelation at the beginning of the film is made known to Ann, who goes along with the joke expecting to be asked that same day to run to a justice of the peace to get married again. When David doesn't act on what for Ann seems to be essential, she flies into a rage and vows to get even with David. This is the basic premise of the comedy. Things get complicated, but we know all will be right at the end as Ann will come to her senses. David also is expected to legalize their status. The film is a joy to watch because of the two stars. Carole Lombard and Robert Montgomery were two charismatic performers that had an uncanny sense of timing. They make a delicious couple that deserve to be happy, even at the expense of making each other crazy in the process. Just to see a playful Carole Lombard giving a razor shave to Robert Montgomery is well worth the prize of admission! The rest of the cast is outstanding. Gene Raymond plays David's partner, Jefferson Custer, an upright man who admires Ann from a distance. Their scene when they get stuck in the rain at Coney Island's parachute, has to be one of the highlights of the movie. That whole sequence after they return to Jeff's apartment and he gets the \"liquor\" medicine from Ann is hilarious. There is a cameo from the director that passes by too quickly and if the viewer is not paying attention, it will be missed. Jack Carson is excellent as the bad influence for David. Philip Mervale and Lucile Watson are seen as Jeff's parents. This film proves Alfred Hitchcock could have tried his hand at more comedies because he seems to be a natural to the genre. Of course, any director was going to excel with Carol Lombard and Robert Montgomery playing the lead roles of any movie!",
         "This is a good example of a movie that could be quite disappointing for anyone who had too many or too specific expectations for it. It's an Alfred Hitchcock movie, but it's not at all like any of his better-known films. The offbeat premise leads you to expect a 1930s-style screwball comedy, but instead it has a different brand of humor altogether. The tone of the film blends together the screwball plot idea with Hitchcock's dry sense of humor and the upbeat charm of Carole Lombard. It's something of an odd combination, but it works all right as long as you don't have too many preconceptions. Lombard and Robert Montgomery work well as \"Mr. & Mrs. Smith\", who find out at the beginning of the movie that they are not really married. Most of the story that follows moves at a decent pace, and although there are never any big laughs, there is some good material. It never really hits high gear, but once you get used to the pace, most of it works well enough. It does slow down quite a bit towards the end, as things run out of steam, and this keeps the movie from being better. A grand climax in the screwball tradition might have made it a very good movie. Instead, as it is, \"Mr. & Mrs. Smith\" is a pleasant, generally amusing, slightly above-average romantic comedy.",
         "Mr. Surif was wrong when he calls this Hitch's only venture into comedy, for \"The Trouble With Harry\" falls into that category as well. Not having seen all of Hitch's films, there could be others, for all I know. Unlike \"Harry\", in which the peripatetic corpse gives the otherwise bucolic goings-on a zanily ghoulish air, \"Mr. & Mrs. Smith\" is an exercise in pure romantic comedy. Montgomery and Lombard work beautifully against each other, and the script is elegantly and effervescently witty. The opening scene, in which Hitchcock suggests the aftermath of a protracted and clearly energetic sexual romp, is surprisingly risque for its time, and far more erotically suggestive than some of the blatant stuff we see nowadays. My only quibble is what I feel to be a rather unsatisfactory and hasty conclusion.",
         "When I put this movie on I was drowsy, and depressed. It did two things for me after I put it on. It kept me awake, thus entertaining me, and it put a smile on my face. There are some genuine laughs in this movie, and the comedy is spread between all the characters. Robert Montgomery is extremely funny, with both excellent physical comedy, and great comedic timing with his dialogue. What surprised me most was the excellent comedic timing of Carole Lombard. She is extremely funny, but her chemistry with Montgomery in their scenes together is fantastic. The direction, of course, is excellent. Not standard Hitchcock suspense, but classic Hitchcock comedy and romance, elements of his film making that a lot of people overlook. Honestly, this is a fun movie. The humor is intelligent and never sinks to an infantile level. I had never heard of this movie until about two days ago, and I watched it and I was pleasantly surprised. 8 out of 10.",
         "Because it is somewhat unique in Hitchcock's works, there has been a continuous attempt in recent years to upgrade public opinion about MR. AND MRS. SMITH. Hitchcock explained to Francois Truffault in HITCHCOCK/TRUFFAULT that he always wanted to work with Carole Lombard, and she prevailed on him to do this film with her. But that does not really explain the choice of material. Lombard, of course, is best recalled for her wonderful daffiness in screwball comedies like NOTHING SACRED, TRUE CONFESSIONS, and MY MAN GODFREY. Her co-star, Robert Montgomery, had been in many delightful comedies (PETTICOAT FEVER, PICADILLY JIM) too. But both performers had been in dramatic films. In this period Montgomery (fresh from his great performance as Danny in NIGHT MUST FALL) had made RAGE IN HEAVEN with Ingrid Bergman and George Sanders, and Lombard did VIGIL IN THE NIGHT with Brian Ahearn. They were both highly capable of dramatic performances. So why couldn't they have sought a more typical Hitchcock screenplay? My suspicion is that Hitchcock chose to make a \"screwball comedy\" as an experiment. He did that frequently when he felt like stretching his abilities, and sometimes the results were not too good. When it was a technical experiment like ROPE or DIAL \"M\" FOR MURDER he still had the strength of the film script to fall back on if his nine minute shots or his use of three dimensional film did not quite work wonders with the audience. But when he tried humor, he had less success. Hitch's sense of humor is not bad - but it works best when he uses it sparingly. In THE MAN WHO KNEW TOO MUCH (1956), Hitch sets up a delayed joke involving Hillary Brooke and another actor coming to visit their friends Jimmy Stewart and Doris Day in London. Stewart and Day leave their flat because they are going to try to rescue their son (in the hands of the kidnappers). They apologize and tell Brooke and her husband they'll be back presently with their son. Brooke and her husband look confused as they leave. The remainder of the film, and the melodrama in the embassy is played out. Final scene shows Brooke and her husband have fallen asleep waiting for them. Day, Stewart and their son come in, wake up Brooke and her husband, and proceed to act as though nothing has happened for three or four hours. That is an example of when the Hitchcock humor works. But then comes his full scale \"black comedy\" THE TROUBLE WITH HARRY, and the viewer has mixed feelings. Individual moments work, like the manipulation of the dull sheriff Royal Dano. But one finds most of the humor about moving a dead body fairly unimaginative...surprisingly so from Hitch. MR. AND MRS. SMITH is not a black comedy, but it's type of bedroom farce situation would have been better handled by Ernst Lubitsch or Leo McCarey or Preston Sturgis. The joke is that the surface-warring Smiths are really in love, but discover that their marriage was illegal. Montgomery had said he'd marry Lombard again if he had to (prior to the discovery of the illegal marriage), but instead of rushing Lombard off to any nearby church or justice of the peace he hesitates. And Lombard wonders what kind of man she has been illegally married to. So she turns to his partner Gene Raymond, who is interested in her. There are some interesting moments in the film (Hitchcock has to be of interest always). The scene where Montgomery pretends to be talking to the pretty woman sitting next to him (incurring the ire of her date) is good, culminating in Jack Carson trying to stop a bleeding nose on Montgomery by using a \"cold\" knife as a cauterizing instrument. There is also a funny moment when Lombard and Raymond, on a trip to an amusement park, get stuck on a ferris wheel on top of it during a heavy thunder storm. But these moments are far and few. As a romantic comedy it is mediocre, despite it's stars and (unfortunately) because of it's director. Hitchcock must have realized it too - until THE TROUBLE WITH HARRY he never attempted a straight comedy again, and (as mentioned before) THE TROUBLE WITH HARRY was not a romantic comedy but a \"black comedy\".",
         "There seems to be little consensus on this movie; most people love it or hate it. I can see why. The movie has its golden gleaming moments, and then it has its moments that fall flat with a hollow thud. Unfortunately, the ending of the movie is the hollowest thud of all, and smacks almost of soap opera. Also, Lombard hardly seems herself in this movie; she plays the foil to Montgomery's gleefully devilish protagonist, and only occasionally does she steal a scene. Hitchcock (or perhaps the screenplay) seems almost determined to keep her locked down. A pity. Still, Montgomery's leering eyes and wicked yet boyish half-smile are by themselves reason enough to watch this movie. The whole issue of forbidden, illicit sex is handled beautifully, because, after all, the two are man and wife in everything but legal technicality. It seems odd that Lombard's character reacts with such savage anger about the whole thing. Considering the way she plays fast and loose with the affections of her husband's partner, even though she can't deny that she has been a common law wife of three years standing, one wouldn't expect such a prudish attitude from her. More likely, she would have joined her erstwhile husband in enjoying the hint of illicit passion. But it's best, in movies like this, not to examine the logic behind the story too closely. Although Montgomery is the heart of the movie, nevertheless, perhaps the best scene in the movie is when the strait-laced genteel Gene Raymond proceeds from tipsy directly to dead-drunk and delivers possibly the funniest (because the most realistic) rendering of inebriation ever filmed. There's a point where he plants a foot on a step in front of him, a very low step, and one would think that in so doing he had just climbed Mount Everest. Priceless. Others have noted, and I agree, that outside of Lombard, Montgomery and Raymond, the other characters are mere cardboard props and simply not funny. One can see that Hitchcock himself recognized this. When Raymond is closeted with his concerned parents in the bathroom at his office, the director is reduced to using gurgling plumbing sounds to punctuate the dialog--and for no apparent reason other than for some kind of comedic effect, because the dialog so clearly lacks any. When plumbing steals the show, you know you're in trouble. One might see, in the trip to the rustic resort, an echo of Shakespeare's comedies, in which the scene always changed from the banal to the fantastical to underscore or even effect the transformation of the characters. But that doesn't happen here. Everyone continues to act the way they did before. That's not surprising, for in Shakespeare, the change in scene always happened at the beginning, not the end. You can't teach an old dog new tricks, and the personalities of the characters are engraved in marble by this point. These scenes mark the final transition of a movie that was already verging on stage-bound into more or less just another play on celluloid. That isn't necessarily a bad thing, but it does little to revive the movie's already fainting comedic momentum. It attempts the usual farce, door-slamming, rushing to-and-fro, characters affecting dramatic poses, but it doesn't really work, and that devilish grin of Montgomery's seems long, long in the past. He becomes a cipher for the last part of the movie, Raymond's character was a cipher to begin with, and that leaves only Lombard, whose character was hemmed into a cage of shrewishness by the script (or the director) from the very beginning. The ending, therefore, is arbitrary and unsatisfying, and worst of all, not the least bit funny. The movie turns too late to pratfall comedy, and the image of Lombard tangled in skis simply doesn't work. She's been far too efficient and capable until now to be believable as the hapless, helpless, love-lorn buffoon. Nevertheless, the movie was well worth watching. I'll never forget those gleaming eyes and that almost forward-leaning stride of Montgomery, as if he just couldn't wait to barrel into the next scene. One is almost tempted to forgive him his chumminess with the House Un-American Activities Committee. Almost.",
         "Hitch claimed he only directed the script as written as he had no feel for the material. It's an OK comedy but did anyone else notice how annoying Carole Lombard's character is? Even the people around her are a bit offbeat. She is so annoying shrill and dreary one wonders why Robert Montgomery is working so hard to get her back. Alright for your Hitch collection but not really a fantastic film. It's a look back into the social mores of yesterday as Montgomery exposes Carole as a married woman so the store she's employed at fires her as it's the store's policy not to employ married women. One wishes the characters could have been played a little more warmly instead of the tart,sharp way they were directed by Hitchcock. Since he wasn't crazy about the project,he might have injected a bit more cynicism than he thought."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "New York sophisticates David Smith and Ann Smith née Krausheimer have been lovingly and passionately married for three years, or so they believed. They are told individually that due to a technicality - an unresolved municipal and state jurisdictional issue at the time of their supposed marriage - their wedding was not legal, and as such they are not really married. Despite David saying earlier in the day that if he had to do his life all over again that he would not have married her (even though he loves her), it is Ann that decides not to marry David this second time around due to an action, or in reality inaction, by David in reaction to the news of their marriage being invalid. While Ann goes about her life as a supposedly single woman (which includes calling herself Ann Krausheimer), David does whatever he can to win Ann back. But winning Ann's hand may be difficult as part of Ann's new life is dating other men. One of those other men and the most serious is David's best friend and business partner, Jefferson Custer. Ann and Jeff's relationship quickly gets to the point where Jeff introduces her to his visiting parents, with whom Ann and Jeff are going on a skiing vacation to Lake Placid. David hopes to exploit that vacation in order to win Ann back.",
         "Sophisticated New York couple David and Annie Smith have an unusual marriage with an inordinate number of rules and regulations. One rule entitles them to ask each other one question per month which the other must answer completely honestly. Annie asks David if he would marry her again if he could have the time over again and David confides that he misses his freedom and so probably wouldn't. Later that day, an official from the town where they got married calls to see David. He explains that owing to a state boundary dispute, all couples married between 1936 and 1939 in the county were not legally married. David decides to have fun with this fact, but unbeknown to him, the county official calls to see Annie too and disaster results.",
         "Not a typical Hitchcock movie, this is a comedy about a couple who learn that their marriage was not valid."
      ],
      "budget": 0
   },
   "movielensId": 2205,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1941-01-30",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Alfred Hitchcock"],
      "runtime": 95,
      "movieId": 2205,
      "title": "Mr. & Mrs. Smith",
      "mpaa": "",
      "actors": [
         "Carole Lombard",
         "Robert Montgomery",
         "Gene Raymond",
         "Jack Carson",
         "Philip Merivale",
         "Lucile Watson",
         "William Tracy",
         "Charles Halton",
         "Esther Dale",
         "Emma Dunn",
         "Betty Compson",
         "Patricia Farr",
         "William Edmunds",
         "Pamela Blake"
      ],
      "imdbMovieId": "0033922",
      "originalTitle": "Mr. & Mrs. Smith",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["HGfQ87J6xQk"],
      "plotSummary": "Ann (Carole Lombard) and David Smith (Robert Montgomery) are a happily married couple living in New York. One morning, Ann asks David if he had to do it over again, would he marry her? To her shock, he answers he wouldn't. Later that day, they both separately find out that, due to a complication when they married three years ago, they are in fact not legally married. Ann does not mention this to David, and thinks he will remarry her that very night after he takes her out to a romantic dinner. When this does not happen, she angrily kicks David out of their home.",
      "tmdbMovieId": 24197,
      "avgRating": 3.34003,
      "releaseYear": "1941",
      "numRatings": 747,
      "posterPath": "/lY3Jd8O8Oz6aMpasPFBzHASzLQd.jpg"
   }
}