{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0096166",
      "video": false,
      "title": "Stars & Bars",
      "recommendations": [],
      "backdrop_path": "/djQgiVYAVPB847vN90pJkIo8WC7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Henderson Dores",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd11",
               "name": "Daniel Day-Lewis",
               "profile_path": "/hknfCSSU6AMeKV9yn9NTtTzIEGc.jpg",
               "id": 11856,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Loomis Gage",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd15",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Irene Stein",
               "gender": 1,
               "credit_id": "52fe4b42c3a368484e17fd19",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Ben Sereno",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd29",
               "name": "Kent Broadhurst",
               "profile_path": "/5FRRBEO40f1DBJeebGBaTRj8pnT.jpg",
               "id": 20914,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Freeborn Gage",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd2d",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Beckman Gage",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd31",
               "name": "Matthew Cowles",
               "profile_path": "/g1YnlLnDoR8Hy4XV51ZqgOXnQEE.jpg",
               "id": 94434,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Eugene Teagarden",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd35",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Reverend T.J. Cardew",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd39",
               "name": "Spalding Gray",
               "profile_path": "/xXUGK1bQRi6vBT8Xu0NsShIEKRe.jpg",
               "id": 8978,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Cora Gage",
               "gender": 1,
               "credit_id": "52fe4b42c3a368484e17fd3d",
               "name": "Glenne Headly",
               "profile_path": "/a90ZslKOvecuy7doMWXsFc1Aoc4.jpg",
               "id": 21104,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Melissa",
               "gender": 1,
               "credit_id": "52fe4b42c3a368484e17fd41",
               "name": "Laurie Metcalf",
               "profile_path": "/oHhTbuv9eNJV4YlgizhCkZsPV0N.jpg",
               "id": 12133,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Duane Gage",
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd45",
               "name": "Will Patton",
               "profile_path": "/qpycaaWP1oUx1Wd2lMBfQtR7qDO.jpg",
               "id": 883,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Bryant",
               "gender": 1,
               "credit_id": "52fe4b42c3a368484e17fd49",
               "name": "Martha Plimpton",
               "profile_path": "/7lU1kci6OZMwZk5Kxfnz0u8B5l5.jpg",
               "id": 17495,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "54fdbcb99251412204004e3e",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd1f",
               "name": "Pat O'Connor",
               "profile_path": null,
               "id": 19969,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b42c3a368484e17fd25",
               "name": "William Boyd",
               "profile_path": null,
               "id": 63120,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59bf6c67c3a368307500f069",
               "name": "Stuart Craig",
               "profile_path": "/iI9F5WDkTrkxMHlAdq9XVXkfP3i.jpg",
               "id": 5491,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.694261,
      "production_countries": [],
      "id": 129628,
      "vote_count": 3,
      "budget": 0,
      "overview": "Henderson Dores (Daniel Day Lewis), a New York based art dealer from England, travels to Georgia to persuade patriarch, Harry Dean Stanton, to sell a Monet previously thought lost.",
      "similar": [],
      "original_title": "Stars & Bars",
      "runtime": 94,
      "poster_path": "/xwvsFz0rxCUEFN8sDwEmkdjcove.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1988-03-18",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pat O'Connor"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "William Boyd",
         "William Boyd"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0096166/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0Nzg4NzA3NV5BMl5BanBnXkFtZTcwODM5MDIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Daniel Day-Lewis, Harry Dean Stanton, Kent Broadhurst | See full cast and crew »"],
      "reviews": [
         "This is one of those rare films that seems to divide into only two groups: You will only be able to love or hate this movie. However, I think the previous reviews leave out an essential element to determining which camp you fall into: whether you are interested in the actors (based on previous roles) or the film. The best way to give you some idea of what to expect is the usual vehicle: comparison with other films. If you loved Martin Scorcese's film, After Hours or enjoyed Something Wild (with Melanie Griffith and Jeff Daniels) or were even guiltily amused by Who's That Girl (Madonna and Griffin Dunne), then you will probably like this movie. Stars and Bars uses a similar formula of \"straight laced, uptight man\" being taken for a wild adventure by \"free-spirited, sexy woman\". Obviously, this would put someone like Daniel Day-Lewis into the right role (a tightly wound serious man), but in a very different universe from films like \"My Left Foot\" and \"The Age of Innocence\". If you are hoping for another period piece or serious art, this film is not for you. Luckily, I happen to like films that range from Wim Wenders to the latest Adam Sandler vehicle. :)",
         "Oh, how I would love to own this on DVD! A marvelous job by Daniel Day Lewis, Harry Dean Stanton, Joan Cusack and Glann Headley. In my opinion it is a deep South tour-de-farce. I guess you have to have lived there to appreciate the humorous poke at what lies behind the moss-covered trees that line the backroads of the South. It reminds me of Out on a Limb, a similar Southern dark comedy with Matthew Broderick. Both are hysterical weekends with people whose family trees \"don't branch!!\" You'll never see Lewis doing this whimsy again, except perhaps as the pansy boyfriend in \"Room with a View\" which he did at about the same time. Both characters are played with equal artistic integrity he grants all his roles. Kudos and many laughs to all!",
         "William Boyd's \"Stars and Bars\" - the book - stands in the great tradition of the English comic novel (Evelyn Waugh being one of Boyd's masters and inspirators). Now, I've seen the film only in German language... That's a pity because of the resulting demi-lack of Englishman-in-New-York-effects. As you can image, the German translation cannot be that perfect. I guess that the linguistical misunderstandings between the \"hero\" (Day Lewis) and the bizarre Georgian family with Anglophobic slursare are ten times funnier in the original version (as they are in the book). Anyway, I liked the film immediately and I'm happy to have taped it. Great cast! Unforgettable: Maury Chaykin as Elvis-like Freeborn.",
         "It may be a far cry from classic screwball comedy, but even during its many forgettable moments this fish-out-of-water farce isn't a total write-off. Certainly there's nothing in it to justify the cold-blooded lack of confidence that killed it at the Box Office: the throwaway release it received is usually reserved for lame dogs someone wants put out of misery, and in this case it worked. At least the film never pretends to be anything more than what it is: a self-consciously wacky social comedy with an outsider's exaggerated, broad-as-a-barn-door view of American manners, starring Daniel Day Lewis as a dapper English art appraiser who runs into an oddball collection of cartoon Confederate rebels while investigating a lost Renoir in backwoods Georgia. All the film needs is a laugh-track to become a respectable TV sitcom (a degenerate Beverly Hillbillies?), but director Pat O'Connor doesn't show much aptitude for low comedy, and the laughs collapse into a feeble slapstick conclusion, leaving the door wide open for a sequel which will never be made.",
         "I remember standing in a long line to see this in Manhattan, and thinking that the New York parts were a perfect representation of the city at that moment in time. It's a weird vehicle for Daniel Day-Lewis, apart from his ability to play a perfect British upper class twit - I don't think he's done a comedy since (and certainly not before). The use of Joan Cusack as leading lady and love object is bizarre, too - up until this point she'd been relegated to kooky sidekick/friend of the heroine roles (Broadcast News springs immediately to mind), something she went back to almost immediately after this film. It's strange all around, but also a funny time capsule of sorts. I too wish it was out on DVD.",
         "Oh, how I would love to own this on DVD! A marvelous job by Daniel Day Lewis, Harry Dean Stanton, Joan Cusack and Glann Headley. In my opinion it is a deep South tour-de-farce. I guess you have to have lived there to appreciate the humorous poke at what lies behind the moss-covered trees that line the backroads of the South. It reminds me of Out on a Limb, a similar Southern dark comedy with Matthew Broderick. Both are hysterical weekends with people whose family trees \"don't branch!!\" You'll never see Lewis doing this whimsy again, except perhaps as the pansy boyfriend in \"Room with a View\" which he did at about the same time. Both characters are played with equal artistic integrity he grants all his roles. Kudos and many laughs to all!",
         "A very strange fish-out-of-water comedy with straight-laced stiff-upper-lip British art dealer Daniel Day-Lewis sent down South to try to purchase a priceless painting from kooky patriarch Harry Dean Stanton and contending with the various family lunatics. The tone of the film is quite uneven and the comedic moments are more mildly amusing rather than laugh-out-loud funny. Other films and books have done both the \"normal guy out of his depth\" and lampoon of the Southern Gothic family more expertly, but that is not to indicate that the film does not have some memorable moments. Some of the supporting performances are well done, particularly Maury Chaykin's obnoxious Elvis-garbed bully son and Martha Plimpton, as the sex-crazed teenager, who accompanies Day-Lewis on his trip. Unfortunately, others like Joan Cusack, Glenne Headley, Will Patton and Laurie Metcalf are either stuck with overly broad roles or limited screen time. Pat O'Connor's direction is rather clumsy and rough resulting in a film that moves in starts and stops, and misses the mark more often than not. Arguably the most interesting reason to see the film is Day-Lewis himself. Usually he plays straight dramatic roles filled with sweaty angst, it is rare to see him in a comedy, much less playing such a well-intentioned, discombobulated dweeb. He is surprisingly appealing and throws himself body and soul into the part, even when the film does not remotely deserve such consideration. It is a shame that he has refrained from doing much comedy, because he does show some skill in frantic slapstick moments - whether running around a hotel trying to prevent the meeting of two women or escaping from gangsters buck naked after being forced to strip. Not to digress, but Day-Lewis' surprising full frontal nude scene during the strip and escape is certainly another plus for any fans of his as, much like comedy, nudity is something he rarely does in his dramas.",
         "This fish out of water film has Daniel Day Lewis, uptight Englishman, thrown into a dysfunctional family of Southern hillbillies lead by Harry Dean Stanton. Not unlike Stanton's similar misfire movie \"Twister\", the story is slight, but not as stretched as \"Twister\". Both movies have offbeat characters on parade. \"Stars and Bars\" begins with a rather unflattering view of New York City, and then relies on Georgia backwoods stereotypes for both dark and slapstick humor. This film would certainly have to be classified as an acquired taste, and there are plenty of dead spots throughout. Nevertheless, the quirky characters, played by some good character actors, is enough to recommend for admirers of the strange. - MERK",
         "This is one of those rare films that seems to divide into only two groups: You will only be able to love or hate this movie. However, I think the previous reviews leave out an essential element to determining which camp you fall into: whether you are interested in the actors (based on previous roles) or the film. The best way to give you some idea of what to expect is the usual vehicle: comparison with other films. If you loved Martin Scorcese's film, After Hours or enjoyed Something Wild (with Melanie Griffith and Jeff Daniels) or were even guiltily amused by Who's That Girl (Madonna and Griffin Dunne), then you will probably like this movie. Stars and Bars uses a similar formula of \"straight laced, uptight man\" being taken for a wild adventure by \"free-spirited, sexy woman\". Obviously, this would put someone like Daniel Day-Lewis into the right role (a tightly wound serious man), but in a very different universe from films like \"My Left Foot\" and \"The Age of Innocence\". If you are hoping for another period piece or serious art, this film is not for you. Luckily, I happen to like films that range from Wim Wenders to the latest Adam Sandler vehicle. :)",
         "The cast includes Daniel Day Lewis and Joan Cusack, who one thinks could turn out stunning performances with the worst scripts. This isn't the case. The main reason I actually wanted to watch this movie twice is because of the in-jokes that only Southerners, and Atlantans especially, would get. In one scene at an Atlanta hotel, the Marriott Marquis was transformed into a parody of another major hotel which once had a \"lake\" in its lobby, and a long-standing restaurant with an overworked Civil War theme. I highly recommend seeing this movie at least once if you lived in Atlanta in the 80's. It's also good, I would think, if you've had experience with stubborn patriarchs and traveling art buyers, but that's probably a smaller group."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Stars and Bars Limited"
      ],
      "summaries": [
         "A British art expert travels across America in order to purchase a rare Renoir painting in the South but comes across some crazy characters in the process.",
         "A British art expert travels across America in order to purchase a rare Renoir painting in the South but comes across some crazy characters in the process."
      ],
      "budget": 0
   },
   "movielensId": 2246,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-03-18",
      "dvdReleaseDate": null,
      "directors": ["Pat O'Connor"],
      "runtime": 94,
      "movieId": 2246,
      "title": "Stars & Bars",
      "mpaa": "R",
      "actors": [
         "Daniel Day-Lewis",
         "Harry Dean Stanton",
         "Joan Cusack",
         "Kent Broadhurst",
         "Maury Chaykin",
         "Matthew Cowles",
         "Keith David",
         "Spalding Gray",
         "Glenne Headly",
         "Laurie Metcalf",
         "Will Patton",
         "Martha Plimpton",
         "David Strathairn"
      ],
      "imdbMovieId": "0096166",
      "originalTitle": "Stars & Bars",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Henderson Dores (Daniel Day Lewis), a New York based art dealer from England, travels to Georgia to persuade patriarch, Harry Dean Stanton, to sell a Monet previously thought lost.",
      "tmdbMovieId": 129628,
      "avgRating": 2.59286,
      "releaseYear": "1988",
      "numRatings": 70,
      "posterPath": "/eEURole1aCRHwtucP6fk6rchMH1.jpg"
   }
}