{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "butcher",
            "id": 4452
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "husband",
            "id": 162271
         }
      ],
      "imdb_id": "tt0101523",
      "video": false,
      "title": "The Butcher's Wife",
      "recommendations": [
         16814,
         10879,
         88818,
         14441,
         47608,
         25221,
         18551,
         57834,
         12661,
         25969,
         117553,
         26261,
         12656,
         15128,
         20551,
         33657,
         14550,
         2608,
         16084,
         13571
      ],
      "backdrop_path": "/9FCO3N3iMvSqNh5pywDFSf1qZxL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Marina Lemke",
               "gender": 1,
               "credit_id": "52fe43d7c3a368484e00139d",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Dr. Alex Tremor",
               "gender": 2,
               "credit_id": "52fe43d7c3a368484e0013a1",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Leo Lemke",
               "gender": 2,
               "credit_id": "52fe43d7c3a368484e0013a5",
               "name": "George Dzundza",
               "profile_path": "/jyjr4P3uCpfrbwk8ySXNaDpBMbc.jpg",
               "id": 10477,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Stella Keefover",
               "gender": 1,
               "credit_id": "52fe43d7c3a368484e0013a9",
               "name": "Mary Steenburgen",
               "profile_path": "/yJhfuqS3yXW7kLSyvRU6n3b35mq.jpg",
               "id": 2453,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Grace",
               "gender": 1,
               "credit_id": "52fe43d7c3a368484e0013ad",
               "name": "Frances McDormand",
               "profile_path": "/jodV4NuQAvxQWIHxqnop1jUX77N.jpg",
               "id": 3910,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Robyn Graves",
               "gender": 1,
               "credit_id": "52fe43d7c3a368484e0013b1",
               "name": "Margaret Colin",
               "profile_path": "/adlW4gq2BZTopzvWb28UgWnu5w1.jpg",
               "id": 8985,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Eugene",
               "gender": 2,
               "credit_id": "52fe43d7c3a368484e0013b5",
               "name": "Max Perlich",
               "profile_path": "/baFBjA3vKNqZCbXrJepVweeLj3d.jpg",
               "id": 7268,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Gina",
               "gender": 1,
               "credit_id": "530712c1c3a368791a0004e9",
               "name": "Miriam Margolyes",
               "profile_path": "/7Fijg5sZ7gKbooq6tId3MUS5sDY.jpg",
               "id": 6199,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43d7c3a368484e00138d",
               "name": "Terry Hughes",
               "profile_path": null,
               "id": 15239,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d7c3a368484e001393",
               "name": "Ezra Litwak",
               "profile_path": null,
               "id": 129644,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d7c3a368484e001399",
               "name": "Marjorie Schwartz",
               "profile_path": null,
               "id": 129645,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43d7c3a368484e0013bb",
               "name": "Lauren Lloyd",
               "profile_path": null,
               "id": 39032,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d7c3a368484e0013c1",
               "name": "Wallis Nicita",
               "profile_path": null,
               "id": 12847,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d7c3a368484e0013c7",
               "name": "Michael Gore",
               "profile_path": null,
               "id": 32398,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d7c3a368484e0013d3",
               "name": "Donn Cambern",
               "profile_path": null,
               "id": 8847,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5549d5dfc3a36841ab001859",
               "name": "Frank Tidy",
               "profile_path": "/8IHxkjqkL4UOGUCrADCG0w3g0kj.jpg",
               "id": 59955,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.458408,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20096,
      "vote_count": 45,
      "budget": 0,
      "overview": "A clairvoyant woman thinks that she's met her future husband because she's seen him in a dream. They marry and he takes her back to his butcher shop in New York city, where her powers tend to influence everyone she meets while working in the shop. Through her advice, she helps others and eventually finds the true man of her dreams.",
      "similar": [
         24420,
         49524,
         13523,
         150117,
         1024,
         1599,
         19913,
         1903,
         13,
         38,
         50546,
         72105,
         50544,
         272693,
         8839,
         277547,
         1643,
         44564,
         290762,
         226
      ],
      "original_title": "The Butcher's Wife",
      "runtime": 107,
      "poster_path": "/8p7xXAqM9KS9VGMQj5ey6llIwRs.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1991-10-25",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "There's Magic In The Air.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Terry Hughes"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Ezra Litwak",
         "Marjorie Schwartz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101523/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1NjY1MTU0MF5BMl5BanBnXkFtZTcwODQ1ODQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Demi Moore, Jeff Daniels, George Dzundza | See full cast and crew »"],
      "reviews": [
         "I think that Demi Moore was bold to go with the little known Ocracoke, NC accent because most people will probably (wrongly) think that she was doing a very bad job at a North Carolinian/Southern USA accent. Ocracoke is a small, fisherman's island at the bottom of the North Carolina Outer Banks island chain and is only accessible by ferry. This isolation has kept the accent there mostly unaltered since the 17th century days when it was inhabited by British seamen. The Ocracoke accent sounds like a mixture of Brit and Yank, so what you hear Demi Moore doing in this movie is really quite accurate. I also enjoyed the cozy portrayal of the Manhattan (NYC) side street neighborhood life. The NYC avenues tend to be wide, impersonal and busy, but the narrower, townhouse and small shop filled side streets can be quite friendly. It gives me some nice, childhood nostalgic memories to see the happier, day-to-day aspect of NYC life shown in this film. I watch this romantic comedy whenever it is on TV, and I have no complaints about it at all. I find it to be a sweet, feel-good film with occasional hints at magic realism, but without plunging too far into that iffy genre. I feel that all the players did good jobs, and that the locations and settings felt very true. Nice production values too. If you like \"Moonstruck\", then you will probably like \"The Butcher's Wife\" too.",
         "I know, I know, it's basically a boiler-plate piece of Hollywood fluff but I really loved this movie. I am a hopeless romantic and thought this movie captured the essence of falling in love and finding your split-apart...er...soul mate. :) Jeff Daniels is wonderful as the shrink who can't help himself as his world unravels and falls apart thanks to the whacky Demi Moore character. Demi is perfect as the ditzy but charming butcher's wife. I really liked Mary Steenburgen in this story... she looked beautiful and sang like an angel. I liked all of the little characters too. The music at the end is haunting and perfect for the finale which wasn't surprising but who cares!!!",
         "I liked this romantic movie just fine. Demi Moore as Marina is in earnest even though she gets off to a wrong start by marrying a man she \"thinks\" is the right one, but her feelings aren't based on solid ground as it turns out. Jeff Daniels is less believable in his role as a psychiatrist and comes across as being more neurotic than his patients! Introverted Stella, played by Mary Steenburgen, is a charmer and her singing is almost the highlight of the film, at least to me. As well, a certain butcher named Leo is also captivated by Stella's modest ways and they are drawn to each other and soon fall in love. This only adds to the confusion in everyone's lives and doesn't help solve their problems. The movie isn't a first class romance but if accepted on its own terms it's very enjoyable with a message or two about life and understanding. I tune in to see it whenever it's on, might get the video too if funds permit.",
         "Demi Moore (with a blonde do) plays Marina, a clairvoyant who marries a New York butcher believing him to be the man of her dreams. Once she gets to New York she finds out that while her powers seem to be accurate when she advises other people, she may not have made the right choices for herself... I was forced to watch this movie by my girlfriend and found myself pleasantly surprised. It's no classic, but is a sweet, enjoyable film (though it's fairly easy to spot how things will work out early on). Over here in the UK the film received a \"15\" certificate, presumably for the one instance of strong language that actually jars with the rest of the film, and possibly for the lesbian character/s (though they barely touch each other on screen). I sympathised with most of the characters, especially Mary Steenburgen's would-be singer (she has a surprisingly good voice, by the way). Marina's complete accuracy when it comes to predictions that don't involve her is a little far-fetched, especially when she gets her own life in such a mess. Worth a look if you like low-key romantic comedies with a slightly magical twist (not a large genre!), or if you liked \"Simply Irresistible\" (1999) with Sarah Michelle Gellar. Not really one for most guys, though.",
         "I just love, love, love this film. The cast is perfect, right down to all the bit-parts. At first I was bothered by DM's accent (& her blonde hair is a shame) but the sweet script transcends all that. All the characters are pitch perfect, the lines so funny & the message inspiring! The locations are also great, I don't know where this is in NYC, but I would love to live there! I think Jeff Daniels is simply brilliant in this film, and Mary Steenbergen too. The scene where DM tells her she's a singer is lovely & the sparky scenes between JD & DM are so sweet and funny too!",
         "This movie is a sweet fantasy with a good message about life, love and destiny. I usually skip movies with medically-oriented protagonists but the fantasy/psychic elements more than make up for the fact that Jeff Daniels plays a psychiatrist. Demi Moore is lovely, though the blonde hair is not. She would have been better with her natural look. Molly Steenbergen is great. I like the way regular people are touched by magic. Less stereotypical than a lot of other romantic comedies. Some people might be distracted by Demi's Moore's accent but I thought it worked well. The movie deals with psychics in a normal manner for a change. Unlike so much of TV and movies now, I really liked most of the characters and believed they were good people.",
         "I missed this movie in the theaters the first time around and just saw it on cable. Despite a few jumps in logic - like tying up one of the romantic loose ends by making one of the characters an instant lesbian - hmm, wish life were that easy - (and by the way - that's the spoiler) - I thought this movie was a sweet departure from current popular fare. This is the kind of fanciful movie they used to make in the 1940's - nowadays we're not asked to just go along for the ride and enjoy ourselves. Nice way to spend the afternoon. And by the way, I know Demi got roasted for this role - I thought she was charming, and I'm not generally a big fan.",
         "What a treat to catch this movie on a HD channel recently; yes, it is \"Schlocky-wood\", but it's done as a carefully crafted ensemble piece. And what an ensemble! The cast has some great moments, especially for Demi Moore and Jeff Daniels. But there are some \"characters in the background\" who would become well known for performances yet to come (e.g., Frances McDormand in \"Fargo\" and Miriam Margoyles as Prof. Sprout in the Harry Potter series). This is an enjoyable, humorous, ironic, feel-good movie... you surely won't have to apologize for crude language or over-the-top violence in any scene (well, you will have to get used to Demi's full length blonde hair, and after \"G. I. Jane\" that may be tough to do).",
         "For someone who likes modern fairy tales, this is a great movie. Granted, Demi Moore's accent wasn't the best- but I blame that on a bad voice coach- not her. There was actual chemistry between her and Jeff Daniels. If you liked Practical Magic, you'll probably like this one too. Basically, if you want a cute, distracting movie with a little bit of the paranormal (Moore plays a psychic- yes, a real one), like urban settings and slightly predictable love triangles with a happy ending, you'll love this one. This one is for the innocent in the audience- or the people who can overlook one bad point for the big picture, because in the long run, this movie is awesome. This one and Moonstruck are my two favorite 'chick flicks'.....and I don't normally like chick flicks.",
         "It's a harmless, little romantic comedy that entertains and delights me. I watch it every time it's on TV. Demi's character conveys mystery and innocence...and the blonde hair is most suitable to that end. Plus it foreshadows (spoiler) that Jeff Daniels (also blond) and she are meant for each other. The gay parts are subtle and sweet...I take no offense at all and am surprised that others do. I no longer expect perfection in any movie. Having said that, if you just want to be entertained and need a break from violence, cursing, and nudity....give this movie a try."
      ],
      "genres": [
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["A clairvoyant thinks she's met her husband to be because she's seen him in her dreams. They marry quickly, and return to the husband's (\"the butcher\"), home in the city. She has a big impact on everyone she meets by anticipating their questions and actions and advising them on their love life. Her interference then brings her into contact with the real man of her dreams."],
      "budget": 0
   },
   "movielensId": 2266,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1991-10-25",
      "dvdReleaseDate": "2001-10-23",
      "directors": ["Terry Hughes"],
      "runtime": 107,
      "movieId": 2266,
      "title": "The Butcher's Wife",
      "mpaa": "PG-13",
      "actors": [
         "Demi Moore",
         "Jeff Daniels",
         "George Dzundza",
         "Mary Steenburgen",
         "Frances McDormand",
         "Margaret Colin",
         "Max Perlich",
         "Miriam Margolyes"
      ],
      "imdbMovieId": "0101523",
      "originalTitle": "The Butcher's Wife",
      "genres": [
         "Fantasy",
         "Comedy",
         "Science Fiction",
         "Romance"
      ],
      "youtubeTrailerIds": ["hRAYMV8b52I"],
      "plotSummary": "A clairvoyant woman thinks that she's met her future husband because she's seen him in a dream. They marry and he takes her back to his butcher shop in New York city, where her powers tend to influence everyone she meets while working in the shop. Through her advice, she helps others and eventually finds the true man of her dreams.",
      "tmdbMovieId": 20096,
      "avgRating": 2.85817,
      "releaseYear": "1991",
      "numRatings": 1322,
      "posterPath": "/8p7xXAqM9KS9VGMQj5ey6llIwRs.jpg"
   }
}