{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Caroline Thomas"],
      "runtime": 72,
      "synopsis": null,
      "writers": ["Bob Thomas"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109390/",
      "coverLink": null,
      "actors": ["Stars: Don Ameche, Richard Attenborough, Dan Aykroyd | See full cast and crew »"],
      "reviews": ["This astonishing documentary is the quintessencial element of the most important artistic development of the twentieth century, films.... Presented with some remarkable interviews of history's most influencial artists that help this entertainment form to a powerful artistic means of communication, the film displays some of the most memorable, touching, inspiring, poetic, shocking moments of the seventh art. Flawlessly edited with superb sequences that crafted the magic that is films, the documentary presents a striking step by step story of motion pictures. And this work also is important to understand the era of the golden age of entertainment. The strong social changes that happened to change the course of history, the deep rising of fame and fortune in the USA of the thirties to the present day... This is films, the dream, the love, the passion, the emotional accention that made all us wish of worlds so heavenly and beautiful, if only we could be apart of them... Here's our chance, all aboard...!!!"],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 2270,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-01-01",
      "dvdReleaseDate": null,
      "directors": ["Caroline Thomas"],
      "runtime": 0,
      "movieId": 2270,
      "title": "Century of Cinema, A (1994)",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0109390",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 3.24286,
      "releaseYear": "1994",
      "numRatings": 35,
      "posterPath": null
   }
}