{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "usa",
            "id": 279
         },
         {
            "name": "nuclear war",
            "id": 677
         },
         {
            "name": "diamond",
            "id": 1384
         },
         {
            "name": "soviet union",
            "id": 2111
         },
         {
            "name": "dr. fu man chu",
            "id": 6770
         }
      ],
      "imdb_id": "tt0080731",
      "video": false,
      "title": "The Fiendish Plot of Dr. Fu Manchu",
      "recommendations": [
         42989,
         54613,
         48989,
         34665,
         65066,
         63859,
         42176,
         1732,
         33076,
         42623,
         57565,
         42719,
         24731,
         24214,
         25113,
         24429,
         35976,
         53287,
         14584,
         22090
      ],
      "backdrop_path": "/50U7L0BSXYazp8QpCvBbl1fNL7K.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Fu Manchu / Nayland Smith",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fcfb",
               "name": "Peter Sellers",
               "profile_path": "/sCVIv2DGoC9U16anTjLwMxKBPZ.jpg",
               "id": 12446,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Alice Rage",
               "gender": 1,
               "credit_id": "52fe4396c3a36847f805fd03",
               "name": "Helen Mirren",
               "profile_path": "/4EGgBJPUBz68ZrnFuLVo01r0uND.jpg",
               "id": 15735,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Sir Roger Avery",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd07",
               "name": "David Tomlinson",
               "profile_path": "/1QJLJtcJ4x8DQFflrbd2144ZzLg.jpg",
               "id": 5825,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Joe Capone",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd0b",
               "name": "Sid Caesar",
               "profile_path": "/ccgsqL5cF8qpc4JuKgLGGEn6im1.jpg",
               "id": 8902,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Robert Townsend",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd0f",
               "name": "Simon Williams",
               "profile_path": "/xxCTbVBFSCwzGwwUGo5D3LF890W.jpg",
               "id": 32160,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Peter Williams",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd13",
               "name": "Steve Franken",
               "profile_path": "/xmWo1fzZbQ3EpM1I9GZQitx1Adz.jpg",
               "id": 24323,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Ismail",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd17",
               "name": "Stratford Johns",
               "profile_path": "/bYaNjkrupvbgr97RHQujvAjO0x.jpg",
               "id": 32161,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Perkins",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd1b",
               "name": "John Le Mesurier",
               "profile_path": "/42H9hrRtpFrQ7LFlBr8AnHfgDnr.jpg",
               "id": 14264,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Sir Thuud",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd1f",
               "name": "John Sharp",
               "profile_path": "/tesKy6VNj8tUTpl1qqGvqaRJKGR.jpg",
               "id": 26261,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Dr. Wretch",
               "gender": 0,
               "credit_id": "52fe4396c3a36847f805fd23",
               "name": "Clément Harari",
               "profile_path": "/iVykmgZ9Ue5qIQ7mNczefwNVXN8.jpg",
               "id": 32162,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Tang",
               "gender": 0,
               "credit_id": "52fe4396c3a36847f805fd27",
               "name": "Kwan-Young Lee",
               "profile_path": null,
               "id": 32163,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Fu Manchu's Servant",
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fd2b",
               "name": "Burt Kwouk",
               "profile_path": "/7s1Sul5L6NU2TEfgLarBqrde65v.jpg",
               "id": 21944,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fca9",
               "name": "Piers Haggard",
               "profile_path": null,
               "id": 32154,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fcaf",
               "name": "Richard Quine",
               "profile_path": "/bkCUG3gSO3XlvHjwO2FRy0cOYko.jpg",
               "id": 18907,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fcb5",
               "name": "Peter Sellers",
               "profile_path": "/sCVIv2DGoC9U16anTjLwMxKBPZ.jpg",
               "id": 12446,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4396c3a36847f805fcbb",
               "name": "Rudy Dochtermann",
               "profile_path": null,
               "id": 32155,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4396c3a36847f805fcc1",
               "name": "Jim Moloney",
               "profile_path": null,
               "id": 32156,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fcc7",
               "name": "Sax Rohmer",
               "profile_path": null,
               "id": 32113,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fccd",
               "name": "Zev Braun",
               "profile_path": null,
               "id": 32157,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4396c3a36847f805fcd3",
               "name": "Leland Nolan",
               "profile_path": null,
               "id": 32158,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fcd9",
               "name": "Marc Wilkinson",
               "profile_path": null,
               "id": 32159,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4396c3a36847f805fcdf",
               "name": "Jean Tournier",
               "profile_path": null,
               "id": 10470,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4396c3a36847f805fce5",
               "name": "Claudine Bouché",
               "profile_path": null,
               "id": 18223,
               "department": "Editing",
               "job": "Supervising Film Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fceb",
               "name": "Russell Lloyd",
               "profile_path": null,
               "id": 14745,
               "department": "Editing",
               "job": "Supervising Film Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fcf1",
               "name": "Alexandre Trauner",
               "profile_path": null,
               "id": 4103,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4396c3a36847f805fcf7",
               "name": "John Bloomfield",
               "profile_path": null,
               "id": 7793,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 2.203513,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 3486,
      "vote_count": 12,
      "budget": 0,
      "overview": "Fu Manchu's 168th birthday celebration is dampened when a hapless flunky spills Fu's age-regressing elixir vitae. Fu sends his lackeys to round up ingredients for a new batch of elixir, starting with the Star of Leningrad diamond, nabbed from a Soviet exhibition in Washington. The FBI sends agents Capone and Williams to England to confer with Nayland Smith, an expert on Fu.",
      "similar": [
         1374,
         9604,
         1726,
         10138,
         68721,
         582,
         27576,
         296098,
         1247,
         40807,
         9029,
         8835,
         935,
         772,
         222936,
         193893,
         496,
         59108,
         146216,
         136795
      ],
      "original_title": "The Fiendish Plot of Dr. Fu Manchu",
      "runtime": 108,
      "poster_path": "/pXdDEY47CTvGgkz3XC06mV3F98L.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Playboy Enterprises",
         "id": 1431,
         "origin_country": ""
      }],
      "release_date": "1980-08-08",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "BEWARE! See this movie - An hour later you'll want to see it again!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Piers Haggard",
         "Richard Quine"
      ],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Rudy Dochtermann",
         "Jim Moloney"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080731/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMzU4NTU2MV5BMl5BanBnXkFtZTYwMzM1NTg5._V1_.jpg",
      "actors": ["Stars: Peter Sellers, Helen Mirren, David Tomlinson | See full cast and crew »"],
      "reviews": [
         "Like a couple of other reviewers here, I'm baffled as to why this movie is so lambasted. It is not the gut-busting laugh getter, but then it's not supposed to be. I found it to be rather tongue in cheek fun, not unlike a silly James Bond film (when Connery was doing it still) and entertaining for the detective movie buff like myself. I remember seeing it with my wife. And the ending is silly and funny I thought. Sure it's not a great film like \"Being There\" but it is not a horrible film to go out on as some professional reviewers have said. I really liked the exaggerated Chinese accent Sellers gives his Fu Manchu (Which I would imitate for my wife's amusement often) and the funny bit about the aging and somewhat out there Nayland Smith pushing a lawnmower over the carpet in the \"home\" that helped him think. And so to you Nay(land) sayers out there, I say FU! I had a good time with this addition to detective fiction satire.",
         "I saw this with my dad when I was 10. He is a huge Peter Sellers fan and therefore took me, and anyone who wanted to go, to see every Pink Panther movie. People talk about how awful it was, but I liked it so much, I insisted on seeing it twice when it was released.I bet I'm the only one who did. My favorite part has to be the musical production number at the end. I thought it was a fun scene for him to go out with. Yes, Peter Sellers has made much better films. And if this weren't his last, his fans would probably dislike it a lot less. This movie isn't funny in a slapsticky kind of way. It's funny because it's such an unusual mix of comedy and adventure. I think it's a cult classic waiting to be rediscovered. And remember, Peter Sellars was warned by doctors not to do this movie. His poor health was in part a result of his insistence of doing all of his own stuntwork. If fans really respect Seller's dedication to his craft, they will appreciate the fact that he nearly killed himself, doing what he liked to do best - playing an eccentric characters like this. So why not honer the actor by watching his final screen performance? Allow yourself to forget all about Peter Seller's other work and let his portrayal here stand on it's own. Another suggestion: order some Chinese food to eat while you watch it. It can only make the viewing experience better.",
         "I'm baffled as to why so many people hate this film. This is vintage Sellers, a return to before Hollywood got it's grip on him. I saw it in the cinema, when I was 15, and laughed my ass off. Lovely characters, funny set pieces, familiar faces and a plot-of-sorts. Yes it can get a little slow, but I really wish you'd go and look at some of Sellers' films of the late 50's/early 60's. THAT'S where this film belongs. It's VERY British and enters that whole territory that includes \"One of our Dinosaurs is Missing\", \"The Magic Christian\", \"Peter Cook's Hound of the Baskervilles\", \"The Adventure of Sherlock Holmses Smarter Brother\" and their ilk. Not a bad thing really, but perhaps a minority taste. These tend to play more like extended TV sketch shows, and tend not to appeal to the majority. I mean.. flying houses?! My irritation is the addition of Sid Caeser and Steve Franken.. WHY??? Merely to make the film sellable to the US one would imagine! They serve no purpose at all. They come across as caracture Americans.. shooting at plants and the like! And oh boy...Helen Mirren as PC Rage.. just TOO much!! The Lady of Warrington Minge!! It's very Goon-like, in terms of plot and characterisation: David Tomlinson as Neddie, Simon Willams as Bluebottle, Sellers as Colonal Bloodnok.... but it DOES lack Milligan's edge and drive. Descendants of this film include \"The Crimson Permanant Insurance\"... What about the scene with FIVE sets of the King and Queen in the theatre box?? Hysterical... Make no mistake though....this is a vehicle for Sellers and his characters. Sellers is in top form as the bonkers, but delightfully deadpan Nayland Smith (and his .... attachment to a lawnmower!) and the evil Fu Manchu.. \"Hello boys!\".... He's Dr Evil before the fact! More impeccable characters. It is, in fact, quite gutting to see how much he still had to give, just before his death, and one does wonder what would follow, given his huge profile after the completion of \"Being There\", his pet project for nearly 10 years. So there you have..... my attempt to balance things a bit. If you wants full-on Hollywood Sellers.. go see the Panthers. But maybe you'd like to have a closer look at Sellers the comic actor in a pearl of the British comedy. His last.",
         "Whilst not a Sellers classic I still feel this film did have a certain touch of Sellers genius about it. Alas it appears the majority of the reviewers here have never watched the Christopher Lee Fu Manchu films. It was such a wonderful parody that even now it has me laughing. Maybe it is because you really need to get some of the \"in jokes\". It also explains why this film was set in the Thirties as well ('cos the Christopher Lee ones were). So guys before criticising something try and find out why it is there. As a lover of horrors and comedies I found this a joyous blend of my favourite baddie suffering the humour of my favourite comedian. If you ever enjoyed a Christopher Lee baddie (and who didn't?) then don't miss this as a marvelous mickey taking. In fact I think it is about time to watch it again! Oh and DON'T eat Chinese food whilst watching this unless you like laughing noodles out through your nose!!!!!!",
         "It is really a shame that this movie is not available on DVD or even VHS. Hope I am wrong on that but I can't find it anywhere. The movie is full of puns and funny side references. No, it is not greatest project by Peter Sellers (that would be \"A shot in the Dark\") but whoa is it funny and a bit non-PC. It pokes fun at Caucasian actors playing Asian characters....and about every B movie ever made. If you like MST3K you might want to take a look since it is for fans of satire. My favorite line is \"The yellow fiends have stolen delight\" You will have to watch the movie, I am not going to spoil that.",
         "If you enjoyed the Pink Panther movies, try this one. I keep hearing about how this was a bad end to Peter Sellers' career, but I liked it. Perhaps these people are influenced by what they've heard. Hear me say it's funny, and go watch it yourself. It's a cute satire/parody of the books, and, actually, reading one will add a little spice to the movie. Sellers also makes several little nudges to the audience when his dialog speaks about the movie. Sure, there are several dumb bits, but I think that the good parts greatly outweigh them. The movie, while with some Panther feeling, seems to be stretching a little toward Python and away from Stooges (slapstick). There's something else I recently picked upon, and that's its early 70s feeling (or late 60s), although it was made in 1980. If you're looking for something a little dumb and silly, but that a person with a little extra brain would pick out the extra bits in, this is a pretty good movie.",
         "OK! Maybe it is not the best film making but it is fun, and is the last hurrah for one of the great comic actors of all time. A gentle spoof of all of those Fu Manchu films over the years,(and frankly better than many of them) It contained many of the hallmarks of Sellers films such as playing multiple roles (Fu Manchu and nemesis Nayland Smith) Using comic actors of similar stripe (Sid Caesar) re-uniting with Bert Kwouk (his man-servant in many of the Pink Panther movies.) This was also the farewell film of actor David Tomlinson and John Le Messeur both of whom retired from films after this. The movie is a fun romp with a mix of the absurd slapstick and the witty dialog of the characters. One of my favorite lines happens after a line of dacoit assassins appear in front of Fu Manchu and he says \"you can't fool me with a cheap cinematic trick.\" This was very fitting farewell to a great comic genius.",
         "While \"The Fiendish Plot of Dr. Fu Manchu\" is by no means the best of Peter Sellers' work, for those who are fans and appreciate his whole output, the movie is enjoyable. Multiple characters for Sellers, \"Goon Show\"-type humor, a measure of unreality and strong supporting performances all contribute to it. The movie manages to mix only a few out-and-out laughs with some more subtle comedy, some farce, and even a few moments to ponder. The fact that it was Sellers' last performance might add to its attachment for fans, but I'll argue that it is a good and under-appreciated comedy. I'll hang onto my VHS copy and hope that a DVD version is produced.",
         "I have always been a bit mystified at the rather harsh critical reaction this film received when released in 1980. Granted, it does trade in some Asian stereotypes (as well as American and English stereotypes), but then one should remember that the film was a send-up of the original Fu Manchu novels and films, which were largely \"Yellow Peril\" fantasies. Further granted that it was not Peter Sellers best film. Still, despite some bits that fall a bit flat, it is a genuinely funny film with good performances, especially from Sellers in his dual role, and Helen Mirren, as the PC with the acting bug turned femme fatale. Not necessarily for Sellers fans only, but it does help if you already have some familiarity with the Fu Manchu character.",
         "Admittedly this movie is unusual, for a start, and may not Sellers' great exit as many had hoped, but there are still incontrovertible facts that remain: It is one of the few movies I've seen to ever ATTEMPT a throwaway trompe l'oiel, and it achieves it so smoothly and incidentally that I had to rewind it just to make sure I wasn't seeing things. (Clue: Lawnmower, Door, Bust) The incongruity of dialogue with context was delicious! I mean how can you say a movie where \"Queen Elizabeth\" languorously - almost ludicrously - prepares to play her sax for Fu Manchu is a loss? Three Words: My Chinese Buffet. Three More Words: Japanese Elvis Show. And the beauty is that I've told you all of this, and I've spoiled absolutely none. Try not to bash it for what it is not, because there is a GREAT deal to what it is."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Braun Entertainment Group",
         "Playboy Enterprises"
      ],
      "summaries": ["Fu Manchu's 168th birthday celebration is dampened when a hapless flunky spills Fu's age-regressing elixir vitae. Fu sends his lackeys to round up ingredients for a new batch of elixir, starting with the Star of Leningrad diamond, nabbed from a Soviet exhibition in Washington. The FBI sends agents Capone and Williams to England to confer with Nayland Smith, an expert on Fu. Nayland suspects Fu will kidnap the king and queen and demand the George V diamond as ransom. Scotland Yard recruits Alice Rage to stand-in for the queen. Fu nabs the \"fake\" queen; Rage becomes enamored of Fu and aids him in his quest for the George V diamond."],
      "budget": 0
   },
   "movielensId": 2286,
   "movielens": {
      "languages": [
         "Español",
         "English",
         "Magyar"
      ],
      "releaseDate": "1980-08-08",
      "dvdReleaseDate": null,
      "directors": [
         "Piers Haggard",
         "Richard Quine",
         "Peter Sellers"
      ],
      "runtime": 108,
      "movieId": 2286,
      "title": "The Fiendish Plot of Dr. Fu Manchu",
      "mpaa": "PG",
      "actors": [
         "Peter Sellers",
         "Helen Mirren",
         "David Tomlinson",
         "Sid Caesar",
         "Simon Williams",
         "Steve Franken",
         "Stratford Johns",
         "John Le Mesurier",
         "John Sharp",
         "Clément Harari",
         "Kwan-Young Lee",
         "Burt Kwouk"
      ],
      "imdbMovieId": "0080731",
      "originalTitle": "The Fiendish Plot of Dr. Fu Manchu",
      "genres": [
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": ["dIy37fEVnwo"],
      "plotSummary": "Fu Manchu's 168th birthday celebration is dampened when a hapless flunky spills Fu's age-regressing elixir vitae. Fu sends his lackeys to round up ingredients for a new batch of elixir, starting with the Star of Leningrad diamond, nabbed from a Soviet exhibition in Washington. The FBI sends agents Capone and Williams to England to confer with Nayland Smith, an expert on Fu.",
      "tmdbMovieId": 3486,
      "avgRating": 2.51916,
      "releaseYear": "1980",
      "numRatings": 261,
      "posterPath": "/pXdDEY47CTvGgkz3XC06mV3F98L.jpg"
   }
}