{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "painter",
            "id": 437
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "artists' life",
            "id": 2936
         },
         {
            "name": "arts",
            "id": 6022
         },
         {
            "name": "lgbt",
            "id": 158718
         }
      ],
      "imdb_id": "tt0119577",
      "video": false,
      "title": "Love Is the Devil: Study for a Portrait of Francis Bacon",
      "recommendations": [
         372174,
         72899,
         26535,
         27443,
         125034,
         163392,
         190967,
         211078,
         150043,
         78355,
         382212,
         43324,
         104043,
         159153,
         108614,
         502426,
         44386,
         52906,
         158359,
         350362
      ],
      "backdrop_path": "/vgJA10c8yYqbu0vga41P1jJchJY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Francis Bacon",
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078021",
               "name": "Derek Jacobi",
               "profile_path": "/jJ4MkVS59gCfJhWMfLTbeHKjoyC.jpg",
               "id": 937,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "George Dyer",
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078025",
               "name": "Daniel Craig",
               "profile_path": "/mr6cdu6lLRscfFUv8onVWZqaRdZ.jpg",
               "id": 8784,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Muriel Belcher",
               "gender": 1,
               "credit_id": "52fe43eac3a36847f8078029",
               "name": "Tilda Swinton",
               "profile_path": "/eGNo9qwlunvAi4kCVUEFtQFM5X.jpg",
               "id": 3063,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Isabel Rawsthorne",
               "gender": 1,
               "credit_id": "52fe43eac3a36847f807802d",
               "name": "Anne Lambton",
               "profile_path": "/f8jV9a8a85i8vXZraPRORUsHi3e.jpg",
               "id": 40310,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Daniel Farson",
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078031",
               "name": "Adrian Scarborough",
               "profile_path": "/i4oo8zApNAbKQKI4yKc0T571dBI.jpg",
               "id": 40311,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "John Deakin",
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078035",
               "name": "Karl Johnson",
               "profile_path": "/qV0nk2EGTonsNCOm8xPF4RuaoK5.jpg",
               "id": 39186,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Henrietta Moreas",
               "gender": 1,
               "credit_id": "52fe43eac3a36847f8078039",
               "name": "Annabel Brooks",
               "profile_path": null,
               "id": 40314,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f807801d",
               "name": "John Maybury",
               "profile_path": null,
               "id": 40307,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f807803f",
               "name": "John Mathieson",
               "profile_path": null,
               "id": 943,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078045",
               "name": "Ryuichi Sakamoto",
               "profile_path": "/sznCz9OIUYxBgNhn7hsd9LK5jsN.jpg",
               "id": 11382,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f807804b",
               "name": "Daniel Goddard",
               "profile_path": "/uW7YJWh2wO5xUcDK1Acq1uZZr99.jpg",
               "id": 41122,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f8078051",
               "name": "Alan MacDonald",
               "profile_path": null,
               "id": 15732,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe43eac3a36847f8078057",
               "name": "Christina Moore",
               "profile_path": null,
               "id": 41123,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe43eac3a36847f807805d",
               "name": "John Maybury",
               "profile_path": null,
               "id": 40307,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43eac3a36847f8078063",
               "name": "Annie Symons",
               "profile_path": null,
               "id": 24258,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.741513,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 4975,
      "vote_count": 21,
      "budget": 0,
      "overview": "Biography of the British painter Francis Bacon. The movie focuses on his relationship with George Dyer, his lover. Dyer was a former small time crook.",
      "similar": [
         449176,
         184352,
         4369,
         26280,
         383526,
         338189,
         26371,
         142,
         1213,
         376867,
         17483,
         428493,
         413666,
         382475,
         1420,
         340684,
         380874,
         10938,
         222918,
         377154
      ],
      "original_title": "Love Is the Devil: Study for a Portrait of Francis Bacon",
      "runtime": 90,
      "poster_path": "/wRYFf3o6JP4ezL5Ci8yF8m7EHf6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-09-16",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Maybury"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["John Maybury"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119577/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzAyMzQ0NDE5M15BMl5BanBnXkFtZTcwMzk4NTYxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Derek Jacobi, Daniel Craig, Tilda Swinton | See full cast and crew »"],
      "reviews": [
         "John Maybury's film presents artist Francis Bacon as an uncaring, disturbed, unhinged, genius who used people and life to feed his bizarre artistic talent. Even the way the film is shot (distorted images, odd angles, flashes of colour) shouts 'artist'. Against this backdrop the story of Bacon's life is secondary. Derek Jacobi plays Bacon, in a radical departure from the work he is best known for - in fact, this film was completed while he was regularly on television as brother Cadfael. He is excellent in a deeply unsympathetic role. Daniel Craig, as his lover, nemesis, and muse, is also very good. Tilda Swinton is the best of a supporting cast of oddball characters. This film is ultimately frustrating, difficult, and perhaps a pointless exercise as far as giving us any lasting impression of Bacon's character. But, like his well-known paintings, it is snatches of images you will remember.",
         "Love is the Devil is amazingly rich in character and visuals. Just like Bacon's paintings, it is abstract, provocative, dark, and cruel, yet intensely mesmorizing. Maybury couldn't have picked a better actor than Derek Jacobi to portray the very disturbed Bacon. Jacobi is so good, I wondered whether this was just acting or the real thing. One of my favorite scene was Bacon grooming himself, using ammonia cleanser to brush his teeth and curling his eyelashes with his saliva. Neither could I ever forget the countless enigmatic facial expressions Jacobi delivers. One of the best films I've seen in years.",
         "\"Love Is The Devil\" stirs me to scope out James Bond now, Daniel Craig's an exciting choice I must say: content over celebrity. In response to the viewer who complained about the dislocated scenes that may or may not be relevant to the whole, the distorted lens... this is a film about a real painter. What is so brilliant about this work, is that they found a way to visually bring Bacon's paintings to life - they are exploring the man, the life, the love through the filter of his own paintings. Audacious attempt. Expertly Accomplished. One of the few films about painting that honestly pays true homage to the art form. This is not a suburban film about a painter - and who he was and what happened to him and what he did - rather... This Is A Painter's Film. There are graceful, indelible moments here that have scraped a little unused previously untouched part of my brain I did not know was there and scarred and these irrelevant vivid images, these haunting shots that only exist to soar and be seen without a net of linear context have affixed themselves into my memory to reappear at whim and always make me gasp. and clamor to savor, they slip away again. and the world, oh yea, here. That last amazing scene I'm trying so hard not to copy in my own creations, but - that - last - amazing - scene - seems - stronger - than - my - own - will -",
         "The idea of falling is important in this story.George Dyer(play with perfection by Dani Greig)thought that he would be saved by Bacon but the painter only changed Dyer's physical falling into another more interior and destructive.We can see in different scenes(and forms) \"The falling\" ,to the long fall of Dyer during the title sequence until his own intention to jump from a flatroof and later through nightmarish like image who also got to do with a fall (to emptiness). Love is The devil shows how Bacon creates his paintings using Dyer(what a great name it sounds `Dying') as a MUSE and we can also see the bohemian circle of Bacon's drunk friends in which the painter is the nastiest(The great Tilda Swinton appears here as the owner of `Colony room' this place somewhere in SOHO)once again we are witness of DYER fall to alcohol ,drugs and an abusive relationship with Bacon who culminates,as everybody knows, in Dyer's suicide(his last fall at least).The most outstanding aspect of the film(besides this tormented love affair) is the photography and visual trick:the use of reflection is one of the main devices used by the director Maybury to allude to Bacon's paintings(there is a large roundmirror in the background that distorts the reflected image)Mirrors are used to repeat and layer images,resembling Bacon's use of the triptych.Water and shots through glasses and bottles distorts faces and forms(like Deneuve in Repulsion).I also loved the script,the philosophical approach(existencialism,)the wonderful actor Derek Jacobi, who plays Bacon has a perfect voice and the words he says sounds like aphorism.BUT besides S&M ,there's place to tenderness:the film opens with BACON grieving the death of his lover the scene is set in a bedroom BACON seats on the edge of the bed,his head buried in George pillow(where George laid his head suffering with nightmares)the scene is unique. Dyer was a handsome man but he wasn't very sophisticated\u0085If he would had read POE,he would knew the existence of diabolical painters who are capable to transcribe in to their works the vital substance of their models.If he would knew the story of Faust he would be able to identify the devil in the cherubin aging face of Bacon,who was then already a fallen angel in his own personal hell.This is a little great film I recommend it. 8/10",
         "Francis Bacon was one of the most acclaimed artists of his generation, and Derek Jacobi is one of the finest actors of his, but even this combination can't make 'Love is the Devil', John Maybury's biopic of Bacon's life, especially interesting. The problem is that the film lacks a central point of sympathy: Bacon comes across as selfish and spoilt, while his hapless lover (the film's other central character) is too clearly out of his depth from the start, and never manages to become someone in whom one can invest any hopes. In terms of its overall feel, the film tries to reflect Bacon's artistic sensibility; in this it is partially successful, although the odd decision to fade to black between practically every scene grows tiresome. Unless you're a particular fan of Bacon, you can afford to miss this film: Stephen Frears' 'Prick Up Your Ears' (a biopic of Joe Orton) explores similar themes with more humanity.",
         "This is a fearless, eerie film about the relationship between British painter Francis Bacon (Derek Jacobi) and his handsome, unsophisticated lover George Dyer (the new James Bond, Daniel Craig). The destructive affair is told from Bacon's and Dyer's perspectives with unsettling images strongly directed by John Maybury. Their story is somewhat like Joe Orton and Kenneth Halliwell's (told by Stephen Frears in \"Prick Up Your Ears\"), and the emotional bond between the intellectual artist and the rustic lover reminds me of Truman Capote and Perry Smith (coincidentally, Daniel Craig played Smith in \"Infamous\") - except that \"Love is the Devil\" is visceral, surreal and dark like Francis Bacon's world was, and Bennett Miller's acclaimed \"Capote\", a good, albeit overrated, film with a spectacular performance by Philip Seymour Hoffman, was more concerned about being elegant and palatable than being closer to the truth. Bacon and Capote were talented, troubled men, with huge ego issues, who were partly responsible for their respective lover's (Dyer)/ protégé's/victim? (Smith) ruin - and, later, for their own. Had John Maybury been like Bennett Miller and turned Bacon's life into an 'elegant' flick, we'd have an Oscar contender here; thankfully he did not, and we got a brave little film that is hard to watch because it's such a visceral painting of an unsettling world. Jacobi and Craig are phenomenal, and the always fantastic Tilda Swinton has a small part as one of Bacon's friends. Well done, Mr. Maybury. 8/10.",
         "'Love is the Devil' captures one crucial decade in the life of the English painter, Francis Bacon, considered by many, for the half century after World War II, the world's greatest living painter. This decade, the 1960s, is reflected through Bacon's relationship with a young hood, George Dyer, whom he first encounters ineptly breaking into his studio, and whom he immediately sleeps with. A depressive suffering constant nightmares, Dyer is wined and dined by the artist, initiated into his bitchily hostile coterie of friends, and gradually neglected as Bacon concentrates on his work. Many of the astonishing paintings from this period evince a great understanding and love of their principle subject, Dyer, and one friend notices that Bacon puts more effort into representing his love on paint than into the relationship itself. Dyer becomes increasingly suicidal. Bacon has one of the most distinctive oeuvres in the history of art. Although he absorbed many influences, most obviously Picasso and the Surrealists, a Bacon painting is immediately recognisable. For fifty years, his style barely changed, as he concentrated, compressed and developed a recurring set of obsessive motifs - mangled bodies and distorted, often indistinguishable heads and faces, mouths screaming, against restrained, geometric backgrounds, an ordinary English room, a ritual theatre or circus space etc; an alternation between lurid, violent colours and muted, banal ones; props, such as light bulbs, lavatories, mirrors, meat, especially meat. He was very interested in the fragmentation of the image, the disjunction between subject and reflection, for example, or subject and shadow. Maybury, also an artist, tries to shoot his narrative in the style of Bacon - the film's subtitle, echoing the artist's own non-emotional, mock-technical practice, is 'Study for a Portrait of Francis Bacon'. All the motifs are here - the narrative opens with a hand putting a key in a lock as if the film will provide the key to the enigma of Bacon's life. There are many triple-mirror shots of Bacon, alluding to his favourite form, the triptych. Camera effects try to recreate the state of physical distortion, stretching, blurring, splitting, that characterises Bacon's figures. Dyer's first appearance, falling through a skylight into Bacon's studio, is transformed into one of Bacon's despairing fantasies, Dyer suspended in the dark, falling through a lot more than a roof. Specific paintings are recreated, most successfully in the sex scenes, with their violent, combatorial, yet private and intimate rituals. The bar scenes with Bacon's ghastly friends are a grotesque freakshow. Whether or not this method works - and I don't think it does: film and painting are mutually exclusive media, the transfer from one to the other is often bathetic - Maybury must eventually settle into a narrative if he wants to keep any kind of an audience. Unfortunately, the need to tell stories was precisely the shackle Bacon wanted to cast off. And so there isn't really a narrative, there is no sense of progress in the central characters' relationship, except that Dyer begins it alive and ends it dead. There is no attempt to give the flavour of their life together. The film only really works if you are familiar with Bacon's work. You can spot the allusions and reworkings. But this doesn't lead to any greater understanding of the work, beyond a hackneyed life-informs-the-art model, one Bacon himself strenuously denied. This solipsism is thoroughly in keeping with Bacon's art. The film is full of his wisdom, narrated by Jacobi, undigestible when just rattled off. As I have suggested the world is made over completely in his sensibility, even the scenes from which he is absent. This sense of claustrophobic privacy is a major effect of the art - there is little difference between the works of the 1940s and 80s, except perhaps for greater technical skill. Maybury misses an opportunity to put history back into Bacon's ahistorical oeuvre, to rescue him from vague expressions of horror and despair. You would have no idea the film was set in the 1960s, no idea about the major social changes of the time, or even the changes in art appreciation (although the film is mercifully free from homosexual-guilt/fear angst). If you have read a biography of Bacon, as I recently have, much of the film will seem jarring in the way watching 'Casablanca' or reading 'Hamlet' is, anecdotes rendered verbatim, adding to the film's unreal, unhelpful atmosphere.",
         "This film will insinuate itself into the images under your closed eyelids. Meat, blood, cuts, scars, wounds, assassinations, executions, dismemberments, car accidents, beatings, and burnings will all rush together in an explosion of pain, longing, and unsatisfied hungers. Homosexual sado-masochism, not gay love. The absolute evil of pure genius. A paint brush slashes the spirit as a razor, the body. The tormented torments; the masochist punishes the sadist. Flesh is set aflame with a cigarette, not a kiss. Francis Bacon is the one true artist of the postwar era. He understood that humanity had irrevocably crossed the barrier between reason and madness. This film casts us into the abyss of the collective unconscious where we may swim or be burned to a crisp. Hold your eyelids open with sharp orange toothpicks and suck on the bloody images. Watch the film five times and then seek out Bacon's work, at least in books, if not in museums. Perhaps then your unspoken thirst may be quenched and you will grasp the 20th Century before you plummet into the 21st.",
         "This is a film about relationships, relationships which flow over and between Bacon's life and work. I come away from the film knowing much more than I ever knew and felt about Bacon and his work, and also the period in which he worked. I would liked to have seen much more of the famous (or should that be infamous) \"Colony Room\" where Bacon done his drinking and socialzing. Daniel Craig is spot on as the East End spiv and petite crook. Tilda Swinton plays the hilariously foul-mouthed Muriel Belcher and I am sure that Belcher would make make a good central character in another film. The film is not about Bacon's paintings, but the man himself. His relationships his world. London could never ever been as seedy as this but what a great place to search out life.",
         "This movie is a portrait of British painter Francis Bacon (played by Derek Jacobi) in the 1960s. In the beginning of the movie, a young man named Dyer (Daniel Craig), intent on burglarizing Bacon's flat, has a misstep and falls into his art studio. Bacon approaches him and...asks him to come to bed with him! Dyer agrees and this is the beginning of their tumultuous romantic and complex sexual relationship. This movie is really a focus on a relationship between people that are polar opposites. Bacon is a slightly mad artistic genius in his 50s, with snobby pretentious friends. Dyer is a naive 20 something working-class man who drinks too much. The only thing they have in common seems to be that Dyer's horrifying and bloody nightmares are very similar to Bacon's twisted paintings. As Bacon becomes more involved with his work and their differences become more pronounced, Dyer finds himself in a dark downward spiral. The scenes in this work like little vignettes. They are simultaneously visually stunning and repulsive--it is often like watching a painting that moves. The story is rather boring, but this movie is definitely worth seeing for its fantastic cinematography and frightening visuals. It looks like a nightmare come to life. My Rating: 6/10."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["British Broadcasting Corporation (BBC)"],
      "summaries": [
         "In the 1960s, British painter Francis Bacon (1909-1992) surprises a burglar and invites him to share his bed. The burglar, a working class man named George Dyer, 30 years Bacon's junior, accepts. Bacon finds Dyer's amorality and innocence attractive, introducing him to his Soho pals. In their sex life, Dyer dominates, Bacon is the masochist. Dyer's bouts with depression, his drinking and pill popping, and his satanic nightmares strain the relationship, as does his pain with Bacon's casual infidelities. Bacon paints, talks with wit, and, as Dyer spins out of control, begins to find him tiresome. Could Bacon care less?",
         "Biography of British painter Francis Bacon focuses on his relationship with his lover, George Dyer, a former small time crook."
      ],
      "budget": 0
   },
   "movielensId": 2304,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-16",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["John Maybury"],
      "runtime": 90,
      "movieId": 2304,
      "title": "Love Is the Devil: Study for a Portrait of Francis Bacon",
      "mpaa": "",
      "actors": [
         "Derek Jacobi",
         "Daniel Craig",
         "Tilda Swinton",
         "Anne Lambton",
         "Adrian Scarborough",
         "Karl Johnson",
         "Annabel Brooks"
      ],
      "imdbMovieId": "0119577",
      "originalTitle": "Love Is the Devil: Study for a Portrait of Francis Bacon",
      "genres": [
         "TV Movie",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Biography of the British painter Francis Bacon. The movie focuses on his relationship with George Dyer, his lover. Dyer was a former small time crook.",
      "tmdbMovieId": 4975,
      "avgRating": 3.39344,
      "releaseYear": "1998",
      "numRatings": 122,
      "posterPath": "/wRYFf3o6JP4ezL5Ci8yF8m7EHf6.jpg"
   }
}