{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "private school",
            "id": 3551
         },
         {
            "name": "lone wolf",
            "id": 3568
         },
         {
            "name": "theatre play",
            "id": 4326
         },
         {
            "name": "theatre group",
            "id": 4333
         },
         {
            "name": "theater director",
            "id": 6521
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "precocious child",
            "id": 162936
         }
      ],
      "imdb_id": "tt0128445",
      "video": false,
      "title": "Rushmore",
      "recommendations": [
         421,
         4538,
         13685,
         9428,
         83666,
         10315,
         8051,
         1548,
         2757,
         6418,
         290,
         334,
         10707,
         9675,
         9571,
         4995,
         11368,
         378,
         2292,
         401
      ],
      "backdrop_path": "/qPjOUMmEeJFRq0BWcGRvgVwuh0O.jpg",
      "revenue": 17096053,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Max Fischer",
               "gender": 2,
               "credit_id": "52fe44569251416c7503137b",
               "name": "Jason Schwartzman",
               "profile_path": "/3WDQYEqcqZDp5mOhDN8XSo0NVUK.jpg",
               "id": 17881,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Rosemary Cross",
               "gender": 1,
               "credit_id": "52fe44569251416c75031383",
               "name": "Olivia Williams",
               "profile_path": "/sFPpzOuDOLyB0YmTstS7MTSzEb6.jpg",
               "id": 11616,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Herman Blume",
               "gender": 2,
               "credit_id": "52fe44569251416c7503137f",
               "name": "Bill Murray",
               "profile_path": "/7BOoOAIA1CnSzFSVSJP7saniQaB.jpg",
               "id": 1532,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Bert Fischer",
               "gender": 2,
               "credit_id": "52fe44569251416c75031387",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Dirk Calloway",
               "gender": 2,
               "credit_id": "52fe44569251416c7503138f",
               "name": "Mason Gamble",
               "profile_path": "/gcWwvfZLxvk8VH6NEjfmt7j87aR.jpg",
               "id": 15252,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Dr. Nelson Guggenheim",
               "gender": 2,
               "credit_id": "52fe44569251416c7503138b",
               "name": "Brian Cox",
               "profile_path": "/m15C58NWii5WCIg57Llr7hejnfy.jpg",
               "id": 1248,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Margaret Yang",
               "gender": 1,
               "credit_id": "58e312ae92514127f0016eda",
               "name": "Sara Tanaka",
               "profile_path": null,
               "id": 239981,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Mrs. Calloway",
               "gender": 1,
               "credit_id": "52fe44569251416c75031393",
               "name": "Connie Nielsen",
               "profile_path": "/lvQypTfeH2Gn2PTbzq6XkT2PLmn.jpg",
               "id": 935,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Dr. Peter Flynn",
               "gender": 2,
               "credit_id": "52fe44569251416c75031397",
               "name": "Luke Wilson",
               "profile_path": "/n7CRA7h1z3FVOzBJ5EjfSrPQbvl.jpg",
               "id": 36422,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Magnus Buchan",
               "gender": 2,
               "credit_id": "52fe44569251416c7503139f",
               "name": "Stephen McCole",
               "profile_path": "/lS0Em0b2kaEJ5hXIYMU10iN9Fdf.jpg",
               "id": 71770,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Mr. Littlejeans",
               "gender": 2,
               "credit_id": "58e312c5c3a36872ee0174ca",
               "name": "Kumar Pallana",
               "profile_path": "/emTPxZIt9j8d4FcKMSpX3eDq0tO.jpg",
               "id": 8690,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Student",
               "gender": 1,
               "credit_id": "58e312d092514127f0016ef5",
               "name": "Alexis Bledel",
               "profile_path": "/wDmAugqi4zYonm2hxI6PgsE7WJD.jpg",
               "id": 6279,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Coach Beck",
               "gender": 2,
               "credit_id": "52fe44569251416c7503139b",
               "name": "Andrew Wilson",
               "profile_path": "/s7VBLMZtTNeeSjaJa8PG43aJfuE.jpg",
               "id": 71555,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44569251416c75031341",
               "name": "Wes Anderson",
               "profile_path": "/s03CeUeC5yAXyB1acqP0zGNo2SC.jpg",
               "id": 5655,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c75031347",
               "name": "Wes Anderson",
               "profile_path": "/s03CeUeC5yAXyB1acqP0zGNo2SC.jpg",
               "id": 5655,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c7503134d",
               "name": "Owen Wilson",
               "profile_path": "/j7oYgvfDiO34VcFdSB7GhM2CSle.jpg",
               "id": 887,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c75031353",
               "name": "Owen Wilson",
               "profile_path": "/j7oYgvfDiO34VcFdSB7GhM2CSle.jpg",
               "id": 887,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c7503135f",
               "name": "Barry Mendel",
               "profile_path": null,
               "id": 5664,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c75031365",
               "name": "Paul Schiff",
               "profile_path": null,
               "id": 18344,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c7503136b",
               "name": "Mark Mothersbaugh",
               "profile_path": "/AoQ4Prrg039LlQiwBNANXn8VVkg.jpg",
               "id": 5666,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c75031371",
               "name": "Robert D. Yeoman",
               "profile_path": null,
               "id": 5667,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44569251416c75031377",
               "name": "David Moritz",
               "profile_path": null,
               "id": 5668,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5aa51fe50e0a26075d0236b4",
               "name": "Melissa Matthies",
               "profile_path": null,
               "id": 1995909,
               "department": "Art",
               "job": "Property Master"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 10.939217,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11545,
      "vote_count": 853,
      "budget": 9000000,
      "overview": "When a beautiful first-grade teacher arrives at a prep school, she soon attracts the attention of an ambitious teenager named Max, who quickly falls in love with her. Max turns to the father of two of his schoolmates for advice on how to woo the teacher. However, the situation soon gets complicated when Max's new friend becomes involved with her, setting the two pals against one another in a war for her attention.",
      "similar": [
         112160,
         866,
         10229,
         449176,
         376867,
         11421,
         43923,
         16367,
         13193,
         9270,
         692,
         1716,
         26371,
         8669,
         10050,
         546,
         24584,
         36040,
         659,
         237791
      ],
      "original_title": "Rushmore",
      "runtime": 93,
      "poster_path": "/q3ov1BFTCRWoR9Q6udaRbmgfWwg.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1998-09-17",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "Love. Expulsion. Revolution.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Wes Anderson"],
      "runtime": 93,
      "synopsis": "The film centers on Max Fischer (Jason Schwartzman), a precocious and eccentric 15 year-old, who is both Rushmore's most extracurricular and least scholarly student; Herman Blume (Bill Murray), a disillusioned industrialist who comes to admire Max; and Rosemary Cross (Olivia Williams), a widowed first grade teacher who becomes the object of both Max's and Herman's affection. Max's life revolves around Rushmore Academy, where he is a scholarship student. Max spends nearly all of his time on elaborate extracurricular activities, caring little how it affects his grades. He also feuds with the school's headmaster, Dr. Guggenheim (Brian Cox). Blume finds his operation of a multimillion dollar company to be unsatisfying and is frustrated that his marriage is failing and the two sons he's putting through Rushmore are unrepentant brats. He and Max become close friends; Max admires Herman's success while Herman is impressed by Max's cocksure attitude. Ms. Cross arrives at the academy as a new teacher after the death of her husband (and former Rushmore student), and Max quickly develops an infatuation. He makes many attempts at courting her. While she initially tolerates Max, Ms. Cross becomes increasingly alarmed at his obvious obsession with her. Along the way Blume attempts to convince Max that Ms. Cross is not worth the trouble, only to fall for Rosemary himself. They begin dating without Max's knowledge. After Max attempts to break ground on an aquarium without the school's approval, he is expelled from Rushmore. He is then forced to enroll in his first public school, Grover Cleveland High. Attempts to engage in outside activities at his new school have mixed results. A fellow student, Margaret Yang (Sara Tanaka), tries to engage Max, but he pays little attention to her. Rosemary and Blume attempt to support him in his new school. Eventually, Max's friend Dirk (Mason Gamble) discovers the relationship between Rosemary and Blume and informs Max as payback for a rumor Max started about his mother. Max and Blume go from being friends to mortal enemies, and they engage in back-and-forth acts of revenge on each other. Max informs Blume's wife of her husband's affair, thus ending their marriage. Max then puts bees in Blume's hotel room, and then Blume destroys Max's bicycle with his car. Max also cuts the brake lines on Blume's car, for which he is arrested. Eventually Max gives up and explains to Blume that revenge no longer matters because even if he (Max) wins, Rosemary still would love Blume. Max then becomes depressed and stops attending school. He cuts himself off from the world and works as an apprentice at his father's barber shop. One day, Dirk stops by the shop to apologize to Max and bring him a Christmas present. In the process, Dirk suggests Max see his old headmaster in the hospital, knowing Blume will be there, as well. Max and Blume meet and are cordial, and Max finds out that Ms. Cross broke up with Blume. He also manages to bring Dr. Guggenheim out of his coma. Max begins to apply himself in school again. He also develops a friendship with Margaret Yang, whom he casts in one of his plays. Max takes his final shot at Ms. Cross and is rebuffed again. Max makes it his new mission to win Ms. Cross back for Blume. His first attempt is unsuccessful, but then he invites both Herman and Rosemary to the performance of a play he wrote, making sure they will be sitting together. In the end, Ms. Cross and Blume appear to reconcile. Max and Margaret Yang also become a couple. The movie ends with Max and Ms. Cross looking at each other enigmatically as they share a dance at the play's wrap party.",
      "writers": [
         "Wes Anderson",
         "Owen Wilson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0128445/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2OTc3OTk2M15BMl5BanBnXkFtZTgwMjg2NjIyMDE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jason Schwartzman, Bill Murray, Olivia Williams | See full cast and crew »"],
      "reviews": [
         "Rushmore was the first Wes Anderson film I saw, and I didn't think much of it the first time. I used to think that Royal Tenenbaums was Anderson's first good film. I thought Bottle Rocket wore its rookie status on its sleeve; I thought Rushmore was flawed; and I thought Tenenbaums finally showed that Anderson had honed his craft and he would start making great films. I then re-watched Tenenbaums and found it to be even more satisfying on additional viewings. I realized that Anderson had actually crafted one of those rare pieces of cinema that reveals itself more and more upon repeat viewings. So I of course decided to give Rushmore a second look. Now that I've had a chance to see the DVD, I've had a much different experience viewing the film. Perhaps because I saw it on Pan and Scan VHS previously? Or perhaps because Anderson's vision requires an adjustment period? Some people will never like Anderson's films. They simply will not appeal to those out there who want clichéd Hollywood fodder. Some people will love Anderson's films from the moment they see them. Others, like myself, will need to see the films more than once to truly appreciate them. Anderson breaks convention in ways no one has done before - One has to understand that his films are deep where most films are shallow, and shallow where most films are deep. This will throw A LOT of people off, as evidenced by many of the comments on the message boards. Anderson's films begin where others end. In Rushmore, we see Max's fall from grace, not his climb up to become head of every club in his school. In Tenenbaums, we see the aftermath of the child prodigies, not their glory years. Again, this will throw a lot of people off, and indeed I heard this criticism of Tenenbaums quite a lot. Anderson constructs the world of his films around a cinema storybook. They are episodic, told in chapters. Some will find Anderson at first glance to be a rather egotistical filmmaker, as I once did. However, upon second glance, you can begin to see the rich text woven deeper in the films that might be hidden beneath quirkiness or drastic breaks from convention. The first time I saw Rushmore, I felt shock, embarrassment and confusion (Mostly at Max and Rosemary's bizarre interaction). I was lost and unfamiliar with this world Anderson has created. The second time I saw the film I felt Passion, Love, Tragedy and ultimate Redemption. I found the heart in Anderson's film. If you felt Rushmore was not all it could have been the first time you saw it, please give it another chance. You'll find which side you fall on.",
         "One of the greatest films ever? I don't think that's an understatement, and I'm not just saying it cause I'm a Bill Murray fan and he happens to be in it. Granted, he brings to the movie his usual subtle quirkiness, but that humor isn't out of line with the general mood of the film. The whole thing is seriously funny and somehow seriously real, but at the same time doesn't always take itself seriously. Seriously. The idea of the movie doesn't come off sounding like a very captivating plot: high school geek and middle-aged millionaire fall in love with the same first grade teacher. Not exactly material for a high-grossing box office hit. But I don't think plot necessarily matters when it comes to making a quality film. It has a fantastic script, believable character development, and top-notch acting, and that's what counts in making a memorable film. Why do we love Rushmore? Max and Mr. Blume are the same person, Mr. Blume is just older and wealthier. They are both creative, romantic characters whose motives are ultimately selfish. My guess is if you appreciate this film, it's probably because you're the same way. This movie is about us. We are the boys who do everything we want to and nothing we're supposed to. The ones who go to college and get by on as little effort as possible, but somehow still pull through. At one point or another we all believed we could make our fantasies a reality, and watching this film makes us optimistic about those things again. Also, I don't think a soundtrack makes a film, but it can certainly help set the mood. Yes, I have to agree with the other commenters for Rushmore: great soundtrack. But you already know that and it's been said a hundred times, so I think I'll just leave it at that and not beat it into the ground any more than it already has. Right. Good movie, watch it if you haven't yet.",
         "Wes Anderson's Rushmore is a movie full of everything that modern day cinematic crap movies lack; dry humor, unique writing, music that makes a scene unforgettable, and real heart. I feel as though Rushmore is cinematic excellence, Max Fischer is the perfectly flawed yet absolutely brilliant character who tries to find his place in the world, whether it's by engrossing himself in extracurricular activities or pretending he's the son of a neurosurgeon. All of the characters are finely tuned, Herman Blume is a successful man who feels worthless, Miss Cross is a brilliant woman who feels only sorrow because of the loss of her husband. But it is their flaws that make them so wonderful, they aren't boxed into labeled packages, they are raw and real human beings who are just trying to survive. This movie is about, as Max says, finding out what you love and doing it for the rest of your life. The camera angles in this film are interesting, connecting you to the environment and the characters. Wes Anderson picks the perfect music for each scene, especially for the heartbreaking scene at the end when Miss Cross and Max are dancing to the Faces \"Ooh la la.\" But, what's most brilliant about Rushmore is how it makes you feel; pessimistic yet hopeful, sad yet joyful, confused yet clear-minded. A good movie makes you think but a great movie changes your perspective on the world and this is what Anderson has done. To quote Cousteau, as Miss Cross did in the Diving for Sunken Treasure book, \"When one man, for whatever reason, has the opportunity to lead an extraordinary life he has no right to keep it to himself,\" and I'm glad that Wes Anderson created such an extraordinary movie and shared it with us all.",
         "I think if you're looking for a straight up comedy, you'll be disappointed. This is not an easily classifiable film, but one that I love for its unique spin on some interesting characters. I especially like the fact that Max is not completely lovable, but in the end you root for him anyway. I found all the various reconciliations quite touching, and there's an interesting emphasis on friendships between people with lots of differences. Max's sidekick is younger than him, his crush is on a teacher much older, his friendship with Bill Murray's character who could be his father. Lots of heart here.",
         "This is a love it or hate it kind of movie. I've watched this movie with people with a like-minded sense of humor and they always have a polarized reaction to it. Love it or hate it. Personally, it's in my top 10 movies. Max Fischer is the quintessential oddball kid. A phenom of extracurricular activities but still gets bad grades. He lacks social skills yet is bold enough to say what's on his mind. The genius of this film is how Anderson writes dialogue for his characters as adults but has kids saying the lines. Dirk steals the scenes as he confronts Bill Murray and spits on his car, plays a gun touting nun in Max's version of \"Serpico\" and is the cigarette smoking point man in the final play. Anderson has a great talent for having his characters be odd, yet still plausible. He can really balance that mix, yet still tell a story from his skewed reality. I hope I'm making sense because I just had six shots of whiskey and two Benydril and am nodding off. LOL. Anyway, this movie is about the pain of growing up, the pain of loneliness, the happiness of friendship, the ugliness that we are all capable of and ultimately for Max, redemption. The scene where Max grabs a hold of the yellow kite and starts to get it all back together is great. Back dropped by Cat Steven's \"The Wind\", it's a wonderful meeting of film and music. Anderson has a knack for that. Great soundtrack all around. The closing scene is equally terrific. If you hate this movie, trust me, I understand...I hated it too. It wasn't until I saw it a second time that I saw it in a different light. It's a pretty special movie about growing up and forgiveness. If you happen to rent this, try to get the Criterion Edition; a lot of great extras in there. One last thought, Bill Murray gives a great, great performance as well as Olivia Williams, who, IMO, should had gotten an Oscar nod as well. OK, sleepy time...zzzz",
         "There's no real reason to critique this film because it's as close to perfect as any movie can get. Plus, it has been reviewed over 500 times on this site alone. One important aspect of this film, which is overlooked in practically every online review that I've read, is Wes Anderson's nod to the world of J.D. Salinger. The parallels between Holden Caulfield and Max are numerous, and when considered in light of THE ROYAL TENENBAUMS (with its scenes at the museum and the b.b. gun battles), the canon of Wes Anderson is one that has been greatly colored by the imagination of J.D. Salinger. From Max's red hat to his expulsion, the film touches on many ideas from THE CATCHER IN THE RYE. Thematically, the works are quite similar and share an idiosyncratic mood. The other great influence on Wes Anderson, which is even more obvious to any student of film, is the work of Hal Ashby. In particular, the symmetry of Hal Ashby's shots in films like HAROLD AND MAUDE and BEING THERE. Watch RUSHMORE followed by HAROLD AND MAUDE followed by ROYAL TENENBAUMS followed by BEING THERE and you'll completely understand this sentiment. Where will THE LIFE AQUATIC fit into this equation?!?!?",
         "Max Fischer has a scholarship to exclusive prep school Rushmore, despite the fact that he really isn't as smart as his demeanour would suggest. He relentlessly talks himself up, forms and joins clubs and seems to impress as many people as he annoys \u0096 all with a very thin veil of lies to support it. When he falls in love with a teacher (Rosemary Cross) things appear wonderful but it is not long before he has messed it up. His frustrated friend (Herman Blume) tries to help but only succeeds in making things much, much worse and Max risks losing everything that is important to him. Having recently see The Life Aquatic etc I decided to step back to a film that I feel did Wes Anderson's humour and talent much more of a service and one in which he got the mix just right. To me Rushmore is that film, although this is not to imply that it will appeal to those that just don't like any of his films. The plot is the usual mix of offbeat characters, strange events and deep seated emotions (and usually not happy ones either), it is quirky and humorous but it still works because, unlike Life Aquatic, it has enough heart and plot to balance out the dark quirky humour. To me the story is still a bit strange and difficult to get into but it does the hard work for you and even when I was still getting into it I was interested if not totally involved. The heart of the story is not one I could relate to, but I was able to feel for the characters and got into it quickly as a result \u0096 none of them are instantly likable characters or simple ones but they are still well written and delivered. The humour is never really consistently hilarious but to complain about a lack of belly laughs is to miss the point; for me the dark humour was well done and I found the film funny even when it didn't draw laughs from me. The cast are impressive and work well with the material they are given. Murray has much more meat in this supporting role than he did with Zissou and he does very good work with it throughout while also managing to carry off his deadpan delivery as well as usual. Schwartzman is spot on with a character that we are never able to truly like but have to get behind at the same time \u0096 he pitches it just right and shows a great understanding of his character. Williams is beautiful and vulnerable and works well in her role while support is good from Cox and Cassel as well as several others in support roles and cameos. Special mention to Tanaka for being the sweetest redemption I've seen in many a film and pulls off the geeky but wonderful girl of many of our dreams. Overall this is a good film but not one that will appeal to the majority of viewers or be the one to win over those that just don't like Wes Anderson's films. The plot and characters are interesting throughout and the film succeeds because it manages to mix emotional content with darkly quirky humour rather than doing one at the expense of the other. An enjoyable film and probably my favourite from Anderson thus far.",
         "Overextended rather than overlong, this is still, along with A BUG'S LIFE, the best American film of the year. Sadly, this has been an atrocious year for movies, so that isn't saying much (being Europeans, we still haven't seen EYES WIDE SHUT or THE BLAIR WITCH PROJECT, so there's still hope). There has been no outstanding, awe-inspiring, terrifying, beautiful, blow-everything-out-of-the-water film this year, no PULP FICTION, THE USUAL SUSPECTS or HEAVENLY CREATURES. The main problem with new films is style. Because style has been reduced to empty, showy Lelouchisms, intelligent directors, like Solondz or Labute, have rejected style altogether; and their rather flat, dull compositions can detract from the undoubted brilliance of their content. RUSHMORE has style in spades. RUSHMORE is (on the surface at least) a very intelligent film. It is the kind of film my spouse would dismiss as 'a young man's film', but then so, apparently, was A BOUT DE SOUFFLE. The comparison is not gratuitous. There is a glorious, gleeful, freewheeling joy in cinema here that carries the film for the first hour, reminiscent of the early Nouvelle Vague, and Richard Lester. It's odd how these old devices - and there are also echoes of Chaplin, Keaton, the Marx Brothers, Tati and Woody Allen in here too - should seem so fresh and new. Has cinema stagnated so far? Most modern US (indie) film is stagy, rigid, overcomposed. This film uses all the old tricks to show life being lived, not an imposed thesis. As I suggested, the film is probably intelligent. I say probably, because this is not its main interest. It does interesting things with Oedipal conflicts - there are at least five father/son relationships in the film (Max/Bert, Max/Dirk, Max/Hermann, Hermann/sons, Max/Edward Appleby), most of which are put under pressure, if not outright hostile, but resolved in unexpected ways. There is the influence of the dead on the living, unwritten stories intruding on those trying to write their own lives. There is the idea of Rushmore as a conservative, Brideshead-like arcadia, wherein also lies betrayal and death. The whole Ivy League (or whatever second level's called over there) system is debunked: whereas Rushmore will accept any trash as long as they're white, Max's multi-racial public school seems a much more vital place. What is great about this film is not these things, but its understanding of and sympathy for adolescent experience. The most obvious marker of this is self-dramatisation, and there is strong evidence (the theatre curtains that open each section; Max's facility as a playwright; the repetition of portraits and framings within the film) that this is not an 'objective' story, but Max's highly mediated view of his own life. The film is sprightly, energetic, hilarious and inventive when he is on top of life, sluggish and dour when he is depressed. This actually makes his pain even more moving, and why he can sympathise with Hermann throughout on an emotional level, even when he needs to hate him on a narrative one. Bill Murray gives the year's outstanding performance, which will hopefully be ignored at the Oscars - there is such depth to his angst, such humour to his self-lacerating millionaire, a self-made man who tragically sees himself as a loser. Few actors today can be so heartbreaking while seeming to do so little. And people still think Meryl Streep is an actress. It is Jason Schwarzmann, though, who must carry the film, and he is perfect - brave, enterprising, irritating, vital. His romantic object is rather a drip, as adolescent idealisations generally are, and her swearing wake-up call is suitably shocking. Brian Cox is hilarious as a gruff, though sympathetic, headmaster, whose fate again suggests youthful wish-fulfillment. The use of music is as inventive as any great film I've seen. The film is actually quite bleak, and we can only thank our stars that Max isn't a goth - his doomed inventiveness staves of despair. Wonderful.",
         "Yeah, I got the joke. I've seen all the Wes/Owen vehicles, and tolerated most of them. Bottlerocket was fantastic, Royal Tennanbaums and Life Aquatic less so. In fact, when it was a few years after I saw this on DVD that I realized it was the team whom to that point had admired as decent filmmakers.I just couldn't get the hang of this disaster. Judging from the slew of 10's, this movie has endeared itself to a great many viewers, but for me it was a misfired dark 'comedy' mired in quirky forced situations and unrealistic characters and dialogue. I was particularly annoyed at how Max's character was written and executed. He was painfully irritating, and the contrived love situation did nothing except throw in a convenient plot point for dramatic effect. Bill Murray is competent, but could not save the film. So shoot me.",
         "Very rarely can a director evoke so much awkwardness and kindness from his/her silent moments in their films. Wes Anderson is one filmmaker who can. His characters are so richly drawn, finely acted and beautifully directed, that even when they're not speaking... we can read their emotions, we feel their pain. Young Jason Swartzman gives a fantastic performance. Even nicer is the surprise turn by Bill Murray, who manages to play a good guy and a villain at the same time. In one scene he is wearing Budweiser boxer shorts on a diving board. He is smoking a cigarette and jumps, doing a cannonball into his sewer-ridden pool. We see him curled up at the bottom of his pool, drowning himself in misery. Is this a connection to his future lover's dead husband? Who knows. But what we do know is that Anderson has crafted his film to star the most unlikely of heroes. They are the oddest of the bunch, but at the same time we know what they are going through. Their oddness aside, what we learn to see more of, is their hearts. It is obvious Anderson has wiped his heart all over this piece, and it pays off more than I'm sure he ever could have imagined."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "American Empirical Pictures",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Max Fischer is a precocious 15-year-old whose reason for living is his attendance at Rushmore, a private school where he's not doing well in any of his classes, but where he's the king of extracurricular activities - from being in the beekeeping society to writing and producing plays, there's very little after school he doesn't do. His life begins to change, however, when he finds out he's on academic probation, and when he stumbles into love with Miss Cross, a pretty teacher of the elementary school at Rushmore. Added to the mix is his friendship with Herman Blume, wealthy industrialist and father to boys who attend the school, and who also finds himself attracted to Miss Cross. Max's fate becomes inextricably tied to this odd love triangle, and how he sets about resolving it is the story in the film.",
         "Max is a homely 10th-grade scholarship boy at Rushmore, a private school where he fails classes but constantly organizes clubs and plays. He befriends a depressed local factory magnate, Blume, and falls for a recently widowed teacher, Ms. Cross. When a scheme gets him expelled, he tries his Rushmore style at the local high school. He ignores the proffered friendship of a student, Margaret, to pursue the unattainable Ms. Cross. Max discovers Blume also loves her; he seeks vengeance, Blume retaliates, war ensues, and Max's troubles deepen. Rescue comes from unexpected places, including his sweet father, a barber. Can Max accept a realistic place in the world?",
         "Max Fischer is a more than determined student at his prep school, Rushmore Academy where he oversees anything with the word \"extra-curricular\". He befriends a preschool teacher named Ms. Cross, whom he ends up falling in love with. Only to find things take a turn for the worst when his mentor, Herman Blume, an unhappy millionaire falls for her as well. As a result, their personal and professional lives spiral out of control.",
         "The extracurricular king of Rushmore preparatory school is put on academic probation."
      ],
      "budget": 11000000
   },
   "movielensId": 2395,
   "movielens": {
      "languages": [
         "Français",
         "English",
         "Latin",
         "Español"
      ],
      "releaseDate": "1998-09-17",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Wes Anderson"],
      "runtime": 93,
      "movieId": 2395,
      "title": "Rushmore",
      "mpaa": "R",
      "actors": [
         "Jason Schwartzman",
         "Olivia Williams",
         "Bill Murray",
         "Seymour Cassel",
         "Mason Gamble",
         "Brian Cox",
         "Sara Tanaka",
         "Connie Nielsen",
         "Luke Wilson",
         "Stephen McCole",
         "Kumar Pallana",
         "Alexis Bledel",
         "Andrew Wilson"
      ],
      "imdbMovieId": "0128445",
      "originalTitle": "Rushmore",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["4i6N09QIiFs"],
      "plotSummary": "When a beautiful first-grade teacher arrives at a prep school, she soon attracts the attention of an ambitious teenager named Max, who quickly falls in love with her. Max turns to the father of two of his schoolmates for advice on how to woo the teacher. However, the situation soon gets complicated when Max's new friend becomes involved with her, setting the two pals against one another in a war for her attention.",
      "tmdbMovieId": 11545,
      "avgRating": 3.83782,
      "releaseYear": "1998",
      "numRatings": 16577,
      "posterPath": "/q3ov1BFTCRWoR9Q6udaRbmgfWwg.jpg"
   }
}