{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "garbage",
            "id": 3700
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "toilet humor",
            "id": 9980
         }
      ],
      "imdb_id": "tt0093072",
      "video": false,
      "title": "The Garbage Pail Kids Movie",
      "recommendations": [
         85188,
         29345,
         76177,
         215760,
         108878,
         36837,
         107430,
         85880,
         29114,
         40027,
         31245,
         40729,
         41972,
         3072,
         43749,
         19719,
         27549,
         17923,
         81887,
         38499
      ],
      "backdrop_path": "/6mlk46ePJCq2E6nKK4O3xVbPyqm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Captain Manzini",
               "gender": 2,
               "credit_id": "52fe45f49251416c7506831f",
               "name": "Anthony Newley",
               "profile_path": "/qgIIdT8QN7z6lJdOM7easJNyOX2.jpg",
               "id": 81409,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Dodger",
               "gender": 2,
               "credit_id": "52fe45f49251416c75068323",
               "name": "Mackenzie Astin",
               "profile_path": "/vmcRaz9K4cX4iOUcMSHsLcw0Two.jpg",
               "id": 60060,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Tangerine",
               "gender": 0,
               "credit_id": "52fe45f49251416c75068327",
               "name": "Katie Barberi",
               "profile_path": "/4wVFyYZUFSLhRV9aCb3zuZJ1tSI.jpg",
               "id": 81410,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Greaser Greg - Suit",
               "gender": 2,
               "credit_id": "52fe45f49251416c7506831b",
               "name": "Phil Fondacaro",
               "profile_path": "/3Ao8VPvlytIm3DWFffdSPxwxFdC.jpg",
               "id": 12662,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Juice",
               "gender": 0,
               "credit_id": "52fe45f49251416c7506832b",
               "name": "Ron MacLachlan",
               "profile_path": "/vrPBndxVTG3Yjj4w6W513DOPCPy.jpg",
               "id": 81411,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Wally",
               "gender": 0,
               "credit_id": "52fe45f49251416c7506832f",
               "name": "J.P. Amateau",
               "profile_path": null,
               "id": 81412,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Blythe",
               "gender": 0,
               "credit_id": "52fe45f49251416c75068333",
               "name": "Marjory Graue",
               "profile_path": null,
               "id": 81413,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Valerie Vomit - Suit (voice)",
               "gender": 1,
               "credit_id": "52fe45f49251416c75068337",
               "name": "Debbie Lee Carrington",
               "profile_path": "/xMynWwkjNbBJsiPdjs8aJ977oBq.jpg",
               "id": 19753,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Ali Gator - Suit (voice)",
               "gender": 2,
               "credit_id": "52fe45f49251416c7506833b",
               "name": "Kevin Thompson",
               "profile_path": "/pUKpoqEjQg7Isu0dJFBtootlWad.jpg",
               "id": 53760,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Foul Phil - Suit",
               "gender": 0,
               "credit_id": "52fe45f49251416c7506833f",
               "name": "Bobby Bell",
               "profile_path": null,
               "id": 81414,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Nat Nerd - Suit",
               "gender": 0,
               "credit_id": "52fe45f49251416c75068343",
               "name": "Larry Green",
               "profile_path": null,
               "id": 81415,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Windy Winston - Suit (voice)",
               "gender": 2,
               "credit_id": "52fe45f49251416c75068347",
               "name": "Arturo Gil",
               "profile_path": "/1t5hJScS6QKghM1gKsMp5IclTc0.jpg",
               "id": 81416,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Messy Tessie - Suit",
               "gender": 0,
               "credit_id": "52fe45f49251416c7506834b",
               "name": "Susan Rossitto",
               "profile_path": null,
               "id": 81417,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f49251416c7506830b",
               "name": "Rod Amateau",
               "profile_path": null,
               "id": 51809,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45f49251416c75068311",
               "name": "Linda Palmer",
               "profile_path": null,
               "id": 81408,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f49251416c75068317",
               "name": "Rod Amateau",
               "profile_path": null,
               "id": 51809,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.732408,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14443,
      "vote_count": 28,
      "budget": 0,
      "overview": "Seven disgusting kids but nevertheless of interesting personality are being made of the green mud coming out of garbage can. Once alive their master gives them rules to obey although they think that life is funnier without following stupid regulations like no television or no candy. Naturally this will cause some conflicts.",
      "similar": [
         7191,
         124905,
         872,
         109414,
         5876,
         339967,
         293167,
         39256,
         339530,
         62211,
         321612,
         588,
         408220,
         40761,
         841,
         12244,
         10674,
         32657,
         863,
         9732
      ],
      "original_title": "The Garbage Pail Kids Movie",
      "runtime": 100,
      "poster_path": "/xMgUWvNclNqUmedJyMHboZKIaUw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Topps Chewing Gum",
         "id": 53493,
         "origin_country": ""
      }],
      "release_date": "1987-08-22",
      "vote_average": 3.2,
      "belongs_to_collection": null,
      "tagline": "It doesn't get any grosser than this!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rod Amateau"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Linda Palmer",
         "Rod Amateau"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093072/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgwMTI2MjI0OV5BMl5BanBnXkFtZTcwOTU5OTgyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Anthony Newley, Mackenzie Astin, Phil Fondacaro | See full cast and crew »"],
      "reviews": [
         "This movie came on at around 6 AM on Cinemax this morning, and out of curiosity aroused from the fact that they would make a movie based on that utterly ridiculous card game, me and my friend sat down and decided to watch it. And almost instantly we were perplexed. Absolutely flabbergasted by the fact that a movie studio would go ahead and produce this movie. It is by far one of the most poorly written movies I have ever seen. The bizarre plot never seems to come together and make sense. The gags run utterly flat and actually tend to leave you with a sick feeling in your stomach. Not to mention one of the poorest makeup jobs in film history. As for the acting, one word can describe it: atrocious. The actors, with the exception only in some cases for Anthony Newley, seem to be doing nothing more than shouting their lines through the almost forced emotion, which comes over as horridly flat and unbelievable. If you're actually interested in this movie, I would go ahead and recommend it. A spectacle such as this film is something you rarely come upon.",
         "This movie is terrible!! One of the fascinating things about the cast is that the two main characters 'Dodger' and 'Tangerine' happen to look at least 8yrs apart, but are in fact only 12mths apart. The 'Garbage Pail Kids' themselves have awful costumes that are very poorly designed and really badly operated. The puppeteers need to be shot!! I decided to find this movie and watch it because I hadn't seen it since it first come out, and I was sure I enjoyed it as a kid- What was wrong with me!!! Save yourself a disappointing hour and a half....",
         "Everyone involved in the making of this movie, from the coke-vacuuming, muckraking scum who financed it to the gaffer's newest apprentice, is going directly to hell. This isn't just a bad movie. It's a psychotic, surreal journey into the realm of the profoundly grotesque. The Garbage Pail Kids themselves are terrible in their deformity, with exaggerated facial features and apparent elephantitis of the cranium making them hurtful to witness. Poorly-done animatronics make them all appear as if their facial muscles have been injected with lidocaine. They have a collective IQ of approximately 58. It's not pleasant to watch. It's not funny, it's not kitschy, it's not camp. The dialogue is pat and smarmy, the characters stupid and forgettable, and the whole slimy mess reeks of greedy bastards trying to make a fistful of money on the flavor of the week. TGPKM is another example of how depressingly low the common denominator really is...and this was BEFORE the reality TV craze. It hurts.",
         "As a lover of movies, I sat down to see The Garbage Pail Kids Movie after hearing from so many people how bad it was. Sometimes when I see \"bad\" movies, they are not so bad if mediocre,or movies that are so bad they're good, but there are other times when the movie that is supposed to be bad IS bad. This garbage belongs in the latter, it was so awful(in my opinion that is) that I didn't know whether to vomit or cry. I will give credit and say it is not quite the worst movie I have ever seen, but that isn't saying much. Firstly, I do have to agree with other reviewers that this is one of the poorly written kids movies out there. I know this movie is supposed to be bad and mindless trash, but the dialogue alone makes it not only bad, it makes it garbage. The dialogue is mega lame and not quotable at all, and I didn't laugh once. The humour was also very grotesque, I know the cards are quite grotesque, and movies like Freddy Got Fingered had grotesque and very unsubtle humour, but The Garbage Pail Kids Movie takes the whole meaning of the word \"grotesque\" to a whole new level and in a bad way. Plus the pranks are very mean-spirited, as is the knockabout violence. Then there is the story. What was the story again? To me, it had those talentless hacks Friedberg and Seltzer written over it, it is one of the most poorly constructed stories in a movie, with drawn out scenes, plodding pace you name it. Next, the production values, am I the only person who thought they were appalling? The sets were poor, the lighting was dim, the camera work was like direct to video quality, the special effects were laughable and the costumes were horrible. Don't get me wrong, I like 1980s fashion, it is funky and cool, but the costumes here made me want to gouge my eyes out. Even the soundtrack was awful. Generic, lifeless and uninspired, even worse than the music in Disaster Movie, which sounded like it had been made up on the spot at last minute. Not to mention it is the epitome of cheesiness. And the acting was atrocious. Anthony Newley was wasted as Captain Manzini, and MacKenzie Astin is a bland and inept child protagonist. Juice and Tangerine are underdeveloped and clichéd, and Ali Gator, Greaser Greg and Nat Nerd are unlikeable and I think ugly characters with voices that have haunted me in my sleep since seeing the movie last night. And they wasted Jim Cummings completely here, the immortal voice actor who gave us Darkwing Duck, Dr RobotNik and Don Karnage has sounds utterly embarrassed here, it makes me want to cry. Overall, absolutely awful. When I finished watching it, yes I watched the whole thing, I was like what was that? 1/10(and that is being kind, I could tell even from the title it wasn't going to be good). Bethany Cox",
         "What do those things have to do with the Garbage Pail Kids? Heck if I know, but they are the basis for the whole plot. This is one of those movies that will never go away, because you pick it up thinking it is going to be funnier, grosser, and just better than it is, but I'm here to tell you its awful. You won't trust me. It is too allurring to not watch it for yourself, but you'll regret it. Mackenzie Astin cries frequently, is a foot shorter than his love interest, wins over a girl named Tangerine by designing Michael Jackson jackets, and distracts a bully by twirling a basketball on his finger, which should all have me rolling on the floor laughing hysterically, but instead I just stare aghast at the TV wondering if it would be better if the whites of the Kids' eyes maybe be white instead of dingy yellow. The GPK are so awkward, innocent, and happy, as they sing songs about team work, that you feel guilty laughing at them. Isn't there supposed to be violence, and maybe lewdness beyond the average PG potty humor? The character Valerie Vomit doesn't even vomit until the very end of the movie, but Windy and Nat sure do fart and pee a lot. Anyone have any ideas about why they came from a garbage-pail-rocket in space, yet they now reside in a magician's antique shop? Me neither.",
         "While trying to find a movie to watch at my local mega-chain video store I stumbled across Garbage Pail Kids: The Movie. It wasn't necessarily a title that I was interested in, but due to its nostalgic value, I thought my wife would enjoy it. I do remember the Garbage Pail Kids pretty well, although they were a bit \"after my time\". It's no secret that the Garbage Pail Kids were supposed to be a disgusting and weird parody of the ever-so-clean Cabbage Patch Kids. When I rented it, I thought maybe there'd be some kind of creative use of sick and twisted humor, since the trading cards always had such delightfully vile characters on them. Was I ever wrong\u0085 First, let me start with the characters themselves. They looked exactly like they did on the trading cards, which was actually \"off putting\" in its own way. The costumes were very detailed, but the animatronics were horrible to say the least. It made me wonder if the people who designed them had been fired from Chuck E. Cheese's design studio. Next, we have the \"acting\", but that's stretching it a bit; I've seen stronger scripts in 1970's porn. One commenter stated that \"It looked like they were just making it up as they went along\", to which I second that, although none of the dialog was even that imaginative. I just loved how the so-called bully (Juice) would harass Dodger, portrayed so ineptly by Mackenzie Astin by calling him a \"creep\" and then throwing him down in the sewer, dumpster, etc. All the human roles were cookie-cutter stereotypes and had absolutely no depth or personality whatsoever. I realize that this movie was made for kids, but even in other kid-friendly movies I've been forced to watch, you generally have some feeling or care about what's going on, even if it's only surface feelings. Watching this movie was the equivalent of having you eyelids propped open with toothpicks and duct tape and having to sit through an ABC After School Special about teen mothers played frame-by-frame in slow-motion and starring Scott Baio. Two things I still can't get over were two locations used in the storyline: \"TOUGHEST BAR IN THE WORLD\" and the \"STATE HOME FOR THE UGLY\". I suppose the writers felt that their audiences were certified mentally challenged and that it's imperative that everything must be spelled out for them. Movies can be silly, satirical, humorous, weird and even stupid sometimes, but this movie lacks all but the last I one I mentioned on this list. Nostalgia has never been so appalling as Garbage Pail Kids: The Movie.",
         "I decided for nostalgic value to rent it seeing I hadn't seen it on over 15 years. I remember liking this movie when I was a kid, but hardly could remember anything about it, I realize now that it wasn't the passage of time, it was probably my brain trying to block it out. There's not anything redeeming about this movie, AT ALL. no good times, no heartfelt jokes, not even sappy \"awwww\" moments. Don't get me wrong, I collected the cards and stickers when I was little, so I knew what the Garbagepail kids were all about, the flat, 1 dimensional quality of the cards spoke better than this live action film did. I know people will say this movie is made to be enjoyed for kids, but if I had kids, I wouldn't let them near this piece of s**t. The entire movie is shot is such a dark tone, that half the time you're squinting to see ANYTHING. Freakish/mutant kids are hidden away in a garbage pail, there's a great lesson right there, hide away those who are different. Loser boy works in a magic shop for an old man (who by the way the old man is the only enjoyable character in this whole film!!) Anyhow, freak kids escape can, refuse to go back in, we're \"treated\" to 90 minutes of burping, farting, pants wetting, whining, toe biting, vomiting, pimple busting, snot, etc., need I go on about this? You get the point. Tangerine, the female in this film is a teenage \"fashion designer\" who uses the loser kid once she finds out the abilities of the \"sweat shop\" kids. Usually the predictable result of such films involve the snotty character realizing her own wrongs and trying to make them right, not here! There's also some silly side plots about the kids going to bars, getting in with the toughs, all of whom look like they just got done filming the Michael Jackson \"Bad\" video, the \"romantic interest\" between the loser and the stuck up fashion designer. Also I recollect there was some other ridiculousness about a \"Home for the Ugly.\" My IQ fell about 10 points after watching this disaster, oh yeah, PLENTY of 80's feel good music and fashion that will leave you wanting no more. A terrible waste of potential talent and film, if you're yearning for 80's Nostalgia, rent any of the John Hughes films instead. 0/10",
         "You people are insane and m' toissing the point. When I was a teenager I used to take my friends out to the worst movie I could find on my birthday. I subjected them to everything from 'Plan 9 from Outer Space' to 'Sgt. Pepper's Lonely Hearts Club Band' My piece dah rezistence was 'The Garbage Pail Kids Movie'. This movie is so bad, it is almost impossible to find. It makes 'Teenage Mutant Ninja Turtles 2 look like Citizen Kane'. Please release this on DVD. In a universe where it's easier for me to buy 'Erin Brokovich' than 'The Garbage Pail Kids Movie' there is no god.",
         "Without question the worst movie I've ever seen, and not even in a \"so bad it's good\" kind of way. It's ninety minutes of sheer torture, starring a hideous cast of makeup nightmares; indisputable evidence of the lengths a commercial property can stretch for the almighty dollar. Like most children of the eighties, I had a healthy collection of GPK stickers in my closet growing up. The gross-out humor and macabre illustrations were a big selling point, but beneath all that was a creative core and a wild amount of versatility. Every card was completely different. The one-note comedy of their film translation, though, is like opening a pack filled with duplicates. I counted six jokes with a visual punchline of \"and then he peed his pants.\" That's not an exaggeration, and it's not the only example of the flick's careless comedic redundancy. Combine that with an appalling song and dance number (seriously), a horribly out-of-place romantic subplot (starring a pre-pubescent boy and a girl well into her twenties, no less) and a gang of foils cut clumsily from recycled cardboard. It's genuinely amazing this ever saw the light of day.",
         "The kids in this movie are so ugly and disgusting that I couldn't believe it. This was the director's last movie because he was probably so embarrassed beyond belief that he made such a horrible movie. There is this teenager named Dodger and he falls in love with this prostitute named Tangerine. Tangerine makes clothes and has a pimp named Juice and Juice keeps picking on Dodger for no reason at all. This is the stupidest plot ever made. The Garbage Kids make clothes for Tangerine and she steals them but doesn't even notice the boogers or pee on them. How could she not? The basement probably smelled foul because the kids were farting and peeing and vomiting everywhere. It was extremely disgusting. Every five seconds someone would pee, fart or show off bad breath. I thought that the Alligator that went to the bar was cool but other than that this movie was just repugnant."
      ],
      "genres": [
         "Adventure",
         "Musical",
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Atlantic Entertainment Group",
         "Topps Chewing Gum"
      ],
      "summaries": ["Seven disgusting kids but nevertheless of interesting personality are being made of the green mud coming out of garbage can. Once alive their master gives them rules to obey although they think that life is funnier without following stupid regulations like no television or no candy. Naturally this will cause some conflicts."],
      "budget": 0
   },
   "movielensId": 2449,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-08-22",
      "dvdReleaseDate": "2005-07-12",
      "directors": ["Rod Amateau"],
      "runtime": 100,
      "movieId": 2449,
      "title": "The Garbage Pail Kids Movie",
      "mpaa": "PG",
      "actors": [
         "Anthony Newley",
         "Mackenzie Astin",
         "Katie Barberi",
         "Phil Fondacaro",
         "Ron MacLachlan",
         "J.P. Amateau",
         "Marjory Graue",
         "Debbie Lee Carrington",
         "Kevin Thompson",
         "Bobby Bell",
         "Larry Green",
         "Arturo Gil",
         "Susan Rossitto"
      ],
      "imdbMovieId": "0093072",
      "originalTitle": "The Garbage Pail Kids Movie",
      "genres": [
         "Adventure",
         "Science Fiction",
         "Comedy"
      ],
      "youtubeTrailerIds": ["0lXmuXVGidY"],
      "plotSummary": "Seven disgusting kids but nevertheless of interesting personality are being made of the green mud coming out of garbage can. Once alive their master gives them rules to obey although they think that life is funnier without following stupid regulations like no television or no candy. Naturally this will cause some conflicts.",
      "tmdbMovieId": 14443,
      "avgRating": 1.66566,
      "releaseYear": "1987",
      "numRatings": 332,
      "posterPath": "/xMgUWvNclNqUmedJyMHboZKIaUw.jpg"
   }
}