{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "autism",
            "id": 1646
         },
         {
            "name": "flight",
            "id": 8044
         },
         {
            "name": "autistic",
            "id": 240958
         }
      ],
      "imdb_id": "tt0090768",
      "video": false,
      "title": "The Boy Who Could Fly",
      "recommendations": [
         39062,
         14671,
         3288,
         38225,
         30528,
         52263,
         17956,
         49478,
         117553,
         17362,
         124042,
         49345,
         43535,
         12472,
         17745,
         13346,
         2608,
         24548,
         27985,
         35144
      ],
      "backdrop_path": "/clf9y7NcbsnvjbEdGoC6OvGqRj4.jpg",
      "revenue": 7177431,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Eric",
               "gender": 0,
               "credit_id": "52fe4480c3a368484e026de9",
               "name": "Jay Underwood",
               "profile_path": "/cUWx3F5tzeMUowmCIJoL2WrLxoe.jpg",
               "id": 27493,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Louis",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026ded",
               "name": "Fred Savage",
               "profile_path": "/q6u7yhINrALOC9wD2tc6mifQ9sJ.jpg",
               "id": 2223,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Charlene",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026df1",
               "name": "Bonnie Bedelia",
               "profile_path": "/10JhoIaKHQGG0DNbQECTI4gHNn9.jpg",
               "id": 7673,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mrs. Sherman",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026df5",
               "name": "Colleen Dewhurst",
               "profile_path": "/44nikIUvc84f1OZboSCQqZQZ6V.jpg",
               "id": 10559,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Uncle Hugo",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026df9",
               "name": "Fred Gwynne",
               "profile_path": "/xwDhOItVPzmBDfPqNMPHSSdXOMj.jpg",
               "id": 56266,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Milly",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026dfd",
               "name": "Lucy Deakins",
               "profile_path": "/s6yRkkptiDUUJ70mlMFrQspmQPl.jpg",
               "id": 171213,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gary",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026e07",
               "name": "Jason Priestley",
               "profile_path": "/skXfFcbZWPOBomGBSTMfiyzgi6q.jpg",
               "id": 19143,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026e03",
               "name": "Nick Castle",
               "profile_path": "/ecUHW93fTzJLCEZcpfvfjgNMi1o.jpg",
               "id": 14692,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5727ef9592514154430048cd",
               "name": "Richard Vane",
               "profile_path": null,
               "id": 52042,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "5727efa79251412478000231",
               "name": "Nick Castle",
               "profile_path": "/ecUHW93fTzJLCEZcpfvfjgNMi1o.jpg",
               "id": 14692,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.078462,
      "production_countries": [],
      "id": 24086,
      "vote_count": 45,
      "budget": 0,
      "overview": "Milly and Louis, and their recently-widowed mom, Charlene, move to a new neighborhood. Once there, they all deal with a variety of personal problems, but Milly finds a friend in Eric, her autistic next door neighbor. Eric has a fascination with flight, and as the story progresses, he exerts an enthralling force of change on all those around him.",
      "similar": [
         10191,
         431,
         302946,
         380,
         26466,
         8838,
         64685,
         9549,
         9574,
         4104,
         278236,
         10391,
         390051,
         39957,
         15003,
         8976,
         1945,
         33602,
         257345,
         82657
      ],
      "original_title": "The Boy Who Could Fly",
      "runtime": 114,
      "poster_path": "/3oso2pYofHjVvPYeQ6JOJmoXQSM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lorimar Motion Pictures",
         "id": 1887,
         "origin_country": ""
      }],
      "release_date": "1986-08-15",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "A very special love. And a very special magic. But is it real magic or just an illusion?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Castle"],
      "runtime": 114,
      "synopsis": "15-year-old Amelia, called Milly, and her family move into a new suburban home shortly after the death of her father. Milly makes friends with her new neighbor Geneva, and Milly and her eight-year-old brother Louis have difficulty adjusting to their new schools, while their mother Charlene copes with a demotion at work and her inability to learn how to use a computer. Louis is also plagued by bullies down the street who won't let him get around the block. During the first night at the house, Charlene tells Milly she will need her help to make this work. Milly returns to her bedroom and is talking to her pet bird when something flies past the window, but when Milly goes to investigate she sees nothing. Milly and Geneva observe Eric Gibb, an autistic boy living next door with his alcoholic uncle Hugo. Eric has never spoken a word in his life, doesn't like to be around people and exhibits bizarre behavior related to flying, such as balancing on the roof of his house with his arms spread out like an airplane. Milly hears that Eric's parents died in a plane crash, and that somehow, in the instant of their death, he knew; and that he did the only thing he could think of to try to save them, which was to become an airplane. Later that night, Milly and her family watch as Eric (along with Milly's teacher Mrs. Sherman) and three adults appear outside with Eric in a straight jacket and being restrained by two men, with Mrs. Sherman arguing with a woman there about what is best for Eric. Milly later reveals to Geneva that she finds Eric attractive. Although Eric cannot communicate with anyone, he begins to react to Milly, first by mimicking her movements and facial expressions. Her teacher, Mrs. Sherman, observes this interaction and asks Milly to keep an eye on Eric. Mrs. Sherman explains that, because of uncle Hugo's drinking, Eric is in constant danger of being taken by authorities and placed in a hospital; but that when Eric was taken away before, he became so sick that he almost died. Milly works with Eric over the course of the school year and takes notes on his progress, which is slow at first. Milly notes excitedly the first time Eric smiles on his own rather than merely copying her own smile. Eric does nothing when Milly throws balls to him, except for one day when he spontaneously reaches out and catches a stray baseball flying toward Milly's head. However, strange occurrences, like Eric's apparent ability to appear in his own window one instant, and in Milly's the next, begin to make Milly question reality. In her notes, Milly wonders whether Eric is becoming more like her, or the other way around. On a school field trip, with no one present except Eric, Milly falls off a bridge while trying to pick a rose. Knocked unconscious, she dreams that she wakes up in the hospital, with Eric sat on the windowsill. After a conversation with him (albeit wordless on Eric's part), she becomes convinced he can fly. Eric gives her the rose she was trying to reach and then, taking her hand, leads her out of the window and the two begin flying. The two watch a fireworks display from a cloud before they share a kiss and return to the hospital window. After watching Eric fly off, Milly's dream becomes a nightmare as she sees her father in a hospital bed, dead, with a girl called Mona (who Milly told to throw a basketball at her head earlier) throwing a basketball at her which knocks her out of the window. Milly then wakes up in a hospital and tells her mother that Eric can fly and that he caught her as she fell. A shrink called Doctor Grenader talks to Milly, who tells Doctor Grenader that Eric caught her as she only has a concussion and no serious injuries. Upon returning home, Milly notices the rose on her windowsill and now becomes truly convinced that Eric can fly. When she shouts to Uncle Hugo about Eric's whereabouts, he replies by saying the institute has taken him away as Hugo was found drunk again. Despite the efforts of Milly and her family, they are not allowed to see Eric when they visit the institute. As they leave, Eric tries to force the window open and is restrained by two men who try to sedate him. Another attempt by Louis to get around the block fails as the bullies tear his tricycle apart and to make matters worse, his dog Max is hit by a passing car and is taken to an animal hospital. Later that evening, Milly thinks she spots Eric on his roof during a thunderstorm and after climbing into the attic, she finds Eric, who is shivering with cold and still wearing a straight jacket after managing to somehow escape the institute. As Milly helps him, he pulls out a box and from within it, he takes out a ring which he gives to Milly. When the authorities arrive at Eric's house the next day, Milly sneaks Eric out and the police chase them to the roof of the school during a carnival. Eric turns to Milly and speaks her name, the first word he has spoken thus far. Milly asks Eric if he really can fly, and he smiles and nods his head. He holds her hand and the two fall off the building. Just before hitting the ground, Milly and Eric begin flying in plain view of the crowd around the carnival, which follows Milly and Eric down the streets of their town, shocking Charlene, Louis, Geneva and Uncle Hugo. Eric brings Milly to her own window, tells her he loves her and kisses her before he says goodbye and flies away. Milly is heartbroken, but quickly realizes why Eric had to leave. Over the following weeks, spectators, policemen and scientists mob the town, looking for an explanation and taking all of Eric's belongings away to be analyzed. Milly speculates that Eric too would have been taken by scientists had he remained. It is revealed that Milly's father knew he had cancer, but kept it a secret from his family because he did not want them to worry. Rather than seek treatment, he said goodbye and committed suicide. His refusal to fight for life left the Michaelsons feeling helpless and hopeless, but Eric's ability to fly shows them that anything is possible if you believe. Unlike Milly's father, Eric's uncle and the remaining Michaelsons refuse to give up: Eric's uncle beats his drinking problem and gets an excellent job; The Michaelson's dog Max gets better; Louis dominates the bullies down the street (with some help from Max); Charlene masters the computer at work; and Milly regains interest in her life and relationships with those around her. The movie ends with Milly looking out the window, hoping Eric will return someday. As the sun sets, she throws out a paper airplane and the credits roll.",
      "writers": ["Nick Castle"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090768/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1MTMxMDgzNF5BMl5BanBnXkFtZTcwNDcxMDAwMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Lucy Deakins, Jay Underwood, Bonnie Bedelia | See full cast and crew »"],
      "reviews": [
         "I'm so tired of modern family movies full of fart jokes or movies where teenagers make love to pastries and it's supposed to be funny and then they staple on some superficial message at the end in an attempt to be poignant and balance out all the trash that came before. Every other week we are tortured with some nonsense of this calibre and whenever I wish for a movie that stands out from the crowd I have to go back in time and consider some overlooked gem. The Boy Who Could Fly is exactly that. The characters seem so real and their emotions genuine, it builds at a slow pace but it never gets boring and story development is consistent. This is not a ferociously loud summer crowd-pleaser or something bloated with pointless SFX. Very few movies have the power to make a whole story out of characters and situation alone without feeling the need for some ridiculous set piece or blaring thrash metal guitars. In fact Bruce Broughton's score is the wonderful opposite of that. The performances, especially the two leads, are flawless and the direction is far more refined than the typical. Everything in this movie comes together perfectly to make a film so unique and charming. If you have lost your faith in the current dreck that graces our screens and if you want a family movie with some meaning and subtext then check this out. And keep an eye out for director John Carpenter as on of the Coupe De Villes. The DVD is in 1.78:1 anamorphic widescreen and in Dolby 2.0. It has an introduction by Jay Underwood and director Nick (Michael Myers) Castle, they also feature in a commentary with Lucy Deakins and Fred Savage.",
         "I'm really surprised I didn't see more comments on this movie. I remember watching this movie when I was, I think 13 or 14. I never quite understood the complexities of emotion that were put into this movie. But I had always remembered it from my younger years. I decided to pick up the DVD when it came out again. Now that I'm older, and actually work with cut scenes as an animator for a living. I now see everything that I missed. I am by all means not an emotional person or cry a lot etc, but I have at least watched this film more then 15 times in the last year. No other movie has ever brought me to tears every time I watch it. Not tears of sadness or being upset , but tears of happiness. There are so many moments in this picture that can overwhelm you with that gut feeling of real love. You really let these characters take your heart and go with it. That is what a true movie is a about , is the ability to let you heart go and pull in that emotion from them and try to imagine feeling what they feel. I don't think any other movie has captured my heart that way. I might seem all soft and sound like a push over but I'm about as manly as you can get. If you have the time to see this movie or buy it. You truly will receive a much broader look at life , love , fear , relationships and most of all believing in yourself and who you are. I didn't want reveal any of the movie but it really has touched me. Michael Loeck Character animator http://www.immortal3d.com",
         "In an atmosphere of fantasy, the movie explores several real human issues. The story centers on a mother (Bonnie Bedelia), her young teenage daughter (Lucy Deakins), and her pre-teen son (Fred Savage) as they struggle to cope after the beloved father's sudden passing. Their grief is intensified by the manner of his death and their almost immediately having to adjust to a new life, a new home, a new neighborhood, and for the kids, a new school and new friends. Into this mix enters Eric (Jay Underwood), the apparently autistic teenage boy next door, who is coping with demons of his own as a result of his parents' sudden death in an airplane crash. So grief is involved, and adjustment, and trying to fit in, and acceptance of human differences, and courage, and love - love within a family group and among people, as well as real boy/girl love. Writer-director Nick Castle deals with these issues with respectful sensitivity, as does the excellent ensemble cast of Lucy Deakins, Jay Underwood, Bonnie Bedelia, Fred Savage, Colleen Dewhurst, Fred Gwynne, and Mindy Cohn. That fantasy might be important to plot movement shouldn't be surprising, considering the movie's title. However, whether that fantasy is allegorical or real, or both, is in the eyes of the beholder. In any case, it's a warm and poignant tale, and it deserves a high place in the literature of motion pictures.",
         "This movie is great. It takes you back when wishes and faith brought people a long way. There is no getting around it if you have never seen this movie you need to. This is a great movie for kids to watch compared to the movie choices that they have today, but yet is great movie for adults. This movie is an older movie but yet is the only movie that I can honestly say was great. no complaint or suggestions just great. Well written and directed the actors and actress's where great. This movie is one that should never be forgotten and I would love to see anther movie made that is like this. This movie should never leave your library of movies and if you do not own it you should there is no getting over it it was the best movie of my time and that is not very long but it always will be the best.",
         "Like other commentators before me I watched this film as a young man and it touched me. In fact it moved me to tears. Now I am older I am still touched by the simplicity of this film and yet it is complex in showing us that from adults to children we all have things to deal with. The reason why Eric Gibb could fly is the most touching of all and in case there are people who do not believe that it is possible for one to sense tragedy in one close to you, believe me it's real. As I pen this comment I have just watched it again and cannot help but feel that even twenty years plus since this movie came out there is the scope for a sequel 'The Man who could fly' I am not talking about a TV series but a one off movie showing our stars meeting again in adult hood. Something to think about. I liked this movie and I would like to own it on DVD should it be released for the European audience.",
         "There are few films the go beyond the realms of reality, yet hit so close to home. Such is the case with this film. I could immediately identify with Milly. She is a down to earth girl who was alone and wanted to believe in a boy who was as lonely (if not more) as she was. But little did she suspect that his story would be one that would go beyond all of her wildest dreams. This movie is very rare in today's movie market, a wholesome and innocent film that is a pleasure to watch again and again. One of the most beautiful scenes to me is when she reaches for a rare white rose with one pink petal and as she climbes the railing (the only thing gaurding her from a deep gorge) Eric immediatly grabs her arm, concerned for her safety. The love is really there in his eyes. Wonderful film that illustrates the forbidden lines between reality and the incredible.",
         "The Boy Who Could Fly is one of those rare family films that mixes just a touch of fantasy with a truly down-to-Earth dramatic story. Following the death of Bedelia's husband, she moves her family into a new neighborhood next door to an autistic young man (Underwood). Deakins gains interest in Underwood's silent world of thought while attempting to keep things stable at home. Unusual things begin to happen around Underwood. While life seemingly falls apart for her family, Deakins and the audience are irresistably drawn into Underwood's world and we begin to question if his apparent dream to fly isn't more than just a fantasy. The acting in this film is superb, especially silent Underwood who conveys more thought and emotion with his eyes, face and body than the actors who speak. Bruce Broughton's melodious score is heartwarming and delivers full enchantment for the \"flying?\" scenes. (The main theme is so enchanting, the Walt Disney company has used it to open every film at their El Capitan theater in Hollywood, CA). This is a wonderful film for the entire family. Slight warning: for families that have recently lost a parent, it would be a good idea for the other parent to watch with the kiddies. And although they may find themselves dealing with the emotion of their trauma, they should feel much better when the film ends.",
         "Back in the late 1980's, Jay Underwood was a teenaged boy who had a short lived starring career in films. He made his starring debut in this 1986 Lorimar release which could've been a major star making vehicle if its theatrical response was more profitable. Time has served it well and it now stands as a family favorite from the 1980's. Underwood portrays a boy who isolates himself from society after his parents die in a plane crash. He stays in his house all day long and pretends to be in a land where he can fly. Lucy Deakins portrays a teenaged girl who feels sorry for Underwood and tries to help him fit in. Somewhat sappy at times but otherwise genuinely touching. Film is also notable for serving as the debut performance of Fred Savage, the star of the TV series \"The Wonder Years.\"",
         "A classic 80's film that nears cheesy pap but still avoids and retains heart through excellent pacing, dialog and acting. It might not hold up as well as when I first saw it because the family film concept had not yet been run into the ground yet for me. Fred Savage does a good job in an interesting subplot that involves a bully and funerals for GI JOE soldiers. Fond memories of his confrontation with the neighborhood bullies still color my memory of this film. A fun warm family fantasy that seems to be in short supply as of late due to it being nearly impossible to make something realistic because of the amount of film cliche in the modern world. Still, the film is very watchable and fun. 7/10",
         "As one other IMDb user noted here, this is a movie that would most likely not be made today. It's lacking in cynical attitudes and razzle- dazzle flash. But being raised in the era that this movie was made, I could appreciate the movie's sweet and gentle tone. I also thought that the cast did a very good job in making their characters believable and sympathetic. Still, this movie is far from perfect. A big problem I had was with the movie's length - it is almost two hours long. Though it could have been worse, since there is evidence here that the original cut of the movie ran much longer and was whittled down in the editing room to its present length. (Evidence: the bullies that show up in the first few minutes of the movie subsequently disappear for more than an hour before showing up again.) Also, the movie seemed to be spinning its wheels over and over, with one scene after another advancing the plot little or not at all. This isn't a BAD movie - it has charm and warmth - but I think director/writer Nick Castle should have either reviewed his script a few more times before filming, or invited outside input to review the script."
      ],
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Lorimar Productions",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Charlene Michaelson, her two children - teen-aged Amelia 'Milly' Michaelson and precocious adolescent Louis Michaelson - and their dog Max move into a new house in a new neighborhood after the passing of Charlene's husband/the kids' father, Donald Michaelson. Beyond life without Donald, they are all nervous about starting a new life, which, for Charlene, means getting back into the workforce after thirteen years. Milly quickly settles into the neighborhood if only because she becomes fascinated with their next door neighbor, teen-aged Eric Gibb, who authorities believe is autistic. Orphaned Eric has never spoken a word, and without having been told about the incident, began to think he could fly at the exact moment his parents died in a plane crash. Many believe Eric's belief is because he felt he could thus save his parents. Eric's guardian is his dipsomaniac Uncle Hugo Gibb. Milly's high school teacher, Mrs. Carolyn Sherman, who used to be a special needs teacher, looks after Eric as much as anyone. Mrs. Sherman believes that having Eric in her class with \"normal\" students is a positive environment for him, unlike the authorities who believe he should be institutionalized. Milly's official and unofficial tasks become to see what lies deep within Eric's psyche, and if there really is any validity to what people think Eric believes.",
         "Milly and Louis, and their recently-widowed mom, Charlene, move to a new neighborhood. Once there, they all deal with a variety of personal problems, but Milly finds a friend in Eric, her autistic next door neighbor. Eric has a fascination with flight, and as the story progresses, he exerts an enthralling force of change on all those around him.",
         "In the 1986 film The Boy Who Could Fly, Jay Underwood plays Eric Gibb, an autistic boy who lives with his alcoholic uncle Hugo Gibb (played by Fred Gwynne) and befriends the new girl next door, Millie Michaelson. Because Eric is unable to verbally communicate and his parents died when he was five in a plane crash, Eric faces the constant threat of institutionalization by unsympathetic social workers who believe he is a threat to himself and the community because Eric has an affinity for climbing onto rooftops and standing on window sills. Throughout the film, audiences often see Eric standing with arms outstretched and eyes closed, as if he believes that he is flying or can fly. At school, Eric's English teacher Mrs. Sheridan (played by Colleen Dewherst) advocates for him and encourages Millie to bond with Eric. In the months that follow, Eric and Millie form a close bond and Millie begins to suspect that there is more to Eric than appears. Specifically, Millie begins to suspect that Eric actually can fly, especially when he appears to jump from her windowsill to his and when he saves her from falling off a bridge on a school trip to the zoo. While Millie cannot remember Eric flying to save her, she can come up with no other explanation for her miraculous rescue. Unfortunately when Hugo goes on a drinking binge, social workers remove Eric from his home and place him in an institution where Eric is heavily medicated and often restrained. Millie eventually helps Eric escape from the institution and when confronted by social workers and the police at their high school, Eric grabs Millie's hand and the two literally fly away from the school and soar over rooftops to Millie's home. In a scene reminiscent from E.T., Millie and her family face the onslaught of reporters and scientists investigating the boy who could fly while Eric disappears forever into the clouds.",
         "An autistic boy who dreams of flying touches everyone he meets, including a new family who has moved in after their father dies."
      ],
      "budget": 0
   },
   "movielensId": 2453,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-08-15",
      "dvdReleaseDate": "2003-07-08",
      "directors": ["Nick Castle"],
      "runtime": 114,
      "movieId": 2453,
      "title": "The Boy Who Could Fly",
      "mpaa": "PG",
      "actors": [
         "Jay Underwood",
         "Fred Savage",
         "Bonnie Bedelia",
         "Colleen Dewhurst",
         "Fred Gwynne",
         "Lucy Deakins",
         "Jason Priestley"
      ],
      "imdbMovieId": "0090768",
      "originalTitle": "The Boy Who Could Fly",
      "genres": [
         "Drama",
         "Family",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["NWmO31SyO70"],
      "plotSummary": "Milly and Louis, and their recently-widowed mom, Charlene, move to a new neighborhood. Once there, they all deal with a variety of personal problems, but Milly finds a friend in Eric, her autistic next door neighbor. Eric has a fascination with flight, and as the story progresses, he exerts an enthralling force of change on all those around him.",
      "tmdbMovieId": 24086,
      "avgRating": 3.0934,
      "releaseYear": "1986",
      "numRatings": 1258,
      "posterPath": "/3oso2pYofHjVvPYeQ6JOJmoXQSM.jpg"
   }
}