{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ransom",
            "id": 1336
         },
         {
            "name": "lover (female)",
            "id": 1808
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "business man",
            "id": 4480
         }
      ],
      "imdb_id": "tt0091877",
      "video": false,
      "title": "Ruthless People",
      "recommendations": [
         9941,
         19382,
         11896,
         12710,
         10729,
         10631,
         10859,
         10765,
         10780,
         14370,
         9080,
         26603,
         20242,
         21629,
         40634,
         11038,
         14742,
         10168,
         11064,
         14361
      ],
      "backdrop_path": "/iKCnedgHb6nCSUVBF39JdSFKQhe.jpg",
      "revenue": 71,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Sam Stone",
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f95d",
               "name": "Danny DeVito",
               "profile_path": "/zKuyzmKzPLG7RJo7lbbHjx6CCZc.jpg",
               "id": 518,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Barbara Stone",
               "gender": 1,
               "credit_id": "52fe44bf9251416c7503f961",
               "name": "Bette Midler",
               "profile_path": "/ylGKhmHKUa1fBvvbA0kvdn3eFNn.jpg",
               "id": 73931,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Ken Kessler",
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f965",
               "name": "Judge Reinhold",
               "profile_path": "/dra8yOHLV8yqXSdwBueXeaDsLXV.jpg",
               "id": 777,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Sandy Kessler",
               "gender": 1,
               "credit_id": "52fe44bf9251416c7503f969",
               "name": "Helen Slater",
               "profile_path": "/bsejuN5hxhaiRDRuZLWh5ubx9za.jpg",
               "id": 33488,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Carol Dodsworth",
               "gender": 1,
               "credit_id": "52fe44bf9251416c7503f973",
               "name": "Anita Morris",
               "profile_path": "/mfvWMh7Gz3zbt28Ho2kDtq7qEyX.jpg",
               "id": 159753,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Earl James Mott",
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f977",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Chief Henry Benton",
               "gender": 0,
               "credit_id": "54d597eac3a3683b890011b1",
               "name": "William G. Schilling",
               "profile_path": null,
               "id": 544816,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Lt. Bender",
               "gender": 2,
               "credit_id": "54d598039251416ba800118d",
               "name": "Art Evans",
               "profile_path": "/oFxv6KQdXU30MY00ASwoMqbKVAg.jpg",
               "id": 56183,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Lt. Walters",
               "gender": 2,
               "credit_id": "54d598229251416b930011e1",
               "name": "Clarence Felder",
               "profile_path": "/hbioULG0wwkHlXcjXy89eZIPt2J.jpg",
               "id": 72408,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Heavy Metal Kid",
               "gender": 0,
               "credit_id": "54d59846925141758c00112d",
               "name": "Gary Riley",
               "profile_path": "/d1TZEZcWxyTnqLdop06MOKWMvm8.jpg",
               "id": 3038,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Bedroom Killer",
               "gender": 2,
               "credit_id": "54d59882c3a3683b9200146f",
               "name": "J.E. Freeman",
               "profile_path": "/lGqZh89pfgSNhIItjvn34jPO6HM.jpg",
               "id": 5169,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "The Mugger",
               "gender": 2,
               "credit_id": "54d598a9c3a3683b8c001364",
               "name": "Frank Sivero",
               "profile_path": "/tLogWMv98IE1S3P7RosPSaKs891.jpg",
               "id": 11480,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f923",
               "name": "Jim Abrahams",
               "profile_path": "/lXpyiQ7tSxrxBeop8LLIltOorUN.jpg",
               "id": 12936,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f929",
               "name": "David Zucker",
               "profile_path": "/rJzWA35n0dsn4xecDGW8x7EkmKB.jpg",
               "id": 12987,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f92f",
               "name": "Jerry Zucker",
               "profile_path": "/n2iX1gJyOxImJie2LTORZNKM9n9.jpg",
               "id": 3415,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f935",
               "name": "Dale Launer",
               "profile_path": null,
               "id": 14089,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bf9251416c7503f93b",
               "name": "Joanna Lancaster",
               "profile_path": null,
               "id": 71472,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f941",
               "name": "Walter Yetnikoff",
               "profile_path": null,
               "id": 71474,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f947",
               "name": "Michel Colombier",
               "profile_path": null,
               "id": 35838,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f94d",
               "name": "Jan de Bont",
               "profile_path": "/9kPf2LuyLLwCawSGyPIQCX7ighX.jpg",
               "id": 2209,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bf9251416c7503f953",
               "name": "Gib Jaffe",
               "profile_path": null,
               "id": 16568,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44bf9251416c7503f96f",
               "name": "Michael Peyser",
               "profile_path": null,
               "id": 59949,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44bf9251416c7503f97d",
               "name": "Richard Wagner",
               "profile_path": null,
               "id": 49500,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54d59947925141758c001153",
               "name": "O. Henry",
               "profile_path": "/4e11Hr7XBbhxhz7hEJ7pcTbbmIp.jpg",
               "id": 792498,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "59ca6c7492514123bd00d2cf",
               "name": "Arthur Schmidt",
               "profile_path": null,
               "id": 38,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.619936,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12151,
      "vote_count": 128,
      "budget": 0,
      "overview": "A couple, cheated by a vile businessman, kidnap his wife in retaliation, without knowing that their enemy is delighted they did.",
      "similar": [
         193893,
         275,
         8067,
         4771,
         562,
         4638,
         270487,
         123109,
         984,
         25376,
         2048,
         1586,
         1949,
         281,
         1538,
         1571,
         14869,
         75780,
         968,
         395990
      ],
      "original_title": "Ruthless People",
      "runtime": 93,
      "poster_path": "/nH0nq1Nk7jTlZv1aj7SnspMJyQy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1986-06-26",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Sam Stone's wife has just been kidnapped... And he doesn't want her back!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jim Abrahams",
         "David Zucker"
      ],
      "runtime": 93,
      "synopsis": "Ruthless millionaire Sam Stone (Danny DeVito) tells his mistress, Carol (Anita Morris), whom he is having lunch with at a trendy Los Angeles restaurant, that he intends to murder his vulgar and brash wife, Barbara (Bette Midler). Sam is greedy and grasping. He reveals to Carol that 15 years earlier, he only married Barbara for her money but her father (who was also his boss) took a long time dying. Sam thus built up a small fortune of his own but Barbara is the heiress to a much larger one of over $15 million. Furthermore he hates her choice in clothes and \"modern\" furniture. However, when Sam arrives home at his and Barbara's fancy house in Bel Air, he finds the house empty. In frustration he tosses away the bottle of chloroform he intended to use to put Barbara to sleep before killing her (important later). He then receives a phone call from an anonymous man announcing that Barbara has been kidnapped and that Sam must pay a large ransom of $500,000 or else she will be killed. She will also be killed if he informs the cops or the media. (\"or else\" is exactly what Sam has in mind). Before long, the house is swarming with police looking for clues to the kidnapping which is now headline news!!! The kidnappers are revealed to be Ken (Judge Reinhold) and Sandy Kessler (Helen Slater), a married couple who live in a lower class area of the San Fernando Valley and whom are both desperately poor and eager for revenge against Sam. Apparently several years earlier, Sam \"made his fortune\" by stealing a fashion idea from Sandy, along with the Kesslers' life savings to market it. Barbara, Sam's overweight, loud-mouthed wife, gets locked in the Kessler's basement, where she proves a handful to the amateur kidnappers. She never stops yelling, cursing, or screaming at the Kesslers. Ken slaping Barbara in the face to subdue her only makes her more angry and agressive like some wild caged animal that will not calm down. (At this point, it's no wonder why Sam wants Barbara dead.) Things go astray, however, when it becomes obvious that Sam doesn't want his wife back, and is in fact doing everything possible to goad the kidnappers into killing her. Unfortunately for him, the Kesslers, while desperate, are not about to murder anyone. The next day when Sam does not show up for the ransom drop, Ken phones him and offers to drop the ransom first from $500,000 to $50,000, then the following day to $10,000. Sam still refuses. Sam is unaware that the Kesslers are behind his wife's abduction (Sam has apparently forgotten about the Kesslers... as well as all of the other people he's scamed and ripped off over the years). But Sam is also unaware about his mistress Carol's real intentions towards him. Carol is actually a gold-digging grifter (con artist) in which she and her handsome but extremely moronic boyfriend, Earl (Bill Pullman) are planning to steal all of Sam's wealth for themselves. Believing that Sam made up about his wife's kidnapping to the public, Carol belives that Sam plans to toss his wife's dead body from the Hollywood Hills at night, Carol has Earl lie in wait with a video camera. What he actually ends up filming is a rendezvous in a car between a prostitute and her john, who asks her to \"make a lot of sound.\" The dim-witted Earl, hearing the woman's screams, mistakenly thinks the murder is happening right in front of him. Without watching the tape, Carol sends an anonymous copy to Sam, who sees the sex act captured and immediately hits on Carol as the one who sent it and announces that he is looking forward to repeating the scene with her. Terrified, she hides out with Earl at his trailer and sends another anonymous copy to police chief Henry Benton (William G. Schilling).... who happens to be the john in the video. When Carol calls him, Benton, thinking that he is being blackmailed, asks her what she wants and she says the answer should be obvious: arrest Sam Stone. The next day, Benton orders the police to conduct a search of Sam's house, planning to plant evidence in it, but he is surprised when real evidence turns up which includes the bottle of chloroform and pictures of Sam with Carol. The kidnapping investigation, led by the stuffy detectives Bender and Walters, which has actually led to Ken himself by now, is immediately called off (just when they begin to close in on the Kesslers) and Sam is arrested. The chloroform was part of Sam's plan to kill Barbara himself but he never did and now faces the dilemma of having to get his wife back in order to prove his innocence. A third complication arises when Barbara reluctantly decides to take up exercise to relieve her boredom in her cell. To her own astonishment, she loses twenty pounds in one week during her confinment. She and Sandy bond unexpectedly over this and Sandy shares several of her fashion designs with Barbara, who loves them and offers to take them worldwide. In their euphoria, Sandy decides to let Barbara go. Barbara leaves, but comes back as soon as she finds out from the newspaper about Sam's mistress which leads her to realize that he wanted her dead. Just as Barbara comes back, a serial killer, known as the Bedroom Killer (J.E. Freeman), who has been stalking the neighborhood enters the Kessler household and attacks Ken, but falls down the basement steps, breaking his neck and dying in the process. Barbara, Ken, and Sandy now hatch a plan for revenge on Sam. Now desperate to prove his wife is alive, Sam offers to pay the ransom the moment Ken calls him again. But now, armed with Barbara's inside knowledge, they have increased the ransom to precisely equal Sam's own net worth: over $2 million. Sam is outraged, but has no choice. He withdraws the cash, but begs detectives Bender and Walters to watch the drop site. They refuse, still thinking he murdered Barbara. Meanwhile, Carol, baffled as to why Sam hasn't been convicted already, goes to a video store and plays the tape in the display model. But the scene of the whore and the client is played on every TV in the shop and Chief Benton's wife, who happens to be there, recognizes her husband. When Sam goes to the bank to obtain as much of the money as possible, Benton can be seen withdrawing his own cash and with a passport, presumably in order to flee abroad. Carol realizes Earl's mistake, and that Barbara really was kidnapped. She calls Sam and learns the time and place of the ransom drop. She tells Earl to go to the place and steal the ransom money. The next day at the ransom drop to be at a local plaza in downtown Los Angeles, Sam waits with the cash (which was all from his account.) Barbara calls Sam from an office across the street instructing him to wait while yelling curses and obsanities at him claiming that the kidnappers are making her do it. She also demands that Sam also deposit his expensive gold Rolex wristwatch and a gold ring to make sure that he does not have any assets left to live on. Sam is forced to comply and she tells him that someone will arrive to pick up the money. The minute after Barbara hangs up, Ken arrives in disguise, wearing a crude clown mask and driving the serial killer's car, to demand that Sam hand over the briefcase with the case. But just when Sam does, scores of hidden police, led by Bender and Walters, arrive. Ken prevents himself from being arrested by claiming to have Barbara killed by his accomplice over a CB radio. Against Sam's protest, the police decide to let Ken go and instead \"follow him home\". But just then, Earl arrives with a gun to steal the ransom money from Ken. In the ensuing confusion, Earl is captured by the police, and Ken drives away in the Bedroom Killer's car, while a whole group of police cars silently follow him. Ken sees the police following him and drives his car off the end of the Santa Monica pier with the ransom cash inside. Money starts rising to the surface and people on the pier jump in to grab it. Sam yells at the police officer nearest him to stop them and pushes him in too. The police search the water and bring up the car, with the body of the serial killer inside... dressed in Ken's clothes. Sam fakes grief, but is ecstatic inside, believing that Barbara will now definitely be killed and her money is his at last. Instead, Barbara appears, telling Bender and Walters that her kidnapper (the serial killer) was insane, believing himself to have accomplices, and so she was able to escape as soon as he left. Bender and Walters walk away in satisfaction and the case is closed with Sam cleared of all criminal charges. Sam meanwhile is taken aback by how beautiful Barbara has suddenly become and most likely to find the factor that he was secretly been plotting her demise. As they embrace (out of eyesight of the departing police) she gives him a sound thrashing for his affair and in addition for not even trying to pay the ransom to save her, tells him that she wants a divorce and pushes him off the pier and into the water. Sam presumably swims ashore and although free and clear, is now without his money... and without his mistress Carol (whom no doubt the arrested Earl will rat out to save himself from going to jail). In the final scene, on a beach not far away, Ken emerges from the water in scuba gear, carrying the briefcase with the ransom cash. Apparently Ken hid the dead body of the serial killer in the car, and planned the switch to get away from the police. Sandy runs to meet him and embraces him lovingly and kisses him. Barbara appears, having disposed of her husband, and runs to meet Sandy and Ken and they all dance for joy on the beach with the briefcase containing the $2 million.",
      "writers": [
         "Dale Launer",
         "O. Henry"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091877/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NjAyOTc4OF5BMl5BanBnXkFtZTcwMjAzMzcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bette Midler, Danny DeVito, Judge Reinhold | See full cast and crew »"],
      "reviews": [
         "This is one of my favorite movies. I laughed hysterically at every joke, every joke hit its target. But that's not what's so great about this movie. This movie has an all-star cast (Devito, Midler, Reinhold, Pullman) and they do a great job with the script. But that's not what's so great about this movie. The best thing about this movie is the intricately woven plot, which keeps your attention and comes to a hilarious finale. This is one of the funniest movies ever. See this and you won't regret it.",
         "\"Ruthless People\" is a genuinely original farce that kept me laughing to the point of exhaustion. It's masterful how all these characters interweave, creating more and more hilarious subplots. The cast is a tour de force. Danny DeVito gives quite possibly the best comic performance of his career! Bette Midler is also great as his whiny, obnoxious wife. It's good to see Judge Reinhold, who practically disappeared after finishing the \"Beverly Hills Cop\" flicks. An early performance by Bill Pullman is also worth checking out. I think he's a real cool actor, but he usually plays the same yuppie roles. Here, he plays a dim-witted, trailer-trash airhead and is a delight to watch. There are so many funny moments that will stick in my mind forever, like when the serial killer invades the house. \"You look like my mother, I hate my mother.\" And the confusion that was created with the sex video was absolutely classic. I haven't seen a good comedy in a while, nor have laughed this hard in a while. That's why I was glad to catch this movie on the Starz Network, because it is one of the funniest comedies I've ever seen and nowadays, you ain't gonna see too many good comedies, nor great ones like this. A MUST-SEE!!! My score: 9 (out of 10)",
         "I thought this movie was hilarious. Almost everything anyone says has a double meaning. (The police chief and the hooker, the big dog, etc) This movie will keep you laughing from beginning to end. Bette Midler is terrific as the kidnapped rich man's wife, and Danny DeVito is also fabulous as the scheming rich man himself. There are thousands of great one-liners that you will keep quoting for years after you see this movie (I know I have) like the unforgettable \"I've been kidnapped by K-Mart!\" and \"You lying @#$*%^!!! Oh, honey, they made me say that!\" This is a must see! So go see it! Now! What are you still reading this for, you should be out renting the movie!!",
         "The executive of the clothing industry Sam Stone (Danny DeVito) tells his mistress Carol Dodsworth (Anita Morris) that he can not bear his wealthy wife Barbara (Bette Midler) anymore and that he is going to kill her. When Sam arrives at his mansion in Bel-Air with chloroform, he does not finds Barbara; sooner he receives a phone call telling that Barbara has been kidnapped and asking a five hundred thousand dollar ransom. Further, he is warned that he should not call the press or the police, otherwise Barbara would be murdered. However, forty-five minutes later, his house is surrounded by the police and the press and Sam is celebrating the abduction in his room, without any intention of paying the ransom and expecting that the kidnappers kill Barbara for him. Meanwhile, the clumsy and inexperienced kidnappers Ken Kessler (Judge Reinhold) and his wife and stylist Sandy (Helen Slater) have been lured in a business with Sam in the past, when he stole a design of Sandy an raised a fortune, and they are actually seeking a financial compensation for their loss; however they are having difficulties to handle with Barbara in the basement of their lower medium-class house. When Carol asks her stupid lover Earl Mott (Bill Pullman) to make a videotape of Sam killing Barbara, Earl commits a mistake and records the Chief of Police Henry Benton (William G. Schilling) having kinky and noise sex with a prostitute in his car instead. Carol decides to blackmail Sam with the tape believing he killed Barbara, and she sends a copy to Benton to press him to arrest Sam. Ken reduces the ransom to ten thousand dollars, but Sam refuses to pay while Barbara loses twenty pounds working out while imprisoned and befriends Sandy. When Barbara discovers the intentions of Sam, she decides to help the young couple to take Sam's money. \"Ruthless People\" is one of the funniest comedies of errors I have ever seen and re-seen. The plot is excellent, supported by a magnificent screenplay and wonderful performances highlighting Bette Midler and Danny DeVito). Bill Pullman in the beginning of his career is recognizable performing a tacky and stupid character. My vote is eight. Title (Brazil): \"Por Favor Matem a Minha Mulher\" (\"Please Kill My Wife\")",
         "Bette Midler, Danny DeVito, Judge Reinhold and Helen Slater all mixed and matched perfectly in this film about one loud and obnoxious woman. Hilarious in its implementation, the way the lives of the characters unfold in a funny and unpredictable manner. If you haven't seen this classic comedy, then get a whiff of this film, just to see the genius of DeVito and Midler in their primes. While the humor may be a little dated, it still offers some fairly clean fun for all to enjoy.",
         "Brought by the makers of AIRPLANE, RUTHLESS PEOPLE is a laugh riot of a movie. Danny DeVito leads the pack as a greedy millionaire who plans to murder his wife for her money, but becomes rapturous when she is kidnapped. DeVito is hilarious in the lead role. Judge Reinhold delivers a wacky performance as the kidnapper. Helen Slater does a great job \u0096 and she's also beautiful \u0096 as the kidnapper's fashion designer wife, but the real star of the movie is Bette Midler, as DeVito's kidnapped wife. Though this movie lacks a little bit of the quality that AIRPLANE had, it still has its share of really good performances and hilarious one-liners. Great entertainment! 4 out of 5",
         "This may well be the funniest American film of the 1980's, with nonstop laughs from beginning to end. The pace of the film is almost exhausting, your throat will be sore from laughing yourself silly. It's closer in style to British farce than probably any other American film I can think of. It also sports a great ensemble cast. This was Bette Midler's *real* comeback. And Danny DeVito is delightfully nasty. Probably of best note is an early role for Bill Pullman, who is the brain-dead boy-toy lover of Anita Morris' character. Not to be missed by comedy fans, but make sure you see the uncut version (on cable or video).",
         "I saw this film in the theatre when it was released in 1986. I have been to a lot of movies, and this is the only one that I HAD to see again--just to hear the lines that had been drowned out by the audience's laughter! Often a movie's previews will give away all the funny lines of a movie, and I remember that the previews for \"Ruthless People\" gave away the classic \"I've been kidnapped by KMart\" line. But for once, there were so many hysterically funny moments in this movie that it didn't matter. It's just that funny. So if you haven't seen it, you really are missing something. Rent it and be prepared to hurt your sides laughing.",
         "***POSSIBLE SPOILERS*** \"Ruthless People\" is wonderfully sardonic piece of work. This film not only suggests the world is filled with horndogs and idiots. It revels in the notion. Everyone here is well cast, including Helen Slater, and how often can you say that? Danny DeVito cranks up his Napoleon-Complex malevolence several notches, Bette Midler snarls through her role like it's anger-release therapy, and everyone else chips exactly as needed. When Bill Pullman drives up in a Gremlin and robs Judge Reinhold, who is in the middle of a ransom grab AND wearing a clown mask, I actually had to pause the tape and just laugh for ten solid minutes. That whole exchange is probably still in my top five comedy scenes of all time, and I haven't seen it in years. I'd recommend this sharp, wicked comedy to anyone, especially those who believe people's actions are governed by lust and avarice. Almost every joke here works, but more than that, the film's entire attitude will make you laugh. Any movie that salutes people's obsession with crotches is OK with me.",
         "\"Ruthless People\" has one of the best premises in film comedy history. Spandex miniskirt millionaire Sam Stone (Danny DeVito) plans to kill his battle axe wife (Bette Midler) for her inheritance. However, his plan is put on hold when she is kidnapped and held for ransom. The kidnappers threaten to kill her if Sam doesn't pay, which is a-o.k. with Sam, and means he doesn't have to do his own dirty work. But the kidnappers (Judge Reinhold and Helen Slater) are too kind hearted to follow through with what they start. Meanwhile, Sam's floozy mistress (a smokin' Anita Morris) knows about Sam's plans, and sends her doofus boyfriend (Bill Pullman) out to videotape what he thinks is Sam killing his wife so that they can blackmail him. This is a lot of plot to cram into a brisk 90 minutes, but this well written film never feels forced or rushed. Every scene conveys something important either for the story or about one of the characters, and not a moment feels wasted. The ensemble is terrific, each actor landing his/her jokes without fail. The standouts, though, are Bette Midler, who gives an outrageously vulgar performance pitched to the third balcony; and Judge Reinhold, who gives the film its heart. One of the most quotable movies ever, the film also boasts a great opening credits sequence, one more reason to lament the fact that movies hardly ever have opening credits anymore. Grade: A+"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Silver Screen Partners II"
      ],
      "summaries": [
         "Sam Stone is a clothing manufacturer, who married his wife Barbara, for the money that she was supposed to inherit from her dying father, but her father didn't die for another fifteen years. He is now planning to kill her and he tells his girlfriend Carol what he is going to do. He then on his way home to do just that but when he gets there, she's not there. He then receives a call from someone claiming to have kidnapped Barbara and threatening to kill her if he informs the police, which he does hoping that they do. What Stone doesn't know is that the kidnappers, Ken and Sandy are a couple whose idea for a garment he stole and made fortune off, are not that lethal, as a matter of fact Barbara's more lethal. And what Stone doesn't know is that Carol, has another boyfriend and they plan to blackmail Sam, by videotaping him disposing of Barbara's body. When her boyfriend, Earl goes there to do that, the person who goes there was not Sam but a guy with a hooker, and the guy instructs the hooker to scream her head off, Earl mistakenly believes that Barbara's not dead and that Sam was killing her there, and was so freaked out that he didn't bother to see if it was Sam. And Carol tries to put her plan in operation by sending Sam a copy of the tape, Sam thinks that it's for something kinky that Carol wants and when Sam tells her that he is going to do what was done on the tape to her, she assumes that he is going to kill her. So she sends another copy of the tape to the Chief of Police, and tells him that she wants him to arrest Sam for murdering Barbara, and the Chief is happy to oblige cause he is the guy who is on the tape. The Chief manages to find the instruments that Sam was going to use to kill Barbara and arrests him. Sam now has to get Barbara, alive, so that he can prove that he didn't kill her. And Barbara starts to bond with Sandy.",
         "When millionaire businessman Sam Stone returns home one day to find his wife Barbara missing, with a ransom demand following not long after, he is surprisingly happy -- for Sam hated Barbara, and was in fact planning to kill her himself. Now that she's been kidnapped, all he has to do is put off paying the ransom for as long as it take for the kidnappers to lose patience and kill her themselves. Unfortunately for Sam, however Barbara's kidnappers are sweet-natured Ken and Sandy Kessler, who are not particularly inclined to resort to murder, nor are fully prepared for Barbara's volatile, spoiled nature. Sam must therefore juggle the police, who are growing increasingly suspicious of Sam himself, and his own mistress, who has her own plans to get her hands on Sam's fortune. And then there's Barbara herself, who begins to both warm to her captors and wonder why it's taking so long for Sam to get the ransom organized.",
         "Slime ball businessman Sam Stone plots to murder his horrible wife for her money, so he can marry his mistress. He can't believe his luck when she is kidnapped by Ken and Sandy Kessler who wanted revenge from Sam for stealing their savings, and Sandy's money making fashion design, then marketing it as his own. When Barbara learns of what Sam has done to this couple and then realises that he isn't doing anything to secure her release, she becomes friends with her kidnapper and they plan to teach Sam a lesson.",
         "A couple, cheated by a vile businessman, kidnap his wife in retaliation, without knowing that their enemy is delighted they did."
      ],
      "budget": 0
   },
   "movielensId": 2463,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-06-26",
      "dvdReleaseDate": "2002-04-02",
      "directors": [
         "Jim Abrahams",
         "David Zucker",
         "Jerry Zucker"
      ],
      "runtime": 93,
      "movieId": 2463,
      "title": "Ruthless People",
      "mpaa": "R",
      "actors": [
         "Danny DeVito",
         "Bette Midler",
         "Judge Reinhold",
         "Helen Slater",
         "Anita Morris",
         "Bill Pullman",
         "William G. Schilling",
         "Art Evans",
         "Clarence Felder",
         "Gary Riley",
         "J.E. Freeman",
         "Frank Sivero"
      ],
      "imdbMovieId": "0091877",
      "originalTitle": "Ruthless People",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "WXQesfEZ1wo",
         "JjFhnqo9nQI"
      ],
      "plotSummary": "A couple, cheated by a vile businessman, kidnap his wife in retaliation, without knowing that their enemy is delighted they did.",
      "tmdbMovieId": 12151,
      "avgRating": 3.38937,
      "releaseYear": "1986",
      "numRatings": 3593,
      "posterPath": "/nH0nq1Nk7jTlZv1aj7SnspMJyQy.jpg"
   }
}