{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "success",
            "id": 3836
         },
         {
            "name": "author",
            "id": 10818
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0120618",
      "video": false,
      "title": "Breakfast of Champions",
      "recommendations": [
         83489,
         55336,
         73249,
         36739,
         273610,
         48464,
         291326,
         27202,
         190967,
         12257,
         36629,
         30500,
         18856,
         13201,
         34601,
         32872,
         76297,
         57289,
         109466,
         41971
      ],
      "backdrop_path": "/61Woa0KSlUBPxlb10rxNA34ISD2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dwayne Hoover",
               "gender": 2,
               "credit_id": "52fe44e99251416c75045375",
               "name": "Bruce Willis",
               "profile_path": "/kI1OluWhLJk3pnR19VjOfABpnTY.jpg",
               "id": 62,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kilgore Trout",
               "gender": 0,
               "credit_id": "52fe44e99251416c75045379",
               "name": "Albert Finney",
               "profile_path": "/2BTzSQUa3RXPqeeNjbJqnyIBePE.jpg",
               "id": 3926,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Harry Le Sabre",
               "gender": 2,
               "credit_id": "52fe44e99251416c7504537d",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Celia Hoover",
               "gender": 1,
               "credit_id": "52fe44e99251416c75045381",
               "name": "Barbara Hershey",
               "profile_path": "/gaimK3QeNS32Wjryw03QC0PXWKO.jpg",
               "id": 10767,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Francine Pefko",
               "gender": 1,
               "credit_id": "52fe44e99251416c75045385",
               "name": "Glenne Headly",
               "profile_path": "/a90ZslKOvecuy7doMWXsFc1Aoc4.jpg",
               "id": 21104,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "George 'Bunny' Hoover",
               "gender": 2,
               "credit_id": "52fe44e99251416c75045389",
               "name": "Lukas Haas",
               "profile_path": "/1n1CTF6fi52BF407iQU6aMMKWFU.jpg",
               "id": 526,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "55640e059251414261000c6b",
               "name": "Omar Epps",
               "profile_path": "/t4Qg5ANKK2idfOt4RzWzhiP7IEv.jpg",
               "id": 4987,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Moe The Truck Driver",
               "gender": 2,
               "credit_id": "58550dd39251416f1003e03b",
               "name": "Will Patton",
               "profile_path": "/qpycaaWP1oUx1Wd2lMBfQtR7qDO.jpg",
               "id": 883,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Howell",
               "gender": 2,
               "credit_id": "58550df0925141724d0123a0",
               "name": "Michael Jai White",
               "profile_path": "/zvt4lOlPVVq1MZXmJDWNmBQDnWl.jpg",
               "id": 64856,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Bonnie MacMahon",
               "gender": 1,
               "credit_id": "58550e04c3a3682f5803adbc",
               "name": "Shawnee Smith",
               "profile_path": "/yx1HYEalFsiNVc2imDDfhIZthkn.jpg",
               "id": 2138,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Eli",
               "gender": 2,
               "credit_id": "58550e2fc3a36806a702f241",
               "name": "Michael Clarke Duncan",
               "profile_path": "/A0fXStrmFubDRFS8UeRW7xvcf6S.jpg",
               "id": 61981,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Grace Le Sabre",
               "gender": 1,
               "credit_id": "58550e77c3a36806a702f268",
               "name": "Vicki Lewis",
               "profile_path": "/vXKKbsYikbLZ3DS1GbCWwMoqDN7.jpg",
               "id": 14723,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Monte Rapid",
               "gender": 2,
               "credit_id": "59e392f39251410b6700021d",
               "name": "Owen Wilson",
               "profile_path": "/j7oYgvfDiO34VcFdSB7GhM2CSle.jpg",
               "id": 887,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e99251416c75045395",
               "name": "Alan Rudolph",
               "profile_path": "/At4tWcBv2zElH82zrFFLkEdm4KA.jpg",
               "id": 72427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e99251416c7504539b",
               "name": "David Blocker",
               "profile_path": null,
               "id": 28154,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e99251416c750453a1",
               "name": "David Willis",
               "profile_path": null,
               "id": 21220,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e99251416c750453a7",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e99251416c750453ad",
               "name": "Elliot Davis",
               "profile_path": null,
               "id": 5506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44e99251416c750453b3",
               "name": "Suzy Elmiger",
               "profile_path": null,
               "id": 10419,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58f65bc3c3a36841d30014be",
               "name": "Kurt Vonnegut Jr.",
               "profile_path": "/6udG5CbuOheKRtdbP1YNAWy3ysd.jpg",
               "id": 1384517,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.208866,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12479,
      "vote_count": 33,
      "budget": 12000000,
      "overview": "A portrait of a fictional town in the mid west that is home to a group of idiosyncratic and slightly neurotic characters. Dwayne Hoover is a wealthy car dealer-ship owner that's on the brink of suicide and is losing touch with reality.",
      "similar": [
         843,
         37265,
         4507,
         28468,
         884,
         787,
         2539,
         9716,
         27066,
         283227,
         69,
         244772,
         258,
         21484,
         247,
         12102,
         35056,
         2898,
         634,
         639
      ],
      "original_title": "Breakfast of Champions",
      "runtime": 110,
      "poster_path": "/oOEkGtAcysCV1pJAB3qFlOG76hj.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
         "name": "Hollywood Pictures",
         "id": 915,
         "origin_country": ""
      }],
      "release_date": "1999-02-13",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alan Rudolph"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Kurt Vonnegut Jr.",
         "Alan Rudolph"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120618/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4MDU4NTkwOF5BMl5BanBnXkFtZTcwNjAzNTUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bruce Willis, Nick Nolte, Albert Finney | See full cast and crew »"],
      "reviews": [
         "This movie is one of the best I have ever seen. True. I am very surprised seeing the average mark only 4.1. \"Why it is so?\", I wondered. I'll try to explain. Firstly, \"Breakfast of champions\" is'nt a comedy, but drama. How it can be a kind of comedy if the only one laugh is hysterical always and, besides that, the main hero tries to commit a suicide several times? Secondly, it's a story how an unhappy man - despite challenges of life - can find a path into his soul. Okay, this movie isn't an entertainment though. Ir requires much more attention, cerebration than any comedy does. And it forces to think about your place in the world. That's it. And please do not sneer at my comment:)- it's only my opinion, of course:)",
         "\"Breakfast of Champions\" successfully brings Vonnegut's bizarre, abstract writing style to life. Of course, it would be impossible to incorporate all of the odd elements of the novel into a film that is only 2 hours long, but, surprisingly, this movie nails just about all of them. In a hybrid between \"Fear and Loathing in Las Vegas\" and \"Cadillac Man,\" this film captivates the audience from the moment Vonnegut's illustrations accent the opening credits to the extremely twisted ending. The entire cast puts on an unbelievable show, especially Bruce Willis, who gives the comedic performance of his lifetime as Dwayne Hoover. Fantastic filming combines with Vonnegut's ideas to weave the seamless tapestry of insanity that is \"Breakfast of Champions.\"",
         "I do not pretend to \"get\" this adaptation of Kurt Vonnegut, Jr.'s novel, but I certainly enjoyed the ride. Vonnegut is almost impossible to film, \"Slaughterhouse Five\" is the most successful, while I have reserved a special place in my bowel tract for Jerry Lewis in \"Slapstick (of Another Kind).\" The plot, for what it is, goes a little something like this. Bruce Willis is Dwayne Hoover, who runs a giant car dealership in Midland City. His spaced out wife Barbara Hershey pops pills and watches television all day. His son Lukas Haas is a lounge singer, dropping his first name George in exchange for Bunny. Nick Nolte is Willis' sales manager, a paranoid cross dresser. Glenne Headly is Willis' receptionist and mistress. Willis does not seem to be going through a midlife crisis so much as a nervous breakdown. The people around him notice a change to his behavior, as his sincere grin flashes on his commercials, which play nonstop, he is in his own personal hell. He is asking the question many of us ask: why are we here? As his life crumbles around him, he sticks a gun in his mouth three different times, never following through with a way out that would not answer his ultimate question. Omar Epps is a released prison inmate who wants to work for Dwayne Hoover just because their names are similar. He probably gets the most mainstream laughs, as he lives out of his new car on the car lot, turning it into something nicer than a few of my former apartments. Into this nightmarish fray comes writer Albert Finney. He has written two hundred novels and two thousand short stories, but they have all been published by porno mags and hardcore sex novel publishers. He is invited to Midland City for an arts festival, and the novel he has may contain the answer to life that Willis is looking for. The film lurches along through Willis and company's day. Everyone has a quirk, and that may be a detriment, as the viewer has trouble latching onto someone to help wade through all the eye candy. Director Rudolph pulls out all the stops, throwing in visual effects that dazzle. He also wrote the screenplay, and shows a true affection for the source novel. Mark Isham's musical score is perfect- Muzak on crack. The performances in this over the top story are uniformally brilliant. Willis has not been able to be this loose onscreen in a very long time, and he seems to be having a ball. There are no bad actors here, and look for Owen Wilson and Michael Clarke Duncan in small roles. The description of this film on the video box likens this to a mainstream comedy, and that is a huge mistake. People renting this and expecting \"Airplane!\" or some Adam Sandler drivel are going to be supremely disappointed. This is weird, deep stuff that a lot of people out there will not consider their cup of tea. On the other hand, Rudolph pulls out all the stops, shows us the weird and crazy, then tries to get us to care about the plot. In fact, this film is not a plot driven film, it is character driven, but Rudolph tries to keep this one convention in an otherwise unconventional film. This is truly one of the most bizarre films ever made, right on the line with \"Fear and Loathing in Las Vegas.\" Where drugs fueled the mania in that impossible film, here the mania is caused by something we deal with everyday- life. I recommend \"Breakfast of Champions.\" This is rated (R) for physical violence, profanity, strong sexual content, sexual references, drug abuse, and adult situations.",
         "Kurt Vonnegut's satirical novel of 1973 resonates as deeply now as it did way back then. The themes of suburban paranoia and soulless consumerism have motivated some of the best films of the last twelve months, so an inspired interpretation of Breakfast of Champions would have been warmly endorsed. It's clearly been a labour of love for director Alan Rudolph, who has tried for twenty years to make this film. Sadly, twenty years of work appears to have produced one bad draft copy. And Rudolph does not have the slightest grasp on what is funny. Nick Nolte wanders aimlessly around in a dress but it isn't funny. Albert Finney searches out his chaotic literary masterpieces in pornographic magazines but it isn't funny. Barbara Hershey's character is a product of the chaos, but her appearances lack a motive. She isn't required until the film bursts into chaotic life in its last ten minutes. This means three great actors are left stranded. It results in the unlikely event of Bruce Willis stealing the acting honours. He is good, but one feels it would have been no great stretch to act insane. Among the problems here is that the film keeps its feet on the ground. While we're expected to believe the world has gone mad, the actual events are as uninspired as they are unfunny. This doesn't mean it is any easier to understand. In fact, without having read the novel, you'd most likely be lost from the beginning. The chaos of Vonnegut's vision was its real joy. The way characters conspired to come together was inventive. The film though plays like a cliche. The ending is anarchic, but you get the impression it only serves one purpose: to stop you making rational sense of the rest of the film. And as much as you want to like it, or applaud Rudolph's commitment, the truth is that BREAKFAST OF CHAMPIONS is a sad, poor film.",
         "I am guessing that if you showed this movie to ten random strangers, eight of them would not like it. However, I would be one of the two that did. I love strangeness. I love to see people meltdown. I love to see weird characters that are hopelessly lost. I also love to see Vonnegut brought to the big screen once again. This movie is an eclectic mix of odd-ball characters trying to find their place in this strange thing we call life. With neat observations taken from the book, it is very true to the written predecessor. The cast is incredible and the story very entertaining. If you like crazy and odd films (David Lynch) fans, you might want to rent it. I really enjoyed it!",
         "I'm afraid that in the era of pop-no-where-ism, where the reality show sets the rules; films like this one will get worse and worse reviews as time moves on. I didn't read Vonnegut until my early thirties and I grew up with Vonnegut's as a kid-no kidding. When I started reading, I just read and read in one extensive gulp. First, there's no good way to try to adapt a Vonnegut book to film. To the reviewers -if you can call them that-who say I've read the book and this movie is a miserable adaptation-go figure?! This is a very good vetting of the themes Vonnegut loves, and using the rambling urban neuroses approach, mastered by Altman, Rudolph revvs us up for the big psychic upchuck that this is all about. This is not a great movie but given the importance of self reflection to American society and the rarity of it, in contemporary society-this movie is a landmark and a watermark, both.",
         "I find it hard to believe that IMDb users so overwhelmingly disliked this utterly charming movie. Of course it's chaotic, that is the film's thematic core. Of course it's wacky, it's Vonnegut! I thought both Willis and Nolte turned in amazingly controlled performances, considering how over-the-top they could have allowed themselves to be, given the script. I hope this is not an indication that user's of the Database prefer the predigested pap routinely served up by the studios. This is a truly wonderful romp! Hey! Get with the program, IMDbers!",
         "Though it's bound for negative comparison with the sober, Joe Pro, Oscar-friendly AMERICAN BEAUTY, I vastly preferred Alan Rudolph's vision of suburban life gone bonkers. His adaptation of Kurt Vonnegut's best (and most scabrous) novel starts with one genius style choice: Rudolph mates the Pop Art Expressionism of Oliver Stone with the group-hug ensemble of his mentor, Robert Altman. Beneath the blizzard of smily-face pins, digital-display Colonel Sanders, and chain-diner Muzak lies a Tiffany cast. Bruce Willis is the face of desperation under a stick-on grin as the car-salesman hero, Dwayne Hoover, a small-town hero who doesn't know why he's a few cards short of a full deck. As his second banana, Nick Nolte is a dream as a hard-working joe who's so guilty about his sexual kinks they seem to leak out of him like flopsweat. And as the movie's resident seer and soothsayer--a derelict sci-fi genius named Kilgore Trout--Albert Finney is so perfect Rudolph seems to have plucked him from out of an Iowa City dumpster. Rudolph's attempts at stars-and-stripes Expressionism don't all work; some uncharitable folks will be reminded of late-sixties I-hate-America bashes like END OF THE ROAD. But I have always had a soft spot for those pictures, and I feel protective toward BREAKFAST OF CHAMPIONS as well. Blessings are showered upon Bruce Willis for scratching this dark-horse project out of thin air, and upon Rudolph too. He must have known that propelling himself out of his usual world of downbeat, canoodling romanticism would pull out of him the best work of his career.",
         "This is a very different movie. Its about a successful carseller somewhere in the US. A carseller that is going mad and is very depressed. He doesnt know what it's all about. He seems tired of the way his life is. Bruce Willis makes and extremely good performance in this role. As an employee, we have Nick Nolte. A very comical character, who always sucks up to the boss (Bruce Willis). He's desperate to hide something from him, and that's seems to be the only thing he thinks of. Nolte is very very funny in this role. Then we have Albert Finney, who also makes a strong effort here. He plays the cynical and depressed author, who for once in his life gets attention. It's a very strong movie, with great actors and the perfect, sad music to accompany it all. It's very touching and filosophical. The ending is wonderful! I cant really explain it all in words...I have only one thing to say to you: GO SEE THIS MOVIE !! Its truly great! I give it a 10!",
         "After a recent Vonnegut reading binge I was eager to see Breakfast of Champions when I saw it on the video shelf. A great cast, a director (Aland Rudolph) who has made several films I've enjoyed (Choose Me, The Moderns, Trouble in Mind). Sadly, BofC is quite a disappointment. Two things really stick out for me. Although Bruce Willis was quite good as Dwayne Hoover, too many of the other characters, notably Harry LeSabre (Nick Nolte) and Wayne Hoobler (Omar Epps) are portrayed in frenetic over the top performances. OK...we get it that there are all sorts of crazies running amuck in Midland City, but the point Vonnegut was making in his novel was that this madness is displayed in the \"normal\" everyday way that we live our lives in America. The values (consumerism, greed, violence) and actions that are considered normal in the United States are themselves proof that we are all suffering from a form of madness...showing these fine actors jumping around and uttering indecipherable gibberish shows only that they are annoying. The film also has a problem in creating a consistent point of view. In the novel the author guides us through Dwayne Hoovers' unfolding madness and is actually a character in the book. The movie can't give us the background information the books' narrator did and I would guess that anyone who hasn't read the book will find the movie tough going...perhaps downright incomprehensible. Lastly, as a great fan of Kilgore Trout (Vonnegut fans know him as a character who pops up in several Vonnegut novels) I thought Albert Finney did quite a nice job; he had just the right air of unkempt, curmudgeonly, insane genius that makes Trout my favorite Vonnegut character of all time. Still, it's hardly enough to save this mess...I admire the effort in bringing Breakfast of Champions to the screen, but in the end it's likely that this is an unfilmable novel."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Flying Heart Films",
         "Hollywood Pictures",
         "Rain City"
      ],
      "summaries": [
         "A portrait of a fictional town in the mid west that is home to a group of idiosyncratic and slightly neurotic characters. Dwayne Hoover is a wealthy car dealer-ship owner that's on the brink of suicide and is losing touch with reality.",
         "Breakfast of Champions chronicles the meeting between Dwayne Hoover, an unstable Pontiac dealer, and Kilgore Trout, an \"overly creative\" science fiction writer.",
         "Dwayne Hoover è un venditore d'auto ed è l'uomo d'affari più rispettato e più ricco di Midland City. A causa di un esaurimento nervoso decide di farla finita e, mentre è seduto nel suo bagno con una pistola in bocca, viene interrotto dalla domestica, Lottie, che gli annuncia che i suoi cereali - la sua 'colazione dei campioni' - sono pronti in tavola. Partendo da questo assunto grottesco, si dipanano le vicende di Hoover e di Kilgore Trout, scrittore fallito, che decidono di prendere parte al primo Festival d'Arte di Midland City (città immaginaria, che rappresenta la stupidità ed il provincialismo). I due decidono di andare al Festival per mettere in piazza il loro fallimento e rinfacciare la situazione ad una società che ritengono ingiusta, interessata soltanto al successo ed ai soldi. L'epico incontro tra i due, oltre ad amplificare enormemente le loro follie, provoca lo scontro dei loro due mondi, scatenando una serie di avvenimenti indimenticabili per la loro sonnolenta ed ipocrita cittadina. Dwayne Hoover è l'incarnazione del sogno Americano del successo e, comunque, è sull'orlo del suicidio : qualcosa non gira per il verso giusto nella società più opulenta della Terra. Il film è una satira pungente e rassegnata della società Americana : c'è ancora speranza ? Alan Rudolph, già allievo di Altman, ha tratto il film dal romanzo di successo di Kurt Vonnegut Jr., scritto vent'anni fa per denunciare la stupidità e la pericolosità del 'dopo-Vietnam' (sfociata nella corsa al successo ed al denaro per dimenticare il passato). E' in fondo uno specchio esilarante e tragicamente vero sulla follia della vita contemporanea, Americana e non."
      ],
      "budget": 12000000
   },
   "movielensId": 2507,
   "movielens": {
      "languages": [
         "Český",
         "English",
         "Français"
      ],
      "releaseDate": "1999-02-13",
      "dvdReleaseDate": "2000-06-30",
      "directors": ["Alan Rudolph"],
      "runtime": 110,
      "movieId": 2507,
      "title": "Breakfast of Champions",
      "mpaa": "",
      "actors": [
         "Bruce Willis",
         "Albert Finney",
         "Nick Nolte",
         "Barbara Hershey",
         "Glenne Headly",
         "Lukas Haas",
         "Omar Epps",
         "Will Patton",
         "Michael Jai White",
         "Shawnee Smith",
         "Michael Clarke Duncan",
         "Vicki Lewis",
         "Owen Wilson"
      ],
      "imdbMovieId": "0120618",
      "originalTitle": "Breakfast of Champions",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A portrait of a fictional town in the mid west that is home to a group of idiosyncratic and slightly neurotic characters. Dwayne Hoover is a wealthy car dealer-ship owner that's on the brink of suicide and is losing touch with reality.",
      "tmdbMovieId": 12479,
      "avgRating": 2.60425,
      "releaseYear": "1999",
      "numRatings": 494,
      "posterPath": "/oOEkGtAcysCV1pJAB3qFlOG76hj.jpg"
   }
}