{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "undercover",
            "id": 1568
         },
         {
            "name": "drug traffic",
            "id": 2149
         },
         {
            "name": "based on tv series",
            "id": 10988
         }
      ],
      "imdb_id": "tt0120757",
      "video": false,
      "title": "The Mod Squad",
      "recommendations": [
         12596,
         38554,
         9452,
         20009,
         16784,
         22076,
         83078,
         30500,
         32229,
         10109,
         206,
         32162,
         37850,
         32150,
         74718,
         2185,
         9776,
         2162,
         15513,
         35851
      ],
      "backdrop_path": "/mFdIufbglU7Hpsv3ZAy3kbZEXvF.jpg",
      "revenue": 13260050,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Julie Barnes",
               "gender": 1,
               "credit_id": "52fe46ce9251416c75084161",
               "name": "Claire Danes",
               "profile_path": "/6Lr3Yc53iifCPtJz1jTzjhVxa0j.jpg",
               "id": 6194,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Peter Cochran",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084165",
               "name": "Giovanni Ribisi",
               "profile_path": "/jvq2pimmpNdQj8o75Au9RKC7E1z.jpg",
               "id": 1771,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lincoln Hayes",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084169",
               "name": "Omar Epps",
               "profile_path": "/t4Qg5ANKK2idfOt4RzWzhiP7IEv.jpg",
               "id": 4987,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Captain Adam Greer",
               "gender": 2,
               "credit_id": "52fe46ce9251416c7508416d",
               "name": "Dennis Farina",
               "profile_path": "/o649nAtUimSZxEV6xa5JbMSgsED.jpg",
               "id": 1117,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Billy Waites",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084171",
               "name": "Josh Brolin",
               "profile_path": "/x8KKnvHyPvH16M6waAnY1OeCtA8.jpg",
               "id": 16851,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Det. Briggs",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084175",
               "name": "Steve Harris",
               "profile_path": "/ec3hNbeFCvtIe4JqGtskQ0mhITt.jpg",
               "id": 2202,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Det. Bob Mothershed",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084179",
               "name": "Richard Jenkins",
               "profile_path": "/iz61iPIgNUp0yk48bRNjEJ5GHO4.jpg",
               "id": 28633,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Pete's Father",
               "gender": 2,
               "credit_id": "598e72be92514167660051e8",
               "name": "Holmes Osborne",
               "profile_path": "/gMeHJT6u5VRO8RnAgPuBYrB7Krn.jpg",
               "id": 1578,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ce9251416c7508417f",
               "name": "Scott Silver",
               "profile_path": "/vRblvymfxaMd7Lsqs4ypVAfnJK.jpg",
               "id": 324,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084185",
               "name": "Stephen T. Kay",
               "profile_path": "/wN9Vxi5dvDNSV70kV3P1LQvx5EM.jpg",
               "id": 56435,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ce9251416c7508418b",
               "name": "Kate Lanier",
               "profile_path": null,
               "id": 66598,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084191",
               "name": "Scott Silver",
               "profile_path": "/vRblvymfxaMd7Lsqs4ypVAfnJK.jpg",
               "id": 324,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57365b10c3a3687e24000df4",
               "name": "Buddy Ruskin",
               "profile_path": null,
               "id": 1235182,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.046594,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16379,
      "vote_count": 46,
      "budget": 50000000,
      "overview": "Three minor delinquints (Danes, Ribisi, and Epps) are recruited by a cop (Farina) working undercover to bust a cop/drug ring. When the officer who recruited them is killed, they go above and beyond the call of duty to solve the murder; and bust the drug ring. Suffering the jibes, and ridicule of fellow officers; they struggle to save their names, and that of their deceased benefactor.",
      "similar": [
         1900,
         2034,
         1051,
         257088,
         4836,
         4133,
         11062,
         253,
         8961,
         10775,
         136400,
         341013,
         699,
         1089,
         754,
         13815,
         4982,
         26389,
         2252,
         1576
      ],
      "original_title": "The Mod Squad",
      "runtime": 92,
      "poster_path": "/7c20VEblNKkDiBuA6bE6kbeHqHa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1999-03-26",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "First they broke the law. Now they are the law.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Scott Silver"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Buddy Ruskin",
         "Stephen Kay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120757/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMzgyNTc5Ml5BMl5BanBnXkFtZTcwNzE0ODI1NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Claire Danes, Omar Epps, Giovanni Ribisi | See full cast and crew »"],
      "reviews": [
         "If the writers of a movie don't care about the characters inhabiting the world they create, nor the actors portraying them, or the director ostensibly creating a dynamic, well it doesn't seem realistic the audience will care either. To call this movie slapdash is an undeserved compliment--it's likely they figured it was a lost cause and that no amount of work would improve it. That's probably true. Omar Epps isn't a very good actor to begin with, but here he's even worse than usual, mumbling his lines without a clue as to what is going on in the movie. Giovanni Rabisi seems to have fun with his role, but playing one imbecile after another, one gets the feeling he may not be so much acting as giving a glimmer as to his real personality. Claire Danes obviously can act, as she showed in \"Little Women\", but here she's dreadful. Dennis Farina is good in just about anything, but here he's given absolutely no help by the director or the other actors. The movie quickly devolves into a series of music videos with bad seventies music intermixed with more modern stuff. And this squad is not very mod--the opening sequence notes that mod means fashionably dressed, and these guys look like they've been shopping by picking up things strewn on the side of an interstate. Go elsewhere for entertainment.",
         "Young writers, young auteur, young cast, busload of producers, what could go wrong? Everything. Even lame is too good a description, that suggests that three of four legs were functioning, when actually, none of them were. Barely enough recycled plotline for a 48 and a half minute television hour, gratingly stretched to ninety minutes. The audience was talking back to the screen, so bad was the story. Dirty cops steal drugs from the evidence locker. How many thousands of times has this been done on television? Bad cops frame good cops. Again, how many times? There was not an original shred in this entire concoction. Giovanni Ribisi made a valiant effort to prop up the lack of script, drawing the only laughs of the entire movie. And the thought of he and Claire Danes working from a real script with a grown-up director and photographed by an actual cinematographer intrigues me. Note to screenwriters: Buy one of those story generators. It can't possibly be as bad as ripping off bad television. Note to auteur: There are shots available to you other than closeups. Even the lovely and interesting face of Claire Danes eventually grows tiresome in closeup. Note to cinematographer: Apprentice yourself to a professional for a few years--you have much to learn. Note to color timer at the lab: At least try to persuade the auteur and the cinematographer that they don't know what they're talking about. Note to Claire: I hope this paid for your new condo. It's time to get some professional management and start actually reading the scripts before signing on.",
         "So many reviews I have read rail on the poor quality of the film. The two biggest complaints are lack of adult dialogue and lack of action. Me, I thought it was one of the best movies I have ever seen. They are kids, not adults. That's the way kids talk. As far as action, I found the emotional struggles to be far more compelling than the action scenes (which, do not, BTW, define a good film). One user even commented that there is no way kids could get around by themselves like that. I was a kid living on the streets when I was younger, and what they accomplish in the movie is certainly not the least of what I have personally witnessed on the street. For those who think only kids like this movie, I am 24. I think this film has been judged by all the wrong standards, and that not enough credibility is given to this straightforward portrayal of kids in trouble. If you think kids are incapable of these things, try watching the movie \"Kids.\"",
         "The mod squad gets started 'after' the formation of the 'Mod Squad' without even bothering to develop any of the characters or show us why anyone is doing what they are doing. Moreover, most of the events in the movie seem ancillary to the plot. Without even a smack of character development, the plot meanders from Gen-X club scenes to action scenes and back again.",
         "I was extremely disappointed with Mod Squad as a movie. There were a number of points which were never explored fully in respect to the character development. The script jumped from point to point without ever clearly explaining the real direction of the plot or the characters. Neither I nor the three people with me ranging from 18 to 85, could work out why the three young 'Mod Squad' members were recruited. We had no idea what they'd done to land themselves in hot water to begin with so they could have been murderers (no sympathy there). The action was minimal the highlight being an old car crashing through a metal door. \"When was that film set?\" my eighteen year old daughter asked me. The clever young actor from the \"Other Sister\" relied on the most basic of performance tricks such as shouting, to even be noticed. Long lingering shots of the female lead became dull. The young black actor had little to work on in his scripted characterisation. I found myself confused between the good and the bad cops and why a call to the police precinct, which had set up the criminal \"bust\" finale , was so obligingly received and acted on so promptly. The police were called to the scene as backup for our hero who was then an escaped felon (or was he????). The direction in my opinion was experimental to the point of distraction. One scene had our three protagonists in the front seat of a car plotting their next move. This was the bench mark. We saw the camera pan left, right, right, left, right, left then left again so continuously I became dizzy. The recording quality of the hand held reporters cassette recorder, the contents of which wrapped up the entire Mod Squad case was \"studio quality\" amazing!!! I see a minimum of sixty films a year. This was one of the least effective in a decade. my vote is 2 out of 10.",
         "I must preface this comment with a sort of admission: I suppose I just have a soft spot for the original 60s-70s TV series. I think the filmmakers here blew it from the get-go as far as casting: in a supposed remake, audiences would look for reflections of the hip, athletic Linc (Clarence Williams III), or the cool, with-it Michael Cole, and so forth. Instead, we get Giovanni Ribisi as a poor-little-white rich boy who comes off as just pathetic, like he is in all his roles (in the office I used to work in, I amused myself once by creating a fake movie poster, casting various actors as members of the office staff; guess who I cast as the dorky son of the company President?). Danes does OK as the new Julie, but none of the characters have much to do, as the story just sort of sits there, mired in conventionality. So it's quite forgettable, besides. What was I talking about?",
         "This movie started off terrible and then settled into mediocrity.Claire Danes is an attractive and talented actress but she's wasted in this. Giovanni Ribisi has to be one of the most annoying, slack-jawed actors out there,and his character is just as annoying as he is. Omar Epps seems preoccupied with appearing cool(you don't pull it off, Omar). Dennis Farina isn't in this that much,lucky him.That's too bad,because he's a good, likeable actor(that's more than I can say for Ribisi and Epps). The plot is a tired,boring police corruption set-up that's been done much better a million times(L.A. Confidential,for one). Just chalk this one up as another failed T.V. show into movie adaption(which,arguably is pretty much all of them,except for The Fugitive and The Untouchables). ** out of four stars.",
         "60s and 70s television show remakes are everywhere. \"Charlie's Angels\" and \"Starsky and Hutch\" are just two of the more profitable franchises (the latter of the two bringing in $28 million in its first week). But both of those series tend to have fun with what they're parodying, rather than remaking. \"The Mod Squad\" is basically just a remake of the show of the same title, minus any real sort of substance and humor, and only a low amount of actual fun. It could have been a blast, but it's just rather mediocre. Three young delinquents (Claire Danes, Giovanni Ribisi and Omar Epps) are recruited by a cop (Dennis Farina) to infiltrate many various operations (prostitute rings, drug circles) that police could never get into. But after their boss is murdered and they uncover a conspiracy, the three delinquents take it upon themselves to find out the truth behind the crime. 2.5/5 stars. - John Ulmer The plot is pretty weak, even for a 60s TV show remake. \"The Mod Squad\" ran from 1968 - 1973, with somewhere in the vicinity of 120 episodes. I never saw any, but I can't imagine this film adaptation does the show much justice. The cast is considerably OK. Danes is quite enthusiastic and pretty enough for her sweet-blonde role, Ribisi is fine as a criminal and Epps is decent enough, too. Farina (\"Get Shorty,\" \"Another Stakeout\") is a good actor, always very funny, but here his role is completely wasted (literally!) and short on the sort of sly humor that would have been appropriate given the actor behind it. The dialogue is really corny, and so are the characters' actions. Television shows need not worry about smart dialogue or characters, because they're usually 30 minutes long (sometimes an hour), and we just get \"hooked\" on what's going on. Can you imagine if a soap opera made its way onto the big screen? It'd completely flop. People watch television shows because they like to see continuous stories with recurring characters they learn to love over a certain time period. You can't get any joy out of watching a bunch of actors try to grow on you for 90 minutes. If \"Alias\" had ever started out as a big-screen movie, it might have flopped, because let's face it: the show is not exactly quality material. People watch it because they get hooked on it, and they enjoy watching the stories and the revelations, like an old woman addicted to her \"General Hospital\" episodes. So here's proof that if \"The Mod Squad\" had originally been a movie, there probably would have been no television show. Despite some rather bad word-of-mouth, this movie isn't a terrible one. I've seen much worse, and compared to big-screen disasters like \"Freddy Got Fingered,\" or low-budget ones like \"The Blade Master,\" this is nothing very laughable at all. But compared to the fun factor of \"Charlie's Angels\" or \"Starsky and Hutch,\" \"The Mod Squad\" falls flat on its face. It's not very funny, it's not very fun, and it's not very original. It's a cash-in, which is something Hollywood is not in short supply of right now. If you miss \"The Mod Squad,\" you're not missing anything that hasn't been done before.",
         "So, it's Friday night and you want to go watch a movie...all you want is something entertaining, not too artsy, or anything that might require a long night of philosophical discussions. So, you pay $10 to watch the Mod Squad. The trailer to this movie should have tipped me off, but come on...it's three of Hollywood's most beautiful people--eye candy. But that's about it...a string of moving Prada ads. And what did Hollywood producers forget? A plot. Why are these kids running around the streets after some unknown enemy? Where are they? But, don't worry, after a while, you'll just stop caring. I was on the verge of walking out of this movie, because I thought sitting in my room and staring at the wall might have been more productive (and free), but by that time, it was over (90 minutes--it's only saving grace). So, still willing to waste $10? Go, get yourself a nice hot meal.",
         "The DVD sleeve explains the premise: \"Three problem teens are headed for jail,\" and are \"set to do time until Captain Greer offers them a deal to work for him - undercover.\" The film opens with definitions of the words \"Mod\" and \"Squad\", so you won't have to look them up in the dictionary. For a visual definition of \"Cool\", search for photographs of the original threesome: Michael Cole (as Pete Cochran), Clarence Williams III (as Linc Hayes), and Peggy Lipton (as Julie Barnes). One black. One white. One blonde. Once they defined cool. The three who make up Scott Silver's version of Aaron Spelling's \"The Mod Squad\" are twentysomethings: Claire Danes (as Julie Barnes), Giovanni Ribisi (as Pete Cochran), and Omar Epps (as Linc Hayes). They aren't able to do much with the material given. Mr. Ribisi's portrayal is the most \"far out\", meaning he digresses most from the original characterization. Ms. Danes romances Josh Brolin (as Billy Waites), who looks like he could be in a re-make of \"Marcus Welby, MD\". You won't believe hefty Michael Lerner dancing with Mr. Epps' \"Linc\". He explains, \"I'm not a fairy, I just like to dance!\" and requests, \"Spin me!\" *** The Mod Squad (1999) Scott Silver ~ Claire Danes, Giovanni Ribisi, Omar Epps"
      ],
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Three minor delinquints (Danes, Ribisi, and Epps) are recruited by a cop (Farina) working undercover to bust a cop/drug ring. When the officer who recruited them is killed, they go above and beyond the call of duty to solve the murder; and bust the drug ring. Suffering the jibes, and ridicule of fellow officers; they struggle to save their names, and that of their deceased benefactor."],
      "budget": 50000000
   },
   "movielensId": 2568,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-03-26",
      "dvdReleaseDate": "1999-08-24",
      "directors": ["Scott Silver"],
      "runtime": 92,
      "movieId": 2568,
      "title": "The Mod Squad",
      "mpaa": "R",
      "actors": [
         "Claire Danes",
         "Giovanni Ribisi",
         "Omar Epps",
         "Dennis Farina",
         "Josh Brolin",
         "Steve Harris",
         "Richard Jenkins",
         "Holmes Osborne"
      ],
      "imdbMovieId": "0120757",
      "originalTitle": "The Mod Squad",
      "genres": [
         "Action",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["67cdXuWnRKs"],
      "plotSummary": "Three minor delinquints (Danes, Ribisi, and Epps) are recruited by a cop (Farina) working undercover to bust a cop/drug ring. When the officer who recruited them is killed, they go above and beyond the call of duty to solve the murder; and bust the drug ring. Suffering the jibes, and ridicule of fellow officers; they struggle to save their names, and that of their deceased benefactor.",
      "tmdbMovieId": 16379,
      "avgRating": 2.1573,
      "releaseYear": "1999",
      "numRatings": 1583,
      "posterPath": "/7c20VEblNKkDiBuA6bE6kbeHqHa.jpg"
   }
}