{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "crypt",
            "id": 10560
         },
         {
            "name": "silent film",
            "id": 154802
         }
      ],
      "imdb_id": "tt0018770",
      "video": false,
      "title": "The Fall of the House of Usher",
      "recommendations": [
         2974,
         125602,
         104441,
         145915,
         150707,
         122445,
         90041,
         155006,
         125276,
         27503,
         18352,
         104374,
         85927,
         105711,
         37994,
         106196,
         203263,
         125150,
         697,
         84956
      ],
      "backdrop_path": "/atOyOrqKJbelahWoKEnd3XnJTxD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Sir Roderick Usher",
               "gender": 0,
               "credit_id": "52fe4580c3a368484e05f061",
               "name": "Jean Debucourt",
               "profile_path": "/9V5IK7lHuuojCO0uHcziFMkERyO.jpg",
               "id": 36209,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Madeleine Usher",
               "gender": 0,
               "credit_id": "52fe4580c3a368484e05f065",
               "name": "Marguerite Gance",
               "profile_path": null,
               "id": 100029,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Allan",
               "gender": 0,
               "credit_id": "52fe4580c3a368484e05f069",
               "name": "Charles Lamy",
               "profile_path": null,
               "id": 100030,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "The Doctor",
               "gender": 0,
               "credit_id": "52fe4580c3a368484e05f06d",
               "name": "Fournez-Goffard",
               "profile_path": null,
               "id": 100031,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "57e136f8925141044e005f58",
               "name": "Luc Dartagnan",
               "profile_path": null,
               "id": 1556292,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "57e136ffc3a36853f2005a60",
               "name": "Abel Gance",
               "profile_path": "/fVtRZuYJkt9YFgK4Y2OnCfGFsAu.jpg",
               "id": 29720,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "57e13705925141045c005cfa",
               "name": "Halma",
               "profile_path": null,
               "id": 1386335,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "57e1370dc3a36853fb0059b8",
               "name": "Pierre Hot",
               "profile_path": null,
               "id": 1505027,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "57e13714c3a36853fb0059bb",
               "name": "Pierre Kefer",
               "profile_path": null,
               "id": 1682554,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4580c3a368484e05f051",
               "name": "Jean Epstein",
               "profile_path": "/i35wjB5KTYkDUkzsLxgPIUCpOrg.jpg",
               "id": 100027,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4580c3a368484e05f057",
               "name": "Jean Epstein",
               "profile_path": "/i35wjB5KTYkDUkzsLxgPIUCpOrg.jpg",
               "id": 100027,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4580c3a368484e05f05d",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe4580c3a368484e05f073",
               "name": "Jean Epstein",
               "profile_path": "/i35wjB5KTYkDUkzsLxgPIUCpOrg.jpg",
               "id": 100027,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4580c3a368484e05f079",
               "name": "Edgar Allan Poe",
               "profile_path": "/akmuLsbMrtcVrmiiaYqDK3QNdwC.jpg",
               "id": 48415,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "57e137349251410453005dd4",
               "name": "Oclise",
               "profile_path": null,
               "id": 1682555,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "57e1374ec3a36853e6006069",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "57e1376ec3a36853e300653a",
               "name": "Jean Lucas",
               "profile_path": null,
               "id": 1682556,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5aa47af1c3a3687c25018261",
               "name": "Georges Lucas",
               "profile_path": null,
               "id": 1995434,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 1.903064,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 28189,
      "vote_count": 28,
      "budget": 0,
      "overview": "Adapted from Edgar Allan Poe's Fall of the House of Usher, director Jean Epstein studiously avoids cheap shocks in this tale of hereditary madness, choosing instead a tightly controlled, spookily subtle technique. The hero, having indirectly caused the death of his beloved, stubbornly tries to resurrect her spirit by devoting himself to painting and sculpture. Epstein conveys the twilight zone between life and death with lingering dissolves and brilliant utilization of slow motion.",
      "similar": [
         23168,
         22971,
         1429,
         5925,
         34584,
         1359,
         3594,
         4771,
         4476,
         11005,
         424,
         235,
         10545,
         15472,
         51828,
         68730,
         64682,
         81774,
         82693,
         65754
      ],
      "original_title": "La Chute de la maison Usher",
      "runtime": 63,
      "poster_path": "/rx9LxiWt97vWzt7eWy07bMP7ram.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Films Jean Epstein",
         "id": 8994,
         "origin_country": ""
      }],
      "release_date": "1928-10-04",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jean Epstein"],
      "runtime": 63,
      "synopsis": null,
      "writers": [
         "Edgar Allan Poe",
         "Luis Buñuel"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0018770/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDU4ODcwODMzNl5BMl5BanBnXkFtZTYwMTAzMTE5._V1._CR2,1,324,459_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean Debucourt, Marguerite Gance, Charles Lamy | See full cast and crew »"],
      "reviews": [
         "Predictably morbid and grim, this early cinematic tribute to Poe offers some interesting images and beautifully haunting music. I liked the sequence showing the lace-draped coffin, as it was carried out of that cavernous room. More stylistic than substantive, the overall effect of the film is to engender a sense of suffocating gloom, rather than to tell an interesting story. It's very much like what one would expect in a nightmare. Space seems strung-out. People are not quite real. Pacing is so slow as to render time suspended between two swings of the clock pendulum. I don't recall a film that conveyed such an overwhelming sense of introverted bleakness, oppression, and ubiquitous death. Even the trees were dead. A lot of viewers will find this film lifeless ... so to speak. But for those interested in the antiquity of the occult, or Poe in particular, this film will excite like no other.",
         "Wow! Words cannot describe how absolutely magical this film is, but I will try. Its not often that a film will truly captivate me from moment one as this one has, especially in the world of silent film. Its been a long time since I've been glued to the screen in complete rapture. Granted, I like the silent medium and of course I respect it, but usually I watch them as a piece of film history; I see them for what they are and judge them only amongst their peers: other silent films. But this silent film is like no other! There were many times when I felt as though if Guy Maddin were to make a actual serious film this would be it. Anyone who has seen 'Cowards Bend The Knee' or 'Saddest Music In The World' will know what I'm referring to. Throughout the film I kept thinking that it looked \"new\" and was made to look old. Some of the special effects such as the swirling fog were just mesmerizing so much so that I found myself wondering why in our modern day we haven't done something so simple yet effective (at least as compared to the films I've experienced). Even the score that they created for it was incredible. There were some scenes in the beginning of the film, especially ones where Allan was approaching the house, that I didn't think quite fit, but for the rest of the 95% of the film it went along with the action of the film perfectly. While everything in the film is as close to perfect as film gets, I must point out the acting was so well done as to almost bring me to tears. I cant quite explain how that is possible, but it is. Each tiny emotion shows through so remarkably well. I really would love to commend the actor who played Roderick Usher for his wonderful display. I even feel right in comparing his acting to the likes of the female lead in 'The Passion Of Joan Of Arc' -- and thats hard to beat! Oh, and the cinematography! Its absolutely impeccable! And I'm not just saying that due to the fact that \"its the best they could do back then\". It really could rival any modern day film in that regard. It makes me miss shots of a large looming building from down below instead of the aerial helicopter shots most films use now; so macabre and eerily inviting. This film was definitely ahead of its time thats for sure. I'm not sure how much a screenplay translates to a silent film, but whatever/however Bunuel contributed, it definitely worked. Even though there weren't any overtly surrealistic things going on, you could definitely smell the Bunuel in it. The film is like a dream that you don't want to wake up from even though at its heart it is a nightmare.",
         "The Fall of the House of Usher is about... well, I suppose it's about someone, Allan, visiting the house of Usher, run by Roderick, who lives with his sick wife Madeline and spends most of his time painting and trying to find a cure for whatever her supernatural-esquire disease is. The rest of what happens I cannot really say. Maybe because I'm still not totally sure myself. While I've yet to read the original Poe story, or see the later, more well known Roger Corman production with Vincent Price, I would probably advise on what little I know in comparing both films for the 1960 version if you're most concerned about sticking straight to the story. Apparently, by the way, Luis Bunuel, who was director Jean Epstein's chief collaborator, quit after creative clashes over this issue. For whatever reason it was, I'd be hard-pressed to figure on how much influence he did or didn't leave on the picture. As it stands, and probably sticking to a certain aesthetic that was familiar for those in love with Poe, the silent version of Fall of the House of Usher is chock full of atmosphere in every kind of delicious, creepy, wonderful kind of connotation. The production design is sometimes full of a smoke, or a smoke-filled tint from the camera, and the outside of the mansion is covered in dirty fields and dead trees. The inside of the house, the interiors of the walls, the mirrors, the paints of Roderick's, and the placement of the camera in some strange angles (i.e. guitar) all build up to something unexpected. Would I call it surrealism just because of Bunuel's involvement? Yes and no. Yes in that, of course, there are some striking moments that could only come out of a dream &/or a desire to just completely tool around with the audience's head just for the hell of it. And no because it's really Epstein's movie through it all, and he crafts this mostly as a somber, quietly intense picture where he experiments not in as a surrealist but as a director of contemplative Gothic horror. I can't even totally understand what absorbed me, but everything in the 'plastic', technical sense of the word did, not to mention the performances by Debucourt, Lamy, and especially Gance who all seem to be drifting in and out of the fantastical consciousness that seems to be living in this place, where life and death merge or go un-hinged, and (as another reviewer noted) is like a slow-poisoning prison. Just, as I said, don't watch it to be wrapped up in 'what happens next in the \"plot\"', as it's more about what may happen in the next twist with a setting or a mood, or if a character should suddenly have a look that changes everything. It's not the greatest of the near-end silent period, but it's close.",
         "I've read the Poe source for this film more times than I can remember, and Epstein's film captures that story's sense of decay and degeneracy the best by far. Corman's version can't hold a candle to this film; in fact, I feel as if I'm doing a grave disservice to Epstein's work by mentioning Corman's film in the same sentence with it. Let it pass. Although I'd read about Epstein's USHER for many years and pondered the stills, particularly of the Lady Madeline in her billowing, winding sheet, I was not at all prepared for the terrifying beauty and hypnotic delirium of this motion picture. It's certainly not for all tastes, and, for those not particularly well-read in outre or occult literature, it will be inscrutable. But for those with an open mind and an appreciation of convulsive beauty, it's hard to find a more exquisite film.",
         "A stranger called Allan (Charles Lamy) goes to an inn and requests transportation to the House of Usher. The locals remain reluctant, but he gets a coach to transport him to the place. He is the sole friend of Roderick Usher (Jean Debucourt), who leaves in the eerie house with his sick wife Madeleine Usher (Marguerite Gance) and her doctor (Fournez-Goffard). Madeleine is the beloved muse and model and is being painted by Roderick. When she dies, Roderick does not accept her death, and in a dark night, Madeleine returns. For those like me that have not read the story of Edgar Allan Poe, the conclusion of \"La Chute de la Maison Usher\" is quite confused. However, the Gothic cinematography is very impressive, recalling the German Expressionism. It is amazing how Jean Epstein was able to produce such atmosphere, considering the primitive technology of 1928, with difficulties in lighting, sensibility of films, edition table and portability of cameras. However, the shadows and lights are really amazing in this black and white film. This movie was the first work of Luis Buñuel in the cinema industry, working as assistant of Jean Epstein. Just as a curiosity, the resemblance of Charles Lamy with Carlos Alberto Parreira, the coach of the Brazilian soccer team, is incredible. My vote is nine. Title (Brazil): \"A Queda da Casa de Usher\" (\"The Fall of the House of Usher\")",
         "I had the chance to see this film about 20 years ago and it's still quite fresh in my mind (if you knew me you'd find this very unusual). I still remember how I was wrapping myself up during the course of the film as I was feeling colder and colder - it was a summer night, mind you. The plot sticks tightly to the original story and it shows France's affinity with Edgar Allan Poe since it was the great Charles Beaudelaire himself who translated Poe's work into French. The film manages to create an unusual sense of discomfort unlike most classic horror films where the settings etc. result more in a feeling of (uneasy) cosiness. The insanity in Roderick Usher's face is utterly believable as well as the parts of the other characters. What tops it all up is the constant draught in the mansion. Wall hangings are steadily moving and bits of paper and dust are blowing through the corridors. Hence the above mentioned feeling of physical coldness. All I can say is I need to see this film again and I would be grateful if anyone could point me in the right direction (Quelq'un en France, peut-etre?).",
         "As was inevitable, movies of the silent era depended on their imagery in a way that became less important after the introduction of sound. During the same time period there were a number of hugely significant art movements that would influence the relatively new medium of cinema. Art trends such as cubism, dada, expressionism and surrealism had enormous impact on films of the time. The Fall of the House of Usher is a good example of a film based on 19th century literature but brought to the screen via the artistic sensibilities of the day, namely expressionism and surrealism. Because of this, like its peers such as The Cabinet of Dr. Caligari and Nosferatu, it has attained a timeless quality and it will always remain a fascinating art-horror film. The plot-line such that it is, is about a man named Allan who visits his friend Roderick Usher at his remote mansion. Usher lives with his sick wife Madeline, who suffers from some mysterious unknown disease. He is obsessed in painting a portrait of her. She dies and Usher, unable to accept it, descends into madness. The tone is definitely downbeat and this is reflected by the gloomy haunting imagery used throughout. The strikingly inventive visuals escalate as the film progresses as a way of reflecting Roderick Usher's journey into insanity. Billowing curtains, close-ups of a giant pendulum, a haunting painting of Usher's wife, a moon-lit trip to the mausoleum and swirling mist are just some of the details captured. The film is overloaded in creepy Gothic atmosphere. Production design is excellent, with the grounds of the mansion populated with dead trees and swirling mist, while the interior has enormously high ceilinged rooms decorated with mirrors, curtains and Gothic furniture. In keeping with the film's artistic bent, everything is photographed quite excellently with many close-ups and unusual angles. The overall feeling of the film is that of a fever-dream which is very much in keeping with the central character's damaged state of mind. In the best silent films, the storyline is very much secondary to the ambiance. The Fall of the House of Usher is no different and is one of the greatest silent horror films. It's an often quite stunning mood piece and comes highly recommended.",
         "I had always wanted to check out this Silent version of the Edgar Allan Poe horror perennial, and not just because of Luis Bunuel's involvement; actually, he only served as Second Assistant in charge of interiors on the film � so much for the co-directing credit that is often attributed to him (including the DVD front cover). Ironically, when the disc was released by All Day Entertainment, I recall complaining about its \"Collector's Edition\" moniker when it was a bare-bones affair apart from an essay by the director himself � the company's President David Kalat, however, was prompt to inform me that the proposed Bunuel-related supplements fell through at the last minute. Anyway, this is now my third viewing of the movie: the second had occurred either as part of an earlier Bunuel retrospective or to compare it with one of the many other filmic renditions of the tale. For the record, a viewing of the obscure low-budgeted 1949 British effort followed this re-acquaintance with the Epstein film, while I also own and have watched the U.S. short (also from 1928) and the 1960 Roger Corman/Vincent Price classic�but there are at least five more versions I would be interested in catching (by such notable directors as Alexandre Astruc, Jan Svankmajer, Jesus Franco, Curtis Harrington and Ken Russell)! That said, my reaction to the film under review continues to be ambivalent: to begin with, this is perhaps one of only two cases which can truly be described as a dream-like experience (the other being the equally haunting but more readily satisfying VAMPYR [1932] by one of my favorite auteurs, Carl Theodor Dreyer); however, the sluggish pacing makes its brief 66 minutes feel long�not helped by the archaic parts of the accompanying score (at least, some of it was suitably avant-gardist) and the droning narration, reading the English translation of the original French intertitles, by respected but heavily-accented actor Jean-Pierre Aumont! Visually, the film really cannot be faulted as the Impressionist first half (with images that could almost be taken for paintings) giving way unsurprisingly to Expressionism in the much-anticipated high-strung finale. Even more than in MAUPRAT (1926), Epstein virtually lets the camera and the editing tell the story: the acting actually leaves much to be desired (especially since both Usher and his guest are way overage, with the latter bafflingly also made out to be quite deaf!); as for Madeleine, she is played by Marguerite Gance (wife of famous pioneer film-maker Abel � Bunuel's disdain of whom eventually cost him his job!), who manages the character's essential frailty and subsequent wraith-like features. Incidentally, Roderick and Madeleine are here husband and wife rather than brother and sister; other unwarranted changes to the source material were its depiction of the Usher mansion as something of a monstrous abode, akin to Castle Dracula, and the rather disappointing climax in which the Ushers actually survive the ordeal � thus rendering the title pointless! Again, the power (and reputation) of the film rests squarely on its memorable detail: taking a cue from Poe's \"The Oval Portrait\", Madeleine's 'painting' by Roderick literally comes to life as its subject fades away more and more (at one point, Madeleine even feels her husband's brush stroke on the canvas, as if it had really touched her cheek); her eventual succumbing to catalepsy, played out in slow-motion; the lengthy ritual of her burial (her resting-place even lying across the river, a la Bunuel's own much-later THE RIVER AND DEATH [1955]); her 'resurrection' (amusingly, the name Ligeia also crops up as an ancestor in the Usher family crypt!), with the sight of the casket moving about in the grave anticipating the surreal coffin-scurrying-through-the-wilderness sequence from the Spanish maestro's SIMON OF THE DESERT (1965), etc. Despite the rather grainy DVD transfer (the faults of the print exposed all the more on my 40\" TV monitor), the quality of the cinematography comes though � highlighting both the desolate, fog-bound landscape and the expansive interiors (the wind blowing through the house results in constantly billowing curtains and books falling from the library shelves in slow-motion); as already mentioned, Epstein practically runs the gamut of the cinematic language along the way, adopting such techniques as cross-cutting (at various points during one particular sequence incorporating, for no very good reason, a couple of frogs engaged in the act of copulation!) and superimposition, down to shaking the camera in order to evoke a character's disorientation. Unfortunately, the all-important closing moments of the film are rushed and decidedly muddled � even diminishing a nice effect ostensibly created by a constellation of stars, which appears in the skies behind the mansion, shaped like the Ushers' warped family-tree! While highly acclaimed in some quarters - with hyberbolic claims ranging from \"the finest horror film ever made\" to \"the pinnacle of artistic achievement in European cinema of the 1920s\" - this version would be all but forgotten forty years later (it does not even earn a mention in Carlos Clarens' influential tome \"An Illustrated History Of The Horror Film\") and the exact same destiny befell Epstein himself later on, despite having been one of the three key avant-garde French exponents of the era (the others were the afore-mentioned Abel Gance and Marcel L'Herbier).",
         "One of the benefits of knowing Dave Sindelar (of sci-film.org and the \"Movie of the Day\" forum on the \"Monsterkidsclassichorrorforum\" on Yuku) is that sometimes I get to see some stuff I never would have know about otherwise.Well, I mean good stuff as well as the deservedly obscure stuff. He pulled out this fairly short film recently as a break from all the 50's sci-fi dreck we've been wading through, and I have to say that this silent film was easily the single best example of the era that I've ever seen. This director and the casting crew managed to cast and film a group of actors who were superbly suited for the demands of silent film...and by this, I mean that all you have to do is look at the actors in almost any given scene and you will already know almost everything there is to know about their characters. This is way different from the hammy over-emoting that jars my sensibilities even when I view something like the recently restored \"Metropolis Complete\". And the photography and lighting and costuming and set design...they all combine to create and reinforce the atmosphere of Poe's little tale of decadence and dread.Especially impressive is the soundtrack, which seems to combine wire harp, scratching violins, hammered piano and heaven knows what else to provide a background that is at once beautiful, disturbing and haunting. Only 8 stars because the story itself...is extremely annoying in its way, especially after the first 30 minutes. You can't help but wonder if maybe actually having a JOB with stuff to do OUTSIDE would work wonders for the situation. \"THIS is what comes of having too much money and too much time on your hands...\"",
         "This memorable adaptation of Edgar Allan Poe's \"The Fall of the House of Usher\" is particularly impressive in its use of visuals and in the macabre, disorienting atmosphere that it creates, which fits in well with the story. Jean Epstein made some rather significant changes to the story, but as a movie it all works very well. The story changes the central relationship between Roderick and Madeline, and in so doing discards some of Poe's themes, but adds some new ones of its own. Likewise there are other differences as the story unfolds, but Epstein had his own consistent conception of the possibilities in the story, so that it's neither better nor worse than Poe's idea, just different - they are both creative and fascinating conceptions in their own way. The settings and visual effects are very effective in establishing the atmosphere, and in setting off some of the themes of the story. Some of them, such as the enormous array of flickering candles by which Roderick works, are used as recurring images, with surprisingly haunting results. The pace with which the images come at the viewer is also used as part of the effect. It's quite a distinctive accomplishment, and it's a movie that you won't forget for a while."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Films Jean Epstein"],
      "summaries": [
         "Allan has a hard time finding the Usher's house, which is known to be cursed... But he is a personal friend of Roderick Usher, who lives with his sick wife Madeline and a doctor. Roderick is painting a portrait of Madeline, but every pose exhausts her. Allan worries more and more...",
         "A stranger called Allan (Charles Lamy) goes to an inn and requests transportation to the House of Usher. The locals remain reluctant, but he gets a coach to transport him to the place. He is the sole friend of Roderick Usher (Jean Debucourt), who leaves in the eerie house with his sick wife Madeleine Usher (Marguerite Gance) and her doctor (Fournez-Goffard). Madeleine is the beloved muse and model and is being painted by Roderick. When she dies, Roderick does not accept her death, and in a dark night, Madeleine returns."
      ],
      "budget": 0
   },
   "movielensId": 25765,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1928-10-04",
      "dvdReleaseDate": "2001-05-15",
      "directors": ["Jean Epstein"],
      "runtime": 63,
      "movieId": 25765,
      "title": "The Fall of the House of Usher",
      "mpaa": null,
      "actors": [
         "Jean Debucourt",
         "Marguerite Gance",
         "Charles Lamy",
         "Fournez-Goffard",
         "Luc Dartagnan",
         "Abel Gance",
         "Halma",
         "Pierre Hot",
         "Pierre Kefer"
      ],
      "imdbMovieId": "0018770",
      "originalTitle": "La Chute de la maison Usher",
      "genres": [
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Adapted from Edgar Allan Poe's Fall of the House of Usher, director Jean Epstein studiously avoids cheap shocks in this tale of hereditary madness, choosing instead a tightly controlled, spookily subtle technique. The hero, having indirectly caused the death of his beloved, stubbornly tries to resurrect her spirit by devoting himself to painting and sculpture. Epstein conveys the twilight zone between life and death with lingering dissolves and brilliant utilization of slow motion.",
      "tmdbMovieId": 28189,
      "avgRating": 3.33824,
      "releaseYear": "1928",
      "numRatings": 34,
      "posterPath": "/rx9LxiWt97vWzt7eWy07bMP7ram.jpg"
   }
}