{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fighter",
            "id": 6211
         },
         {
            "name": "alcoholic",
            "id": 33457
         }
      ],
      "imdb_id": "tt0021730",
      "video": false,
      "title": "The Champ",
      "recommendations": [
         147876,
         44369,
         80705,
         43596,
         65874,
         32543,
         105067,
         42086,
         43488,
         84298,
         84274,
         43940,
         5122,
         71576,
         77410,
         52636,
         73473,
         219924,
         48596,
         99657
      ],
      "backdrop_path": "/jiOwnafGqCqCjGykjkhqve2rzzM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Champ",
               "gender": 2,
               "credit_id": "52fe461cc3a36847f80ed273",
               "name": "Wallace Beery",
               "profile_path": "/zJJe0w3dXlaU2xhhJFRIukCmPLw.jpg",
               "id": 29260,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dink",
               "gender": 2,
               "credit_id": "52fe461cc3a36847f80ed277",
               "name": "Jackie Cooper",
               "profile_path": "/3uutX8roJ9nNXwh5nxfnuTPLPGe.jpg",
               "id": 55278,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe461cc3a36847f80ed27b",
               "name": "Irene Rich",
               "profile_path": "/cD7RvrTsqG0cApA08efTIpJA74C.jpg",
               "id": 14871,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sponge",
               "gender": 0,
               "credit_id": "52fe461cc3a36847f80ed27f",
               "name": "Roscoe Ates",
               "profile_path": "/AoGCN2oOsOKv5zUbIz90w61wJKd.jpg",
               "id": 1509,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Tim",
               "gender": 0,
               "credit_id": "52fe461cc3a36847f80ed283",
               "name": "Edward Brophy",
               "profile_path": "/e1XFRVHEUF09t42vARu1KOuHDyF.jpg",
               "id": 32437,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Tony",
               "gender": 0,
               "credit_id": "57eb531bc3a36839410018f6",
               "name": "Hale Hamilton",
               "profile_path": "/5L4Z2sUbc5M4pso9ZmBh1Hb3asM.jpg",
               "id": 233118,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Mary Lou",
               "gender": 1,
               "credit_id": "57eb532bc3a36837fe0017e8",
               "name": "Marcia Mae Jones",
               "profile_path": "/5Gtq4UgexrSKU37QKGcDitQQnNk.jpg",
               "id": 95627,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Boy Taunting Dink (uncredited)",
               "gender": 0,
               "credit_id": "57eb53399251410c2c001d25",
               "name": "Dannie Mac Grant",
               "profile_path": "/zS6hh9H8ZMmLQXtfUXv1YH4marW.jpg",
               "id": 1055297,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Manuel Quiroga - Mexican Champ (uncredited)",
               "gender": 0,
               "credit_id": "57eb5341c3a3683941001910",
               "name": "Frank Hagney",
               "profile_path": "/nCvW7yfN0PlCkF6v6CV80CUdWgH.jpg",
               "id": 34168,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "The Doctor (uncredited)",
               "gender": 2,
               "credit_id": "57eb534dc3a36837fe0017f6",
               "name": "Dell Henderson",
               "profile_path": null,
               "id": 99378,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Los Angeles Promoter (uncredited)",
               "gender": 2,
               "credit_id": "57eb5356c3a36868bd002b2a",
               "name": "Tom McGuire",
               "profile_path": "/vsEHvdahFS06ZkkfLosU3k9C6ex.jpg",
               "id": 120811,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Referee (uncredited)",
               "gender": 2,
               "credit_id": "57eb5360c3a36836f1001a78",
               "name": "Bob Perry",
               "profile_path": null,
               "id": 1045090,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Louie - the Bartender (uncredited)",
               "gender": 2,
               "credit_id": "57eb53699251410c2c001d4e",
               "name": "Lee Phelps",
               "profile_path": "/yBLIKr2IpxLzSiqBt6N9PqGQ7EZ.jpg",
               "id": 121066,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Boy at Racetrack (uncredited)",
               "gender": 2,
               "credit_id": "57eb53729251415016002d9d",
               "name": "Andy Shuford",
               "profile_path": "/oEihoqJNX5133YLUUSatHe23gbX.jpg",
               "id": 975658,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Ring Announcer (uncredited)",
               "gender": 0,
               "credit_id": "57eb537bc3a368397e001ab8",
               "name": "Dan Tobey",
               "profile_path": null,
               "id": 1317055,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461cc3a36847f80ed26f",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe461cc3a36847f80ed289",
               "name": "Frances Marion",
               "profile_path": "/eKSqAU7PxO3VCHU9o27CkyKDEkk.jpg",
               "id": 34741,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57eb52cb9251410db4001ba8",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57eb52d5c3a36868bd002ae5",
               "name": "Harry Rapf",
               "profile_path": null,
               "id": 120305,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57eb52dc9251410de0001c04",
               "name": "Irving Thalberg",
               "profile_path": null,
               "id": 1497,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57eb52e49251410db4001bb9",
               "name": "William Murray Weiss",
               "profile_path": null,
               "id": 1026656,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57eb52ebc3a3683657001dfe",
               "name": "Gordon Avil",
               "profile_path": null,
               "id": 106502,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57eb52f2c3a3683657001e08",
               "name": "Hugh Wynn",
               "profile_path": null,
               "id": 29971,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57eb52f89251415016002d58",
               "name": "Benjamin Thau",
               "profile_path": null,
               "id": 1555850,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "57eb52fe9251410c2c001d09",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57eb53049251410df3001b49",
               "name": "Robert A. Golden",
               "profile_path": null,
               "id": 1413995,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.901446,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42816,
      "vote_count": 14,
      "budget": 0,
      "overview": "Dink Purcell loves his alcoholic father, ex-heavyweight champion Andy \"Champ\" Purcell, despite his frequent binges, his frequent gambling and their squalid living conditions. And there's nothing Andy wouldn't do for Dink. When Andy wins a race horse gambling, he gives it to Dink and they race it at a Tijuana track. There, Dink meets Linda Carleton, a race horse owner herself, and they have an immediate rapport. But Linda's rich husband sees Andy and realizes Dink is Linda's son, who she gave up when she and Andy divorced. Andy is bribed $200 to allow Dink to visit with Linda, but refuses to allow Dink to spend six months with the Carletons. When Andy loses the horse gambling and winds up in jail after a drunken tirade, he realizes Dink's place is with his mother. Dink tearfully goes but sneaks out and returns at his first opportunity, filling a depressed Andy with a desire to make good. So Andy goes into training after his managers arrange a boxing match with the Mexican champion.",
      "similar": [
         290250,
         25196,
         11636,
         28580,
         7840,
         4771,
         7345,
         9509,
         44264,
         169917,
         59440,
         616,
         57212,
         339967,
         443009,
         346685,
         307081,
         324786,
         372343,
         38234
      ],
      "original_title": "The Champ",
      "runtime": 86,
      "poster_path": "/d0uRQbvrU3dDSP3PrPpOXz1cNYh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1931-11-21",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "The knockout picture of the year!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["King Vidor"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Frances Marion",
         "Leonard Praskins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021730/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzI0ODE3NzI3OV5BMl5BanBnXkFtZTgwMDIzMTkxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Wallace Beery, Jackie Cooper, Irene Rich | See full cast and crew »"],
      "reviews": [
         "The central relationship of the adoring street-wise kid (Cooper) and his devoted, boozing, gambling ex-champ Dad (Beery) is astonishing. We are observing behavior here, not acting. Cooper gives the best child performance I've ever seen and Beery is utterly human, flawed and unforgettable. This film is full of terrific moments - comedy and heartbreak. The friendship between Cooper and his black pal is beautifully color-blind. When Cooper states, \"He's colored,\" it's with a child's open, untainted honesty. I find King Vidor's films to always resonate with humanity and compassion. He was one of our greatest filmmakers as Frances Marion was one of our greatest screenwriters.",
         "Former heavyweight champ Andy Purcell goes down to Tijuana in hopes of getting a fight. Andy's son, Dink, watches his father train, but Andy gives into his vices of gin and gambling, which constantly gets him in trouble. Andy wins Dink a race horse, which is entered in a race, where Andy meets his ex-wife Linda (with her current husband Tony) at the track and wants to be reunited with her son (Dink) and give him a better life outside of the one Andy gives him. Andy gets arrested and thrown in jail, where he decides that Dink would be best living with his mother, which devastates Dink (who idolizes his father). Andy is released from jail (thanks to Tony & Linda)and gets a bout with the Mexican heavyweight champ, where Dink runs back to his father to watch him hopefully win the fight, even though he is out of shape and not at the level of his opponent. The film is a toughing piece of cinematic brilliance, despite the static camera-work (very uncharacteristic of King Vidor). Beery and Cooper work so well together and their performances are what makes this film a classic. The script does not lose anything in the 70 plus years since its release. If the ending doesn't make you shed tears, you have to be a robot. Rating, 8.",
         "'The Champ' seems to have been a blueprint film for all the others of the tough-tender school that followed it, and - owing entirely to Jackie Cooper's playing perfectly off of Wallace Beery's has-been, alcoholic pug - it's perfectly charming. Yes, the fight scene is rather hokey: had they tried to use Wallace Beery's telegraphed-the-day-before roundhouse punches, even the toe-to-toe sluggers of 'The Champ's bygone day wouldn't have survived one round in the ring. But the film isn't about the fight scene, it's about the love of father for son and son for father - and to this day 'The Champ's' story artfully delivers its soft knock-out blow with tender sucker punches and love-taps to the heart. Compared with today's fare 'The Champ's' pacing is slow but the time taken works nicely, especially in the one-on-one scenes captivatingly played by Cooper and Beery. There's plenty of archetypal King Vidor composition-in-frame that's still imitated today, and in many instances the lighting is exemplary of the gorgeous black & white textural artistry of Hollywood's Golden Age. Lovers of classic B&W work might want to grab more than a few frames from the DVD. Beery's work is quite good here, but Jackie Cooper's remarkable, potent chops steal the show - and your heart; though 'The Champ' has a good many fine, classical attributes there's none better in it than Cooper's unforgettable performance.",
         "I had seen the 1979 remake starring Jon Voigt and Faye Dunaway (the female part was much more important ) and I was not that impressed.Jon Voigt was too good-looking and too handsome to portray the champ successfully.The original really blew my mind:the Wallace Beery /Jackie Cooper team was a winning one and it's one of the best pairings man/boy in the history of cinema ,with echoes of Charlie Chaplin's \"the kid\" .Although the movie takes place in the prizefighters milieu,the plot is pure melodrama ,mainly aimed at the female audience .The reactionary side of the melodrama -the posh lady horrified at the people around her boy, a \"normal\" wealthy family is the safe way to happiness,etc- is present but emotion survives the tear-jerker side .And I dare you not to shed a tear when the boy screams \"I want the champ!\".",
         "Probably the greatest disconnect among film personalities in history is that of Wallace Beery. On the screen he played these lovable oaf types, even when he was a bad guy. Off the screen he was a violent man, given to fits of temper and I can't recall anyone having a good word to say about him. Possibly for that reason Beery could lay claim to the fact he was the greatest actor in films. The crowning achievement of his career was his Oscar winning performance in The Champ. Of course Beery could not have done it without little Jackie Cooper as well. It's their scenes together that make the film as memorable as it is. Instead of splitting the Academy Award with Fredric March who was also awarded The Best Actor for Dr. Jekyll and Mr. Hyde, possibly Beery should have given half of his half to Cooper. Beery is actually a former champ in this film. He's an over the hill, alcoholic pug who lives a hand to mouth existence with his young son Cooper. He split from his wife Irene Rich years ago, taking Cooper and she'd like to get him back. She's pretty well fixed now with a new and rich husband and a daughter by that marriage. The fly in the ointment is that Cooper is really attached to his father and blind to the faults he has. And Beery really does love his son, the only really happy part about his life. He's probably way too old to be seriously in the fight game, but he needs the dough for his kid. The Champ is guaranteed four handkerchief film even now almost eighty years after its debut. A remake was done in 1979 with Jon Voight and Rick Schroder in the main two roles, but it wasn't a patch on this one.",
         "SPOILERS! Hard to believe it's as old as 1931, in a lot of ways. As far as production, it's about what you'd see, today, except it's in black and white. And it could be a movie, today - save that it would highlight the bums that get thrown up against title holders - unlike Stallone's Rocky, who was in pretty good fighting shape and had a few moves. Beery seems out of his element as a fighter - looking at best like a beery (no pun intended) brawler, though his character plays the ex-heavyweight champ. But then, the athleticism of the era wasn't what it is today. On the other hand, there were some great fighters in the 20s and 30s, and Beery's shape and skill is out of their class, entirely. Anyhow - small gripe, perhaps. One might excuse Beery, in the championship fight, just as the bum thrown in to boost the Mexican champ's rating - as is done, today. I don't see it necessarily played up that way in the film. But I might have missed something. Some things also bring home the era of this film. For ex., the effort, it seems, to mimic the newsreel footage from the theaters of the day, by slowing down the film rate, thus artificially speeding up the action. We see this sort of 'newsreel' effect at both the horse race and the concluding championship fight. There's also an interesting 2 or 3 second montage during the fight which strikes me as 60s style film-making, or later. But it's just 2 or 3 seconds. Generally - it's a good looking film. It plays well, even today. The subplot with the black boy, who hangs about with the young Purcell, and the other kids - an inspiration (perhaps?) for the 'our gang' crew that followed first in theatrical shorts a few years later? - is clearly intended to encourage racial tolerance, and repel a bigotry which was openly and boldly part of the fabric of world culture in the 1930s and before. The little black boy doesn't roll his eyes, or do goofy things, or talk in a slow drawl, or any of the rest. He just acts normally. When 'Dinkus' Purcell (the Jackie Cooper character) unknowingly runs into his divorced Mom, whom his Dad never much mentioned and never identified for the kid, she asks - who's your friend? 'Dink' replies, and then comments - \"He's colored.\" And Mom/strange lady replies - \"And what a pretty color.\" Again, just clearly something important to the story, and very out of touch, and actively opposed to the ethic of the time. As for the rest of the story, it's basically a child custody story, about the love and affection of the child in question, with the death of one of the disputants the resolution and which enables the emotional concluding scene where 'Dink', who had kept an arm's length from Mom (once she told him who she was) in favor of his Dad (whom he knew and loved), breaks down at the sudden loss of his father, lying dead on the training table, and for the first time tearfully cries out, \"Mother,\" and then rushes to her. She carries him out through a gauntlet of reporters and onlookers - bringing down the curtain. The End. There's not much to quarrel with in the story. It is a coincidence that the ex and her new husband run into The Champ, Andy, at the south of the border race track. But coincidence can happen, and does. It is somewhat difficult to believe that an out of shape, fairly weak, and uncoordinated brawler, as Beery is in the ring, could land the lucky punch against a fighter in trim shape, enough to take him out for the full count. But, that's the story, that's Hollywood, that's Rocky, and - what the hey. It might have been interesting to see brother and sister interact a little more. Cooper's oddly adult inflections and mannerisms seem to play well against the spoiled but good natured little girl - just happy to have a 'new' brother. It might have been interesting to see the game in which Andy wins so much, and the horse he eventually fights to get back. Might have been interesting to see Andy and Dink out and about, a little more, rather than just 'in training' or in the flat. And so on, so forth. It's clear why Beery got the nod for the award. He seems to have had a sort of Long John Silver, sort of patronizing, slow-talking 'rap'. in various films. Here, save for a few instances, he plays it pretty low key. He seems just like a regular guy in the Mexican prison, thinking over his part in the custody dispute, and thinking he's just not the father for Dink. And when Dink comes to the cell, and Andy tells him to 'shove off', basically, it's believable, with just the right tone, delay, cliched delivery, and choked back tears. When he takes the money from Linda's rich hubby, he comments on being down on his luck, and almost lapses into Long John - but just not quite. And surely he spoke for a fair number in the audience in the early first years of The Great Depression. It's a good film. The emotional manipulation is right up on the surface, and may be a bit too trite and obvious; particularly as the extraneous 'background' scenes I might like to see, as suggested above, just weren't there. The film was 'tight' and 'stayed on message' in that way. And it feels right, almost. It has its flaws, but remains a good film.",
         "When I first saw this movie it was my first look at either Wallace Beery or Jackie Cooper. I found both of them very interesting to watch. I also found out why Bob Hope and Jack Benny used to make a lot of sarcastic lines about \"being about as pretty as Wallace Beery.\" He definitely had an ugly \"mug.\" However, he was a lovable loser, at least in this film. Cooper played \"Dink,\" a cocky little kid who just loved \"The Champ\" (Beery). On the VHS tape, Cooper's squeaky little voice did not come across well and often was annoying to hear. The boxing scenes were hokey but I liked the ending because at least Beery won the fight, although he collapses afterward. I believe he lost in the re-make of this with Jon Voight and Ricky Shroder in the 1979 film, but I'm not sure. The kid's devotion to the champ, even under the toughest of situations, was touching. With clearer sound and picture, I would have kept the tape. I should check out the DVD.",
         "this is one touching,heartwarming movie.it's all about the love a father has for his son and vice versa.Wallace Beery is good as the dad,but it's Jackie Cooper(nine years old,at the time)who steals the show)as the son.as a nine year old child,Cooper showed acting ability and maturity way beyond his years.this film has little to do with boxing,and in fact,the one big boxing scene is quite comical,and not in a good way.thank goodness,it secondary,and doesn't lesson the overall impact of the movie.the ending is unexpected and hit me like a punch to the gut.it's a powerful moment,and deeply affecting.for me,The Champ(1931)is a 7/10",
         "In the worst years of the depression, the most popular stars were not the most glamorous or attractive. As revealed in the highly respected Quigley poll (which surveyed movie theatre owners on who their audiences were most likely to come and see), the biggest draws in the early 30s were friendly, earthy types whom audiences could relate to at a time of poverty and desperation. These included genial comic Will Rogers, middle-aged frump Marie Dressler, and burly pug-face Wallace Beery, who played his greatest role in 1931 feature The Champ. Beery's physique meant he was often cast as villainous thugs, but he had demonstrated enough acting prowess to get a decent number of \"gentle giant\" lead roles. In The Champ he gets to combine the two, one minute the swaggering pugilist, the next a devoted father. He gives a performance full of tiny gestures, expertly dancing from one expression to another. When he gets to show his character's emotional vulnerability, the scene is doubly poignant coming after the macho confidence he normally displays. The knowledge that off the set Beery was reputedly a wife-beating brute who bullied everyone around him perhaps spoils the effect slightly, but even with this in mind his performance is captivating, believable and utterly flawless. Supporting Beery behind the camera is a director who was both a poet and a craftsman of the cinema � King Vidor. Vidor excelled at coaxing naturalism from his players at a time when theatrical hamming was the par. His camera focuses on Beery for long takes, allowing the actor to potter about doing his little bits of business and developing the character. Vidor also gives the picture bite with some neat tracking shots. These are usually in the field of depth, so in other words we are either backing away from the actors or following them. The former kind, with the players advancing on the camera as in the shot that opens the picture, gives the characters presence and show them as a force to be reckoned with. The latter kind, where the camera follows the character, physically pulls us into their world. Vidor used these kinds of shot a lot, and they are a neat way of making the audience feel involved without drawing too much attention to the artificiality of the form. It may come as a surprise that this story of male bonding was written by a woman, Frances Marion. But like Beery, Marion defied expectations simply by being very good at what she did. Her plot for The Champ earned her the second of her two Oscars. It does not perhaps describe the most realistic of situations, but the emotional content is very sincere, and its depiction of determination and human feeling during hard times must have struck a chord with audiences of the day. The dialogue, which is credited to three separate people, is appropriately punchy with lines that sound believable yet are memorable and evocative. Aside from Beery, the rest of the cast are a good bunch. Of all the lead players, Irene Rich is the only one who doesn't stand out, and she seems simply there to fill the wealthy, motherly type. But having said that she is not at all bad and her presence doesn't harm the picture. The Champ also sees Roscoe Ates in one of his largest roles, and for once getting to appear as a normal person rather than the stuttering fool he was usually required to play. Finally there is Jackie Cooper, one of the greatest child stars of his or indeed any era. While it seems clear that fame has gone to the youngster's head (he's not quite as good as he thinks he is), he is certainly up to the task of carrying his end of the picture. He plays a genuine child when with Beery, but when he is around others he deepens his voice and adopts mannerisms as if trying to be an adult. It's a touching and appropriate performance and very suited to the tone of the picture. And this was perhaps also the only time in which a child actor like Cooper could become a personality in his own right. As the popularity of Beery, Dressler et al proves, this was the age of the unconventional superstar.",
         "This almost eighty-year old film will bring both a tear and a smile. It is the story of washed-up and somewhat alcoholic boxer Andy Purcell (Wallace Beery), just known as \"Champ\" to everyone, including his adoring little son, \"Dink\", played by Jackie Cooper. It's as though life has really ceased to have meaning for the Champ ever since he lost his championship status. The only thing that continues to give his life meaning is his son. The Champ isn't exactly providing a wholesome environment for Dink. Dink hangs out in pool halls with his Dad, isn't enrolled in school, and sits up nights alone in their dingy room waiting for the Champ to come home when he is out on a drinking binge. Champ's ex-wife, socialite Linda, sees Andy and Dink at the racetrack one day and tries to convince Andy that Dink would be better off with her. At first the Champ is unpersuaded. However, when he gets a hold of a good sum of money and gambles it away and winds up in the drunk tank overnight he decides that maybe it is for the best if Dink goes with Linda. Wallace Beery had some lean times after motion pictures transitioned to sound, however he got a new lease on his career at MGM, and it turned out that his coarse voice attracted fans rather than repelled them. He won a well-deserved Best Actor award for his role, but if there had been a Best Supporting Actor Oscar in 1931 it would have gone to nine-year old Jackie Cooper. He is comic as the street-wise kid meeting his half-sister for the first time - \"The dame is goofy\" he remarks. He is heart-rending when the Champ tells him he doesn't want him around any more, that he's tired of feeding him, just so he'll go with his mother. A minor point that made this film so refreshing for me is that nobody tries to \"lawyer up\" or turn Dink's fate into a courtroom battle. Everyone deals with everyone else in this film on decent human terms. In the end the Champ tries to regain the championship so he can provide a good life for his son and so that his son can respect him, not so that he can win a custody fight."
      ],
      "genres": [
         "Drama",
         "Family",
         "Sport"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Dink Purcell loves his alcoholic father, ex-heavyweight champion Andy \"Champ\" Purcell, despite his frequent binges, his frequent gambling and their squalid living conditions. And there's nothing Andy wouldn't do for Dink. When Andy wins a race horse gambling, he gives it to Dink and they race it at a Tijuana track. There, Dink meets Linda Carleton, a race horse owner herself, and they have an immediate rapport. But Linda's rich husband sees Andy and realizes Dink is Linda's son, who she gave up when she and Andy divorced. Andy is bribed $200 to allow Dink to visit with Linda, but refuses to allow Dink to spend six months with the Carletons. When Andy loses the horse gambling and winds up in jail after a drunken tirade, he realizes Dink's place is with his mother. Dink tearfully goes but sneaks out and returns at his first opportunity, filling a depressed Andy with a desire to make good. So Andy goes into training after his managers arrange a boxing match with the Mexican champion.",
         "A little rough around the edges and currently living in Tijuana, Andy Purcell, also known as Champ, is an ex-world heavyweight boxing champion who is trying to make a comeback. His career ended as a result of drinking, a vice which may thwart his chances at the comeback. Andy's adolescent son, nicknamed Dink, is his father's protector. Dink loves his father and does whatever he can for him. Despite vowing to lay off his other vice, gambling, Andy comes into a gambling windfall and based on a dream that Dink has, Andy buys him a race horse, who they rename Little Champ. At the racetrack, Dink meets a fellow race horse owner, the elegant and kindly Linda Carleton, who he eventually learns is his biological mother. She believes that the life that Andy has provided for their son is not the type of life an impressionable young boy should have. She holds no grudges against her ex-husband, but she, with her wealthy husband Tony at her side, want custody of Dink. The foursome, collectively and individually, need to decide what is best for all, including if Andy should pursue his boxing comeback."
      ],
      "budget": 0
   },
   "movielensId": 25775,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1931-11-21",
      "dvdReleaseDate": "2006-01-31",
      "directors": ["King Vidor"],
      "runtime": 86,
      "movieId": 25775,
      "title": "The Champ",
      "mpaa": "",
      "actors": [
         "Wallace Beery",
         "Jackie Cooper",
         "Irene Rich",
         "Roscoe Ates",
         "Edward Brophy",
         "Hale Hamilton",
         "Marcia Mae Jones",
         "Dannie Mac Grant",
         "Frank Hagney",
         "Dell Henderson",
         "Tom McGuire",
         "Bob Perry",
         "Lee Phelps",
         "Andy Shuford",
         "Dan Tobey"
      ],
      "imdbMovieId": "0021730",
      "originalTitle": "The Champ",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["soDPKxKMESM"],
      "plotSummary": "Dink Purcell loves his alcoholic father, ex-heavyweight champion Andy \"Champ\" Purcell, despite his frequent binges, his frequent gambling and their squalid living conditions. And there's nothing Andy wouldn't do for Dink. When Andy wins a race horse gambling, he gives it to Dink and they race it at a Tijuana track. There, Dink meets Linda Carleton, a race horse owner herself, and they have an immediate rapport. But Linda's rich husband sees Andy and realizes Dink is Linda's son, who she gave up when she and Andy divorced. Andy is bribed $200 to allow Dink to visit with Linda, but refuses to allow Dink to spend six months with the Carletons. When Andy loses the horse gambling and winds up in jail after a drunken tirade, he realizes Dink's place is with his mother. Dink tearfully goes but sneaks out and returns at his first opportunity, filling a depressed Andy with a desire to make good. So Andy goes into training after his managers arrange a boxing match with the Mexican champion.",
      "tmdbMovieId": 42816,
      "avgRating": 3.275,
      "releaseYear": "1931",
      "numRatings": 20,
      "posterPath": "/d0uRQbvrU3dDSP3PrPpOXz1cNYh.jpg"
   }
}