{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "spain",
            "id": 514
         },
         {
            "name": "river",
            "id": 1261
         },
         {
            "name": "suffering",
            "id": 3032
         },
         {
            "name": "work",
            "id": 3640
         },
         {
            "name": "misery",
            "id": 5252
         },
         {
            "name": "desolateness",
            "id": 5253
         },
         {
            "name": "remoteness",
            "id": 5254
         },
         {
            "name": "hygiene",
            "id": 5255
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "illness",
            "id": 40895
         }
      ],
      "imdb_id": "tt0023037",
      "video": false,
      "title": "Land Without Bread",
      "recommendations": [
         175455,
         174298,
         127817,
         144650,
         85016,
         93189,
         128679,
         148068,
         139772,
         147282,
         48278,
         134757,
         147159,
         148050,
         147312,
         148118,
         48277,
         128956,
         111163,
         227289
      ],
      "backdrop_path": "/bE8C8GxzJ8Snq2iTPZ9VQaBXaEO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "(voice)",
               "gender": 2,
               "credit_id": "52fe4216c3a36847f8002fb9",
               "name": "Abel Jacquin",
               "profile_path": "/tahFsaQzPkd1g8gy8wso6iboHuG.jpg",
               "id": 174923,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "(voice)",
               "gender": 2,
               "credit_id": "52fe4216c3a36847f8002fbd",
               "name": "Alexandre O'Neill",
               "profile_path": "/ifROvLAzVEXQLev5JtE3MSDPYuv.jpg",
               "id": 174950,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4216c3a36847f8002f91",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4216c3a36847f8002f97",
               "name": "Pierre Unik",
               "profile_path": null,
               "id": 813,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4216c3a36847f8002f9d",
               "name": "Ramón Acín",
               "profile_path": null,
               "id": 815,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4216c3a36847f8002fa3",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4216c3a36847f8002fa9",
               "name": "Rafael Sánchez Ventura",
               "profile_path": null,
               "id": 817,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4216c3a36847f8002faf",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4216c3a36847f8002fb5",
               "name": "Eli Lotar",
               "profile_path": null,
               "id": 849,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "588a3cbac3a3681589008102",
               "name": "Darius Milhaud",
               "profile_path": null,
               "id": 1042001,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "588a3cd19251411ac601c732",
               "name": "Luis Buñuel",
               "profile_path": "/hHYL786XFPaQHebKrTibS5DS2Ul.jpg",
               "id": 793,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "588a3cf19251415516008798",
               "name": "Rafael Sánchez Ventura",
               "profile_path": null,
               "id": 817,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "588a3d02925141533b009707",
               "name": "Pierre Unik",
               "profile_path": null,
               "id": 813,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "588a3d29c3a368413b01b8dd",
               "name": "Charles Dorat",
               "profile_path": null,
               "id": 247601,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "5a8eab989251416c870116c3",
               "name": "Charles Dorat",
               "profile_path": null,
               "id": 247601,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.943569,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 91,
      "vote_count": 29,
      "budget": 20000,
      "overview": "Las Hurdes – Tierra Sin Pan / Land Without Bread / Unpromised Land is a surrealist documentary filmed in Spain in 1932. It is the result of a two month trip through the Las Hurdes region. The film shows the contrasts between the village and the towns in the north of Extremadura, Salamanca and along the border of Portugal.",
      "similar": [
         2062,
         52449,
         437670,
         233063,
         400928,
         7340,
         527,
         9769,
         103663,
         17663,
         140,
         18148,
         14873,
         10217,
         8841,
         25934,
         121875,
         35052,
         383121,
         214075
      ],
      "original_title": "Las Hurdes",
      "runtime": 29,
      "poster_path": "/AszNP3bBHwdkzX9mL514Zfk859s.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Ramón Acín",
         "id": 85869,
         "origin_country": ""
      }],
      "release_date": "1933-12-01",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Luis Buñuel"],
      "runtime": 30,
      "synopsis": null,
      "writers": [
         "Luis Buñuel",
         "Luis Buñuel"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0023037/",
      "coverLink": null,
      "actors": ["Stars: Abel Jacquin, Alexandre O'Neill | See full cast and crew »"],
      "reviews": [
         "After Un Chien Andalou and L'Age d'Or had caused such earthquakes, Bunuel picked for his next project a documentary on the Hurdanos. These people live in mid-western Spain, near the border of Portugal, under the most horendous conditions possible. They are a primitive, almost neolithic people, who only barely understand the principles of farming and are otherwise so superstitious as to starve themselves rather than eat any animals besides disease-carrying pigs. Now, it is difficult to know how to take this film. Following Un Chien Andalou and L'Age d'Or, I personally expected a comedy, and took it as that when I was watching it. If you read down, you will notice the first person who commented on the film takes it this way. My reasoning went thus: Bunuel saw the Hurdanos in his peculiar surrealist light. Here was a people degraded to the point of utter absurdity. For instance, there is a scene where the farmers are working in a place where adders are plentiful. The adders frequently bite them, but these bites are not fatal. They would eventually heal, but these people don't know that. Instead, they use a kind of ointment to cover the wound, and this treatment actually leads to infection, which eventually mangles or even kills them. In another scene, we are told that the children only know bread from the bits that the local church gives them. They are not allowed to take these bits of bread home because their parents don't trust bread, and will confiscate it and toss it out (this is what I read in an essay about the film; the version I watched had an English voiceover, whose explanation for the parents' actions was to steal the bread for themselves. I believe that the version in the essay is the more correct one). The surrealist aspects of the scenes I mentioned are there. But, reading that aforementioned essay (and a second), I realize that I was wrong about the humor. Surrealism, you should note, does not = comedy. This is a more serious surrealism. In fact, Bunuel made the documentary as a political statement, showing how the Spanish government treated its people (in fact, he was wrong on this point; Franco idolized the area and had great sympathy for the people, believing them to represent the primitive aspects of Spain; in later decades, he would pour a lot of money into the region). It caused an upset, though not as much as the previous two films. I imagine that people then didn't know how to take it either, since many critics were up in arms over this apparently massive change in Bunuel's style. Nowadays, Las Hurdes seems better than ever before. It is an amazing documentary, and the people represented in it deserve our sympathy. I wonder if their lives have now changed. 9/10.",
         "Luis Buñuel's approach to film-making was so unusual, and his intentions so hard to decipher, that you can never be quite sure what his movies were meant to convey. So it should probably not be too surprising that even when he makes a documentary it is still hard to tell exactly what he was doing. While this gives every initial appearance of being a straightforward documentary, it is not long before Buñuel's detailed yet surrealistic approach begins to show in subtle ways. Whatever else may be true, it is an unusual film, and a generally interesting one. It is also unsettling - at times, very much so. It depicts a civilization that, though located in the midst of Spain just before the Franco era, could almost be from pre-historic times. Many of the images and much of the commentary are disturbing and uncomfortable to watch, to say the least. Yet the tone is far from emotional, and in fact it seems to be deliberately withdrawn, even unsympathetic, much of the time. At the same time, it's easy to see why there are those who suggest that Buñuel was not filming a strictly objective documentary. While there are no outlandish or fantastical images, his distinctive style shows up in less obvious ways, through odd details and sequences. There also seem to be a number of different versions of the narration, which do not always cast events in the same light. So, as so often tends to be the cast with Buñuel, all that you can do is to watch it for yourself and then make your best guess as to what it all means.",
         "Bunuel had always been a visionary man,his cinema had never stopped trying from \"un chien andalou\" to \"le fantôme de la liberté\".\"las Hurdes \" was a documentary ,but it made the genre explode.And,to think it was seventy years ago! Near the Portuguese border,there's a part of Spain where a doomed humanity used to live.The beginning of \"las hurdes\" deals with a feast in a village,last stop before the Hurdes country. Then Bunuel begins his unthinkable depiction of this subhumanity:morons,maimed persons,monsters with twelve fingers,living in a filth you could not imagine.They drink in the brook/sewer!Springtime which everybody enjoys elsewhere is the worst season for the \"Hurdes\":all that remains for them to eat is cherries.But they cannot wait that they ripen,so they contract dysentery and they fall like flies. And ,however,in a world that God seems to have completely forgotten,the children learn at school that the sum of the angles of a triangle is 180 degrees.And chiefly,they must respect the property of others(!). On the wall of the classroom,you can see a picture,showing an eighteen century marchioness! Irony and surrealism are always here .After these horrors,out of the blue,Bunuel begins a lecture on the anopheles mosquito,complete with anatomical charts. Banned by the Spanish government in 1933-1935,it took the Popular front(1936)to release what was the first social and political documentary.",
         "I saw this movie with absolutely no idea what it would be about or when this movie was made, only that it was made by Luis Bunuel, and I felt I HAD to at least have seen 1 movie made by the man so many people see as one of the many movie gods. I must add that before seeing Las Hurdes (\"Land Without Bread\") in the theatre where I saw it, they had programmed the documentary \"Bunuel's Prisoners\". In which the people of the Hurdes region comment on the movie and the circumstances under which this movie came to be. This movie gave me enough information to watch the main feature (Las Hurdes) with a much more realistic view than if I had seen this movie without seeing the doumentary first. In the documentary several people express their annoyance and irritation with the manner in which Bunuel has twisted and fabricated some of the scenes in the actual movie/documentary. The goat falling from the cliff is not exactly falling per accident and the \"dead\" baby in one of the last scenes is not dead at all (this can be seen by watching the moving chest of the baby). All in all I enjoyed this slightly fictional documentary very much and I recommend everybody to go see it. It will either make you laugh out loud at times and leave you deeply disturbed at other times. A must for people who are not allergic to foreign movies from before WW2. 9/10",
         "I have been frustrated by the version of the film that is available in my area, entitled \"Unpromised Land\". The original \"Tierra sin Pan\" has a completely different commentary which is made \"politically correct\" in the \"Unpromised\" version. Avoid \"Unpromised Land\" as it censors and alters the original intent of the film as conceived by Bunuel!",
         "Las Hurdes is one of the most disturbing, and most hilarious, films ever, and was so far ahead of its time that modern flirtations with the absurd and with black comedy pale in comparison. Ostensibly a documentary, it gradually betrays its subversiveness and we understand that it is a manufactured reality. In a memorably cruel moment, a goat tumbles off the side of a steep slope it is climbing after the narrator describes the precariousness of its climb. The puff of smoke that appears in frame just before the goat falls tells us that the goat had some help from the film crew in falling off the cliff. This film is brilliant and depraved and will either have you laughing hysterically or feeling rather upset, or possibly both.",
         "I found it very interesting reading the reactions of others here, from interpreting this as everything from a pure comedy to a pure documentary. The truth is that it denies classification, and for many that just simply does not compute. Therefore, it has obviously done exactly what Bunuel wanted. The aim of surrealism is to lure you in with the trap of a conventional narrative, and then hit you right in the face with something impossible to just passively accept. This film is the perfect example of this. You are absolutely forced into the role of active observer; forced to draw your own conclusions. Independent thought is pulled to the surface, returning comprehension to it's original purity. Reality lies not in what you are seeing, and not in what you are hearing, but somewhere in-between. My God, this man was a genius, and so far ahead of his time it's unbelievable. Spielberg shows you what you want to see. Bunuel shows you what you need to see. Find this film and see it. Its value is incalculable.",
         "\"Las Hurdes\" may be the Surrealist documentary par excellence, a tendentious film discourse about poverty shot in Las Hurdes Altas, a human settlement out of a nightmare, among steep precipices, in an almost deserted landscape. Even based on Maurice Legendre's 1927 anthropological text \"Las Jurdes: A Study of Human Geography\", Buñuel forced into the harsh situations his own obsessions with insects and donkeys that would appall today any society for the protection of animals. Done at a time when Spain was among the nine countries with the highest level of economic development, by contrast this work shows the state of misery of a community marginalized by landowners, forgotten by authorities, and living in the cruelest of conditions. The cynic commentary makes the facts more striking, but the music score by Darius Milhaud is an obtrusive element. Although banned by the authorities, it was re-released with a Spanish narration read by actor Francisco Rabal.",
         "In a sense, I felt really bad after I saw surrealist Luis Bunuel's third film Land Without Bread (or Las Hurdes), since the imagery and cold, distanced, but un-cannily sympathetic narrative reminded me of the commercials on TV for starving children in Africa and abroad. For a person such as myself seeing this for the first time in this year, when technologies and replenishments are never far from reach, this village pulls at one's heart-strings, and not just in the manipulative Sally Struthers-esque style either. Bunuel uses half an hour to create a historical document with the emotional weight of Resnais Night and Fog, however for a different cause. Though Resnais was making an indictment of society not paying attention at the time to the horrors of the holocaust, and Bunuel is showing day-to-day life in a primitive society, the two films share a quality- these are views of humanity that Government does (or rather did) suppress, and at the least it brought me to an existential catharsis. How is it that people such as the Hurdanos stand to live like this? But that's not to say Land Without Bread is as bleak as a Bergman film being screened for a group of methadone addicts. It is, after all, a Bunuel film, and the sense of surrealism that certainly didn't die down after his great works of art Un Chien Andalou and L'Age D'Or is present. The way he cuts to certain images, however real as can be, take on at times a sub-reality. If one ventures into this film not knowing it was conceived as a filmed document, and is perhaps cynical to believe the stone buildings and desolate, starving, doomed-looking people aren't residents of the area, one could think this is another fictional attempt by Bunuel to take jabs (vicious ones) at the Spanish government (leader Franco, who later changed his policies over the region). It IS real, however, and once it started to dawn on me that the editing and some of the camera moves were a kin to surrealism, though over all these stark, true images, I felt the power of it and of the desperation. Now, seventy-two years after it was current events, Land Without Bread stands not only as a brief history and (as Bunuel considers it) geography lesson, but as an artistic triumph- Bunuel nails the points down and leaves faces and landscapes that etched into one's consciousness. You may feel sad after the film is over, or maybe glad that you're living in the time and place you are now. Any way to look at it, it's a worthwhile film to see.",
         "Bunuel was sick of condescension so he made the most condescending movie ever. He didn't want to make a film wherein people saw it, felt awful, gave five dollars to charity, and patted themselves on the back. Instead he made a movie where you laugh all the way through and feel ashamed of yourself for a week afterwards. This was not meant to be a documentary because, at the time, there was no such word. It was meant to be a true-ish film that was a take off of overly sympathetic travelogue films. When they shoot the goat it's amazing. Because first you think you witnessed a tragic fall and then you realize that there are three camera angles and visible gun smoke. You're meant to laugh. The donkey that was stung to death by bees was first covered in honey. The fact that the men leave an then come back is Bunuel's comment on people. We go back to awful situations because we're afraid of new things, He makes you laugh at the people and then realize it's not just them you've been laughing at. The whole thing is horrific and amazing. Also, apparently, a couple of years ago, a professor of film at Columbia turned off the soundtrack because he didn't believe it was original. He didn't think Bunuel meant it to be there because it mocks the people so much. but Bunuel most definitely did."
      ],
      "genres": [
         "Documentary",
         "Short"
      ],
      "productionCompanies": ["Ramón Acín"],
      "summaries": [
         "The region of Las Hurdes, not far from Salamanca, is largely cut off from the rest of the world. To reach Las Hurdes, it is necessary to travel through the town of La Alberca, which itself has some unusual sights and customs. The Hurdanos themselves live in several dozen villages in the nearby mountains, near a valley that contains the ruins of a convent. The lifestyle of the Hurdanos is so primitive that, until fairly recently, even bread was unknown to them.",
         "A surrealistic documentary portrait of the region of Las Hurdes, a remote region of Spain where civilisation has barely developed, showing how the local peasants try to survive without even the most basic utilities and skills."
      ],
      "budget": 0
   },
   "movielensId": 25785,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1933-12-01",
      "dvdReleaseDate": "2006-10-21",
      "directors": ["Luis Buñuel"],
      "runtime": 29,
      "movieId": 25785,
      "title": "Land Without Bread",
      "mpaa": null,
      "actors": [
         "Abel Jacquin",
         "Alexandre O'Neill"
      ],
      "imdbMovieId": "0023037",
      "originalTitle": "Las Hurdes",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["qO86FO1bs6g"],
      "plotSummary": "Las Hurdes – Tierra Sin Pan / Land Without Bread / Unpromised Land is a surrealist documentary filmed in Spain in 1932. It is the result of a two month trip through the Las Hurdes region. The film shows the contrasts between the village and the towns in the north of Extremadura, Salamanca and along the border of Portugal.",
      "tmdbMovieId": 91,
      "avgRating": 3.43243,
      "releaseYear": "1933",
      "numRatings": 37,
      "posterPath": "/AszNP3bBHwdkzX9mL514Zfk859s.jpg"
   }
}