{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "bisexuality",
            "id": 3183
         },
         {
            "name": "time travel",
            "id": 4379
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0127302",
      "video": false,
      "title": "The Sticky Fingers of Time",
      "recommendations": [],
      "backdrop_path": "/wdZUIk92yrG7R8KvDC37FEhnGlg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tucker",
               "gender": 1,
               "credit_id": "52fe480ac3a368484e0e6721",
               "name": "Terumi Matthews",
               "profile_path": null,
               "id": 180609,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Drew",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6725",
               "name": "Nicole Zaray",
               "profile_path": null,
               "id": 559290,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ofelia",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6729",
               "name": "Belinda Becker",
               "profile_path": null,
               "id": 41052,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Isaac",
               "gender": 2,
               "credit_id": "52fe480ac3a368484e0e672d",
               "name": "James Urbaniak",
               "profile_path": "/13cOcBh08yfhJQGvrnZ6ZteWfzw.jpg",
               "id": 58528,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "J.L.",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6731",
               "name": "Thomas Pasley",
               "profile_path": null,
               "id": 559291,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gorge",
               "gender": 1,
               "credit_id": "52fe480ac3a368484e0e6735",
               "name": "Samantha Buck",
               "profile_path": "/iWSSfqlpeIcnN8Y82RRB8NSYjjX.jpg",
               "id": 164149,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dental Assistant of Death",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6739",
               "name": "Julie Anderson",
               "profile_path": null,
               "id": 559292,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Girl in Window",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e673d",
               "name": "Amanda Vogel",
               "profile_path": null,
               "id": 559293,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dex",
               "gender": 2,
               "credit_id": "52fe480ac3a368484e0e6741",
               "name": "Leo Marks",
               "profile_path": null,
               "id": 68425,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Cop",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6745",
               "name": "Justin X. McAvoy",
               "profile_path": null,
               "id": 559294,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Rachel the Bartender",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6749",
               "name": "Amanda Cole",
               "profile_path": null,
               "id": 559295,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "'This Guy' in Bar",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e674d",
               "name": "Tom Vought",
               "profile_path": null,
               "id": 559296,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Drew's Mother",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6751",
               "name": "Alana Jerins",
               "profile_path": null,
               "id": 171838,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Little Drew",
               "gender": 0,
               "credit_id": "52fe480ac3a368484e0e6755",
               "name": "Rebeka Milkis",
               "profile_path": null,
               "id": 559297,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe480ac3a368484e0e671d",
               "name": "Hilary Brougher",
               "profile_path": null,
               "id": 85925,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe480ac3a368484e0e675b",
               "name": "Hilary Brougher",
               "profile_path": null,
               "id": 85925,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.171844,
      "production_countries": [],
      "id": 70687,
      "vote_count": 3,
      "budget": 250000,
      "overview": "A 1950s author (Terumi Matthews) is transported to 1990s Brooklyn, where she meets a woman (Nicole Zaray) who reads about her life.",
      "similar": [
         87101,
         83542,
         141,
         59967,
         281,
         869,
         871,
         2048,
         9693,
         17431,
         110415,
         112160,
         858,
         19,
         63,
         97020,
         101299,
         76341,
         39254,
         19959
      ],
      "original_title": "The Sticky Fingers of Time",
      "runtime": 90,
      "poster_path": "/4mSQvRqV9xgkFEbmVc3eMhIPOd3.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1997-06-06",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Hilary Brougher"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Hilary Brougher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0127302/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1NDk1MDgzMF5BMl5BanBnXkFtZTcwNjg3MDMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Terumi Matthews, Nicole Zaray, Belinda Becker | See full cast and crew »"],
      "reviews": [
         "I can't say enough good things about this movie. Clever, well-acted, well-written, and constructed with an intricacy and a clarity that just blows me away. This movie is just plain solidly good. Having said that, I'm amused by the critics I've read who make comments re this film to the effect of \"Finally, a sci-fi movie directed exclusively at women!\" I'm all for sci-fi directed at women. But let me tell you, as a hetero male sci-fi geek, I have no problem at all settling down to watch a story about time-traveling lesbians. Are you kidding? What is perhaps a bit more unusual in sci-fi is the portrayal of realistic, three-dimensional female characters, and the very natural, and, I'll say it, feminine way that they deal with the bizarre events that befall them. Particularly in genre movies, faux-feminist \"strong women\" are often depicted as essentially men in female bodies. The central characters in this film are strong people (well, one of them becomes strong) and it has nothing to do with gender inversion, or reversal, or some sort of overthrow of the male paradigm. Or, if that stuff is in there, it's buried deep enough that I didn't feel beat over the head with it. The world would be a better place if the marketing machine was put to use convincing people to see movies like this instead of, to take some recent examples, Pearl Harbor and Planet of the Apes. The Sticky Fingers of Time made me feel better about being alive. I want the poster. Bravo.",
         "I came across this title when searching the extensive collections of sci-fi time travel films. I dare say that I was not initially impressed with the things I found, but the actual blurb won me over. I found this on DVD for £4.99 retail which was a bargain. The film begins with what can be described as \"sesame street Colouring\". The camera was obviously low budget, so the colours all appear murkey and bleed into each other. This would have been where I would have stopped watching which would have been a real mistake. The premise of the film quickly takes hold, and you learn about the characters in a very alternative fashion. The film is seperated into sections that have very little connectivity until the storyline takes hold. This is where the film comes into its own. The film is part colour part black and white, giving the indication of which time period you are in. This is a really simple way of doing this but it is so effective. The slices of the film really come into place at the end and you realise what a masterpiece of direction this actually is. This really would have been excellent with a big screen budget if that could have been done without dumbing down the plot (probably not with the state of films today). Give this film a chance, it is so cheap to buy, just slightly more than renting \"Navy Seal's\" which would be a waste of good money. If you give the first 20 minutes a chance you should enjoy it. (don't get drunk before, you might miss out on the plot). 7/10 (10/10 storyline, 9/10 entertainment value, 5/10 production value). TWELVE MONKEYS WITHOUT THE MONEY BUT MORE PLOT.",
         "I saw this film two or three years ago at one of the San Francisco film festivals. I loved it. I told everyone about it, and have had to wait this long time before I found it on DVD. It is expertly written and directed, a phenomenal film. It cloaks any budget constraints in a black-n white film noir look and feel, very convincing, all time periods feel authentic (good costume work - also good set designs). The time travel elements are well told, especially for such a complex underlying concept. There's nothing condescending or overbearing the way you found in Matrix (no endless monologues explaining everything). Rather, it's concise in it's storytelling, told visually and thematically and through action. Really nice, a fun romp through time, very catchy. All actors were well above what I've come to expect, even - or maybe especially - from Hollywood. No one really let the ball fall. I recommend this to anyone who loves film noir or science fiction - thriller stories.",
         "I'd highly recommend this for noir fans--a great twist on the genre, with its additions of time-travel and backwards-to-forwards plotline and lesbianism. The first scene, naturally, makes you say, \"How'd that happen?\" and the rest of the story is how you saw what you saw in the first minute. Shows \"12 Monkeys\" what it could have been if it had had any guts at all.",
         "I just bought this on DVD and I totally don't get the comment by Total Film, that is supposed to hook you on. A \"Lesbian 'Pi'-like sci-fi flick\" totally does not capture the essence of this movie. If anything, these women are bi-sexual but it has absolutely nothing to do with the movie. SPOILER AHEAD: It is a low-budget film, but the only time I was disturbed by that, was Ophelia's \"tail\". It's also not about the science - in fact - I don't believe any concept of time-travel myself. If you just assume the theory, than this movie has a nice way of portraying the chaos a human-being would be confronted with and with all the twists in the timeline, in the end you feel like it has come full circle. However - when you think about it, it presents the same paradox that plagues any time-travel concept: it couldn't have happened to begin with, but to end like that it needed to have happened. I also agree with Michael Bennet Cone, about the way the women are portraid here and I really dig Isaac's \"Oh well, I'm in this s*** somehow somewhere and I think I get it, but at least let's have some fun\" attitude. All in all, it kept me interested to the very end.",
         "This movie was absolutely superb. My friends and I saw it two nights in a row; I'd gladly see it again, but it was only in my area for a weekend. If Hilary Brougher can make this movie with $250,000, I can't wait to see what she'll make with more. The story is beautifully crafted, suspenseful, and totally original. The actors were excellent, especially the ones who played Isaac, Tucker and Drew. There were some understatedly hilarious lines that perfectly balanced the frightening/bizarre storyline, and everything came together beautifully--and unexpectedly--at the end. This is the kind of movie I want to make! As the local arthouse theater that showed this put it, \"Although we're not positive, we're heralding this film as a first of its genre: a pre- and post-apocalyptic time-travel/atomic-bomb-mutation/lesbian chic/suspense dramedy.\" Whatever you call it, it's great.",
         "Started out fairly interesting, but at about 15 minutes into the film, a case of the low-budgets kicked in and killed the movie. I have nothing against low budgets, mind you, but you must have an interesting story, or characters you can care about in order to get really involved in a film. \"El Mariachi\" is a good example of what you can do with an ultra-low budget and still make a film that engages the audience. Woeful acting and editing took me completely out of this film and made me acutely aware that I was watching a low-budget piece of garbage. A silly, nonsensical, \"since-it's-science-fiction-I-can-say-whatever-stupid-mumbo-jumbo-I-want-an d-you-have-to-accept-it\" story line was the capper on this crapper."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": [
         "Crystal Pictures",
         "Good Machine",
         "Isen Robbins Productions"
      ],
      "summaries": ["A writer, Tucker Harding, is hired to cover an article on the hydrogen-bomb test, Nevada, 1952. While there, radiation mutates her code/soul, spawning in her the ability to travel through time by force of will. Not long after she is murdered by a woman from the future, Ofelia, intent on securing her own ability to time travel. However, before her death Tucker travels to the year 1997 where she meets Drew, a failed writer who has been infected with Tuckers original mutation since birth."],
      "budget": 250000
   },
   "movielensId": 2578,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-06-06",
      "dvdReleaseDate": "2001-08-21",
      "directors": ["Hilary Brougher"],
      "runtime": 90,
      "movieId": 2578,
      "title": "The Sticky Fingers of Time",
      "mpaa": "",
      "actors": [
         "Terumi Matthews",
         "Nicole Zaray",
         "Belinda Becker",
         "James Urbaniak",
         "Thomas Pasley",
         "Samantha Buck",
         "Julie Anderson",
         "Amanda Vogel",
         "Leo Marks",
         "Justin X. McAvoy",
         "Amanda Cole",
         "Tom Vought",
         "Alana Jerins",
         "Rebeka Milkis"
      ],
      "imdbMovieId": "0127302",
      "originalTitle": "The Sticky Fingers of Time",
      "genres": [
         "Science Fiction",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A 1950s author (Terumi Matthews) is transported to 1990s Brooklyn, where she meets a woman (Nicole Zaray) who reads about her life.",
      "tmdbMovieId": 70687,
      "avgRating": 3.00971,
      "releaseYear": "1997",
      "numRatings": 103,
      "posterPath": "/4mSQvRqV9xgkFEbmVc3eMhIPOd3.jpg"
   }
}