{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "zombie",
            "id": 12377
         }
      ],
      "imdb_id": "tt0028174",
      "video": false,
      "title": "Revolt of the Zombies",
      "recommendations": [
         22741,
         89723,
         95560,
         27468,
         108382,
         100051,
         23104,
         110980,
         35664,
         63087,
         74836,
         59744,
         85673,
         31243,
         48202,
         51260,
         30637,
         37464,
         84422,
         41025
      ],
      "backdrop_path": "/skwmyYxbYxHMzIW1ScLUDxgSWZI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Armand Louque",
               "gender": 0,
               "credit_id": "52fe4468c3a368484e0213a3",
               "name": "Dean Jagger",
               "profile_path": "/ynPzyxE5xvkKDwr8xw18WoCsITN.jpg",
               "id": 29313,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Claire Duval",
               "gender": 0,
               "credit_id": "52fe4468c3a368484e02139f",
               "name": "Dorothy Stone",
               "profile_path": "/xUM5pJJ28VDVjub6EaEqR6an90h.jpg",
               "id": 90066,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Col. Mazovia",
               "gender": 2,
               "credit_id": "52fe4468c3a368484e0213a7",
               "name": "Roy D'Arcy",
               "profile_path": "/pCk3zupUHQ1ar5Fn6k0Mh4zs4j7.jpg",
               "id": 90067,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Clifford Grayson",
               "gender": 0,
               "credit_id": "52fe4468c3a368484e0213ab",
               "name": "Robert Noland",
               "profile_path": null,
               "id": 90068,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "General Duval",
               "gender": 2,
               "credit_id": "55acad039251411e0600872e",
               "name": "George Cleveland",
               "profile_path": "/pbfP5mephNymAfn3uqADdMTqny5.jpg",
               "id": 32218,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Dr. Trevissant",
               "gender": 2,
               "credit_id": "55acad15c3a3682d63005d73",
               "name": "E. Alyn Warren",
               "profile_path": "/bzeIBytktSELtD1HP7ucOSbzTp2.jpg",
               "id": 120556,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ignacio / Max MacDonald",
               "gender": 0,
               "credit_id": "55acad36c3a3687265002082",
               "name": "Carl Stockdale",
               "profile_path": "/eGl3frKagbHWp2cH17vpV1WNIKA.jpg",
               "id": 29961,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Priest Tsiang",
               "gender": 0,
               "credit_id": "55acad4b9251411e14008843",
               "name": "William Crowell",
               "profile_path": null,
               "id": 1188386,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Buna",
               "gender": 2,
               "credit_id": "55acad579251411e06008734",
               "name": "Teru Shimada",
               "profile_path": "/uuIjelPPEOUGcG68HNzme1xhUzc.jpg",
               "id": 10072,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Gen. von Schelling",
               "gender": 2,
               "credit_id": "55acad699251411e1800823a",
               "name": "Adolph Milar",
               "profile_path": null,
               "id": 1041502,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Dancer",
               "gender": 0,
               "credit_id": "55acad7692514125da00833c",
               "name": "Sana Rayya",
               "profile_path": null,
               "id": 1488714,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4468c3a368484e021395",
               "name": "Victor Halperin",
               "profile_path": "/mP57xqcUgd1sa1Q4BQS8XN3CnKo.jpg",
               "id": 90064,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4468c3a368484e02139b",
               "name": "Edward Halperin",
               "profile_path": null,
               "id": 90065,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55acadd9c3a3682ffc00872f",
               "name": "Victor Halperin",
               "profile_path": "/mP57xqcUgd1sa1Q4BQS8XN3CnKo.jpg",
               "id": 90064,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55acade592514125da008349",
               "name": "Howard Higgin",
               "profile_path": null,
               "id": 588447,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "55acadf29251411e0b0085d5",
               "name": "Rollo Lloyd",
               "profile_path": null,
               "id": 975120,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55acae1f9251411e11008a0e",
               "name": "Leigh Smith",
               "profile_path": null,
               "id": 1357624,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "590e0db1c3a368650a010e81",
               "name": "Arthur Martinelli",
               "profile_path": null,
               "id": 1047646,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.312471,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23389,
      "vote_count": 6,
      "budget": 0,
      "overview": "The story is set in Cambodia in the years following WWI. Evil Count Mazovia (Roy D'Arcy) has come into possession of the secret methods by which dead men can be transformed into walking zombies and uses these unholy powers to create a race of slave laborers. An expedition is sent to the ruins of Angkor Wat, in hopes of ending Mazovia's activities once and for all. Unfortunately, Armand (Dean Jagger), one of the members of the expedition, has his own agenda.",
      "similar": [
         485415,
         400136,
         324786,
         24920,
         1562,
         72190,
         19908,
         170,
         82654,
         766,
         16288,
         10925,
         13648,
         8408,
         22972,
         1369,
         137113,
         4421,
         9667,
         336843
      ],
      "original_title": "Revolt of the Zombies",
      "runtime": 65,
      "poster_path": "/7MPo8rp7bTUpsaseVLBDQJwugse.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Victor Halperin Productions",
            "id": 4604,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Edward Halperin Productions",
            "id": 4603,
            "origin_country": ""
         }
      ],
      "release_date": "1936-06-04",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "WEIRDEST LOVE STORY IN 2000 YEARS!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Victor Halperin"],
      "runtime": 65,
      "synopsis": "In Cambodia in 1937 Count Mazovia (Roy D'Arcy) discovers part of an incantation and formula to control men's minds and turn them in to zombies. While on an expedition in Cambodia archeologist Armand Louque (Dean Jagger) discovers the whole incantation one evening while pining over his lost fianace Claire Duval (Dorothy Stone) who has thrown over Armand for the more stable and attentive Clifford Grayson (Robert Noland), something that Armand is deeply hurt by especially since Clifford is an associate archeologist and former friend. Armand uses some magic incense to control the mind of his servant and then takes steps to put the entire archeological expedition under his control. When he confronts Claire with his plans she convince Armand to release his power from those he has mentally imprisoned but when he does the entire nation turns against him.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028174/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMjYyNTU5OF5BMl5BanBnXkFtZTcwNzQ3NDgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Dorothy Stone, Dean Jagger, Roy D'Arcy | See full cast and crew »"],
      "reviews": [
         "REVOLT OF THE ZOMBIES (2 outta 5 stars) No, this is not a long-lost ancestor to the classic George A. Romero zombie flicks. This is a low-budget potboiler from 1936 that probably seemed very cool to audiences of the time... but seems awfully routine these days. There is actually a pretty good scene at the start of a soldier firing off his pistol into a horde of approaching zombie soldiers... and a close-up of bullets entering the bare chest of one of them. The effect looks hopelessly fake these days but in 1936 I'm sure it had audiences gasping. The story concerns the search for the secret of mind control... ostensibly to create an unstoppable zombie army... but later as a means for one character to win the woman he loves. The movie is barely an hour long but moves at a snail's pace so it seems feature-length, believe me! There really isn't much to recommend it... you may get some amusement from the faked studio shots of the star \"wading\" through a \"swamp\". The ending is interesting... so I'd say the movie is worth seeing at least once. More than likely you will see it as an extra feature on some cheap \"4 movies on 1 DVD\" compilation at Wal-Mart for five bucks. Hey, it's well worth the money...",
         "\"This might mean the end of the white race!\" gasps a general as a dozen Native Zombies wander around the battlefields of Europe during the \"Great War\". An expedition sets out tor the long-lost, back-projected city of Kennif-Angor to stop this sort of thing and keep the battlefields clear for decent honest white people to slaughter each other by the tens of thousands. It is a bit hard to tell when people are zombies or not in this film as the acting is so wooden. Even by 1936 standards the acting in this film is bad. From a previous decade. It looks like it came out of a correspondence school text book on 'How to Act' ------------- Chapter Three: Emotions ------------- \"How to express fear and loathing (Female) Clench both fists. Place fist of one hand on heart. Open mouth as it to scream. Place other fist, palm out, against mouth. Hold pose for 10 seconds longer than is comfortable then quickly turn head 90 degrees away from direction of loathed object and sob\". \"How to have difficult, heavily emotionally charged scene with ex-fiancé explaining your love for someone else. Do NOT make eye contact. Do not move. Do not show any emotion. Do not move your eyes too much as you read your lines off the studio wall.\" To give us a respite from the leaden acting the director cunningly cuts in long pauses where nothing much happens except that film keeps running through the projectors. Thus 35 minute's worth of story is padded out to 60ish minutes. The revolt of the zombies when it comes is so slow! Released from mental bondage the armies of ex-zombiefied minions turn on their former master by ambling slowly up hill and then sort of stabbing a door a bit and smashing a window. \"Yea... let's... oh, I dunnno yeah. Let's get him grrr. Frankenstein must be destroyed - manana.\" (though I have just found a bit of hidden symbolism. Jagger is shot by a Native as some sort of ironic counterpoint to all the Natives being shot by the Germans at the start of the flick. see, even downtrodden Natives don't want the end of the White Race!) The chase (it you can call it that) through the back-projected swamp is hilarious and worth the admission price alone. Roy D'Arcy has a hell of a time camping it up, but is totally wasted, as Col. Mazovia. There is one interesting moment in this film. A nice little montage of the zombied natives and white cast members falling under the evil eyes spell. face after face, cross-fade into one another. It works, though there is a strange little blip in the middle of each close up like a frame has been cut. I guess these must be Neg Cutters' frames between the fades. Best watched with friends and in a silly mood.",
         "No, not in any way a masterpiece, but in no way deserving of a 2.6 on the IMDb poll, this film is better than its' reputation! I have avoided this film directly for 10 years because of its' reputation. 10 years ago I first saw White Zombie, the Halperin brothers' first zombie film, and a horror classic, and was impressed. However, I didn't get this one mostly because Lugosi wasn't in it. Finally, after skipping this title nearly a hundred times, year after year, I finally decided to shell out the eight bucks and sit in horror of pure nonsense, and honestly it wasn't that bad. In fact, there are some redeeming qualities in this. It reminds me a bit of another good independent effort from the year before, Condemned to Live. And the acting is certainly not any worse than in White Zombie, minus, of course, the huge Lugosi charisma. Needless to say, the Halperin brothers employed many of the same cinematic styles from their previous zombie hit. Gone, though, is the heavy music; this time less influential stock music is used. Gone also, are the split screen wipes that made some of the imagery in the previous film so memorable. But, this is still a typical-looking low budget horror from 1936. No better, but no worse. What the problem must be is reputation. This film seems to have some undeserving bullseye on its' head because it is the follow-up to White Zombie. The truth is, another soon-to-be bankrupt studio produced this film and did as good a job on it as any other poverty row horror production up to that time. If you look up other, EXTREMELY SIMILAR low budget horrors from the 30s, many of which I have suffered through, this one has by far the worst IMDb rating. It only proves that the weighted average is no safety against ballot stuffers - it is equally damaging when only 25% of the people vote below the weighted average and 75% is above. It feels like Bush- Gore all over again. :-) 6/10 - 2 1/2 stars.",
         "The plot of the film has a Cambodian priest coming to aid the French during World War One. He is willing to use his powers to make an army of zombies to help the French win the war. When a successful demonstration frightens the French as much as the enemy the priest is locked up to save mankind from his power. While confined the priest is killed by someone looking to learn the secret. The French are frightened that someone else might learn the secret of zombies and sends an expedition to Cambodia to find any trace of the secret so it can be safeguarded. Unfortunately one of the men sent on the expedition discovers the secret just as his love life goes south and he begins to put his new found power to a dark purpose. If that sounds exciting you might want to try this clunky little film, though be warned it turns dull for the middle stretch. Starting with a bang this movie hooks you with the premise of a zombie army fighting in the trenches of the western front, and then crashes into a ditch as the plot shifts to Cambodia and becomes, for a good chunk of its running time, a soapy love story. Its not terrible but but doesn't belong in a horror movie. If you cut the love story out you'd have a great 30 minute horror film. The romance, while a motivating factor for what follows, ends up being more filler than vital plot material. Not the all time turkey that some people have labeled it, this is a movie that has a great start and great end but clunky middle. If you can get past that middle you'll probably find yourself liking this movie, if not you're in for a long night at the movies.",
         "Though the title includes the word \"zombies\", this film is not what you'd expect from a movie made today, though for 1936 the concept is played out about as well as would probably be expected. Dean Jagger portrays Armand Louque, an officer in the French Army of World War I, who has stumbled upon an ancient tale of soldiers turned into automatons, or \"zombies\", who are impervious in battle and may hold the key to victory in the war, though on whose side is not certain. At first he has trouble convincing his superiors of this phenomenon, but eventually French General Duval (George Cleveland) orders a non military expedition into the ancient Cambodian city of Angkor to find the secret of the zombies and destroy it. The story is played out against the backdrop of a love triangle involving Louque, Duval's daughter Claire (Dorothy Stone), and Clifford Grayson (Robert Noland), all a part of the expedition. When Louque laments over his lack of forcefulness and resolve, Grayson offers him advice to go after what he wants in life with all his power. That advice begins to transform Louque, particularly after he's successful in obtaining a stone tablet resembling a photo from the ancient city. Having followed a temple priest into a swamp, Louque now appears to hold the secret he had been seeking, though it's not made clear how he has instantaneously been able to command the power of \"zombiefication\". All it takes is placing his right fist to the forehead simulating a third eye, and casting his thoughts out to those he wishes to control. This comes in handy for winning back his girl, and taking Grayson's early advice as he comments to his servant, \"Buna, we're learning to be ruthless\". Fans of early \"B\" horror flicks will recognize the use of Bela Lugosi's signature eye stare, plucked from the 1932 film \"White Zombie\", also from director Victor Halperin. Of the two movies, \"White Zombie\" is preferably superior, both in story content and in it's depiction of the undead, where the zombies have a more sinister appearance and are more threatening. In \"Revolt\", the zombies are enemy soldiers with a glazed over look that merely react to their mentor's commands. In fact, the actual revolt of the title occurs only when Louque releases the soldiers from his mental command in deference to his love for Claire; they overrun his compound and kill him in the process. Not to be too harsh on the film, it plays out decently within the parameters of it's story outline, but if you're thinking \"zombies!!!\" within the traditional context, you'll probably be disappointed. If you want to sample an early treatment of the subject, the aforementioned \"White Zombie\" with Bela Lugosi is the way to go.",
         "This film is something like a sequel of \"White Zombie\", since it is made by the same man (Halperin) and features zombies. Halperin, the George A. Romero of his day, fails to deliver with this one, though. We have a man who can control the minds of people in Cambodia, and a search to destroy the source of his power so the zombies can be sent free. Also, a love interest for the evil man. Where this film really excels is in the imagery. The Cambodian temples and dancers are very nice and the zombie look very powerful in their large numbers. Unfortunately, we don't really get to see much of the zombies in action and the love story seems to play a much too large role for a horror film (though this has a valid plot reason later on). I would have loved to see some 1930s zombies attack helpless city folk, but this film just did not deliver. And no strong villain (like Bela Lugosi) was waiting to do battle against our heroes. And the use of Lugosi's eyes? A nice effect, but misleading as he is never in the film... why not recreate this with the new actor's eyes? Overall, a film that could be a great one with a little script re-working and could someday be a powerful remake (especially if they keep it in the same post-war time frame). Heck, if they can fix up \"The Hills Have Eyes\" then this film has hope.",
         "OK maybe thats Dean's real hair, but thats about the coolest (?) thing in this middle of the road 30's horror flick. The plot has been described a thousand times here as well as talking about Lugosi's eyes, so lets move on. What made a movie made then cool to watch now was stuff like Tesla coils and lots of test tubes, and if your going to do a zombie flick zombies that look scary. Actually if they had done this right the zombies here would have been scarier than normal zombies because these zombies can mix in well with the population. Imagine if Dean had taken his army of zombies to England and taken over the palace? That would have been really cool! But no Dean has to forfeit his power to show his love to a chick who screwed him over earlier in the flick so I'm like \"screw that Dean, kill her, take the zombie army to England, and take over the palace!\". Anyway, what the hell did he see in her, she was kind of average at best, no Fay Wray thats for sure, more like Martha Reye. My input on the settings, was it just me or did that native dancing girl look totally non oriental and more like a Brooklyn girl with that hook nose? She danced pretty good though, just amazes me that they couldn't get an oriental woman to do that part, maybe take one of the dancers from the Laurel and Hardy flick Sons Of The Desert when they are dancing to Honolulu Baby, remember that one? Those were some hotties, hot cha cha! I give this lame zombie flick a 5 of 10, it had some real promise. Mask of Fu Manchu blows it away.",
         "In cinematic language 'sequel to' and 'follows' are frequently very loose - often ambiguous - terms. This is the case with Revolt of the Zombies which supposedly 'follows' the far superior 'White Zombie' of 1932. The tenuous connections in this case are that both films were made by the Halperin Brothers and both feature zombies. An even more tenuous connection is that the great Bela Lugosi starred in the first film whilst here only his eyes intermittently appear on screen as the zombies of the title are created. The gist of the story is that a Cambodian priest has the power to turn men into zombies, aptly demonstrated at the beginning by having them battle against the enemy in the First World War. Unfortunately the allied commanders are so appalled by the threat of zombies taking over the world that when he refuses to reveal his secrets they imprison him. After his murder an expedition is launched to Cambodia in order to find and destroy the means of zombification. The plot becomes more complicated with the development of a love triangle between our three main protagonists. Our hero Armand Lougue (Dean Jagger) is a man of honour and integrity, his brash friend Clifford Grayson (Robert Noland) has a philosophy of taking what he wants at any cost and their love interest Claire Duval (Dorothy Stone) is a manipulative two-timer quite willing to play both men off against each other. Our hero and heroine become engaged only for her to break it off citing her love for his friend. Disillusioned, he embarks on a lone but successful crusade to find the secret. As the story develops his metamorphosis into a madman intent on ruling the world with a zombie army is matched by the change in both his friend and the heroine who sacrifice their mutual love in order to ensure each others' survival. Amazingly, this is all packed into slightly over one hour - and this would seem to be where the problem lies. The short running length does not justify the complicated plot structures nor does it give time for proper character development. Other cast members, despite their importance to plot, seem to be peripheral - Roy D'Arcy for instance as the villainous Mazovia. Whilst Dean Jagger had a long Hollywood history, Claire Duval appeared in only six productions and this was Robert Noland's only film appearance. Stock footage and some rather shoddy sets along with rather inapt musical accompaniment certainly do not help. Despite this there are good moments to be had although anybody expecting a classic zombie film will feel disappointed which probably goes some way to explaining the low overall vote. Other than some rather old-fashioned - almost as if it were a silent film - acting, I, like other reviewers noted that there seemed to be some editing issues where scenes were cut almost before completion. Whilst there is no production information available it is possible that the original version of this film was cut down for some reason prior to release. We can but wait in expectation and hope...",
         "1st watched 8/21/2009 - 6 out of 10 (Dir- Victor Halperin): Well written early zombie movie that is more about a man's obsession for a woman and the extremes he goes for her than it is about zombies. Zombies in this early movie are just people who are hypnotized to follow a person's commands -- not the dead risen(how this trend started I'm not sure). Anyway, this movie is about a gift that the Cambodians have of making their soldiers follow commands to kill relentlessly and how an American attains that power and uses it for his own purposes. This past statement and a love triangle are the core of the movie. Two friends are investigating this power when a woman steps in the way and mesmerizes one of them first, then the other. The first man's jeolousy brings him to use the power he finds from the ruins to bring her back to him. The movie is slow at times, and sometimes not acted well, but it is captivating none-the-less because of it's story. I'm surprised the movie hasn't been remade because it would make the good basis for a modern redo. It's really a love story with kind of a monster movie side-story(similar to Frankenstein or Dr. Jekyl and Mr. Hyde) except with a hypnotizing mad man. This old gem should be seen and possibly be restored so it can be viewed in a better way, if possible.",
         "Well, first off, if you're checking out Revolt of the Zombies as some very early Night of the Living Dead (1968)-type film, forget it. This is about \"zombies\" in a more psychological sense, where that term merely denotes someone who is not in control of their will, but who must instead follow the will of another. The \"zombies\" here, as little as they are in the film, are largely metaphors for subservience to the state or authority in general, as in wartime. It is quite a stretch to call this a horror film. The film is set during World War I. A \"French Cambodian\" contingent had heard strange stories about zombification--supposedly Angkor Wat was built by utilizing zombies--and there are tales of zombie armies easily overcoming foes. Armand Louque (Dean Jagger) brings back a priest who supposedly knows the secret of zombification, but he won't talk. So Louque and an international military contingent head to Angkor Wat on an archaeological expedition designed to discover the secret of zombification and destroy the information before zombies have a chance to \"wipe out the white race\". One of the odd things about Revolt of the Zombies is that it seems like maybe writer/director Victor Halperin decided to change his game plan while shooting the script. The film begins as if it will explore the zombie/military metaphor, and maybe even have adventure elements, but after about 15 minutes, it changes gears and becomes more of a love triangle story. Halperin does stick with a subtext about will and power (and a Nietzschean \"will to power\"). The film is interesting on that level, but the script and the editing are very choppy. This is yet another older film for which I wouldn't be surprised if there is missing footage, especially since some scenes even fade or cut while a character is uttering dialogue. Amidst the contrived romance story, Halperin tries to keep referring to the zombie thread, but little of the zombie material makes much sense. Louque discovers the secret of zombification, but it doesn't mean much to the viewer. The mechanics of the zombie material are vague and confusing�Halperin even resorts to using superimposed footage of Bela Lugosi's googly-eyes from his 1932 film, White Zombie, but never explains what it has to do with anything. There are big gaps in the plot, including the love story. Promising, interesting characters from early reels disappear for long periods of time. One potential villain is disposed of unceremoniously before he gets to do much. If you're a big fan of old, creaky B movies, Revolt of the Zombies may be worth watching at least once--the acting isn't all that bad, and if you've got a good imagination, you can piece together an interesting story in your mind to fill in all of the gaps. But this is the second time I've seen the film, with the first only being about five years ago, and I could barely recall anything about it--so it's not exactly memorable."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Victor & Edward Halperin Productions"],
      "summaries": [
         "On the Franco-Austrian Frontier during WW I, an oriental priest, chaplain of a French colonial regiment, is condemned to life imprisonment because he possesses the power of turning men into zombies. As the priest,in his prison cell, is preparing to burn the parchment containing the location of the secret formula, Colonel Mazovia kills the priest and takes the partially-burned parchment. Fade to after the war to an expedition of representatives from all the Allied countries (only those with colonial interests it appears) being sent to Cambodia to find and destroy forever the Secret of the Zombies. The group includes Colonel Mazovia (somewhat akin to sending the fox to guard the hen house); a student of dead languages, Armand Louque; Englishman Clifford Grayson; and General Duval and his daughter Claire. Armand falls in love with Claire, who accepts his proposal of marriage in order to spite Clifford whom she really loves. Later, when Claire, following an accident, runs to Cliff for comfort, Armand breaks the engagement, leaving her free to marry Cliff. Further accidents, caused by Mazovia, results in the natives refusing to work and the expedition returns to Pnom Penh. Armand fins a clue which he had overlooked before and returns to Angkor against orders. After viewing an ancient ceremony at the temple, Armand follows one of the servants of the high priest out of the temple, through a swamp, to a bronze doorway. When the servant leaves, Armand goes through the door to a room paneled in bronze, with an idol holding a gong in one hand in the middle of the room. He accidentally strikes the gong, and a panel in the wall opens revealing a small metal tablet. He translates the inscription and realizes that it is the secret for which they have all been looking. He alone now has the power to make zombies out of people, beginning with a practice run on his servant before taking up that little matter of the fickle Claire. Armand is not one to be trifled with.",
         "An international expedition is sent into Cambodia to destroy an ancient formula that turns men into zombies."
      ],
      "budget": 0
   },
   "movielensId": 25829,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-06-04",
      "dvdReleaseDate": null,
      "directors": ["Victor Halperin"],
      "runtime": 65,
      "movieId": 25829,
      "title": "Revolt of the Zombies",
      "mpaa": "",
      "actors": [
         "Dean Jagger",
         "Dorothy Stone",
         "Roy D'Arcy",
         "Robert Noland",
         "George Cleveland",
         "E. Alyn Warren",
         "Carl Stockdale",
         "William Crowell",
         "Teru Shimada",
         "Adolph Milar",
         "Sana Rayya"
      ],
      "imdbMovieId": "0028174",
      "originalTitle": "Revolt of the Zombies",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "The story is set in Cambodia in the years following WWI. Evil Count Mazovia (Roy D'Arcy) has come into possession of the secret methods by which dead men can be transformed into walking zombies and uses these unholy powers to create a race of slave laborers. An expedition is sent to the ruins of Angkor Wat, in hopes of ending Mazovia's activities once and for all. Unfortunately, Armand (Dean Jagger), one of the members of the expedition, has his own agenda.",
      "tmdbMovieId": 23389,
      "avgRating": 1.4,
      "releaseYear": "1936",
      "numRatings": 10,
      "posterPath": "/7MPo8rp7bTUpsaseVLBDQJwugse.jpg"
   }
}