{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0036910",
      "video": false,
      "title": "Henry V",
      "recommendations": [
         56137,
         9797,
         33319,
         15696,
         41799,
         37230,
         43118,
         55368,
         26030,
         45802,
         50034,
         85479,
         112698,
         16561,
         16410,
         40650,
         19072,
         107275,
         42522,
         27197
      ],
      "backdrop_path": "/zNca9BKPRMC1WtQYVJ619bqdaOZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "King Henry",
               "gender": 2,
               "credit_id": "52fe4449c3a368484e01a8bb",
               "name": "Laurence Olivier",
               "profile_path": "/n8jDSq91O95HSbtCJLRsM367kKx.jpg",
               "id": 3359,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Princess Katherine",
               "gender": 0,
               "credit_id": "52fe4449c3a368484e01a8bf",
               "name": "Renée Asherson",
               "profile_path": "/syUX5Gu5TnMMHxDlgl6pqymuK5Y.jpg",
               "id": 20055,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mountjoy - The French Herald",
               "gender": 2,
               "credit_id": "52fe4449c3a368484e01a8c3",
               "name": "Ralph Truman",
               "profile_path": "/71Fi7w0CQKm8RVamcJE8DLORCed.jpg",
               "id": 89064,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Duke of Berri - French Ambassador",
               "gender": 2,
               "credit_id": "52fe4449c3a368484e01a8c7",
               "name": "Ernest Thesiger",
               "profile_path": "/bmgsa81yJ2sYIrFLqiCKLaRDg4t.jpg",
               "id": 2925,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Corporal Nym",
               "gender": 0,
               "credit_id": "52fe4449c3a368484e01a8cb",
               "name": "Frederick Cooper",
               "profile_path": null,
               "id": 936008,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Bishop of Ely",
               "gender": 2,
               "credit_id": "52fe4449c3a368484e01a8cf",
               "name": "Robert Helpmann",
               "profile_path": "/sUkwvIhPCL8UeCLoP60ARq3DJ9p.jpg",
               "id": 81463,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Chorus",
               "gender": 2,
               "credit_id": "579f792c92514178bf00287b",
               "name": "Leslie Banks",
               "profile_path": "/3gElBkEymTBwbLX8sWyOSAP7cgG.jpg",
               "id": 20502,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Archbishop of Canterbury",
               "gender": 2,
               "credit_id": "579f7941925141036100549d",
               "name": "Felix Aylmer",
               "profile_path": "/sfNcE9p956L9WjTGiNB6M6xjUdh.jpg",
               "id": 85345,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Ancient Pistol",
               "gender": 2,
               "credit_id": "579f79609251411655002149",
               "name": "Robert Newton",
               "profile_path": "/Au2CnoSez8BuMXDXEStPxSKAOkp.jpg",
               "id": 29520,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Mistress Quickly",
               "gender": 1,
               "credit_id": "579f7973c3a3683c1c0021a3",
               "name": "Freda Jackson",
               "profile_path": "/gG8SceSfYUiq3j4WIiJhsn6p6UL.jpg",
               "id": 39002,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Boy",
               "gender": 2,
               "credit_id": "579f798c925141438f0038fa",
               "name": "George Cole",
               "profile_path": "/7sY6HvIAEqH8B009ttQIn90J3S0.jpg",
               "id": 47722,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "The Constable of France",
               "gender": 2,
               "credit_id": "579f799dc3a3683c9a0023f6",
               "name": "Leo Genn",
               "profile_path": "/eOAv0mHO140nh3KA78AJ7Agwx32.jpg",
               "id": 29655,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Duke of Bourbon",
               "gender": 0,
               "credit_id": "579f79b9c3a3683c1c0021bd",
               "name": "Russell Thorndike",
               "profile_path": null,
               "id": 84283,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "King Charles VI of France",
               "gender": 2,
               "credit_id": "579f79cec3a3683c65001e5e",
               "name": "Harcourt Williams",
               "profile_path": "/cpPBPKse0jWYqWTlLXWYRfatQ4j.jpg",
               "id": 12000,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Fluellen - Captain in the English Army",
               "gender": 2,
               "credit_id": "579f79e9c3a3686019005a49",
               "name": "Esmond Knight",
               "profile_path": "/ka4eJaGtMlghVQnVcQOFSFEb2uA.jpg",
               "id": 56875,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Gower - Captain in the English Army",
               "gender": 2,
               "credit_id": "579f79fac3a3683c1f0023ff",
               "name": "Michael Shepley",
               "profile_path": "/nqCjSqebgkvuIheNWkRB8DEDUxq.jpg",
               "id": 47665,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Jamy - Captain in the English Army",
               "gender": 2,
               "credit_id": "579f7a09925141787f002a3d",
               "name": "John Laurie",
               "profile_path": "/fOo2XHmHSDSeo7TUpm0l64C6ZOq.jpg",
               "id": 3673,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Macmorris - Captain in the English Army",
               "gender": 2,
               "credit_id": "579f7a1e92514103610054e8",
               "name": "Niall MacGinnis",
               "profile_path": "/q5eQLCeSDWMJ4ghGJW4f7D6Os5k.jpg",
               "id": 93163,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Williams - Soldier in the English Army",
               "gender": 2,
               "credit_id": "579f7a3e92514116550021a6",
               "name": "Jimmy Hanley",
               "profile_path": "/oLKttJoTJWwFTWNbfxyJGgD4TbG.jpg",
               "id": 108680,
               "order": 18
            },
            {
               "cast_id": 25,
               "character": "Duke of Burgundy",
               "gender": 2,
               "credit_id": "579f7a50925141162a001faa",
               "name": "Valentine Dyall",
               "profile_path": "/mc1iqiiah72TBQwhjU33mKpz5Mh.jpg",
               "id": 47480,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4449c3a368484e01a8b7",
               "name": "Laurence Olivier",
               "profile_path": "/n8jDSq91O95HSbtCJLRsM367kKx.jpg",
               "id": 3359,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54d7e117c3a3683b8f006a21",
               "name": "Laurence Olivier",
               "profile_path": "/n8jDSq91O95HSbtCJLRsM367kKx.jpg",
               "id": 3359,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54d7e125c3a3685431003210",
               "name": "Dallas Bower",
               "profile_path": null,
               "id": 7392,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54d7e13292514153b50030db",
               "name": "Alan Dent",
               "profile_path": null,
               "id": 1424804,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5738f2aec3a368573b0012cd",
               "name": "Herbert Smith",
               "profile_path": "/RzwYmeyvBcgXKXq4PX6jobuImg.jpg",
               "id": 41400,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "59ff73b0925141470c04ac15",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 3.031434,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 22638,
      "vote_count": 31,
      "budget": 0,
      "overview": "Olivier mustered out of the navy to film this adaptation of Shakespeare’s history. Embroiled in World War II, Britons took courage from this tale of a king who surmounts overwhelming odds and emerges victorious.",
      "similar": [],
      "original_title": "The Chronicle History of King Henry the Fifth with His Battell Fought at Agincourt in France",
      "runtime": 137,
      "poster_path": "/eAisr20DvaKJeHvjDN0oHSx0l7u.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Two Cities Films",
         "id": 4006,
         "origin_country": ""
      }],
      "release_date": "1944-11-24",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Laurence Olivier"],
      "runtime": 137,
      "synopsis": null,
      "writers": ["William Shakespeare"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036910/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNzAzNDgwOF5BMl5BanBnXkFtZTcwMDU0OTA0NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Laurence Olivier, Robert Newton, Leslie Banks | See full cast and crew »"],
      "reviews": [
         "This is a brilliantly conceived movie-within-a-play-within-a-movie that showcases the genius of Laurence Olivier. Today's audiences are exposed mainly to Olivier the movie actor. But if you want to see a purer form of acting, see Olivier the stage actor. This is possible by watching his Shakespeare plays on film. And these films are by Olivier the \"auteur,\" long before the term was coined. Olivier's is the legacy to which Branaugh and others, who essay Shakespeare on film, must live up to. And lest you're expecting a camera pointed at a stage, don't worry. Olivier, who produced and directed most of his Shakespeare films, has actually used the film medium to enlarge his plays' visual scope, while maintaining the intimacy that is the essence of live theatre. Also, Olivier is mindful of how daunting the language of Shakespeare is for modern audiences and has modified much of the original script to be more comprehensible, while preserving the feel of Elizabethan English. Olivier's \"Henry V\" was to England what Eisentein's \"Ivan the Terrible\" was to Russia \u0097 a familiar history rendered as a national epic, for morale purposes, while audiences were fighting off the Germans during World War II. There are other parallels. For example, both use static, formalized composition, in Henry V's case meant to resemble the images in medieval illuminated manuscripts and books of Hours. (In Ivan's case, according to Pauline Kael, like Japanese Kabuki.) Thus, a sound stage \"exterior\" backdrop becomes a tableau that serves to enhance, with its flat perspective and subjective scale, the view we have of that fabulous Age of Chivalry for which the play's Battle of Agincourt was the closing act. I've always scoffed at the extravagant accolades which show business gives its own. But after seeing this film, or his equally brilliant \"Hamlet,\" I can understand why Laurence Olivier was so good, that a knighthood wasn't enough, and so he was raised to the peerage.",
         "Laurence Olivier's production of Shakespeare's Henry V adds some creative and colorful touches to Olivier's usual fine performance in the lead role. Like the play itself, it's not as deep as the best of Olivier's Shakespeare films, but it works quite well and is an entertaining movie. In the early scenes, the movie combines the play itself with a very detailed look at how the play would have been staged in Shakespeare's own day. It's very interesting, and is nicely done. It takes advantage of the slower parts in the early scenes to draw attention to the stage, the players, and the crowd, giving you a very good feel for what the theater was like then. Olivier also uses this device to liven up considerably the long historical discourse of the Archbishop of Canterbury in the play's second scene. After the early scenes, when the real action begins, the movie wisely pulls away from the theater setting and concentrates on the story itself. Olivier is always good in this kind of role, and the photography and settings do a good job of setting off the action. It is noticeable, though, that Olivier chose to omit several scenes or portions of scenes that have some of the commands showing Henry's harsher characteristics, so that the movie concentrates much more on the king's heroic side. What's left still works fine, but it does lose a little depth without this balance. The rest of the cast is certainly adequate, though most of them are overshadowed by Henry. A couple of the exceptions are Robert Newton, very well cast as Pistol, and Esmond Knight, who works well as Fluellen. Some minor aspects may keep it from being one of the best Shakespeare adaptations, but it's creative, distinctive, and good entertainment. You can rarely go wrong with anything that combines Olivier and Shakespeare.",
         "The film precisely met the requirement to raise moral of Englishmen during the Second World War: it is cheering and inspiring. But in fact it is more than just a patriotic propaganda. Henry V, though made during the war, is an excellent beginning of the series of Olivier's Shakespearean films. I really like it as much as later Hamlet and Richard III. May be the play doesn't seem very distinguished when you read it, but the screen-version becomes exciting, complex and brilliant. It has the amusing beginning (clever allusion to medieval Shakespearean theatre), heroic main part (without unnecessary battle details) and touching happy ending (the scene of Henry wooing Princess Katharine moves me every time I watch it). Lord Laurence is so noble as the King Henry! You can really feel his inspiration and share his emotions. Whenever Olivier's a producer, it's his habit to focus the audience's attention mostly on the main character. Sometimes I think his selection of plays for filming was determined by the amount of time his hero must be on the stage. Well, to say the truth, it's perfectly justified! There never was and never will be any Shakespearean actor comparable to Laurence Olivier! His performance is superb. In the part of Henry the Fifth he is absolutely fascinating, far above any real monarch in dignity, nobility and attractiveness. In fact the whole film is fascinating and picturesque. Princess Katharine is very charming and adequate, and other actors are well chosen too. The way English actors pronounce Shakespearean text is always more natural and expressive than the way of any other nation's actors, distinguished as they may be. I dare say that Englishmen understand something about Shakespeare that we can't get. Anyone who truly estimates Shakespeare must love this film.",
         "This is seriously fantastic stuff. As many others will know by now, I am a huge fan of Laurence Olivier's work, but this inspirational and revelatory performance surpasses all. The first and most important thing is the timing. Incredible!! Olivier managed to get the whole thing together in time for D-Day! (sorry, that was not quite relevant) The fact is, his portrayal of King Henry V had a deliberate purpose to it... he wanted to give England courage in the war they were fighting, just as King Harry had courage against the french. Everything, the sets, the colours, all are so majestic and wonderfully theatrical. That's because Olivier did not want to keep his audience on the indifferent grounds of reality. For many in 1944, winning the war was something totally out of reality, just as it was so for the English at the battle of Agincourt. Olivier wished to transport his audience to the god-given victory, and transport them he did. \"Once more unto the breach!\" Even as a little fourteen-year-old viewer of Sir Laurence speaking these famous words this gave me the curious inspiration... the same that it gave to Winston Churchill sixty years ago. For me, I don't know what the inspiration was for. For Churchill, it was claiming victory in world war 2. Whatever your taste, background, or personality; this film is inspirational, and recommended viewing for everyone. You would be missing something terrible if you did not see this pure patron of an actor grace the screen majestically with his regal inspiration.",
         "What an intelligent film!!! I loved its stage-y quality--The good-humored recreation of a performance in Shakespeare's time with the audience so fully engaged, laughing at jokes we don't understand (e.g., the machinations of churchmen). I loved the details and sense of history--the sets inspired by medieval illuminations and the score by William Walton. The tight script and directing bring out the complexity of the play. Unlike other reviewers, I'd rate it higher than Branagh's more visceral, contemporary version though I can see why some might find this one pallid. It doesn't have a modern feel, and this style of acting Shakespeare feels dated to me--I've grown accustomed to naturalism. Overall, I appreciate that it is many-layered and distinctively English. I hope it accomplished its worthy goal of raising morale during the WWII.",
         "\"Henry V\" is poetry within the historical context of English patriotic pageantry. As Shakespearean scholar J. Dover Wilson observed in a 1943 critique, it justifies and celebrates a well-ordered vision of British conservative values \u0096 respect for the monarchy and a rigid feudal class-system. And as Pauline Kael asserted in 1989, Shakespeare's text \"is perhaps the greatest jingo play ever conceived.\" At the beginning, a Prologue asks us to imagine \"a kingdom for a stage, princes to act and monarchs to behold the swelling scene\" rather than \"the flat unraised spirits...on this unworthy scaffold.\" Laurence Olivier, who directed this 1944 film version, heeds the misgivings expressed in that Prologue. While his staging of \"Henry V\" begins within the enclosed intimacy of a studio-created Globe Theatre, acted before an appropriately attired Elizabethan audience, Olivier uses the medium of Cinema to physically \"open up\" the play as it progresses from scene to scene, increasingly taking advantage of elaborate studio scenery and lighting and mattes, ultimately using vast exterior locations for the climactic Battle of Agincourt. Olivier, in the lead role, is a forceful King Harry, but his work and imagination behind the camera are stunning, especially for a first-time director. The humor of the fumbling \"unraised spirits\" who impersonate the roles of the Archbishop of Canterbury (Felix Aylmer) and the Bishop of Ely (Robert Helpmann) is an early surprise, as is the coarse high-jinks of Robert Newton's interpretation of Pistol, chewing up the scenery and everyone in sight. As a director, Olivier borrows from the conventions of the stage, but it isn't so much that he copies them; he transforms them. Thus, he shows us a fleet of miniature warships engulfed in an English Channel fog, a \"narrator\" superimposed against painted, moving backdrops, and (at the end) the bleak French postwar countryside \u0096 a zone of pillage, poverty, and heartbreak in the aftermath of battle. This version of \"Henry V\" was made with a wartime audience in mind. (The 'V' in the title is a perfect symbolic reference to the times.) Here, the effete, overconfident Dauphin (Max Adrian) and other French nobles stand in for the Axis alliance; the common men who make up the motley army of archers and infantry are a parallel to the agents of 20th-century anti-authoritarianism. The French losses total about ten thousand \u0096 8,400 of which are \"princes, barons, lords, knights, squires,/And gentlemen of blood and quality.\" The English fatalities: only \"five and twenty score.\" An overwhelming victory for the forces of medieval anti-Fascism.",
         "Previous to this film, Laurence Olivier had only one experience with Shakespeare on the screen, 1936's As You Like It. It was not a work that Olivier was terribly proud of. He did determine right there that if he were to do Shakespeare again, he would have complete creative control. Olivier did just that, on this film and every other filmed adaption of the Bard that he was involved in. Olivier's desire happily coincided with Winston Churchill's desire to make some good British propaganda for the war effort. Churchill was fond of what he called Shakespeare's \"war plays\" and Henry V definitely qualifies in that category. He gave Olivier whatever logistical help he needed and remember a war was on. Even to the extent of arranging with Eamon DeValera permission for Olivier to bring the entire Henry V crew to the Irish Republic so that the outdoor scenes could be filmed away from Nazi bombardment. Olivier chooses an interesting method of introducing the play. It opens with a scene of 16th century London at the Globe Theatre at the opening night. The play begins with Leslie Banks as the Chorus reading the introduction and the first scenes are filmed as simply a photographed stage play. After that first scene at Henry V at his court, spitting defiance at the French herald and having his retainers go through an elaborate justification for his claim to the French throne. We then as the Chorus bids us have our imagination take flight until the end of the play when it returns to the stage this time with Henry V marrying the French princess and sealing his claim to their throne. I believe what Olivier wanted to do was show the play through two sets of eyes. He wants the audience to imagine they are in Elizabethan England watching the events of a century before and know that things looked pretty grim then for England and they pulled out of it. The battle scenes at Harfleur and at Agincourt are nicely staged and photographed. Olivier's Henry V is a strong and virile leader, convinced of the rightness of his cause and he has the confidence in himself as military leader to see it through. Kind of like the Prime Minister who was in office then. Certainly in the Middle Ages the high point of English arms was at Agincourt. It was truly one lopsided victory, English long-bowmen against French knights. The French cavalry was truly decimated on that day and a lot of their nobility was killed. And the French were the betting favorites. Seen today though it's a bit different. The Hundred Years War, and this was the second phase of it, was quite frankly a naked war of aggression by the English to obtain the French throne. In 1944 audiences thrilled to remember this impressive feet of arms by the English, but the reasons were kind of glossed over. Still Henry V is an impressive motion picture and I'm sure it did what it set out to do, be a morale booster for the English public. Among other performers I liked in this were Robert Newton as the ancient Pistol and Leslie Banks as the chorus and Valentine Dyall as the Duke of Burgundy. But I would wager that Charles DeGaulle was not invited to the premier showing of Henry V.",
         "Now that we have a fairly long history of quality Shakespeare in the movies, I believe it's fair to compare this film to others, as many have already done. But I'll skip comparisons to the young Kenneth Branagh. What I would like to emphasize is the social importance here, both originally and with this 1944 production. This play was written to celebrate a great English hero, and to stir up patriotism for a profit. (Shakespeare was a successful businessman.) The movie was made for the same reasons, and its value is in how well it accomplishes them. It's very valuable. The film was conceived and made in some dark times for England, and the production occasionally had to stop because of enemy bombers overhead. It could have been thrown off a lot more cheaply and had the same commercial return, but instead Lord Olivier presented a stylish, inspiring, entertaining epic of heroism. I really, really enjoyed the play-within-a-play motif: it was wonderfully fun to see the Globe and the playgoers of the day. I found the acting to be fully satisfying, all the way from a hilarious Robert Newton (he was never this funny anywhere else) as Pistol to Leslie Banks nearly stealing the show as (only) the Chorus. Bravura performances all around--at least from the males, since I have to fast-forward the love scene with Kate. I also appreciated the action scenes, the color and spectacle--and let's face it, the way Lord Olivier could rip off the St Crispian's speech! So, what we have is a wonderful slice of history, expertly presented. Really good Shakespeare.",
         "It's perhaps surprising that when people from a theatrical background turn to film directing, they tend to produce pictures that are purely cinematic and freed from staginess. This is the case with Laurence Olivier, as it was with Rouben Mamoulian and Orson Welles. Here, with his debut feature as director, Olivier not only created a landmark propaganda film, but also redefined the screen Shakespeare adaptation and established a new precedent of renowned actor turning competent director. Shakespeare's play of Henry V was of course ideal for a wartime morale booster, featuring as it does heroic action, rousing speeches, historical parallels with the landings at France, a protagonist who is valiant yet warm and humane, as well as plenty of little extra touches such as exploring the psychology of the troops on the eve of battle and stressing the need for unity between English, Irish, Scotch and Welsh. It was also the perfect play for Olivier to test his ideas on how a Shakespeare play should be turned into a film. The chorus of Shakespeare's original text tells the audience that the great battles and courts can scarcely be contained on a stage and that you must \"on your imaginative forces work\". Using this idea as his starting point, Olivier begins the film with a recreation of a contemporary production of the original play at the Globe theatre, complete with backstage glimpses, bumbling actors and a rowdy Elizabethan audience. Then, as Leslie Banks' chorus commands the audience to \"work your thoughts\", the theatre disappears, and the action subtly opens out into larger sets. Eventually, we are transported to location with thousands of extras for the climactic battle scene. This was not only a complete reworking of screen Shakespeare, it was part of a whole approach to cinema. Olivier's Henry V, although totally different in content, is stylistically in the same tradition as Michael Powell's The Red Shoes or the elaborate ballet sequences of MGM musicals, which also expand would-be stage performances into pure cinematic fantasy. The originator of this approach was probably Busby Berkeley, who also made the switch from stage to screen, albeit from the music hall to the role of choreographer for screen musicals. The musical sequences that Berkeley constructed for Warner Brothers musicals in the mid-1930s always begin with a stage production, but then turn into tour-de-forces of choreography, camera positioning and massive sets, all of which could never be contained or properly appreciated on a stage. Olivier is effectively doing the same thing with a Shakespeare play as Berkeley did with a dancing chorus line. Of course, all this alone isn't what makes Henry V a great work. For a first-time director Olivier's eye is remarkably sharp. He keeps the action smooth in dialogue scenes by making use of long takes, and preferring to move the camera to change the framing rather than breaking the shot with a cut, often dollying in on a single actor to achieve a close-up. He's not quite experienced enough yet though to give these shots a really natural flow, and he doesn't really get the chance to show off his talents as a dramatic director as he would later in Hamlet and Richard III. Having said that, he does manage to give remarkable tenderness to Henry's soliloquy on the eve of battle and his courtship of Kate towards the end of the film. The highpoint however is the impressive Agincourt battle sequence, which was influenced by the battle in Eisenstein's Alexander Nevsky, but is actually an improvement on the Russian master's equivalent work. He similarly builds up tension as the opposing army begins its charge, using a rhythmic editing pattern and dynamic close-ups. However, whereas Alexander Nevsky's battle occasionally looked obviously staged and unrealistic, in Henry V you could as well be witnessing a genuine medieval battle. Olivier selected a top notch cast composed of actors with theatre experience like himself, with exuberant performances from Robert Newton as the cowardly Pistol and Esmond Knight as Welsh captain Fluellen, and too many other great names to mention. Olivier himself, after a decade of learning how to act for screen, perhaps relished the chance to give huge, concert-hall-filling Shakespearean delivery again, although he does manage to rein his performance in again for the quieter scenes. Henry V is remarkable for a director's debut feature. Olivier would direct two more prestigious Shakespeare adaptations, as well as a few dramas, but Henry V is his freshest and most engaging work as a director, and still remains the best.",
         "It's a splendid rendering of Shakespeare book about the warrior king Henry V . The movie begins with an ingenious initiation but the camera from a first general shot on the background lead us until a foreground where some actors are playing at the Glove theater . The film is rightly based on historic events . They are the followings : Henry V vanquishes Charles VI in Agincourt (1415) and took over Normandy . Charles VI of France signs Troyes treatise in what Henry V is wedded to Charles's daughter . His descendant Heny VI of England will proclaim himself King of France but Charles VII (anterior Delphin) will be crowned king of France in Reims and the ¨100 years war¨ going on until 1453 (date of downfall Constantinopla). This is the first of three principal movies directed by Laurence Olivier along with ¨Hamlet¨ and ¨Richard III¨ based on Shakespeare plays . It's an astounding , stirring , stunning and thoughtful film with glimmer , glittering , colorful cinematography and splendid costume . Partly intended as a wartime morale-booster for the British. Certain parts of the play were consequently omitted, such as Henry's hanging of a friend as an example of firm justice . Laurence Olivier won a honorary and special Oscar for his producing , directing and acting in bringing English history part to vivid life of the screen made with pageantry and perfection . The excellent secondary cast is completed with usual players of the English stage theater and films with important careers : Leo Genn (Quo Vadis) , Leslie Banks (Jamaica inn) , Robert Newton (Treasure's island) , Ralph Truman (El Cid) , Felix Aylmer (Ivanhoe) , Ernest Thesiger (Bride of Frankestein), Neal McGinnis (Jason and the Argonauts) , Freda Jackson (Brides of Dracula). The especial departments are outstanding , thus : Robert Furse in wardrobe and costumes , the classic musician William Walton and the photographer of superproductions Robert Krasker . Rating : Good . Well worth seeing."
      ],
      "genres": [
         "Biography",
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": ["Two Cities Films"],
      "summaries": [
         "In the inspired Olivier concept, Shakespeare's play begins as a performance in the Globe Theatre, shifting in broad cinematic terms to an epic narrative of Henry V, who had developed from a dissolute youth to a purposeful monarch. Proving his ability as a soldier and skillful leader, he unites the dissident factions in the English army and goes on to crush the French, against enormous odds, at Agincourt. Arranging a treaty with the French court, he woos Princess Katharine to whom he is formally betrothed as part of the peace agreement.",
         "Grand staging of the Shakespearean play of King Henry V and his famous victory at the battle of Agincourt on St. Crispin's Day, October 15, 1415. Director and star Laurence Olivier begins the film as as staged version of the play at the Globe theater in 1600, eventually moving to the more usual sound stage and the returning to the Globe for the final scenes.",
         "Based on one the most popular historical plays by Shakespeare and made in order to boost moral of British troops during WW2, this movie is about English king Henry V and his military campaign in France in 1415.",
         "Adaptation of Shakespeare's history play in which the young Henry V seeks to conquer France."
      ],
      "budget": 475000
   },
   "movielensId": 25901,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1944-11-24",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["Laurence Olivier"],
      "runtime": 137,
      "movieId": 25901,
      "title": "Henry V",
      "mpaa": "",
      "actors": [
         "Laurence Olivier",
         "Renée Asherson",
         "Ralph Truman",
         "Ernest Thesiger",
         "Frederick Cooper",
         "Robert Helpmann",
         "Leslie Banks",
         "Felix Aylmer",
         "Robert Newton",
         "Freda Jackson",
         "George Cole",
         "Leo Genn",
         "Russell Thorndike",
         "Harcourt Williams",
         "Esmond Knight",
         "Michael Shepley",
         "John Laurie",
         "Niall MacGinnis",
         "Jimmy Hanley",
         "Valentine Dyall"
      ],
      "imdbMovieId": "0036910",
      "originalTitle": "The Chronicle History of King Henry the Fifth with His Battell Fought at Agincourt in France",
      "genres": [
         "Drama",
         "Action",
         "History"
      ],
      "youtubeTrailerIds": ["9tWLrmBu1vM"],
      "plotSummary": "Olivier mustered out of the navy to film this adaptation of Shakespeare’s history. Embroiled in World War II, Britons took courage from this tale of a king who surmounts overwhelming odds and emerges victorious.",
      "tmdbMovieId": 22638,
      "avgRating": 3.58268,
      "releaseYear": "1944",
      "numRatings": 127,
      "posterPath": "/eAisr20DvaKJeHvjDN0oHSx0l7u.jpg"
   }
}