{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wedding anniversary",
            "id": 154855
         },
         {
            "name": "fox hunt",
            "id": 154856
         }
      ],
      "imdb_id": "tt0037096",
      "video": false,
      "title": "Mrs. Parkington",
      "recommendations": [43864],
      "backdrop_path": "/1FIcp2p9fisrZdO80G4ATlHisoH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Susie 'Sparrow' Parkington",
               "gender": 1,
               "credit_id": "52fe47b7c3a36847f81447cd",
               "name": "Greer Garson",
               "profile_path": "/lKRl1a8QkMAbWNOhwr1C9EpOSVR.jpg",
               "id": 93805,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Major Augustus 'Gus' Parkington",
               "gender": 2,
               "credit_id": "52fe47b7c3a36847f81447d1",
               "name": "Walter Pidgeon",
               "profile_path": "/OLUiYHE3wQ5vLswr59RNi1qU5I.jpg",
               "id": 12308,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Amory Stilham",
               "gender": 2,
               "credit_id": "52fe47b7c3a36847f81447d5",
               "name": "Edward Arnold",
               "profile_path": "/oYJfe7rvtubC8CNNa8gqY36iNP8.jpg",
               "id": 30211,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Baroness Aspasia Conti",
               "gender": 1,
               "credit_id": "52fe47b8c3a36847f81447d9",
               "name": "Agnes Moorehead",
               "profile_path": "/ajpbxYhFVcpGAGMnux9zCwzRYlo.jpg",
               "id": 11025,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Edward - Prince of Wales",
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f81447dd",
               "name": "Cecil Kellaway",
               "profile_path": "/3qcMgq1JFZWXct7Y6CiXNi0jCZr.jpg",
               "id": 30228,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Alice - Dutchess de Brancourt",
               "gender": 1,
               "credit_id": "52fe47b8c3a36847f81447e1",
               "name": "Gladys Cooper",
               "profile_path": "/kDebiupJb7f5ZiFVNT9QTNuJfN9.jpg",
               "id": 3366,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jane Stilham",
               "gender": 1,
               "credit_id": "52fe47b8c3a36847f81447e5",
               "name": "Frances Rafferty",
               "profile_path": "/eAGNI21fFgXRwT79b535GIuvHqe.jpg",
               "id": 108432,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ned Talbot",
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f81447e9",
               "name": "Tom Drake",
               "profile_path": "/26fzpI2BNUg2zxjmHuFmkyTdU31.jpg",
               "id": 13995,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Lord Thornley",
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f81447ed",
               "name": "Peter Lawford",
               "profile_path": "/93YIqKGUxyPSN3MNh2a7oXQZ1OC.jpg",
               "id": 4353,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Jack Stilham",
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f81447f1",
               "name": "Dan Duryea",
               "profile_path": "/577hAUPy04u98IwsHKO2rQriJ2e.jpg",
               "id": 64212,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "John Marbey",
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f81447f5",
               "name": "Hugh Marlowe",
               "profile_path": "/z0OHigEHpORu2Dle1lhM5MeG0xn.jpg",
               "id": 10609,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Mattie Trounson",
               "gender": 1,
               "credit_id": "52fe47b8c3a36847f81447f9",
               "name": "Selena Royle",
               "profile_path": "/q6Uk4luE3a4BrErvVMY5zALRf3G.jpg",
               "id": 95271,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Signor Cellini",
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f81447fd",
               "name": "Fortunio Bonanova",
               "profile_path": "/3oTAUQDI95m13EmADN6HI9pws8v.jpg",
               "id": 14979,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Madeleine Parkington Swann",
               "gender": 1,
               "credit_id": "52fe47b8c3a36847f8144801",
               "name": "Lee Patrick",
               "profile_path": "/iBLZ08AwlFw2IPMvzfYIhmIwgIn.jpg",
               "id": 5740,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Caterer",
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f814481d",
               "name": "Doodles Weaver",
               "profile_path": "/zkgv07aQJA3XMnJ1ZjrGH28SFWp.jpg",
               "id": 89735,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Madame de Thebes (uncredited)",
               "gender": 1,
               "credit_id": "5a62ca9bc3a3687fad005d4c",
               "name": "Marcelle Corday",
               "profile_path": "/hStYcWHduKuc9bJbAcDsjMk5jBo.jpg",
               "id": 106092,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b8c3a36847f8144807",
               "name": "Tay Garnett",
               "profile_path": "/rJ8BLFlddNDRIgIPcvxTaTuOitu.jpg",
               "id": 74878,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b8c3a36847f814480d",
               "name": "Robert Thoeren",
               "profile_path": null,
               "id": 3157,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b8c3a36847f8144813",
               "name": "Polly James",
               "profile_path": null,
               "id": 167896,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b8c3a36847f8144819",
               "name": "Louis Bromfield",
               "profile_path": null,
               "id": 2156,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5ab84de1c3a3680a240287c7",
               "name": "Irene",
               "profile_path": "/uqKuNQzRIV4OJQztp2AHuhitWuc.jpg",
               "id": 1012329,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.782641,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50066,
      "vote_count": 5,
      "budget": 0,
      "overview": "In this family saga, Mrs. Parkington recounts the story of her life, beginning as a hotel maid in frontier Nevada where she is swept off her feet by mine owner and financier Augustus Parkington. He moves them to New York, tries to remake her into a society woman, and establishes their home among the wealthiest of New York's high society. Family and social life is not always peaceful, however, and she guides us, in flashbacks, through the rises and falls of the Parkington family fortunes.",
      "similar": [
         332340,
         48303,
         433,
         10768,
         249185,
         47502,
         28967,
         331330,
         202175,
         188631,
         503752,
         256358,
         235946,
         96175,
         365164,
         145268,
         142948,
         129359,
         57222,
         158741
      ],
      "original_title": "Mrs. Parkington",
      "runtime": 124,
      "poster_path": "/qAvBOkCKOfuW8BydeESIRkFjUuR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1944-10-12",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Tay Garnett"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Robert Thoeren",
         "Polly James"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037096/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNTIxNTg2OF5BMl5BanBnXkFtZTcwNjIxOTIxMw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Greer Garson, Walter Pidgeon, Edward Arnold | See full cast and crew »"],
      "reviews": [
         "This is an entertaining family saga from Louis Bromfield's novel, the kind of long, digressive trash wallow that still regularly tops best-seller lists. Essentially a subversive treatise on why inherited wealth is a bad thing, we observe the wealthy Mrs. Parkington as she copes with her selfish, dishonest middle-aged children in 1920s N.Y. while reminiscing about her stormy Gilded Age marriage to her late husband, a Wall Street cutthroat who made a vast fortune. Greer Garson wears a black wig in this role and -- surprisingly -- it really dims her luster. One misses that hair, so unmistakably red even in black and white, which usually illuminates her face. She also looks too old in the early scenes in which she's meant to be a teenager, and her acting is too arch in her scenes in old age. Even so, she's a suitable and sympathetic figurehead for this limousine ride of a movie. Walter Pidgeon is exactly what the part of the Robber Baron requires: physically imposing and masculine, stubborn and rakish by turns, he is never dynamic but always convincing. There are several worthwhile points of interest here: In a role that earned her a Supporting Actress Oscar nomination, Agnes Moorehead gives a vivid performance as the French mistress that Parkington insensitively presses into service to make his wife the queen of N.Y. society. Moorehead's efficient acting suggests everything about this woman's precarious existence as well has her combination of artifice and pragmatism. She's like a character out of Trollope. A slightly lesser revelation is Gladys Cooper, cast against type and showing surprising depths of cynicism as a suicidal playgirl. In addition, the film is more frank and relaxed about sexual philandering (both pre-and extra-marital) than one would expect from an MGM film of 1944. And several of the sets, most notably the spectacular rendering of the Parkington mansion on Fifth Avenue (including an entry hall that doubles as a ballroom, complete with two endlessly curving staircases and a colonnade of pillars that leads to a dining hall seating 100) are prime examples of the opulent art direction one routinely enjoys in Hollywood pictures of the '40s. Finally, although the first third of the film sometimes drags, there are two excellent set pieces that are beautifully constructed and lovingly detailed by director Tay Garnett. The first is a Parkington dinner party to which N.Y.'s 400 are invited -- the pervasive tension and gradual buildup to disaster are really memorable here, as is the use of the film's most impressive set. The second is a very droll bit of drawing room comedy during which Mrs. Parkington meets and enlists the aid of the Prince of Wales to win back her husband from the clutches of an English society hostess. The polite bitchery between the ladies is delightful. Prospective viewers can decide if this list of pleasures justifies a look at this luxe movie.",
         "This appears at first to be a familiar kind of opulent family-through-the-generations saga. And Greer Garson was one of the queens of the genre. But underlying this throughout is a droll, adult subtle wit. And the stylish stars to deliver it. There are those fairly subtle remarks which make the attractive guest smirk and the wife glare at her husband, all of whom are bound by the rules of politeness never to directly say what is, we so gather, very much going on. Remarks intended to indicate just to husband and wife that the attractive guest knows more about the husband's likes and dislikes than does his wife. They are such that other guests - and possibly some viewers - would be unaware of the true state of play. Fully adult themes with never a glimpse of stocking. I didn't intend watching this but just heard the small bit of banter from actor Cecil Kellaway(as the Prince of Wales) who has a surprise meeting with Mrs Parkington. Rarely have I heard words spoken with, how to say it, a more skillful modulation. The speaker, who Mrs Parkington fails to recognise, is no ordinary person. The same thing could be said about the film.",
         "Oh, why couldn't this film have been longer? I was taken in from the very beginning and was fascinated watching the lives of the Parkingtons. Greer Garson was exceptional as we watched her age from a young lady to a family matriarch in her 80's. I must agree that the pairing of she and Walter Pidgeon was superb and Agnes Moorehead's performance was remarkable. Gladys Cooper always stands out in any cast and with costumes of such splendor and the storylines that ranged from tragic to tremendous, there was no way to lose with this movie. Perhaps now, I'll go purchase the novel and see if I can get any more from this tale that didn't make it to the big screen. As they always say, \"the book was better than the movie\". I intend to try and find out. I can hardly imagine it, but I can only hope to find more and more delight from the adventures of the Parkingtons. This was one of my favorites with the pairing of Garson and Pidgeon. It's a truly entertaining movie and I recommend it highly!",
         "Greer Garson got an Oscar nomination for one of her best roles in Mrs. Parkington. Though the film is one that had her co-starring with her favorite leading man, the film is all Greer. Like Maytime the film starts with Greer as the aged family matriarch of the Parkington family during Christmas of 1938. Her husband who died many years ago was Walter Pidgeon and the family has gathered once again. But there's a crisis brewing. Her grandson-in-law Edward Arnold has embezzled a ton of money in some bad market speculation. His daughter Frances Rafferty and Garson's great granddaughter additionally has a romantic problem, she's torn between her fiancé Tom Drake who is whistleblowing on Arnold and family loyalty. During the evening Garson reminisces back to certain crisis times in her own marriage and it eventually tells her what she must do in this situation. I will say this about the Parkingtons, Garson's the genuine article, the rest of them are a spoiled and selfish lot, only Rafferty seems to have escaped the taint. I have to say it was a little strange seeing the much older Gladys Cooper playing the daughter of the heavily made up Greer Garson, still both actresses are professional enough to make it convincing. There's a wonderful performance by Cecil Kellaway as the Prince of Wales during the Gay Nineties when Parkingtons are in Europe. Kellaway may be the Prince of Wales, but he proves to be real sharp in terms of human relations and delicately removes a bump in the road of the Parkington marriage. Agnes Moorehead got a Supporting Actress nomination for Mrs. Parkington in the role of an impoverished French aristocrat who becomes friend and confidante of Garson. She gives Garson a lot of sage advice. She lost to Ethel Barrymore for None But The Lonely Heart and Garson lost her race for Best Actress to Ingrid Bergman in Gaslight. Mrs. Parkington remains however one of MGM's best films of the Forties. The influence of Maytime and of Citizen Kane in the telling of the Parkington family story is obviously apparent. And the message about both inherited wealth and the damage that mere speculation without creating could have come from Wall Street. For Greer Garson and Walter Pidgeon fans a must.",
         "The best scene in the movie is when the recently married Greer Garson and Walter Pigeon are shopping. While Greer is looking at some flowers, she notices Walter's gaze has drifted off to some pretty young women. Without betraying any anger or sadness she says loudly, \"Beautiful, aren't they?\" With that double entendre, Greer's bitter acceptance of her husband's philandering and the never-ending hell she has created for herself by one bad decision is communicated to the audience instantly. Walter gives a quick look to Greer that shows he has been caught, but he doesn't apologize, showing the permanent rift between them. Great acting!",
         "With her son-in-law about to go to prison for fraud, the wealthy Parkington family faces financial ruin. Made up as an 84 year old woman, Greer Garson thinks back to her life with her husband, Col. Parkington, a wonderful Walter Pidgeon. It goes back to her humble beginnings and her meeting with the colonel. The film proves that money isn't everything as we see the ups and downs of the Parkington marriage, constantly beset by tragedies. Garson was nominated for best actress here and Agnes Moorehead, with a totally French accent, snared a best supporting actress bid as her rival turned friend. Gladys Cooper plays Parkington's daughter, a divorcée with a drinking problem. As is the case with the rest of the brood, she is selfish, self-centered and afraid of poverty. Obviously, the Parkington ways did not descend on children and grandchildren. The picture has an all-star cast. Cecil Kellaway stands out as the Prince of Wales, son of Queen Victoria. Garson shows her mettle here. She is a stalwart in every sense of the word.",
         "Greer Garson and Walter Pidgeon turn in fine performances here, in fact, they're as good here as in any of their films. Garson has long been a favorite of mine, and I particularly revere her performance in \"Random Harvest\". This film isn't quite that good, but it is a gem. Of particular interest here are two very unusual performances by supporting actors. When I read, in advance, that Agnes Moorehead played a French socialite...well, I just couldn't see it. But, she was wonderful, and this is an Agnes Moorehead you've never seen before! And Cecil Kellaway as Edward, Prince of Wales...again, a very different performance, and so well done. The story itself is interesting, with Garson as an old family institution reflecting on her life. If there's a criticism about this film, it's that Garson looks too young even in her elderly makeup. But, for much of the movie, she's her usual alluring self. Is it a sentimental melodrama? Yes. But a delightful one.",
         "\"Mrs. Parkington\" is an incredibly well made film--with great acting and some lovely production values. Clearly, MGM gave this film the full glossy studio treatment. And, for her wonderful performance, Greer Garson was nominated for an Oscar. However, I am very ambivalent about the film because so many of the characters are either despicable or pathetic. In many ways, it reminds me of the country music song \"Stand By Your Man\"--as a woman should put up with ANYTHING in order to keep even the most awful man. Clearly, this is a film for dependent personalities! The film begins near the present time. The Parkington family appears to be made up of a group of sociopaths--all loathsome jerks who think mostly of themselves. When the matriarch, Mrs. Parkington (Garson) learns that one of the brood is a thief, she begins to reminisce--remembering her life with Mr. Parkington (Walter Pidgeon). At first, their marriage seems pretty nice--with a rich and doting husband. However, through the course of these long series of flashbacks, you learn that Mr. Parkington is vindictive, petty, selfish and cheats on Mrs. Parkington. And, as for Mrs. Parkington, she is clever and long-suffering--and lifted up as some sort of shining example. I couldn't help but think she was pathetic and would have probably accepted Mr. Parkington back after he murdered or slept with children or sheep. And this brings me to my ambivalence--no one--not anyone in this family is likable in the least. And, the film seems to promote the notion that a woman's job is just to put up with this and smile throughout! Talk about an anti-feminist message! The bottom line is that I'd hate for my daughters to watch such a film, as I'd hate to think that Mrs. Parkington is someone to admire (though the film tries HARD to say this). If Garson's character had either shot her husband or left him and bled him dry in alimony, then maybe I would have enjoyed it much more. A great job of acting and a sick message to this film. Oh, and I should mention that in one brief scene, the Parkingtons joke about how it is Mr. Parkington's job to regularly 'thrash his wife'. Wow....need I say any more?! Well, yes. If you like films that promote women as lovely doormats, also try Mary Pickford's last film, \"Secrets\". Her husband is also a piece of work and she looks back fondly to their lives together.",
         "This B&W film from 1944 stars Greer Garson and Walter Pidgeon, who were riding a wave of success together at the time. MGM threw all of their best production and talent at this film and it shows on screen. The sets are fantastic, the cinematography is beautiful, the music is lush. But I felt disappointed with the final product. The story starts during the Christmas holiday in 1938. The members of the Parkington family are assembling in the grand house of their mater familia, Susie (Garson). As they wait for Susie to descend the stair and honor them with her presence, they spread their flawed character traits (and dissatisfaction with the world) around the drawing room. You may have met a woman like Susie--one whose very existence is a memorial to the memory of her deceased husband, Major Augustus Parkington (Walter Pidgeon). This woman usually refers to her man as \"The Major\" or \"Mister So And So\". And inevitably, the man whose life she celebrates even in death was a real bastard, or at least someone very terribly flawed, making her love for him (supposedly) more heroic, more saintly. There is something to that. Gus was a man dedicated to Susie in his own way. And his love for her was not in compliance with society's rules. But he never bowed to the will of society. Later that night, Jane--the missing granddaughter--drops by to see Susie. She explains that she is leaving for Peru with a young man. This sparks the first of many flashbacks in the film. Back fifty-five years to Leaping Rock, Nevada--a small town built around a silver mine. Susie was only eighteen when she met Gus, owner of the mine. Up to this point in the film, I was enjoying its exposition. But somewhere after Leaping Rock the action slowed to a plodding pace. And the deficiencies in the script and the acting became apparent. Some of the words that come from the lips of the primary couple are inauthentic--at least as delivered. There is a scene where Susie confronts Gus upon realizing he has been working to destroy some men who dared to decline a dinner invitation. Here the acting is truly horrible. And it shows how an inauthentic moment can drag down a film. Maybe it's just me, but I found the incessant use of \"I'll Take You Home Again, Kathleen\" in the background monotonous and annoying. Agnes Moorehead is wonderful as the Baroness Aspasia Conti, the woman who bridged the gap between Susie and Gus and helped them stay together. Hans Conreid is enjoyable in a smaller role as Mr. Ernst, the manager of a temperamental tenor. With all the talent involved, this film should have been better.",
         "It's Christmastime in 1938. Elegant 83-year-old family matriarch Greer Garson (as \"Susie\" Graham-Parkington) welcomes various family members to her majestic New York mansion. The guests display various excesses, which are fueled by their wealth. We will learn the family fortune, estimated at over $30 million (not too shabby for 1938), could be in jeopardy. The holiday spirit triggers Ms. Garson's life story to be told, in a series of extensive flashbacks� Long ago, 18-year-old Garson tends to guests in her poor mother's boarding house. Their Leaping Rock, Nevada home is visited by silver mining tycoon Walter Pidgeon (as Augustus \"Gus\" Parkington). Garson and Mr. Pidgeon exchange winks; we're off and running... We see newlywed Garson move from lowly to life in high society. She doesn't have far to go, looking impeccable in her scenes as a Leaping Rock chambermaid. Still, attractive Agnes Moorehead (as Aspasia Conti) decides to show Garson the ropes, having given up on playboy Pidgeon. Multi-millionaires have problems too, as we discover while the decades pass... \"Mrs. Parkington\" isn't a very engaging story, but it is an excellent star vehicle for Greer Garson. It's all tailor-made, right down to the way she blows the curl dangling over her forehead. The actress had become MGM's most bankable female, with huge box-office success and measured critical acclaim. Very popular with \"Oscar\" voters, Garson added another nomination to her collection. She does an outstanding job, though her craftiness and make-up are not often subtle. Moorehead, Edward Arnold and the supporting cast all hit their marks. Director Tay Garnett, photographer Joseph Ruttenberg and the MGM crew make everything look superlative. A sense of staginess pervades, but it's appropriate; after all, this isn't \"Citizen Kane\". ****** Mrs. Parkington (1944-10-12) Tay Garnett ~ Greer Garson, Walter Pidgeon, Agnes Moorehead, Edward Arnold"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "In this family saga, Mrs. Parkington recounts the story of her life, beginning as a hotel maid in frontier Nevada where she is swept off her feet by mine owner and financier Augustus Parkington. He moves them to New York, tries to remake her into a society woman, and establishes their home among the wealthiest of New York's high society. Family and social life is not always peaceful, however, and she guides us, in flashbacks, through the rises and falls of the Parkington family fortunes.",
         "One Christmas, scandal erupts within the Parkington family, the scandal which threatens both the Parkington expansive fortune and public good name. Widowed Susie Parkington, the matriarch of the Parkington family, handles the situation always thinking about what her husband, the rough and tumble and extremely stubborn Major Gus Parkington, would have done. Susie reminisces about her life with the Major which includes: their meeting when she was living with her family in their boarding house in Leaping Frog, Nevada, where the Major owned the town's mine; her quick need to adjust to high society life in New York as Mrs. Parkington while the Major adjusted to loving a woman for the first time that he didn't want to hurt or abuse; their private battle during a public humiliation; and their estrangement following the death of their son. With thoughts of the Major deep in her mind, Susie makes a unilateral decision, one contrary to the wishes of most of the family, but one that will restore her own sense of what is means to be a Parkington in the truest sense of the Major."
      ],
      "budget": 0
   },
   "movielensId": 25907,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-10-12",
      "dvdReleaseDate": "2009-06-22",
      "directors": ["Tay Garnett"],
      "runtime": 124,
      "movieId": 25907,
      "title": "Mrs. Parkington",
      "mpaa": "",
      "actors": [
         "Greer Garson",
         "Walter Pidgeon",
         "Edward Arnold",
         "Agnes Moorehead",
         "Cecil Kellaway",
         "Gladys Cooper",
         "Frances Rafferty",
         "Tom Drake",
         "Peter Lawford",
         "Dan Duryea",
         "Hugh Marlowe",
         "Selena Royle",
         "Fortunio Bonanova",
         "Lee Patrick",
         "Doodles Weaver",
         "Marcelle Corday"
      ],
      "imdbMovieId": "0037096",
      "originalTitle": "Mrs. Parkington",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["UDNKr831DJY"],
      "plotSummary": "In this family saga, Mrs. Parkington recounts the story of her life, beginning as a hotel maid in frontier Nevada where she is swept off her feet by mine owner and financier Augustus Parkington. He moves them to New York, tries to remake her into a society woman, and establishes their home among the wealthiest of New York's high society. Family and social life is not always peaceful, however, and she guides us, in flashbacks, through the rises and falls of the Parkington family fortunes.",
      "tmdbMovieId": 50066,
      "avgRating": 2.77778,
      "releaseYear": "1944",
      "numRatings": 9,
      "posterPath": "/qAvBOkCKOfuW8BydeESIRkFjUuR.jpg"
   }
}