{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0139394",
      "video": false,
      "title": "The Joyriders",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gordon Trout",
               "gender": 2,
               "credit_id": "52fe4b039251416c750f56dd",
               "name": "Martin Landau",
               "profile_path": "/ylT7pqkcPNsHloe2dJsePFSoIkE.jpg",
               "id": 2641,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe4b039251416c750f56e1",
               "name": "Kris Kristofferson",
               "profile_path": "/hiGkNoiAwnUgY9XZ3YhiWMvKngi.jpg",
               "id": 10823,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cam",
               "gender": 2,
               "credit_id": "52fe4b039251416c750f56e5",
               "name": "Shawn Hatosy",
               "profile_path": "/deVcvUyZEybTQuyBYiioVJ4Lyst.jpg",
               "id": 52647,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Crystal",
               "gender": 1,
               "credit_id": "52fe4b039251416c750f56e9",
               "name": "Heather McComb",
               "profile_path": "/zthsKWkqe6qBMvKlEww6sVhG4Eu.jpg",
               "id": 22248,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jodi",
               "gender": 1,
               "credit_id": "52fe4b039251416c750f56ed",
               "name": "Elisabeth Moss",
               "profile_path": "/iSp2t9GYUUgyqTpz25J6hOHH2An.jpg",
               "id": 32798,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Celeste",
               "gender": 1,
               "credit_id": "52fe4b039251416c750f56f1",
               "name": "Diane Venora",
               "profile_path": "/3k7w5Y7gTAxN1JML7jhN8F8rVrS.jpg",
               "id": 6200,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "58a74395c3a36850e400072d",
            "name": "Bradley Battersby",
            "profile_path": null,
            "id": 263975,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.33009,
      "production_countries": [],
      "id": 143299,
      "vote_count": 1,
      "budget": 0,
      "overview": "A suicidal older man, Gordon Trout, is kidnapped for his car and money by three runaway teenagers who live on the streets. Their experiences together make them a close-knit family, but the nature of the crime committed could tear them apart. The intricacies of these complex relationships are explored through an emotional story with twists and turns.",
      "similar": [],
      "original_title": "The Joyriders",
      "runtime": null,
      "poster_path": "/p3vVhECFR2RuXFQO0HgyjEtnRSY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Noram Entertainment",
         "id": 11465,
         "origin_country": ""
      }],
      "release_date": "1999-04-18",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Life is a journey… so choose the right path",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bradley Battersby"],
      "runtime": 0,
      "synopsis": null,
      "writers": [
         "Jeff Spiegel",
         "Bradley Battersby"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0139394/",
      "coverLink": null,
      "actors": ["Stars: Martin Landau, Kris Kristofferson, Shawn Hatosy | See full cast and crew »"],
      "reviews": [
         "Although it's not a top-notch movie, it still has a lot of charm. The story is surprisingly pleasant and the acting could have been worse. I kinda liked idea that the old man was given a new purpose in life by a bunch of run away teens. The way this was told in the movie was really quite believable. The other way round: The old man gives the teens a reason to start over with their lives and make something out of it. Particularly moving was the subplot from the girl who ran away from home because her mother was psychotic and blamed her for everything that went wrong (She even accused her of flirting with her new boyfriend as she returned home at the end of the movie. It was a really sad scene). I enjoyed this movie and although the review value is low it still deserves an above-average rating i.m.h.o.",
         "This movie was amazing i loved how well the each character play together. The acting was superb and you feel bad for each character and what their going through. Martin Landau is a suicidal man who feels he has nothing to live for after losing everything. His wife wants him to come out of the dark cloud that hangs over his head. That's where the three kids come in. the kidnap him not knowingly and well the adventure begins from there. Shawn Hatosy as Cam was great and his characters story was amazing and he portayed his character well. Heather McComb as Crystal and Elisabeth Moss as jodi were great they amazing actresses and you can't help hearing what has happened to them. It came on TV one day and i watched the first 5 minutes of it and i was hooked i had to know what happened. I loved this movie and i recommended to everyone who has a story to tell.",
         "Martin Landau gives one of his best recent performances (certainly behind Ed Wood though) as a old, suicidal man, who during the Christmas season buys a gun for what could be a finish to his life. But then a sudden mistake has him being kidnapped by 3 runaway teens who have a way of making sure he doesn't escape: he's they're senile grandpa! Powerful a lot of the way, fine performances by the whole cast, too bad towards the end the film becomes almost a statement about runaway teens (a little fascinating, but really a downer considering the rest of the movie). B+",
         "An interesting film about conflict, struggle, and change. While the quality of the film itself was lower than standard, it presented a very realistic out look on homeless youth and the gritty, day-by-day survival on the streets. Throw in a suicidal elderly man who get's caught in the middle of the youth's criminal rampage, and you have an excellent character study of the human nature, and the power of change. Can this old man change the course of these rebellious teenagers? Can these teenagers change this old man's out look on life? Yes to both. This was a great film with a powerful message. A nod to Kris Kristofferson's character who presented the TRUE answers for all the lead characters. Also to the film-makers for the AWESOME choice of music used throughout the film. I was impressed with the acting by the three teenagers, and Martin Landau was already a proven win. Bravo!",
         "This well written film explores four fundamentally different characters who each learn from one another. They start out, each with large chunks of who they are missing, and by the end they've each found out a lot about themselves and how they relate to the world. The films lead is taken by Martin Landau, doing some of his better work. Martin plays an older man about to take his life-- but he's 'rescued' by three teen runaways who kidnap him for his money and car. Throughout the experiences that follow we learn more about why each one of them is on the street. And through an odd series of events, Landau soon comes under suspicion by the law for kidnapping, and at the same time identifies with the kids. By the time the movie over each character was made to face that which prevented them from being whole. Some of them manage to fill the hole, or move to do so, but one only briefly faces a fear and never comes back to meet that fear. I was amazed at how well the movie worked... great direction, good writing.",
         "The movie's description was better than the movie. However, I still can give it \"7\" of \"10\". Some of the premises and scenes were a bit unbelievable. And Kristofferson delivered his \"minister\" character a bit loosely. However, the overall theme, that a suicidal man can find new hope through a bunch of rotten teens, and the same rotten teens can somehow learn the value of a second chance, makes for a worthwhile movie. I bought it for $2.99 at Blockbuster, used, so did not have much invested. I may watch it again now that I know the teens won't kill the old man.",
         "I picked up the box to this movie and thought....hmmmm, this looks like a crappy movie, I think I'll watch it. So I was watching it....still watching it....and it occurred to me that it wasn't as bad as I thought it would be. The storyline was okay, although the script was a bit repetitive, cover similar issues more than once, and I liked the actors. Especially Shawn Hatosy, he's a hottie. And this is really the only other thing (other than Ed Wood) I've seen Martin Landau in and he wasn't bad at all. My favorite character though was Diane Venora as the mom. UUUUGGGGHHHH! What a @*#&$^!!!!! Okay, that's all. :) (8 out of 10)",
         "This is one of the best Christian films that I have seen in a long time. If Christians are going to make movies, this is the way it should be done. I am tired of all of this sentimental, sappy, corny, the-world-is-perfect-and-everythings-happy-lets-all-hug movies. This movie portrays real life situations in a way that is authentic and captivating. It doesn't sell out like \"The Omega Code\", and the HORRIBLE \"Left Behind\" movies. I am a movie buff, and I love movies, but this is the way that Christian movies should be done. I wish I could find this film so I could purchase it.",
         "The acting is good for the most part, although the \"old man\" character could've been improved upon. The plot is watchable, though predictable at times, but not in a very bad way. Bottom line, if there's nothing else on TV, you may enjoy this movie.",
         "I caught this movie on cable (of course) at about 4:00 in the morning. I thought it was well done, if a bit preachy, and it's nice to see a film today where the bad guys actually do get to realize they are doing wrong. Martin Landau is a fantastic actor, Kris Kristofferson seems a little boring, but does his job. The real treat is the three kids who think they're the toughest thing on the street but end up realizing they're nothing but children with a bit of growing up left to do. The only flaw I can really see is that nobody is really as nice as Kristofferson's character. Nobody. Give it an A for effort though, and if you get stuck with insomnia one night, look for it."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Joyriders Productions LLC",
         "Norann Entertainment",
         "Sanford/Pillsbury Productions"
      ],
      "summaries": ["A suicidal older man, Gordon Trout, is kidnapped for his car and money by three runaway teenagers who live on the streets. Their experiences together make them a close-knit family, but the nature of the crime committed could tear them apart. The intricacies of these complex relationships are explored through an emotional story with twists and turns."],
      "budget": 0
   },
   "movielensId": 2592,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-18",
      "dvdReleaseDate": null,
      "directors": ["Bradley Battersby"],
      "runtime": 0,
      "movieId": 2592,
      "title": "The Joyriders",
      "mpaa": "PG-13",
      "actors": [
         "Martin Landau",
         "Kris Kristofferson",
         "Shawn Hatosy",
         "Heather McComb",
         "Elisabeth Moss",
         "Diane Venora"
      ],
      "imdbMovieId": "0139394",
      "originalTitle": "The Joyriders",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A suicidal older man, Gordon Trout, is kidnapped for his car and money by three runaway teenagers who live on the streets. Their experiences together make them a close-knit family, but the nature of the crime committed could tear them apart. The intricacies of these complex relationships are explored through an emotional story with twists and turns.",
      "tmdbMovieId": 143299,
      "avgRating": 2.90278,
      "releaseYear": "1999",
      "numRatings": 36,
      "posterPath": "/p3vVhECFR2RuXFQO0HgyjEtnRSY.jpg"
   }
}