{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "diamond mine",
            "id": 3379
         },
         {
            "name": "allan quatermain",
            "id": 191439
         }
      ],
      "imdb_id": "tt0042646",
      "video": false,
      "title": "King Solomon's Mines",
      "recommendations": [
         198537,
         41954,
         202776,
         63691,
         64559,
         42029,
         60760,
         124475,
         61697,
         55860,
         415253,
         47715,
         55873,
         37368,
         4868,
         4486
      ],
      "backdrop_path": "/oMAwqdtlgkkbJUVDjjjikHSCEHy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Allan Quatermain",
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f573f",
               "name": "Stewart Granger",
               "profile_path": "/vRcMlIV1NTpiXQibMdsl5N4J6gl.jpg",
               "id": 41235,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elizabeth Curtis",
               "gender": 1,
               "credit_id": "52fe4644c3a36847f80f5743",
               "name": "Deborah Kerr",
               "profile_path": "/snyKI73NycIaXjU4GyxDq92ZRo5.jpg",
               "id": 20141,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "John Goode",
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f5753",
               "name": "Richard Carlson",
               "profile_path": "/dGBs79xPf6fFI9p0rEiasmn5G3X.jpg",
               "id": 67685,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Van Brun",
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f5757",
               "name": "Hugo Haas",
               "profile_path": "/viHqjwq8xtYmeDP3z5Dj3YbRCIX.jpg",
               "id": 94198,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Eric Masters",
               "gender": 0,
               "credit_id": "52fe4644c3a36847f80f575b",
               "name": "Lowell Gilmore",
               "profile_path": "/snz5yZHKvG0r5jhazxKjEJlaCuF.jpg",
               "id": 80621,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Khiva (as Kimursi of the Kipsigi Tribe)",
               "gender": 0,
               "credit_id": "5833ade9c3a36833a20042e6",
               "name": "Kimursi",
               "profile_path": null,
               "id": 1712378,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Umbopa (as Siriaque of the Watussi Tribe)",
               "gender": 0,
               "credit_id": "5833adfcc3a368339d004722",
               "name": "Siriaque",
               "profile_path": null,
               "id": 1712379,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Chief Gagool (as Sekaryongo of the Watussi Tribe)",
               "gender": 0,
               "credit_id": "5833ae0e925141272d004252",
               "name": "Sekaryongo",
               "profile_path": null,
               "id": 1712380,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "King Twala (as Baziga of the Watussi Tribe)",
               "gender": 0,
               "credit_id": "5833ae22c3a3683391003cf1",
               "name": "Baziga",
               "profile_path": null,
               "id": 1712381,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Austin - Safari Client (uncredited)",
               "gender": 2,
               "credit_id": "5833ae40c3a36833950045b0",
               "name": "John Banner",
               "profile_path": "/obSl3NYEYu1vc7ysce1ApqGe4M3.jpg",
               "id": 50764,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f5749",
               "name": "Compton Bennett",
               "profile_path": null,
               "id": 142297,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4644c3a36847f80f574f",
               "name": "Andrew Marton",
               "profile_path": "/nY91bRdDR6MfgUhEst0tzHEevfG.jpg",
               "id": 57142,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4644c3a36847f80f5761",
               "name": "Helen Deutsch",
               "profile_path": null,
               "id": 31068,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f5767",
               "name": "H. Rider Haggard",
               "profile_path": null,
               "id": 59805,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5996582ac3a3685abb000ea6",
               "name": "Robert Surtees",
               "profile_path": "/6CuhH7m0KvjbR088xyaJurddfZH.jpg",
               "id": 10005,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.410473,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43388,
      "vote_count": 28,
      "budget": 0,
      "overview": "Adventurer Allan Quartermain leads an expedition into uncharted African territory in an attempt to locate an explorer who went missing during his search for the fabled diamond mines of King Solomon.",
      "similar": [
         9732,
         1372,
         10527,
         11430,
         411,
         2454,
         8698,
         9273,
         10329,
         258489,
         630,
         284054,
         8587,
         873,
         1523,
         953,
         339530,
         606,
         14211,
         313943
      ],
      "original_title": "King Solomon's Mines",
      "runtime": 103,
      "poster_path": "/9RfCOBEzH82Kc6bbeXS5Ktu6oGP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1950-11-09",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Allan Quatermain (1950 series)",
         "id": 135508,
         "poster_path": null
      },
      "tagline": "Lovers trapped in animal stampede !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Compton Bennett",
         "Andrew Marton"
      ],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Helen Deutsch",
         "H. Rider Haggard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042646/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjc3MTAxMDcyOV5BMl5BanBnXkFtZTgwNjk2NjQzMTE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Deborah Kerr, Stewart Granger, Richard Carlson | See full cast and crew »"],
      "reviews": [
         "Aaron Copland believed great art goes hand in hand with simplicity. This movie is simple and great. I was browsing on the internet when I discovered some reviews of the R-1 DVD which heavily criticize the movie (and not just the DVD). I gave a quick look at IMDb to discover that, quite amazingly to me, the movie has only a 6.8 rating, that it has only been rated by less than a thousand viewers and that many viewer apparently found it boring. Let me just emphasize what should be obvious: this version of 'King Solomon's Mines' is not an action movie. It is probably best described as an invitation to Africa, combined with a reflexion on various aspects of what it means to be human. It many respects, it foreshadows and complements Clint Eastwood's 'White Hunter, Black Heart'. Let me mention just one striking 'detail': what's going on on screen is SO fascinating that no music has been added to the various sounds emanating from the country or from the music instruments of the African people themselves. This was a daring move, especially at the time, but it enriched the movie enormously. I will end this quick review with a piece of advice: Your mind should be as free as possible from everyday's life various troubles if you want to enjoy this movie. Pick up a night when you are already rather relaxed, and immerse yourself gently into the atmosphere created by the filmmakers. You won't regret it.",
         "There are many reasons why people like classic movies, but often those reasons are quite sentimental in their nature... Perhaps the reason for its enduring appeal is that it intends nostalgic trip to the past, where such films spawned juvenile imagination with breathtaking locations, exotic hidden societies, and characters with strange powers... Like all trips into the African wild, \"King Solomon's Mines\" proceeds through all kinds of land-forests, swamps, desert sands, lush meadows and rugged mountains... The film is filled with exciting scenes, and some rather effective looks at human motivations in the face of impossible odds... The color photography of Robert Surtees, greatly increases the visual impact of the outdoor scenes and almost overpowers the plot drama at times... Surtees' landscapes are gorgeous\u0097vista after vista of jungles, dunes, high peaks, river rapids and waterfalls... Stewart Granger was talented enough in playing the dashing romantic leading man... He created a human hero who is the ideal concept of the white hunter\u0097suave, tough, courageous, and strongly British... Deborah Kerr, the 'lady with the flaming hair,' had a charming weakness that was strong and feminine at the same time... This lost-civilization adventure continues to be a favorite among those who love a thrilling tale... \"King Solomon's Mines\" is a well-cast version filled with qualities close to the human heart: thrilling, adventurous, and amusing...",
         "I *LOVED* the Book \"King Solomon's Mines\" by H. Rider Haggard, and thought I should see the movie. I was warned to stay away from the 1985 remake, so I went with this one. This is a very good movie, especially for 1950, although characters and parts of the book were either left out or switched around. Stewart Granger is good as the hunter Allan Quatermain, and Deborah Kerr, although her character has nothing to do with the book what-so-ever, played her part well as Elizabeth Curtis. I was surprised to find out this film was shot entirely on location in Africa. It also has some great nature shots. This movie is hard to find or see on TV, so spring for the chance to see it if you get one! Even if you're not an adventure fan, this is still a good one. (It was nominated for best picture.) 4 out of 4 stars for \"King Solomon's Mines!\" But, don't stop there--READ THE BOOK!!!!!",
         "I've always maintained that this version of King Solomon's Mines along with The African Queen changed forever the face of Africa for the American audience. Our ideas of Africa were mainly developed by the Africa we saw created on studio back-lots for 20 years. MGM had tried before to show a realistic Africa in Trader Horn, but the cost was prohibitive and the film never recouped the expense of making it, especially during the Depression. Audiences after World War II wanted a little more realism in their cinema. Fantasy they got from that machine they starting staring into in 1947 in their living rooms. They also selected an excellent book to film. H. Rider Haggard had spent some years in the British Colonial Service in Africa. He was a pretty good observer of what was around him, even though his writing is tinged with the white man's burden attitude so common in the 19th Century. The film is not a faithful adaption of Haggard's work, but it's pretty close to it. Deborah Kerr is a woman looking to hire Stewart Granger who's the best reputed guide in Africa. She's looking for her husband, not sure if he's dead or alive. Granger agrees to take her on safari along with one of her husband's friends played by Richard Carlson. This allows for a certain amount of sexual tension between Granger and Kerr and in fact the two of them had an extra marital affair. Carlson's part is essentially colorless. I think he's along mainly to provide a sounding board for Kerr and her changing attitudes about Africa and Granger. The jungle photography is fabulous, the film is worth it for that alone. Granger and Kerr create some good characterizations and the native Africans are good in their roles. King Solomon's mines had such an impact that even the later Tarzan films had a more realistic look about them. An absolutely must see item.",
         "When this production was mounted for Stewart Granger, with Deborah Kerr and Richard Carlson as his co-stars, no one could have imagined how imitated, influential and important the film would become. It has an epic quality about it that is earned by African on-site locales, fine cinematography and direction of the film, and the discovery-aspect of the narrative as the participants learn along about a fascinating continent and its people with the viewers. H. Rider Haggard's venerable novel find to b a curious mixture of Victorian angst, adventure, romance, mystery evoked by an expedition storyline. The fine acting by Stewart Granger as Alan Quartermain the white hunter, Deborah Kerr as a woman seeking her missing husband, Richard Carlson as her brother, and Hugo Haas as a back-sliding villain works exceptionally to increase the believability of the film. The simplest incident on this dangerous expedition--sitting down in the wrong place, turning over a leaf, wearing the wrong weight or textile of garment, cutting one's hair, hearing a sound, anything--can trigger a learning or a dangerous experience... This was a lavish MGM production, with participation by legendary artists and technicians such as Cedric Gibbons as art director, Edwin B. Willis as set decorator, Robert Surtees as cinematographer, Douglas Shearer in charge of sound and many others. But the real star of the film apart from the actors is Andrew Marton and Compton Bennett's realization of Helen Deutsch's interesting modernization of the original novel. Wjite hunter Alan Quartermain does not really care to live any longer; he has just seen one of his best \"boys\" die in a hunting accident, having been hired to please a bloodthirsty imperial's whim to kill wildlife; and Deborah Kerr comes along just then in need of a guide, trying to convince herself that she still cares about the cold husband who disappeared in search of a fabled treasure, the gold mines of King Solomon of Israel.. Obviously the two are ready to fall in love during the dangerous search for her lost mate, one that takes them into unknown country, among dangerous tribes, and into adventures that include helping a deposed seven-foot-tall monarch regain his throne by a rite of combat, incidentally saving their lives in the process. The most exciting sequence in the film is a grass fire that causes animals to stampede toward the expedition, who must taken shelter crouched low behind a makeshift low barrier; it has been imitated, never duplicated, and was later used in several other films. The film is occasionally leisurely, never dull; its makers play with time very intelligently. For once, the viewer gets the sense in a film of an arduous trek, of time passing, time for changes to happen and motivations for the same. The actors are grand, especially the mature intelligent leads; all-in-all, this simple storyline in the right hands was turned into what is all-but-universally acknowledge to be a classic adventure-romance.",
         "The film follows an excellent hunter (Granger) who is payed to go on a safari to find the lost husband of Deborah Kerr and Richard Carlson. He reluctantly agrees. Along the way they run into different perils. Including many tribes that want the group dead. The film is very exciting. And you feel for the characters when they come into contact with danger. I wish more action films could make you do that. The performances are the reason behind this. It's too bad that the actors and actresses in the film weren't nominated for Oscars. I doubt they deserved to win, but they deserved to be up. The script is also very good. It strays away from the book just a little bit. But I have no problem with that because the film, by itself, is very good. The cinematography and editing are flawless. And they rightly won Oscars. The film was also nominated for Best Picture. It's one of the better adventure films.",
         "The wonderful book by H. Rider Haggard \"King Salomon's Mines\" was beautifully adapted for the screen by Helen Deutsch. The film entirely shot in Africa has a lot going for it in Robert Surtees excellent cinematography. This is a film that is good for viewing by all ages, but young minds will probably will find it more to their taste because of the long trek the three principals take into the unknown. This film boasts two directors, Compton Bennett and Andrew Marton! The film is set in Africa. At the beginning of the film we watch Allan Quattermain who is guiding a group in a safari and a herd of elephants come near and one is killed. We watch in horror as the others rally around the dead animal in an almost human display of emotions. Quartermain is contacted by Elizabeth Curtis, a woman that wants to locate her husband who has come to the region in search of the legendary diamond mines of King Solomon's. He is reluctant, but since she meets his price, the excursion is organized. What Mrs. Curtis, or Quartermain, or even the third member of the mission, Jack Goode, don't realize at the outset of the trip is what they are in for! The trek turns into one of the most extraordinary adventures ever filmed. Some of the scenes involving wild animals are incredible. In fact, some of the things this party has to deal with are amazing. Especially impressive is the stampede sequence when one watch in horror how all these wild animals are running amok. Stewart Granger is Quartermain, the jaded Englishman living in that remote spot. He loves it there and would never go back to his country. Mr. Granger was perfect for this type of film in which he clearly excelled. Deborah Kerr plays the English lady in search for her husband. She sticks out like a sore thumb, but in the end, she proves to have a strength we didn't give her credit for. Ms. Kerr was always a good in whatever she undertook. Richard Carlson makes a good contribution to the film. The different natives shown in their own habitat add veracity to the movie. The tall Watusi tribe is the most exotic one we have seen in any films of this type.",
         "I fell in love with this movie when I was 5 years old. Unlike some boyhood favorites, which fade and weaken with age, this one looks as good now as it did back in 1950. Glorious scenery and glamorous co-stars: Stewart Granger and Deborah Kerr.",
         "This colorful outdoor story is great entertainment and has excellent work by Stewart Granger and Deborah Kerr. The spare plot involves a search for a woman's missing husband which leads eventually to a diamond mine in a distant province. The safari braves assorted dangers along the way from wild animals and savage tribesmen, and the film captures the beautiful vistas of the African plains and exotic animals in their natural habitat. Richard Carlson is along as a member of the safari, as are two natives who provide fine characterizations as the plot unfolds. This picture doesn't have a music score but does have instead the drums and chants of the tribesmen that provide an authentic accompaniment to the film. Robert Surtees received an Academy Award for his excellent cinematography for this movie.",
         "There are three classic movies about early colonial Africa. 'Trader Horn'; starring Harry Cary; 'King Solomons Mines'; Granger - Kerr and 'Out of Africa'; Redford - Streyp. In the first two, old Africa was available, in the last it was not. The Technicolour and acting of the 'Mines' was fantastic!, although many don't realize that the scenes of the cavernous mines were filmed in Carlsbad Nat'l. Park and the trek into the great desert before the Kalahari region was actually White Sands New Mexico. The romantic wonderment of Granger washing Kerr's hair at Murchison Falls was copied quite nicely by Redford and Streyp. The green hills of the Watusi highlands were copied nicely in Karen Blixens Nygong Hills estate. It will be some time before another film comes out to match the beauty and majesty of colonial Africa like the 'Mines' and 'Out of Africa'. Until then, these two stand alone."
      ],
      "genres": [
         "Adventure",
         "Romance",
         "Action"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Guide Allan Quatermain helps a young lady (Beth) find her lost husband somewhere in Africa. It's a spectacular adventure story with romance, because while they fight with wild animals and cannibals, they fall in love. Will they find the lost husband and finish the nice connection?",
         "Allan Quartermain leads an expedition into uncharted African territory in an effort to locate Elizabeth Curtis' husband Henry, who was searching for King Solomon's legendary treasure. Along the way they encounter a variety of wild animals including snakes, a leopard and a rhino. Quartermain isn't keen on having a woman on the expedition and he and Elizabeth quarrel regularly. Elizabeth and her husband were not very fond of one another and her expedition is driven by her own guilt. She and Quatermain fall in love but survival becomes their goal when they meet dangerous tribesmen.",
         "Adventurer Allan Quartermain leads an expedition into uncharted African territory in an attempt to locate an explorer who went missing during his search for the fabled diamond mines of King Solomon."
      ],
      "budget": 0
   },
   "movielensId": 25962,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-11-09",
      "dvdReleaseDate": "2005-01-11",
      "directors": [
         "Compton Bennett",
         "Andrew Marton"
      ],
      "runtime": 103,
      "movieId": 25962,
      "title": "King Solomon's Mines",
      "mpaa": "",
      "actors": [
         "Stewart Granger",
         "Deborah Kerr",
         "Richard Carlson",
         "Hugo Haas",
         "Lowell Gilmore",
         "Kimursi",
         "Siriaque",
         "Sekaryongo",
         "Baziga",
         "John Banner"
      ],
      "imdbMovieId": "0042646",
      "originalTitle": "King Solomon's Mines",
      "genres": [
         "Action",
         "Adventure",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "MaPF0Ul5WzQ",
         "XmZhBTVd6Nw"
      ],
      "plotSummary": "Adventurer Allan Quartermain leads an expedition into uncharted African territory in an attempt to locate an explorer who went missing during his search for the fabled diamond mines of King Solomon.",
      "tmdbMovieId": 43388,
      "avgRating": 3.33333,
      "releaseYear": "1950",
      "numRatings": 105,
      "posterPath": "/9RfCOBEzH82Kc6bbeXS5Ktu6oGP.jpg"
   }
}