{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0056389",
      "video": false,
      "title": "The Four Days of Naples",
      "recommendations": [],
      "backdrop_path": "/pv5Qsw4LILk2nO7eyLb1qt6JNoL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Stimolo",
               "gender": 2,
               "credit_id": "52fe46fac3a368484e0ae629",
               "name": "Gian Maria Volonté",
               "profile_path": "/j4cbFhoC7A7ONeM9oln1hJ0U74A.jpg",
               "id": 14276,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Pitrella",
               "gender": 0,
               "credit_id": "52fe46fac3a368484e0ae62d",
               "name": "Aldo Giuffrè",
               "profile_path": "/aBp4PnfO43mTgCGg0pjmfhHrfdZ.jpg",
               "id": 5813,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Livornese",
               "gender": 2,
               "credit_id": "52fe46fac3a368484e0ae631",
               "name": "Jean Sorel",
               "profile_path": "/3twOMDVpgK6psPN7n3mwpwAvzF9.jpg",
               "id": 9762,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "52fe46fac3a368484e0ae635",
               "name": "Filippo De Luigi",
               "profile_path": null,
               "id": 131952,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe46fac3a368484e0ae639",
               "name": "Lea Massari",
               "profile_path": "/gp9dPDL6w9VemMzdVi3al9RxnIg.jpg",
               "id": 20882,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 1,
               "credit_id": "52fe46fac3a368484e0ae63d",
               "name": "Pupella Maggio",
               "profile_path": "/4UzmBdKw8e2x4iaCkDjZTZwsPsP.jpg",
               "id": 25780,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46fac3a368484e0ae601",
               "name": "Nanni Loy",
               "profile_path": "/fdWhPtyWUsJUZSOzasOvWWe70dR.jpg",
               "id": 227311,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fac3a368484e0ae607",
               "name": "Nanni Loy",
               "profile_path": "/fdWhPtyWUsJUZSOzasOvWWe70dR.jpg",
               "id": 227311,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46fac3a368484e0ae60d",
               "name": "Carlo Bernari",
               "profile_path": null,
               "id": 240293,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46fac3a368484e0ae613",
               "name": "Massimo Franciosa",
               "profile_path": null,
               "id": 31604,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46fac3a368484e0ae619",
               "name": "Vasco Pratolini",
               "profile_path": null,
               "id": 240294,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fac3a368484e0ae61f",
               "name": "Carlo Rustichelli",
               "profile_path": "/3LOPAqzUlWbyjzxYXMlJpJDrrrE.jpg",
               "id": 29500,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46fac3a368484e0ae625",
               "name": "Marcello Gatti",
               "profile_path": null,
               "id": 25822,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a9e9cd60e0a2671fb014149",
               "name": "Goffredo Lombardo",
               "profile_path": null,
               "id": 15133,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a9e9cdd9251411021011372",
               "name": "Ruggero Mastroianni",
               "profile_path": null,
               "id": 32053,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a9e9ce5c3a36842900124df",
               "name": "Gianni Polidori",
               "profile_path": null,
               "id": 1174725,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a9e9d020e0a2671f9012c15",
               "name": "Giuseppe Bordogni",
               "profile_path": null,
               "id": 1569879,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.022038,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 65048,
      "vote_count": 7,
      "budget": 800000,
      "overview": "",
      "similar": [],
      "original_title": "Le quattro giornate di Napoli",
      "runtime": 124,
      "poster_path": "/6kmg9KUbVaRQrT1IsamD8pTIEIs.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Titanus",
            "id": 641,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Metro",
            "id": 75250,
            "origin_country": ""
         }
      ],
      "release_date": "1962-11-16",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Nanni Loy"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Carlo Bernari",
         "Pasquale Festa Campanile"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0056389/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjg0MTQwMjU0OV5BMl5BanBnXkFtZTgwMzgyNjI1MTE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Regina Bianchi, Aldo Giuffrè, Lea Massari | See full cast and crew »"],
      "reviews": [
         "This is an engrossing 124 minute film that seems to fly by. It never stops. The documentary-like approach to the tale of the Neopolitan rebellion against the occupying Nazi forces in the last days of WW II is embellished with many emotionally-laden vignettes that bring home the hellish effects of war on every day life. Nanni Loy's direction is extraordinary, from the small family scenes to the many many crowd scenes -it must have been a gargantuan task, expertly handled. The cinematography is superb and the editing keeps us both interested and holding on to the sides of our seats in this non-stop roller coaster ride. See it.",
         "This film was brought to my attention by a friend who suggested that, since I enjoyed Roberto Rosselini's Open City, I would enjoy this film, which he considered to be even better than Rosselini's. I was impressed, to say the least, and inclined to agree. The story seemed infinitely more real and affecting. Small stories of individual lives and relationships splintered apart by the actions of Germany in Naples after the Allies have declared victory in Europe in WWII isn't a subject many people will jump at the chance to see, but they should think again. We may never have the experience of being under occupation here in America, but that doesn't mean we can't appreciate and feel the bravery of a city that fights back against the tyranny of the weary German army. And if you have an aversion to war films, subtitled ones in particular, don't worry; the performances from the actors involved are strong enough to feed the emotions onto the screen without need of a translator. This is a gem not many people know about. It's a shame. This is a film that needs a revolution in the minds of cineastes everywhere.",
         "A cast of virtual then-unknowns re-enacts the German takeover of Naples following the Italian Army's surrender to the Allies, and the peasant uprising which ensued. \"The Four Days of Naples\" was released in 1962 and is shown occasionally on Turner Classic Movies, in Italian with English subtitles. What's most interesting about this film is that director Loy follows many characters and subplots, and often fails to resolve them because they become lost in the chaos of the house-to-house battle within the city. Frank Wolff (\"Desert Assault\") is Salvatore, who loves Maria (Lea Massari) even though she has married a rich man. The two wind up fighting along side one another; Gian Maria Volonte is the Captain who helps organize a partisan resistance; Aldo Giuffre (The Good, the Bad and the Ugly) is one member of an Italian artillery unit which becomes embroiled in the siege; and Enzo Turco (\"Anzio\") is a Black-shirt who is taken prisoner despite his Fascist convictions. Every member of the ensemble cast is passionate and utterly convincing. Many were virtually unknown at the time of production, and became big stars in Italy within the next few years. Director Loy shoots his film with a documentary style. Some shots are well-crafted, though, and give the audience a new perspective on the action. One long pan from a rooftop from which partisans are firing on the Germans shows how the men move from street to street without any cutting at all. The black-and-white cinematography is utterly fantastic. Close-ups of faces deliver all of the drama that dialog simply cannot convey. The film brings the viewer inside what occupation and resistance do the civilian population of a city. At one point, the Germans drive the citizens out of one quarter so that they can occupy it, forcing people to move in with strangers on the other side of the city. Later, they attempt to conscript Italian men into their labor force, which is what sparks the uprising. The camera follows us into individual homes and family situations, which are ripped apart by the affects of war. He then takes us to massive crowds as they riot in the streets. The scope of battle is excellently captured, as are the cramped alleys and rooms from which the citizens must fight. There a number of standout vignettes: the Neapolitans throwing furniture from their windows atop the heads of Nazi soldiers in a narrow alleyway; one sequence in which a number of teens escape a reform school to join the fight; a prisoner-negotiation scene in which things go unexpectedly and several Italian civilians are caught in a crossfire; the scene in which the Italian men are taken in trucks to be conscripted, only to have their wives overwhelm the German guards. All of these scenes convey a spirit of freedom, aided by Carlo Rustichelli's rousing score. \"The Four Days of Naples\" is a well-crafted drama, intended to be taken seriously, unlike many Italian war films which would follow a few years later. This is an inspiring drama of courage and determination, definitely a must-see for any fan of war films or the Italian cinema.",
         "I just saw this 1962 film on Turner Classic Movies and promptly tracked down and ordered a VHS of it. A very realistic film with many characters whose stories start and in most cases are left unresolved in the midst of the fighting. The screenplay was original for the screen, not based on any book, and received a 1963 Oscar nomination in the original screenplay category. There is a 1979 book with the same title, also telling of the uprising, that is NOT the source of this film. According to summaries, the book says that the Naples \"street boys\" instigated and led the rebellion. Not in this film, however, which focuses on adults and has many wrenching scenes of mothers and children, husbands and wives torn apart. The ensemble cast is passionate and convincing. Unlike the other commenter who said the film is an argument against war, this is really an argument for standing up and fighting against those who would treat you as slaves (which the NAZIs did and which led to the uprising). Great film!",
         "This documentary-style drama shows us the determination of a civilian population to end wartime conscription by a former ally. The Nazi army tries by terror to force the Italian people to join them as they struggle on against the advance of the Allied forces in WWII Italy. Citizens decide against fighting the war any longer, and rally themselves to drive out the German soldiers from their city and their lives in only four days. I watched this film in basic training camp in 1963. I did not know at the time if I was being ordered to Southeast Asia to participate in the war there or not. I had had a vision on the firing range that an active combat role in Viet Nam would be more terrible than I could ultimately live with in later years. Fortunately, I was sent to the staging area on Okinawa, and not to Viet Nam. I saw the film again when I reached Okinawa, and became aware of the war a thousand miles away. The film crystalized for me that mankind could choose not to fight wars to settle disputes between countries, and that passionate citizens could resist the most disciplined of armies. The Neopolitan people's example to me from twenty years before, as I stood at the brink of the Southeast Asian war, spoke deeply to me of what humanity must strive to achieve through the advancement of its behavior and character. I long to see the film again, or to read the source book, as world events swirl around us, echoing themes in the Four Days of Naples.",
         "I saw this film when it first came out and it gripped me completely. I was quite young and not \"into\" foreign films, but this film caught me up. It showed a resistance that was unique -- not planned, not secret, but almost spontaneous. It mixes the buffoonery of some of the characters, the cowardice of a few and the bravery of the people of Naples. Some moments bring tears, others laughter. How the people come together to fight the Nazis who were still brutally exerting their power even as the allied forces marched north in Italy is a powerful statement of the will of ordinary Italian citizens. For years I've tried to buy it, Le Quattro Giornate di Napoli, with no success. Then this year,TCM showed a very clean copy of it. But still I can't find a place to buy it. It is so worth having -- If anyone knows where I can buy it, I would be grateful.",
         "\"The Four Days of Naples\" is an interesting film in that although it was made in 1962, it looks like it was made just after the war. That's because many buildings show bomb damage. Could they have sat that way since the war or did they blow up a few buildings to add to the realism? I don't know, but the film sure got the look right. The film is set in 1943. The Allies have invaded Sicily and are on the move northward. In nearby Naples, word arrives that the Italian army has surrendered--and the residents are thrilled as it looks like the war is over for them. However, the Germans go immediately from allies to enslavers and they begin committing atrocities on the Italians. Soon, the Neopolitans realize that unless they fight back, they will die--thus begins four days of bloody fighting between mostly civilians and the German army throughout the streets of the town. Because this was a battle to save he city, it's made up of lots and lots of separate vignettes all strung together. Some are very compelling--such as the boys of the reform school leaving to join in the fight--even though many look to be only about 10 or even younger. Others are more bizarre as there are TONS of women running about screaming and getting in the way of the fighting. About the only thing that did not ring true in these stories was when they showed a couple people pulling the pins out of grenades with their teeth---something that only occurs in movies and never in real life (you'd lose your teeth doing this). This film works very well. Of course, much of this is because it was well-directed, but I also loved the neo-realistic style (though most films in this style were made a decade or more earlier)--with non-actors playing the parts of the citizens. While the film could have been like an American epic (such as \"The Longest Day\")--star-studded throughout, instead the real folks made it all come alive--like we are really watching the battles unfold. Realism--realistic looking deaths, heroism, occasional cowardice--realism from start to finish. By the way, although it's a very good film, I would really love to see it re-captioned. That's because like many films captioned many years ago, the people doing this didn't feel a need to caption everything the people said or caption it word for word. I dislike this intensely--as would most film purists. I've seen much worse captioning--but also much, much better. By the way, you can't blame the film makers, but the tanks used in the film were modern tanks like American-built Walker Bulldogs--not vintage German tanks. There just aren't that many Panzer tanks left and they certainly weren't going to risk the few possibly still available making a film.",
         "Masterpieces are rare, but Italy produced two in 1963. 8 1/2 belongs on any serious list of great films. So does Nanni Loy's Four Days of Naples. It is flawless. Both were forwarded for awards; 8 1/2 won most; both deserved every honor for which they were nominated. Loy's passion is obvious throughout. His is an unsentimental look at one city's famous guerrilla resistance against the Nazis. Although it was filmed on location in Naples (with some footage shot in Salerno) more than 15 years after the war ended, the battle-scars are still evident on this glorious, impoverished city's walls. The movie builds power in many ways-- every way, really, including using Neapolitans rather than professional actors for many roles-- but most significantly I think in the camera-work and editing, which together create a rhythm alternating between intimacy with individuals, and wider takes on armed confrontations and full battle scenes. One unforgettable scene combines them, when young men carry the bodies of slain fighters through the streets, inciting their fellow citizens to join the epic battle to liberate the city from Nazi occupation. It is rarely shown; as of this writing it's not on DVD. All I can say is, watch for it.",
         "Can you find the main character? I can't. Like many of you, I love movies. In every film that I've seen; sound and silent, short and feature length, narrative and documentary, a main character emerges. Sometimes, like in Fail-Safe and Dr. Strangelove, more than one emerges as part of a shifting focus, usually against the backdrop of a grand narrative. I've never seen a film, with the possible exception of very early cinema and raw news footage, where there is not even a pretense at a central character. Instead, the city of Naples itself is the main character. With no disrespect meant to the men and women of Naples who faced the German Army, it's as though the city itself becomes a dog shaking off its deadly fleas. Mall Megaplexes are jammed with the same few films, with different casts and titles perhaps, but stories told with a very limited scope. I encourage you to sample what great cinema looks like when told from a completely unique viewpoint.",
         "This good film tell a historical fact: the resistance of the people common of Naples against the Nazi, that they occupied the city in 1943, after the fall of Mussolini. Using only light weapons left by the Italian soldiers, they look for hopelessly to maintain the freedom, once the American soldiers are approximating if. For four days, the heroic resistance of popular gets to maintain the military situation in an impasse... Film of beautiful and touching images, as the father taking the dead combatant son in the arms to be veiled home; the people playing domestic objects of the windows on the Germans or the boys of the reformatory, rebelling and fleeing for they unite to the resistance. Unforgettable!!"
      ],
      "genres": [
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": ["Titanus"],
      "summaries": ["The film shows the history of the Neapolitan popular revolt against the invading Germans, during the second world war. During the four days in Naples the revolt turns over in just few hours. Neapolitans slinged on rifles and guns, and they armed themselves with stones, house-objects, gasoline-bottles and everything, anonymous and silent. Gennarino Capuozzo, a ten year old child killed on a barricade while he was fighting against the invasors, is remembered by people as a hero."],
      "budget": 0
   },
   "movielensId": 26088,
   "movielens": {
      "languages": [""],
      "releaseDate": "1962-01-01",
      "dvdReleaseDate": null,
      "directors": ["Nanni Loy"],
      "runtime": 124,
      "movieId": 26088,
      "title": "The Four Days of Naples",
      "mpaa": null,
      "actors": [
         "Gian Maria Volonté",
         "Aldo Giuffrè",
         "Jean Sorel",
         "Filippo De Luigi",
         "Lea Massari",
         "Pupella Maggio"
      ],
      "imdbMovieId": "0056389",
      "originalTitle": "Le quattro giornate di Napoli",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 65048,
      "avgRating": 3.9,
      "releaseYear": "1962",
      "numRatings": 5,
      "posterPath": "/6kmg9KUbVaRQrT1IsamD8pTIEIs.jpg"
   }
}