{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "beatnicks",
            "id": 180099
         }
      ],
      "imdb_id": "tt0057181",
      "video": false,
      "title": "The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies!!?",
      "recommendations": [
         31119,
         31282,
         31258,
         109122,
         31276,
         31393,
         38269,
         89751,
         67430,
         42998,
         31244,
         87874,
         62855,
         84633,
         141600,
         22749,
         31118,
         206630,
         35749,
         260536
      ],
      "backdrop_path": "/eKTnJdMUOaFyWFoTPSlZ74KrtH7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Jerry",
               "gender": 2,
               "credit_id": "52fe44799251416c91011f89",
               "name": "Ray Dennis Steckler",
               "profile_path": "/aOaeEEfwA0eByjefQQCqwIEbuyk.jpg",
               "id": 138076,
               "order": 0
            },
            {
               "cast_id": 21,
               "character": "Marge Neilson",
               "gender": 1,
               "credit_id": "58c5dd649251411d30006f56",
               "name": "Carolyn Brandt",
               "profile_path": "/5hgmxmm61SPkvT3hOxBkWjK3FC0.jpg",
               "id": 1070234,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Madame Estrella",
               "gender": 0,
               "credit_id": "52fe44799251416c91011f91",
               "name": "Brett O'Hara",
               "profile_path": null,
               "id": 931675,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Harold",
               "gender": 0,
               "credit_id": "52fe44799251416c91011f95",
               "name": "Atlas King",
               "profile_path": null,
               "id": 931676,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Angela",
               "gender": 0,
               "credit_id": "52fe44799251416c91011f99",
               "name": "Sharon Walsh",
               "profile_path": null,
               "id": 931677,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Madison",
               "gender": 0,
               "credit_id": "52fe44799251416c91011f9d",
               "name": "Pat Kirkwood",
               "profile_path": null,
               "id": 931678,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Carmelita",
               "gender": 0,
               "credit_id": "52fe44799251416c91011fa1",
               "name": "Erina Enyo",
               "profile_path": null,
               "id": 931679,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Ortega",
               "gender": 2,
               "credit_id": "52fe44799251416c91011fa5",
               "name": "Don Russell",
               "profile_path": null,
               "id": 102924,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Stella",
               "gender": 0,
               "credit_id": "52fe44799251416c91011fa9",
               "name": "Toni Camel",
               "profile_path": null,
               "id": 931680,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Hobo",
               "gender": 0,
               "credit_id": "58e23af1925141283500bdb1",
               "name": "Titus Moede",
               "profile_path": null,
               "id": 44766,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Dancing Girl",
               "gender": 0,
               "credit_id": "58f5b4f5c3a3680e21009210",
               "name": "Denise Lynn",
               "profile_path": null,
               "id": 1798438,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Man at Carnival (uncredited)",
               "gender": 2,
               "credit_id": "58c5dd599251411d15007152",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "2nd Barker (uncredited)",
               "gender": 0,
               "credit_id": "58f5b509c3a3680e2100921b",
               "name": "Robert Silliphant",
               "profile_path": null,
               "id": 931669,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44799251416c91011f67",
               "name": "Ray Dennis Steckler",
               "profile_path": "/aOaeEEfwA0eByjefQQCqwIEbuyk.jpg",
               "id": 138076,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44799251416c91011f6d",
               "name": "Gene Pollock",
               "profile_path": null,
               "id": 236385,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44799251416c91011f73",
               "name": "Robert Silliphant",
               "profile_path": null,
               "id": 931669,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44799251416c91011f79",
               "name": "E.M. Kevke",
               "profile_path": null,
               "id": 931671,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44799251416c91011f7f",
               "name": "George J. Morgan",
               "profile_path": null,
               "id": 931673,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44799251416c91011f85",
               "name": "Ray Dennis Steckler",
               "profile_path": "/aOaeEEfwA0eByjefQQCqwIEbuyk.jpg",
               "id": 138076,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55b13db39251411e0b00e8c0",
               "name": "Libby Quinn",
               "profile_path": null,
               "id": 1489819,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "55b13dbfc3a368246c008cb7",
               "name": "Joseph V. Mascelli",
               "profile_path": null,
               "id": 117702,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55b13dcc9251417364000a38",
               "name": "Don Schneider",
               "profile_path": null,
               "id": 238298,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55b13df39251411e0600ea4b",
               "name": "Mike Harrington",
               "profile_path": null,
               "id": 1489820,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.105693,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31383,
      "vote_count": 20,
      "budget": 0,
      "overview": "Beatnick Jerry takes his girl, Angie to the carnival. Angie wants to go see the gypsy fortune teller, Jerry does not but relents. After visiting the fortune teller and hearing bad news, Jerry goes alone to see Carmelita, the dancer (the fortune teller's sister). He is invited backstage and is mesmerized into becoming a psychotic killer. Angie, and Jerry's best friend Harold realize something is amiss when Jerry tries to kill Angie.",
      "similar": [
         10925,
         13648,
         485415,
         923,
         400136,
         294254,
         24920,
         1562,
         72190,
         19908,
         126889,
         170,
         82654,
         766,
         16288,
         215830,
         8408,
         336843,
         24935,
         16871
      ],
      "original_title": "The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies!!?",
      "runtime": 82,
      "poster_path": "/uLbEXZphWJbkUbPuzpSKoAb7lRO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fairway International Pictures",
            "id": 12354,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Morgan-Steckler Productions",
            "id": 8466,
            "origin_country": ""
         }
      ],
      "release_date": "1964-02-10",
      "vote_average": 2.4,
      "belongs_to_collection": null,
      "tagline": "She Keeps Monsters in Cages for Pets! He Preys on Wild Go-Go Girls!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ray Dennis Steckler"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Gene Pollock",
         "Robert Silliphant"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057181/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MjM4NDg3MV5BMl5BanBnXkFtZTcwMjM2NzAzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ray Dennis Steckler, Carolyn Brandt, Brett O'Hara | See full cast and crew »"],
      "reviews": [
         "I recommend this film for those of you who, like me, work out of the home and enjoy having warm, harmless, unimposing movies playing quietly in the background during the workday. Many critics have commented negatively about this movie's novel title, confusing plot (or lack thereof), queerly dated characters, unintelligible dialogue, garish color, inferior sound, etc. But in this connection, I can think of no other film that keeps on simultaneously garnering so much praise, while incurring an exactly proportionate censure, over precisely the same agreed \"shortcomings.\" For example, some viewers balk that the film's dance numbers are both irrelevant and amateurish, therefore doubly unendurable. Others, like myself, find them so deliciously preposterous and unaccountably charming in their dated foolishness as to be worthy of repeated viewings. And this dualism just may be \"Incredibly Weird. . .\"s real strong suit. There's so much I could say in defense of this poorly-made film from a nicer, nostalgic time, when even Hollywood's low-rent district seemed sunny and safe- but much of it has already been said in these reviews, and very well at that. Let me confine my recommendation to this: if you're shopping to buy or rent a notoriously \"bad\" film, don't choose a jaded, overblown, written-by-committee, painfully self-conscious finger-wagger made c.1994 at a cost of over 50 million, and which was panned as a 1/2-star flop by every critic and moviegoer, yet managed to not only recoup its investment but launched three big-name careers in the process. No, friend, go with a stinker such as this fetid little endeavor, made on a shoestring, enlisting the dubious cooperation of an uninspired carnival sideshow troupe, and which best of all bears the boisterous but distinctive thumb-print of an overly-ambitious director/lead actor/ out-of-his-depth galoot like Ray Dennis Steckler. I couldn't explain it properly here in the space allowed, but \"Incredibly Weird\" seems to unintentionally exude a charmingly flatulent air biscuit of Americana; and if a film must have warts, this one has the ones that are best had. \"Incredibly Weird . . .\" - a pleasingly inept offering from the days when a film could be bizarre without giving in completely to the perverse, and could gain an audience with no visible means of sustaining one but its overwrought title and its hopelessly inept charm.",
         "One of the most famous BAD movies ever made, mainly because of its legendary title, which is arguably the best thing about it. Look this is an awful movie, everybody knows that, but the question that should be asked is is it worth watching? And the answer is HELL YES. Ray Dennis Steckler lies somewhere between Ed Wood, Jr and Russ Meyer for me. Wood made laughably bad genre movies that have continued to fascinate because of their campy silliness. His movies are still tons of FUN all these years later. Russ Meyer was certainly not incompetent, but he created bizarre movies populated with strange, sex obsessed characters, who found themselves involved in twisted, often indescribable plots spouting absolutely insane dialogue. Steckler like both those directors creates his own unique world. He is closer to Wood because of his sheer ineptness I suppose, but unlike Wood's movies his are tough going at times. Truly (unintentionally) hilarious sequences are repeatedly interspersed with some of the dullest and most pointless scenes you'll ever see. That makes his movies totally unlike anyone else's before or since. 'Incredibly Strange Creatures...' is arguably his most consistent effort, and even this one is dragged down by the endless musical numbers. Even so it is a movie that HAS to be watched at least once by any trash fiend or cult movie enthusiast. You really have to see it to believe it!",
         "This is a fascinating artifact from another era of pop culture; From the convoluted title (complete with \"!!?\" at the end) to the open mike \"Amateur Night\" numbers to the horribly muddled sound recording to the goofy throwaway dialog to the discombobulated ending to the paper-thin plot, this one has to be seen to be believed. You know the old saw about a movie being 'like a train wreck - you can't look away'?? Well, imagine if a school bus ran into the train wreck and a 727 crashed on top of it and then a herd of lemmings swarmed over the smoking remains on their way to go over a cliff. And then the Jolly Green Giant picked up everything and threw it over the mountain range and into the next state. The movie piles one jarring, disorienting choice after another in rapid succession. First 'Jerry' rubs boogers out of his eyes on camera, then 'Harold' is jamming our ears with his Lithuanian/Chicano accent, and then 'Angela' throws off the composition of an entire scene with her Mile High Beehive of Hair, following which a bunch of 'dancers' perform bad choreography with all the precision of a dance recital for kindergarten girls, and then some dick-weed who can't carry a tune in a bucket sings the most insipid love song in the history of music while strumming a guitar that sounds like a ukulele. Then Elizabeth Taylor spins a pinwheel to make Jerry commit badly staged murder to cover up the fact that she threw acid in the face of a lumpy alcoholic, following which Jerry dreams that he got his face painted at a Renaissance festival and leaps about like a Thompson's Gazelle while a montage of women point and laugh at him. Then a mechanical wind-up monkey shrieks that we should \"GET YOUR TICKETS HERE!! GET YOUR TICKETS HERE!!!\" and a bunch of people who previously got acid thrown in their face and were drawn by the Rat Fink Hod Rod guy and have apparently been living on Angel Dust and Pop Tarts break loose and rampage through an Inuit/Swedish/African dance revue until the police come and shoot everyone, including Jerry who also had acid thrown in his face just before the titular 'zombies' got loose. Oh, and there's no moral, THE END. I'm making the movie sound more coherent than it really is. And yet, the whole mess is somehow entertaining and amusing, and I ended up being glad I saw it. If I were to meet Steckler (unlikely), I'd shake his hand and comment on how weird the movie was and ask him \"WHAT THE HELL WAS HE THINKING?\" when he made it. MST's riffs on the movie are inspired and their version is worth getting hold of. But the movie stand on its own as a lunatic pinball of weirdness, careening randomly off the walls of our expectations of pop culture. See it if you have a fondness for silly stuff. Otherwise, stay far, far away.",
         "MONSTERS COME REAL! CRASH OUT OF SCREEN! INVADE AUDIENCE! ABDUCT GIRLS FROM THEIR SEATS! Not 3-D. Don't Miss It! I saw this at the drive-in when I was just a little kid. The film was made in 1964, but I must have seen it around +-1970. Anyway, the newspaper advertised just what the tag-line for the film implied -- that Monsters would go around to each car and abduct people! For me, this was an irresistible enticement, and so I begged to be taken to see it, and finally won out. About midway thru the film, the Live Invasion began! ...well...the \"abduction\" consisted of drive-in employees walking around in regular street clothes, sporting cheap plastic dime-store masks (the kind with the elastic string that always breaks) of some indefinite \"monster\". They would stop in front of a car, murmur an uninspired \"boo\", then proceed to the next vehicle to repeat the sequence. Looking around, I noticed that like me, no movie-goers had been taken prisoner. *sigh* Having said that, the movie is a great deal of fun. Its cheesy and over-the-top, and that makes it a winner to me. People who complain that its a bad movie are the same as the folks who enjoy pointing out that pro wrestling is fake. They just don't get it. The movie stars one of my favorite actors, Ray Dennis Steckler (AKA \"Cash Flagg\". Imagine a cross between Nick Cage and Pee Wee Herman(!) His other cinematic delights include Wild Guitar, The Horny Vampire, Rat Pfink a Boo Boo, The Thrill Killers, and The Lemon Grove Kids Meet the Monsters. Watch them. Learn them.",
         "I admit I first saw this on MST3K, and in that venue it was almost brilliant - no skit on the original Saturday Nite Live ever topped it. The awful make-up, the comically inept sidekick (wild & crazy guys come to life!), the riotous night club dancers, the super-cheesy zombies...It's hard to believe this movie was so deliberately inept without having some other (admittedly pretty subtle) agenda of humor. And, as someone has pointed out, the cinematography is pretty damn good. Well, however it came about, it's still a very watchable movie. Hey, have you sat through Con Air or The Rock (both with a lead who looks a lot like Cash Flagg to me).",
         "Incredibly Strange, yes..... but is it alive? No, it's got some good points (\"hallucinogenic hypnovision\", which is detailed in a preface not seen in most U.S. video prints, turns out to involve ushers in monster masks, hardly the doctor's prescription for a happy trip) but overall dull and slack and looking exactly like five dollars. Still, it's a movie that shows Steckler's love for film, even if this somhow doesn't make up for LENGTHY semi-burlesque dance sequences and the absence of any real \"zombies.\" B-movie fans in the bay area have been treated over the last few years to Steckler's appearances at Will Viharo's \"Thrillville Revue\", and I'm happy to say that Steckler is a director who can sit in a theater and laugh at his movie with an audience (you just have to take my word for it that there are A LOT of directors who make bad films and take them VERY seriously... just listen to the director's commentary on the film \"the Bone Yard\" for an example). This is not his best effort (see \"The Thrill Killers\" for that), but it's pretty fun if you see it with popcorn and a bunch of drunk people. And heck, that's what movies are all about, isn't it?",
         "If there were only words in the English language to describe how luridly horrid this film really is.It features some of worst acting EVER,has reams of brain-numbing dialogue,and dance numbers so badly done they must have been choreographed by Satan himself.I would attempt to give you a plot outline,but I never could find anything that even RESEMBLED a plot line.If there was one,it was some sort of post psychotic,Tarintino/Hitchcock nightmare,but only in a horrible mind-devouring way.As if Kafka had written it after a four week acid trip/rotgut moonshine drunk.If that were it's only problem it would have been bad enough.But,the wost part is the absoluetly pathetic special effects/set design/costuming.All were absolutely lame to the max. If you love terribly disgustingly awful films, then this is one you have to see.Otherwise,avoid this film like a dose of the clap.This movie will make you wish YOU COULD stop living,and become blind,deaf,or anything that will allow you to never see anything resembling this film.Ydnar",
         "The only thing this low-budget piece of garbage has going for it is capturing the true white trash feel of the legendary Nu-Pike amusement zone in Long Beach, California during its decline. There are spectacular shots of the late, lamented Cyclone Racer roller coaster (built in 1930...razed in 1968) that are just too good to pass-up. The opening sequences in the park are worth it...a time machine back into the pre-lawsuit days of the unsanitized thrill-ride experience. During these scenes, the shoddiness of the movie's production values ring true bringing a welcome realism to the film that, alas, dissipates once the \"real\" action begins. At this point, the movie makes no sense whatsoever. See it for the Cyclone Racer...the only real \"star\" in the picture (even though it's just a cameo role).",
         "I can only echo the observations on how poor every aspect of the movie is production-wise. However, if you're a fan of cult films like myself, you'll enjoy watching this. (And the soundtrack is pretty darn good,too.) Ray Dennis Steckler stars in his own movie under his pseudonym \"Cash Flagg\". The actors, lines, and scenes are forgettable. However, you will not soon forget the movie itself. I can bring myself to give this movie 8 stars for sheer historical/cult entertainment value. Check it out if you have time.",
         "\"The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies!!?\" is most certainly a one-of-a-kind experience. Madame Estrella(Brett O'Hara) doesn't like being ridiculed or questioned by detractors. When an old drunk turns down her sexual advances(!)she gets really angry and, trust me, you don't want to see her(..or hear her squeaky voice)when she's angry. If you make Madame Estrella mad, you not only get acid tossed in your face(..this turns your face into silly putty)but a prison behind her purple curtains is your brand new home. Almost always by her side is hideous hunchback, Ortega(Don Russell)who assists her in disposing bodies and grabbing innocents(..he even pops up in nightmares and hypnotic trances caused by Estrella). A customer(..a boozing club dancer who has a rather uninspired act with a male partner) desiring to know her future fate finds Estrella's \"xombie prison\"(..I spelled zombie with an x because of have no idea what these ugly fiends should be labeled)and is targeted for execution. She'll find a dope in \"I'll try anything once\"(..the world is my college)Jerry(Ray Dennis Steckler)who is entranced with popular stripper Carmelita(Erina Enyo). Carmelita, in league with Estrella, will trick him into coming backstage where he will be hypnotized into killing those who threaten to expose her prison. Estrella chose Jerry when he, pal Harold(Atlas King, with an unbearably laughable accent), and girlfriend Angela(Sharon Walsh)wanted to try out a \"reader\". I guess Jerry pushed that \"no-no\" button when he poked fun at her magical crystal ball. Anyways, hoody-up and eyeballs wide-open, Jerry, along with his incredibly shiny butcher knife, stabs the singer and her dance partner(?!)in the face during their act on stage. Haunted by one hell of a bizarre nightmare, Jerry awakens to a blur wondering what happened the night before when he went backstage to meet with Carmelita. Soon another dancer, who happens to oh so eloquently mention she had seen the murdered girl meeting with her, gets the knife(..along with a date, the barker who brings the salivating males to dance shows)treatment. Soon, though, Estrella will make on fatal mistake, keeping open the prison a little too long as the xombies soon revolt, shredded clothes and hands that strangle. Soon Jerry will get acid-faced, on the lam as blank-faced police, guns-a-firing, give chase with Angela, her bro Madison(Pat Kirkwood) & Harold is hot pursuit. The closing of the film features a VERY long run across a rocky beach front as Jerry stumbles, falls, returns to his feet, and repeats the clumsy cycle for our amusement, performed so melodramatically. I'll admit that I found the carnival atmosphere particularly effective, it's all spontaneous and random, scenes where Jerry and friends are living it up. I realize that many will giggle at the lack of spirit or choreography for the MANY musical dance interludes which populate this bizarre 60's token of campiness, but I kind of figured it be this way in real life..this isn't The Chorus Line, you know. The transitions from scene to scene are jarring to say the least, and the sound is rather tepid. I had a great difficulty hearing what was being said half the time(..maybe that's a good thing?). I thought the nightmare sequence was a hoot, dancers with painted faces, images of Estrella and Ortega giving Jerry commands, and what seems like cigarette smoke steaming upward(..and the spinning spiral, a constant, returning Jerry to his homicidal ways). As MANY others have mentioned, this is far from a good movie and suffers from lack of real experience, but \"The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies!!?\" is such a strange experience I couldn't turn away, wondering what was gonna happen next. Lots of dead air and oddly structured camera shots of characters' faces. I must admit that I rather enjoyed some of the music sprinkled throughout and it was kind of neat getting a peek at certain parts of LA during such a cinematic era where independent filmmakers(..good and bad)were finding opportunities to make movies."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Morgan-Steckler Productions"],
      "summaries": [
         "Beatnick Jerry takes his girl, Angie to the carnival. Angie wants to go see the gypsy fortune teller, Jerry does not but relents. After visiting the fortune teller and hearing bad news, Jerry goes alone to see Carmelita, the dancer (the fortune teller's sister). He is invited backstage and is mesmerized into becoming a psychotic killer. Angie, and Jerry's best friend Harold realize something is amiss when Jerry tries to kill Angie.",
         "Jerry falls in love with a stripper he meets at a carnival. Little does he know that she is the sister of a gypsy fortune teller whose predictions he had scoffed at earlier. The gypsy turns him into a zombie and he goes on a killing spree."
      ],
      "budget": 38000
   },
   "movielensId": 26098,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-02-10",
      "dvdReleaseDate": "2004-09-28",
      "directors": ["Ray Dennis Steckler"],
      "runtime": 82,
      "movieId": 26098,
      "title": "The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies!!?",
      "mpaa": "",
      "actors": [
         "Ray Dennis Steckler",
         "Carolyn Brandt",
         "Brett O'Hara",
         "Atlas King",
         "Sharon Walsh",
         "Pat Kirkwood",
         "Erina Enyo",
         "Don Russell",
         "Toni Camel",
         "Titus Moede",
         "Denise Lynn",
         "László Kovács",
         "Robert Silliphant"
      ],
      "imdbMovieId": "0057181",
      "originalTitle": "The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies!!?",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "Beatnick Jerry takes his girl, Angie to the carnival. Angie wants to go see the gypsy fortune teller, Jerry does not but relents. After visiting the fortune teller and hearing bad news, Jerry goes alone to see Carmelita, the dancer (the fortune teller's sister). He is invited backstage and is mesmerized into becoming a psychotic killer. Angie, and Jerry's best friend Harold realize something is amiss when Jerry tries to kill Angie.",
      "tmdbMovieId": 31383,
      "avgRating": 2.08333,
      "releaseYear": "1964",
      "numRatings": 12,
      "posterPath": "/uLbEXZphWJbkUbPuzpSKoAb7lRO.jpg"
   }
}