{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "vigilante",
            "id": 7002
         },
         {
            "name": "outlaw",
            "id": 9503
         },
         {
            "name": "false accusations",
            "id": 14783
         },
         {
            "name": "pursuit",
            "id": 15290
         },
         {
            "name": "on the road",
            "id": 15291
         },
         {
            "name": "hanged man",
            "id": 15292
         },
         {
            "name": "confrontation",
            "id": 15295
         }
      ],
      "imdb_id": "tt0059653",
      "video": false,
      "title": "Ride in the Whirlwind",
      "recommendations": [
         42701,
         44102,
         39557,
         15264,
         199503,
         27441,
         65480,
         46910,
         60437,
         83957,
         74122,
         57665,
         31152,
         1673,
         72091,
         272008,
         33988,
         114599,
         66763,
         29260
      ],
      "backdrop_path": "/1OqvMR93L2hxwuWgpC5RaRHiqsg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Vern",
               "gender": 2,
               "credit_id": "52fe462ac3a368484e0826c3",
               "name": "Cameron Mitchell",
               "profile_path": "/59qGcBDKN1H4UysLaOEdV1PJter.jpg",
               "id": 44728,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Abigail",
               "gender": 1,
               "credit_id": "52fe462ac3a368484e0826c7",
               "name": "Millie Perkins",
               "profile_path": "/av89VopRGnsRRLgBCIt1hSKNd2g.jpg",
               "id": 26142,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Wes",
               "gender": 2,
               "credit_id": "52fe462ac3a368484e0826cb",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Catherine",
               "gender": 1,
               "credit_id": "52fe462ac3a368484e0826cf",
               "name": "Katherine Squire",
               "profile_path": "/5iDFdYbPGX5wKVDDgFSw3pEV0is.jpg",
               "id": 139612,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Evan",
               "gender": 2,
               "credit_id": "52fe462ac3a368484e0826d3",
               "name": "George Mitchell",
               "profile_path": "/fJ7mUSVJPXgKAgzNAei09d1fxQY.jpg",
               "id": 30987,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Indian Joe",
               "gender": 2,
               "credit_id": "52fe462ac3a368484e0826d7",
               "name": "Rupert Crosse",
               "profile_path": "/FM92sq0eXQHLmxFyG1fmSBBqSi.jpg",
               "id": 157211,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Blind Dick",
               "gender": 2,
               "credit_id": "52fe462ac3a368484e0826db",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe462ac3a368484e0826b9",
               "name": "Monte Hellman",
               "profile_path": "/qVrEpO0OCsKOrs8SPESfMfqJfRN.jpg",
               "id": 20921,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe462ac3a368484e0826bf",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 3.675933,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 60555,
      "vote_count": 25,
      "budget": 0,
      "overview": "Three cowhands, between jobs, have the bad dumb luck to pitch night camp in the same valley as a cabin full of guys who just robbed a stagecoach and killed the guard. Come morning, a posse arrives, forms up along the ridge, and takes for granted that everyone down below is guilty--fit for either shooting to bits or hanging from a tree, whichever comes first. Precisely half of Ride in the Whirlwind's 82 minutes is devoted to tapping the matter-of-fact, absurdist horror of that situation. In the remaining half, the two surviving cowpokes (Jack Nicholson and Cameron Mitchell) seek shelter at a farmhouse where they reluctantly threaten the farmer, accept breakfast from his wife, flirt with his daughter (Millie Perkins), play some checkers, and hope to remain undetected till nightfall.",
      "similar": [
         49849,
         4771,
         949,
         395990,
         16608,
         223485,
         576,
         11564,
         11966,
         6476,
         5698,
         254869,
         95864,
         23587,
         21052,
         11958,
         5482,
         31017,
         18551,
         14330
      ],
      "original_title": "Ride in the Whirlwind",
      "runtime": 82,
      "poster_path": "/koT8zrcSbwEniUA4impWfGJ9MGH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Proteus Films",
         "id": 38111,
         "origin_country": ""
      }],
      "release_date": "1966-10-23",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "ride with the Easy Rider into an action whirlwind.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Monte Hellman"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Jack Nicholson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059653/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1NzQwODI0OV5BMl5BanBnXkFtZTcwNDQyNDQzMQ@@._V1_.jpg",
      "actors": ["Stars: Jack Nicholson, Cameron Mitchell, Millie Perkins | See full cast and crew »"],
      "reviews": [
         "After their proposed film about abortion was turned down by the studio in 1965, Jack Nicholson combined with Monte Hellman as writer/director to produce two Westerns for producer Roger Corman, each shot in the space of eighteen days on a minimal budget. The two films, The Shooting and Ride in the Whirlwind, were never released in American theaters but built an audience from television and European showings. Gradually developing a cult following, they have now been restored and released on DVD in North America. Though filmed in the Western genre, Ride in the Whirlwind might justifiably be called an anti-Western since there are no heroes or villains, no one to love or hate. There are just people going about their life trying to survive as best they can, operating on a rigid code of behavior that does not allow them much flexibility. After a stagecoach is held up by Blind Dick (Harry Dean Stanton) and his gang, the gunmen retreat to an isolated cabin to spend the night. Passing through are three cowboys Vern (Cameron Mitchell), Wes (Jack Nicholson), and Otis (Tom Filer) headed to Waco Texas after the rodeo they were to perform in is canceled. They pass a lynching victim strung up on a pole, and stop at the same cabin where the gang is holed up looking for some rest. Surprisingly, they are welcomed by Blind Dick, ostensibly the one responsible for the lynching but find that they soon have unwelcome visitors. The sheriff and his posse have surrounded the house and begin shooting at the occupants, wrongly assuming that the three travelers are also part of the gang. Inarticulate, the cowhands are unable or unwilling to try and explain to the lawmen the fact that they are innocent. After a protracted shootout, Otis is killed and the gang members are burned out of their cabin and hanged. Vern and Wes escape on foot but are followed and tracked by the lawmen, bound by their code of unthinking frontier justice. The two innocent men stumble upon a farmhouse that had already been visited by the posse and are looked after by a farmer Evan (George Mitchell) and his daughter Abigail (Millie Perkins). Eating and passing the time playing checkers, they know that sooner or later the posse will come back, if only to court Abigail. When they do return, Evan's inability to see that Vern and Wes have no choice but to steal two horses is very costly. In debunking the Western myth of good guys and bad guys, Hellman has directed a film in which the ordinariness of the life overshadows the mythos of the exciting frontier. Yet while Ride in the Whirlwind may be one of the most authentic and haunting Westerns ever made, it is also one of the saddest, a film in which the operative word is not justice or camaraderie but loneliness and lost opportunity.",
         "Monte Hellman makes art movies--as in Mr. Wim Wenders, or Mr. Robert Bresson, for that matter. How he disguised them as hot-rod movies, or trendy hippie bashes, or simple old Westerns, is beyond me, so rarefied, quiet, composed, and art-conscious are they. RIDE IN THE WHIRLWIND, scripted by its star, Jack Nicholson, reduces \"the Western\" to abstract essentials. Guys in a shack getting smoked out by the lawmen outside. Guys on the lam from a lynch mob. Stoical lynch-mob hanging. Tense, purse-lipped conversation between outlaw and kidnapped good-girl type. Presented against a stark landscape with no extras (I'm sure Hellman'll tell you it's sheer economics), the scenes take on the quality of gallery installations based on Western plot devices. If you ever wondered where the laconic sensibility of such latter-day types as Jim Jarmusch and Michael Almereyda came from, here's a hint.",
         "Former Roger Corman collaborator Monte Hellman directed two of the most underrated American movies of the 1960s/70s 'The Shooting', a puzzling western starring Warren Oates and Jack Nicholson, and the existential road movie 'Two-Lane Blacktop'. 'Ride In The Whirlwind' was shot simultaneously with 'The Shooting', and while it isn't as impressive as that film it's still very good, and one of the most underrated Westerns of the 1960s. Jack Nicholson once again stars, and also scripted. He and Hellman made a great team, and it's just a pity that they didn't continue to collaborate. A few other actors from 'The Shooting' also appear, most notably the sultry Millie Perkins, though she has a much smaller role in this one. Nicholson is ably supported by legendary character actors Cameron Mitchell ('Hombre', 'The Klansman', 'The Toolbox Murders') and Harry Dean Stanton ('Cool Hand Luke', 'Repo Man', 'The Last Temptation Of Christ'). Watching these three guys work off each other is reason enough to see this. (Also hunt down the Bruce Dern biker obscurity 'The Rebel Rousers' which they all appear in, thought it's nowhere near as good) Hellman's westerns are minimalistic and a bit of an acquired taste, but I really like them a lot. 'Ride In The Whirlwind' is easier to get into than 'The Shooting'. It's more straightforward, but still a very subtle and interesting movie, and Nicholson and Mitchell's contrasting acting styles bounce off each other really well. Recommended.",
         "Monte Hellman's \"Ride in the Whirlwind,\" while not quite as good as his masterpiece, \"The Shooting,\" is still an endlessly fascinating meditation on the old West. Hellman's Westerns are almost antithetical Westerns since they stress allegory and atmosphere over character and plotting. Not for every taste, this film has a lot to admire, not the least of which is Jack Nicholson's fine script and performance.",
         "If I had to explain with complete certainty why Ride in the Whirlwind is better than average it wouldn't be very easy because on the surface it seems average through and through. It was made obviously for bargain-basement prices (I think director/co-producer Hellman once said that he didn't think anyone would see the westerns he made in the 60s), yet with that, and within the simple confines, there's a freedom in other ways too. On the surface it seems like a cowboy story gone awry, as cattle herders Jack Nicholson and Cameron Mitchell, along with another partner, are on their way to Waco and come upon a cabin occupied by Harry Dean Stanton (in total 'bad-ass' mode with an eye-patch) and his gang (who previously robbed a stagecoach and killed a few of its passengers), and neither want any trouble so they settle for the night. The next day, of course, a posse has discovered Stanton's gang's whereabouts, and there's a shootout. Somehow, Nicholson and Mitchell (not the other partner) sneak out during the shoot-out, but are of course mistaken for being part of the gang, and are sought out to be strung-up. What makes this simple premise- of cowboys falsely accused of pillaging and murder- more interesting than anything else is the consistent sense of dread and of the romantic sheen of more popular A-list westerns being stripped away. Since B-movies, not just B-westerns, concern more-so the basics of the characters, Hellman and writer Nicholson (who with this and the Trip shows that he actually isn't a bad writer with original material) dig into the fatalism tapped into both sides, of the posse and the prey. Some of the best scenes come up in the time that would usually be called the filler, when Nicholson and Mitchell hold up at a farmer's house and try and get their mind off of the situation with little distractions- Wes (Nicholson) checking out the horses, the two of them attempting a checkers game, trying to sleep- and what isn't said or the extra meaning behind the matter of fact dialog means a good deal. There's also the aspect to their not really being a sense of true justice, as the posse have taken it upon themselves to go after these men; you know just looking at these barely one-dimensional figures that all they want is a hanging done, no more no less. I'm not sure how much allegory could be drawn from the picture, though on a first viewing sometimes the stilted acting by the supporting players drew away from that (there's also a practical lack of wit from the screenplay, which is appropriate but nears being a little bland for its own good). And while it doesn't dig into the complete heels of the western genre like a later John Ford or Leone movie, or even Unforgiven, Hellman's film is a cut above many other westerns that would settle for conventions being without any challenges to the situations. The climax of the picture doesn't come as too much of a shock to those who've seen their share of genre material, but it was the best way to end the picture: it's not really a happy ending, in spite of the 'riding off into the sunset' shot. There's no hope in this world, not on any side, even if complete justice is not sought. Short and succinct, this is one of those flicks to see in the one dollar bin at the video store, if only for Nicholson and Stanton's eye-patch.",
         "If you are looking for a romantic Western with traditional good guys battling against the forces of evil, then you have come to the wrong place. There are no heroes and no villains, just ordinary men and women struggling against the elements for survival. No one has an easy life, neither homesteader nor outlaw. The drudgery of the former is shown by the farmer hacking away endlessly at the stubborn stump that refuses to give up its hold. The folly of the latter comes into focus when the vigilante posse catches up with its quarry. Knowing that a life of punching cows will get them nowhere, three cowboys, played excellently by Jack Nicholson, Cameron Mitchell and Tom Filer, briefly consider joining up with the outlaw gang they've been forced to spend the night with. Not having the outlaw nature, the cowboys reject that option and determine that they best separate themselves at first light. However, by then it is too late. The vigilantes have both the outlaws and them surrounded and open fire. If they surrender, they will be hanged, no questions asked. If they try to ride out, they will be shot down. They can only climb out of the valley up the mountains, leaving their horses behind. However, as stated by one of the cowboys, it is no country to be set afoot. Thus, their enemy becomes not only the men tracking them down but also the harsh environment into which they are thrust and must overcome. That struggle is the essence of what this marvelous film is all about.",
         "Innocent cowboys, including Cameron Mitchell and Jack Nicholson, stop for food and rest at a cabin that unknown to them, is the hideout for a group of outlaws. Soon they find themselves on the run from a vicious hanging party and having to take teenage Millie Perkins and her family hostage in order to buy themselves some time. Good performances, direction by Monte Hellman, and an unbelievably tense script by Jack Nicholson help make this a thriller worth watching. The finale is absolutely heart-wrenching! A great independent western filmed simultaneously with The Shooting (also with Nicholson and Perkins), this is considered the lesser of the two, though not by much. Both films are fantastic.",
         "I found this film to be both traditional and non-traditional at the same time. I originally watched this film because I am interested in anything starring Jack Nicholson, but I was drawn in by the story of horse thieves and mistaken identities. With essentially the same cast as The Shooting, which was filmed in succession with Ride in the Whirlwind with many of the same locations, this has the feel of what we now in the 90's call an \"independent\" movie. For all practical purposes, it is. As a result you get a good story, good acting without all the Hollywood bottom line money making stunts. A must see for Nicholson fans along with the Shooting.",
         "This independent and offbeat film deals with three cowboys who are mistaken for members a band , then they're wrongly pursued by a relentless posse . This outlandish Western is finely set against barren backdrop and well photographed outdoors . Slow-moving , a little boring , however being packed with exciting pursuits , strong performances and noisy gunplay . Written , starred and produced by Jack Nicholson along with an uncredited Roger Corman . Made concurrently , back to back , with ¨The shooting¨ with the same cast (Millie Perkins, Jack Nicholson) , cameraman (Gregory Sandor) and maverick director (Hellman) . Slammed by the intelligentsia when it was released , today become a minor cult movie , as well as ¨The shooting¨ . The motion picture was professionally directed by Monte Hellman (Two-lane blacktop , Cockfighter) in his usual visual style . His stars are similarly independent-minded actors such as Jack Nicholson , Harry Dean Stanton and Cameron Mitchell . From his two known strange , outlandish Westerns in which Hellman directed in rare as well as special qualities , he has remained fiercely independent with lukewarm reception by public, but praised by critics . In his first films he teamed up Roger Corman who produced his earlier movies with a relative success , however nowadays he only makes fateful B movies and failure television movies .",
         "This is probably the least of the four Monte Hellman films I've seen so far (the others being \"Cockfighter\", \"The Shooting\", and \"Two Lane Blacktop\"), but its still more interesting that most other b-films of the time. There was a Film Threat article on Hellman entitled \"Exploitation or Existentialism\" and that basically sums up my view on the director. He used the cheap low budget film to get across his philosophical ideas because producers such as Roger Corman would offer him more freedom in this area than any major studio. While its not as good as his other western \"The Shooting\", \"Ride in the Whirlwind\" is still a fascinating viewing and a true example of how creativity and ideas matter much more than a budget. Hellman always utilized a very minimalist style to its full effect. I found the beginning of this film to be dull despite an appearance from the legendary Harry Dean Stanton. This is odd, because that is when all the gun play happens. The second half it becomes more interesting when we realize all these character's fates are determined by coincidence rather than their own actions. Its existentialism on the level of Camus. Jack Nicholson, an actor who would later be remembered for larger-than-life portrayals gives a surprisingly effective low key performance. Cameron Mitchell, an actor known for going over-the-top (just turn to the infamous \"The Toolbox Murders\") isn't nearly as good but is quite adequate, considering how bad he could get. Its a shame that the films of Hellman are unjustly overlooked and, with the exception of \"Cockfigter\", rather difficult to find. (7/10)"
      ],
      "genres": ["Western"],
      "productionCompanies": ["Proteus Films"],
      "summaries": [
         "Wes, Vern and Otis are three cowhands on the way to a cattle drive. Coming upon what is to be an omen of their future... an outlaw hung by a group of vigilantes...the trio finds shelter at a cabin, only to discover that their \"hosts\" are men who have robbed a stagecoach and killed the guard. When an avenging posse attacks the cabin, Wes and Vern escape, only to find that they have become branded as 'outlaws' by the posse, who relentlessly pursue them.",
         "Three cowboys, mistaken for members of an outlaw gang, are relentlessly pursued by a posse."
      ],
      "budget": 70000
   },
   "movielensId": 26146,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1966-10-23",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Monte Hellman"],
      "runtime": 82,
      "movieId": 26146,
      "title": "Ride in the Whirlwind",
      "mpaa": "",
      "actors": [
         "Cameron Mitchell",
         "Millie Perkins",
         "Jack Nicholson",
         "Katherine Squire",
         "George Mitchell",
         "Rupert Crosse",
         "Harry Dean Stanton"
      ],
      "imdbMovieId": "0059653",
      "originalTitle": "Ride in the Whirlwind",
      "genres": ["Western"],
      "youtubeTrailerIds": [
         "xLfjItB-reQ",
         "WxEGkbnl4MQ"
      ],
      "plotSummary": "Three cowhands, between jobs, have the bad dumb luck to pitch night camp in the same valley as a cabin full of guys who just robbed a stagecoach and killed the guard. Come morning, a posse arrives, forms up along the ridge, and takes for granted that everyone down below is guilty--fit for either shooting to bits or hanging from a tree, whichever comes first. Precisely half of Ride in the Whirlwind's 82 minutes is devoted to tapping the matter-of-fact, absurdist horror of that situation. In the remaining half, the two surviving cowpokes (Jack Nicholson and Cameron Mitchell) seek shelter at a farmhouse where they reluctantly threaten the farmer, accept breakfast from his wife, flirt with his daughter (Millie Perkins), play some checkers, and hope to remain undetected till nightfall.",
      "tmdbMovieId": 60555,
      "avgRating": 3.26923,
      "releaseYear": "1966",
      "numRatings": 26,
      "posterPath": "/koT8zrcSbwEniUA4impWfGJ9MGH.jpg"
   }
}