{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "kung fu",
            "id": 780
         },
         {
            "name": "wuxia",
            "id": 184656
         }
      ],
      "imdb_id": "tt0060635",
      "video": false,
      "title": "Dragon Inn",
      "recommendations": [
         143479,
         38155,
         223478,
         59352,
         119336,
         76754,
         131964,
         39776,
         17129,
         98497,
         55835,
         71851,
         74305,
         54284,
         69599,
         35648,
         76715,
         18667,
         54283,
         25951
      ],
      "backdrop_path": "/a3l4jx5kGp9RBRetJzsiiPrMP55.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "Hsiao Shao-Tzu",
               "gender": 2,
               "credit_id": "57421b2bc3a36807360065d6",
               "name": "Shih Chun",
               "profile_path": "/ep6D1oKyDG8584NLoaP1xum8QQI.jpg",
               "id": 1172051,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Pi Shao-Tung",
               "gender": 0,
               "credit_id": "5484bef7c3a3680b3a000e65",
               "name": "Miao Tian",
               "profile_path": "/2kz2r1mEkAZPnkUaODwvJdDuDRl.jpg",
               "id": 1163475,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "General Wu Ning",
               "gender": 2,
               "credit_id": "5484bf1d9251416a66000ac2",
               "name": "Cho Kin",
               "profile_path": "/ohKpSu0jcJkdPZlwkxAn5fIbSsk.jpg",
               "id": 1173739,
               "order": 2
            },
            {
               "cast_id": 24,
               "character": "Chu Chi",
               "gender": 0,
               "credit_id": "5a6dd3b2c3a368554101ea1c",
               "name": "Hsieh Han",
               "profile_path": "/gXn55BOqgNFoJ6oT0gsVjolQ25f.jpg",
               "id": 137916,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Bookkeeper at inn",
               "gender": 2,
               "credit_id": "56c1cd2ac3a36817e400737a",
               "name": "Go Ming",
               "profile_path": "/jUpZ8rM1GOPMzUNsZFIZ66ZX1p.jpg",
               "id": 1577982,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Waiter at inn",
               "gender": 2,
               "credit_id": "5484bf45c3a3680b3a000e73",
               "name": "Ko Hsiao Pao",
               "profile_path": "/5sAXMJP3tXnC8Hf0J5NZBvobAQ6.jpg",
               "id": 1174639,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Kuei Yu Chang",
               "gender": 0,
               "credit_id": "5484bf4fc3a3680b430009a5",
               "name": "Ko Fei",
               "profile_path": "/dtDgU5gD2NfDImbqMoZVxSbznwd.jpg",
               "id": 1396095,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Yu Chien's daughter",
               "gender": 1,
               "credit_id": "5888d788c3a3683e74009ee6",
               "name": "Hsu Feng",
               "profile_path": "/y9W1bms1xIiuE1vfuOxxGlgtq58.jpg",
               "id": 130394,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Tou La",
               "gender": 0,
               "credit_id": "5888dbae92514163060121aa",
               "name": "Wan Chung-Shan",
               "profile_path": "/rutMKgftyIVIPEhnyOuqF6c4BFr.jpg",
               "id": 1602759,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Escort officer",
               "gender": 0,
               "credit_id": "5888e339c3a3684093009dfc",
               "name": "Tien Peng",
               "profile_path": "/cPdfIzioTlUdjv4PLFB6VQpSrYr.jpg",
               "id": 238888,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Tsao Shao Chin",
               "gender": 2,
               "credit_id": "5945f37a9251413fc201c0b7",
               "name": "Pai Ying",
               "profile_path": "/w0gpzw73WmMvrZP8WkGGhorYY05.jpg",
               "id": 137913,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Miss Chu Huei",
               "gender": 1,
               "credit_id": "59e424c4c3a3684668021bb2",
               "name": "Polly Shang-Kuan Ling-Feng",
               "profile_path": "/cdVVPK2Wp8HWeqND0bEKdBEH8Fw.jpg",
               "id": 238887,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a30c3a36847f81bf807",
               "name": "King Hu",
               "profile_path": "/lIvTfhF4Mg5Uw7dZcA99bISyXk5.jpg",
               "id": 83698,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5301de2892514121a426a416",
               "name": "King Hu",
               "profile_path": "/lIvTfhF4Mg5Uw7dZcA99bISyXk5.jpg",
               "id": 83698,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.227227,
      "production_countries": [{
         "iso_3166_1": "TW",
         "name": "Taiwan"
      }],
      "id": 104237,
      "vote_count": 16,
      "budget": 0,
      "overview": "General Yu is executed after having been accused of treason by the powerful eunuchs, and his children will be deported. Eunuchs plotting to kill even the children, and prepare an ambush on Dragon's shelter in the middle of the desert. There are other guests, who are also interested in the deal.",
      "similar": [
         9053,
         11841,
         55292,
         140300,
         233361,
         9461,
         44865,
         20811,
         146,
         605,
         24,
         604,
         682,
         9502,
         272,
         11770,
         98566,
         7549,
         1498,
         2024
      ],
      "original_title": "龍門客棧",
      "runtime": 111,
      "poster_path": "/z14pgcMWh91qZHWLa1mSzn2Rc2A.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Union Film Company",
         "id": 14102,
         "origin_country": ""
      }],
      "release_date": "1967-10-21",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Taiwan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["King Hu"],
      "runtime": 111,
      "synopsis": null,
      "writers": ["King Hu"],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0060635/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMTc1MzI5OV5BMl5BanBnXkFtZTgwNTg0OTk3MTE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Lingfeng Shangguan, Chun Shih, Ying Bai | See full cast and crew »"],
      "reviews": [
         "This is the original of the 1992 remake of the same title(with a NEW) and 2nd of the \"INN\" trilogy by King Hu after Come Drink With Me. It was a major hit all over Chinese areas in South East Asia and discovered Shang Kuan Ling Feng(note the mistake by a previous comment)as the 2nd most popular Sword woman(the 1st was Cheng Pei Pei, and later 3rd Hsu Feng(Hsia Nu aka A Touch of Zen). All these 3 females stars are made popular by him and they are also the 3 most popular swords women in Chinese Cinema. If there is any complaint by any viewer, it's the pace that many may find it a bit slow but isn't most highly regarded movies slow ?? The finale scene is the most climatic in a Chinese action that critc compared this film to \"Rio Bravo\" and \"The Wild Bunch\". Beware of some mistakes in the original English subtitles mentioned by the director himself. You can watch some scenes of it if you go to the movie Bu San(2003) aka Goodbye, Dragon Inn(here in IMDb and watch the trailer) which paid tribute to this movie. The 90's remake is nothing better except for an additional character well acted by Maggie Cheung.",
         "I saw this film in the 60's, and have yet to find one to beat it. 'Hidden Dragon, Crouching Tiger' has to come in behind this masterpiece. The use of new actors and actresses, the adoption of well-timed traditional Chinese music, e.g. to usher in the villain, the innovative action sequence in sword fights, all added to the brilliance of this film. Yes, there are shortcomings. Toward the end, and the climax, the anti-gravity leaps to the trees were overdone and unnecessary. Regardless, this film resembles the best of the traditional, addictive Chinese martial art novels that once consumed many hours of the armchair martial art addicts.",
         "I saw this during its initial run under the title \"Dragon Inn.\" This is no ordinary swordplay movie. It is a visual treat of ancient Chinese costumes and weaponry. The traditional Chinese instruments used for the background music added an otherwordly flavor. I left the theatre wondering if the movie was truly historical. The head of the Yu clan has been condemned to death by the evil prime minister who has usurped imperial power. A palace eunuch who managed to claw his way to power, he is also reputed to be China's greatest swordsman. He plots to eliminate the entire Yu family but is opposed by a master swordsman and swordswoman. A memorable scene that has nothing to do with fighting is the dinner at Dragon Inn which introduced me to the Mongolian Fire Pot (shabu-shabu) style of eating. To the uninitiated, there is a fire pot in the middle of the table decked out with all sorts of raw food which you put into the boiling water of the firepot and eat them as they are cooked. The cooking water is sipped as soup. I took my little sister to see it and from then on she got hooked on Chinese swordplay movies. She began reading up on ancient China and in college she majored in history and archaeology -- all because I took her to see Dragon Inn. I am gratified to learn recently that the female supporting actress Feng Hsu moved on to become a producer-director herself with a number of critically acclaimed films to her credit. I look forward to seeing them soon.",
         "A must see swordplay film, probably the best of its kind ever made. The director, King Hu, is the master of tension and suspense and holds the viewer's attention throughout. I cannot rate this fim highly enough. If only it were more readily available.",
         "There are some movies that stick by you over the years and this Chinese swords movie from the middle sixties is one of them. King Hu's Dragon Gate Inn has all the ingredients in it to make this movie a classic. Not only does it have good swords fights and combines these with an excellent story and plot but on a more subtle level the background music adds a really good atmosphere to it that draws you even more into the movie and story. I can recommend this movie for anyone who is interested in Chinese film in general and anyone who is interested in Chinese swords movies with a good story and plot. 10 out of 10 points from me.",
         "As much as I like the genre, there's a class and authenticity to this movie you're not gonna find in many other martial arts/wuxia staples--it's probably closer to Kurosawa or even a spaghetti western than anything, while nevertheless retaining an obviously Chinese/Taiwanese spirit and feeling surprisingly stylistically self-contained. Far beyond a padded out collection of action scenes, Dragon Inn is a bit of an exercise in suspense that no doubt served as a helpful reference to Tarantino when he was working on that nazi movie. The eunuch's two generals were perfectly casted, switching between menace and personable charm at the drop of a hat as characters negotiate basic formalities while hiding daggers behind their backs, aware of each other's motives but feigning ignorance, waiting for the perfect moment to strike. This is one of those cases where campy dubbing would most assuredly ruin the tone. When violence does erupt, there's a bit of that inevitable flaily-arm \"why doesn't he just stab him right now?\" type stuff going on, but the overall standard of dexterity required from everyone involved was very high. Consistent with the rest of the film, the battles emphasize the moments between crashing steel where you can cut the tension with a knife, and extremely long takes imbue the action with a sense of immediacy and raw physicality. You know how in most movies, the illusion of impaling a guy is something that requires a lot of cuts? Here we get guys impaled by the handful in one shot. Odd thing to praise, but stuff like that adds up. You gotta remember the audience this was made for, though, and adjust your expectations accordingly. The premise is just spat in your face, then you just have to do your best to keep up. The film's political background and characters are perfunctory to the thrill of cloak-and-dagger espionage and the mythology of the setting.",
         "I watched this film at a university club for foreign students in 1970, more-or-less by accident. I was awestruck, and the people who saw it with me discussed it for days after. Decades later, when I joined a group to see the acclaimed new film, \"Crouching Tiger, Hidden Dragon,\" I confounded my friends by muttering \"Seen that,\" \"Old hat,\" and \"I thought this film was supposed to be ground-breaking?\" at intervals throughout. I'd kill to have a DVD of the 1966 film. It was a great introduction to Chinese martial arts movies and their conventions (e.g., the traditional inn-wrecking scene). The humor of the scene where all these tough, hard-bitten warriors suddenly hold an impromptu psychoanalytical intervention for their most introverted member still makes me grin. If you get a chance, see it!"
      ],
      "genres": [
         "Action",
         "Adventure"
      ],
      "productionCompanies": ["Union Film Company"],
      "summaries": [
         "The Eunuch of the Emperor has ordered the commander of his army condemned to death for betrayal and insurrection. The commander's family was was murdered to cut off his bloodline, but his two youngest, a son and a daughter, were expelled from the empire to the outlands in an attempt to draw out the commanders confidant and adviser. In order to complete the plan, the Eunuch sent his ultra-secret Black Arrow Troop to assassinate the two remaining children and the advisor. The ambush: to be carried out at the Inn Of Dragon's Gate at the border. The plans fail as journeymen of great swordsmanship turn up at the inn. From that point until the end of the flic many battles take place. This film is a masterpiece of martial arts swords-play and speaks the tune of \"The Swordsman\" and the \"Zatoichi\" films. A must see for fans of classic Asian cinema.",
         "The first eunuch of the emperor has managed to have a major opponent condemned to death and his family banished from the empire. In order to avoid a revenge of his victims, the eunuch sends his secret police to assassinate the deportees. The ambush is to be carried out at the inn of the Dragon Gate, an isolated place close to the border. The original plan of the secret agents is upset as several unexpected travelers - who prove to be master fencers - arrive at the inn. Very soon, and till the end of the last reel, secret agents, the escort of the deportees, mysterious travelers of all kinds, the personal guard of eunuch, the soldiers protecting the frontier, and the eunuch himself engage in ceaseless treacherous manoeuvres, frantic pursuits, and especially acrobatic sword fights in he good old tradition of the Chinese cinema."
      ],
      "budget": 0
   },
   "movielensId": 26156,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1967-10-21",
      "dvdReleaseDate": null,
      "directors": ["King Hu"],
      "runtime": 111,
      "movieId": 26156,
      "title": "Dragon Inn",
      "mpaa": null,
      "actors": [
         "Shih Chun",
         "Miao Tian",
         "Cho Kin",
         "Hsieh Han",
         "Go Ming",
         "Ko Hsiao Pao",
         "Ko Fei",
         "Hsu Feng",
         "Wan Chung-Shan",
         "Tien Peng",
         "Pai Ying",
         "Polly Shang-Kuan Ling-Feng"
      ],
      "imdbMovieId": "0060635",
      "originalTitle": "龍門客棧",
      "genres": [
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["GAq31U-fOS0"],
      "plotSummary": "General Yu is executed after having been accused of treason by the powerful eunuchs, and his children will be deported. Eunuchs plotting to kill even the children, and prepare an ambush on Dragon's shelter in the middle of the desert. There are other guests, who are also interested in the deal.",
      "tmdbMovieId": 104237,
      "avgRating": 3.20833,
      "releaseYear": "1967",
      "numRatings": 12,
      "posterPath": "/z14pgcMWh91qZHWLa1mSzn2Rc2A.jpg"
   }
}