{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "artificial intelligence",
            "id": 310
         },
         {
            "name": "boredom",
            "id": 3925
         },
         {
            "name": "midnight movie",
            "id": 11487
         },
         {
            "name": "anarchic comedy",
            "id": 236316
         }
      ],
      "imdb_id": "tt0069945",
      "video": false,
      "title": "Dark Star",
      "recommendations": [
         811,
         17814,
         8852,
         28942,
         26912,
         9663,
         11071,
         4923,
         29343,
         28893,
         15785,
         830,
         29437,
         20424,
         10803,
         991,
         4917,
         14510,
         20850,
         31682
      ],
      "backdrop_path": "/A5A5JxKXwLNS9MU2B0i4Zfu5tz4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 16,
               "character": "Lt. Doolittle",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f74d",
               "name": "Brian Narelle",
               "profile_path": null,
               "id": 25202,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Boiler",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f751",
               "name": "Cal Kuniholm",
               "profile_path": null,
               "id": 25203,
               "order": 1
            },
            {
               "cast_id": 25,
               "character": "Sgt. Pinback alias Bill Fruge",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f76d",
               "name": "Dan O'Bannon",
               "profile_path": "/slLZWXZ1lmdF763166ATRRI200n.jpg",
               "id": 5045,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Talby",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f755",
               "name": "Dre Pahich",
               "profile_path": null,
               "id": 25204,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Bomb 20 ( voice )",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f759",
               "name": "Adam Beckenbaugh",
               "profile_path": null,
               "id": 25205,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Ailien",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f75d",
               "name": "Nick Castle",
               "profile_path": "/ecUHW93fTzJLCEZcpfvfjgNMi1o.jpg",
               "id": 14692,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Comannder Powell ( voice )",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f761",
               "name": "Joe Saunders",
               "profile_path": null,
               "id": 25207,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Muttercomputer ( voice )",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f765",
               "name": "Cookie Knapp",
               "profile_path": null,
               "id": 25206,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Bomb 19 ( voice )",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f769",
               "name": "Alan Sheretz",
               "profile_path": null,
               "id": 25208,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f70d",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f713",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f719",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f71f",
               "name": "John Carpenter",
               "profile_path": "/jGprVNNSmlJzLNhm2tcdmjquLyL.jpg",
               "id": 11770,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f725",
               "name": "Douglas Knapp",
               "profile_path": null,
               "id": 25194,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f72b",
               "name": "Ron Cobb",
               "profile_path": "/31PgkuW3y0xzeU52dIWoC7BOoAf.jpg",
               "id": 25195,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f731",
               "name": "Bob Greenberg",
               "profile_path": null,
               "id": 25196,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f737",
               "name": "Gregory Jein",
               "profile_path": null,
               "id": 25197,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f73d",
               "name": "Harry Walton",
               "profile_path": null,
               "id": 25199,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f743",
               "name": "John C. Wash",
               "profile_path": null,
               "id": 25200,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f749",
               "name": "Bill Taylor",
               "profile_path": null,
               "id": 25201,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f779",
               "name": "Dan O'Bannon",
               "profile_path": "/slLZWXZ1lmdF763166ATRRI200n.jpg",
               "id": 5045,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f77f",
               "name": "Dan O'Bannon",
               "profile_path": "/slLZWXZ1lmdF763166ATRRI200n.jpg",
               "id": 5045,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f785",
               "name": "Dan O'Bannon",
               "profile_path": "/slLZWXZ1lmdF763166ATRRI200n.jpg",
               "id": 5045,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53bbac220e0a26197800299c",
               "name": "Dan O'Bannon",
               "profile_path": "/slLZWXZ1lmdF763166ATRRI200n.jpg",
               "id": 5045,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "53bbac4b0e0a26196b00285b",
               "name": "J. Stein Kaplan",
               "profile_path": null,
               "id": 109938,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "53bbacc30e0a2619780029ad",
               "name": "Nick Spaulding",
               "profile_path": null,
               "id": 1338843,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "54c39d2b92514124c8005624",
               "name": "J. Stein Kaplan",
               "profile_path": null,
               "id": 109938,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "54c39d9fc3a3681421011d88",
               "name": "Dale Beldin",
               "profile_path": null,
               "id": 4615,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "54c39db49251416eae00e6ed",
               "name": "Cliff Fenneman",
               "profile_path": null,
               "id": 1417902,
               "department": "Camera",
               "job": "Additional Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.261603,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1410,
      "vote_count": 152,
      "budget": 60000,
      "overview": "A low-budget, sci-fi satire that focuses on a group of scientists whose mission is to destroy unstable planets. 20 years into their mission, they have battle their alien mascot, that resembles a beach ball, as well as a \"sensitive\" and intelligent bombing device that starts to question the meaning of its existence.",
      "similar": [
         605,
         603,
         604,
         62,
         296,
         9323,
         157353,
         2048,
         78,
         762,
         335984,
         218,
         68,
         813,
         861,
         20526,
         12244,
         5548,
         534,
         583
      ],
      "original_title": "Dark Star",
      "runtime": 83,
      "poster_path": "/eeoSwN8l0mj1gEzRzmXvoAUXxDh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jack H. Harris Enterprises",
            "id": 8441,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "University of Southern California",
            "id": 1901,
            "origin_country": ""
         }
      ],
      "release_date": "1974-04-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "What Do You Say To A Talking Bomb? All Systems Snafu!!!",
      "adult": false,
      "homepage": "http://www.theofficialjohncarpenter.com/dark-star/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Carpenter"],
      "runtime": 83,
      "synopsis": "An incoming message from Earth arrives to the spaceship. Watkins (Miles Watkins) says that the trip is being broadcast live. The messages take around ten years to arrive. There was a radioactive leak, and Commander Powell (Joe Saunders) died. In consequence, there is a week of mourning on Earth, all flags are half-mast, but Congress won't pay for a radiation shield. \"Dark Star\" is the spaceship. Talby (Dre Pahich, with the voice of John Carpenter) is one of the astronauts, and he falls asleep. The crew can speak to Bomb 19 (Alan Sheretz's voice), which destroys a planet. Dark Star goes to hyperspace and leaves the hell out of there, watching the explosion from far away. The computer (Cookie Knapp's voice) says that they've destroyed the last unstable planet on that system. However, the computer finds another unstable red-dwarf planet, so they have to go and check it out. Francis Boiler (Cal Kuniholm) puts on some country music on the radio. On the ship's log, we can hear that a part of the ship self-distructed. They are dancing to the sound of funky music. The computer tells about something on collision course, and the defence system was destroyed some time ago, so they try to do something manually. A thunder activates a bomb. Bomb 20 (Adam Beckenbaugh) is deployed, but luckily, the computer overides the orders and Bomb 20 finally goes back to its place. Images of a hole around the destroyed laser machine. Lt. Doolittle (Brian Narelle), Sgt. Pinback (Dan O'Bannon) and Talby go to their room. They sleep in the same place, and it looks like an aparment from the projects in the 60's. One of them makes music with empty bottles of liquor. Talby should be watching the ship, but he's always sleeping. He is advised to see the rest of the ship. He says that space can be wonderful and full of colour, and Doolittle says that he misses Earth and Mars as well. Francis Boiler starts shooting a square of metal just to distract himself, although Pinback tells him not to do it. The computer tells Pinback about the alien going awry, telling him that it was his original idea to bring him into the ship. The alien (Nick Castle) is a beach ball with legs. It doesn't want to eat. Pinback brought it in because he thought it was fine. Pinback is cleaning up the alien's mess when it attacks him. The alien leaves the room. Pinback gives it a plastic toy, and it eats it, but when Pinback goes to pick the broom, the alien is not there. It holds the broom and hits Pinback with it. Pinback looks for the alien in the bowels of the ship. Pinback uses a plank to go to the alien. A sign says \"Emergency air lock interior room\". The alien goes around Pinback and takes the plank away. He tries to cross the shaft, although the corridor is very narrow. It is the lift shaft, and the computer says that it's been activated. Pinback tries to move on towards the alien, but it attacks him. He falls down, but can hold onto the thin layer of passway. The alien jump and tickles Pinback. The lift seems to stop when Pinback interrupts it. The lift goes up again, with Pinback holding onto an outer metalic handle. The alien turns onthe laser, which makes all the systems go crazy. Meanwhile, Doolittle and Talby have kept on talking. Bomb 20 has received a signal to ignate itself again. The computer tries to reason with it, saying that it was an error again. Bomb 20 finally agrees, but it says that that was going to be the last time. The lift stops at the third floor, and Pinback thinks of jumping out. He unscrews a floor trap and gets onto the lift. He gets stuck. He tries to use the phone for help, but it's out of order. He presses another button, and opera music resounds. The lift keeps going up and down for no apparent reason. He presses another button to clean the lift, and presses 1, which will make the lift clean itself. Finally Pinback leaves the lift amid a mist of smoke and with a metalic lid around his waist. Now, at this moment, he's really pissed off, so he goes to pick and anesthetic gun. Soon enough, he finds the alien, cornered somewhere. He shoots the alien, who flies all over the place, and ends up deinflated. Pinback talks about his ordeal to the rest of the crew. They have lunch togethertalking about Talby being mentally unstable. Talby goes to the computer room, and says to Doolittle that the computer has found the malfunction in the ship. Powell left a message, saying that he doesn't intend to come back to Earth. Pinback checks his past diary logs, stating that nobody recognises his good qualities, and that nobody said \"happy birthday\" to him. The computer has finally found the malfunction: it's the laser. However, everybody is sound sleeping but for Pinback. Eventually, they find the unstable planet. Bomb 20 is deployed. Pinback is in the emergency air lock, where there is a door which can be opened without depressureization. There, there is the laser who works badly. Nobody wants to hear Pinback, because they are busy with the deployment of Bomb 20. The laser is turned on, and it shoots inside the ship. The laser makes Pinback blind, and he crosses the path of the laserbeams. This creates further malfunctions, so they can't drop the bomb. Everybody panics on the bridge because the explosion sequence goes on, and Bomb 20 refuses to turn itself off. The computer will only contain the damage done to the ship by Bomb 20 up to a certain degree. They have to ask Powell, in the cryogenic deep-freeze compartment, what could be done. Powell asks about the Dodgers, and complains that he's lonely. When he is about to give a suggestion, the mike has a malfunction, and then Powells forgets about it. Pinback tries to reason with Bomb 20 while Doolittle questions Powell. Doolittle goes out to space and talks to Bomb 20. DOOLITTLE: How do you know that you exist. BOMB 20: Intuition. DOOLITTLE: You can't base everything on intuition. BOMB 20: I think, therefore I am. and the dialogue goes on and on like that. Bomb 20 agrees that its experience of the outer world depends on possibly wrong information. It says that it'd be nice to keep on discussing the matter with Doolittle, but that it has no time, because it will go off in 49 seconds. Meanwhle, Boiler tries to shoot the bomb. In the fight with Pinback, he almost shoots him. Doolittle tells Bomb 20 to consider what his purpose in life is. To explode, of course, says Bomb 20. As it can only explode once, it wouldn't like to explode at the wrong time, would it? Of course not, says Bomb 20, but as it had admitted before that it had no proof that the outer world does exist. 9 seconds, says Bomb 20, and my memory is very good. It has no proof that the orders are either wrong or correct. Bomb 20 goes back inside Dark Space to think futher about the matter. Doolittle tries to rescue Tanby, who was shot out of Dark Space. Now, Bomb 20 thinks that no order coming from the outer world can be reliable, so it explodes itself happily although Pinback tries to reason with it. Tanby and Doolittle are left stranded floating in space. Powell goes flying away wrapped in a bath of ice. Doolittle falls to the planet they wanted to destroy, Tangy gets kida trapped in a travelling concusion of lights, so that he'll be travelling through the universe forever. Doolittle uses a piece of debris to surf down to the red planet. ---written by KrystelClaire",
      "writers": [
         "John Carpenter",
         "Dan O'Bannon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069945/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwODkwMzk1M15BMl5BanBnXkFtZTcwMjc4ODY3Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Dan O'Bannon, Dre Pahich, Brian Narelle | See full cast and crew »"],
      "reviews": [
         "I saw this film as a kid, dismissed it as boring, and moved on. Luckily, fate forced me to see it again about 2 years ago and (some are going to hate me for this) now i consider it second only to Kubrick's 2001:A Space Odyssey. The scope is gigantic, even though we're trapped inside the goofy little ship with these rejects (and they ARE rejects). It is a spoof of man's uninformed view of his place in the universe. It is filled to capacity with malfunctioning technology, illogical solutions to self-inflicted conflicts and a very genuine feeling of the isolation of deep space. The music (John Carpenter is an innovator in film scoring) is strange and often indistinguishable from the zany noises of the ship's equipment and displays (who would ever create such tortuous bleeps and sirens for EVERY function of a spacecraft designed to house a couple of guys in the outermost regions of the galaxy?). The ship's computer is a perfect contast of Hal9000 (2001) in that SHE seems to understand her crew's dimwitted plight and ,after speaking to them in her programmed monotone, recognizes the need to go back and dumb herself down so that they can function accordingly. It is never explained whether she has assumed a mother-figure role or is simply acting out of self-preservation ,but ,like most of the more thought-provoking elements of this absurdist's fantasy, the viewer is merely given the bare-bones information and allowed to decide for itself. Maybe all of this implied data caused me to make the movie better in my head than it actually is ,but how many films have you seen lately that can give you that freedom?",
         "John Carpenter's feature debut 'Dark Star' is an absolutely brilliant little curio, that'll make you laugh and laugh. I first saw the film on England's Channel 4 a few years back, and remember wondering what the hell I was watching. I quickly tracked down a copy and rewatched it to see if it was really THAT good... The story involves a bunch of astronauts who have been in space for many years: they spend their time blowing up unstable planets and rocking out to surf music. During this time, an alien (that looks suspiciously like a beach ball) runs riot, and an unruly bomb threatens to blow everyone to smithereens. 'Alien' screenwriter Dan O'Bannon wrote 'Dark Star', and clearly borrowed from it for the 1979 Ridley Scott film - taking the hilarious beach-ball sequence and playing it out for tension rather than laughs. Also a big influence on the TV series 'Red Dwarf'. Check it out if you're a fan of science fiction or a fan of John Carpenter. 10/10. An underrated classic.",
         "Dark Star (1974) was a student film that John Carpenter and Dan O'Bannon worked on while they were in college. They later found a film distributor who asked them to expand it to feature film length. The movie takes place in a small, cramped out of date spacecraft. Several astronauts are on board (who have been around each other to long) trying to complete their mission of destroying unstable planets. I found this film to be very entertaining and bizarre. I enjoyed it very much. The highlight of this film is when a computerized bomb decides that he doesn't want to take orders from the astronauts anymore and ponders the meaning of life. Highly recommended, but it's not your average Sci-Fi film. A.",
         "I first saw Dark Star about 25 years ago and have enthused about it ever since. It's definitely a movie that you've got to be in the mind for but it is funny, the music has the characteristic Carpenter style, is very hippyish in a lot of ways and the low-budget style works very well. The alien is great - apparently its feet are the ones used in \"The Creature From The Black Lagoon\" It's a shame the DVD doesn't have any extras. I suppose there isn't much left lying around for them to use! It's also incredible to think that it was only 5 years between the release of this and the release of Alien. Pinback is one of the characters in Dark Star, played by Dan O'Bannon and he is also the co-writer. Then he went on to write Alien! Do see this film - but be in a laid-back mood when you do.",
         "A Great Movie, i think it was made in Film School and is the first Movie available by John Carpenter.. The great thing besides the Humor, are those little typical low-budget Mistakes like the actor in the \"lift\" scene who is pretty clearly just lying on a common Floor.. The \"mOnster\" is amazing too its funny to see how a Ball with gloves can actually act, and a little music makes it scary.. The Last Scene is clearly inspired by Ray Bradburys (Fahrenheit 451) Short Story \"Kaleidoscope\".. Sorry for my poor English, but i just had to write something to this incredible piece of film..",
         "\"Don't give me any of that intelligent life stuff, give me something I can blow up!\" Doolittle. Lieutenant Doolittle is in charge of 'Dark Star', a ship on a lonely mission to destroy unstable planets in systems targeted for colonisation. The ship has been on it's mission for twenty years, but the crew have only aged three years. Doolittle has been in charge since an explosion killed Commander Powell, rendered the sleeping quarters uninhabitable and destroyed the ship's entire supply of toilet paper. In order to deal with the excruciating boredom of the mission and the frustration at having only three other astronauts for company the ship's computer, which has an alluringly soothing and sexy female voice, pipes in muzak and easy listening jazz. Doolittle misses surfing. Boiler has taken to shooting holes in things. Talby lives in isolation in the the observation dome. Pinback isn't really Pinback, not that anyone even cares. Excitement arrives when an asteroid inflicts damage on the ship's systems, prematurely activating one of the highly intelligent, eager and earnest planet killer bombs. To complicate things the alien needs feeding, and Bomb 20 just wants to do its job and is getting increasingly frustrated and belligerent. \"Bomb, are you willing to entertain a few concepts?\" Doolittle \"I am always receptive to suggestions!\" Bomb 20 'Dark Star' was made in 1974, initially as a college project, and launched the careers of John Carpenter and Dan O'Bannon, amongst others (Tommy Lee Wallace and Nick Castle, long term Carpenter collaborators both, worked on 'Dark Star' and the ship's interior and exterior were designed by the great Ron Cobb). From the very start Carpenter's style is evident, the widescreen image is utilised to absolute maximum effect without a bit of wasted space on screen, the signature electronic music is present throughout (with the exception of the cheerfully optimistic trucker song 'Benson, Arizona' which serves as title song), and the pacing and editing are perfect. The film is not boring for a minute despite the lack of resources. The special effects, while cheap and cheerful, serve the film perfectly (I've always managed to suspend disbelief more easily in the face of cheap practical effects than I have when faced with unconvincing computer generated effects), particularly the psychedelic hyperspace sequences. The film as a whole is a tour de force of tricks and gags, a veritable 'How To' of practical effects that, once staples of cinema, are now being superseded by CGI. 'Dark Star' has influenced science fiction film-making ever since and just as 'Dark Star' tips it's hat to it's inspirations (for example 'THX1138'), it in turn will be referenced for many years to come. I can't tell you how much I love this film. It's funny and moving (Pinback's video diary is burned in my memory), and, a groundbreaking movie in 1974, it still feels fresh 31 years later. The product of post-Vietnam and Watergate era America it still resonates today because in an age of ever smarter bombs and increasingly advanced technology we remain at the mercy of chance and human frailty. It's also the only film in history to feature a man discussing phenomenology with a bomb. Priceless! A perfect ten out of ten.",
         "It all started out as a short film made at film school made by the now legendary John Carpetenter, but then they wanted to make a longer version, however they couldn't get money to remake it, so they simply added extra scenes in the middle (example, the beach ball alien). The story is this, on a ship where the captain is dead (but you can unfreeze to ask him questions) and the rest crew are going basically crazy they have problem. One of their bombs has become sentient and is busy contemplating the nature of existence. The effects are OK, and who would have thought the beach ball would become the inspriration for the movie Alien. Over all one of the great classics of science fiction and of low budget film making. I heard of this movie a long time ago and it took me over 10 years before I finally found it in my local video shop. Great and amazing movie. What will bomb number 20 do, now it is intelligent...watch the film and find out.",
         "When one takes into account that this was the first real film venture of John Carpenter and Dan O' Bannon, two incredibly influential and talented movie personas, Dark Star is not all that bad. It has some imaginative camera shots, an intriguing storyline, and some unique, definitely not mainstream humour. The story about the humdrum nature of flying in space for an interminable time has several layers peeled in the script. If I judged the film solely on those merits, it would indeed do well. However, the film has a snail's pace and some uneven plot twists, not to mention some not very good acting. Many of Carpenter's soon-to-be-signature trademarks are clearly evident in this film. No denying it, the man has talent. The film was made with a shoestring budget, but Carpenter and crew do a workmanlike job with the resources they had. Clearly, the greatest appreciation for this film is not for the product itself but for the potential and early, evident development of Carpenter and to a lesser degree O' Bannon.",
         "I saw this movie for the first time at the USA Film Festival. Held here in Big D every spring, the USAFF showcases films produced here in the USA. (No foreign films) Each night they would show two new films, plus a retrospective film from the actor or director being honored that year. After the film, the film critic who selected the film would interview one or more of the people involved with the film's production. Towards the end of the week, I arrived at the Bob Hope Theatre (on the SMU campus) to find a notice on the chalkboard: one of the films had cancelled out, and \"Dark Star\" a \"sci-fi comedy\" would be shown in its place. Bringing science fiction and comedy together is a tricky business: usually either the SF content or the humor suffers. Or both. I ended up being pleasantly surprised. The special effects were a little cheesy (Carpenter originally shot it as a film student, on a film students \"budget\"), but the characters were funny, and they got off some nice riffs. Carpenter and O'Bannon (who also co-wrote the first \"Alien\" movie) produce a collection of odd characters on an extended mission. For the last 20 years they've been travelling the galaxies in search of \"unstable planets\" to destroy. Unfortunately, the crew is falling apart. Boredom, apathy, mechanical malfunctions and a puckish alien mascot ensure that things only get worse and worse. There's a clever parody of a scene from \"2001\" occurs when one of the bombs can't be released and has to be talked out of exploding. And there's a reverse reference to one of O'Bannon's own script for \"Alien\" when the alien gets free and one of the crew has to track the thing down. (O'Bannon refers to this as \"Alien\" turned upside-down: instead of the alien chasing the crew, one of the crew chases the alien) Lots of fun. Eight stars.",
         "I, too, caught this one on a Late Late Movie airing. What a hidden gem! The production value may be about what you'd expect from low budget early 70's Science Fiction, but it hardly detracts from the great writing and direction. It kept amazing me with the way it could deliver some of the best lines with such a wry subtleness that really impressed me. The metaphysical discussion at the end was classic and Pinback's past was also brilliantly done. The ending was a bit cheesy, but alien beachballs, campy explosions, and an absurdly sized ship model aside, this movie is genius."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Jack H. Harris Enterprises",
         "University of Southern California (USC)"
      ],
      "summaries": [
         "Low-budget story of four astronauts in deep space, whose mission is to destroy unstable planets in star systems which are to be colonised. The late Commander Powell is stored in deep freeze, where he is still able to offer advice. As their mission nears completion, they must cope with a runaway alien which resembles a beach-ball, faulty computer systems, and a \"smart bomb\" who thinks it is God.",
         "The crew of the Dark Star are on a 20 year mission to clear a path in space by destroying planets that are in the way of navigation routes. After a series of mishaps Mother, the ships computer, can no longer persuade Bomb not to detonate. Even the dead captain is of little help in arguing with Bomb who is bound to do his duty.",
         "In the far reaches of space, a small crew, 20 years into their solitary mission, find things beginning to go hilariously wrong."
      ],
      "budget": 60000
   },
   "movielensId": 26285,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-04-01",
      "dvdReleaseDate": "1999-03-23",
      "directors": ["John Carpenter"],
      "runtime": 83,
      "movieId": 26285,
      "title": "Dark Star",
      "mpaa": "G",
      "actors": [
         "Brian Narelle",
         "Cal Kuniholm",
         "Dan O'Bannon",
         "Dre Pahich",
         "Adam Beckenbaugh",
         "Nick Castle",
         "Joe Saunders",
         "Cookie Knapp",
         "Alan Sheretz"
      ],
      "imdbMovieId": "0069945",
      "originalTitle": "Dark Star",
      "genres": [
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A low-budget, sci-fi satire that focuses on a group of scientists whose mission is to destroy unstable planets. 20 years into their mission, they have battle their alien mascot, that resembles a beach ball, as well as a \"sensitive\" and intelligent bombing device that starts to question the meaning of its existence.",
      "tmdbMovieId": 1410,
      "avgRating": 3.42912,
      "releaseYear": "1974",
      "numRatings": 522,
      "posterPath": "/eeoSwN8l0mj1gEzRzmXvoAUXxDh.jpg"
   }
}