{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "composer",
            "id": 1233
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "jail",
            "id": 9890
         },
         {
            "name": "gift",
            "id": 9989
         },
         {
            "name": "pianist",
            "id": 14743
         },
         {
            "name": "english",
            "id": 14744
         }
      ],
      "imdb_id": "tt0149723",
      "video": false,
      "title": "Besieged",
      "recommendations": [
         106222,
         26195,
         25985,
         465,
         31875,
         117233,
         51230,
         69906,
         126321
      ],
      "backdrop_path": "/ubyuAH3SLRtpoByanX6h3hfE0uw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Shandurai",
               "gender": 1,
               "credit_id": "52fe4683c3a36847f81030f5",
               "name": "Thandie Newton",
               "profile_path": "/sW6XsnM2DkX6ujOXZ38aIQAMIWi.jpg",
               "id": 9030,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jason Kinsky",
               "gender": 2,
               "credit_id": "52fe4683c3a36847f81030f9",
               "name": "David Thewlis",
               "profile_path": "/lWCGcTKvr4QUi8MvFBleMw8xY8.jpg",
               "id": 11207,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Agostino",
               "gender": 2,
               "credit_id": "5485e204c3a3680b360037f8",
               "name": "Claudio Santamaria",
               "profile_path": "/9jpxCLE19Q2oGxCcxWRJph5hvVc.jpg",
               "id": 76339,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Singer",
               "gender": 0,
               "credit_id": "5485e2109251416a60003480",
               "name": "John C. Ojwang",
               "profile_path": null,
               "id": 1396570,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Patient",
               "gender": 0,
               "credit_id": "5485e21e9251416a6f002f3f",
               "name": "Massimo De Rossi",
               "profile_path": "/qLWsRll1YYZahmthBh4REMyO2VR.jpg",
               "id": 32087,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4683c3a36847f81030ff",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5485e1de9251416a720031fa",
               "name": "Clare Peploe",
               "profile_path": "/fKMr5Lo28D6rOsUeNVEEL5E5ucg.jpg",
               "id": 133420,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5485e1e99251416a6600321f",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5485e1f59251416a720031fd",
               "name": "James Lasdun",
               "profile_path": null,
               "id": 1052041,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.845754,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 44297,
      "vote_count": 18,
      "budget": 0,
      "overview": "When an African dictator jails her husband, Shandurai goes into exile in Italy, studying medicine and keeping house for Mr. Kinsky, an eccentric English pianist and composer. She lives in one room of his Roman palazzo. He besieges her with flowers, gifts, and music, declaring passionately that he loves her, would go to Africa with her, would do anything for her. \"What do you know of Africa?,\" she asks, then, in anguish, shouts, \"Get my husband out of jail!\" The rest of the film plays out the implications of this scene and leaves Shandurai with a choice.",
      "similar": [
         24420,
         1024,
         1643,
         158907,
         17612,
         1903,
         50546,
         46705,
         38,
         86331,
         979,
         313369,
         1259,
         276,
         226,
         225886,
         2057,
         11121,
         72207,
         17609
      ],
      "original_title": "L'assedio",
      "runtime": 93,
      "poster_path": "/e0WeMiSyULbRHt33gkpnYgLrTRq.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Kiswahili",
            "iso_639_1": "sw"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mediaset",
            "id": 1677,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fiction Films",
            "id": 20783,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Navert Film",
            "id": 40768,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-14",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Touched by Genius. Cursed by Madness. Blinded by Love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bernardo Bertolucci"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Clare Peploe",
         "Bernardo Bertolucci"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0149723/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0Nzk2MDE5M15BMl5BanBnXkFtZTcwNjQzNDAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Thandie Newton, David Thewlis, Claudio Santamaria | See full cast and crew »"],
      "reviews": [
         "During the first twenty minutes or so of `Besieged,' directed by Bernardo Bertolucci, there is virtually no dialogue, at least nothing even remotely conversational; and yet the first half hour of the film is almost hypnotically riveting, and by that point you already know more about the two main characters than if they'd had pages worth of words to say. And it's all done with the subtle, controlled emoting of the actors, guided by a director with a keen eye for detail, who knows exactly what he wants, how to get it and how to present it. This emotionally involving film stars Thandie Newton as Shandurai, a young woman forced to leave South Africa for Rome after her husband, a school teacher, is arrested by the Military Police, then summarily held in prison-- and without a trial-- indefinitely (His crime is never precisely indicated, though it is implied during a classroom scene at the very beginning of the film). In Rome, Shandurai attends medical school, while supporting herself by working as a housekeeper for a man named Mr. Kinsky (David Thewlis), a reclusive pianist, apparently fairly well-to-do, who gives piano lessons to children in his home. Early on in the film it is evident that Mr. Kinsky looks upon Shandurai as something more than merely a housekeeper; he is obviously quite taken with her. The moral implications of the situation are readily apparent, of course, as is the position in which it will predictably place Shandurai at some point in the near future. There is little doubt as to the direction the story is taking; the question that remains, however, is how Shandurai will deal with her impending dilemma. The story becomes even more engaging as matters are pressed and circumstances develop which make Shandurai's conundrum even more of a moral miasma. Bertolucci draws his audience in by creating a situation so emotionally complex that at times it fairly resonates on the screen. And rather than allowing it to become simply a test of love and loyalty, he takes it much deeper-- so that the real impact of the film stems from the respective stances taken by Shandurai and Mr. Kinsky, as they strive to resolve their personal feelings while attempting to satisfactorily breach this seemingly insurmountable situation. Bertolucci draws a delicate line on which he balances the emotions, actions and reactions of his characters, which pays off handsomely in the end. The overall success of the film, however, is predicated upon on thing-- that being the performances of Newton and Thewlis; and both deliver, unequivocally. Newton's role is especially challenging, as she has to convey so much through her emotions alone. Her gestures, expressions and mannerisms are her words; and the slightest alteration of any of these-- the slightest arch of an eyebrow, a shifting of the eyes at a particular moment or a barely discernible movement of her lips-- speaks volumes. And for this to be effective, it had to come from a place deep within; mere surface theatrics or any hint of pretentiousness at any time would have dispelled the believability of the character at once-- and Newton not only prevails, but does so overwhelmingly. It's an extremely well realized portrayal of a woman in conflict, facing one of the greatest trials of her life. Thewlis, as well, gives a resoundingly sympathetic performance as Mr. Kinsky, that would have to be ranked among the best work he's ever done. As with Newton's role, he must convey so much physically, and he does-- turning in a very sensitive, well defined performance through which he employs just the right amount of reserve and restraint as befits the character he is creating. It's an affecting, honest portrayal that makes Mr. Kinsky very real and believable. The supporting cast includes Claudio Santamaria, John C. Ojwang, Massimo De Rossi, Cyril Nri, Paul Osul and Veronica Lazar. Artistically rendered and subtle in nuance, `Besieged' explores the parameters of love and measures the limits of the boundaries expressed by the heart. An insightful treatise on human nature, it removes one emotional layer after another, right up to the very end-- which is a moment of truth nothing less than sublime. And one that will keep this film in your memory long after the screen has gone dark. I rate this one 8/10.",
         "Take everything you ever knew about Hollywood and filmdom and flush it. Open you mind and your heart and, if you're lucky, \"Besieged\" will speak to you of love like no other. Make no mistake, this film is not about romance or sex or even closeness. It is about what love should be; pure, unsolicited, unencumbered giving. It is a sad testament to the shallowness of popular concepts of giving-to-get love that this film received lukewarm reviews, one star from Ebert, and a mere 6.5 by IMDB.com users. Sometimes the only way to love someone is to set them free.",
         "What to say? Besieged is a timeless, unabashedly romantic masterpiece. Poetic and original, this movie studies two people locked in a slow dance of seduction. Based on James Lasdun's short story, \"The Siege\", the film reveals that love need not not be reduced to self-satisfaction and immediate gratification or communication to trifling words. Can love transcend ostensibly insurmountable objects before the principle characters (such as the dizzying height of the spiral staircase)? Perhaps. One thing is for sure: this film will strike a resounding chord in your heart! Not only does the glorious music speak volumes of the character and background of Mr. Kinsky, a wealthy European pianist, and his live-in housekeeper, Shandurai, it also pitch-perfectly articulates feelings too buried for either to verbalize. Indeed, when used as a medium to express emotions, music is much more effective than words. In the few instances they make eye contact, words seem to be superfluous. With minimal dialogue, it's incredible how Shandurai and Kinsky find ways to communicate and impact the other's life. The collision of their two worlds is celebrated in the hauntingly beautiful piece Kinsky composes for Shandurai,\"Ostinato\". The sounds and the deafening silences, the sights and the suspicious disappearances are all exquisitely executed by Bertolucci. With Claire Peploe, he fashions a tale that is at once simple and profound. Bringing the story to life is a powerhouse cast. Thandie Newton as the beleaguered and reticent Shandurai is a revelation. David Thewlis as the lovelorn, crafty, idiosyncratic ideograph Kinsky is way beyond \"good enough\". His portrayal of a man who achieves liberation through sacrifice is captivating. Also marvellous are the performances of John C. Ojwang as the griot and Claudio Santamaria as the buddy. Unlike the majority of movies that will be released this year, this one will etch an indelible impression on your mind and spirit. But now I've said too much?",
         "After the first few minutes I knew I could just relax and enjoy this film -- that it would be well-acted, subtle, visually appealing and well-edited. Bertolucci presents an engaging variation of a love triangle with his characteristic sensitivity and attention to detail. How wonderful to see a film in which the range of human emotions is revealed by acting instead of with clumsy or forced dialogue. We see his hand linger on her dress draped over a chair in her vacant room, her evolving and conflicting attraction and doubts shown in her gestures and expressions -- nothing overstated, much left to the imagination. The musical score (Chopin, Coltrane, Keita and others) is in itself totally enjoyable as it binds together the images and themes of this fine film. Bertolucci's editing is superb. The film's climax and ending are, well, perfect. Nine out of ten, maybe more -- I'll be seeing it again soon.",
         "SLIGHT SPOILERS I can't fairly claim Bernardo Bertolucci as one of my favorite filmmakers, because I've seen relatively few of his films. However, he did make my third favorite film of all time, Last Tango in Paris. Besides Besieged, the only other film of his I'd seen was The Last Emperor, which I like very much, also. Now, I vividly remember seeing the episode of Siskel & Ebert (or whatever it was called at the time that this film was released) and hearing Ebert proclaim that Besieged was racist and crying, \"What has happened to Bertolucci? He used to make these beautiful and personal films!\" I want to know what the hell movie he saw in place of Besieged, because the Besieged I saw was \"beautiful and personal,\" and it was certainly not \"racist.\" The film is about an African woman (Thandie Newton, who was later to star opposite Tom Cruise in Mission Impossible II, which I now have to see) whose husband was arrested for political reasons (we're never really told in which country they lived, nor is the political climate explained or described). Some time late (that, too, is unspecified), she immigrates to Italy where she is hired as a live-in maid by an English pianist (David Thewlis). He is extraordinarily shy and inhibited; he barely even leaves his lavish home. Soon, he is attracted to Newton's exoticism and tells her he is in love with her, even asks her to marry him. She's terribly offended and feels used: she shouts that she already has a husband, and that he was arrested in Africa. Thewlis yields from his pursuit, and, because of his guilt (and also because he is still attracted to her), he begins on a quest to find and set free Newton's husband. What results is one of the more complex films of the past few years. The art film is not dead. Bertolucci's direction is filled with interesting angles, camera movements, colors, jump cuts, and all sorts of beautiful and effective tricks. The only thing I didn't like was the use of slow motion - that's one technique that is difficult to use well in the cinema, and, with hand-held cameras, it looks awful. A couple of individual scenes were clunky, especially the scene in which Thewlis declares his love for Newton. It's not bad, per se, but, well, like I said, it's a bit clunky, if you know what I mean. It doesn't work completely. The film relies on very little dialogue, which makes the whole thing more sublime. Thandie Newton and David Thewlis are both excellent. I can't wait to see Newton in other films. To answer Ebert's claim of racism, if he had said that Thewlis' character was a racist, then that would have been understandable. His \"love\" is just lust, and what he is really attracted to is her Africanness, her exoticness. And also her perceived primitiveness. This is not an uncommon attraction, even if it is offensive. But these feelings are actually DEALT with, they're not just simply accepted. Ebert also said that the goal of the film, its entire point, was to get to the sex. Not so. The way Thewlis uses and manipulates Newton caused me pain. It caused HER pain. The final scene is just overflowing with power. I loved this film. Please see it and see it with an open mind. 9/10.",
         "We have a glimpse of Shandurai's environment in a central African nation where the ruthless military politics take over and screw up her life. Welcome to Bertolucci territory you may think? Not so, we keep clear of the politics and arrive in Italy where Shandurai finds refuge as a maid cleaning a neglected household run by an eccentric lay-about British piano player. Now you may think we have the wrong film! Yes, it is a Bertolucci movie without the Tango In Paris. This is simple Bertolucci at his best. It's about conquering unwanted love the old fashion way, dealt with a sense of mystery and plenty of patience. All the imagery elements fall into place as we journey with Shandurai and her decision. Effective in every way right through to the performances of Newton and Thewlis. A very pleasing film on the senses thanks to Bertolucci who has ventured into the basic fundamentals of low budget cinema.",
         "I thought this was an extraordinarily beautiful film. The care and complexity of the cinematography was truly breathtaking. The acting was superb as well. I couldn't help feeling, though, that the emotion at the core (Kinsky's \"love\" of Shandurai) was more an evocation of an older man's (Bertolucci's) fantasy world of women. I found the emotional exploitation of Shandurai unpardonable. Here is a woman who has lost everything, and then gives up her respect and dignity because her employer gets her husband out of jail (the image of her sneaking into his bed, giving herself to him like a servant was belittling). I would have found the film truly bittersweet and empowering had Kinsky sacrificed so much and gained nothing.",
         "Glad I did not listen to Roger Ebert's review.Well he gave two thumb's up for Speed 2(that says a lot in itself).This movie represents true cinema.The camera movements are very hypnotic and the performances are truly truly captivating.The other movie in recent years that impressed me this much was cinema paradiso.",
         "What a lovely film this is! I usually do not go for the kind of heavy-handed aestheticism Bertolucci has been partial to in his last few movies (\"Stealing Beauty\", \"Little Buddha\", \"The Last Emperor\" et al.), so imagine my surprise when this movie turned out to be an exquisitely rendered intimate love story. There are basically only two main characters: Jason Kinsky, a reclusive expatriate British pianist in Rome with an uncertain past (played here with great delicacy and understated charm by David Thewlis, in a 180 degree turnabout from the profane misanthrope he played in \"Naked\"), and Thandie Newton's Shandurai, his African housekeeper, who fled her strife-torn native country to train as a medical doctor in Rome while supporting herself by performing domestic drudgery. The striking, almost wordless opening sequence serves as an introduction to Shandurai's past. Then the camera rapidly cuts to the present day Rome, where already besotted Kinsky orbits around his beautiful and distant housekeeper, not realizing that her nights are tormented by the memory of her husband, a political prisoner left back in Africa. When Kinky approaches Shandurai with a hasty declaration, he is met with a steely and passionate resistance. Chastened, he retreats into a polite distance from the object of his desire. But from then on, nothing goes as expected. For the rest of the movie is about the change in the balance of this relationship, and the singular way through which the capitulation of Shandurai is achieved. The central sacrifice in the story is a grand romantic gesture of Gastbian proportion, simultaneously selfless and selfish. I was completely enthralled at the way this movie unraveled itself, layer by delicate layer, with little dialogue but with a kaleidoscope of imagery and most of all, with music. Bertolucci is frequently obssessed with his heroine's beauty, and this is no exception. The camera frequently lingers on the gentle curve of Newton's arm, the slope of her back, and on her great dark eyes. However, Bertolucci has for once given us a compelling female character, a woman of determination as well as beauty, unlike his usual bevy of vacuous/self destructive mannequins (e.g. Liv Tyler in \"Stealing Beauty\", Dominique Sanda in \"1900\", etc). Shandurai's new-world vigor and her sense of purpose contrast starkly with Kinsky's aimlessness, his solitude, and especially his music, which permeates the movie with exquisite melancholy (the music consists mainly of solo piano pieces by Bach, Chopin, Scrabin and Coltrane). Likewise, the effect of their relationship on Kinsky is expressed most effectively through the transformation in his music, as primitive beats of Africa are blended into the lyricism of Kinsky's composition. The movie is short, sparse and as different as night and day from the usually action-driven fares of Hollywood. Bertolucci, in a rare form, has fashioned a truly adult film that deftly navigates through the complexities of the human heart.",
         "It's refreshing to have a film that has no special effects, does not have to deliver every word, tell you every step of the plot -- the plot line is implied. It is by showing what is happening and letting us the audience connect the frames. This film \"L'assedio\" (The Siege) is more visually expressed vs. through articulating dialog. We are presented with scenes, imageries, expressions, wide or high angle shots through perceptive conscious editing. I especially noted the repeats of the beautiful shadow pattern of the spiral railing leafy design -- 'besieged' in a rather elegant environment (perhaps evident to the audience more than to the central character herself). The besiegement is not exactly physical, it is more of the internal emotional dilemma and struggles our heroine feels. We are shown the various artistic collections and beauty of things around the house as we follow her housekeeping routines. She could very well be too wrapped up in her own world (pursuing her medical studies, preparing for exams, and her flashbacks/dreams of homeland events in Africa) and opened herself not to the other person or what's really around her. The opening sequence is actually a critical flashback for our heroine Shandurai, portrayed by Thandie Newton (w-d John Duigan's \"Flirting\" 1989; Jonathan Demme's \"Beloved\" 1998 with Oprah Winfrey). David Thewlis (w-d Mike Leigh's \"Naked\" 1993; Jean-Jacque Annaud's \"Seven Years in Tibet\" 1997 as Brad Pitt's adventurous companion) is Mr. Kinsky, the other part of the quotient in this fable like story that Bertolucci interweaved. Shandurai was from Africa and is now a medical student in Rome, staying at Mr. Kinsky's house where she does daily housekeeping chores in exchange for her own room and board. There is also a \"beseeching\" undertone to this tale. He (Mr. Kinsky) the solitary composer/pianist in want of her love. She (Shadurai) the solitary soul 'exiled' from home (Africa) in want of the freedom of her loved one. Trust -- a human dilemma? How do you trust a stranger? Does the person really listen to you? Does s/he hear what you're saying? Trust in another person, a total stranger, is not easy to come by. Society has made it a norm that you have to earn it -- trust. If you say something or make a request, you don't really expect it to come true. That the other person actually listened and took it to heart and do something about it to make a wish happen is only in dreams! Well, whole-hearted loving is possible and we should not take things for granted. There are no extraneous frames here. Visual and sound (the music, the piano pieces) are both purposefully fulfilling in unraveling the story. Thewlis delivered a superb subtle performance. Newton followed up her \"Beloved\" role with equal concentration. Bertolucci weaved his magic once again. What a statement -- what a story he has given us! A beautiful film. A fable, indeed. The wonderful photography (cinematography by Fabio Cianchetti), especially the use of cast shadows reminded me of the silent B/W German classics by Robert Wiene, \"The Cabinet of Dr. Caligari\" 1919, in which shadows were used thematically in repeated graphic forms -- very effective filmmaking."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Fiction Films",
         "Navert Film",
         "Mediaset"
      ],
      "summaries": ["When an African dictator jails her husband, Shandurai goes into exile in Italy, studying medicine and keeping house for Mr. Kinsky, an eccentric English pianist and composer. She lives in one room of his Roman palazzo. He besieges her with flowers, gifts, and music, declaring passionately that he loves her, would go to Africa with her, would do anything for her. \"What do you know of Africa?,\" she asks, then, in anguish, shouts, \"Get my husband out of jail!\" The rest of the film plays out the implications of this scene and leaves Shandurai with a choice."],
      "budget": 0
   },
   "movielensId": 2630,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Kiswahili"
      ],
      "releaseDate": "1998-09-14",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["Bernardo Bertolucci"],
      "runtime": 93,
      "movieId": 2630,
      "title": "Besieged",
      "mpaa": null,
      "actors": [
         "Thandie Newton",
         "David Thewlis",
         "Claudio Santamaria",
         "John C. Ojwang",
         "Massimo De Rossi"
      ],
      "imdbMovieId": "0149723",
      "originalTitle": "L'assedio",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["i8bVItO9j9A"],
      "plotSummary": "When an African dictator jails her husband, Shandurai goes into exile in Italy, studying medicine and keeping house for Mr. Kinsky, an eccentric English pianist and composer. She lives in one room of his Roman palazzo. He besieges her with flowers, gifts, and music, declaring passionately that he loves her, would go to Africa with her, would do anything for her. \"What do you know of Africa?,\" she asks, then, in anguish, shouts, \"Get my husband out of jail!\" The rest of the film plays out the implications of this scene and leaves Shandurai with a choice.",
      "tmdbMovieId": 44297,
      "avgRating": 3.52561,
      "releaseYear": "1998",
      "numRatings": 410,
      "posterPath": "/e0WeMiSyULbRHt33gkpnYgLrTRq.jpg"
   }
}