{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "commercial",
            "id": 1004
         },
         {
            "name": "television",
            "id": 2136
         },
         {
            "name": "parody",
            "id": 9755
         }
      ],
      "imdb_id": "tt0071583",
      "video": false,
      "title": "The Groove Tube",
      "recommendations": [38916],
      "backdrop_path": "/A3FJRSQurWLZjvKugxurdnjuYzW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ko-ko / Boss / 'Near You' Singer / Robert Elgin / Mahetma Yenta / Lionel Elgin / Dancing Man",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b25d",
               "name": "Ken Shapiro",
               "profile_path": null,
               "id": 99339,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "The Fingers / Geritan / Four Leaf Clover",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b279",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Rodriguez / Leo Batfish / The President / The Hooker",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b27d",
               "name": "Richard Belzer",
               "profile_path": "/r9X9FzyYlYt20rfl0wUmgRAl5gg.jpg",
               "id": 32396,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "The Hitchhiker",
               "gender": 0,
               "credit_id": "57891fd7c3a3681917002c68",
               "name": "Buzzy Linhart",
               "profile_path": null,
               "id": 1650959,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "The Girl",
               "gender": 0,
               "credit_id": "57891ffcc3a36835fa00284f",
               "name": "Richmond Baier",
               "profile_path": null,
               "id": 1650960,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "The Rich Guy",
               "gender": 0,
               "credit_id": "58b076a3c3a3682d1000f7fd",
               "name": "Berkeley Harris",
               "profile_path": null,
               "id": 1764869,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "The Geritan Girl",
               "gender": 1,
               "credit_id": "58e79108c3a36872ee054841",
               "name": "Jennifer Welles",
               "profile_path": "/cmkJYXYBVqRZtVZ1dhRu6Kfdd0l.jpg",
               "id": 104531,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Food for Thought",
               "gender": 0,
               "credit_id": "58e78f9f9251412810051bea",
               "name": "Dennis Helfend",
               "profile_path": null,
               "id": 229700,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Sex Olypmics",
               "gender": 1,
               "credit_id": "58e78faac3a36872ee054749",
               "name": "Mary Mendum",
               "profile_path": "/lxJXgen6WQrcE28vghgF9CcPGN5.jpg",
               "id": 1137846,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Butz Beer (as Marty Cove)",
               "gender": 2,
               "credit_id": "58e78fbfc3a36872f6050992",
               "name": "Martin Kove",
               "profile_path": "/bdhzH4rNedFA2SpAQSfkBZ11VxC.jpg",
               "id": 56117,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b263",
               "name": "Ken Shapiro",
               "profile_path": null,
               "id": 99339,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b269",
               "name": "Ken Shapiro",
               "profile_path": null,
               "id": 99339,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b26f",
               "name": "Ken Shapiro",
               "profile_path": null,
               "id": 99339,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4571c3a368484e05b275",
               "name": "Lane Sarasohn",
               "profile_path": null,
               "id": 99453,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.574611,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27977,
      "vote_count": 4,
      "budget": 0,
      "overview": "Chevy Chase makes his film debut in this riotous collection of live skits. Directed by Ken Shapiro and featuring Chase, Richard Belzer and others, The Groove Tube mocks TV Land and its trappings by spoofing kids' shows -- from a marijuana-smoking Koko the Clown who resides in Make Believe Land, to Safety Sam, the penis with a plan who gleefully informs the audience of the perils of casual sex.",
      "similar": [
         11598,
         4258,
         714,
         7446,
         4638,
         9255,
         808,
         813,
         19908,
         10986,
         109414,
         914,
         64688,
         10774,
         563,
         7461,
         241,
         14,
         3176,
         17654
      ],
      "original_title": "The Groove Tube",
      "runtime": 75,
      "poster_path": "/vqavLV59So2EPCCDBGhTPXX50JM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Syn-Frank Enterprises",
         "id": 4742,
         "origin_country": ""
      }],
      "release_date": "1974-06-23",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ken Shapiro"],
      "runtime": 75,
      "synopsis": "\"The Groove Tube\" is a collection of sketches unified as programming for the imaginary Channel One. It opens with a 2001-inspired sequence of primitive humans encountering a TV set, leading to the discovery of partying and then of fire. It moves quickly to a playful strip sequence with full nudity (male and female) and a meeting with the police. The first dialogue belongs to Director and star Ken Shapiro as Koko the Clown, host of a children's show where 'imagination time' is viewer requested readings of sexual passages from literature. Shapiro also appears as one of the leads in the \"Dealers\", a drug dealing story with a message, and as both the Anchor and a correspondent of the Channel 1 news team, among other roles. Richard Belzer appears with him often, including as Shapiro's sidekick (and the unwitting object of his sexual affection) in the Dealers and in the news as a black transvestite prostitute picked up by the Cultural Correspondent in a color story on the underside of New York. The programming has many other shows and a large number of commercials, including a scene involving two pairs of fingers (both belonging to Chevy Chase) walking, but not talking: the campaign tag line is \"Let your fingers do it.\" There is a also a series of commercials from Uranus Corporation, \"Where things come out a bit differently\", one lauding the miracle product \"Brown-25\", another admitting responsibility for the destruction of the \"mighty Mayopac River\" on which their chemical processing plant sits. There is also more nudity, including a public service announcement on STDs featuring a muppet-like character that is actually an upside-down penis.",
      "writers": [
         "Lane Sarasohn",
         "Ken Shapiro"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071583/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMDE3MzgwOF5BMl5BanBnXkFtZTcwMzU0NjgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ken Shapiro, Richard Belzer, Chevy Chase | See full cast and crew »"],
      "reviews": [
         "How can a movie that features the singing of Curtis Mayfield be bad? It can't! The Groove Tube is a series of scatological black-out sketches that makes fun of anything from 2001 to the olympics. The highs, (Koko the clown, the easy lube recipe) outnumber the lows (an all too long \"The Dealers\"), but even the lows are funny. Best of all is Ken Shapiro's manic dance down a busy Manhattan sidewalk.(That is Shapiro, not Nat King Cole singing Just You, Just Me). Definitely dated now, but at the time The Groove Tube was irreverent, bold, shameless and hysterically funny. Ken Shapiro made this minor cult hit, then 7 years later made the Christmas day opening bomb, Modern Problems (though I enjoyed it} and since then, unfortunately, nothing.(He could possibly be playing drums in a jazz group) The Groove Tube remains to me an unending burst of positive energy, a movie that 26 years after my initial viewing, still brings me real joy!",
         "You know what they say about the 70's..if you can remember them you weren't there. One of the few things I do remember about the 70's was the very first hippie and hip social satire as seen from a totally 'underground'or counter-culture perspective..The Groove Tube. If the humor seems faded or witless now to some viewers it can only be because a lot has happened in the last 30 years and the comedy isn't 'fresh' anymore..but hey! When this movie came out it was a first..and some of these skits were being done for the very first time...at a time when Nixon was in office, the Vietnam war was raging, the sexual revolution was in full swing..and J.Edgar Hoover was still in charge of the FBI. This is a film made before Watergate broke and as such it was one of the first to take a big swipe at the establishment..to make fun of it and the hippies at the same time. And frankly, some skits are still dead funny. If you liked Cheech and Chong's \"Up In Smoke\"..you will LOVE this film. If you want to know what the 70's were really like..check out the Groove Tube.. if you liked the Oscar winning \"Network\" from about the same year and thought it was right on the mark in its savage look at TV, you will dig the Groove Tube..which picks up on the theme but plays from the angle of the viewers...the young viewers who were turning off the TV in favor of other entertainments.... We had been raised on Ozzie & Harriet \"Leave It to Beaver\", Father Knows Best, My Three Sons..Happy Days...so imagine our glee when those of us who were experimenting with the new life-styles got to see a send up of the box as seen from our perspective! The commercials by the Uranus corporation alone are priceless..\"Good things come from Uranus\"....and the sudden break from straight film into Fritz the Cat-style animation when the hippies eat the weed is still one of the best segues in and out of sanity i have ever seen on film. If you liked the Kentucky Fried Movie, you will LOVE this film. And if you ever wondered why your weird uncle Harold still gets a wicked gleam in his eye when thinking back to his college days..this would be the perfect film to watch. Take it for what it is..a memento of the times...and a sassy little film that will help all of us who did forget the 70's to remember them anew.",
         "Back in college \"midnight movies\" at the local theater primarily showed \"Barbarella,\" \"The Rocky Horror Picture Show,\" or \"The Groove Tube.\" \"The Groove Tube\" was the best of that era's skit movies that included \"Dynamite Chicken,\" \"The Boob Tube,\" and even lesser known attempts at showcasing underground comedy troupes like Second City and The Groundlings. The original version was rated X and featured full frontal male and female nudity. I understand that later versions were edited for an R-rating but perhaps with time the film is back together. At the time it seemed raunchy, dirty, gross, underground, and subversive, but with twenty years of Saturday Night Live, Howard Stern, and films ranging from \"Porky's\" to \"Something About Mary,\" it's more like 'Saturday Night Live, the Movie' (some skits are funny, most are not, nothing we haven't seen elsewhere.) The funniest and most original skit has to do with a children's show that features a man's private parts dressed up to resemble a puppet. I remember real children's show hosts standing on their head and putting a doll's outfit around their upside down mouth. I always thought that was sick. At the time I couldn't believe that \"The Groove Tube\" got an actor to do a routine with his exposed penis (this was 1975 after all) and it was pretty shocking...and hilarious. It is no longer shocking, but it is still pretty funny. I hope that they didn't edit that out of the recent showings of the movie. I also always wondered who's penis it was. I think it would have been more provocative if they would have had a female host ala Sheri Lewis or Fran of \"Kukla, Fran, and Ollie\" talk to the penis but like I said it was only 1975.",
         "\"The Groove Tube\" was initially shown on video, in the first \"video theaters\" here in Boston. In one room, there were TV monitors on high stands, with old movie theater seats, in small groups facing the monitors. There were old refrigerators stocked with Pepsi, and baskets of York Peppermint Patties. In a second, smaller room, there were no seats, just large pillows. That was the 'smoking' room, i.e., people got high in there. That act only added to the hilarity of the video. I was a 'frequent viewer'; the scenes I liked most and remember to this day are: Koko The Clown, The Kramp Family Kitchen (Kramp Easy-Lube Shortening), Safety Sam/ VD PSA, the Chevy Chase hitchhiker w/ nude runs through the woods, the Finger Ballet on what was eventually revealed to be the nude body of a woman. The last item was very reminiscent of the late, incredible Ernie Kovacs. Now, I've lost a lot of readers that are under 48 (\"who is Ernie Kovacs??\") but trust me, it's funny stuff. One reason I was a 'frequent viewer' was that I, and my friends, would bring other \"Groove Tube\" virgins to see it. We would sit and slyly watch the faces of the 'virgins' as the \"Safety Sam\" PSA would play. As the camera slowly zooms in on \"Sam\", we would wait for that \"OH!\" of recognition on the 'virgin's' face. Each time was more hilarious than the last. And then that 'virgin' would then bring a friend to see the show, repeating what we had done. To get this joke, you must watch the video. Yes, some of it is dated, but most plays, film, television, and now videos are. Just look at any video made in the 1980's. I did see \"The Groove Tube\" in a theater as a film, a grainy transfer from the original video. It had been cut, and was missing some of the original high-point scenes. The first \"Saturday Night Live\" show, featuring Chevy Chase, elicited instant remarks of, \"that's the guy from \"The Groove Tube\" \", so it was a precursor for Chevy. I can't look at a can of shortening without hearing the voice-over, \"coat your hands with a generous amount of Kramp Easy-Lube shortening...\" and thinking of the \"Kramp Holiday Loaf\" recipe. Always gets me laughing in the Baking Needs aisle in the grocery store. The early 70's were parlous times; \"The Groove Tube\" was fresh, new, and really 'got' the humor of the times. It offered a 'hip generation', humor that wasn't available in any other format/medium. MJH",
         "When you view this movie you should keep in mind that it was written and filmed in the early 1970s. Pretty dated but real damn funny for it's time. For those of you that are in your early twenties, it should give some of you an idea of what your parents thought was funny and in your face back then. Most people didn't have cable TV and those that did didn't have 100 stations to choose from and it was 7 years before Mtv was invented. Most of us were relegated to watching 3 channels if you watched TV at all. This is also why anyone over 40 will tell you the first 5 years of SNL are better than all of the others combined. The best segments are the Cooking Show, Brown 25 and KOKO the Clown. In any case you may find humor in some of the segments or not. It is still worth watching from a nostalgic or historical perspective.",
         "I was born in 1982. Most of my childhood memories are in the extreme late 80's and 90's. I watched the Groove Tube for the first time in 2001, when I was 19. And I found it hilarious. So for anybody who thinks that something \"dated\" can't be quite funny 30 years later....think again! It's funny even if you have no idea what the 70's were like, and the thought of bell-bottom pants make you cringe. Who can argue with a Bozo the Clown type who reads adult literature? There is plenty to laugh at. The scrotal puppet show at the end is the best.",
         "\"The Groove Tube\" was one of only two Ken Shapiro movies, the other one being the equally zany \"Modern Problems\". This one is just a full-scale parody of TV. Aside from Shapiro - who apparently didn't do anything after \"Modern Problems\" - the movie also stars Chevy Chase and Henry Winkler's cousin Richard Belzer. The three cast members (plus some other people in smaller roles) appear in various skits. One of the funniest ones features Chase in a Geritol-spoofing commercial, in which he's describing the medicine as his wife strips, and it ends with her humping him. There's also a pornographic news program, an irritating cooking show, and the epic tale of some drug dealers. Anyway, the whole thing's just a real hoot. In my opinion, the three best TV-spoofing movies are this one, plus \"Tunnelvision\" and \"Kentucky Fried Movie\" (although I might also include \"The Truman Show\"). Really funny. I wonder what ever did become of Ken Shapiro.",
         "One of the funniest comedies I have ever seen and the funniest scenes are the first so you'll be laughing right of the bat! No matter what your taste there is something here to make you laugh. Find out how early man discovered fire and music. Learn how to bake festive cakes. A clown that cuts the crap. A couple of dealers that have major issues. Learn a lesson in hitch hiking. Recycling like you've not thought of before. This movie is innovative, slick and rememberable. Can't wait to watch it again :) This is a must see!",
         "If you liked \"Kentucky Fried Movie\" (predecessor to the Zucker's \"Airplane\") you need to see the original 'skit' movie. The 'Groove Tube' is the GREAT GRANDADDY of the skit movies'. Nothing but one comedy skit after another. Many are very funny, some are a little dated. But hey, if you don't like one, the next is sure to get you. I saw the thing when it first came out, and 25 years later, when we are working in the kitchen, I STILL tell my wife to \"Take the cherry pits... and put them in the olives... and garnish with a small American Flag!\" Crazy.",
         "We showed this movie at the local Film Society, and the art-house crowd had the time of their cinematic lives. It's tasteless, groovy and very funny in a sixties kind of way. The Kraft Kitchen recipe sketch had them laughing like maniacs. The rest is a mixed bag, but the highs definitely beat the lows. By the way, whatever happened to Ken Shapiro??"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "K.S. Productions",
         "Syn-Frank Enterprises",
         "Zeta"
      ],
      "summaries": [
         "A collection of skits that make fun of television. Everything from commercials to the nightly news are spoofed. Chevy Chase makes a brief (as well as his debut), appearance.",
         "A collection of skits that make fun of 1970s television, featuring early appearances by Chevy Chase and Richard Belzer."
      ],
      "budget": 200000
   },
   "movielensId": 26323,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-06-23",
      "dvdReleaseDate": "2000-05-30",
      "directors": ["Ken Shapiro"],
      "runtime": 75,
      "movieId": 26323,
      "title": "The Groove Tube",
      "mpaa": "",
      "actors": [
         "Ken Shapiro",
         "Chevy Chase",
         "Richard Belzer",
         "Buzzy Linhart",
         "Richmond Baier",
         "Berkeley Harris",
         "Jennifer Welles",
         "Dennis Helfend",
         "Mary Mendum",
         "Martin Kove"
      ],
      "imdbMovieId": "0071583",
      "originalTitle": "The Groove Tube",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["RkG6HMPBJoo"],
      "plotSummary": "Chevy Chase makes his film debut in this riotous collection of live skits. Directed by Ken Shapiro and featuring Chase, Richard Belzer and others, The Groove Tube mocks TV Land and its trappings by spoofing kids' shows -- from a marijuana-smoking Koko the Clown who resides in Make Believe Land, to Safety Sam, the penis with a plan who gleefully informs the audience of the perils of casual sex.",
      "tmdbMovieId": 27977,
      "avgRating": 2.98529,
      "releaseYear": "1974",
      "numRatings": 34,
      "posterPath": "/vqavLV59So2EPCCDBGhTPXX50JM.jpg"
   }
}