{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "florida keys",
            "id": 3546
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "divorce",
            "id": 15160
         },
         {
            "name": "private detective",
            "id": 155790
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0073453",
      "video": false,
      "title": "Night Moves",
      "recommendations": [
         14554,
         32044,
         20025,
         52758,
         22404,
         22178,
         20442,
         25955,
         18727,
         17221,
         11942,
         27452,
         63443,
         20298,
         24214,
         30162,
         26516,
         17365,
         28120,
         25430
      ],
      "backdrop_path": "/aGcqNI1xfag1NkVqEXIT9kD0fU.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5424a7e0c3a3681eca002c4b",
         "content": "Take a swing at me Harry the way Sam Spade would.\r\n\r\nNight Moves is directed by Arthur Penn and written by Alan Sharp. It stars Gene Hackman, Jennifer Warren, Susan Clark, James Woods, Melanie Griffith, Edward Binns, Harris Yulin, Kenneth Mars and Janet Ward. Music is by Michael Small and cinematography by Bruce Surtees.\r\n\r\nFormer footballer turned private detective in Los Angeles Harry Moseby (Hackman), gets hired by an ageing actress to track down her trust-funded daughter Delly Grastner (Griffith), who is known to be in Florida. With his own personal life shaken by his wife's infidelity, Harry dives into the Grasten case with determination. Unfortunately nothing is as it first seems and it's not long before Harry is mired in murky goings on...\r\n\r\nIt sounds kind of bleak. Or is it just the way you tell it?\r\n\r\nThe locale is often bright and sunny but that's about the only thing that is in this excellent neo-noir. Harking back, and doffing its cap towards, the noir detective films of the classic cycle, Night Moves is ripe with characters who are either dubious or damaged. Protagonist Harry Moseby is thrust into a melancholic world that he has no control over, but he doesn't know this fact. As the mystery at the core of the dense plot starts to unravel, there's a bleakness, a 1970s air of cynicism, that pervades the narrative. Culminating in a finale that's suitably dark and ambiguous.\r\n\r\nHarry thinks if you call him Harry again he's gonna make you eat that cat!\r\n\r\nAlan Sharp's (Ulzana's Raid) terrific screenplay is appropriately as sharp as a razor. Dialogue is often hardboiled or zinging with wit, and the conversations come with sadness or desperation. Be it chatter about a fateful chess move, sexual enlightenment or the pains of childhood and bad parenting, Sharp's writing provides fascinating characters operating in a tense thriller environment.\r\n\r\nListen Delly, I know it doesn't make much sense when you're sixteen. Don't worry. When you get to be forty, it isn't any better.\r\n\r\nArthur Penn brilliantly threads it all together, as he hones a great performance out of Hackman and notable turns from the support players, he smoothly blends action with pulsing unease. There's nudity on show, but in Penn's hands it is never used for gratuitous purpose, it represents dangerous fantasies or dented psyches. Small's jazzy score is a fine tonal accompaniment, and Surtees' Technicolor photography provides deft mood enhancements for the interior and exterior sequences.\r\n\r\nBiting and bitter, Night Moves is essential neo-noir. 9/10",
         "url": "https://www.themoviedb.org/review/5424a7e0c3a3681eca002c4b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Moseby",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019efb",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paula",
               "gender": 1,
               "credit_id": "52fe44b49251416c91019eff",
               "name": "Jennifer Warren",
               "profile_path": "/uX51ZwPiHVIc0nZfAwEfZIwVknf.jpg",
               "id": 70241,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ellen Moseby",
               "gender": 1,
               "credit_id": "52fe44b49251416c91019f03",
               "name": "Susan Clark",
               "profile_path": "/tQradyDXFaFWV1ZefFpwx3kr5Jm.jpg",
               "id": 40168,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Marty Heller",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f07",
               "name": "Harris Yulin",
               "profile_path": "/MCW4IR3mEB6oeRbX9bfeHkZ3qm.jpg",
               "id": 1166,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f0b",
               "name": "Kenneth Mars",
               "profile_path": "/xS8r7UXRtBLLCa5MPo0zYP66VlZ.jpg",
               "id": 9601,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Arlene Iverson",
               "gender": 1,
               "credit_id": "52fe44b49251416c91019f0f",
               "name": "Janet Ward",
               "profile_path": "/ijKwbjqZHDhuRcpkF84a2tF4ul4.jpg",
               "id": 6843,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Quentin",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f13",
               "name": "James Woods",
               "profile_path": "/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg",
               "id": 4512,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Delly Grastner",
               "gender": 1,
               "credit_id": "52fe44b49251416c91019f17",
               "name": "Melanie Griffith",
               "profile_path": "/rdRjFsPQDQqPE8JlDQcuT5JDpED.jpg",
               "id": 29369,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f1b",
               "name": "Anthony Costello",
               "profile_path": null,
               "id": 116576,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Tom Iverson",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f1f",
               "name": "John Crawford",
               "profile_path": "/wyBwzmRGML0PoIxJ2DnQAOBgmqu.jpg",
               "id": 15693,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Charles",
               "gender": 0,
               "credit_id": "52fe44b49251416c91019f23",
               "name": "Ben Archibek",
               "profile_path": null,
               "id": 116577,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "boy",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f27",
               "name": "Dennis Dugan",
               "profile_path": "/A9Hv8qqB4fgb5IMjEESzBo8LXPZ.jpg",
               "id": 17494,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Girl",
               "gender": 0,
               "credit_id": "52fe44b49251416c91019f2b",
               "name": "C.J. Hincks",
               "profile_path": null,
               "id": 116578,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Stud",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f2f",
               "name": "Max Gail",
               "profile_path": "/7gJvZg4AC0vxe0z48moevvSFOmC.jpg",
               "id": 116579,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Joey Ziegler",
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f57",
               "name": "Edward Binns",
               "profile_path": "/77FaXwoiEOkKCDXDfvvG65Sx788.jpg",
               "id": 2651,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f35",
               "name": "Alan Sharp",
               "profile_path": null,
               "id": 70476,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b49251416c91019f3b",
               "name": "Robert M. Sherman",
               "profile_path": null,
               "id": 58076,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f41",
               "name": "Michael Small",
               "profile_path": null,
               "id": 6357,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44b49251416c91019f4d",
               "name": "Dede Allen",
               "profile_path": "/20uUxDktTl18s4Y20oPipmWHRJD.jpg",
               "id": 6453,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b49251416c91019f53",
               "name": "Arthur Penn",
               "profile_path": "/imHQBWO3DZXfcJM1CcPHsL28PyK.jpg",
               "id": 6448,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "572e36a59251416c34001ad7",
               "name": "Stephen A. Rotter",
               "profile_path": null,
               "id": 34484,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "572e368bc3a3681939000270",
               "name": "Bruce Surtees",
               "profile_path": "/dJsO0sdSi2tM4ZTKVdZrvufiAuO.jpg",
               "id": 792,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "572e3699c3a3681939000277",
               "name": "Gene Lasko",
               "profile_path": null,
               "id": 81541,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "572e36acc3a36818d1000285",
               "name": "Nessa Hyams",
               "profile_path": null,
               "id": 53003,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "572e36b3c3a3680f3f003116",
               "name": "George Jenkins",
               "profile_path": null,
               "id": 6358,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "572e36bc9251412c890013c0",
               "name": "Ned Parsons",
               "profile_path": null,
               "id": 1334402,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 3.407421,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32042,
      "vote_count": 57,
      "budget": 0,
      "overview": "When Los Angeles private detective, Harry Moseby is hired by a client to find her runaway teenage daughter, he stumbles upon a case of murder and artifact smuggling.",
      "similar": [
         910,
         949,
         189,
         9411,
         963,
         1586,
         320,
         8512,
         10651,
         4771,
         2832,
         101,
         180,
         829,
         75780,
         281,
         37094,
         513285,
         336843,
         59967
      ],
      "original_title": "Night Moves",
      "runtime": 100,
      "poster_path": "/jGYyRh1ECOx0uWEC6ocGS6z2V3E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Layton Productions",
            "id": 76493,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hiller Productions",
            "id": 76494,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1975-06-11",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Arthur Penn"],
      "runtime": 100,
      "synopsis": "Four men in the movie stunt business join together to smuggle precious Mexican antiquities to the States. All are pilots except for mechanic Quentin (James Woods). One of the pilots, Tom Iverson (John Crawford), also has a charter business in the Florida Keys, used as a staging point for the smuggled goods. Iverson's girlfriend Paula (Jennifer Warren) is also in on the scheme. All of this occurs before the movie opens; all that follows happens during the film. Los Angeles private eye and former NFL player Harry Moseby (Gene Hackman) arrives at the Keys searching for Iverson's runaway, nymphet stepdaughter Delly (Melanie Griffith). Moseby was hired by Arlene Iverson, Tom's selfish ex-wife and a former actress. Arlene's only means of support is Delly, Arlene's daughter by her first husband. After Moseby takes the case, he discovers that his wife is cheating on him, but instead of talking to his wife Ellen (Susan Clark), he accosts the man she has been seeing, Marty Heller (Harris Yulin). Marty despises Harry for acting like a private eye instead of taking care of his own marital problems. Although they eventually reconcile, Ellen also despises Harry for treating her like a case subject instead of his wife. As Moseby follows the clues to Delly, he makes fast friends with stunt director Joey Ziegler (Ed Binns) who is keen to help Moseby find Delly. Moseby discovers that Quentin and stunt flier Marv Ellman (another smuggler) were both once involved with, and fought over, Delly, although Moseby has no suspicion of the other motives and machinations occurring under his nose. Moseby eventually finds Delly with Iverson and Paula in the Keys, and they allow Moseby to stay for a while as he tries to convince Delly to come back to L.A. with him. During a boating trip one night with Delly and Paula, they find Ellman's downed plane. Paula deceives Moseby about a marker she places at the crash, saying it is for the Coast Guard. It is really for Iverson who will come to the site later and retrieve the stolen goods from Ellman's plane. During this time, Paula seduces Harry to keep him occupied. Delly eventually comes back to L.A. with Moseby, finding Quentin waiting for her at Arlene's home. It is the last time Moseby sees Delly alive, with everyone at the house yelling at one another other while Harry drives away, not reflecting on the turmoil he has once again introduced into Delly's life. Arlene gets Delly some movie extra work but she dies in a car crash during a stunt in which Ziegler was driving, who lived but was badly injured. Moseby views film footage of Quentin under the car before the stunt and begins to suspect Quentin murdered Delly. Moseby confronts Quentin and accuses him of killing Delly because she discovered he killed Ellman out of jealousy. They fight but Quentin escapes. Moseby then tells Ziegler he thinks Quentin and Iverson are in on something but he doesn't know what. Moseby goes back to the Keys to find out. Moseby arrives at Iverson's charter business to find Quentin dead. Moseby then confronts Iverson who confesses to killing Quentin. Quentin thought Iverson killed Ellman to get a larger share of the smuggling proceeds, and Moseby had scared Quentin into thinking he was going to go down for Ellman's murder instead. Moseby struggles with Iverson and knocks him out, then is determined to finish things by having Paula help him locate the stolen artifacts. They find the marker previously left, and while Paula is underwater, a seaplane strafes the boat and Harry is injured. The plane lands and sees Paula surface along with a large stone sculpture. The plane runs her down but then collides with the sculpture, kicking out its pontoons. The plane then flies into the boat and begins to sink. Harry tries to get a glimpse of the pilot from the diving window built into the boat's keel: it is Ziegler, the last person he ever suspected. The movie ends with Harry unsuccessfully trying to steer the boat to shore - he succeeds only in going in circles.",
      "writers": ["Alan Sharp"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073453/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxNDg1MjkwOF5BMl5BanBnXkFtZTcwODAzMTkyMQ@@._V1_SY317_CR22,0,214,317_AL_.jpg",
      "actors": ["Stars: Gene Hackman, Jennifer Warren, Susan Clark | See full cast and crew »"],
      "reviews": [
         "When you notice that a boat, on which the detective sees the crucial evidence, is hit and shot at, and finally 'solves' the crime, is called 'Point of View', you know you should have been watching harder. 'Night Moves' is the greatest of the 70s American anti-detective movies influenced by 'Vertigo', Antonioni and Bertolucci; films that used a genre all about solving the crime and re-ordering a ruptured social order, expelling the maleficent, and undermining it, to deconstruct the figure of the detective as arbiter of knowledge and order, suggesting that the world, or a human being, is not open to interpretation, ordering, patterning; that there are limits to reason. Most American anti-detective films, however, are rather heavy-handed in their messages - 'The Parallax View' obscures itself in a dense murk, 'The Conversation' is full of European austerity and ellipsis. 'Night Moves', on the other hand, plays as a hard-boiled thriller, in the style of contemporaries like 'Chinatown' or 'Farewell My Lovely'. We have a rich Chandlerian brew of flawed, basically decent dicks, femmes fatales, wastrel rich with their errant offspring, and a satisfyingly convoluted plot. And 'Night Moves' can be enjoyed like this - Penn never makes deliberately 'arty' his material. The film also functions as a complex psychological piece, about a once-successful, popular athletic man reduced to peeping on cheating wives (first his clients, then his own). This is linked on the one hand to the decline of America (Harry's success and decline framed by the assassination of the Kennedy brothers), and to the family: Harry himself haunted by his own mysterious relations with his father, his marriage being notably childless, his quarry being a highly sexed teenager who's run away from a promiscuous mother to a smuggling father. The account of Harry's crumbling marriage and his personal regrets is as moving as his distaste or the paint-like qualities of Eric Rohmer is funny. But this generic realism, if you like, does not preclude more abstract elements such as the title, with its suggestions of chess, of a game where Harry isn't sure whether he's grandmaster or pawn, or to the playing out of the drama, where the most significant events, both in terms of the mystery and Harry's personal life take place at night, or the idea of the narrative as a dream. For instance, what is the connection between Harry's wife's job as a vendor of antiques, and the central smuggling crime? Is Harry transposing the failure of his domestic narrative onto his professional one, in the hope that by solving this he'll make good the first? Harry is being led by dark forces (within himself) beyond his control. The Florida Keys hideout of Delly's stepfather (where the first sequence has the time- and plot-suspending atmosphere of an enchanted realm) boasts a sign, '66', which suggest the famous route, one version of the American dream dashed in this film, or more sinister, diabolic, forces. For me, this masterpiece is all these things, but mostly it is a critique of the gaze, the power to see and interpret that is the raison d'etre of the detective, from which he derives his power and status. Harry's gaze is severely undermined throughout, by being misled, by personal blocks, by simply interpreting wrong. When the solution is revealed, it is certainly not any of Harry's doing - it is brought to him with bloody murderousness. Throughout the movie, we see Harry looking at people or things through blinds, curtains, screens etc., his view impaired. But it's more than this. In his wife's lover's house (is he blind? I thought he was until near the end - see, need to look harder!), there are trompe l'oeil effects in the windows which seem to transform and distort the visual field we look through. It's a small thing, but, like those little clues Nabokov scatters in his books, its reverberations and implications are potentially massive. This is linked to the cinema (Harry is seen by others through a screen-like frame) that makes up the plot's supposed background (remember, Harry discovered his wife's infidelity coming out of a movie theatre).",
         "It's a finely made movie, beginning with Michael Small's deliciously jazzy score which rolls along under the credits, using only rhythm and vibes. At more dramatic moments the theme is echoed by a mournful oboe. There are touches of Gil Evans and Gunther Schuller in the arrangements. The score could probably stand alone. The performances vary from professional to considerably more than that. James Woods is his usual cocky hypermanic self but it fits the role. Edward Binns is a serviceable utility player. Jennifer Warren is given some lines suggesting she sees herself as homely, and it's true she's not gorgeous, but only by Hollywood standards. As it is, she's on the cusp, and she has a face that intimates character, and a nice figure to boot, though her delivery sounds more like suburban Connecticut than the Southern semi-trash the character is supposed to be. Melanie Griffith makes a very acceptable 16-year-old nympho who spreads sex around the way some other people spread good will. Susan Clark as Hackman's wife is adequate. She has an outre kind of beauty. She has a wide mouth and her upper and lower lips seem to be of identical shape. And she has the eyebrows of the Mona Lisa, which is to say none at all. The truly outstanding performance is Gene Hackman's. He's always good without ever being bravura, but here he outdoes himself as Harry Moseby, the sleuth who's going to solve all the world's puzzles. I'll just give one example of what I mean. Watch him during the scene in which he's in bed with Clark, dipping marshmallows into the fondu and telling her the story of how he tracked down the father who'd left him as a child. He's never spilled the beans to her about this incident before. It's an intense scene. But Hackman doesn't weep or pull his hair and pound the pillow with his fist. He snickers awkwardly, makes a few feeble attempts at wisecracks, and stumbles over his words. His awkwardness masks the emotional intensity of the moment. Hackman doesn't feel the need to tell us more than that. Few self-sufficient grown men would. Well, one more example. Watch his response when Griffith, on first meeting him, asks directly, \"How old are you?\" Watch the way he combines a chuckle at her effrontery with a direct and unashamed answer to her question. I need to mention Rosemary Murphy too. It would be criminal not to. We meet her as a selfish slut who only wants her daughter, Griffith, returned to her in order to deprive her divorced husband of Griffith's companionship. When Griffith turns up dead, Harry storms into Murphy's house and confronts her at the swimming pool. He chews her out for her all-too-obvious failings. She listens to this while lying on a lounge in the Southern California sunshine, a table full of booze paraphernalia next to her. When Harry's fulguration is finished, she gets uncertainly to her feet, falls against the table and smashes some glass, and we realize for the first time just how drunk she really is. She disses him for his self-righteousness and adds, \"Some day I might cry for the little bitch, but when I do you won't be here,\" and then dismisses him. I can't think of another actress who would have pulled off that scene with such panache. The same can't be said for the plot. It could (and should) have stayed a first-rate mystery. It's convoluted, sure, but it makes sense at the end. Instead, the writers and the director have bulked it up with \"significance.\" Instead of settling for a well-done genre piece, they've opted for an examination of ontological Angst. What's it all about? There are multiple indications that Harry is overreaching and looking for answers that no one is capable of finding. Now I happen to think that this is a pretty noble quest but nobody else in the movie does. They all discourage him and ridicule him. Harry demonstrates some tricky knight moves in a chess game to Jennifer Warren and she says, \"It's beautiful.\" I didn't get it. I mean, I get the pun but what does a chess game have to do with the rest of the movie? The movie closes with a visual pun, a wounded Harry in a boat out in the Gulf of Mexico. The boat is beyond his control and is going around in circles. Why? As far as the case is concerned, Harry isn't going around in circles. He's just figured the whole thing out. As far as some banality like \"life is pointless\" is concerned, the movie hasn't earned the right to lecture us on the subject. Overall the movie is exceptionally bitter. Except for Harry, there's no one in it who is really straight. It's a bleak view of the society we live in. I guess I don't mind hearing that lecture but I do wish Penn had chosen to resolve the ambiguous ending. Does Harry make it to shore or not? I'd like to know the answer to that. I gave up trying to find the answer to life years ago.",
         "Night Moves is an underrated Film Noir. Directed by Arthur Penn (Bonnie & Clyde) it is an absolutely outstanding genre piece. Gene Hackman plays an L.A. gumshoe who is hired by a well to do ex-actress to find and bring home her runaway daughter (Melanie Griffith in her first role!). What seems to be routine detective work soon turns out to be a complicated case which finally ends in murder and mayhem. There are some remarkable stunt and underwater sequences, well photographed by Bruce Surtees (Director of Photography of many Clint Eastwood action movies). Not only Melanie Griffith but also another of today's stars, James Woods, gave his screen debut in this film. See it, it is worth the while!",
         "This is the perfect role for Hackman as the aging sports star unable to find his role in life once the playing days are over. He is the accidental jock, too sensitive to play the stereotype and so finding no sense of belonging. He has become a detective but he is a bumbling amateur compared to a Philip Marlowe type. He is shy and hestitant and is frequently made to feel discomfort by the seedy, untrustworthy people he comes into contact with. He has none of Marlowe's self assurance. It begs the question why has he become a detective? Maybe it is partly due to his abandonment by his father who years later Hackman tracks down only to fail in confronting him. He is condemned to search for people to whom he is of no importance. This idea of the lonely seeker is Hackman's own turf. His affable charm conveys a sense of a lifetime's wrongheaded idealism. In the wrong job, deluding himself, looking for a way out. Eventually, he is able to see clearly and see how his drifting has allowed the people around him to manipulate him in their games. Unlike many of this film's peers such as 'Chinatown', 'Taxi Driver', 'The Long Goodbye', we are not left to be slightly repulsed by the lead actor's ways. Hackman plays the everyman character as an affable, amateur sleuth whose hestitancy and chronic lack of commitment give him a fallibility more recognizable to an audience.",
         "\"Night Moves\" was a surprise to me. I assumed it could be a far more simple mystery/action film, but the whole thing caught my attention and really amazed me. What a great study in murder, infidelity, cruelty, sex, and relationships between strangers. A kind of film noir with dark overtones and a slow but effective suspense, the story starts as a simple investigation about a runaway teenager, but grows more and more into a complex drama plenty of unexpected twists. Gene Hackman is superb as the rude detective, the rest of the cast is also in fine form, but the real shock is to see a very young, hot (and naked) Melanie Grifith doing a terrific performance. James Woods is also here, with less impact but great to see too. An excellent film, one of the finest 70's underrated movies.",
         "Coming back to NIGHT MOVES a quarter of a century later is a confronting experience. I was admirer of Alan Sharp's (HIRED HAND and LAST RUN) and now it's easier to see how he'd distorted the American crime movie with the influence of the European art cinema. Much the same thing is happening in Sam Mendes' current films. The process is knowing and resonant and the film shows Arthur Penn at the top of his game, though it didn't find the same public his most famous work. This dark intrigue stuff works, partly because it's too dense to be immediately absorbed and because the characters are so vivid - even if it is hard to believe that all these great women want to take off their shirts for Gene Hackman in his tan rug. It is however one of Hackman's best outings - whether he liked it or not. Lots of great detail - the contrast between Hackman's study with the black and white TV where sports will kill his eyes and Yullin's tasteful home, which makes us share Hackman's loathing of the character, feeding dolphins, the glass bottom boat or the theatre viewing (which respects the different format of the two cameras for once.) The performances are consistently vivid, reflecting well on Penn, with soon to be stars Griffith (particularly memorable) and Woods running level with largely forgotten character people. Janet Ward, for one, really registers. Even if it needs theatrical viewing to be appreciated, Bruce Surtees' dim lighting, characteristically shading eyes, is atmospheric but the post \"New Wave\" fad of dispensing with establishing shots and opticals is now confusing and jerky. The score irritates too. The line about paint drying has now passed into common usage but I like \"blind, Albino, s**t-eating alligators\" as much. I used to use this one to teach screen writing decades back. I rate that a good call.",
         "In Los Angeles, the private detective and former athlete Harry Moseby (Gene Hackman) is hired by the retired obscure Hollywood actress Arlene Iverson (Janet Ward) to find her 16 year-old missing daughter Delly Grastner (Melanie Griffith). Harry discovers that the runaway girl has a promiscuous life and uses drugs, and he tracks down her last boyfriend Quinten (James Woods), who works as a mechanic on the sets. Meanwhile, Harry finds that his wife Ellen Moseby (Susan Clark) is cheating him and he has difficulties to handle the situation. Then he visits the stuntman Marv Ellman (Anthony Costello) and the stunt coordinator Joey Ziegler (Ed Binn) and follows the new lead, heading to Florida Keys, where Delly would be living with her stepfather Tom Iverson (John Crawford). Harry is welcomed by Paula (Jennifer Warren), who works with Tom in a boat and has an open relationship with him. After seeing an accident in the sea, the reluctant Delly surprisingly accepts to return to Los Angeles with Harry to live with her mother. Harry and Ellen have a long conversation trying to solve their marriage problems. When Harry learns that Delly has died in a car crash, he suspects of Quinten. But sooner he finds that the initially missing person case is actually a complex smuggling operation of a valuable artifact. With the recent death of Arthur Penn, I decide to see again \"Night Moves\", a movie that I watched in the 80's and was forgotten in my collection. \"Night Moves\" is a different and complex detective story, supported by an engaging and flawed screenplay and great characters development. The top-notch actor Gene Hackman in the top of his successful career performs a detective that snoops the lives of other people and is incapable to see that his marriage is deteriorating. The 18 year-old Melanie Griffith in her first credited role is extremely sexy and beautiful, undressing easily along the film. It is also interesting to see James Woods also in the beginning of career in a supporting role. It is also great to see again the gorgeous vanished actresses Jennifer Warren and Susan Clark. My vote is seven. Title (Brazil): \"Um Lance no Escuro\" (\"A Bid in the Dark\") Note: On 26 October 2014 I saw this movie again on DVD and now my vote is eight.",
         "One of the unsung films of the seventies and probably the last focused film of director Arthur Penn. This tongue in cheek, intense drama stars Gene Hackman as Harry Moseby, an L.A. detective suffering marital problems who takes on a case to find a missing girl ( a young Melanie Grifith) of a famous actress. Hackmans character tracks her to the Florida Keys as the convoluted plot makes many unexpected twists and turns. It's Penn's taunt direction and Gene Hackman, (truly one of the best actors of the last thirty years) charisma which makes the film worth watching. Bruce Sutrees photography and Alan Sharps script should also be noted.",
         "I'm not the biggest Gene Hackman fan out there, but I found this movie on Encore one night and I have to say it's probably the best film I've ever seen. I never really thought Hackman could really act before I saw this, but, man, does he take command of this picture. His best scene, I think, is the one where he and his wife are yelling at each other after he found out about her infidelity. The part where he yells \"I don't want Nick's f-king job! And I don't want your job!\" is really awesome. But all throughout the movie, it's nothing but a tour de force from Hackman. Not to take anything away from James Woods, Melanie Griffith, Hackman's wife in the film, or the Joey Ziegler guy, all of whom also act very well. But Hackman definitely carries the film. I also love the cool theme music (that synthesizer stuff) -- it fits the film perfectly. I also love how it took me about four viewings of this film to really figure it out. That's a hell of a lot better than stuff like \"Armageddon\" where there's nothing to think about at all. Today's movies really are terrible -- that's why I stick to older movies like those on Encore and AMC and sometimes Bravo (though they have commercials). All in all, \"Night Moves\" is one I highly recommend -- but just don't watch it if you're the kind of person who likes action and things exploding for two hours, it'll definitely turn you off. :0)",
         "When I posted that Zapruder's film is, to me, one of three defining moments in film noir, I got some incredulous reactions. This helps explain a bit. You can imagine it as chronicling the narrative of a generation. It's plainly announced in the film. Our guy remembers that he was a young enthusiastic athlete when the first Kennedy was shot, with all life ahead of him we presume. He was on one of his dreary night-long stake-outs, now a weary detective looking into other peoples' lives, when the second Kennedy was. So there it is. The fact that even people in charge of the world and expected to radically change it for the better can be so casually removed from existence, unsettles deeply. Zapruder's film signalled an end to film noir, in the sense that ordinary crime just didn't cut it anymore. A lone nutjob just didn't cut it anymore. Now we expect narratives that explain larger systemic evil and going all the way up. All of this plainly turned an entire nation of deeply unsettled viewers into private investigators like in a film noir, looking to unlock governing truths behind the callous whims of fate. Our loss is that we have solid material like this woven together by two not very satisfying references. The solid material is a noir film that questions what it means to be a private eye, what it means to spy away into private lives presuming you can set them straight by watching for mundane details. Did we with JFK or did we go mad spinning the web? Our main reference is an annotation of the classic noir model, right out the door; a Sam Spade character who is not cool any more, not cocky, not in control, with no sure-footing in the story and has to uncertainly stumble along as the story piles on top of him. The point is this is not going to be strictly about the case, but murky life at the edges of looking to see. Pakula and Altman had already got there with much better, edgier results. Both these guys had realized, you had to have fiction that resonates with believable life. Hollywood fiction looked harmless and complacent next to photographic evidence of important men dying before our eyes. So it was not enough to have dames and gumshoes, you also had to go to a distance where these things acquired their three dimensions and now looked as springing whole and damaged from a real world where people bleed softer than in the movies. Klute borrowed from Antonioni, using the detective plot as a premise for connection between lost individuals. It mattered that she was an actress. Altman did his own mischievous thing, freeform jazz canoodling he had invented. He rediscovered Raymond Chandler in the wandering. The second thing that detracts here is that French New Wave has dated worse than actual noir, and it's what Penn relies on for meta-narrative annotation. So the movie references are explicit, the bits about people acting roles are stressed too obviously, the deconstruction of myths a little without discovery. That's too bad, because the premise is sound. Our guy was out on one of his rounds spying into other peoples' lives when one night he happens to spy into a part of his life he didn't know about. We presume he was doing the former to avoid the latter. His own narrative collapses. So he sets out to find the missing person in the hope that he restores himself, but of course nothing is settled when he does. The ending is suitably bleak, a betrayal that was dragged bitter and mad from Watergate."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Former football player and present private detective Harry Moseby gets hired on to what seems a standard missing person case, as an aging Hollywood actress whose only major roles came thanks to being married to a studio mogul wants Moseby to find and return her stepdaughter. Harry travels to Florida to find her, but he begins to see a connection with the runaway girl, the world of Hollywood stuntmen, and a suspicious mechanic when an unsolved murder comes to light.",
         "In Los Angeles, the private detective and former athlete Harry Moseby is hired by the retired obscure Hollywood actress Arlene Iverson to find her 16 year-old missing daughter Delly Grastner. Harry discovers that the runaway girl has a promiscuous life and uses drugs, and he tracks down her last boyfriend Quinten, who works as a mechanic on the sets. Meanwhile, Harry finds that his wife Ellen Moseby is cheating him and he has difficulties to handle the situation. Then he visits the stuntman Marv Ellman and the stunt coordinator Joey Ziegler (Ed Binn) and follows the new lead, heading to Florida Keys, where Delly would be living with her stepfather Tom Iverson. Harry is welcomed by Paula, who works with Tom in a boat and has an open relationship with him. The reluctant Delly surprisingly accepts to return to Los Angeles with Harry to live with her mother. Harry and Ellen have a long conversation trying to solve their marriage problems. When Harry learns that Delly has died in a car crash, he suspects of Quinten. But sooner he finds that the initially missing person case is actually a complex smuggling operation of a valuable artifact."
      ],
      "budget": 0
   },
   "movielensId": 26349,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-06-11",
      "dvdReleaseDate": "2005-07-12",
      "directors": ["Arthur Penn"],
      "runtime": 100,
      "movieId": 26349,
      "title": "Night Moves",
      "mpaa": "R",
      "actors": [
         "Gene Hackman",
         "Jennifer Warren",
         "Susan Clark",
         "Harris Yulin",
         "Kenneth Mars",
         "Janet Ward",
         "James Woods",
         "Melanie Griffith",
         "Anthony Costello",
         "John Crawford",
         "Ben Archibek",
         "Dennis Dugan",
         "C.J. Hincks",
         "Max Gail",
         "Edward Binns"
      ],
      "imdbMovieId": "0073453",
      "originalTitle": "Night Moves",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["6iP6ugUiM4Y"],
      "plotSummary": "When Los Angeles private detective, Harry Moseby is hired by a client to find her runaway teenage daughter, he stumbles upon a case of murder and artifact smuggling.",
      "tmdbMovieId": 32042,
      "avgRating": 3.61775,
      "releaseYear": "1975",
      "numRatings": 276,
      "posterPath": "/jGYyRh1ECOx0uWEC6ocGS6z2V3E.jpg"
   }
}