{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0073008",
      "video": false,
      "title": "The Fortune",
      "recommendations": [
         55078,
         141824,
         27224,
         83857,
         36567,
         53102,
         212759,
         26483,
         37960,
         228558,
         28437,
         64071,
         64963,
         89139,
         283563,
         107096,
         293536,
         49222,
         331912,
         126487
      ],
      "backdrop_path": "/qJtNIErckDErvhvq8l562hMRD2J.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Freddie",
               "gender": 1,
               "credit_id": "52fe47f1c3a368484e0e1b85",
               "name": "Stockard Channing",
               "profile_path": "/5UFMOfbzod42UiPUna59Ch1e37a.jpg",
               "id": 8893,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Oscar",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1b89",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nicky",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1b8d",
               "name": "Warren Beatty",
               "profile_path": "/1fsYRe1WhIohbfk8qHmjMcuCXeJ.jpg",
               "id": 6449,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Justice of the Peace",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1b97",
               "name": "Ian Wolfe",
               "profile_path": "/ylp7puM2Hcd0VkQvXfmD7zkP4m7.jpg",
               "id": 2782,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "His Wife",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e1b9b",
               "name": "Rose Michtom",
               "profile_path": null,
               "id": 1177722,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Airline Steward",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1b9f",
               "name": "Brian Avery",
               "profile_path": "/2JUIGCOgpAgqbpuWtR9tVQjvJZ9.jpg",
               "id": 30050,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mrs. Gould",
               "gender": 1,
               "credit_id": "52fe47f1c3a368484e0e1ba3",
               "name": "Florence Stanley",
               "profile_path": "/vAmeCmnBkihYH2xhZ6mIpIMdJLm.jpg",
               "id": 84323,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Rattlesnake Tom",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e1ba7",
               "name": "Dub Taylor",
               "profile_path": "/rOP2Q3SidVsZn30CEk70bHz6k48.jpg",
               "id": 6463,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Girl Lover (as Nira Barab)",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e1bab",
               "name": "Catlin Adams",
               "profile_path": "/mnIfB8bGBxdfr9zEdYafdO1iUvL.jpg",
               "id": 52030,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Boy Lover",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1baf",
               "name": "Christopher Guest",
               "profile_path": "/fhEQq0q2aR2sh4HU824xunoyAce.jpg",
               "id": 13524,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Fisherman",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1bb3",
               "name": "Scatman Crothers",
               "profile_path": "/nzSlIgwX4vMSJhDPdUSkV9MAAai.jpg",
               "id": 7077,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "John the Barber",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e1bb7",
               "name": "Tom Newman",
               "profile_path": null,
               "id": 1177723,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "1st Policeman",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1bbb",
               "name": "Jim Antonio",
               "profile_path": null,
               "id": 111387,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "2nd Policeman",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e1bbf",
               "name": "Vic Vallaro",
               "profile_path": null,
               "id": 1177726,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Chief Detective Sergeant Jack Power",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1bc3",
               "name": "Richard B. Shull",
               "profile_path": "/eDosLV4XIsZoARHm77evMPACHUs.jpg",
               "id": 27515,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Police Secretary",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e1bcb",
               "name": "Kathryn Grody",
               "profile_path": "/bxmrevUhLWdWoaFtqy6SwGglgTn.jpg",
               "id": 164426,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Photographer",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1bcf",
               "name": "John Fiedler",
               "profile_path": "/wjhOLcxWaum0JIBIRMZaQQjrhQw.jpg",
               "id": 5247,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Officer",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e1bd3",
               "name": "George Roberts",
               "profile_path": null,
               "id": 1177728,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Dancer (uncredited)",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1bd7",
               "name": "Jerry Trent",
               "profile_path": null,
               "id": 1177729,
               "order": 19
            },
            {
               "cast_id": 23,
               "character": "Detective",
               "gender": 2,
               "credit_id": "5623f7c092514163d5003672",
               "name": "Joe Tornatore",
               "profile_path": null,
               "id": 84978,
               "order": 20
            },
            {
               "cast_id": 24,
               "character": "Prisoner in Holding Cell (uncredited)",
               "gender": 2,
               "credit_id": "59fc753192514113bb02af99",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e1b81",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47f1c3a368484e0e1b93",
               "name": "Carole Eastman",
               "profile_path": null,
               "id": 95782,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.407121,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 70259,
      "vote_count": 12,
      "budget": 3500000,
      "overview": "Two bumbling hustlers in the 1920s attempt to gain the fortune of an heiress. Nothing will stop them . Not even murder.",
      "similar": [],
      "original_title": "The Fortune",
      "runtime": 88,
      "poster_path": "/bgoLAArIZlEqYK7ohrNAFyBMnBS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Vista",
            "id": 14686,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1975-05-20",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Sexier than the Marx Brothers, handsomer than Laurel and Hardy but not as smart as The 3 Stooges",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Nichols"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Carole Eastman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073008/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMDM5MDYzMF5BMl5BanBnXkFtZTcwNzYxMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Stockard Channing, Jack Nicholson, Warren Beatty | See full cast and crew »"],
      "reviews": [
         "Mike Nichols' last good film that I'm sure bombed at the time. Stockard Channing almost steals the show as the young heiress, Warren Beatty is perfectly cast, and Nicholson is hilarious without doing much (great hair). There were a lot of good films in the 70's and this should have been included on most lists. A 7 out of 10. Best performance = Jack Nicholson. There are scenes that fall flat, but the ones that work make it worthwhile. Great costumes and art-set direction as well. It's hard to imagine these two actors (Beatty & Nicholson) playing the characters they did in REDS six years later after playing these buffoons. Give it a shot.",
         "Ramshackle farce with a few funny moments, mainly thanks to Nicholson's largely inspired comedic work, but little else. Mike Nichols is adept at coasting along on clever scripts,but he's clearly unable to salvage wayward material like this. In particular, the running gag which comprises the last half hour or so of the film wears incredibly thin. Beatty and Channing seem to be trying,to little avail, while Nicholson walks away with the film. He's particularly adroit in the first 20 minutes,before the film gets lost in it's own series of ambling vignettes. Still can't hold a candle to the old W.C. Fields or Laurel & Hardy films. Watch one of those instead.",
         "I don't know why I sat through this movie. Perhaps I thought there would be some redeeming moment but it just got on my nerves and never left until the end credits rolled. With actors like Channing and Nicholson, I expected a decent film but alas! The direction loses (or has no) focus. The screenplay's a big mess though. The actors are loud. Although Nicholson himself isn't as bad because he's quite different from his other films and does provide a few funny moments. Channing too has one funny moment where she runs away with a chicken. Seeing the positive comments, maybe I missed something but anyway, for me it was a waste of time.",
         "Stockhard Channing must be one of the most underrated comediennes about. This is an hilarious film. gridoon, who found it disappointing, seems to base his critique on the quality of the cast; Nicholson; Beatty & Channing. His expectations were probably pitched too high - and, sure, Five Easy Pieces is amazing, and Bonnie & Clyde is a classic. But The Fortune can stand on its own. It is very funny. The pace is hectic and the storyline has resonances of \"It Happened One Night\". The difference being that in the \"The Fortune\", the heroine is kidnapped - a botched attempt by two incompetents (Nicholson & Beatty). The so-called Swedish Syndrome seems to have rooted here, in that the captive falls for her captors & doesn't want to be saved. This film is well worth putting into DVD format - all Regions, please.",
         "A box office failure upon release, it just seems impossible to believe this genuinely hilarious film did not hit with audiences then and now is not the iconic cast and title it deserves to be. Columbia must have been aghast when it didn't set the box office on fire especially given what major stars Nicholson and Beatty were in '75. It is hard to find this film and if you have the time and luck to find a copy, try and also get THE FRONT and THE CHEAP DETECTIVE two other Columbia films around the same time that were reasonable successes and deserve to be major titles in anyone's home library.In Australia each of these films + HIGH ANXIETY suffered from the intro of colour TV and the cinemas all took a nosedive for 4 years 74-78. Very few films in thie period were big hits and cinemas closed in dozens. Pity as so many great films were made then and this comedy genuinely is one.",
         "*******CONTAINS SPOILERS!!!!!********** I am more than pleased that I finally got to see \"The Fortune\". After learning about it through various media, I was a little nervous about what I would find. But it didn't take long before the modest chuckles turned into belly laughs, for this is one HILARIOUS movie with real life good friends Beatty and Nicholson playing so well off each other, and obviously having a hoot doing so! Beatty is the bossy \"brain\" of the outfit. Married, unable to divorce and - due to the M.A.N.N. act - unable to take his mistress (Stockard Channing) legally across state lines to consummate their affair, he has come up with a brilliant scheme. His - in his eyes inferior to him - friend Nicholson can substitute as the groom, thereby making their traveling with a female completely legal. They move to California and during their travels it is already hinted at that the mistress is actually an heir to a great fortune, which Beatty tries to deny as long as possible. Upon their arrival in California it doesn't take long for Nicholson to develop (lusty) feelings for the heiress and soon consummates his \"marriage\" to her for real, in the absence of Beatty who is working as a car salesman. A fall-out follows during which the heiress comes to realize the two men are really only after her impending FORTUNE, and she threatens to give it all away to charity. The fear of that happening causes the two, unbelievably incompetent, men to bond and plan out another scheme> the heiress must die, so that they can get to her fortune. A slew of incredibly funny slapstick murder attempts follow and the acting Beatty and Nicholson show in these scenes is beyond hilarious. A must see for anyone who's in for intense laughter and joy.",
         "There's one very funny, very inspired moment in THE FORTUNE involving Stockard Channing, Jack Nicholson and the wing of an airplane. It's a shame the remainder of this short, lightweight movie isn't quite as amusing. Nicholson is blackmailed by shifty Warren Beatty into marrying kooky heiress Channing, thus allowing the already married Beatty to avoid any Mann Act related ramifications. The trio travels from New York to Los Angeles, where the boys attempt to bump off Channing in hopes of gaining her inheritance. It's directed by Mike Nichols and has a script by Carol Eastman (aka Adrien Joyce, writer of FIVE EASY PIECES) so it's very surprising how stillborn the film is. Channing tries mightily to channel Carole Lombard and Nicholson is hysterical, cast way against type as a dimwit. Beatty plays it broadly and is OK, although he's pretty out of sync with the rest of the performers. Excellent production values including pitch perfect 1930s art direction by Richard Sylbert and a fun score by David Shire help to make the film an enjoyable trifle, but an 88 minute trifle is not something you'd expect from such heavyweight talent. Bassett hound faced Florence Stanley has a few choice moments as a very hot and bothered landlady.",
         "'The Fortune' is a crime comedy, centred around the dubious exploits of two 1920s conmen, promisingly played by Jack Nicholson and Warren Beatty. Their job is to cheat a wealthy woman out of her fortune, and the film starts off positively. The film's song, 'I Must Be Dreaming', is quite enjoyable, and I was glad to see Nichols reuse it in the credits at the end. Unfortunately, it all goes downhill from the hopeful first scene. The premise was interesting, but it may have been performed better if the film was more serious. It felt a little like a rom-com, road movie version of 'The Great Gatsby', and the effect wasn't very good. The script was a little off at times, and I think that, in places, Beatty failed to remain on Nicholson's level during their usually fun exchanges. There were a few genuinely funny scenes, but I don't think there were enough of them to justify watching this. Other scenes degenerated into mind- numbing silliness, almost to the point where the viewer forgets the plot or the premise of 'The Fortune'. Overall, I was quite disappointed with this film. Nicholson, as ever, delivered a great performance, but I don't think that 'The Fortune' operated along the right lines. It could have channelled the atmosphere of 'McCabe & Mrs. Miller', or been a serious Prohibition crime film, but its direction steered it into becoming a very mediocre comedy.",
         "It seems ironic that three doomed projects that Mike Nichols directed starred Jack Nicholson (\"The Fortune\", \"Heartburn\" and What Planet Are You From?\"). Nicholson along with Meryl Streep was in \"Heartburn\" and Warren Beatty and in \"The Fortune\" which marked the debut of Stockard Channing of \"Grease\" fame. I have a problem of watching stupid people commit some of the dumbest things. It makes me cringe to see such talented performers like Beatty, Nicholson and Channing would lower their standards to playing these characters. Even awful films like \"Ishtar\" directed by Nichols and starring Beatty has more things going for over the abominable \"The Fortune\". This movie takes its place in the annals of other 1970's stinkers like \"The Frisco Kid\" that starred an odd pairing of Gene Wilder and Harrison Ford and was directed by Robert Aldrich (both were period pieces with \"The Frisco Kid\" set in 1850's while \"The Fortune\" was set in the roaring 1920's). Due to the restriction of the Mann Act, it was against the law that a man to transport a woman across state lines for purposes that were deem immoral, which was at the time having sex outside of wedlock. To avoid such penalization, the cautious Nicky (Warren Beatty), who's struggling from divorcing his wife, manipulates his friend Oscar (Jack Nicholson) to marry Frederica (Stockard Channing), who's about to become extremely wealthy. She was oblivious when her husband arrived at the wedding ceremony drunk orchestrated by Nicky. The three travel by berths from the East to Los Angeles and settle in a stucco house that is owned by a workaholic Mrs. Gould (Florence Stanley). Oscar wants to go over some nuptial agreements to this marriage and property matters (which also means intercourse to prevent this marriage from being null and void). Nicky is harried at his friend's neediness and idiocy to the person he falsely claims he loves. Once Freddie knows that she's being conned by the two men who are after her fortune, she starts becoming vocal about donating the fortune she's about to receive. This means that the boys must do something drastic before she does such a task. The antics are awkward and lacks in anything logical even for a screwball comedy. There's no wit or reasonable approach to their schemes to the point where you don't really care for the characters. It's a complex procedure as to find the right ingredient for a comedy to work, but it's even more complex into unravel how a comedy can flop. I mean the script was written by Carole Eastman who in past wrote several films in which Nicholson starred in like \"The Shooting\" and \"Five Easy Pieces\". You have a very capable director Mike Nichols who has been more successful in adaptations like \"Who's Afraid of Virginia Woolf?\" and \"Angels in America\". And we have top quality stars here like Warren Beatty, Jack Nicholson and Stockard Channing who have had great success in the movie world. So where did we go wrong? I can play the blame game to just about anyone, but the culprits behind this abomination goes to writer Eastman and director Nichols. Eastman wrote pedestrian dialogue, awful characters, the plot devices are incoherent and she had the chance to edit out these abysmal devices and try to make it work. The horrible comical timing is partly Nichols to blame as well as the thespians. It's not he was a stranger to them (he directed Nicholson in the 1971 classic \"Carnal Knowledge\"). Beatty does not have much humour implanted in him, but had his moments in \"Bulworth\" which he directed himself. Sure there may have been some people who found this film funny and you know what? That's fine you are all entitled to your opinions. It's no surprise that the Coen Brothers like it (especially Joel). To each their own I say. If you are curious to see this movie, well do not let me stop you. I just will not consider watching it again, ever.",
         "Jack Nicholson, Warren Beatty, and Stockard Channing are at their comedic best in this movie. It's kind of one of those goofy 'buddy' movies where Nicholson and Beatty play off each other marvelously with Channing thrown into a great ditzy role. If you want to see comedy acting at its finest..."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Vista"
      ],
      "summaries": [
         "The early 1900's with its Mann-Act (disallowing women to be transported across State lines for immoral reasons) brings a married man to devise a scheme for taking his upper-class girlfriend away with him... he simply has her marry his unmarried buddy. However, it doesn't take very long before both men start laying claim to her affection... until, that is, she's about to be cut out of her parent's fortune. So, a new scheme is devised, which only adds to their problems, as well as to the sly whimsy of this film.",
         "Two bumbling hustlers in the 1920s attempt to gain the fortune of an heiress. Nothing will stop them, not even murder."
      ],
      "budget": 0
   },
   "movielensId": 26343,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-05-20",
      "dvdReleaseDate": null,
      "directors": ["Mike Nichols"],
      "runtime": 88,
      "movieId": 26343,
      "title": "The Fortune",
      "mpaa": "",
      "actors": [
         "Stockard Channing",
         "Jack Nicholson",
         "Warren Beatty",
         "Ian Wolfe",
         "Rose Michtom",
         "Brian Avery",
         "Florence Stanley",
         "Dub Taylor",
         "Catlin Adams",
         "Christopher Guest",
         "Scatman Crothers",
         "Tom Newman",
         "Jim Antonio",
         "Vic Vallaro",
         "Richard B. Shull",
         "Kathryn Grody",
         "John Fiedler",
         "George Roberts",
         "Jerry Trent",
         "Joe Tornatore",
         "Harry Dean Stanton"
      ],
      "imdbMovieId": "0073008",
      "originalTitle": "The Fortune",
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two bumbling hustlers in the 1920s attempt to gain the fortune of an heiress. Nothing will stop them . Not even murder.",
      "tmdbMovieId": 70259,
      "avgRating": 2.96875,
      "releaseYear": "1975",
      "numRatings": 16,
      "posterPath": "/bgoLAArIZlEqYK7ohrNAFyBMnBS.jpg"
   }
}