{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "bullying",
            "id": 6733
         },
         {
            "name": "class discrimination",
            "id": 215773
         }
      ],
      "imdb_id": "tt0082892",
      "video": false,
      "title": "Peter-No-Tail",
      "recommendations": [
         21842,
         30583,
         37728,
         37727,
         37730,
         22192,
         30576,
         13619,
         23654,
         29224
      ],
      "backdrop_path": "/h09WBPkGRhQpuz7AHVV7qb2rDYz.jpg",
      "revenue": 955401,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Pelle Svanslös",
               "gender": 2,
               "credit_id": "52fe4738c3a36847f8129c9f",
               "name": "Mats Åhlfeldt",
               "profile_path": null,
               "id": 139087,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Maja Gräddnos",
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129ca3",
               "name": "Ewa Fröling",
               "profile_path": "/gV1Ek3IPNBDAIoWUeUGgUa4K44t.jpg",
               "id": 46866,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Elake Måns",
               "gender": 2,
               "credit_id": "52fe4738c3a36847f8129ca7",
               "name": "Ernst-Hugo Järegård",
               "profile_path": "/2gBartKA2m6BbEAPBbVhS2RDLhi.jpg",
               "id": 56882,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Bill / Stövlarna",
               "gender": 2,
               "credit_id": "52fe4738c3a36847f8129cab",
               "name": "Carl Billquist",
               "profile_path": "/yVzeJ61by875R6MyHteGYVqokKa.jpg",
               "id": 139088,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Bull",
               "gender": 2,
               "credit_id": "52fe4738c3a36847f8129caf",
               "name": "Björn Gustafson",
               "profile_path": "/kthYEmbkQdGGAU8iGo4eLZuf5w3.jpg",
               "id": 139089,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Gammel-Maja",
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129cb3",
               "name": "Wallis Grahn",
               "profile_path": "/gOgrd6HvJsaaW0g4AVu44EQlbAW.jpg",
               "id": 141565,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Gullan från Arkadien",
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129cb7",
               "name": "Lena-Pia Bernhardsson",
               "profile_path": "/xS5DOlmaXDg36Z0MzWPZmCWxt21.jpg",
               "id": 116611,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Laban från Observatorielunden",
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129cbb",
               "name": "Charlie Elvegård",
               "profile_path": "/j5W7ryTeGFgx12POO6NPrMOltwD.jpg",
               "id": 572062,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Murre från Skogstibble",
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129cbf",
               "name": "Åke Lagergren",
               "profile_path": null,
               "id": 573567,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Rickard från Rickomberga",
               "gender": 2,
               "credit_id": "52fe4738c3a36847f8129cc3",
               "name": "Nils Eklund",
               "profile_path": null,
               "id": 402686,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Fritz",
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129cc7",
               "name": "Jan Sjödin",
               "profile_path": null,
               "id": 573568,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Den Tjocka Råttan",
               "gender": 2,
               "credit_id": "52fe4738c3a36847f8129ccb",
               "name": "Eddie Axberg",
               "profile_path": "/iATAVnD6eTuvsenUYmIFW87dodc.jpg",
               "id": 58304,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Mamman",
               "gender": 1,
               "credit_id": "52fe4738c3a36847f8129ccf",
               "name": "Helena Brodin",
               "profile_path": "/rMzdQRE406A8CBEpCJvqYpTQFRv.jpg",
               "id": 323149,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Pappan",
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129cd3",
               "name": "Axel Düberg",
               "profile_path": null,
               "id": 48574,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c6b",
               "name": "Jan Gissberg",
               "profile_path": null,
               "id": 112886,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c71",
               "name": "Stig Lasseby",
               "profile_path": null,
               "id": 139056,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c77",
               "name": "Stig Lasseby",
               "profile_path": null,
               "id": 139056,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c7d",
               "name": "Gösta Knutsson",
               "profile_path": null,
               "id": 139082,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4738c3a36847f8129c83",
               "name": "Leif Krantz",
               "profile_path": null,
               "id": 139083,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c89",
               "name": "Berndt Egerbladh",
               "profile_path": null,
               "id": 139084,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c8f",
               "name": "Eberhard Fehmers",
               "profile_path": null,
               "id": 139085,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c95",
               "name": "Jan Gissberg",
               "profile_path": null,
               "id": 112886,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4738c3a36847f8129c9b",
               "name": "Jan Gissberg",
               "profile_path": null,
               "id": 112886,
               "department": "Writing",
               "job": "Storyboard"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.421401,
      "production_countries": [{
         "iso_3166_1": "SE",
         "name": "Sweden"
      }],
      "id": 47542,
      "vote_count": 8,
      "budget": 48740,
      "overview": "Peter-No-Tail is a cat who's born without a proper tail on a farm by the Swedish countryside. Due to economical difficulties, the farmer is forced to get rid of Peter. The farmer can't bring himself to drown the cat, so he sneaks Peter inside the car of a family who are renting a house close to the farm for their summer vacation. When the family finally reach their home in Uppsala, Sweden, they find Peter and decide to keep him. Without a tail, he becomes the talk of the town among the other cats and, especially Mike, who teases him cruelly. Mean Mike and his two companions, Bill and Bull,  are notorious for the nasty tricks they like to play on other cats. Mike is currently trying to court Molly Silk-Nose, but his rough and silly approach does not impress her, since she becomes interested in the kind and gentle Peter. But Mike won't give up that easily and he has a plan for how he'll get his revenge.",
      "similar": [
         62211,
         862,
         378064,
         585,
         49013,
         28178,
         269149,
         920,
         449176,
         13523,
         151960,
         1265,
         376660,
         286565,
         23168,
         40807,
         41630,
         13310,
         55721,
         272693
      ],
      "original_title": "Pelle Svanslös",
      "runtime": 81,
      "poster_path": "/7KMM1nov4277UShTa5HSdywDFky.jpg",
      "spoken_languages": [{
         "name": "svenska",
         "iso_639_1": "sv"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sandrews",
            "id": 1728,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Treklövern HB",
            "id": 7834,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Team Film AB",
            "id": 7835,
            "origin_country": ""
         },
         {
            "logo_path": "/fzxheYVOrjErOMDo0kgN6WsOZxg.png",
            "name": "Svenska Filminstitutet",
            "id": 2302,
            "origin_country": "SE"
         }
      ],
      "release_date": "1981-12-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "A Cat With A Heart of Gold",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jan Gissberg",
         "Stig Lasseby"
      ],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Gösta Knutsson",
         "Leif Krantz"
      ],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0082892/",
      "coverLink": null,
      "actors": ["Stars: Mats Åhlfeldt, Ewa Fröling, Ernst-Hugo Järegård | See full cast and crew »"],
      "reviews": [
         "I remember seeing this film as a child and getting my mum to tape it so that I could watch it over and over again. I didn't even realise it was Swedish so know it as Peter-No-Tail. It's the story of a cat born without a tail who tries to fit in but gets bullied by the other cats. Things just don't seem to go quite right for him, getting caught in a house fire and being pushed over in a running race. It's actually quite sad and you feel sorry for Peter-No-Tail but it is an excellent film and well worth a watch if you ever get the opportunity to see it. Hopefully it will be released in English someday.",
         "It's been a while since I last saw this film, as a matter of fact, Pelle Svanslös is one of the first films I saw as a child. The story is about a Pelle, a cat who was born without a proper tail. Of course, Pelle soon becomes the laughing stock of the town, because the other cats think that \"he can't be a proper cat if he doesn't even have a proper tail\". Since this is a children's story the film evidently has a moral. Fortunately it isn't overdone, and the message of acceptance and equality is conveyed without having to rely on cheap sentimentality. However, the film is a bit sad at times, mainly because of the abuse Pelle has to take from the other cats. Don't worry though, it all turns out fine in the end. Still, I cried my our eyes out the first time I saw it. But give me some credit, I was only five years old at the time.",
         "(Possible Spoilers) I saw this film years ago on the Disney Channel and I still have it on tape. I like this cartoon Peter no-tail was a cat from the country that was born without a tail who was adopted by a family in the city. Peter was a kind and caring cat who was teased and tormented by the other cats, especially Max, the town bully. It was kind of sad in a way but with good results. Max tried so hard to turn all the other cats against Peter, which worked for a while but each time Peter came out looking good and Max got made a fool of. 1st Max holds a dance along with a multiplication quiz in which Peter ends up being the winner. Then Max holds a cat Olympics that he tries to cheat in by making a heavy ball just for Peter to throw while he and everyone else use light weight balls, and giving Peter spike shoes to run in with spikes on the inside and finally in the race cheating by having cats at the side hold their tails down for Max as he passes and holding their tails up when Peter passes so Peter would trip and fall. However, at the end of the Olympics Max was disqualified and Peter was the winner and won the gold metal. Once again Max got made a fool of. So, Max tries one last time to get rid of Peter by trying to have a bulldog chase Peter back to the country. This is where Peter becomes a real hero to the other cats, he saves a kitten of one of the cats (Frida) from being attacked by the bulldog and just in time. After that All the other cats cheered for Peter and called him a hero while Max and his partners Bill and Bull get chased by the bulldog to the country. This film had a good moral to it, especially for children: Bullies don't win or come out good in the end nor do they ever win. Look what happened to Max. But throughout everything Peter always remained kind to everyone. It is a shame that this film is not well known because it is a cartoon that everyone at a young age should see. It is a wonderful cartoon.",
         "The focus on entertainment is so high in most animation films for children that they tend to neglect the educational content.This is one major reason why over a period of time children become bored with animation films.Swedish animation film 'Pelle Svanslös' is a different animation film which not only entertains the children but also educates young adults.It has been directed by Jan Gissberg and Stig Lasseby who depict what happens when some animals especially cats start to behave like human beings ? As a film with a lot of educational content 'Pelle Svanslös' has numerous episodes about cats' interactions with each other.No viewer would remain emotionally untouched by episodes such as a cat wooing other cat, a cat who uses all kinds of dishonest tricks to prevent an intelligent yet unlucky cat to achieve greater glory. Although the cats have major roles in this film,the presence of human beings has not been sacrificed in this film.This might well be considered an excellent reason to watch this film with one's family members.",
         "Whilst other children of my generation were enthralled by Disney movies, I was busy watching a very obscure Swedish gem known as \"Peter No Tail.\" To this day, felines have always been my favorite creatures, and as a wee girl I had a bit of an obsession with them. Yeah. So obviously this little film caught my interest, way back when Stop and Shop (as you can tell I'm a New Englandah), had movie rentals! Not to mention the rarest ones such as this! Peter No Tail is a unique story of a family who want to adopt a cat. The local farmhand's cat had just given birth to a litter of kittens, and he was selling them. But alas, nobody would adopt Peter, the kitten who was, uh, lacking in the tail department. Finally, a family take him in, give him a cute little cap to wear and green bow-tie and everything! It's a cute and offbeat look at how Peter tries to win the heart of the cat community, despite their scoffing at him and his tail lackage (is that a word?). He competes with a nasty cat named Max, and his sidekicks, Bill and Bull, in a sort of athletic decathlon and to win the heart of a lovely feline female. It's a tad bit dated, but considering the fact that it's a 25 year old flick, it's still wonderful today and I still own a copy...somewhere.",
         "This film was edited in Catalán a few years ago. The film was also translated and dubbed into Spanish (Pedro sin cola). In Catalán it's named Pere sense cua. When I was a child I loved this film. The only thing I can't like about it is the treatment of a she-cat like she's stupid. But it's the only \"bad\" thing. This film is great, beautiful, funny... The little cat had no tail. The farmer saves his life hiding him inside a car... and then he's adopted. He is a kind cat, he find some friends in the city and also an enemy and his followers. I recommend this film to all the people who has children at home.",
         "Aah...Peter-no-Tail. A trip down memory lane. I originally viewed this animated feature back in 1983, I believe, when it came on HBO. Of course, I has watched this when it was dubbed in English. The animation wasn't as top-notch as I'd liked, but the story was cute and so were the characters! With the right mix of drama, humor, and action, I did enjoy this title. Out of the entire English vocal cast, I do recall Dom Deluise in there as well as Larry Storch, two actors I liked. Of course, any feature that had Dom DeLuise as a cast member would be memorable. This feature is perfect for any family looking for decent entertainment."
      ],
      "genres": [
         "Animation",
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Sandrews",
         "Svenska Filminstitutet (SFI)",
         "Teamfilm AS"
      ],
      "summaries": ["Pelle is a cat who was born without a proper tail. He is taken care of by a family living in Uppsala. Without a tail, he becomes the talk of the town among the other cats, and especially Måns, who teases him cruelly. Måns' rough and silly courting of Maja Gräddnos does not impress her, since she becomes interested in the kind and gentle Pelle. But Måns won't give up that easy..."],
      "budget": 0
   },
   "movielensId": 26448,
   "movielens": {
      "languages": ["svenska"],
      "releaseDate": "1981-12-25",
      "dvdReleaseDate": null,
      "directors": [
         "Jan Gissberg",
         "Stig Lasseby"
      ],
      "runtime": 81,
      "movieId": 26448,
      "title": "Peter-No-Tail",
      "mpaa": null,
      "actors": [
         "Mats Åhlfeldt",
         "Ewa Fröling",
         "Ernst-Hugo Järegård",
         "Carl Billquist",
         "Björn Gustafson",
         "Wallis Grahn",
         "Lena-Pia Bernhardsson",
         "Charlie Elvegård",
         "Åke Lagergren",
         "Nils Eklund",
         "Jan Sjödin",
         "Eddie Axberg",
         "Helena Brodin",
         "Axel Düberg"
      ],
      "imdbMovieId": "0082892",
      "originalTitle": "Pelle Svanslös",
      "genres": [
         "Romance",
         "Family",
         "Animation",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Peter-No-Tail is a cat who's born without a proper tail on a farm by the Swedish countryside. Due to economical difficulties, the farmer is forced to get rid of Peter. The farmer can't bring himself to drown the cat, so he sneaks Peter inside the car of a family who are renting a house close to the farm for their summer vacation. When the family finally reach their home in Uppsala, Sweden, they find Peter and decide to keep him. Without a tail, he becomes the talk of the town among the other cats and, especially Mike, who teases him cruelly. Mean Mike and his two companions, Bill and Bull,  are notorious for the nasty tricks they like to play on other cats. Mike is currently trying to court Molly Silk-Nose, but his rough and silly approach does not impress her, since she becomes interested in the kind and gentle Peter. But Mike won't give up that easily and he has a plan for how he'll get his revenge.",
      "tmdbMovieId": 47542,
      "avgRating": 3.16981,
      "releaseYear": "1981",
      "numRatings": 53,
      "posterPath": "/7KMM1nov4277UShTa5HSdywDFky.jpg"
   }
}