{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0085482",
      "video": false,
      "title": "El Norte",
      "recommendations": [
         209496,
         38643,
         42011,
         26580,
         127878,
         41386,
         19275,
         59964,
         76142,
         48918,
         47324,
         55700,
         92968,
         54280,
         41773,
         53156,
         64499,
         57106,
         54989,
         38301
      ],
      "backdrop_path": "/aSbUMJw8EyuSVgIUCxUkz52yito.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Rosa",
               "gender": 1,
               "credit_id": "52fe47259251416c7508f3e3",
               "name": "Zaide Silvia Gutiérrez",
               "profile_path": "/oe6TB7VKyAiYOdfHZJvXu08CBhL.jpg",
               "id": 36635,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Enrique",
               "gender": 2,
               "credit_id": "52fe47259251416c7508f3e7",
               "name": "David Villalpando",
               "profile_path": "/ACv7B0i41LAkniIHQ1iXgGdjiX.jpg",
               "id": 146797,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Arturo",
               "gender": 2,
               "credit_id": "52fe47259251416c7508f3eb",
               "name": "Ernesto Gómez Cruz",
               "profile_path": "/4uPa3ParQSUnNapwUpFoYvusMiP.jpg",
               "id": 7368,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Nacha",
               "gender": 1,
               "credit_id": "52fe47259251416c7508f3ef",
               "name": "Lupe Ontiveros",
               "profile_path": "/pnZMPs7BVeUv7rDOrtWdPEc5hAL.jpg",
               "id": 28779,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Monte",
               "gender": 2,
               "credit_id": "52fe47259251416c7508f3f3",
               "name": "Trinidad Silva",
               "profile_path": "/mvJy15qgxM0cFst7pfnh80RZjVO.jpg",
               "id": 146798,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lupe",
               "gender": 1,
               "credit_id": "57ab179bc3a36850f500003c",
               "name": "Alicia del Lago",
               "profile_path": "/1n5hFOy625SaSiwREzQGWagjroi.jpg",
               "id": 1026995,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Informer",
               "gender": 2,
               "credit_id": "57ab179b92514149a500001b",
               "name": "Mike Gomez",
               "profile_path": "/ctCzEwQE1IeD2XiHvvATXX4jdU6.jpg",
               "id": 162235,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Foreman",
               "gender": 0,
               "credit_id": "57ab179b9251412a38000b72",
               "name": "Jose Martin Ruano",
               "profile_path": null,
               "id": 1664235,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Josefita",
               "gender": 0,
               "credit_id": "57ab179cc3a368519c000006",
               "name": "Stella Quan",
               "profile_path": null,
               "id": 1664236,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Pedro",
               "gender": 0,
               "credit_id": "57ab179c92514149a800001f",
               "name": "Heraclio Zepeda",
               "profile_path": null,
               "id": 1664237,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Luis",
               "gender": 0,
               "credit_id": "57ab179c92514110e4001426",
               "name": "Emilio Gomez Ozuna",
               "profile_path": null,
               "id": 1664238,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Encarnacion",
               "gender": 0,
               "credit_id": "57ab179dc3a368082f00154c",
               "name": "Daniel Lemus Valenzuela",
               "profile_path": null,
               "id": 1664239,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "El Puma the Soldier",
               "gender": 2,
               "credit_id": "57ab179d92514110e400142a",
               "name": "Rodrigo Puebla",
               "profile_path": "/kLHO3WMu1PwH2C3zHBI7yxwuQPn.jpg",
               "id": 1486678,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Josefita's Daughter",
               "gender": 0,
               "credit_id": "57ab179d925141125e001607",
               "name": "Yosahandi Navarrete Quan",
               "profile_path": null,
               "id": 1664240,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Ramon",
               "gender": 2,
               "credit_id": "57ab179dc3a368788400189a",
               "name": "Rodolfo De Alexandre",
               "profile_path": null,
               "id": 56962,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Truck Driver",
               "gender": 0,
               "credit_id": "57ab179e92514149e400000b",
               "name": "Emilio Del Haro",
               "profile_path": null,
               "id": 1664241,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Coyote at Bus Station",
               "gender": 0,
               "credit_id": "57ab179e92514149a8000024",
               "name": "Palomo Garcia",
               "profile_path": null,
               "id": 1664242,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Jeering Slumdweller",
               "gender": 0,
               "credit_id": "57ab179e92514149df00001e",
               "name": "Ismael Gamez",
               "profile_path": null,
               "id": 1664243,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Jeering Slumdweller",
               "gender": 0,
               "credit_id": "57ab179fc3a36850f5000041",
               "name": "Silverio Lujan",
               "profile_path": null,
               "id": 1664244,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Jeering Slumdweller",
               "gender": 0,
               "credit_id": "57ab179fc3a36850f5000046",
               "name": "Socorro Velazquez",
               "profile_path": null,
               "id": 1664245,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47259251416c7508f3d3",
               "name": "Gregory Nava",
               "profile_path": "/n7P75gJWuUhvJKzVw6hJeL8rDoP.jpg",
               "id": 16395,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47259251416c7508f3d9",
               "name": "Gregory Nava",
               "profile_path": "/n7P75gJWuUhvJKzVw6hJeL8rDoP.jpg",
               "id": 16395,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "52fe47259251416c7508f3df",
               "name": "Anna Thomas",
               "profile_path": null,
               "id": 16396,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5ac4146792514126c303dbe1",
               "name": "James Glennon",
               "profile_path": null,
               "id": 35511,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ac4147292514126be040969",
               "name": "Betsy Blankett Milicevic",
               "profile_path": null,
               "id": 1431478,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.942902,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 17435,
      "vote_count": 20,
      "budget": 0,
      "overview": "Brother and sister Enrique and Rosa flee persecution at home in Guatemala and journey north, through Mexico and on to the United States, with the dream of starting a new life.",
      "similar": [
         3134,
         11564,
         8810,
         281,
         948,
         298312,
         133805,
         2142,
         22323,
         294963,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         170,
         8923,
         241
      ],
      "original_title": "El Norte",
      "runtime": 141,
      "poster_path": "/lsAr6Eu2r4RnQ4M4CFLjYHVUzjZ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Independent Productions",
            "id": 626,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American Playhouse",
            "id": 3906,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         }
      ],
      "release_date": "1983-10-11",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gregory Nava"],
      "runtime": 141,
      "synopsis": null,
      "writers": [
         "Gregory Nava",
         "Anna Thomas"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0085482/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwMTcyODQwN15BMl5BanBnXkFtZTcwNTc1ODQyMg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Zaide Silvia Gutiérrez, David Villalpando, Ernesto Gómez Cruz | See full cast and crew »"],
      "reviews": [
         "I saw El Norte (The North) some years ago when my then girlfriend (whose father was from Mexico) rented the video and made me watch it. I'm glad she did. It covers the very basic quest story of a brother and a sister who flee Guatemala (where the indigenous population was being exterminated) through Mexico to try and find a new life in the US. Along the way they encounter all the setbacks you would imagine, including a few you don't expect. This is a serious and dramatic film that is also not afraid to find the humor that can still occur in the midst of deep struggle. I understand that this movie was made on a shoestring and at times it shows. But the story and the acting more than carry the day. Its creative team (Gregory Nava and his wife Anna Thomas) are also responsible for the movies Selena and Mi Familia (among others), both excellent films. I think that the real history of most people living on the earth, who live ordinary lives and struggle against sometimes oppressive forces outside their control, has largely gone unwritten. In its own small way, this movie begins to make up the deficit. Excellent--highly recommended",
         "Gregory Nava's drama, \"El Norte,\" is hands-down the best film ever made about the Latin American immigrant experience in the US. It's also one of the best films of the 80's. Wonderfully acted and expertly directed, this film will make you think twice about the \"invisible\" people who clean your house, watch your kids, make your food, garden your yard, wash your car, etc. This movie puts a face to those people and their day-to-day struggles here in this country. It's not always a pretty picture. Although this film is fictional, at times it feels like a documentary. It's not a documentary however, because it's also quite funny and it contains elements of magical realism. This film is a landmark of Latino filmmaking in the US. Watch it today!",
         "In the 1980s, military repression and civil warfare intensified in both Guatemala and El Salvador, resulting in massacres, forced displacement, and political assassinations. Thousands left Central America to come to America, most of them illegally. Those who entered the U.S. filed for political asylum but despite the reports of murders and disappearances, barely three percent of applicants received asylum. Today, approximately half of Salvadorans and Guatemalans living in the U.S. have less than an eighth grade education and most work long hours in jobs on the low end of the pay scale and their situation makes it nearly impossible to advance or make long term plans. Gregory Nava's 1983 Indie film El Norte describes the plight of two young Guatemalans, Enrique (David Villalpando) and his sister Rosa (Zaide Silvia Gutierrez) who face reprisals from the military after participating in a protest meeting and undertake a hazardous journey to \"the north\" to find a better life. The film is divided into three parts: \"Arturo Xuncax\", describing the circumstances that caused the family to leave Guatemala \"El Coyote\", detailing their hazardous journey to reach the U.S., and \"El Norte\", telling the story of their life in Los Angeles. While El Norte does have a strong political message, the core of the film is the relationship between Enrique and Rosa. The hardships of the journey are told in graphic detail, especially the last test of crossing the border by crawling on their hands and knees through an abandoned sewer line populated by hordes of rats. Things seem to be bright, however, when they arrive in Los Angeles. He becomes a busboy in an upscale restaurant, she finds work as a maid in Beverly Hills, and both try to learn English in their free time. They soon find, however, that life in the U.S. is not all that it appears and their situation unravels when Enrique is reported to INS officials by a jealous employee. El Norte wears its heart on its sleeve and the film tends toward the melodramatic, but it faithfully mirrors the fear and uncertainty that illegal immigrants face each day and I can forgive its flaws and applaud the loving bond between brother and sister and the strength it produces in their lives.",
         "What a beautiful, powerful and endearing film that Gregory Nava has given the general film watching public. While few people have ever seen this film, it rates as one of the best films ever in regards to Latin American cinema. Sure, the budgetary constraints can be seen in many parts of this film, but the overall artistic stamp of the film more than makes up for the lack thereof. In our current society of anti-immigration, one has to experience the pain and torment some of the people have to experience just to get the chance to live in America. This spirit alone gives me respect for most working immigrants, even if some are illegal. Even 20 years from now, Latin American film courses will still use this film as one of its finest examples.",
         "El Norte (1983) is sadly an overlooked and underrated film from Gregory Nava. Before he made bio-pictures for Hollywood, Mr. Nava was a great film maker. His heart breaking EL NORTE is about two central American Indian peasants who risk everything so they could start a new life in the land of milk and honey \"El Norte\". They struggle through many hardships in their travels from Guatemala through the rough and wild terrain of Mexico and the sleazy \"Coyotes\" who always try to make a buck on the blood and sweat of these immigrant workers who want a chance at the American way of life. Politics aside (people who have read my reviews know which side I stand on) you have to feel for these people who are willing to work for little just so they could have useless things. Ironically their hard work makes it able for people to buy at cost produce and cheaper goods. A gritty film that'll make you think about what these so called \"illegals\" have to go through. I wished this movie was available on d.v.d. in a restored format. I saw this film many years ago. The print was dark and grainy. The audio was no great shakes either. One day, people will be able to see this film. Until then check your local libraries or maybe by some ray of hope P.B.S. will air it once more (but considering the current leadership of P.B.S. that's highly unlikely). Highest recommendation possible.",
         "Like Ruben Martinez's recent nonfiction work on Latino emigrants, \"Crossing Over,\" Gregory Nava's film, \"El Norte,\" begins with a re-working of the Passion Play--only this time the Christ figure is Arturo Xuncax, a Guatemalan Indian and guerilla leader, who's betrayed to the landowner/elites by one of his own followers. As a result, Xuncax and his \"disciples\" are killed in a bloody nocturnal raid staged by the elites' enforcers--members of the Guatemalan military--and Arturo's severed head is suspended by rope from a tree limb to serve as a warning to others who may conspire against the Oppressor. Viewers are forgiven, therefore, if they expect a story of political martyrdom and vengeance, since it is Arturo's son, Enrique, who takes up the machete that his murdered father (a \"Man of Peace\") refused to bring along with him to his fate. Instead, Enrique is advised by a friend to strike out to \"el Norte.\" And since the military has vowed to de- populate Arturo's village, this would appear to be sound advice. Thus begins one of the best \"journey\" films ever made. Enrique and his sister, Rosa (presumably, both are still in their teens), make the long trek from their once-idyllic Central American mountain village to what they mistakenly believe will be a comfortable, material existence in California, US of A. While the Guatemalan scenes in \"El Norte\" are dark, foggy, murky, and formally paced, the second section of the film (subtitled \"El Coyote\") begins with a blast of mariachi music and we see the pair of young travelers on a bright, sunlit, modern Mexican highway. Most of this section deals with Rosa and Enrique's efforts to cross the Mexi-Cali border, yet this portion also gives the director a chance to delineate the personalities of his hero and heroine. Enrique is characterized as an idealist, a dreamer, eternally kind at heart to everyone. No less kinder is Rosa. But as Enrique explains to a retired smuggler, \"I think she is stronger than the two of us put together.\" He's right. Rosa possesses a harder edge than Enrique--an inner strength, in fact, that makes her the emotional and spiritual center of the film. On a bus ride through the Mexican countryside, she refuses to close the window next to her seat, despite the protests of a man sitting behind her; she refuses to be prevented from embracing and observing life as it truly is. Rosa is a realist. While in Tijuana, she explains to Enrique that the sale or pawning of their mother's jewelry is the only practical way they can finance their crossing over to America. Enrique, ever the sentimentalist, objects. But Rosa insists; and in the end, she wins this minor argument. Brother and sister do manage to make it across the borderline--but at a terrible price that doesn't become evident until the film's conclusion. \"El Norte\" was made on a shoestring; but Nava's direction is clever, sometimes in a style reminiscent of late-50's French New Wave, but more often as naturalistic as an Upton Sinclair novel. Indeed, a scene showing Enrique flexing his muscles while begging for work with a construction crew seems an obvious reference to Sinclair's \"The Jungle.\" The film is very well-cast, every scene directed economically but effectively. There is no waste-motion in this movie. Its rhythm is lyrical without being needlessly reflective. The acting is first-rate, especially the performances of two of the minor players: Lupe Ontiveros (as Nacha, Rosa's friend in Los Angeles) and Trinidad Silva (as Monte, the cynical, opportunistic baseball fanatic).",
         "This film portrays the plight of 2 illegal immigrants, as they flee to the U.S. from Guatemala. But this movie is much, MUCH more than that. It cuts through all the stereotypes and attitudes the socially and economically privileged harbor against the foreigner. You need not know English or Spanish to understand this movie, because you feel everything so completely through the two main characters. Anyone with any heart at all will enjoy this movie. With typical latin fatalism, this movie illustrates how people must sometimes bear the unbearable, because they have no other choice.",
         "Having taught illegal immigrants for decades, this movie intrigued me. From what I have been told by the parents of my students, this movie correctly depicts the lives of many of people who struggle to get to this country. I also know from working with older students, that the life shown in the movie in Southern California is also accurate. When I taught college sociology classes, I made this movie mandatory viewing (along with \"Emerald Forest\" and \"Belzaire the Cajun.\" Don't expect a 'feel-good' movie--it's not this one. Do expect to get a glimpse into the lives of millions of people who now live in the United States, and what it took to get here. PS--Much of this movie is in the Spanish and South American Indian language (with subtitles). Block out the bottom of the screen if you want to practice your español. ¡Qué bueno! (Si, yo hablo español.)",
         "I first saw this movie in 1989 or so and, being in high school and rather naive at the time, was blown away by unromantic portrayal of the lives of two Guatemalan refugees living as illegal immigrants in California. I still find it a moving film. Siblings Arturo and Rosa flee their mountain village after their father is killed and trek across Mexico with dreams of living in the United States -- \"El Norte.\" The story is sprinkled with humor, but the overall theme is tragedy. The political overtones are forceful as well; the course of one's life depends more on where one was born than how resourceful one is. This idea is explored in the contrast between the situations faced by the refugees and those of Americans they encounter. Arturo's struggle to find work is perilous, and demands huge sacrifices. Thankfully, the movie doesn't portray its subject simplistically. There are several sympathetic American characters and some unsympathetic non-Americans. However, the film is ultimately critical of America, simply because Americans have so much and give so little of it to their closest neighbours. More than that, Americans are woefully unaware of the circumstances that many of those living within their country face. El Norte is an important film because it has the ability to change this.",
         "Fifteen years ago, the indigenous people in Guatemala, were living a cruel extermination that forced them to flee toward Mexico and the United States. This exodus lasted a decade and half a million Guatemalans made the journey to America seeking for asylum and refuge. In that time, a young Chicano film maker, full of noble idealism,honesty,and with no more resources but his immense talent to tell stories, put his eyes in this tragedy and made the most beautiful epic poem ever filmed about our indigenous nations: El Norte, a picture that gave voice to those that don´t have it. With El Norte, the spectators of that time, became aware, in slambang, of a reality that have been communicated to them mostly through the press, but wich they had never confronted in such hard and frontal manner. And in some way, El Norte became a powerfull fighting element. Grew an audience, searched audiences, left the theatres to tell its truth. Got into the schools, universities, into film festivals, and in every forum that wanted to hear it, and it´s message was founding echo in the spectators identifyed with the story of the lost paradise of all the poor of the world in which, Rosa and Enrique represent millions of young people of any color and continent, starving for security and freedom, those that every day start the search of the lost paradise through hell. Fifteen years had gone by since the time we made this film, and unfortunately, the story that has been told in El Norte, will have to be told for a long time. We, the latinamericans, are in deep debt with Anna Thomas and Gregory Nava. Thank you for making, from this tragedy a masterpice. Some say that a poem never won a workers strike; this may be true, but it is also true that some poems had helped us to keep the faith, and as long as you have faith, you have not been defeated. And if you don´t belive me, ask via internet to subcomandante Marcos, who has been fighting five years in Chiapas, México, for the indigenous rigths, with no weapon other than his word. And by the way, in many of the towns El Norte was filmed. We thank the people who are helping preserve today our story in order to be shown to the future generations."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "American Playhouse",
         "Channel Four Films",
         "Independent Productions"
      ],
      "summaries": ["Mayan Indian peasants, tired of being thought of as nothing more than \"brazos fuertes\" (\"strong arms\", i.e., manual laborers) and organizing in an effort to improve their lot in life, are discovered by the Guatemalan army. After the army destroys their village and family, a brother and sister, teenagers who just barely escaped the massacre, decide they must flee to \"El Norte\" (\"the North\", i.e., the USA). After receiving clandestine help from friends and humorous advice from a veteran immigrant on strategies for traveling through Mexico, they make their way by truck, bus and other means to Los Angeles, where they try to make a new life as young, and undocumented immigrants."],
      "budget": 0
   },
   "movielensId": 26472,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1983-10-11",
      "dvdReleaseDate": "2002-06-15",
      "directors": ["Gregory Nava"],
      "runtime": 141,
      "movieId": 26472,
      "title": "El Norte",
      "mpaa": "",
      "actors": [
         "Zaide Silvia Gutiérrez",
         "David Villalpando",
         "Ernesto Gómez Cruz",
         "Lupe Ontiveros",
         "Trinidad Silva",
         "Alicia del Lago",
         "Mike Gomez",
         "Jose Martin Ruano",
         "Stella Quan",
         "Heraclio Zepeda",
         "Emilio Gomez Ozuna",
         "Daniel Lemus Valenzuela",
         "Rodrigo Puebla",
         "Yosahandi Navarrete Quan",
         "Rodolfo De Alexandre",
         "Emilio Del Haro",
         "Palomo Garcia",
         "Ismael Gamez",
         "Silverio Lujan",
         "Socorro Velazquez"
      ],
      "imdbMovieId": "0085482",
      "originalTitle": "El Norte",
      "genres": [
         "Thriller",
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["efCK1A8k2Ds"],
      "plotSummary": "Brother and sister Enrique and Rosa flee persecution at home in Guatemala and journey north, through Mexico and on to the United States, with the dream of starting a new life.",
      "tmdbMovieId": 17435,
      "avgRating": 3.7551,
      "releaseYear": "1983",
      "numRatings": 196,
      "posterPath": "/lsAr6Eu2r4RnQ4M4CFLjYHVUzjZ.jpg"
   }
}