{
   "tmdb": {
      "original_language": "cn",
      "keywords": [{
         "name": "hong kong",
         "id": 12354
      }],
      "imdb_id": "tt0088423",
      "video": false,
      "title": "Drunken Tai Chi",
      "recommendations": [],
      "backdrop_path": "/urDas6ep9jt86P5YmuwLNGRYlbA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chan Chuen Chung",
               "gender": 2,
               "credit_id": "52fe44c7c3a368484e036515",
               "name": "Donnie Yen",
               "profile_path": "/vlKBbOc0htUsDGvcxeULcFXDMRo.jpg",
               "id": 1341,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Puppetteer",
               "gender": 2,
               "credit_id": "52fe44c7c3a368484e036519",
               "name": "Yuen Cheung-Yan",
               "profile_path": "/quu3mYlfVQXPKhpKcH1OA3q5W7b.jpg",
               "id": 65975,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Fatty",
               "gender": 1,
               "credit_id": "52fe44c7c3a368484e03651d",
               "name": "Lydia Shum",
               "profile_path": "/wwy8UDmMBjW8UkfDkBYF8ixuzIO.jpg",
               "id": 116351,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Yu Ping",
               "gender": 0,
               "credit_id": "56f2f64292514134e7000899",
               "name": "Yuen Yat-Choh",
               "profile_path": "/srOjhLrMOCwQaxodoLiRgujK2RG.jpg",
               "id": 571516,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Ta Sha's father",
               "gender": 0,
               "credit_id": "52fe44c7c3a368484e03652d",
               "name": "Don Wong Tao",
               "profile_path": "/kOB6rdisYSxK9YjvpdVgwRlIB5q.jpg",
               "id": 116353,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Chin Do's father",
               "gender": 0,
               "credit_id": "56f2f652c3a3682d25000a1d",
               "name": "Lee Kwan",
               "profile_path": "/npiwCHMjeufWmpSzYHdLdKec4XJ.jpg",
               "id": 1134726,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Iron-Steel",
               "gender": 0,
               "credit_id": "56f2f686c3a3682d1c0009bf",
               "name": "Yuen Shun-Yi",
               "profile_path": "/goFpyG2I0X8LBStTczGs1OywTz0.jpg",
               "id": 65976,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Ta Sha",
               "gender": 0,
               "credit_id": "56f2f71392514134d60009e8",
               "name": "Mandy Chan",
               "profile_path": "/t87NUEwPhjaqb7l0X3mU7E0mrcX.jpg",
               "id": 116352,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Muscle man",
               "gender": 0,
               "credit_id": "56f2f77192514134df0009fd",
               "name": "Wong Kin-Mi",
               "profile_path": null,
               "id": 1594894,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Thug",
               "gender": 0,
               "credit_id": "56f2f77cc3a3682d2000099e",
               "name": "Lee Hoi-Hing",
               "profile_path": null,
               "id": 1175330,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe44c7c3a368484e036533",
            "name": "Yuen Woo-ping",
            "profile_path": "/7gr04tWDnsBHHmo18aYLWXZHAvC.jpg",
            "id": 18899,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.872347,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 25425,
      "vote_count": 4,
      "budget": 0,
      "overview": "Most notable as being Donnie Yen's first film and starring role, Drunken Tai Chi is one of Yuen Woo Ping's funniest films and possesses all of the elements of a great comedic kung fu epic.",
      "similar": [
         154261,
         682,
         397148,
         11690,
         11134,
         30596,
         35854,
         843,
         251749,
         11847,
         2024,
         862,
         9335,
         146,
         605,
         11471,
         9947,
         10775,
         8456,
         24
      ],
      "original_title": "笑太極",
      "runtime": 91,
      "poster_path": "/ldmJjucyC2WwQg8kQp6uwAe9New.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Peace (Hong Kong) Film Co.",
         "id": 97701,
         "origin_country": ""
      }],
      "release_date": "1984-05-31",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Woo-Ping Yuen"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Peace Group",
         "Brandy Yuen"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0088423/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjczMDc1NDUxOV5BMl5BanBnXkFtZTgwMDA5NjUzMTE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Donnie Yen, Cheung-Yan Yuen, Lydia Shum | See full cast and crew »"],
      "reviews": [
         "First off let me say that most people that give reviews don't know what they are talking about. This movie is Donnie's first and is a very good one. He definitely did better on his first than Jackie Chan (Young Tiger) and Jet Li (Shaolin Temple). This movie is not about drunken tai chi, it's about a drunk teaching a young man tai chi. That's the difference when you get original titles vs American titles. Yen's action is remarkable as well as his acting skills, and the fact that the Yuen family backs him up more than proves his credit in the movie business is A+++. In this movie you can't help but to feel sorry for Yen as he tries to make his brother feel just as special as he is vs his rotten greedy father. Only to wind up losing them both is when the heart break shows up, but back to the review Donnie more than proves that he is the man for the job once he gets his hands on the Killer Bird. If you want some good ole Asian action, then try this movie out. There are a lot of critics out there but let's see if they can recall America ever coming out with action this good.",
         "I have to start off by saying that after seeing Iron Monkey, I went out and looked for every Donnie Yen movie I could find. And after all of that hard work, I realized that they all sucked! From his John Woo-like flop Ballistic Kiss to his numerous appearances (and subsequent deaths) in films like Highlander, Blade 2, and Shanghai Knights, on thing is apparent: Mr. Yen has got to get a new agent. His ability in martial arts is virtually unsurpassed, but the only other movie I've seen that challenges his abilities like in Iron Monkey was Drunken Tai Chi. With a goofy storyline of revenge (surprise!) and training to become stronger than the bad guy, Yuen Woo Ping has expertly melded comedy and action to create a fantastic party movie, something that anyone with a sense of humor can appriceate. Donnie is in top form, which is surprising given that this was his first starring role. He shows fantastic flexibility and a certain charisma that's hard to explain. I seriously hope that Donnie gets together with Yuen Woo Ping and creates another masterpiece soon, because getting killed in every film you're in is no way to make a legacy. (Ask Sean Bean.)",
         "To Scott... Yes, hard to believe Tai Chi can be a fighting system. Yes, it is. The problem with that is the image of Tai Chi that Americans or most people in the world is of the \"soft\", slow movements that are practiced in parks by elderly persons. Movements can be just a general term to describe a technique or a series of techniques in the martial arts. Basically in all martial arts, there are movements, whether they are an attack or a defense that can either be soft or hard in nature; Tai Chi is no different. Because of the health benefits of Tai Chi, instructors normally teach those movements. The hard movements, or shall I say the techniques that you would relate to the more \"harder\" styles of Kung Fu/Wushu are taught by emigrate Chinese instructors or instructors who have studied with such instructors or have trained in China. I guess it just comes to persons like you or die-hard martial arts enthusiasts who are interested in that aspect of Tai Chi.",
         "All of movie fans know that there are few movies every year (or maybe every decade) that you can watch more that one time. but i think it's one of them. this is the first movie that Donnie yen has played a major role. I am a huge fan of Donnie's and have seen almost all his movies. I can say that this is one of his bests. The plot is a simple yet functional and interesting one. action scenes are really good and well choreographed. and comedy is also good. it's very difficult to use comedy that can make people with different cultures laugh. but this movie does it. I really laughed at many scenes. If you are an action fan, martial arts fan, Donnie yen fan or even comedy, never miss this movie. I give it 10 out of 10 because it's one of the best movies I've seen.",
         "One of donnie yens first. It is pretty funny, the obligatory training sequence is well done and the fight scenes are pretty decent. Its one of the last of the Shaw Brothers style films. No wire work and the like. If you really need a reason to see this film check out the practice scene, set to 'Love is the drug' by Roxy music. Very funny.",
         "Donnie Yen does a pretty good job in this movie, both in acting and in the fight scenes. Theres some wire work here and there, which is expectable when you watch ANY martial arts movie anyway. The fight scenes are really well done(Donnie Yen is obviously really good at Tai Chi and a great kicker!)Theres also a lot of comedy in this movie(better than that in Drunken Master with Jackie Chan). People shouldnt compare this to Jackie Chan's Drunken Master, it has a different plot and theres not a focus on drunken boxing(theres pretty much none!). Some of the Yuen Brothers are also in this movie like the Tai Chi Master and Killer Bird. Overall a good fun kung fu film and one of Donnie Yen's best! Overall: 9/10",
         "Donnie Yen's breakout role comes at the tail end of the old school martial arts boom in Hong Kong. Under the direction of Yuen Woo Ping it could go one of two ways: A kung fu based movie in the vein of Drunken Master and Snake in Eagle's Shadow or an even sillier excursion like Miracle Fighters or Shaolin Drunkard. This lands somewhere in the middle. I won't go over the plot, you can find it on other reviews. This is mainly a goofy comedy with the fighting for the most part played for laughs. Puppets, fireworks, break dancing, bicycles are used as gags through the fights with the last couple fights displaying more of traditional styles. So is it any good? Let's get one thing straight: there is no drunken tai chi. I'm guessing the title was chosen to cash in on the drunken boxing craze that was on its last leg at the time. There is some great Tai Chi on display here. The training sequences are fun and the application is great. Donnie Yen also has a couple scenes using the rope dart which are stand outs. If you are a big fan of Donnie Yen or just very goofy comedies with the Yuen clan's usual weirdness this will be up your alley. If you are looking for something more packed with fights and less goofy comedy I'd recommend Magnificent Butcher, Knockabout, or Legend of a Fighter, all classic Hong Kong films directed by Mr. Yuen.",
         "Look up 'Shameless ripoff' in the dictionary, and you'll find a picture of Donnie Yen practising tai chi. The startlingly original plot -- our hero gets beaten up and sees his family killed, forcing him to learn a new style of martial arts so he can defeat the evil killer -- is enhanced by... well, okay. Not enhanced. But there are a few slight variations from tradition in an effort to give this film some semblance of a plot, such as the evil baddie being a loving daddy. But let us gloss over such trivia as plot --as did the director -- in favour of the characters and the kung-fu, the two essential ingredients in any movie of this type. Plot? Pah! Anyway, the Sam the Seed character is a drunken tai chi master (that's a master of tai chi who's drunken, not a master of drunken tai chi. If you you were expecting differently from the film's title, tough). There are no amusing styles, and the tai chi bears as much resemblance to the actual art as does real-life kung fu to its cinematic equivalent. Do I sound like I didn't like the film? I hope not, because I *did* enjoy it, while recognising that it hadn't a shred of originality or thought behind it. Most of the fight scenes were good fun, and the bits in between, while unfunny, weren't as painfully so as they usually are in this sort of film. Yuen Woo Ping's reputation was made by Drunken Master, and this film was his most obvious attempt to cash in. I'm inclined to blame the studio more than the director for this though; not that blame particularly needs to be apportioned. You won't come away from this film thinking it was a masterpiece, but you won't be grumbling and demanding your money back either.",
         "Donnie Yen's first movie with Yuen Wo Ping. RE: similarities between this film and DRUNKEN MASTER -- there is so much crossover between their casts and crews, and HK filmmaking in general was so homogenous at the time, I find any similarities not only forgivable, but forgettable. Donnie wasn't much of an actor at the time, but his performance is bolstered by a supporting cast which includes two of Yuen Wo Ping's brothers: Sunny Yuen as the villain, Killer Bird, and Yuen Cheung Yan as the Master. I have a lot of affection for both actors. You might remember Yuen Cheung Yan as Jet Li's mentor in TAI CHI MASTER, or as police Captain Jie in FIST OF LEGEND. Sunny Yuen played a similar villain in DREADNAUGHT opposite Yuen Biao, the brave-but-bumbling Chief Fox in IRON MONKEY, the protagonist Shang in BUDDHIST FIST... and if you look closely you'll notice him getting clobbered by Hwang Jang Lee in the opening battle of DRUNKEN MASTER. Anything Donnie lacked in the acting department was more than made up for by his martial arts skills. DRUNKEN TAI CHI is an enjoyable first look at a promising new action star.",
         "this was an earlier movie donnie was in and the best that i had ever seen. well, the first i had ever seen with him in it...but the best and all the way comedy. so sad of brotherly love and at the end made a new friend along the way. no doubt to not miss this movie!!!"
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": ["Peace Film Production Co."],
      "summaries": [
         "A troublesome young man named Ta Sha rides a bike around town spoiling and ruining for others. But soon Ta Sha is confronted by his rival, the spoiled Chan Chuen-Chung who ends up fighting and humiliate Ta Sha in the process. This leads to Ta Sha plotting a revenge on Chung with the help of his friends by setting up an ambush and using fireworks to their aid. However, Chung - accompanied by his brother Yu Ping - manage to walk away from the ambush and use the gang's weapons against them. But as Chung is about to use fireworks on Ta Sha, Yu Ping makes Chung spare and let Ta Sha go. But Chung accidentally lights a set of fireworks resulting in Tai Sha getting heavily injured. Devastated and angered by Chung's actions, Ta Sha's vindictive father hires Iron Steel, an infamous assassin, to wipe out Chung and his entire family. Iron Steel closes in on the family and kills everyone on sight. Fortunately, Chung is present elsewhere and - after finding out that his family were killed while their house burned down - wanders around town in great grief. Later on, Chung meets a puppeteer who takes Chung in and introduces him to his wife. After escaping few more times from Iron Steel though, the puppeteer reveals himself as a master of tai chi and teaches Chung the art to counter Iron Steel's intense techniques and defeat him. Eventually, Chung discovers that his family didn't die in a fire but were murdered by Iron Steel who was hired by Ta Sha's father. This determines Chung to seek out and face Ta Sha's father and Iron Steel once and for all.",
         "A spoiled young man - on the run from a ruthless killer - hooks up with a puppeteer and his wife who are masters of the art of tai chi; the only style that can defeat the killer."
      ],
      "budget": 0
   },
   "movielensId": 26526,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "1984-05-31",
      "dvdReleaseDate": null,
      "directors": ["Yuen Woo-ping"],
      "runtime": 91,
      "movieId": 26526,
      "title": "Drunken Tai Chi",
      "mpaa": null,
      "actors": [
         "Donnie Yen",
         "Yuen Cheung-Yan",
         "Lydia Shum",
         "Yuen Yat-Choh",
         "Don Wong Tao",
         "Lee Kwan",
         "Yuen Shun-Yi",
         "Mandy Chan",
         "Wong Kin-Mi",
         "Lee Hoi-Hing"
      ],
      "imdbMovieId": "0088423",
      "originalTitle": "笑太極",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Most notable as being Donnie Yen's first film and starring role, Drunken Tai Chi is one of Yuen Woo Ping's funniest films and possesses all of the elements of a great comedic kung fu epic.",
      "tmdbMovieId": 25425,
      "avgRating": 2.66667,
      "releaseYear": "1984",
      "numRatings": 3,
      "posterPath": "/ldmJjucyC2WwQg8kQp6uwAe9New.jpg"
   }
}