{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "relationship problems",
            "id": 5625
         },
         {
            "name": "alienation",
            "id": 7368
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "existentialism",
            "id": 181324
         }
      ],
      "imdb_id": "tt0087821",
      "video": false,
      "title": "Full Moon in Paris",
      "recommendations": [
         99657,
         43000,
         73455,
         67083,
         80705,
         96419,
         122683,
         21967,
         80739,
         71725,
         91426,
         71933,
         43596
      ],
      "backdrop_path": "/55nlsO4ZTjxbelEQbjZE8QmzSLx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Louise",
               "gender": 1,
               "credit_id": "52fe452dc3a368484e04c9bf",
               "name": "Pascale Ogier",
               "profile_path": "/9BzQPPQ6Zs9c2j9QOALQEkT6qGl.jpg",
               "id": 96967,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Remi",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c9c3",
               "name": "Tchéky Karyo",
               "profile_path": "/9rMF25F5r3Giix9jkwfuUz2utHv.jpg",
               "id": 10698,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Octave",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c9c7",
               "name": "Fabrice Luchini",
               "profile_path": "/ycAUdyF80ipYe1evd7JtITdWojQ.jpg",
               "id": 28255,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Camille",
               "gender": 1,
               "credit_id": "52fe452dc3a368484e04c9cb",
               "name": "Virginie Thévenet",
               "profile_path": "/tAxOXN4exUN0cIR0hLwsXPUIbNX.jpg",
               "id": 18484,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bastien",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c9cf",
               "name": "Christian Vadim",
               "profile_path": "/cmMGUMb59bk678rlSGGNbE2Nngs.jpg",
               "id": 96968,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Painter at cafe",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c9d3",
               "name": "László Szabó",
               "profile_path": "/dFEmQzfyfU557kH8PGHR3GI29EE.jpg",
               "id": 38899,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tina the babysitter",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c9d7",
               "name": "Lisa Garneri",
               "profile_path": null,
               "id": 96969,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Louise's decorator friend",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c9db",
               "name": "Mathieu Schiffman",
               "profile_path": "/wsDoXC9eqb4VHVMAeDIF0xlt9lL.jpg",
               "id": 18212,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Marianne",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c9df",
               "name": "Anne-Séverine Liotard",
               "profile_path": null,
               "id": 96970,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Remi's friend Bertrand",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04c9e3",
               "name": "Hervé Grandsart",
               "profile_path": null,
               "id": 96971,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "5453c42bc3a3681480001919",
               "name": "Noël Coffman",
               "profile_path": null,
               "id": 1380133,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c9bb",
               "name": "Éric Rohmer",
               "profile_path": "/4VUnQk2yA6m58uak9LguIAzZ8Re.jpg",
               "id": 28615,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04c9e9",
               "name": "Éric Rohmer",
               "profile_path": "/4VUnQk2yA6m58uak9LguIAzZ8Re.jpg",
               "id": 28615,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "59c9a92792514123c10016fd",
               "name": "Margaret Ménégoz",
               "profile_path": null,
               "id": 6100,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "59c9a932925141240100161f",
               "name": "Elli Medeiros",
               "profile_path": "/wjKQGxHMTZngDgFd2PAcbMKV6ji.jpg",
               "id": 84668,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59c9a93bc3a36803a40016a2",
               "name": "Renato Berta",
               "profile_path": null,
               "id": 19054,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "59c9a9429251412401001630",
               "name": "Cécile Decugis",
               "profile_path": null,
               "id": 3838,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "59c9a94bc3a36803c70013ac",
               "name": "Pascale Ogier",
               "profile_path": "/9BzQPPQ6Zs9c2j9QOALQEkT6qGl.jpg",
               "id": 96967,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "59c9a9539251412414001624",
               "name": "Pascale Ogier",
               "profile_path": "/9BzQPPQ6Zs9c2j9QOALQEkT6qGl.jpg",
               "id": 96967,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59c9a95dc3a3680393001510",
               "name": "Jacno",
               "profile_path": "/tVfI9hq4OcVv9WQzKo1f2zNbNgS.jpg",
               "id": 17529,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.06503,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 27102,
      "vote_count": 14,
      "budget": 0,
      "overview": "\"He who has two women loses his soul, he who has two houses loses his mind.\" So it goes with Louise played by Pascale Ogier who is dissatisfied with her mundane life in a bleak Parisian new-town. She rents a pied-à-terre in the city so she can experience independence.",
      "similar": [
         80038,
         40807,
         41630,
         55721,
         264660,
         376660,
         62211,
         10358,
         23168,
         2253,
         1429,
         3170,
         1374,
         235,
         594,
         1213,
         51828,
         77338,
         82693,
         180863
      ],
      "original_title": "Les nuits de la pleine lune",
      "runtime": 100,
      "poster_path": "/xVmoTSAgxHJFGD4QYFX7bZypEyG.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Les Films Ariane",
            "id": 7110,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films du Losange",
            "id": 223,
            "origin_country": ""
         }
      ],
      "release_date": "1984-08-29",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eric Rohmer"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Eric Rohmer"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0087821/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzMDIxNzg1Ml5BMl5BanBnXkFtZTcwNzIzNjIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Pascale Ogier, Tchéky Karyo, Fabrice Luchini | See full cast and crew »"],
      "reviews": [
         "Sure, other artists, countless others, have spent their lives depicting the interrelationships of men and women. But I don't know of anyone who so consistently seems to understand human relationships than Eric Rohmer. So few can build as believable characters, such believable situations. Full Moon in Paris concerns a young woman, Louise (Pascale Ogier), who has arrived at a point of extreme confusion: she loves her long-time boyfriend, Rémi (Tchéky Karyo), but she desperately wants to be alone for once in her life. Rémi likes his life the way he has it, living in the suburbs, doing his job, coming home to Louise. But it's all too stifling for her. She rents an apartment in Paris, but that only partly steadies her mind. Louise also has another, more ambiguous boyfriend, Octave (Fabrice Luchini, who appears in several Rohmer films and stars in my very favorite, Perceval le Gallois). Their relationship is definitely on the romantic side, but both seem to be in it, at least most of the time, for each other's company. They can talk, where Rémi isn't an especially gifted conversationalist (not a good character trait if you're in a Rohmer film!). The film moves along as well as any Rohmer film, but for a long time I was pretty sure that Rohmer wouldn't be able to end it in any significant way, that it would end up being a great film (like I say, I couldn't find one of his films any less), but not one of his best. Fortunately, Rohmer really does find the perfect ending, which ends up lifting the film up and making it one of the director's best. The film really benefits from its perfectly written characters and amazing acting, as well. Ogier gives one of the strongest central performances in Rohmer's canon. Fabrice Luchini, man, I love this actor! He stars in my favorite Rohmer film and has a small roll in my second favorite (the vastly underrated 4 Adventures of Reinette and Mirabelle from 1987). Luchini is so perfect here, so subtly hilarious that most will not notice it. During one of Octave's many conversations with Louise, he rattles off a really good line and has to stop to write it down. Louise understandingly excuses herself to the restroom to give him time to get his quip recorded. 9/10.",
         "Eric Rohmer is one of my favorite directors because he captures human drama without being dramatic at all. The characters talks, explains their emotions, tries to make themselves understood by others, but there is a constant misunderstanding that cannot be explained. There is a vague feeling of despair and the futility of communication in general. When I first saw Eric Rohmer's film it reminded me of one of those TV shows that tries to portray a normal day-to-day life to teach foreign language. I feel Eric Rohmer's specialty is in this focus on language and communication, not to portray a specific story, but to portray communication and thus leads us to a story \"out side\" of the communication.",
         "One of the things Rohmer does which I have not seen with any other director is to take a location, seemingly dull, far from beautiful and somehow he renders it of utmost important to his story. In 'La femme d'aviateur' it's the interiors of Paris apartments and a moderate park in Paris called Le Parc de Buttes Chaumont. In 'Pauline a la plage' and 'Le Rayon Vert' there is an emphasis on the changes in people when you take them out of their daily routine and normal environment, specifically when they are on vacation, a very important part of French life. In this film 'Les nuits de la pleine lune' (Full Moon in Paris) and L'ami de mon amie', he films relatively new suburbs of Paris with new ideas on architecture, new ideas on living and with young successful people. Most directors would never bother to even visit these grotesque modern suburbs, let alone film a film there. However it works with this film and L'ami de mon amie'. Why I don't know, but we know that it is a crucial element to the emotional journey of the main character in this film - her displacement between Paris and the suburbs. She prefers the chaos of Paris to the straight lines and cubism of her suburban apartment. I thought Pascale Ogier was fantastic as the lead in this film. I think Rohmer has a fantastic knack for choosing lead woman, with only one exception in my mind to this rule. They are usually petite, fragile, mystically beautiful.....What I thought of when watching Pascale Ogier as Louise was a cat. Her slinky movements, her lazy eyes, her calmness, her desire for space - not your average women. I read just one year after making the film she died of a heart attack at the age of 26. All in all an average or above average Rohmer film (which it not a bad thing). It sweeps over you with it's subtle charms and before you know it you will be under the film's spell.",
         "\"Les Nuits de la Pleine Lune\" is by far one of the best movies I have seen. Rohmer manages to capture the full complexity of a relationship that is on the rocks. Fabrice Lucini as Octave is very believable, even during his pensive rants in front of the camera for an extended period of time. Pascale Ogier as Louise gives a very good performance, showing us how a woman like Louise acts when caught in the middle of trying to decide between two men and resisting another. She is sometimes seducing, sometimes a devoted girlfriend, and sometimes just acts like she wants to run away from it all. Tchéky Karyo is perfect in his ability to show Remi's awkwardness in social situations. Overall, an excellent movie. --Céline. Contact me at Niancul@aol.com",
         "I enjoy this film very much. Rohmer as a way to describe feelings, to describe how those feelings can get all twisted sometimes. Love and the numerous questions it brings is well put to light. Books, smart funny talks and more... Pascale Ogier is superb. As for Fabrice Luchini, he's one of my favorite actor. He performs so well in this kind of role. And the name \"Octave\" fits him like a glove! Out of 100, I gave it 81. That's good for *** out of ****. Seen at home, in Toronto, on January 14, 2003.",
         "This story is about a couple living together. Over and over, Louise tells Remi that she loves him but their lives are so different it's hard to imagine them staying together. She loves to party and he's a real home body. In fact, she loves living \"the single life\" so much, she's arranged to have an apartment for herself in Paris so she can stay there much of the time--all the while insisting that she loves Remi. He begs her to stay, but she insists on spending part of her life in town alone. Well, over time, she slowly begins to pull away from him--especially when she starts to suspect HE might be cheating on her (though SHE was the one who made all the arrangements to make it possible for her to do the cheating). So, since she assumes he's cheating, she picks a guy to sleep with--no love--just a one night stand. Well, she returns home to Remi only to discover that he, too, is having an affair but his is very serious and he asks her to leave. This seems to be a great example of the old saying \"be careful what you ask for--you might just get it\". The acting is good and the story pretty involving. I like it because nothing in the movie happens by accident--Louise sets everything in motion and then is surprised when the life she chose occurs. There's a lot of irony and some lessons about relationships here. PS--this is NOT a good film for kids. First, they would be bored by the story and because you get to see a pretty explicit view of Louise late in the film. Be forewarned.",
         "Maybe I've OD'd on Rohmer, just having looked at this film, \"My Girlfriend's Boyfriend\" and \"The Aviator's Wife\" (all on DVD)in a single week. This has the silly addition to Rohmer's other obsessions, of the idea that the full moon causes unusual behavior. Actually the girl behaves just the way the protagonists of the other films do when the phase of the moon is unspecified, that is, very indecisive. The main male character is nicer than the one in most of Rohmer's films."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Les Films du Losange",
         "Les Films Ariane"
      ],
      "summaries": ["Louise, a young woman, who recently finished her studies in arts, is working as a interior decorator trainee. Playing the game of seduction, her life becomes more and more complicated."],
      "budget": 0
   },
   "movielensId": 26520,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1984-08-29",
      "dvdReleaseDate": "1999-06-15",
      "directors": ["Éric Rohmer"],
      "runtime": 100,
      "movieId": 26520,
      "title": "Full Moon in Paris",
      "mpaa": null,
      "actors": [
         "Pascale Ogier",
         "Tchéky Karyo",
         "Fabrice Luchini",
         "Virginie Thévenet",
         "Christian Vadim",
         "László Szabó",
         "Lisa Garneri",
         "Mathieu Schiffman",
         "Anne-Séverine Liotard",
         "Hervé Grandsart",
         "Noël Coffman"
      ],
      "imdbMovieId": "0087821",
      "originalTitle": "Les nuits de la pleine lune",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["947EZoZ10aQ"],
      "plotSummary": "\"He who has two women loses his soul, he who has two houses loses his mind.\" So it goes with Louise played by Pascale Ogier who is dissatisfied with her mundane life in a bleak Parisian new-town. She rents a pied-à-terre in the city so she can experience independence.",
      "tmdbMovieId": 27102,
      "avgRating": 3.625,
      "releaseYear": "1984",
      "numRatings": 24,
      "posterPath": "/xVmoTSAgxHJFGD4QYFX7bZypEyG.jpg"
   }
}