{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0091642",
      "video": false,
      "title": "Nobody's Fool",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cassie",
               "gender": 1,
               "credit_id": "52fe4706c3a368484e0b1045",
               "name": "Rosanna Arquette",
               "profile_path": "/rQMQYQUF9QzD6oDfkP6tsjmyZhS.jpg",
               "id": 2165,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Riley",
               "gender": 2,
               "credit_id": "52fe4706c3a368484e0b1049",
               "name": "Eric Roberts",
               "profile_path": "/45i6fsxBwH1UyA74tWQ6am0DntC.jpg",
               "id": 21315,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Pat",
               "gender": 1,
               "credit_id": "594682059251413fc202792c",
               "name": "Mare Winningham",
               "profile_path": "/hDaZAbMo9fLranbNDei5e0t8VjL.jpg",
               "id": 51544,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Billy",
               "gender": 2,
               "credit_id": "59468216c3a368170f02a030",
               "name": "Jim Youngs",
               "profile_path": "/bBNbVAvf3bT7tF32uByAJ6OIm4p.jpg",
               "id": 3009,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Pearl",
               "gender": 1,
               "credit_id": "594682229251413fbb028434",
               "name": "Louise Fletcher",
               "profile_path": "/A4Cn7LsuLlOXvOMKv5ez4ThyeZL.jpg",
               "id": 7071,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Shirley",
               "gender": 1,
               "credit_id": "5946822f9251417e4c007cce",
               "name": "Gwen Welles",
               "profile_path": "/dVcFCl3PXZnzKVs2wN4ZHOMHsrZ.jpg",
               "id": 30622,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Kirk",
               "gender": 2,
               "credit_id": "5946823d925141400d028f56",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4706c3a368484e0b104f",
               "name": "Evelyn Purcell",
               "profile_path": null,
               "id": 586734,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "594681c8c3a368111501644b",
               "name": "Beth Henley",
               "profile_path": null,
               "id": 100250,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5946825cc3a36816c5029588",
               "name": "Mikhail Suslov",
               "profile_path": "/nXPILx1AkuwzxKDG9yoYbgNloFQ.jpg",
               "id": 47947,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59468296c3a36816e402821e",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "594682a79251413fb602877f",
               "name": "Dennis Virkler",
               "profile_path": null,
               "id": 5584,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.683106,
      "production_countries": [],
      "id": 65326,
      "vote_count": 3,
      "budget": 0,
      "overview": "Cassie has a miserable job in a bar, is lonely and depressed. Her boyfriend left her when she told him that she's pregnant. After several failed suicide attempts she'd given away her baby for adoption - and regrets it now. When a theater group from L.A. comes to the small town Buckeye, she meets stage technician Riley. Discreetly he starts wooing her... she likes him very much, but still has feelings for her former boyfriend Billy too.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         10735,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "Nobody's Fool",
      "runtime": 107,
      "poster_path": "/6nvsN5eK9TmfBcAZ5lMwJeBnX03.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1986-11-07",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Evelyn Purcell"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Beth Henley"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091642/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxNDI4MTA0NF5BMl5BanBnXkFtZTcwMDY5NjcyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Rosanna Arquette, Eric Roberts, Mare Winningham | See full cast and crew »"],
      "reviews": [
         "This commercial and critical flop is one of my all time favorites. I suppose you have to be a bit of a hopeless romantic, and a bit off kilter to appreciate it. One of my favorite lines in cinema history comes from the character of Cassie's cousin: \"I'd like some bend straws. I think I can use them.\" Arquette's orgasmic primal scream, in the acting class scene, almost always makes me cry. Eric Roberts is very good also, but his character is secondary. Evelyn Purcel and Beth Henley should be proud. Keep in mind, this is not the Paul Newman movie of the same name.",
         "What I liked about this movie, besides the intriguing and beautiful Rosanna Arquette, is the way the offbeat characters relate to each other in a realistic, non predictable way that people in real life do. Roger Ebert's complaint of lack of consistency is really asking for more of the same formulaic, predictable stuff we get 95% of the time in movies. Two people who are unsure of themselves will indeed vacillate in the manner these two lovers do. This, among other things, is what sets this \"love story\" apart from conventional Hollywood fare. Nobody's Fool is a well acted and finely crafted movie and deserved a far better reception from the critics than it got. The number of responses on this site for a 1986 film is testimony enough.",
         "I was immediately charmed by Nobody's Fool, and it was my first introduction to the widely versatile Rosanna Arquette. With its empathetic well-written effort to follow people trapped in their everyday lives, I believe the film can resonate inside many of its viewers. All cast characters are beautifully detailed and framed; everyone is likeable at one level or another. Again, viewers may \"recognize\" some of these people in their own lives. A brilliant cast reflects the highly observant screenplay very nicely. Adding realism is a feeling that the lead role is a self-definition of Rosanna Arquette herself. This engaging factor gives the film a palpable third dimension of depth. I personally think it's her best film to date.",
         "A sweet, touching movie on what happens when someone doesn't love you anymore. And then you meet someone who loves you for who and what you are. Eric Roberts was really sweet in this movie. I only wish that guys were really like that.",
         "I went to see this film when it came out. The NYC audience loved it, and I don't understand why it wasn't a bigger hit. Maybe a little too quirky at the time for mainstream tastes, or perhaps it suffered from poor marketing. I know it's been very popular on video. Rosanna Arquette, who was the flavor of the month actress during the mid 80s, gives a lovely comedic, heartbreaking performance. Eric Roberts brings incredible sex appeal, humor and a sense of something darker underneath to his badly underwritten character. This could have been a forgettable role in the hands of a lesser actor. When Rosanna Arquette shouts at him, \"Stop looking at me with those eyes!\", every woman in the audience will understand what she's talking about. The very sweet first love scene between these two is memorable. I'd highly recommend this film if you like offbeat romances. It's not perfect - the script gets a little too precious and literary at times (it's obvious that Beth Henley is primarily a writer of stage plays)- but the performances are memorable, and both Arquette and Roberts were in their prime. It's a shame that their subsequent careers weren't bigger.",
         "I thought this was a quite funny and sympathethic movie.It had a good leading cast,with Eric Roberts and Rosanna Arquette giving solid performances.It had humour too.I laughed several times while watching it.And all the jokes were good. What more can you ask?I am giving this a nice 8.",
         "Nobody's Fool surprisingly had some very funny moments, which made this a slightly different 80's romantic comedy about small town eccentrics which has the usual formula of strange guy meeting confused girl and falling in love (though their affection is very ambiguous) and then breaking up and then falling in love again. Rosanna Arquette plays Cassie, a young woman who's small town life is constricting, although she's confused about how she really feels about her life there. She lives with her spacey mom (Louise Fletcher) and obnoxious brother, works a thankless job as a bartender with her friend who seems to be her only source of emotional support (Mare Winningham), and she still can't get over a jerk named Billy (hands down, the scene where she's at the resturaunt talking to Billy in that balloon outfit really got me howling). So, along comes Riley (Eric Roberts) a quiet guy with a dangerous, but reformed past who passes through town as a member of the theater crew. The arrival of the theater group inspires Cassie to do something different. She joins a thespian class and actually turns out to be pretty good (the scene where she and the other members of her class perform and the audience heckles them silly is one of the funniest scenes in the movie). Riley really likes Cassie and realizes that her potential outgrows her little town and tries to convince her of that. Riley's there to get Cassie, confused enough as she is about what she should do, to figure out just what it is she wants and what it is she plans on doing with the rest of her life. It is a sweet romantic comedy that has some incredibly funny moments, and you can see how good Roseanna Arquette is for comedy like this as sort of a shy, confused type of young woman who tries to get people to notice her, even though the people around her haven't got a clue about much of anything. This helps transcend beyond the template story. It's worth watching, especially if you enjoy Rosanna Arquette. I think this is one of her best early performances.",
         "For Arizona, you sure got a lot of white (northern) people walking around this desert community. The cowboy hats add to the image that it is a south western community, but then again, the movie lacks any soul of the setting. Still, this is a great, forgotten 80's romantic comedy. Both Roberts and Arquette are a delight to watch. Both are very young and are in the prime of their careers. The movie has its moments of comedy and its moments of seriousness. Overall, the movie deals with the issue of growing up, falling in and out of love, and trying to find the one that is right for you. The movie tries to hit on suicide and depression but it fails. It takes a back seat to what the audience wants to see, comedy. Overall, the story ends happy and cheerful.",
         "\"Nobody's Fool\" (1984), not to be confused with the later film starring Paul Newman, is an unconventional comedy with a few serious overtones. Rosanna Arquette is perfectly cast by director Evelyn Purcell in the lead role of Cassie. Living in a small Southwestern Arizona town, Cassie is lonely and depressed and bordering on madness after the break-up of her relationship with her longtime boyfriend (a very conceited Jim Youngs). She tries several comical attempts at suicide but they all come to naught. Her distracted mother (Louise Fletcher) doesn't seem to have a clue to her predicament. To make matters more complicated, Cassie was pregnant at the time of her break-up. She has the baby but puts it up for adoption. Now stuck in a dead-end job with a sympathetic co-worker (Mare Winningham), Cassie's life seems destined for the junk heap---until a Summer Stock company comes to town. She soon falls for the main technician for the troupe, Riley (Eric Roberts), but it takes her a while to admit the truth to herself. Her ex-boyfriend is beginning to show up at unexpected moments, and Cassie's heartstrings begin to pull in two different directions. Complicating the story further is that Riley doesn't seem any more stable than Cassie is. He's carrying a lot of serious baggage himself. In the meantime, Cassie decides to take on some acting classes and shines on stage in the film's penultimate moment when she performs one of Juliet's soliloquies from Shakespeare's famous play. At that point, Cassie realizes that she's come full-cycle in her formerly messed-up existence. It doesn't take her long to decide to follow Riley to Los Angeles and begin a new life. To quote the Bard, \"after suffering the slings and arrows of outrageous fortune,\" Cassie's story has a mostly happy ending. \"Nobody's Fool\" was tailor-made for the talents of star Rosanna Arquette. Alas, her career had few high points after this picture. That's probably because this film was not anything close to a box-office success. That's too bad because all the performances were excellent and the story-line had a definite 1980s feel to it. Molly Ringwald may have been the teen queen of that era, but Ms. Arquette certainly cornered the market for the twenty-somethings back then. She is at least well-remembered for that and for the band Toto's song in her honor.",
         "This is one of the better movies made in my hometown of Prescott, Arizona. It was made my senior year of high school and one of my class mates had a part as an extra in it. Back in the eighties there were not many hispanics or blacks in Prescott so the lack of people of color was accurate for the time, it was very white for a long time. Also, there really were quite a few people who wore western style clothing. I am not a romantic comedy fan so I watched this movie only because it was made in my town. I actually enjoyed it even though there was no body count, I prefer horror movies. I was surprised how good this was after seeing the bad movies made locally at the time."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Island Pictures",
         "Katz/Denny Productions"
      ],
      "summaries": ["Cassie has a miserable job in a bar, is lonely and depressed. Her boyfriend left her when she told him that she's pregnant. After several failed suicide attempts she'd given away her baby for adoption - and regrets it now. When a theater group from L.A. comes to the small town Buckeye, she meets stage technician Riley. Discreetly he starts wooing her... she likes him very much, but still has feelings for her former boyfriend Billy too."],
      "budget": 0
   },
   "movielensId": 26577,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-11-07",
      "dvdReleaseDate": "2005-01-25",
      "directors": ["Evelyn Purcell"],
      "runtime": 107,
      "movieId": 26577,
      "title": "Nobody's Fool",
      "mpaa": "PG",
      "actors": [
         "Rosanna Arquette",
         "Eric Roberts",
         "Mare Winningham",
         "Jim Youngs",
         "Louise Fletcher",
         "Gwen Welles",
         "Stephen Tobolowsky"
      ],
      "imdbMovieId": "0091642",
      "originalTitle": "Nobody's Fool",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Cassie has a miserable job in a bar, is lonely and depressed. Her boyfriend left her when she told him that she's pregnant. After several failed suicide attempts she'd given away her baby for adoption - and regrets it now. When a theater group from L.A. comes to the small town Buckeye, she meets stage technician Riley. Discreetly he starts wooing her... she likes him very much, but still has feelings for her former boyfriend Billy too.",
      "tmdbMovieId": 65326,
      "avgRating": 3.43617,
      "releaseYear": "1986",
      "numRatings": 47,
      "posterPath": "/6nvsN5eK9TmfBcAZ5lMwJeBnX03.jpg"
   }
}