{
   "imdb": {
      "country": "Poland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 572,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0092337/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyMzA3MDE0OF5BMl5BanBnXkFtZTcwMjcwNjEyMQ@@._V1_SY317_CR13,0,214,317_AL_.jpg",
      "actors": ["Stars: Artur Barcis, Olgierd Lukaszewicz, Olaf Lubaszenko | See full cast and crew »"],
      "reviews": [
         "Written in little over a year and a half and done with a budget that any Hollywood production would consider ridiculous, Krysztof Kieslowski and Krysztof Piesiewicz created some of the most thought provoking and emotional films of all time with this miniseries. What was even more dramatic is that these pieces were unavailable on video for almost 15 years due to its distributor. Based on an original idea of Piesiewicz, Kieslowski's long time collaborator, the series was to be given to different directors each time. But Kieslowski fell in love with the project and ended up filming all of them. What makes these pieces unique is their rhythm, their unique images and their amazing scripts. Very little dialogue is used all along. Instead, Kieslowski gives you a full knowledge of his characters by little incidents in their lives, which end up having more resonance. Each one of the stories are linked by location, all occuring to different occupants of an apartment complex over the course of what's very likely one year. Each piece is an entity by itself and can be watched separately, although some of the characters do reappear in different episodes in bit parts. Most significant is that one who has been called \"the angel\", a mysterious figure whose gaze serves as a warning sign to the main characters. Since the films are loosely based on the ten commandments (and the different ways we break them every single day), the mood is one of anguish and solitude. And Warsaw and that inhumane apartment complex are a perfect setting for these desolate stories. Still, there's no need to be a Christian or even a religious person to enjoy these films. Most films deal with human issues and tough moral choices. Although the stories have received a subtitle to associate each of them with a commandment, these were not present in the original vision of the director and were added later by the Venice Film Festival's press office. Also, if you've seen two of the films in their longer versions: \"A short film about Killing\" and \"A short film about Love\", you should also watch them again here in their original versions, since they provide a small glimpse at the genius of Kieslowski who changes and adds small scenes that make the movies (specially \"a short film about love\") different experiences and almost vignettes of a people's lives.",
         "Kieslowski left us way too soon. But he did leave behind a handful of achievements that place him at the forefront of filmmakers of the last quarter of the 20th century. The Three Colors movies and The Double Life of Veronique - the movies for which he is probably best known - would be enough to ensure his reputation, but is this film - or ten films, if you wish - that elevate him. While the movies are based upon the Ten Commandments, they are not simple morality tales and illustrations. Kieslowski and his co-writer, Krzysztof Piesiewicz, create meditations that connect both intellectually and emotionally with the commandments instead. They explore the commandments' themes with the head and the heart. One great example is the first movie, in which a parent and his child use a computer to predict the freezing rate of a pond. Casting the computer and human knowledge as false Gods is not a new or unique idea, but in Kieslowski's hands, the idea expands and fills not only the mind but the heart. Man, I wish I had the vocabulary to express what moves in me every time I watch any one of these films. Everything about this film, from the cast - always nice to see the ubiquitous Daniel Olbrychski (ubiquitous for Polish films; I always wondered if Poles ever play six degrees of Daniel Olbrychski) - on. The cinematography for each episode is ideal; the look and feel of these movies, shot with the same director but different cinematographers, are all perfect. And who is that watchful, mute man who appears in the background of all or most of these films? Look, just see this. Find it, rent it. If you love beautiful, heartbreaking, thoughtful movies, you'll thank me for this advice.",
         "I am among those very fortunate few in this world to have seen the 'dekalog' series in a theater.And i am proud of it.I knew precious little about Kieslowski until i saw this series which was shown during the 29th international film festival of India, held at Trivandrum. ever since i have respected,admired and loved this man for his skills. Anybody can learn a lot from the these 10 little gems. Even a lot many contemporary so called serious movie makers have lots to learn from this extremely intelligent filmmaker. Shot mostly in stark black and white, the camera seems to have a knack to bring out the faintest of internal turmoils each of the characters undergo. This man has proved how good an observer of life he is. His way of putting across ideas in a simple but intense manner will leave an everlasting impression in our minds. 'A short film about killing' and 'A short film about love' may have found its way to the theaters and gained more attention. But i strongly feel that one has to see all the 10 episodes (in any order and do note that) which covers issues from adultery to incest to treachery and what not. Even more amazing is the fact that all the episodes seem to have been shot in the same locality, covering the occupants of a large residential complex.There are very few characters in each episode(which is about an hour each)and they ALL seem to leave an imprint in our minds. Krzysztof Piesiewicz,the screenplay writer for all the episodes has done a marvellous job.But i am sure i have lost the essence of some of the dialogues as i saw only the subtitled versions. There are no grandiose attempts while making these episodes-say through utilisation of huge sets or big stars or slick camera movements. It is kept down to earth,realistic and bereft of too many cinematic elements.The camera moves snail pace but something keeps you alert because you realise that the man behind it is making an attempt to speak not just though dialogues. I wish i got a chance to see more of his works and keep away from the commercial crap we are being forced to view everyday. I sincerely hope more of Kieslowski's offerings find its way to my country and more people from all over the world get a chance to see the works of this genius. This man is SIMPLY BEAUTIFUL !!!",
         "If ever there was a good reason to start learning Polish, the Dekalog series is the definitive reason. The extent to which Kieslowski goes to show us what it is to be human, cannot be compared to the work of any film-maker. Yes, Ken Loach is the master of the social drama, and Lars Von Trier is without a doubt the best experimental melodramatist, but Kieslowski just manages to outclass them both in 10 powerful, striking and breath-taking stories losely based on the 10 Commandments. It's a must-see, don't take my word for it...go watch it !",
         "Krzysztof Kieslowski's \"The Decalogue\" is one of the most powerful cinematic experiences you'll ever have, and probably the best ensemble cast I've ever seen (if you consider them a single film, like I do). I used to think Mike Nichols, Ingmar Bergman and Robert Altman were the supreme actor's directors, but I might consider Kieslowski (1941-1996) my #1 for this project alone. It helps that all the actors are unknown to most of us and not famous Hollywood stars, and that makes the experience even more real, but that wouldn't be much if they couldn't act. I had seen Kieslowski's \"Three Colors\" (which happens to be my all-time favourite trilogy), but I didn't think of him as a particular actor's director because Juliette Binoche or Julie Delpy don't necessarily need a great director to deliver a great performance (I'm not sure about Irène Jacob, though; I haven't seen \"The Double Life of Veronique\", in which she's supposed to be brilliant, and I do like her in \"Red\", but she never impressed me in any movie not directed by Kieslowski). Adrianna Bierdzynska (who looks like a cross between Jennifer Jason Leigh and Hilary Swank) and Olaf Lubaszenko, from segments 4 and 6, respectively, stand out; they're more Oscar-worthy than 90% of the nominees of the past decade; but every member of the cast did a terrific job. Stanley Kubrick described \"The Decalogue\" as the only masterpiece he could name in his lifetime - if that doesn't make you curious to watch this poignant, unique experience, then you're not a film lover. 10 out of 10 in my books.",
         "`Dekalog' **** There are some `movies' that are hard to describe. `Dekalog' is one. It's not really a movie. It is a ten part made-for-TV mini series. Don't remember seeing `Dekalog' when it was first shown on TV? Neither do I. `Dekalog' was made for made for Polish TV in 1987 by Krzysztof Kieslowski (`Blue', `White', `Red' and `Double Life Veronique'). Each segment of `Dekalog' is about one hour and is thematically driven by one of the 10 Commandments. All the stories take place in the same high rise apartment in Warsaw. The characters in each of the stories don't necessarily overlap, yet we see some of the characters from one story walk through another. This lack of overlap is also true of the stories and the commandments. Even knowing which commandment was the basis for a story, I couldn't always see a direct correlation. It's as if Kieslowski and his co-writer Krzysztof Piesiewicz view the 10 Commandments as a ruler to measure one's actions, a curb to provide bounds for one's choices or maybe a mirror to reflect on one's life. This reflective view of the commandments comes through in each of the stories. In \"I Am the Lord Our God\" a young boy and his father rely on a computer to decide whether or not it's safe to go out on the ice. \"Thou Shalt Not Commit Adultery\" is about a young boy who spies on and stalks the woman next door. Magda, his neighbor, is free and easy. And when she finds out about the young voyeur, she sets out prove there is no such things as love. Commandment by commandment Kieslowski provides us our own voyeuristic moment into the lives of the people in this one Warsaw apartment. This is truly a great movie. Buy a copy and watch the stories with another movie fan. Dekalog contains 10 stories that you'll want to talk about long after you've watched them.",
         "It's worth noting that about the same time this was airing on censored, Communist Poland TV, America was airing the \"Heart to Heart reunion\" and \"V\". Obviously, the Ten Commandments themes that it reportedly addressed in order are not actually in order, some of the shorts address two and even three commandments. No worries, though. This collection is a masterpiece. It's a major accomplishment with every film short being watchable, and some being unquestionable masterpieces. Kieszlowski is a master of presenting both sides of the argument; the pregnant, cheating wife and the cuckolded husband's doctor; the peeping Tom and the lonely woman; the atheist father and the religious sister. The final film centers on two brothers who inherit the stamp collection of their recently deceased father. They come to find that the collection is priceless and they scheme to sell it, mistrusting their father's former colleagues and ultimately one another. But despite their eventual downfall, the brothers find something of value from their folly. It's wonderfully affirming without being sentimental. That sentence probably describes most of these shorts.",
         "I would have hoped more people would have seen this superb collection of 10 short films, now that is available on video and DVD and has played on the Sundance channel. If you haven't, you are missing out on 10 superb masterpieces. Yes, they are slow-moving and some of them are very depressing, but what did you expect from this director, Adam Sandler? The acting, writing, direction, and music are all near perfection. 2 corrections to make from the earlier reviewer, these films are not in black and white, but in a very muted, monochromatic color. Also you should see them in sequence as 2 of the earlier episodes are referred to in the 8th and 10th episodes.",
         "I first saw this amazing series at the San Francisco Film Festival, and so had the privilege of experiencing it on a large screen. The program was sold as a package deal, and in 1990, not much was known about the director and the work itself was completely unknown. From the first frame, those of us who took a chance knew we had really hit a winner early on. Every night, two episodes were screened. It proved to be a real binding experience. Each subsequent viewing provides fresh insight. Timeless, it continues to fascinate and illuminate. Each episode could possibly stand on its own, and the fact that it was a miniseries only enhances its power. On the basis of this experience, I chose to see Denmark's THE KINGDOM, PARTS I & II when the Film Festival ran them in the mid-90's.",
         "The Decalogue is without doubt a monument of movie history. The ten films are apparently based on the ten commandments, but this relationship is tentative. Kieslowski himself commented that \"the films should be influenced by the individual Commandments to the same degree that the Commandments influence our daily lives\". The amazing thing about them is that they are much more than a series of abstract cinematic emblems. Assisted by superlative acting, they acquire each their own depth, their own real personalities and complex dilemmas. Kieslowski presents a cinematic view of morality that is about as sophisticated as it gets. A grand achievement of one of the great film-makers of the twentieth century."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Sender Freies Berlin (SFB)",
         "Telewizja Polska (TVP)",
         "Zespol Filmowy \"Tor\""
      ],
      "summaries": [
         "This is a series of ten shorts created for Polish Television, with plots loosely based upon the Ten Commandments, directed by Krzysztof Kieslowski. Two of these, Dekalog 5 and 6, are shorter cuts from the feature-length films--Krotki film o zabijaniu (A Short Film About Killing) and Krotki film o milosci (A Short Film About Love), respectively. They deal with the emotional turmoil suffered by humanity, when instinctual acts and societal morality conflict.",
         "Ten television drama films, each one based on one of the Ten Commandments."
      ],
      "budget": 0
   },
   "movielensId": 26587,
   "movielens": {
      "languages": ["Polish"],
      "releaseDate": "1989-12-10",
      "dvdReleaseDate": null,
      "directors": ["Krzysztof Kieslowski"],
      "runtime": 0,
      "movieId": 26587,
      "title": "Decalogue, The (Dekalog) (1989)",
      "mpaa": null,
      "actors": [
         "Artur Barcis",
         " Olgierd Lukaszewicz",
         " Olaf Lubaszenko",
         " Piotr Machalica",
         " Jan Tesarz",
         " Katarzyna Piwowarczyk",
         " Henryk Baranowski",
         " Krystyna Janda",
         " Aleksander Bardini",
         " Stanislaw Gawlik",
         " Krzysztof Kumor",
         " Maciej Szary"
      ],
      "imdbMovieId": "0092337",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 4.11538,
      "releaseYear": "1989",
      "numRatings": 533,
      "posterPath": null
   }
}