{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "daughter",
            "id": 5600
         }
      ],
      "imdb_id": "tt0099654",
      "video": false,
      "title": "Ghost Dad",
      "recommendations": [
         118430,
         126914,
         83489,
         215405,
         2199,
         210599,
         70024,
         18758,
         28416,
         25697,
         27549,
         18856,
         11630,
         11597,
         12719,
         36291,
         26603,
         11511,
         23470,
         26255
      ],
      "backdrop_path": "/cVuamcdgfWBYxWkIAfdxDvIa2QL.jpg",
      "revenue": 24707633,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Elliot Hopper",
               "gender": 2,
               "credit_id": "52fe43799251416c75011b83",
               "name": "Bill Cosby",
               "profile_path": "/74QfZIdzeCziphi251ueaCVXbW7.jpg",
               "id": 51962,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Diane Hopper",
               "gender": 1,
               "credit_id": "52fe43799251416c75011b87",
               "name": "Kimberly Russell",
               "profile_path": "/mT3IzgdwqZPRq8CIh2jpDtDDjNH.jpg",
               "id": 65397,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joan",
               "gender": 1,
               "credit_id": "52fe43799251416c75011b8b",
               "name": "Denise Nicholas",
               "profile_path": "/qMKd0i1bg3VaPgeS3OcBdl4i4Xd.jpg",
               "id": 65398,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Daniel Hopper",
               "gender": 0,
               "credit_id": "54783794c3a3681f4e0006f6",
               "name": "Salim Grant",
               "profile_path": null,
               "id": 1390332,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Sir Edith Moser",
               "gender": 2,
               "credit_id": "52fe43799251416c75011b8f",
               "name": "Ian Bannen",
               "profile_path": "/o1M55VhFgRimGz9cNjadt8fWlXE.jpg",
               "id": 2481,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Carol",
               "gender": 1,
               "credit_id": "52fe43799251416c75011b93",
               "name": "Christine Ebersole",
               "profile_path": "/dl8uNpIyYeGpjA90C0W1SGSsfla.jpg",
               "id": 4003,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Mr. Emery Collins",
               "gender": 2,
               "credit_id": "52fe43799251416c75011b97",
               "name": "Barry Corbin",
               "profile_path": "/38AilHla20EFhEYAqoz6EzfsrQf.jpg",
               "id": 12852,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Cutris Burch",
               "gender": 2,
               "credit_id": "547838a892514104d80044f8",
               "name": "Raynor Scheine",
               "profile_path": "/o5jW5NDeFPIyETEVJQItQEqmJcx.jpg",
               "id": 21082,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Stuart",
               "gender": 2,
               "credit_id": "547838ba92514141ad0008c5",
               "name": "Omar Gooding",
               "profile_path": "/80WbIRQzUvRQKabgvOErk2CAuZW.jpg",
               "id": 88183,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Tony Ricker",
               "gender": 2,
               "credit_id": "547838cec3a3687a20002533",
               "name": "Dana Ashbrook",
               "profile_path": "/qk2BsFN6ITljgG7wtGAcitbkFQC.jpg",
               "id": 6715,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Mr. Seymour",
               "gender": 2,
               "credit_id": "547838e69251416a270000fb",
               "name": "Dakin Matthews",
               "profile_path": "/tP63g4n8HPOUubsqUN8xZfXantn.jpg",
               "id": 43364,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Mr. Cohen",
               "gender": 0,
               "credit_id": "55725b48925141141000060e",
               "name": "Arnold Stang",
               "profile_path": "/ex3ZhUACFHnKSuiiSSmjbzZXCZ0.jpg",
               "id": 7332,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43799251416c75011b9d",
               "name": "Sidney Poitier",
               "profile_path": "/9LV17m3H7nGCJTXg7pzhK857g6V.jpg",
               "id": 16897,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43799251416c75011ba3",
               "name": "Brent Maddock",
               "profile_path": null,
               "id": 26475,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43799251416c75011ba9",
               "name": "S. S. Wilson",
               "profile_path": null,
               "id": 26479,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43799251416c75011baf",
               "name": "Andrew Laszlo",
               "profile_path": null,
               "id": 2082,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43799251416c75011bb5",
               "name": "Pembroke J. Herring",
               "profile_path": null,
               "id": 1531,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43799251416c75011bbb",
               "name": "Henry Mancini",
               "profile_path": "/sXl1lCYNnSf10ESG1nyCEDYGs1L.jpg",
               "id": 1938,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43799251416c75011bc1",
               "name": "Chris Reese",
               "profile_path": null,
               "id": 51358,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "553115dd925141066f0000b7",
               "name": "Terence Nelson",
               "profile_path": null,
               "id": 1455432,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "553115fe92514106680000f1",
               "name": "Nancy Nayor",
               "profile_path": "/43LHN7kjcpvsSBBoshm4C1GUouP.jpg",
               "id": 13585,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5531162992514106630000d0",
               "name": "Henry Bumstead",
               "profile_path": "/hmJBS9jdH5q5PrEsF3K48Gumhug.jpg",
               "id": 369,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5531163dc3a3684121002421",
               "name": "Bernie Cutler",
               "profile_path": null,
               "id": 1455433,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "55311653c3a368411200250f",
               "name": "Richard C. Goddard",
               "profile_path": null,
               "id": 14342,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 3.661501,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10485,
      "vote_count": 63,
      "budget": 0,
      "overview": "Elliot Hopper is a widower with three children, he is currently working on a deal. It seems like his wife illness was very costly and this deal could put them out of the red. However he gets into a cab that is driven by a maniac, and Elliot crashes into a river. Elliot is sent back so that he could finish the deal and make sure that his children are taken care of.",
      "similar": [
         11631,
         425,
         49519,
         2539,
         334,
         1257,
         10054,
         8545,
         745,
         1562,
         393,
         7972,
         8967,
         401,
         773,
         858,
         8392,
         12,
         13,
         1547
      ],
      "original_title": "Ghost Dad",
      "runtime": 84,
      "poster_path": "/2X6t1Z7g2kDB4J6OFiXjcjBzn01.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "SAH Productions",
            "id": 51416,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1990-06-29",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney Poitier"],
      "runtime": 83,
      "synopsis": "Elliot Hopper (Bill Cosby) is a recently widowed father of three who has nearly bankrupted the family in attempts to save his lingering wife. Elliot is working on a business deal to get the family out of debt when he climbs into the taxicab of a maniacal Satanist. In an attempt to end the ensuing mania, Elliot proclaims that he is in fact Satan and orders the driver to stop the cab immediately. Overwrought with the confrontation, the driver releases the steering wheel. The taxi slams into the barrier of a bridge and teeters over a river. As Elliot frantically tries to exit, the vehicle topples into the river, an incident which appears to kill both occupants. Rather than awakening to a day of reckoning, Elliot finds himself floating around the lab of a scientist studying the paranormal who agrees to \"send [him] back\". Elliot, who had neglected to get life insurance before his accident, fears that his children will grow up impoverished without him. As a floating spirit that can only be seen in darkened rooms, Elliot returns to his house and concocts a scheme to somehow finish his business deal and be approved for health coverage before his body is discovered and news of his death is made public. His children are in on the plan and try their best to keep their father's secret.",
      "writers": [
         "Brent Maddock",
         "S.S. Wilson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099654/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1NjczMTAxMl5BMl5BanBnXkFtZTcwODc5ODcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Cosby, Kimberly Russell, Denise Nicholas | See full cast and crew »"],
      "reviews": [
         "After the colossal artistic and commercial triumph of Leonard: Part 6, \"The Cos\" decided to make his next film a more organic, \"Art-House\" picture and proves once again that he has the cinematic midas touch. In a premise that might seem silly in other hands, Cosby and director Sidney Portier deftly weave a tightly knit tapestry of familial melodrama and undead hijinks. The lush cinematography lends a documentary feel to the proceedings, a much needed dose of gritty reality which helps immeasurably when dealing with the afterlife. Cosby's bravura performance is both ferocious and demure in equal measure, but always REAL. Also, the underlying message of fatherly responsibility seems remarkably apt in these times of the \"Baby Boy\" syndrome. An often overlooked masterpiece in the Cosby canon, Ghost Dad is without a doubt a labour of love from one of the cinemas greatest pioneers.",
         "If you haven't seen this movie see it. Bill Cosby unsuccessfully tries to balance work and family, when he suddenly dies in a horrible car crash. He is then whisked away to HELL, AKA London, England, where a man named Edith trains him in being a ghost. Now Cosby must raise his kids as a Ghost Dad. The movie is insane. Cosby flies through walls, Pops out of a phone to strangle his daughter's boyfriend, declares himself Satan, and goes to his female neighbor's house for a little \"afternoon delight\". I've seen it 40 times. Why wasn't this masterpiece mentioned when director Poitier received the lifetime achievement award. \"Edith is a Girl's Name!\"",
         "Ghost Dad is one of those movies that has that sort of corney cheesy feel to it, but is very entertaining and fun. I remember watching this as a kid on TV and the one part that always stuck in my mind was when Elliot (Cosby) is done getting his life insurance physical, and he's walking down the hall and his face and hands are gone, and his sun glasses and hat are floating above is body. That's always been my favorite part in the movie, just because it had freaked me out as a little kid. Well, over 10 years passed, and I finally saw the movie again. Needless to say, that part looked a lot different than I remember it. The part where he goes 'through' the bus, and when he falls though the floor are other parts that I remember pretty well too. Anyway, I definitely recommend this movie. The only part I can see a problem with around younger kids is when he comes through the phone, and chokes the guy, and used the 'b' word a couple times. Buy it, rent it, or watch it on TV. Either way, you'll like it!",
         "First, if you want to compare this movie to everything else, it is an original. It is a remake of nothing. Second if you expect social commentary because of the collaboration of Sidney Poitier and Bill Cosby you will be disappointed. My only statement on that is that frequently you find more truth in comedy than you do in drama. Third if you are one of these people that categorize themselves as either a critic or a critic in the making you should not even watch it at all. I rented the video tape years ago and loved the movie. It is the kind of humor that was popular in the 1950s and 1060s and has fallen out of fashion. I have saw the tail end of it several times on the Movieplex channel. I wish they would repeat it like all of the other movies they show so I could catch the whole thing on a second or third viewing. I have looked for the VCR tape in vain at the local good-will store. I guess I am going to have to settle for buying it on DVD. I much prefer VCR tapes since when they end it goes back to what ever TV channel it is on. I compare it with Matilda which I do have on VCR tape. If you watched Matilda and liked it then you will like Ghost Dad. I especially liked the end where somebody pretending to be Satan tells the cab driver where to go. It is a fitting climax for the movie. It is a warm, enjoyable movie I like to watch when I am in a blue mood It gives me the opportunity to forget my troubles for a while and watch. something heart warming. The effects of viewing it lasts several days.",
         "I don't care what anyone else has said this is a great movie. I have seen this movie several times and Bill Cosby is funny, A single dad trying to raise 3 children until he has his accident and becomes a ghost. The adventures that Cosby goes through in this movie while he is a ghost are interesting. It is a great film for children of all ages. So, see this movie if you haven't already and I think you will be very surprised at the adventures of Cosby and the other Characters in this film.",
         "YES! Basically this is a ninety minute episode of the explosive family comedy/drama \"The Cosby show\". I remember this movie coming out, the ad with wild bill ghosting through a bus, and making his face disappear. The faces, the dancing, Cosby delivers on all accounts, he's a real prankster. It took me about a week to watch this whole thing cause i kept putting it on so late at night. The time this came out Cosby's family show was hotter then hell, and as this movie will prove even Death can't keep a good dad down. He does his best after a horrifying accident to take care of his kids and get some kind of life insurance, the results are hilarious. He spooks a nosy, nerdy neighbor, he ghosts through a phone to strangle a young thug and helps his son perform a magic trick only a janitor could successfully get out of. So plenty happens here, and this is another one that got ton's of negative criticism when it came out, but nothing can slow down Bill Cosby, nothing. The man appears ageless and basically looks the same now as he did twenty years ago. In fact he looks the same now as he did in the early eighties. There's a nasty rumor going around Hollywood that he drinks the blood of young runaways, still another says he's an alien, and another one even suggests he's been dead for years and cloned by the Illuminati, kept in rotation to keep Kodak and Jello going and going. And yes there's a scene in this movie where a stuffy brit named EDITH, indulges in the cantankerous, wise cracking, ghostly jello slime. What can i say, i laughed, i cried, i orgasm'd twice! Check this out and don't forget the jello puddin. Nine stars, hooo ahhh!",
         "I watched it as a child with my brother. It was corny but hell it was fun! I loved Bill Cosby in this role and the premise of the whole movie was, while a bit of a stretch, quite fun in itself. Here you have a hard-working dad and his children..what happens of the dad suddenly \"leaves his body\", while nit exactly being dead? A comedy ensues as all of them struggle to adjust to the dad's new predicament, doing all sort of weird stuff. There is also the memorable taxi driver from hell. I was never quite able to forget him. This was a good family movie and both me and my brother had a lot of fun. It was silly, it was goofy, it was cheesy, but it was warm and lively and entertaining. A lot more credit should be given to this movie. For me, it will always remind me of the days when me and my brother watched things together. Good times. You might be put off by the goofiness and corniness of it but for me it is an 8/10. Good 'ole Bill Cosby.",
         "Okay, yes it has an implausible plot and the story line is totally cheesy. Having said that, however,it's also a very cute movie with a nice lesson in it. I've noticed that some of the other reviewers seem disappointed that this movie isn't an intellectual marvel. It's not meant to be. Sometimes movies are just supposed to be entertaining without having to be analyzed. This is one of those movies. Bill Cosby is as usual a comedic genius. I never get tired of watching him because he plays the father role very well. The supporting child actors are cute, most especially the youngest daughter. This movie is a good one for family viewing. I suggest you at least rent it, pop some popcorn, and sit with the family and enjoy it.",
         "If one were to hear of a movie concerning the antics of a dead Bill Cosby trying to help his children, the cineast in you would not be stirred to see/rent it. However, I still managed to be unpleasantly surprised by the gall of this movie. Each turn around the seemingly aimless plot reveals fresh idiocy. Every moment of Cosby's acting seems an excuse for a new stupid face to pull, though even these become horrendous. One is left with an over-riding feeling of disbelief, after having been asked to suspend exactly that from new levels for the duration of the picture. I suppose really odd Dana Ashcroft fanatics may wish to see this. But this movie is for children. Stupid children.",
         "OK so let's be honest here \"Ghost Dad\" is not any place near to being a great movie or the best movie you will ever watch. But at the same time it is also not what so many people say it is which is a horrible movie or even \"the worst movie of all time\"... for one thing it is Bill Cosby back in his time as one of the best comedians and entertainers, in his prime. So that alone means that there is going to be some really funny entertainment value in this movie. The movie can be a little darker than most things you would expect out of Bill Cosby but in a way that made it a little more special. I don't want to give away too much of the story for you people but near the beginning Cosby is in a horrible car accident with a crazy devil-worshipping cab driver and comes back as a ghost, trying to get back to his family and learning what's really important in his life."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "SAH Productions"
      ],
      "summaries": ["Elliot Hopper is a widower with three children, he is currently working on a deal. It seems like his wife illness was very costly and this deal could put them out of the red. However he gets into a cab that is driven by a maniac, and Elliot crashes and the next thing he knows he is floating around and finds himself in the lab of a scientist who studies paranormal. Elliot asks the scientist to send him back so that he could finish the deal and make sure that his children are taken care of."],
      "budget": 0
   },
   "movielensId": 26686,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-06-29",
      "dvdReleaseDate": "2005-03-01",
      "directors": ["Sidney Poitier"],
      "runtime": 84,
      "movieId": 26686,
      "title": "Ghost Dad",
      "mpaa": "PG",
      "actors": [
         "Bill Cosby",
         "Kimberly Russell",
         "Denise Nicholas",
         "Salim Grant",
         "Ian Bannen",
         "Christine Ebersole",
         "Barry Corbin",
         "Raynor Scheine",
         "Omar Gooding",
         "Dana Ashbrook",
         "Dakin Matthews",
         "Arnold Stang"
      ],
      "imdbMovieId": "0099654",
      "originalTitle": "Ghost Dad",
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["Gaj4ALV9IAw"],
      "plotSummary": "Elliot Hopper is a widower with three children, he is currently working on a deal. It seems like his wife illness was very costly and this deal could put them out of the red. However he gets into a cab that is driven by a maniac, and Elliot crashes into a river. Elliot is sent back so that he could finish the deal and make sure that his children are taken care of.",
      "tmdbMovieId": 10485,
      "avgRating": 2.22161,
      "releaseYear": "1990",
      "numRatings": 273,
      "posterPath": "/2X6t1Z7g2kDB4J6OFiXjcjBzn01.jpg"
   }
}