{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "upper class",
            "id": 213
         },
         {
            "name": "drug dealer",
            "id": 2231
         },
         {
            "name": "foreign legion",
            "id": 2905
         },
         {
            "name": "fistfight",
            "id": 5572
         },
         {
            "name": "foreign legionaire",
            "id": 6789
         },
         {
            "name": "revenge",
            "id": 9748
         }
      ],
      "imdb_id": "tt0100029",
      "video": false,
      "title": "Lionheart",
      "recommendations": [
         9594,
         17466,
         10222,
         10413,
         9091,
         11690,
         10134,
         9405,
         2019,
         9103,
         8831,
         10861,
         12721,
         9349,
         11667,
         37498,
         10596,
         3513,
         19277,
         9972
      ],
      "backdrop_path": "/9VVPZHoNXcxb1UgClVkzGe2JYLJ.jpg",
      "revenue": 24078196,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Leon Gaultier",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3959",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joshua Eldridge",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b395d",
               "name": "Harrison Page",
               "profile_path": "/k6cpbFO856LeAuoC1Tc5BQ0OXrf.jpg",
               "id": 45101,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cynthia",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b3961",
               "name": "Deborah Rennard",
               "profile_path": null,
               "id": 57663,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nicole Gaultier",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b3965",
               "name": "Ashley Johnson",
               "profile_path": "/2zIDMXy9680S7ioPo9jpZUq5qG1.jpg",
               "id": 34486,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Russell",
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3969",
               "name": "Brian Thompson",
               "profile_path": "/jdO1kSZGTWQqoBIRsUbLWYSNDMR.jpg",
               "id": 2719,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Hélène Gaultier",
               "gender": 1,
               "credit_id": "52fe44f3c3a36847f80b39af",
               "name": "Lisa Pelikan",
               "profile_path": "/9pA1C6RTJ9OT2S0J2xeOKxVqvl4.jpg",
               "id": 115888,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "African Legionnaire",
               "gender": 2,
               "credit_id": "58ea5f7b925141354c03c9c2",
               "name": "Billy Blanks",
               "profile_path": "/g9HvNvwPQrTKcbWDAkHXdGmviZz.jpg",
               "id": 128191,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "security guard",
               "gender": 2,
               "credit_id": "596381369251410c560eb1f9",
               "name": "Tony Halme",
               "profile_path": "/xJVj0IlIvjyiy88Nk1IPQK6ICYN.jpg",
               "id": 89485,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b396f",
               "name": "Sheldon Lettich",
               "profile_path": "/ecORUrI7PKBO3Mm0aVjen1dSng6.jpg",
               "id": 16590,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3975",
               "name": "Sheldon Lettich",
               "profile_path": "/ecORUrI7PKBO3Mm0aVjen1dSng6.jpg",
               "id": 16590,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b397b",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b3981",
               "name": "Anders P. Jensen",
               "profile_path": null,
               "id": 56954,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b3987",
               "name": "Eric Karson",
               "profile_path": null,
               "id": 57665,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b398d",
               "name": "Ash R. Shah",
               "profile_path": null,
               "id": 24953,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b3993",
               "name": "Sundip R. Shah",
               "profile_path": null,
               "id": 57666,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b3999",
               "name": "Sunil R. Shah",
               "profile_path": null,
               "id": 57667,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b399f",
               "name": "John Scott",
               "profile_path": null,
               "id": 29056,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f3c3a36847f80b39a5",
               "name": "Robert C. New",
               "profile_path": null,
               "id": 57668,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b39ab",
               "name": "Mark Conte",
               "profile_path": null,
               "id": 53008,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f3c3a36847f80b39b5",
               "name": "Frank Dux",
               "profile_path": null,
               "id": 56985,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.309709,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9399,
      "vote_count": 227,
      "budget": 6000000,
      "overview": "Lyon Gaultier is a deserter in the Foreign Legion arriving in the USA entirely hard up. He finds his brother between life and death and his sister-in-law without the money needed to heal her husband and to maintain her child. To earn the money needed, Gaultier decides to take part in some very dangerous clandestine fights.",
      "similar": [
         281957,
         3134,
         357096,
         479,
         562,
         156022,
         8456,
         281,
         979,
         238636,
         395834,
         445954,
         26789,
         6312,
         9739,
         8292,
         994,
         23587,
         40805,
         73861
      ],
      "original_title": "Lionheart",
      "runtime": 105,
      "poster_path": "/6dVDVZ5nUAVgj23qSWFUqzRaZrx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Imperial Filmproduktion",
            "id": 2007,
            "origin_country": ""
         }
      ],
      "release_date": "1990-06-07",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "When the streets are a jungle... There can only be one king.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sheldon Lettich"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "S.N. Warren",
         "Jean-Claude Van Damme"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100029/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5NDgxMTgzNl5BMl5BanBnXkFtZTcwMjc0NTUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Claude Van Damme, Harrison Page, Deborah Rennard | See full cast and crew »"],
      "reviews": [
         "This is one of the few films by Van Damme that stand out in my mind when I think of his 'career highlights'. All of his films are formulaic actioners, but Lionheart is one of his better films. His character is more layered here, which makes this more of a drama than most of his others. We as the audience can feel for his character and, as a result, root for him as he tries to evade his past and help what family he has left. A nice little action film, with Van Damme forced to act a little here. For his capabilities, he is convincing as Lyon. Harrison Page is very good in the film as the ex-street fighter turned confidant, and almost steals the show. A highlight of Van Damme's career. *** out of **** stars.",
         "Van Damme is at his best here, it's a good film that moves at a steady pace and is almost like a Rocky/Street Fighter type film. The characters are played well and the right actors and actresses are picked for the right roles. Van Damme's trainer is great and the silent Van Damme is defiantly the best. The plot also unwinds at the right times and at the right pace. You should give this film a go.",
         "Before we head off down critical trail, lets be charitable. This is a Van Damme flick - more or less its own genre, certainly sufficiently signposted for the unwary to avoid if this is not their comfort zone. Now I have to admit to a certain bias - we have almost every film Van Damme has ever made, and for the most part, on simply an entertainment scale, Jean Claude delivers the goods. (Even as late as REPLICANT) This offering - known pretty much EVERYWHERE but the US as WRONG BET (By far the better title when you watch it) is value for money. You wanna see classical acting? go study Laurence Olivier's HENRY V. You fancy mind bending sci-fi...hell, Kubrick's 2001 ain't never gonna be topped. You want to laugh yourself senseless? go watch a Renny Harlin flick...but you want to see some serious hurting on screen...let Van Damme loose. I am tiring of the incessant complaints that Van Damme can't act! Did he ever say he could? How many of his detractors could do any better? Could John Wayne? did anyone ever want to SEE him being anything BUT John Wayne? JCVD does a half decent job here I have to say and it strikes me as a case of \"let him who is without sin\" etc etc when it comes to assassinating his thespian talents. This film has plenty going for it......namely action, conviction and courage. In the genre in which it finds itself necessarily categorised, I believe a 7 is in order!",
         "Lionheart is one of Jean-Claude Van Damme's best films! Van Damme was good, classic 80s series Sledge Hammer star Harrison Page was very good.The Qissi brothers were very good and loved Abdel's character Attila!He is such a great one as I like many things about him!Brian Thompson was good as always Voyo Goric was here and look for Tony Halme AKA Ludvig Borga near the end in the big fight!The movie is never boring and boasts lots of action and great music by John Scott!If you like Van Damme and fighting films then check out Lionheart!",
         "Lionheart is clealry one of the best movies Van Damme made in his early days. The film had good fight scenes and a nice plot. Harrison Page as Van Damme's boy provides a lot of good one-liners and Van Damme kicks a lot of ass. I give it *** out of ****.",
         "Well, I wasn't expecting such a dramatic movie, but this one really made me cry, especially at the ending scene. The movie begins in Djibouti, where a legionary camp is placed. The casting is wisely done. Especially the guys which were following Lion in US. Deborah Rennard is very cool. I think she deserved better in Hollywood. Harrison Page perfectly fits in his role. And Van Damme... Maybe he should have made more drama movies, he proved he is good at it. You should have this on, if you are a fan of Van Damme, I think it is his best movie, even better than Bloodsport. Well we're expecting more drama movies from Van Damme.",
         "Lionheart is yet another Van Damme-movie with a lame story and great fight-scenes. Van Damme escapes from the French foreign-legion to find the people who killed his brother. When he comes to America he starts fighting for money, which he gives to his family. As said before, the story isn`t that good, but it is head and shoulders above the terrible \"Black Eagle\". Lionheart is a great B-movie that is worth renting. 8/10",
         "In the Jean-Claude Van Damme martial arts movie \"Lionheart,\" audiences get to see a side of the Muscles from Brussels not seen in previous action films like \"Bloodsport\" (1988) and \"Kickboxer\" (1989): Van Damme acting and fighting like there's no tomorrow. I must be crazy for giving \"Lionheart\" such a high rating based on \"acting\" from Van Damme but if one can get past the phony Hollywood theatrics and the like, you can see what is very easily the best of Van Damme's early work simply because he isn't trying too hard... yet. For the most part in \"Lionheart,\" the flashy, impossible athleticism of the Belgian-born martial arts sensation's earlier works has been shunned in favor of straight-up no-holds-barred brawling, which is essentially what this picture is about. After his drug-dealing brother is set on fire in Los Angeles, Lyon Gaultier (Van Damme) deserts his post in North Africa with the French Foreign Legion and high-tails it to the United States to reconnect with his brother's wife and five-year-old daughter, with two agents in hot pursuit with orders to bring him back at any cost. Once here, he happens upon a bare-knuckle brawl underneath a bridge and immediately stuns the natives when he dispatches his first opponent with surprisingly little difficulty. At this same match, he also meets Joshua (Harrison Page), a street-wise hustler who becomes Lyon's self-appointed manager and gives Lyon the nickname \"Lionheart.\" Soon enough, Lyon's brawl becomes the talk of the tight little circle interested in such senseless \"human cock-fighting,\" and shamelessly amoral rich-woman fight promoter Cynthia (Deborah Rennard) signs on Lyon as her champion for several no-holds-barred street fights. The arenas themselves are as ridiculous as they could possibly get - an underground parking lot, a racquetball court, a half-filled swimming pool, and a tennis court - but they get the job done in serving shameless blood-sport for the rich who are thirsty for guys beating the living daylights out of each other. At the center of it, of course, is determined Lyon, who puts aside his own reservations about fighting for the rich and focuses squarely on putting money in his family's pockets. For all its scenes of combat and many, many missteps, \"Lionheart\" is very easily the best of Van Damme's early martial arts movies simply because it'll give fans of the genre what they want: maximum Van Damage and, boy, does he damage some of his sparring partners and take some damage of his own. The fight choreography (by Frank Dux, the real-life character Van Damme played in his earlier \"Bloodsport\") is brutal and realistic, with little flash & glitter. It's intense stuff that really captures the beauty and brutality of no-hards-barred combat. The script, which mostly consists of four-letter words, is obviously the weakest point here. But how can you possibly expect a script authored by Van Damme himself and director Sheldon Lettich to be Academy Award-winning material? What people want to see here is fighting, although there are some heartfelt scenes between family that could probably warm the hearts of those who care to see such drama. More gladiator combat spectacle than dramatic actioner, \"Lionheart\" takes us to the Lion's Den and never looks back. 8/10",
         "One thing about this movie is the plot. Basically Lionheart is fighting to raise money for his dead brothers wife and kid. There's not much to the plot but its rare. The fight scenes are OK. The best is the fight at the end.(man did Lionheart go off) What establishes Lionheart is his character: he's a rough survivor but he's caring. In this film there's are no shootouts, sex scenes or explosions. Thats what separates it from most Van Damme movies. But there is a graphic scene of a man being set on fire SO BE WARNED. The end is sad in happy kind of way. This is definitely a must see.",
         "This is easily Van Damme's best Movie.So much better then the double pump triple twirl kick Movie's like Kickboxer and Bloodsport,though this Movie does contain some of those moves as well.It's a wonder why Van Damme didn't do more of these types of Movies.From start to finish this Movie had the family feel,and I thought Van Damme acted very well,and in my opinion had an excellent supporting cast,mainly Harrison Page,it could be argued that he was the real star of the film and again I must wonder why his career didn't take of after this.A very underrated actor who has somehow flown under the radar of Hollywood.Even if your not a Van Damme fan rent this movie,you will be pleasantly surprised."
      ],
      "genres": [
         "Action",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Imperial Entertainment Corporation",
         "Guild",
         "Sunil"
      ],
      "summaries": [
         "Lyon Gaultier is a deserter in the Foreign Legion arriving in the USA entirely hard up. He finds his brother between life and death and his sister-in-law without the money needed to heal her husband and to maintain her child. To earn the money needed, Gaultier decides to take part in some very dangerous clandestine fights.",
         "Lyon Gaultier's brother gets murdered after welshing drug associates in Los Angeles. Lyon is in North Africa serving the last six months of a hitch in the French Foreign Legion when he gets word of the incident, and he unsuccessfully petitions his cold-blooded superiors for leave to tend to family matters. Desperate, Lyon knocks several legionnaires out and stows away on a steamer headed for America. Once Lyon gets near New York harbor, Lyon jumps ship and tries to come up with a way to get enough money to head for California. Lyon comes into contact with street-fight promoter Joshua, an alcoholic ex-street-fighter who links Lyon up with Cynthia, an organizer of no-holds-barred bare-knuckle fights that secretly entertain the wealthy across the country. The minute Lyon makes it to Los Angeles, Lyon finds that his brother's killers are in police custody. Lyon is soon fighting various contenders -- ranging from a Scotsman in a kilt to a long-haired surfer -- earning money to help keep bill collectors away from the door of his widowed sister-in-law Helene and his niece Nicole, who comes to love him. Although Lyon only wants to bash opponents long enough to gain enough money to assist Helene and Nicole, Cynthia is reluctant to let go of her new meal ticket. Helene blames Lyon for not helping his brother sooner, But Lyon keeps fighting and secretly sends her money in the guise of an insurance policy that she didn't know about. Cynthia decides to import a killer-fighter named Attila to polish Lyon off. Not only does she bet against Lyon, she also schemes to turn him over to the Foreign Legion after Atilla beats him. But Lyon has other plans. And there is also a pair of men from the Legion who have been assigned to find Lyon and bring him in."
      ],
      "budget": 6000000
   },
   "movielensId": 26696,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-06-07",
      "dvdReleaseDate": "1998-09-08",
      "directors": ["Sheldon Lettich"],
      "runtime": 105,
      "movieId": 26696,
      "title": "Lionheart",
      "mpaa": "R",
      "actors": [
         "Jean-Claude Van Damme",
         "Harrison Page",
         "Deborah Rennard",
         "Ashley Johnson",
         "Brian Thompson",
         "Lisa Pelikan",
         "Billy Blanks",
         "Tony Halme"
      ],
      "imdbMovieId": "0100029",
      "originalTitle": "Lionheart",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["XZ4x4HqSGFk"],
      "plotSummary": "Lyon Gaultier is a deserter in the Foreign Legion arriving in the USA entirely hard up. He finds his brother between life and death and his sister-in-law without the money needed to heal her husband and to maintain her child. To earn the money needed, Gaultier decides to take part in some very dangerous clandestine fights.",
      "tmdbMovieId": 9399,
      "avgRating": 2.86139,
      "releaseYear": "1990",
      "numRatings": 202,
      "posterPath": "/6dVDVZ5nUAVgj23qSWFUqzRaZrx.jpg"
   }
}