{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "poor class",
            "id": 203142
         }
      ],
      "imdb_id": "tt0100491",
      "video": false,
      "title": "Riff-Raff",
      "recommendations": [
         60041,
         8129,
         62463,
         107285,
         113936,
         151307,
         46495,
         79827,
         47870,
         1785,
         65501,
         3469,
         49559,
         63639,
         40913,
         49980,
         119637,
         69040,
         94259,
         6360
      ],
      "backdrop_path": "/nq8s1PSyXLRel9TANEuSQ1Aeehz.jpg",
      "revenue": 295444,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Stevie",
               "gender": 2,
               "credit_id": "52fe497fc3a36847f819d37f",
               "name": "Robert Carlyle",
               "profile_path": "/dLNeFPfJACiCiUz3oEdAjeKIwvZ.jpg",
               "id": 18023,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Susan",
               "gender": 0,
               "credit_id": "52fe497fc3a36847f819d383",
               "name": "Emer McCourt",
               "profile_path": "/1n3xa3rBTSx581RsBRXcufMJbvF.jpg",
               "id": 68283,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Mo",
               "gender": 2,
               "credit_id": "52fe497fc3a36847f819d38b",
               "name": "George Moss",
               "profile_path": null,
               "id": 240450,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe497fc3a36847f819d38f",
               "name": "Ricky Tomlinson",
               "profile_path": "/oTU9U8AfbII10LaX02vccT8WyXD.jpg",
               "id": 29699,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Shem (as Jimmy Coleman)",
               "gender": 0,
               "credit_id": "58d00dec925141518d000338",
               "name": "Jim R. Coleman",
               "profile_path": null,
               "id": 1780580,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "52fe497fc3a36847f819d393",
               "name": "David Finch",
               "profile_path": null,
               "id": 240453,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Jake",
               "gender": 2,
               "credit_id": "52fe497fc3a36847f819d397",
               "name": "Peter Mullan",
               "profile_path": "/g344UcfsoYtz3Lt148mDtuQ9CQ0.jpg",
               "id": 3064,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Kojo",
               "gender": 0,
               "credit_id": "58d00e23c3a3683f2b0002cd",
               "name": "Richard Belgrave",
               "profile_path": null,
               "id": 1780583,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Fiaman",
               "gender": 0,
               "credit_id": "58d00e35925141519100036e",
               "name": "Ade Sapara",
               "profile_path": null,
               "id": 1006807,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Desmonde",
               "gender": 0,
               "credit_id": "58d00e6fc3a3683f130003b6",
               "name": "Derek Young",
               "profile_path": null,
               "id": 1780587,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Smurph",
               "gender": 0,
               "credit_id": "58d00e7c9251415195000398",
               "name": "Bill Moores",
               "profile_path": null,
               "id": 1765724,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Gus Siddon",
               "gender": 2,
               "credit_id": "58d00e8ec3a3683eef000349",
               "name": "Willie Ross",
               "profile_path": "/hhXNB7Y4LHH4XQ29XOxI9DbTteQ.jpg",
               "id": 1229022,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Ken Jones",
               "gender": 0,
               "credit_id": "58d00e9c92514151da000383",
               "name": "Luke Kelly",
               "profile_path": null,
               "id": 1647575,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Mick (as Garrie J. Lammin)",
               "gender": 0,
               "credit_id": "58d00eb6925141519900036d",
               "name": "Gary Lammin",
               "profile_path": null,
               "id": 1780588,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Wilf",
               "gender": 0,
               "credit_id": "58d00ec5925141518d0003ea",
               "name": "Dean Perry",
               "profile_path": null,
               "id": 1780590,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Singer",
               "gender": 0,
               "credit_id": "58d00edcc3a3683efe00039d",
               "name": "Tracy Brabin",
               "profile_path": "/meWitF1vVYN7gMwYzk7aWLXVqMj.jpg",
               "id": 1773115,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Van Driver",
               "gender": 2,
               "credit_id": "58d00ee8c3a3683f1300041e",
               "name": "Terry Bird",
               "profile_path": "/o6PZYmOnqO7LUsNGqjPQNoDg93F.jpg",
               "id": 218107,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Estate Agent",
               "gender": 0,
               "credit_id": "58d00f06c3a3683f13000442",
               "name": "Angela Morant",
               "profile_path": null,
               "id": 26681,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Robert",
               "gender": 2,
               "credit_id": "58d00f19925141519d0003d9",
               "name": "John Kazek",
               "profile_path": "/saEawikiUbuiXaPP8zjLF6048MV.jpg",
               "id": 1602370,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Ellen",
               "gender": 0,
               "credit_id": "58d00f25925141519d0003e0",
               "name": "Maureen Carr",
               "profile_path": null,
               "id": 1721749,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Fiona",
               "gender": 0,
               "credit_id": "58d00f35925141519500043d",
               "name": "Anne Marie Timoney",
               "profile_path": null,
               "id": 3077,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Medical Secretary",
               "gender": 1,
               "credit_id": "58d00f74925141519100048b",
               "name": "Vicky Murdock",
               "profile_path": null,
               "id": 1696958,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe497fc3a36847f819d375",
               "name": "Ken Loach",
               "profile_path": "/vGtkrPgNeK3xkbbKTQ4vWD1VsEm.jpg",
               "id": 15488,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe497fc3a36847f819d37b",
               "name": "Bill Jesse",
               "profile_path": null,
               "id": 240448,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5918db7d92514159c10498fb",
               "name": "Barry Ackroyd",
               "profile_path": "/mpdR2TB4gS5E3qzSuQ9p6eMxgYD.jpg",
               "id": 15493,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.769908,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 59058,
      "vote_count": 31,
      "budget": 0,
      "overview": "The story of Stevie, a construction worker, and his girlfriend, an unemployed pop singer, serves to show the living conditions of the British poor class",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769
      ],
      "original_title": "Riff-Raff",
      "runtime": 95,
      "poster_path": "/r8TLVWaIiW0bVH5WbivplK8mgwa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Parallax Pictures",
            "id": 983,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel 4 Television",
            "id": 5778,
            "origin_country": ""
         }
      ],
      "release_date": "1991-06-21",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Loach"],
      "runtime": 95,
      "synopsis": "Stevie (Robert Carlyle), a young Glaswegian just out of Barlinnie prison, comes down to London and gets a job on a building site -- a melting pot of itinerant labourers from all over the country -- where he has to contend with Mick the bossy ganger trying but usually failing to control his workers; three hilarious scousers, Shem, Mo and Larry (Ricky Tomlinson); and the other lads as they duck and dive through the rules and regulations of the building trade. In addition, Stevie has other problems to contend with: the wages are low, the site teems with rats, he has nowhere to sleep, and life in London isn't easy. One day on his way to work, Stevie finds a handbag in a skip. He returns it to its owner, Susan, a no-talent singer plagued by depression and neediness. As Stevie and Susan learn to live with the ups and downs of life on the edge, Riff-Raff builds a portrait, often funny, of life as it is lived in the margins. Ken Loach's camera follows the workers unobtrusively as they relax in the squats and pubs, revealing, in their gallows humour, the fatalism of those who feel they've been forgotten by the society they inhabit. An absolute classic, bittersweet comedy/drama from director Ken Loach whose political content is still as relevant now as it was in the Thatcher era. The music for the film is scored by Stewart Copeland of the Police.",
      "writers": ["Bill Jesse"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100491/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzMDc2NDUyNl5BMl5BanBnXkFtZTcwMjkxMjA0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Carlyle, Emer McCourt, Jim R. Coleman | See full cast and crew »"],
      "reviews": [
         "I first saw this film, drunk one Friday after a heavy nights drinking after work on a building site. I was then a bricklayer - a job I had done for over five years. Watching this film, it dawned on me that this was filmed in the part of London where i lived. I could truly relate to it and I would have sworn that the actors had themselves spent their lives working on sites it was so realistic. Go to any site and you will see at least one character who you could say directly related to a charater in this film. The safety aspect has been cleaned up a lot now but back then, sites were a dangerous place to work. Accidents were common and the end scenes were not in any way unrealistic. The thing that did it for me was the portrayal of the working class of Britain. The sentiments were all there, the humour, the desparation, the sense of wanting to rise above the rest and the shattered dreams. They are all here. I would say that if anyone from abroad wanted to study the character of the British working class then they MUST see this film. It is tough, gritty and full of humour...a truly remarkable piece of film that is sadly neglected. Buy it, Rent it, Steal it, Borrow it...whatever you do SEE IT!",
         "In some ways I felt as though I'd died and gone to heaven the first time I saw Riff Raff, an out and out honest look at working class men of varied, and sometimes dubious, backgrounds connected through their work on a construction sight in London. The cast of characters defines the term 'mixed bag'. I couldn't help but think of a half dozen or so Archie Bunkers on the job site, each one with their own set of priorities, talking about the most important thing in the world, to no one but himself. It all brings a smile to my face. Our closest look is at Stevie (Robert Carlyle of \"The Full Monty\"), a former petty thief, who works with a crew converting condos for the nouveau riche, while he's forced to break into an abandoned building just to find a place to squat. Director Ken Loach expertly focuses on the lower class in Britain (witness his brilliant 1999 feature-\"My Name is Joe\") where the honesty laced with humor of his viewpoint tends to provide humanity to an otherwise ignored sect. To shine a bit of light on an otherwise dismal existence as it may. Loach's characters are never overly redemptive: they don't hit the lottery; aren't left millions by a dead aunt; or marry a rich suitor. And the ending here is a bit short, trite. But they usually come through the film a little stronger having weathered their travails, feeling a little better about themselves. I dare say we come through feeling a little better about ourselves as well.",
         "It is rare that a drama is anything about your life or any part of it. I apologise is your job is searching for serial killers or on your way to becoming a world sporting champion after overcoming cancer, but what we have here is a little bit of (UK) working class reality. Trust me I was there and so was the late writer Bill Jess. (Jess died shortly before this film came out.) I worked on a building sites at weekends as a 15 year old and although I have no pictures or film to remind - at least I have this and the buildings that I helped construct. I have met all of the people under the loop here (not always on building sites though) and, to be quite frank, it is all a bit frightening. However I lived in a predominantly white district so I had no experience of on-the-job multiculturalism, and that is the only part I cannot really comment upon or relate to. Robert Carlyle is a genius at portraying the British working-class. Maybe he is the real thing, in part, but he seems able to transform himself physically as well as mentally. I have never seen him overact in anything and he has had plenty of opportunities. He even takes on impossible parts like Hitler! Here he is a Glasgow jailbird, squatting in London and hoping to make a few quid on the black economy. He hooks up with a girl that claims to be a singer and poet, but is actually only in to hard drugs. He deals with the situation the best he can using the only language he can. London is the 1980's was one of the cheapest places in the world to live. You wanted a flat? - get a crowbar - here's your flat! Well for a short while before the heavy mob show up. That is how the rock group The Police first got to live in our capital city! (Today building sites are full of foreign workers - some legal, some not - that don't squat but live in the back of vans parked on or near the site.) Strangely, Ricky Tomlinson became a actor after being banned from building sites due to his political activities. In 1973 he sent to jail (see his IMDb bio) in an episode that shows British justice at its worst: Charging someone with a serious offence and then trying to get a guilty plea in return for a lesser charge. Ricky - being a man not a mouse - didn't fall for it. Others did, making it look extra bad for him. He later went to be a popular man on TV and British film and will earn over a million dollars from his autobiography \"Ricky\"! What makes this film even more frightening is the dramatic conclusion. Something similar (although not quite as serious) happened where I worked - although not while I was there. In a coincidence that would make a TV script writer blush I was with the boss of the said firm in a van and we passed the subject in the street. \"He got very lucky,\" said Mr Boss-man waving from the van, \"he landed on his head and that is what saved him.\" It was pure Ken Loach moment, so I hope he is reading this.",
         "This is a good film but what is great about it truly is the acting. I agree with the other poster here that the acting is phenomenal and the main actors in this movie truly shine as though they really are the characters they are playing in this film, 100% believable in their roles. Big congrats to the cast of this one for their great work. I only saw this by happenstance because my friend taped it on a cable channel years ago by mistake and we were looking for a tape to record a show while we were out and I said not to tape over this because it looked interesting, how about that? It's about the working class in England and seems to be very realistic about these hard working people who sometimes have very dangerous jobs they simply don't have any other choice of making a living. I am surprised never to have heard of this movie before but if you get a chance to watch it I would say check it out for sure if you are a fan of good acting :)",
         "Riff Raff is one of Loach's more humorous depictions of working class life. That said it's still not comedy, it a melodrama with political overtones. What it's really about is the collapse of the working classes due to the Thatcherite policies introduced in the 1980's. The collapse of the power of the trade unions and the incorporation of capitalisation and 'big business'. These workers are struggling to live below the breadline, working in unsafe conditions and squatting wherever they can. It's a tragedy of circumstance really but there are moments of romance and humour provided mostly by Ricky Tomlinson. Taking a bath in a show house. Hilarious.",
         "I've always been astonished by Ken Loach's ability to make me forget that these are actors that I'm watching, or that this is a movie on a set, etc. The characters in this film are so real, so lifelike, that it was almost like watching a documentary. The film very wisely employs subtitles for the English dialogue, much or most of which would be unintelligible to an American audience. Several of the reviews I have read of this film call it a comedy. Well, although there are one or two comic scenes, to me this is far from a comedy. This is a bitter and biting howl of rage against the plight of the working class in the UK. These men are used and exploited by their employers. There is no doubt that these construction sites would be cited for safety violations, or even closed down, if they were in the USA. and the owner-managers might well be prosecuted, since their willful negligence ultimately results in a death. What is lacking in the British working class, if this film is any guide, is any sense of upward mobility, any hope, any sense that I can make it out of this and find a better life. The one exception to this is the protagonist's girl friend, who is a monumentally untalented aspiring singer, and in her case we don't feel that there is much hope either.",
         "Ken Loach doing his usual social documenting of working class nitty grittiness. It's \"Boys from the Blackstuff\" meets \"Auf Wiedersehen Pet\"; indignant about the selfish \"Me Me Me\" property developer greed of the Thatcher years � but leavened by typical Scouse (and Manc) sarcasm, and softened with a short if not so sweet romance. Robert Carlyle is Stevie, fresh out of jail, and having a go at life outside Scotland; gets taken on as a construction worker; is found an empty council flat to squat; is quickly shacking up with Susie, a fragile, troubled, Irish singer. He's soon back into his petty thieving ways; knocking off machinery from the site. \"Labourin is rubbish, boxer shorts is better (selling of)\" seems to be the extent of his aspiration. Stevie and Susie are both \"unstable\" characters so arguing is bound to be happening; he's having to drag her out of bed: \"Depression is for the middle classes � the rest of us have got an early start in the morning\". Then he gets news his mothers died � so he's off up to Scotland for the funeral. Cue a black comedy scene at the crematorium with inept swinging of urn � mother ash thrown all over the party of mourners. Returning, Stevie is just in time to see Susie sticking a needle up her arm. It's at this point Robert Carlyle breaks out into a warm up version of Begbie from Trainspotting: nut-ting people in the gob, stamping on their wotsits etc. And as for Susie: She's dumped. End of. No sympathy with junkie smack-heads has Stevie. Or Begbie. Or even Robert Carlyle. Ricky Tomlinson is in the film too � as a mouthy Trade Union sympathiser, his Commie vitriol redeemed by sarky gags and loud laughing; a bit like a younger version of Jim Royle, minus the beard. Towards the end i was thinking: someone's gonna be falling off this dodgy scaffolding without his tin hat on in a minute � and sure enough, he was. And Them Barstewards are gonna have to pay for that. We need some Natural Justice here. Lets burn the whole flipping lot down. Any volunteers? Yeah. Stevie will do it. With glee. The film is unaffected in its down to earth portrayal of the working class bloke: the thieving cheating lying lazy barsteward that skives around as cheap casual labour on building sites while fiddling the dole type of working class bloke. The type that doesn't really give a monkeys. As long as it gets paid. Even if it doesn't get paid enough. Cus the company employing it is an exploitative cheating lying greedy barsteward too. Its a right riff raffy racket is the Building Trade. Seems to be the message. Something i � and all of us � knows already. So nothing new there then. But my � and your � cynicism will get a nice pat on its back. I wouldn't want any of this lot building a house for me.",
         "This unpretentious British indie film is a rough diamond in the rough. It chronicles the lives of a handful of blue collar workers trying to survive in early 90's London. It's almost documentary in style and narrative, which lends a feeling of authenticity, which is helped also by fine performances all around. Shows the humor, frustration and dashed dreams in an unforgiving society, and it has heart. It is at times funny, heart wrenching, and touching. The accents are thick, so you may appreciate the subtitles that are on some versions. I found them distracting, so I put some tape over the bottom of the screen. I had to strain a few times to understand, but I don't think the subtitles were necessary. Well worth a watch.",
         "Loach has once again made a film about working class Britain, and filled it full of humour and heart. But as always with his films, soon after the humour comes a lot of pain, and even at the beginning when the two lovers meet, it's under depressing circumstances, and the relationship between them never really gets any better. Loach always manages to get great performances from all of his cast, and special mentions to Carlyle and Tomlinson, for putting in some very respectable performances. But the issue here is the class struggle, hence the title and the killing of the rats. To other classes, is this demographic of people classed as rats? The film asks a lot of questions, and thanks to the bleakness of the film and the settings, a lot of i is justified. But then Loach shows us that we are all the same when it comes to the bottom line, and no amount of scaffolding can change that. It packs a punch, but it's so full of rich humour and characters, the bleakness is almost lifted."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Parallax Pictures",
         "Channel Four Films"
      ],
      "summaries": ["The story of Stevie, a construction worker, and his girlfriend, an unemployed pop singer, serves to show the living conditions of the British poor class"],
      "budget": 0
   },
   "movielensId": 26703,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-06-21",
      "dvdReleaseDate": null,
      "directors": ["Ken Loach"],
      "runtime": 95,
      "movieId": 26703,
      "title": "Riff-Raff",
      "mpaa": "",
      "actors": [
         "Robert Carlyle",
         "Emer McCourt",
         "George Moss",
         "Ricky Tomlinson",
         "Jim R. Coleman",
         "David Finch",
         "Peter Mullan",
         "Richard Belgrave",
         "Ade Sapara",
         "Derek Young",
         "Bill Moores",
         "Willie Ross",
         "Luke Kelly",
         "Gary Lammin",
         "Dean Perry",
         "Tracy Brabin",
         "Terry Bird",
         "Angela Morant",
         "John Kazek",
         "Maureen Carr",
         "Anne Marie Timoney",
         "Vicky Murdock"
      ],
      "imdbMovieId": "0100491",
      "originalTitle": "Riff-Raff",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["pCvGCLC1vWo"],
      "plotSummary": "The story of Stevie, a construction worker, and his girlfriend, an unemployed pop singer, serves to show the living conditions of the British poor class",
      "tmdbMovieId": 59058,
      "avgRating": 3.40741,
      "releaseYear": "1991",
      "numRatings": 27,
      "posterPath": "/r8TLVWaIiW0bVH5WbivplK8mgwa.jpg"
   }
}