{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "sergeant",
            "id": 11400
         },
         {
            "name": "army life",
            "id": 173458
         }
      ],
      "imdb_id": "tt0101531",
      "video": false,
      "title": "Cadence",
      "recommendations": [
         142322,
         76716,
         44181,
         69121,
         28047,
         32029,
         27058,
         15720
      ],
      "backdrop_path": "/mkUR5pWPDiXdLJjlYC8yFkfRMtD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Pfc. Franklin Fairchild Bean",
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d2d",
               "name": "Charlie Sheen",
               "profile_path": "/g4e1QpcNTpmq2uPr5GDNuMvjRuU.jpg",
               "id": 6952,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "MSgt. Otis V. McKinney",
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d29",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Roosevelt Stokes",
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d31",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Eugene 'Spoonman' Bryce",
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d35",
               "name": "Blu Mankuma",
               "profile_path": "/uazVph0ws1sQvxkE7PmNDQMXIE4.jpg",
               "id": 44150,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Edward James Webb",
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d39",
               "name": "Michael Beach",
               "profile_path": "/lOlWhURNKyZHn71dvq7qC7fiwN6.jpg",
               "id": 87118,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Harry 'Sweetbread' Crane",
               "gender": 0,
               "credit_id": "576105bac3a36808c0000bdc",
               "name": "Harry Stewart",
               "profile_path": "/oDWbtC4tI2HlvdqGpRZVdSmlrcU.jpg",
               "id": 1636212,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Cpl. Harold Lamar",
               "gender": 2,
               "credit_id": "576106e3c3a36808aa000c57",
               "name": "James Marshall",
               "profile_path": "/xek3aHOpg16QEY8EzfByKTNViUh.jpg",
               "id": 6717,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Cpl. Gerald Gessner",
               "gender": 2,
               "credit_id": "57610aa9c3a36808ae000c76",
               "name": "Ramon Estevez",
               "profile_path": "/mkAmcszSMT5ZRX969zlUtGPdCv1.jpg",
               "id": 971538,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "57610c4592514175c8000c78",
               "name": "Lochlyn Munro",
               "profile_path": "/caBPICexFi48JIvsEdwJGjQrTmY.jpg",
               "id": 58058,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d19",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d1f",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a0c3a368484e065d25",
               "name": "Dennis Shryack",
               "profile_path": "/e169Giwe3PK5K0cXOORm6J4U32A.jpg",
               "id": 53006,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.210731,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 28553,
      "vote_count": 26,
      "budget": 0,
      "overview": "As punishment for drunken, rebellious behavior, a young white soldier is thrown into a stockade populated entirely by black inmates. But instead of falling victim to racial hatred, the soldier joins forces with his fellow prisoners and rises up against the insanely tyrannical and bigoted prison warden.",
      "similar": [
         278,
         10734,
         29381,
         29259,
         107846,
         9291,
         5925,
         1429,
         1701,
         38234,
         1368,
         708,
         76640,
         5924,
         10447,
         5971,
         575,
         6075,
         11778,
         769
      ],
      "original_title": "Cadence",
      "runtime": 97,
      "poster_path": "/ksJEifW0dHcVIdtlCZuhpOq65l5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Movie Group",
            "id": 44962,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Republic Pictures (II)",
            "id": 10348,
            "origin_country": ""
         }
      ],
      "release_date": "1990-11-16",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Sometimes you've got to stand out to fit in.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martin Sheen"],
      "runtime": 97,
      "synopsis": "It's the mid 1960s and for getting drunk and going AWOL after his father dies, Army Private Bean (Charlie Sheen), stationed in West Germany, gets 90 days in the stockade. Bean discovers that he is the only white in a block of black prisoners imprisoned for various crimes, some extremely serious. Master Sergeant McKinney (Martin Sheen, who also makes his directorial debut in this movie) commands the stockade and soon develops a dislike for Bean because Bean will not take sides against his fellow prisoners. Each day the prisoners are trucked to work on land near the stockade. In a corner of a field is a broken windmill which Bean becomes intrigued with and gets permission to repair during work breaks. Soon some of the other prisoners from the block start helping Bean with the windmill. But Sergeant McKinney's dislike of Bean keeps growing. The harder McKinney pushes, the more Bean digs in. Clearly things must come to a head. But who will come out on top?",
      "writers": [
         "Dennis Shryack",
         "Gordon Weaver"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101531/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5Nzg3NDE3MF5BMl5BanBnXkFtZTcwMzc2NjY0MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Charlie Sheen, Martin Sheen, Jay Brazeau | See full cast and crew »"],
      "reviews": [
         "I seldom comment on a movie, but I so strongly disagreed with a prior comment on this movie, I felt I had to add two cents. I found this entrant far from boring. I have watched it four or five times, each time finding a new focus. The movie's idea is interesting, the conflict between the Sheens believable and well played, and the supporting cast excellent. Laurence Fishburne and James Marshall in particular are pleasures to watch. As the second of Sheen's two stints as a director I was impressed. Even the basic set works for me. And the music is so good that I continue to look from time to time to see if an actual CD is available. I believe that if you get your hands on this movie you won't be disappointed.",
         "Plot summary: Charlie Sheen is thrown into an army stockade with a whole gang of brothers, and they need to learn to work together to get through it. Translation: He's the only white guy in the bunch, and if his honky azz messes up, he won't be rollin'. This underground (hardly any theater time) military movie turns out to be quite a winner. Charlie Sheen is superb, Laurence Fishburne does a great job, and Martin Sheen pulls off a great directorial debut to the big screen (along with a nice acting performance). I was in the army for many years and I could totally relate sometimes how it was to be the white guy trying to fit in. It's a tough situation to capture in film and make work (it's been attempted hundreds of times), but Martin does a very nice job. The 'Chain Gang' song they sing through the movie was so good that I recorded it off the the movie to MP3. My squad once attempted to perform that cadence dance. It was very amusing. 'Gig for Bean' is a quote I used to say all the time. Every once in awhile someone would get it and it would be a classic moment. 3 out of 4 paws on this one. (More reviews at www,warcat,com)",
         "This movie surprised me. I am not really big on Charlie Sheen movies, other than Platoon, but this is a truly good movie. Martin Sheen gives a good performance, as does the supporting cast. The setting, while not authentic, is real enough. The dialogue and acting are both excellent and believable. I found I was interested in the characters, and although the ending is predictable, it was fitting. I would recommend this movie to just about anyone, other that the hardcore action enthusiast. Definitely an entertaining film, and one that is quite a bit better than the rating it has received. I wouldn't hesitate to rent it again.",
         "More than any of his other movies that I have seen (even \"Wall Street\" and \"Platoon\"), \"Cadence\" makes me hope that Charlie Sheen will not throw away his talent. He does a remarkable job in this movie, which is even more impressive because everyone else does a terrific job too! (Martin Sheen, Laurence Fishburne, Michael Beach...) This movie didn't last long in the theaters, which is a real shame, because too many people missed it! It has a timeless, touching message of brotherhood, acceptance and friendship, which it conveys through an interesting story and very engaging characters. Overall, it's serious, and even disturbing at times, but it has enough humor and light moments to give you hope and a good feeling at the end. The dream about being white and the prison-yard basketball game are two wonderful and memorable scenes, and you never will hear the song \"Chain Gang\" quite the same way again! I love this movie! I hope you will, too!",
         "Perhaps, it was my having seen this movie with a bunch of my Army buddies - while in the Army. Or maybe, being a Larry/Laurence Fishburne FANATIC! It could be that I saw this with my heart open and my mind closed...nah, none of the above reasons are why this movie ranks as one of my all-time favorites. It is the camaraderie and class of the relationship that Martin Sheen created with his main characters. Never have I seen a movie with such honesty and triumph. Truly, I saw the ending before it came...but I didn't care. Isn't that what a GOOD director will do - make you appreciate the movie and not focus on what the end result will be. The \"End of My Journey\" rips through me every time I hear it. A great film study on what true friendship is when race is not factored into the equation. 9/10 - And, I know flicks!",
         "One of the best movies that I have seen, even though it was a sleeper during it's Theater run. The movie relates back to my days as an MP in the 503rd MP Co,3AD, Butzbach, Germany. The British Columbia set and location are true to life The interaction between all characters shows the eventual break down of the barrier that is created with stereo-typing. Charlie and Martin Sheen's characters seem to bring some of their real life tribulations out on to the screen. It is well known that Charlie,his brothers and Dad had a turbulant relationship during their teenage years. It appears that there is a family reconciliation taken place. I also think it's formidable that Martin brought back Lawrence Fishburn, who was just a young and upcoming unknown in \"Appocolypse\". I would make this film part of the Army's Training Library on racial sensitivity. Can't help but watch this movie every couple of months.",
         "In many ways, the military in this country has been in the forefront as far as social advancement is concerned. When Harry Truman decreed back in 1949 that the segregated military had to go, the armed forces went thru most of the same turmoil that the civilian world was to undergo years later. In the Vietnam war era these upheavals were still going on in the services; while not officially segregated, there were two distinctly separate groups living and working together under an uneasy truce. The film talks about those times, and the frictions of the situation come through with amazing clarity. CADENCE tells about another basic truth about military life that is that is unknown to those who never wore a uniform. To outsiders, military people seem monolithic; everybody is identical, interchangeable, and of a like mind. Nothing can be farther from the truth. There are sharp and RIGID social divisions based on rank and tradition, justified by the concept of military discipline. Privates don't hobnob with colonels, and frankly even if the opportunity presents itself they never really communicate frankly with each other. To be honest about it, they don't even LIKE each other very much. Nowadays, the divisions will include gender lines. Those lines are why bases with bars will usually have separate Enlisted, Noncommissioned Officer's, and Officer's clubs; the doctrine may claim that everyone in uniform is equal, but the reality is that nobody wants to press that idea very far. To these divisions CADENCE adds the aspect of \"free\" versus \"prisoner\", something we don't often see presented accurately in films. This is the niche that the film centers on. Each division within the military macrosociety has it's own social mores and it's own loyalties to others within the group. There is a fierce pride in each group, and interestingly that holds true for the prisoners too. That pride, an amalgam of both the Black and prisoner subdivisions shows itself clearly in the startling march cadence the stockade soldiers have adopted, based on Sam Cooke's song \"Chain Gang\". Private Bean, the new prisoner, is mightily confused and astonished the first time he sees it, but it gradually teaches him a lesson that the Army tried, but failed, to impart; you're no longer an individual, but part of a GROUP, dedicated to a common cause and to the welfare of the group. It's ironic that the unit cohesion and esprit de corps this bunch of stockade prisoners has forged on it's own should be the ENVY of every officer on the base; interestingly, there isn't a single scene where an officer actually SEES their expression of it. The only time these distant, disconnected officers interact with the prisoners is in stiff, structured, and regulation proscribed situations like in church services and courtrooms where they're dealt with as INDIVIDUALS, not as a unit. In many ways, Bean's stockade time is his REAL basic training. He learns \"courtesy\" (\"Ask a man what he's CHARGED WITH; NEVER ask him what he's DONE\"), he learns unit loyalty by standing with his fellow prisoner and keeping his silence about what happens in the barracks. He learns that a man has to carry his own burdens (in this case, doing his own time in a manly, stoic manner). He learns that a man must earn respect by his own actions and skills, be it on a basketball court or by repairing a broken windmill. And in the final scene he learns the most important lesson of all; the most valuable thing a man can possess is the honor and respect that is bestowed on him by his peers. Martin Sheen as Sgt. McKinney radiates evil, and epitomizes those still present vestiges of racism that the military tried in that period to pretend didn't exist. He's hard core, burned out, and Old School all the way. This hardassed old Noncom knows full well what sort of men he has locked up in his jail, and he also knows, but refuses to respect, the tightly integrated unit they've formed. Given other circumstances, I can see McKinney proudly leading these guys into combat... but he's been discarded by the Army because of his age. He in turn clings to the old military pecking order and despises the prisoners... the military says they are scum, and he holds fast to that opinion to bolster his own fallen position in the food chain. Otis McKinney's is infuriated by the fact that private Bean has done something that he couldn't; after a long, hard struggle, Bean has earned the respect of the stockade prisoners. McKinney MUST destroy Bean or accept the fact that this young punk private is a better man than he is, and is able to survive in a world defined by race, age, and culture that would destroy McKinney's supposed \"superiority\" based on rank and race. The situation develops into a battle of wills that constantly escalates through Bean's 90 day stay, with ultimately tragic results. Lawrence Fishburn is outstanding as Stokes, the leader of the compound. The movie never makes it clear just WHY he's been imprisoned, and he pointedly tells Bean not to ask. Despite that, we get the impression Roosevelt Stokes would be a powerful leader of men in or out of the stockade. Special mention has to be made of Harry Stewart, as \"Sweetbread\" Crane. Sweet is an obviously retarded soldier who doesn't speak, but who isn't totally mute; as Stokes puts it \"The man has PIPES... pipes that will put Jesus into your heart instantly\". Besides singing a solo part on the \"Stockade Shuffle\", his performance of a hymn in a chapel sequence (one that Stewart WROTE, incidentally) shows the man to have an amazing vocal talent! I can't really call CADENCE a great film, but it's indeed an interesting glimpse into the social and psychological factors at work within the armed forces.",
         "Reading Maltin's summary may steer you away from a film which, after an unpromising beginning, develops into a gripping drama, aided no end by superb acting from the nine very individual players in this film: Charlie Sheen, as the white prisoner incarcerated with five black soldiers in a military stockade, the two very different white guards, and Martin Sheen as the bullying and racist Sergeant who causes the tension to mount as his personal problems drive him to take out his frustrations on his charges. Martin Sheen perhaps gives the weakest, because least believable, characterization. It is Charlie Sheen as the initially wary room mate and the five finely etched black prisoners, all very good in their roles, who forge a memorable dramatic scenario out of their situation. Martin Sheen's sole directorial effort makes the most of the increasingly tense story-line. See it, it's good!",
         "You'll have a tough time getting that one out of your head. Charlie Sheen's best work next to Wall Street as a renegade Army private stuck in a German stockade during the Vietnam War. A flash of early brilliance by Laurence Fishburne with a great, but twisted dynamic between Charlie and Martin Sheen. What can you say, this movie is just terrific! 9/10",
         "This reserved little drama stars Charlie Sheen as the lone white prisoner in a 1960s army stockade. Initially apprehensive toward his new roommates, he soon becomes one of them, much to the chagrin of the racist Master Sergeant, played by dad Martin Sheen. Rather than give in to the sarge, the younger Sheen continues to stand his ground, which only further frustrates his superior. The younger Sheen, who delivers one of his best performances as the troubled private, is surrounded by an able cast that includes Laurence Fishburne and Michael Beach. The story is captivating at times, but unravels at others, particularly during the climax when the elder Sheen loses control. There just wasn't enough buildup to make his bullet-spewing outburst believable. Still, CADENCE is overall a quality picture that deserved more than its status as one of the big box office stinkers of 1990 (it only grossed $173,601 its opening weekend and just over $2 million overall). CAST NOTE: Brent Stait, who has a brief role near the end as a psych ward MP, is best known for his role as Rev Bem on the T"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Movie Group, The",
         "Northern Lights Media Corp.",
         "Republic Pictures (II)"
      ],
      "summaries": ["Charlie Sheen plays a rebellious inmate in an Army stockade."],
      "budget": 0
   },
   "movielensId": 26719,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-11-16",
      "dvdReleaseDate": null,
      "directors": ["Martin Sheen"],
      "runtime": 97,
      "movieId": 26719,
      "title": "Cadence",
      "mpaa": "PG-13",
      "actors": [
         "Martin Sheen",
         "Charlie Sheen",
         "Laurence Fishburne",
         "Blu Mankuma",
         "Michael Beach",
         "Harry Stewart",
         "James Marshall",
         "Ramon Estevez",
         "Lochlyn Munro"
      ],
      "imdbMovieId": "0101531",
      "originalTitle": "Cadence",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["q1R90m3gW54"],
      "plotSummary": "As punishment for drunken, rebellious behavior, a young white soldier is thrown into a stockade populated entirely by black inmates. But instead of falling victim to racial hatred, the soldier joins forces with his fellow prisoners and rises up against the insanely tyrannical and bigoted prison warden.",
      "tmdbMovieId": 28553,
      "avgRating": 3,
      "releaseYear": "1990",
      "numRatings": 19,
      "posterPath": "/ksJEifW0dHcVIdtlCZuhpOq65l5.jpg"
   }
}