{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "radio",
            "id": 2135
         },
         {
            "name": "rain",
            "id": 2217
         },
         {
            "name": "underwear",
            "id": 3508
         },
         {
            "name": "kiss",
            "id": 5091
         },
         {
            "name": "philippines",
            "id": 6895
         },
         {
            "name": "beating",
            "id": 9849
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "drink",
            "id": 33719
         },
         {
            "name": "sailor",
            "id": 41599
         }
      ],
      "imdb_id": "tt0101258",
      "video": false,
      "title": "Days of Being Wild",
      "recommendations": [
         24163,
         11220,
         18329,
         40751,
         11104,
         844,
         843,
         68883,
         56616,
         37185,
         28273,
         25538,
         11471,
         26302,
         5910,
         69599,
         37288,
         16672,
         469,
         21450
      ],
      "backdrop_path": "/9fDRNaX63Z7gx24N1oMIAazVKS3.jpg",
      "revenue": 141864,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Policeman",
               "gender": 2,
               "credit_id": "52fe47739251416c75099cdd",
               "name": "Andy Lau",
               "profile_path": "/mrGR5igHcVWdUP1X8yIt1qBMX1L.jpg",
               "id": 25246,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "York",
               "gender": 2,
               "credit_id": "52fe47739251416c75099cbd",
               "name": "Leslie Cheung",
               "profile_path": "/jY0eInsklo9aYc1Som6vEdVd4OL.jpg",
               "id": 69637,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "So Lai Chun",
               "gender": 1,
               "credit_id": "52fe47739251416c75099cc1",
               "name": "Maggie Cheung",
               "profile_path": "/eT5HNJT307Zg2PyMsgKdrtIlG3u.jpg",
               "id": 1338,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "York's pal",
               "gender": 2,
               "credit_id": "52fe47739251416c75099cd9",
               "name": "Jacky Cheung",
               "profile_path": "/n3zdB09qfGem9V0wftu1MXagqP.jpg",
               "id": 25245,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Dressing up to go out",
               "gender": 2,
               "credit_id": "52fe47739251416c75099ce1",
               "name": "Tony Leung Chiu-Wai",
               "profile_path": "/xSEwMBLHdiKjyG4YVCsjpaT5fgD.jpg",
               "id": 1337,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Mimi Leung Fung Ying",
               "gender": 1,
               "credit_id": "52fe47739251416c75099cc5",
               "name": "Carina Lau",
               "profile_path": "/lYKpESOemC8GVxfnInJVC6zglVD.jpg",
               "id": 12672,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Rebecca",
               "gender": 0,
               "credit_id": "52fe47739251416c75099cd5",
               "name": "Rebecca Pan",
               "profile_path": "/7UFb7P8IrcNNmhDShBfH7XhdA6d.jpg",
               "id": 12462,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Hotel Maid",
               "gender": 0,
               "credit_id": "5a138618c3a36811520022be",
               "name": "Maritoni Fernandez",
               "profile_path": "/mVBlHbkHwerUH5bLiD0nplnwZKO.jpg",
               "id": 1244139,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Housekeeper",
               "gender": 1,
               "credit_id": "5a1386949251410f8d0022f4",
               "name": "Alicia Alonzo",
               "profile_path": "/aTwYLAbgoIWRJe9ibIzEKOkhceB.jpg",
               "id": 1094915,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Yuddy's Mother",
               "gender": 0,
               "credit_id": "5a1386f4c3a368114000256e",
               "name": "Tita Muñoz",
               "profile_path": null,
               "id": 1416154,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47739251416c75099ccb",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47739251416c75099cd1",
               "name": "Wong Kar-wai",
               "profile_path": "/zLngBAag9DSKtSAOWcfsFtEU3i5.jpg",
               "id": 12453,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5310c5d7925141101300124b",
               "name": "Christopher Doyle",
               "profile_path": "/u7xRErdN6ya9qzOG8PVa2QshZFC.jpg",
               "id": 1357,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.577727,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 18311,
      "vote_count": 110,
      "budget": 0,
      "overview": "The movie is set in Hong Kong and the Philippines in 1960. Yuddy, or 'York' in English, is a playboy in Hong Kong and is well-known for stealing girls' hearts and breaking them. His first victim is Li Zhen who suffered emotional and mental depression as a result of Yuddy's wayward attitude. Li Zhen eventually seeks much-needed solace from a sympathetic policeman named Tide.",
      "similar": [
         65496,
         425895,
         38234,
         469691,
         461438,
         12912,
         468033,
         480655,
         24103,
         352273,
         359589,
         452196,
         111798,
         420122,
         437231,
         425849,
         474288,
         449658,
         433094,
         16867
      ],
      "original_title": "阿飛正傳",
      "runtime": 94,
      "poster_path": "/qZnK1MRFcuxJS3DAWjcACR9zSxG.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         },
         {
            "name": "",
            "iso_639_1": "tl"
         }
      ],
      "production_companies": [{
         "logo_path": "/wdtjT9x5OG7nLusPctACI3i7Im2.png",
         "name": "Media Asia Films",
         "id": 5552,
         "origin_country": ""
      }],
      "release_date": "1990-12-15",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.kino.com/daysofbeingwild/",
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kar Wai Wong"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Jeffrey Lau",
         "Kar Wai Wong"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0101258/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNjQxNzkyOF5BMl5BanBnXkFtZTcwMjExMjcyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Leslie Cheung, Maggie Cheung, Andy Lau | See full cast and crew »"],
      "reviews": [
         "In Wong Kar-wai's 1991 film Days of Being Wild, Yuddy (Leslie Cheung), a charming drifter captures the attention of store attendant Su Lizhen (Maggie Cheung) by asking her to look at his watch. When she sees that it says one minute before 3:00PM on April 16, 1960, he tells her that she will never forget the moment and will dream about him that night. The next time they meet, the moment becomes two, then one hour, then weeks and months but Yuddy is like the mythical bird with no legs that just flies and flies and never lands. Abandoned by his real mother and brought up by a wealthy alcoholic courtesan (Rebecca Pan), he does not know where he came from or where he is going. He treats women with little respect, discarding them when they no longer serve his purpose. When one lover asks him if he loves her, he tells her that during his life he will be friends with many, many women but won't know whom he truly loves until the end. Days of Being Wild unfolds like a dream with color filters, unusual shadows, and the sights and sounds of Hong Kong's rainy nights and sweltering summers. Based on the director's memories from his childhood and admiration for the style of Argentinean novelist Manuel Puig (Heartbreak Tango), the film is a series of episodes involving six people who touch each other's lives. After his short-lived relationship with Su, Yuddy meets a cabaret dancer who calls herself Mimi (Carina Lau) but their relationship fares no better and she is left to suffer the consequences of their breakup. Meanwhile, Su meets Tide (Andy Lau), a gentle policeman whom she is able to confide until he suddenly leaves Hong Kong to become a sailor. Each character seeks a sense of identity and fulfillment. After Rebecca tells him of her plans to move to America with her boyfriend, she finally lets him know who and where his real mother is. After Yuddy goes to the Philippines to try to find his mother, the lives of the main protagonists come together in a powerful conclusion. Days of Being Wild may sound like a soap opera but the film reaches a much higher artistic level. Supported by outstanding performances by Leslie Cheung, Maggie Cheung, and Jacky Cheung as Yuddy's only friend Zeb, it is a tone poem about longing and one's search for identity. We care about the characters even though they don't seem to care about themselves. Like many of us, they pine for the things that might have been, the word that was never said, and the love that remains elusive. A commercial failure but an artistic triumph, Days of Being Wild is a moody, atmospheric film that with its background of popular music, in this case 1950's rumbas and cha-cha's, forecasts the director's later In the Mood For Love. As a beautifully realized example of alienated people desperately seeking their place in the world, however, it stands securely on its own.",
         "There is a two-minute action sequence, but that is NOT what this masterpiece is about. 'Days of being wild' has to be the best film of Wong Kar-Wai or at least MY favourite. There are three stories (in one) that feel like film-noir now and then, but are principally about the distance in several different relationships. Kar-Wai lets his characters struggle with urban loneliness and lets them search indefinitely, unable to settle down. They only have the chance to create 'One Minute Friendships' that might seem magic but don't offer satisfaction and have to be ended. The quest continues. Won Kar-Wai poses the question whether you have lived actually when you've searched all your life for friendship/love. Two or three voice-overs scarcely help the portrayal of the characters, but only when the story allows it. I prefer this film over Chungking Express anytime. One reason for that is the great use of music here, while his other films tend to drown in the excessive use of western music. The acting is also really brilliant in this eclectic work. Subtle and masterly cinematography by Christopher Doyle (Chungking Express, Fallen Angels '95): less colorful than 'In the mood for love', but therefore more applicable for the fifties. Moreover, the dynamics are also much more subtle than everything Kar-Wai and Doyle have done up till now. In contrast: Happy Together and Fallen Angels were brilliantly photographed because there it was more appropriate to use dynamic cinematography (more temperament). It's only Kar-Wai's second film but still his most solid and memorable and maybe even more internationally appealing than 'In the mood for love', without making compromises or getting sentimental. I just can't think of anything that is not good in 'Days of being wild'. 10 points out of 10 :-)",
         "Though it has been argued that 'A Fei Zheng Chuan' (aka 'Days of Being Wild') is the first set of the trilogy which is completed by 'Fa Yeung Nin Wa' (aka 'In the Mood For Love') and '2046', it 'looks' different from the other two films. Kar Wai uses less colour, more shadow, rain and heat and more rawness. The tone is much darker than in 'Fa Yeung Nin Wa' as the film is set in the 50s. The music is beautiful and effectively used. And, here too Kar Wai ends up making a powerful product. Though this film was a box office failure, it is an artistic victory. 'A Fei Zheng Chuan' tells the story of 6 individuals whose lives are interconnected by each character's search and struggle for an identity. It's about loneliness, unrequited love, lost love, the search for love, and how the search continues. Kar Wai clevely brings up the theme of sex (without showing any nudity). The writing is excellent and the characterization is strengthened by superb and unique performances. The late Leslie Cheung's Yuddy is not a very likable person but we do sympathize with this man and recognize him. Maggie Cheung as Su gives one of the most subtle and finest performances. Carina Lau is energetic and terrific as Mimi. Rebecca Pan gracefully downplays her part. Andy Lau's Tide and Jacky Cheung's Zeb too are relatable and the actors are nothing short of remarkable. Actually, I recognize all the characters in this film. I loved the cinematography, especially the long shots. One of my favorite shot is the introduction of the scene that glides from the Phillipine streets to Yuddy and Tide in a lunch bar. This is one fine example of skillful camera-work. The shaky camera (which thankfully isn't overdone) and the close-ups that mostly take place during conversations and intimate moments between two characters work very well. Doyle's camera-work simply guides us through the lives of these characters. Summing it up, 'A Fei Zheng Chuan' works on many levels. It is an excellent study of characters, it 'tells' a universal story in a poetic way and it is a fine cinematic experience. A bird that never lands will one day suddenly seize to exist.",
         "It's difficult to find words to describe feelings that appear after watching any WKW's film. Maybe they just don't exist. WKW make movies like others breath and see dreams. He makes me believe that cinema is not technology. He's the greatest director on this planet. No marks, no rewie. Everything will sound too banal. It's like to describe a melody, almost senseless. I like cinema, the entertaining spirit of cinema, i like Indiana Jones or Armaggedon, but WKW films give you something very unique and important. Just one more remark: it seems to me, sometimes the spirit of Nabokov's prose lives in WKW heroes' rooms.",
         "I like movies where outcast characters drift through the margins of life in search for not simply meaning, this is a grand word and drifters don't have much time for grandstanding, but a small warm corner they can call their own, and there's a lot of drifting in Days of Being Wild, literal and figurative. This is one of those great movies that speak of what it means to be young and alienated, not in the angsty living-room sense of the term, but in the form of real tangible problems, the ones you face alone in the cheap room of a fleabag hotel or in an empty warehouse in the hours after work. Days of Being Wild to me is like a procession of life, in the small hours of the night, filled with beauty and pain. Now when all the normal people with steady jobs and a steady family have gone to sleep, all those still hanging in the balance of existence come out and fly beneath the cold street lamps. Now and then their wings touch, for a fleeting moment, and then they're alone again, flying in circles around the street lamps, like a moth instinctively drawn to something that is bright and warm. This reminds me of the line spoken by Warren Oates in that quintessential American movie about alienation and drifting, Monte Hellman's Two-Lane Blacktop: \"if I'm not grounded soon, I'm gonna go into orbit\". Hollywood rarely understands this type of character. Only someone who has never experienced that directionless orbit can glorify the drifting. The characters here need to be grounded soon. They need human warmth and affection and to know that there's a place they can come back at night and call it home. We usually think of a drifter as someone who sets off into the desert, into a bleak barren landscape, it's probably easier that way. It takes a step back to look at life around us, as we wait for the subway in crowd, to realize a drifter can be a drifter among people. American film noir treats the city as an 'asphalt jungle', while for some reason Asians seem to tap into the melancholy of the 'asphalt desert'. I'm thinking films like Johnnie To's PTU and Takashi Miike's Rainy Dog. This is one of those films. One of the characters is a cop who does a latenight patrol, always wandering around empty streets by himself. He confesses a little later, that he wanted to be a sailor. The metaphor is poignant. But at the same time Wong-Kar Wai says a lot of things about compulsion, that driving monomania that sets these people into orbit, and disassociates them from the world. I like how all this plays out in a 50's Hong Kong of cold blue lights and wet streets reflecting neon lights from a distant shop sign. It's not Chungking Express yet, and I'm glad that it's not, Chungking is a vibrant colorful place, and this one is a world that begins a corner down the street from it, where the bustle of city life, where the other people live their lives, is but a faint echo. In fact, until the movie washes up in the Phillipines to get involved in a brawl and take the night train out of the world, we hardly see any people outside the six characters, the small birds whose wings touch now and then. This is raw and touching and real, like the best of gritnik cinema done by a romantic. Sam Peckinpah was another big romantic of gritnik cinema, but his romance was masculine and fatalist, he was speaking about the ends of things. Wong-Kar Wai tells us about love and obsession, and what it takes for something to begin. Good stuff.",
         "The only other film of Wong Kar-Wai's I have seen is Chungking Express, which asks a second viewing on account of not, like with a Godard film, being able to really soak up everything that he was putting forth with his characters. On the other hand, his second film I have seen, Days of Being Wild, kept me in tune from start to finish. His film is one of what I completely understand, and find emotionally fulfilling, as it deals with people and themes that are universal. At the core is the basic premise that in youth we don't know where we're going, we may feel like we're 'not all there', and being on our own scrambles us up. With his principals, Kar-Wai delivers a love story about what it means to be in love, or not, and how it affects the people around us. The late Leslie Cheung is our main protagonist, who at the start of the film woos a worker in a stadium, played by Maggie Cheung, and they start up a relationship that seems to go nowhere. Leslie Cheung's Yuddy is the usual kind of angry young man of the late 50's, early 60's, with violent tendencies and a level of detached mood from his counterparts. But he also has a sense of longing, for his parents he's never known (his 'aunt' is rather selfish) and perhaps for something he never says outright. There is also a supporting story involving, and soon co-coinciding with Yuddy's, with a cop wanting to be a sailor (Andy Lau as Tide), who has a sense of quiet longing after becoming interested in one of Yuddy's frustrated girlfriends (Carina Lau as Leung Fung-Ying). By the time the last half hour kicks in, the main focus of the story comes in, at least for our two main heroes, and for the women in the story. Cheung and Cheung give many of the more powerful scenes in the picture, with dramatic tension and the kind of fun youth posses. But also, Lau is rather remarkable in his supporting role even when we are basically following him around, himself in his own thoughts we only hear occasionally in voice-over (as with a couple of the other characters). More often than not, Kar-Wai wisely chooses to bring more mood to the story than actual plot contrivances or twists like in a common teen love story. While some passages are rather blunt in this respect (i.e. the quote about the bird with no legs, a fitting, stark image), they seem to work. That there is not much violence as could be expected from a title like this is also a pleasant surprise. Adding to all of this, there is Christopher Doyle behind a camera that moves much like is was guided by a next-generation Raul Coutard. Some shots are impressive just by being elaborate (like when we glide from the street up the stairs to a lunch-hall where Yuddy is at in the Philippines). Other are more subtle, with the emphasis of darkness and light a voracious method to bring out the kinds of moods in these characters. Early on in the film, as in midway as well, some of the close-ups (like with two lovers in an intimate moment) are of the highest quality in artistry. Doyle, who ended up working on Kar-Wai on most of his films, displays foremost a wandering, intuitive approach that bring Days of Being Wild somewhere special, if not perfect. Simply put, this film may be more directed to a specific kind of audience (art-house/Hong-Kong film buffs) than a mainstream romance/youth picture, but it doesn't compromise any of its integrity.",
         "It made me feel like becoming a stalker, following the characters around; or it's like secretly opening other people's mail and reading their letters. Although nothing happened, somehow I was thrilled. \"While you live, nothing happens. The scenery changes, people come in and go out, that's all. There are no beginnings. Days add on to days without rhyme or reason, an interminable and monotonous addition... But when you tell about a life, everything changes; ... events take place in one direction, and we tell about them in the opposite direction.... The story is going on backwards: moments have stopped piling themselves happy-go-luckily one on top of the other, they are caught up by the end of the story which draws them on and each one of them in turn the previous moment...\" -- Jean-Paul Satre \"Nausea\" If a normal film tells a story, this film makes you feel like living through it. Following the grand \"French New Wave\" tradition, it is as good as it gets.",
         "Sublime suspension. A very satisfying affair: here's the first project where Kar-Wai Wong found his groove with the Spanish notion of metastory, the story about how one hesitates in resolving what they see in life. And how that is a matter of touch. And how touch is word \u0097 and how one can touch and speak with the eye. The first project with Doyle. And with Maggie. In a way, the first version of \"Mood/2046.\" I think no one understands cinematically suspended longing like this man. When you enter this, you enter a space where everything is connected, every connection is passionately loaded and seen. But there is no logic, no comprehension, no future. Ever. Its anti-love but fulfilling nonetheless. Its empty in a rich way. Its about created selves in the French New Wave sense, but those selves then being honestly inhabited. If you love, really love, it has to rest on the earth in some way. There seem to be only a few ways to rest, the usual one being a matter of anchors and roots. This is different, a matter of frictionless liquidity \u0097 a local zone of antigravity where the love seems fixed by never really touches the planet. There are several metaphors in the story along these lines. We may not have the courage to love in this way even if we are among the few who chance love at all. But it is a rather sublime visit, this. Ted's Evaluation -- 3 of 3: Worth watching.",
         "So far, I've watched 4 Wong Kar Wai films, and they seem to suggest that if one constantly uses one's experience as an excuse to go down a path of self-destruction, that one person has no one to blame...but him/herself. The film starts with Yuddy (played by the late Leslie Cheung), the child of an aristocratic Filipino woman, who gives him to a wealthy alcoholic courtesan (played by Rebecca Pan), doing what he does best-making a woman fall for him, and dumping her when he finds he has no more feelings for her, or when she seeks commitment and security from him. His first target is the shy Su Lizhen, played by the eternally youthful Maggie Cheung, whom he tells her that she would see him in her dreams. My thoughts on that statement, what a bold thing to say! A classic example of Yuddy's arrogance! In the next meeting she tells him that she did not dream of him, he tells her that is because she did not sleep. Upon falling asleep, perhaps she did dream of him..and when he finds her again, her ears are flushed. He tells her to look at his watch which says that it's one minute before 3:00PM on April 16, 1960. Poor Lizhen! She would always remember that one minute, as it slowly increased to 2 minutes, an hour, half a day, and next, she's at his apartment. When she asked for some form of commitment, Yuddy promptly dumps her. Yuddy then moves on to Mimi, a cabaret girl (played by the ever voluptuous and passionate Carina Lau), and the love they share is passionate and aggressive. His best friend, Zeb, a quiet, yet loyal friend, is smitten by Mimi but she warns him against falling for her. Mimi is a passionate and possessive lover, but even she could not satisfy the ever drifting Yuddy, and is left to suffer the consequences of the break up. Meanwhile Yuddy blames his adoptive mother for his situation, and for not telling him who his real mother is. His cruelty does not surprise her, as she had long noticed that he had viewed her as a foe, and is unwilling to see her find her own happiness. In a bid to satisfy Yuddy, she tells him who his real mother is. Lizhen on the other hand, while going through the consequences of her break up befriends Tide (played by Any Lau), the gentle policeman. he tries to be a friend to her, and tells her that if she truly needed Yuddy, to go and tell him to his face. Tide unwittingly falls for Lizhen, and would wait at the phone booth in the district he does his rounds in for her call, but never got one. When his mother died, he became a sailor. The movie reveals itself like a poem, with each character trying to find his/her own identity, but perhaps never achieving it. Leslie Cheung the arrogant and self destructive drifter, Yuddy as though Yuddy is his second nature. Suave, handsome, but commitment-phobic, and never treating women with any respect. Jacky Cheung did well in his role as the shy Zeb who idolized Yuddy, no over acting this time unlike what he did in Bullet in the Head. Carina Lau played Mimi with ease, you could feel her passion, her possessiveness and her emotions, as though she was wearing all these qualities on her sleeve. Maggie Cheung and Andy Lau did well as the characters who were attracted to each other but the romance never materialized. When Lizhen finally had the courage to call Tide, it was too late as he had already left to become a sailor. As for Yuddy, perhaps he learnt that a bird which never lands can never exist, it is dead because it had chosen the path towards self-destruction. Yuddy had no one to blame but himself for his situation. The last scene with Tony Leung Chiu Wai dressing up was really cool, it made me wonder if that character developed to Chow Wo-Man. I wished WKW had released Part 2 of the film, it'd be nice to see how Wong explains TLCW's character.",
         "Watched it, loved it. A lot has been said about its merits in the previous postings. What really got stuck in my mind was the last scene. We see actor Tony Leung dress up and go out. And the notable thing, of course, is that this is the only scene Leung plays in the whole movie. What to make of this? We will see Leung in other Wong Kar-Wai's movies, most notably In the Mood for Love and 2046. Now, if you know all of these movies, the message is clear: The Days of Being Wild shows a man unable to settle down and love a woman and in the last scene, the next man prepares and walks out to enter the scene and have a go. Now, nine (In the mood for love) and thirteen (2046) years later we know this man will fail too. But the astonishing thing to note here is that Wong Kai-War had it all planned. Without this plan, the last scene in The Days of Being Wild hardly makes any sense and is very opaque. In the light of his whole filmography, it makes perfect sense but only under the recognition of how disturbingly consistent Wong Kai-War is."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["In-Gear Film"],
      "summaries": ["Set in 1960, the film centres on the young, boyishly handsome Yuddy, who learns from the drunken ex-prostitute who raised him that she is not his real mother. Hoping to hold onto him, she refuses to divulge the name of his real birth mother. The revelation shakes Yuddy to his very core, unleashing a cascade of conflicting emotions. Two women have the bad luck to fall for Yuddy. One is a quiet lass named Su Lizhen who works at a sports arena, while the other is a glitzy showgirl named Mimi. Perhaps due to his unresolved Oedipal issues, he passively lets the two compete for him, unable or unwilling to make a choice. As Lizhen slowly confides her frustration to a cop named Tide, he falls for her. The same is true for Yuddy's friend Zeb, who falls for Mimi. Later, Yuddy learns of his birth mother's whereabouts and heads out to the Philippines."],
      "budget": 0
   },
   "movielensId": 26713,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "普通话",
         ""
      ],
      "releaseDate": "1990-12-15",
      "dvdReleaseDate": "2004-10-19",
      "directors": ["Wong Kar-wai"],
      "runtime": 94,
      "movieId": 26713,
      "title": "Days of Being Wild",
      "mpaa": "NR",
      "actors": [
         "Andy Lau",
         "Leslie Cheung",
         "Maggie Cheung",
         "Jacky Cheung",
         "Tony Leung Chiu-Wai",
         "Carina Lau",
         "Rebecca Pan",
         "Maritoni Fernandez",
         "Alicia Alonzo",
         "Tita Muñoz"
      ],
      "imdbMovieId": "0101258",
      "originalTitle": "阿飛正傳",
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["-hEpehlI7Sk"],
      "plotSummary": "The movie is set in Hong Kong and the Philippines in 1960. Yuddy, or 'York' in English, is a playboy in Hong Kong and is well-known for stealing girls' hearts and breaking them. His first victim is Li Zhen who suffered emotional and mental depression as a result of Yuddy's wayward attitude. Li Zhen eventually seeks much-needed solace from a sympathetic policeman named Tide.",
      "tmdbMovieId": 18311,
      "avgRating": 3.75942,
      "releaseYear": "1990",
      "numRatings": 345,
      "posterPath": "/w08n5Ho4bwXS2ymwXNYmFAnSPX4.jpg"
   }
}