{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nanny",
            "id": 2341
         },
         {
            "name": "wrestler",
            "id": 11431
         }
      ],
      "imdb_id": "tt0107612",
      "video": false,
      "title": "Mr. Nanny",
      "recommendations": [
         11504,
         17414,
         41582,
         20762,
         41579,
         113674,
         83489,
         82315,
         21352,
         31388,
         28859,
         91445,
         41971,
         12574,
         41587,
         51321,
         47045,
         60631,
         26261,
         30709
      ],
      "backdrop_path": "/tfgCVQFGdTJJSZyuq5DSrcr5AJz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Sean Armstrong",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6bdb",
               "name": "Hulk Hogan",
               "profile_path": "/jDWQ3FLbbPSIHPgfOdmuUaWWnON.jpg",
               "id": 16620,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Thanatos",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6bdf",
               "name": "David Johansen",
               "profile_path": "/hQq0pmBBcmapA8YPxsgnDuZnEAa.jpg",
               "id": 57116,
               "order": 1
            },
            {
               "cast_id": 31,
               "character": "Kate Mason",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6be3",
               "name": "Madeline Zima",
               "profile_path": "/72MtWTKvM0bjjvFWpjXpUrAQlpt.jpg",
               "id": 84613,
               "order": 2
            },
            {
               "cast_id": 33,
               "character": "Alex Mason Jr.",
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6bed",
               "name": "Robert Hy Gorman",
               "profile_path": "/9HosMxVtAPUvB6hl5qlpLhJebB7.jpg",
               "id": 84598,
               "order": 3
            },
            {
               "cast_id": 34,
               "character": "Burt Wilson",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6bf1",
               "name": "Sherman Hemsley",
               "profile_path": "/5wEp7zaBCMa33NIVfolE3oFjwQs.jpg",
               "id": 83976,
               "order": 4
            },
            {
               "cast_id": 35,
               "character": "Wolfgang",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6bf5",
               "name": "Peter Kent",
               "profile_path": "/aQ33wRmbOvOkPId1yzUenWWRygu.jpg",
               "id": 37029,
               "order": 5
            },
            {
               "cast_id": 36,
               "character": "Alex Mason, Sr.",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6bf9",
               "name": "Austin Pendleton",
               "profile_path": "/pxcdhd4oAsnhvUg0BalmiiKJyXg.jpg",
               "id": 6168,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6be9",
               "name": "Michael Gottlieb",
               "profile_path": null,
               "id": 62043,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6bff",
               "name": "Edward Rugoff",
               "profile_path": null,
               "id": 62044,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c05",
               "name": "Michael Gottlieb",
               "profile_path": null,
               "id": 62043,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 3.551,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19371,
      "vote_count": 53,
      "budget": 0,
      "overview": "A former pro-wrestler is hired to be the bodyguard/nanny for a couple of bratty kids whose inventor father is being stalked by a rival.",
      "similar": [
         60979,
         99704,
         180943,
         12163,
         188800,
         58966,
         11307,
         788,
         2758,
         433,
         9053,
         1164,
         806,
         35019,
         1933,
         11283,
         321258,
         24122,
         1850,
         441182
      ],
      "original_title": "Mr. Nanny",
      "runtime": 84,
      "poster_path": "/4DIncU4WILy2RYYWsolsIbLlH27.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1993-10-08",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "He's big, he's bad, and he's babysitting. He doesn't stand a chance.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Gottlieb"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Edward Rugoff",
         "Michael Gottlieb"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107612/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzNjg3NTA1Ml5BMl5BanBnXkFtZTcwMTg2MDMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Hulk Hogan, Sherman Hemsley, Afa Anoai | See full cast and crew »"],
      "reviews": [
         "Hulk Hogan isn't an Oscar winner by any means, but he can act. His soft side is evident when he has to kiss the doll and sing corny songs. Hogan wasn't given much to work with here, so he had to take his money and run. Sherman Helmsley will drive you up a wall in this film, as will the spoiled rich kids. David Johanson (Buster Poindexter) makes an appearance as a weirdo trying to steal a chip worth millions from Austin Pendleton, the childrens father. A step down from No Holds Barred and Suburban Commando, but still watchable. **/****",
         "MR. NANNY, in my opinion, is a very hilarious Hulk Hogan film. One of the best things about it is when he suffers all that torture. It's hard for me to say which part of the torture was the most hilarious. When Sean (Michael Keaton) met the kids, things really did get hilarious. Even though I thought that the kids (Robert Hy Gorman and Madeline Zima) were absolute brats at first, I still enjoyed their performances. Before I wrap this up, I must say that the performances were top grade and the cast was perfectly chosen. Now, in conclusion, if you are a fan of Hulk Hogan, you're in for a good time and lots of laughs, so see this movie today.",
         "Ok so yeah Hogan isn't a great actor, but I've seen worse, and this movie is pretty entertaining if you know what to expect from a Hogan movie, ie bad acting but they're always pretty fun movies. In this one Hogan becomes the nanny to a few rich kids since he has to work to protect a computer genius and his two kids have run all their other nanny's off but they can't run Hogan off, all wrestling fans should see this and Brutus the barber is in it too and Sherman Helmsley is funny in it I give this movie a 6 it's fun that's it not great just fun and simple",
         "Number 47 on the bottom 100 list? It only got about 3.0/10! It deserves at least 5.9/10!! This was a good, clever family film with plenty of laugh out loud scenes. Hulk Hogan is good with younger kids. It's funny to see the way they get along with eachother. Good, Clean Family Fun! 7/10 stars",
         "I caught this movie on HBO early morning one day, so I decided to give it a look. My opinion of the movie has definitely faltered since I watched it back in grade school, but at the same time it maintained my interest for the entire hour and a half. To be fair, a goofy comedy like this is aimed primarily towards children. That is not \"totally\" an excuse, but you can't view this movie in the same way you'd view \"Citizen Kane.\" Hulk Hogan is no great actor. He can't even bump his head on a kitchen cabinet convincingly. But as mediocre as his talent is, he is somewhat fun to watch. It wouldn't be as funny to see an actor half his size in a ballerina outfit. But Hulkster doesn't give the worst performance. The film's weakest link is the disgustingly over-the-top performance by Buster Poindexter's David Johansen. It's no mystery why he's box office poison (i.e.: \"Car 54, Where Are You,\" \"Freejack\"). Sherman Helmsley is completely over-the-top as well, but at least he provides some funny moments. Most of the jokes are lame and predictable, but if you're looking for mindless family fun, you can do a lot worse than \"Mr. Nanny.\" But I enjoyed \"Suburban Commando\" a lot more. At least in that movie, the Hulkster had a talented actor like Christopher Lloyd to feed off.",
         "One hell of a funny movie! This movie is so funny, and Hulk Hogan is a crack up. I love that scene where Burt tells the story of how he saved Sean, the music in that scene is so kool and it's funny. One of the funniest family movies out there. If you want laughs, watch this. 5/5",
         "I was expecting a complete bomb with this. I was pleasantly suprised. It actually didn't totally stink! Though, seeing Hulk Hogan in a Tutu is just... just... ***SHUDDER*** Tights, ok. Leotards? AAAAAARRRRRGGGHHHHHHHHHH! That's enough to scare the strongest stomachs.",
         "Ever since I was a kid, I've loved this movie! Hulk Hogan is awesome and hilarious as Sean Armstrong, who is an ex-wrestler who is soon hired by Alex Mason, Sr to protect his kids. Mr. Mason is developing a new anti-missile system and a man by the name of Tommy Thanatos is after the microchip that has the information. Mason's kids; Alex and Kate make Sean's job harder because they want to get rid of him by setting up 'Home Alone' style traps so Sean will leave. Sean doesn't back down and the kids slowly begin to like him. After the Mason family is kidnapped, Sean does whatever it takes to get them back. I highly recommend MR. NANNY!!!",
         "I was a kid when I watched this one, and even then I knew it was a \"just OK\" type of movie. Still, it had me laughing. Not long, and not hard, but I laughed all the same. My grandfather was passably amused as well--I think he got a kick out of watching me watching the movie. I rate this a 4 out of 10. Watch it with a ten year old on a rainy day; the kid will laugh, you'll smile at their laughter, and you'll kill some time until something good comes on TV. Oh, and this reminds me--the Hulk can act outside of the ring! Well, sort of. I'd never want to see him in a serious role, but he pulled off this comedy bit well enough. I just think he should stick to wrestling. Or retirement. Or whatever.",
         "Mr. Nanny is a piece of s---. I'm starting to wonder why Hulk Hogan agreed to do this movie. Let's take a look and see what's wrong with this movie. First of all, the acting is awful. This is evidence that Hulk Hogan can't act and wrestle at the same time. Second, the characters are unlikeable. This includes the kids, who I swear would grow up to be America's Most Wanted. They take their punishments as if they liked it. If I was their father, I would've smack those kids silly. Hold the phone! Is Hulk Hogan wearing a tutu? Arrrgh! Who wrote the movie, a two-year-old?! Mr. Nanny is so bad, it makes the Pacifier look like a James Bond movie. Bottom line: This movie is full of unlikeable characters, terrible acting, generic music, and kids so creepy that they make the characters of Sonny With a Chance look like the Pound Puppies."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Entertainment Film"
      ],
      "summaries": [
         "A friend persuades the former wrestling star Sean to do a job as bodyguard for the two kids of top manager Frank Mason - someone is threatening him to get the plans for a secret micro chip. But when Sean arrives at his house it turns out that he'll not only have to bodyguard the spoiled brats, but also be their nanny, since they again scared away their former one. From then on he's occupied more protecting himself from the kids than them from the villain.",
         "A former professional wrestler is hired to be the bodyguard/nanny for a couple of bratty kids whose inventor father is being stalked by a rival."
      ],
      "budget": 0
   },
   "movielensId": 26828,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-10-08",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Michael Gottlieb"],
      "runtime": 84,
      "movieId": 26828,
      "title": "Mr. Nanny",
      "mpaa": "PG",
      "actors": [
         "Hulk Hogan",
         "David Johansen",
         "Madeline Zima",
         "Robert Hy Gorman",
         "Sherman Hemsley",
         "Peter Kent",
         "Austin Pendleton"
      ],
      "imdbMovieId": "0107612",
      "originalTitle": "Mr. Nanny",
      "genres": [
         "Family",
         "Comedy",
         "Action"
      ],
      "youtubeTrailerIds": ["6L7CTLheaNc"],
      "plotSummary": "A former pro-wrestler is hired to be the bodyguard/nanny for a couple of bratty kids whose inventor father is being stalked by a rival.",
      "tmdbMovieId": 19371,
      "avgRating": 1.79297,
      "releaseYear": "1993",
      "numRatings": 128,
      "posterPath": "/4DIncU4WILy2RYYWsolsIbLlH27.jpg"
   }
}