{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "pub",
            "id": 5319
         },
         {
            "name": "apparition",
            "id": 10164
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "irish",
            "id": 11018
         },
         {
            "name": "public sex",
            "id": 11512
         },
         {
            "name": "rock music",
            "id": 11700
         },
         {
            "name": "train",
            "id": 13008
         },
         {
            "name": "adult lives at home",
            "id": 15113
         },
         {
            "name": "nasty neighbor",
            "id": 15114
         }
      ],
      "imdb_id": "tt0108170",
      "video": false,
      "title": "The Snapper",
      "recommendations": [
         10889,
         41944,
         172535,
         42459,
         26850,
         12519,
         84658,
         46021,
         60041,
         6945,
         64382,
         4988,
         41963,
         38294,
         27093,
         26964,
         15494,
         223042,
         27655,
         42087
      ],
      "backdrop_path": "/zBxwxV2Kqc750uMa84JRqNrLVJU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dessie Curley",
               "gender": 2,
               "credit_id": "52fe45119251416c7504aaed",
               "name": "Colm Meaney",
               "profile_path": "/irPAowqDk7llCvm8uyCJuBClzJw.jpg",
               "id": 17782,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sharon Curley",
               "gender": 1,
               "credit_id": "52fe45119251416c7504aaf1",
               "name": "Tina Kellegher",
               "profile_path": null,
               "id": 74018,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kay Curley",
               "gender": 1,
               "credit_id": "52fe45119251416c7504aaf5",
               "name": "Ruth McCabe",
               "profile_path": "/yiA0GlVcMQ30hmgkfEaCCBMTGtM.jpg",
               "id": 17026,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Craig Curley",
               "gender": 0,
               "credit_id": "52fe45119251416c7504aaf9",
               "name": "Eanna MacLiam",
               "profile_path": null,
               "id": 63367,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sonny Curley",
               "gender": 0,
               "credit_id": "52fe45119251416c7504aafd",
               "name": "Peter Rowen",
               "profile_path": null,
               "id": 74019,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lester",
               "gender": 2,
               "credit_id": "52fe45119251416c7504ab01",
               "name": "Brendan Gleeson",
               "profile_path": "/pUTBk2sqFgg4aFBXHckD0qKLUYP.jpg",
               "id": 2039,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Pal 1",
               "gender": 2,
               "credit_id": "52fe45119251416c7504ab2f",
               "name": "Tom Murphy",
               "profile_path": null,
               "id": 87907,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45119251416c7504ab07",
               "name": "Stephen Frears",
               "profile_path": "/8IewTBLTPujw1t1MwpXba8cCXOU.jpg",
               "id": 3224,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45119251416c7504ab0d",
               "name": "Roddy Doyle",
               "profile_path": null,
               "id": 70144,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe45119251416c7504ab13",
               "name": "Lynda Myles",
               "profile_path": null,
               "id": 50872,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45119251416c7504ab19",
               "name": "Mark Shivas",
               "profile_path": null,
               "id": 55982,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45119251416c7504ab1f",
               "name": "Oliver Stapleton",
               "profile_path": "/wfzgRB2LbfKvKJ50NZYebi9nv1c.jpg",
               "id": 16425,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45119251416c7504ab25",
               "name": "Mick Audsley",
               "profile_path": null,
               "id": 294,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45119251416c7504ab2b",
               "name": "Roddy Doyle",
               "profile_path": null,
               "id": 70144,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.503123,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 12664,
      "vote_count": 27,
      "budget": 0,
      "overview": "Set in Ireland, Sharon Curley is a 20 year old living with her parents and many brothers and sisters. When she gets herself pregnant and refuses to name the father, she becomes the talk of the town.",
      "similar": [
         10054,
         5781,
         298312,
         8967,
         2288,
         4347,
         425,
         858,
         101,
         111,
         334,
         112160,
         141,
         392044,
         110415,
         452507,
         244772,
         281957,
         277216,
         11012
      ],
      "original_title": "The Snapper",
      "runtime": 91,
      "poster_path": "/bDU0wKUkyzC29qQ6Nf0J6W9qnlX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         }
      ],
      "release_date": "1993-08-06",
      "vote_average": 6.3,
      "belongs_to_collection": {
         "backdrop_path": "/9oFt5bWxS0oRVHGFJG5rrbb4lWl.jpg",
         "name": "Barrytown Trilogy",
         "id": 207952,
         "poster_path": "/cccGPuXNUJyrM3P8SEltSlXEwxY.jpg"
      },
      "tagline": "She's got a little secret and a lot of explaining to do.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stephen Frears"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Roddy Doyle",
         "Roddy Doyle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108170/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA3ODE4NDI0Ml5BMl5BanBnXkFtZTcwMjk2OTcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Colm Meaney, Tina Kellegher, Ruth McCabe | See full cast and crew »"],
      "reviews": [
         "This film is 'deadly'. Colm Meaney was made for the role of the lower class 'Barrytown' Da. Its full of witty dialogue and mad characters. The Commitments comes nowhere near this little gem. Its not surprising that some of the American reviewers were not impressed and called it a depressing film as appposed to a comedy, they probably couldn't understand what was being said or the sheer sarcasm of the characters lines. The fact is that Sharon Curly doesn't really deserve much sympathy, so its also comical how things go so bad on her. Everybody around the world should see this film to garner an opinion.",
         "\"Sequel\" to The Commitments in that it follows some of the same characters (as does The Van that follows it), The Snapper is just the cure you might need for Angela's Ashes -- a portrayal of an Irish family that is kooky enough to be interesting, not drowning in abject poverty, and deeply caring for one another. The Curleys are a tad eccentric -- younger brother obsessed with bicycling, a younger sister who paints her face with shaving foam and costumes herself to pretend she is a marching band leader, middle sibs pushing the envelope at every chance -- and eldest sister Sharon, suddenly pregnant and refusing to disclose the name of the father. (pardon the pun.) Ballykissangel fans will recognise this actress as Niahm, the Garda's wife. Colm Meaney gives a beautiful performance as Desi Curley, the dad by turn bewildered and outraged then growing in his acceptance and excitement in the impending appearance of Sharon's baby -- the eponymous little \"snapper\". Brendan Gleeson also appears as one of Desi's pub chums, with a deft portrayal of a shy and lonely man. One of my favorite aspects of this film is its un-Hollywood-ness -- everyone looks real. There is no slick, too-pretty feel to this movie. The dialogue is quick, thick with dialect (so listen closely, get the sounds in your ear, or you might miss some fun exchanges!) and funny enough to be real and real enough to be moving. If there is a message to this story (and I think there is!) it might be, \"If we love each other, it really will all be ok.\" I find it to be a touching and uplifting movie.",
         "This is up there the all time great Irish comedy films. From beginning to end this is a riot of a film. It portrays the life of Sharon Curley played by Tina Kellegher. She becomes pregnant after a night on the booze and realises eventually, that the father is the local U-12 soccer coach, who just happens to be older than her father. The gossips soon get the news around and Sharon becomes the joke of the neighbourhood. This really shows the ups and downs of single motherhood in early nineties Dublin. Colm Meaney is brilliant as Dessie Curley with some memorable quotes and one liners. Also look out for Brendan Gleeson as Lester. Well worth a look.",
         "Roddy's gone and done it again--The film is exquisite. You will laugh 'till a lung bursts. Don't take you eyes or ears off the screen, every second counts! Roddy Doyle can present Irish family life at its best and most painful and The Snapper will leave you gasping for more. Colm Meaney is as always amazing but pay attention to Ruth McCabe and Tina Kellegher, quick dry wit from the former and outlandish comments from the latter. Very very clever!",
         "This film is a delightful romp about a large, boisterous Dublin family which gets turned upside down when the eldest daughter unexpectedly becomes pregnant. Strong-willed Sharon Curley (Tina Gellegher) refuses to discuss who got her \"up the pole,\" but is equally adamant about not wanting to get an abortion. She keeps her head held high as friends needle her, neighbors whisper, and younger brothers and sisters ask wide-eyed questions. Colm Meaney gives a standout performance as Sharon's dad, expertly revealing a gamut of emotions, from rage to sorrow to curiosity about the birth process to exhilaration at the prospect of becoming a granddad. Ruth McCabe plays the soft- spoken but strong-as-an-ox Irish mom to perfection. While it gets a tad slow towards the end, this film is a great rental if you want a light-hearted yet heart-warming celebration of family-- in all its gory and splendor.",
         "Sweet, touching but also bawdy tale of a working-class Irish family's reaction to their unmarried daughter's pregnancy. The father character is especially interesting. He takes great pride in his family, with all its imperfections. He tenderly cares for his daughter through her ordeal and holds his head high despite the neighbors' petty gossip. A real \"family values\" film depicting people of modest means trying to stick together.",
         "\"The Snapper\", apparently Irish slang for \"baby\", is all about a young Irish woman (Kellegher) who gets pregnant while living with her working class family of eight. Refusing to name the father, the town buzzes with gossip while the family takes the matter in stride with the exception of Sharon's father (Meaney) who wrestles with the matter all the way to the end. Too Irish and too wry to have broad commercial appeal, \"The Snapper\" is doubtless another excellent helping in the Doyle/Frears trilogy including \"The Van\" and \"The Commitments\". If you like one of the three, check out the other two. If you haven't seen any of them, be prepared for a whole lot of \"bollocks\", \"eejit\", and \"s***e\". (B) Note - The film ends with the newborn nursing at his mother's breast while the grandfather downs a pint in a pub, smiling and belching with satisfaction. If you can see the earthy charm of that juxtaposition, then, perhaps, this film is for you.",
         "Because one needn't think TWICE to figure out this is not just a movie. It's 90 minutes of pure Irish humor, and good publicity for Dublin. If you like Colm Meaney, settle down and watch 'The Snapper'. But this is such a good movie you can go on inventing reasons to see it. The Snapper deserves respect and cheers for it's one-liners, the sweet Irish accent and the location. Dublin rulesssssss! Roddy Doyle's books must be hilarious, I don't know but the movies sure are FANTASTIC!!! Give it 9/10!",
         "The Snapper is directed by Stephen Frears and adapted to screenplay by Roddy Doyle from his own novel of the same name. It stars Colm Meaney, Tina Kellegher, Ruth McCabe, Fionnula Murphy and Brendan Gleeson. The Snapper is the middle part of what became known as Roddy Doyle's Barrytown Trilogy (The Commitments and The Van either side of it). The Snapper of the title is a baby expected by young Sharon Curley (Kellegher) when she unexpectedly falls pregnant during a drunken liaison. Refusing to name who the father is, the strain on the large Curley family reaches breaking point, especially when the neighbourhood and so called friends begin to point and judge with malice. Can the Curley family pull through? It's going to need some humour and no end of Irish family grit to do so. Affectionate realism draped in comedy, The Snapper in Frears' hands unfolds as an original take on the stress caused to a family by an unplanned pregnancy. Initially the film's structure feels bumpy, the blending of family drama with uproariously scripted comedy, but once you settle into it you realise that this is exactly how the Curley family are feeling, how they cope. As we get deeper into the picture, and there is much human depth here, peripheral characters come alive and the relationship between Sharon and her father Des (Meaney) really holds the attention whilst simultaneously tickling the requisite emotional threads. Impeccably performed (Meaney, Kellegher and McCabe are terrific) and with a great script brought vividly to life by Frears, The Snapper is very much a recommended bowl of comedy drama Irish Stew. 8/10",
         "Fine acting by Colm Meaney (Dessie Curley) and Tina Kellegher (Sharon Curley) carry this offbeat tragi-comedy about the perils of out of wedlock pregnancy in a working class Irish family. I think the Pope would approve of how this subject was handled, if he approved of the subject being handled in the first place. What do I mean? Well, here's an unwanted pregnancy that in the apprehension of some people could arguably be seen as a result of something about as close to a rape as it gets without technically being rape, depending upon how you define your \"technically.\" (She was drunk and an older man took advantage of her in the parking lot of the pub.) I won't say more for fear of spoiling the plot for you, but be forewarned that some viewers will find the whole thing uncomfortable. Roddy Doyle, the gifted fictionalist (Paddy Clarke, Ha, Ha, Ha, The Woman Who Walked into Doors, etc) wrote the novel and the screenplay. Stephen Frears (My Beautiful Laundrette 1985, Dangerous Liaisons 1988, etc.) directed. Doyle is a master of dialogue and has a warm sense of people that he imposes on his readers. Known as a realistic writer, he is actually a sentimentalist with a keen feel for the foibles of his characters. There is a kind of TV sit-com feeling to Frears's direction in that nothing really depressing occurs. There's a neighborhood feel to the taunting, some windows are broken, and there's a fistfight, but none of the kids are on heroin or planting bombs. There's little violence and the sex depicted is minimalist. There's a sense that nothing is really wrong in the world, just some slips of behavior and some misunderstandings. You realize, for example, that despite Sharon's continued drinking the baby is not going to be born suffering from any kind of alcoholic syndrome. Furthermore, although Dessie has six kids to support, we never see him working overtime or worrying about money. Doyle is also a political writer and has a message. His message here is that the gift of life is precious over and above how it is conceived and that narrow-minded men (grandfather-to-be Dessie Curley) can, through love, understanding and a little effort, rise above their prejudices and do the right thing and feel the right way. Politically speaking, the film walks softly and carries no banner between the two sides of the abortion question, clearly identifying with the pro-lifers without overtly offending the pro-choice side. Perhaps it is best to leave the politics behind and, like many viewers, simply enjoy the laughs, the realistic dialogue and the warm, chaotic family atmosphere presented and save the moralizing for another day. By the way, you might have to watch this twice to catch some of the humor. Either that or have a good ear for the Irish brogue. For myself, I could have used subtitles. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["British Broadcasting Corporation (BBC)"],
      "summaries": ["Set in Ireland, Sharon Curley is a 20 year old living with her parents and many brothers and sisters. When she gets herself pregnant and refuses to name the father, she becomes the talk of the town."],
      "budget": 0
   },
   "movielensId": 26838,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-08-06",
      "dvdReleaseDate": "2005-04-05",
      "directors": ["Stephen Frears"],
      "runtime": 91,
      "movieId": 26838,
      "title": "The Snapper",
      "mpaa": "R",
      "actors": [
         "Colm Meaney",
         "Tina Kellegher",
         "Ruth McCabe",
         "Eanna MacLiam",
         "Peter Rowen",
         "Brendan Gleeson",
         "Tom Murphy"
      ],
      "imdbMovieId": "0108170",
      "originalTitle": "The Snapper",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["Yo-noHGCgJQ"],
      "plotSummary": "Set in Ireland, Sharon Curley is a 20 year old living with her parents and many brothers and sisters. When she gets herself pregnant and refuses to name the father, she becomes the talk of the town.",
      "tmdbMovieId": 12664,
      "avgRating": 3.63229,
      "releaseYear": "1993",
      "numRatings": 223,
      "posterPath": "/bP2DWMqwXrLeOL3F0alBPIhiWk2.jpg"
   }
}