{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "donut",
            "id": 2441
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0112527",
      "video": false,
      "title": "Blood & Donuts",
      "recommendations": [
         128598,
         69607,
         40460,
         55170,
         36155,
         137904,
         90338,
         26678,
         128643,
         52326,
         24716,
         18932,
         40238,
         103433,
         34223,
         85496,
         48421
      ],
      "backdrop_path": "/beNd2qkX3GdsS8F7eZyV3SSnrib.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Boya",
               "gender": 2,
               "credit_id": "52fe4929c3a36847f818c42b",
               "name": "Gordon Currie",
               "profile_path": "/h06Vpwv0XHCogV4xULwNBVXN6dI.jpg",
               "id": 51539,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Earl",
               "gender": 0,
               "credit_id": "52fe4929c3a36847f818c42f",
               "name": "Louis Ferreira",
               "profile_path": "/mqJglT0g3tRMg5cNeJ7C6vdP4E.jpg",
               "id": 51036,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe4929c3a36847f818c433",
               "name": "Fiona Reid",
               "profile_path": null,
               "id": 54652,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Crime Boss",
               "gender": 2,
               "credit_id": "52fe4929c3a36847f818c437",
               "name": "David Cronenberg",
               "profile_path": "/nFHIlkIuile5RmtSqbyCB4w8SpH.jpg",
               "id": 224,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Pierce",
               "gender": 2,
               "credit_id": "52fe4929c3a36847f818c43b",
               "name": "Frank Moore",
               "profile_path": "/aDonlIASBuom6Y6DPLqAxVFvtpq.jpg",
               "id": 103870,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Axel",
               "gender": 0,
               "credit_id": "52fe4929c3a36847f818c43f",
               "name": "Hadley Kay",
               "profile_path": null,
               "id": 85367,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Bernie",
               "gender": 0,
               "credit_id": "52fe4929c3a36847f818c443",
               "name": "J. Winston Carroll",
               "profile_path": null,
               "id": 1145894,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe4929c3a36847f818c447",
               "name": "Helene Clarkson",
               "profile_path": null,
               "id": 975531,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4929c3a36847f818c421",
               "name": "Holly Dale",
               "profile_path": "/7MtKPEWzYcJQtEuOtcZfht4STib.jpg",
               "id": 163198,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4929c3a36847f818c427",
               "name": "Andrew Rai Berzins",
               "profile_path": null,
               "id": 43527,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.743344,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 57221,
      "vote_count": 18,
      "budget": 0,
      "overview": "In 1994, in Toronto, the vampire Boya awakens from his twenty-five years of sleep in a basement hit by a golf ball. He takes a cab to the local cemetery, retrieves his belongings from a grave and lodges in a low budget hotel nearby an all-night donut shop. Boya does not drink human blood anymore but rats and pigeons blood instead. While in the donut shop, Boya befriends and protects the taxi driver Earl, who is having trouble with two criminals, and falls in love for the waitress Molly. Meanwhile, his former passion of 1969, Rita, who misses her lost youth, is trying to locate him.",
      "similar": [
         49017,
         7131,
         6404,
         36647,
         6114,
         1547,
         858,
         628,
         634,
         76492,
         112160,
         346672,
         437557,
         242224,
         258480,
         252171,
         43923,
         24100,
         8966,
         141
      ],
      "original_title": "Blood & Donuts",
      "runtime": 90,
      "poster_path": "/fptdameNlReLAB55g0y4bIRcjEB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Feature Film Project",
            "id": 21953,
            "origin_country": ""
         },
         {
            "logo_path": "/kcNh09qqR2Pkw1JAzRW4CommrW4.png",
            "name": "Téléfilm Canada",
            "id": 806,
            "origin_country": "CA"
         },
         {
            "logo_path": null,
            "name": "Ontario Film Development Corporation",
            "id": 22210,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-09",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "There is a place between the living and the dead... and it's open 24 hours",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Holly Dale"],
      "runtime": 89,
      "synopsis": "Boya Zsekely [Gordon Currie] is a vampire. He can live forever...if he chooses. Sometimes he chooses to sleep for awhile. Last time he went to bed was in 1969, when Neil Armstrong destroyed the romanticism of the moon by walking on it. Boya stuffed his personal effects into a suitcase, buried it in a cemetery, then wrapped himself up in a burlap bag and went to sleep in the ceiling of an abandoned building in Toronto. Twenty-five years later, an errant golf ball wakes him up. Molly [Helene Clarkson] works the night shift at Bernie's 24-hour donutshop. Their philosophy is \"Any jerk deserves a well-made donut and a safe place to eat it.\" Anyone, that is, except for Earl [Justin Louis], whose problems are like bacteria. Breathe on them, and they multiply. Yet, when two neighborhood thugs, Pierce [Frank Moore] and Axel [Hadley Kay], come into Bernie's looking for Earl, Molly takes out her baseball bat, and Bernie sends them packing. Earl's not there anyway. He's out riding taxi. He just dropped off Boya Zsekely at the cemetery, commenting that the guy looked more like a customer than a visitor. [Okay, so ask yourself how you'd feel/look waking up from a 25-year sleep.] Lugging his suitcase, Boya rents a room at the Insmore Hotel, finds a rat for dinner, and then goes down the street to Bernie's to ask where he can get some fresh liver. Molly directs him to an all-night grocery store, but he buys a kiwi donut instead and sits down in a booth. In the meantime, Pierce and Axel have found Earl and pressed him into doing a little service for them. They're going to collect 'rent', and they need someone to drive them there and back. When Earl hears a gunshot, however, he hightails it out of there. While Earl sits at a red light, rehearsing his excuse for driving off, a middle-aged lady hops in the back seat and asks to be taken to the cemetery. Must be the tourist season. Rita [ Fiona Reid] goes to the spot where Boya had buried his suitcase, sees that it's been dug up, and knows that Boya's back. Earl returns to the donutshop to have a cruller (\"They're not ready yet\")...ok, a glazed...when Pierce and Axel come in. They take Earl outside and start beating him up. Just as they're squeezing lemon juice into Earl's wounds, Boya joins them. He tosses Axel against a fence, then scratches his neck and licks off the blood. Pierce and Axel leave, and Earl and Boya go back inside the donutshop. After Earl tells Boya about all his problems, Boya offers to let him bed down in his room. After all, Boya doesn't need a lot of room...he sleeps in the closet. Boya and Molly have been eyeing each other all night. When Molly is scared by a rat, Boya stalks it [in a crawl that's every bit as creepy as Dracula crawling like a lizard headfirst down the wall of the castle], drinks its blood, and tosses it in the garbage, leaving just a hint of blood on his lower lip. \"I worked as an exterminator once,\" he explains to Molly. When Molly's shift is over, Boya walks her home, then he goes home and takes a bath while she sleeps fitfully in a scene that is probably the most erotic as I've seen in years, and the two of them aren't even in the same house! The next night, Boya goes back to the donutshop. While sitting at the counter, he looks up Rita's address in the phone book. Molly notices and asks if it's an old flame. It is, but it's a flame that burned 25 years ago. \"Just reminiscing,\" Boya explains. \"Each time you turn your back, a few more gone. Makes you want to withdraw.\" Molly understands, but \"You can't go through life afraid to connect because the thing might end, right?\" Boya replies simply, \"Not 'might'.\" Pierce and Axel, under orders from the crime boss to teach Boya a thing or two, come into the shop with a baseball bat, intending to rough him up. When Axel swings the bat, Boya grabs it and breaks it in two. Then Boya's face suddenly metamorphs into a monster with red eyes and long teeth. It does the trick, and the boys go running. \"I worked in the circus once,\" he explains to Molly. After Molly's shift ends, Boya walks her home again. This time he kisses her, just as Rita is passing by in a taxi. She confronts Boya in a jealous girlfriend scene from which Glenn Close could take a few lessons. Rita is now in her fifties. Her skin is starting to sag, and she's no longer the beauty she was when she and Boya were together. She's spent the last 25 years stewing over what might have been hers if Boya hadn't disappeared and begs him to take her now. He refuses, so she runs a stake through his chest from behind. He pulls it out, says, \"Don't believe everything you hear,\" and goes home to take a bath. Earl, as brainless as he comes across, has figured out that Boya is a vampire. When he sees Boya in the bathtub with a hole through his chest, he offers to take him to the hospital, but Boya says that he heals fast. When Earl asks why Boya hasn't drunk from him, Boya explains that blood-drinking from humans is, for him, like donut-eating for humans. \"You don't have to submit.\" Although Earl and Boya have become friends and seem to really care about each other, Earl figures that it's best to move out. Rita drops by and finds Boya sleeping in the closet (\"You're really not a day person, are you?\"), and begs him again to give her the gift. If he had done it 25 years ago, she could have kept her beauty and had all the time in the world. Boya still refuses, so she pulls out a gun and puts it to her head. Boya stops her from killing herself, but the bullet does graze her temple. Boya has to get out of there even though it's daytime. He races across the street to the donutshop as his body starts to steam in the sunlight. By the time he reaches the door, he is crawling on the ground and his skin is charring. He manages to reach up, open the door, and crawl inside. Molly rushes to help him. Molly has figured it out, too. She cuts her own palm and lets him feed from her. He feeds and feeds until Molly has to pull herself away. \"I thought I could control it,\" Boya moans and then passes out. Molly sits beside Boya while he sleeps on the donutshop floor until sundown, when he wakes up and walks out wordlessly. Meanwhile, Pierce, Axel, and the crime boss have captured Earl and are about to cut out his tongue. Somehow, Boya can sense this. He leaps onto the fire escape and enters the room through an open window. As Boya drains the crime boss of his blood, Earl backs out the window onto the fire escape and falls off, landing on his back on the pavement below. Hurt badly, Earl crawls into his taxi as the thugs take shots at him. Boya tumbles through an open window into the taxi and helps Earl drive away. But Earl is in a bad way. Boya stops the car and helps Earl onto the ground. \"I'm not afraid to die,\" Earl says, and dies. Just then, Molly drives up in Bernie's car. Not knowing how Earl died or how long ago, she rigs up a makeshift cardiac defibrillator out of a screwdriver and jumper cables. After being zapped several times, Earl begins to breathe again. Boya carries Earl to her car and, since the sun is rising, Molly tells Boya to get into the trunk. As the trunk closes, Molly drives off. Only after she gets back to the donutshop and opens the trunk does she find that Boya did not get in. At that very moment, as the sun is rising, Boya is lying on top of Earl's taxi, allowing himself to die. [Original Synopsis by bj_kuehl.]",
      "writers": ["Andrew Rai Berzins"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112527/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMDI2Mjg1Nl5BMl5BanBnXkFtZTcwNTg4MzAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gordon Currie, Louis Ferreira, Helene Clarkson | See full cast and crew »"],
      "reviews": [
         "It's not every day you see something original and clever done with the vampire genre, but this does it and then some. This is a unique, low-key, low-gore, charming little movie. Gordon Currie is very likable (and *real* easy on the eyes!) as Boya, the vampire who went into hibernation in 1969 and crawls out to face a grimy world of small-time mobsters, cheap donuts and a bitter ex-girlfriend who's waited 25 years for his return. Determined not to prey on people, Boya runs through dozens of rats and pigeons while forming shy friendships with a nervous cabbie and a smart, ironic donut waitress. The character has such fundamental sweetness and sincerity that he's impossible not to like, reticent and embarrassed about his vampirism but quickly bringing his undead powers to bear when his new friends need help, and quietly mourning the short lifespans of humankind (a theme often blared loudly in vampire films but gentle and subtle here). Much more about people, friendship and self-sacrifice than your average vampire film, and a nice change.",
         "Don't let the lurid cover fool you; this isn't a stupid direct-to-video release with bad dialogue & gratuitous gore. Instead, it's a thoughtful and rather bittersweet movie about a reluctant vampire and his attempts to maintain human contact in the face of insurmountable obstacles. Returning from a self-imposed exile, Boya lives a marginal existence, eating rats in a flophouse,and mourning human friends gone by. Yet,he is drawn to light and life in the form of a neighborhood donut shop and it's fresh-faced counter girl. He also befriends a good-hearted cabbie who dreams of better things and owes money to the wrong kind of people. (And look for David Cronenberg in a juicy cameo role.) This film is a breath of fresh air in the recent spate of vampire movies which appear to be nothing but an excuse to snarl insults and spray fake blood. Well-acted, well-written, well-directed....go and rent it. You'll be glad you did.",
         "Don't care much if you like it, already saw one post that ripped it. But the bottom line is I can't get this movie out of my head. Great music score, great story line. I undertand it's a B movie, but that's okay! I was just plain entertained. First time I watched it was midnight on the Sci-Fi channel. Kept my finger on the power off button on the remote for the first 20 minutes, but couldn't bring myself to kill the movie. I was sucked in for this zaney ride into Boya's life and times. What a ride! I really cared about him, I felt his pain, I liked the guy. Someone I could be friends with. Buy the movie...watch the movie...be the movie.",
         "After 25 years of slumber, a vampire is awakened by a golf ball crashing through his window and hitting him. What to do? Hang out at the local donut shop and fall in love... So the film has vampires, mobsters, a cab driver trying to sound like Christopher Walken. People have been saying it's a horror film! NO! It's a comedy! No! Therein lies the problem people have with this film. They can't place it. So look a little more into this film and you'll see that it's basically a character study, and a rather touching one after it's been viewed. If one can put aside the supernatural element and mob storyline, it's about a few people trying to find their reason for living and how those are affected as they cross paths with each other. The element of the vampire's selfless act of self-sacrifice is both heartbreaking and immensely touching at the same time. All the other elements are there to make the story weird and of course entertaining. All in all it turns out to be quite a charming story when you understand the characters. Blood & Donuts is a unique find and one of my personal favorites. I've never seen anything quite like it!",
         "I thought I'd never say this about a vampire movie, but I sure did love this! This indie effort is a hair shy of being a masterpiece. OK...I'm still trying to figure out why I am saying this...but still movie really dug into me and pulled my heart out. (Figuratively, of course.) How many vampires can you say you would REALLY want to have as a friend? Boya is that vampire. He's all heart and soul. And that's a lot coming from a vampire. BLOOD AND DONUTS has got to be the most inventive vampire movie I've ever seen. The fabric of the plot, interwoven with the quirky characters that populate this movie, coupled with great effects and careful direction has to now rank in my list of favorite movies. Kudos to the director, Holly Dale, the writer, Andrew Rai Berzins and a really interesting and talented cast: Gordon Currie as BOYA the vampire, Justin Louis as EARL the cab driver/friend Helene Clarkson as MOLLY the donut shop girl... and let's not forget David Cronenburg as STEPHEN the \"gangster\"! IF YOU THINK you've seen enough vampire movies, then you need to see this one! You'll be surprised. The ending was very well done and satisfying for me. If you didn't get it, write to me...I'll be glad to explain what I think happened at the end and why.",
         "In 1994, in Toronto, the vampire Boya (Gordon Currie) awakens from his twenty-five years of sleep in a basement hit by a golf ball. He takes a cab to the local cemetery, retrieves his belongings from a grave and lodges in a low budget hotel nearby an all-night donut shop. Boya does not drink human blood anymore but rats and pigeons blood instead. While in the donut shop, Boya befriends and protects the taxi driver Earl (Justin Louis), who is having trouble with two criminals, and falls in love for the waitress Molly (Helene Clarkson). Meanwhile, his former passion of 1969, Rita (Fiona Reid), who misses her lost youth, is trying to locate him. \"Blood & Donuts\" is a weird vampire movie, but also with a great potential of cult-movie. The unusual story is completely different from most of the films of vampire; actually it is a tale of loneliness, friendship, love and self-sacrifice. Goya is probably more human than any other character in spite of being a vampire. This is a typical very low budget movie that works, supported by magnificent story, screenplay, direction, performances, cinematography, special effects and music score. Actually the cinematography is top-notch and the music score is fantastic. I noted in IMDb that the excellent and unknown Helene Clarkson apparently interrupted her career in 1996. I regret only the terrible spelling mistakes in the subtitles in Portuguese of the Brazilian DVD released by Lider Distributor. Last but not the least, wait until the very last scene in the end of the credits. My vote is eight. Title (Brazil): \"Sangue de Vampiro\" (\"Vampire's Blood\")",
         "There's a place between the living and the dead... and it is open 24 hours. First and foremost, let us state the obvious: the taxi driver talks like a \"constipated Christopher Walken\", in the words of my girlfriend. And that is unfortunately annoying, but not annoying enough to distract from an otherwise good film. The lead actor is pretty good and rivals Johnny Depp's performance in \"Edward Scissorhands\". These films share the same sensibility in many respects, but go off is quite different directions. Even David Cronenberg showcases his acting, which is just as remarkable as his directing (he is also excellent in \"Nightbreed\"). His bowling shoes analogy could have sounded asinine from someone else's lips, but Cronenberg makes it sound profound. I loved the parallel with heroin addiction, which was particularly topical for a mid-1990s film, as the grunge was literally dying from the drug. I do not know if this was intentional, but i certainly felt like there was some inspiration there. While it is hard to call any vampire film \"fresh\", this one has some aspects that make the old genre seem new. The worst thing about this movie? The title. What has kept me away from this movie for almost twenty years is that terrible name, which gives the impression of an even lower budget film than it is. In fact, it is not a bad movie at all and at least as good as the average 1990s horror film. More people should really give it a chance.",
         "This is a great vampire movie you can sink your teeth into. It is nice to see some fun taken with the genre for a change!!!! Boya is sexy and fun, And the direction rocks.",
         "Blood & Donuts is a unique, creative film that adds much needed \"new blood\" to the tired vampire genre. Gordon Currie is remarkable as Boya, a shy and sensitive \"humanist\" vampire who comes out of hiding after hibernating for 25 years since the moon landing. Boya is rather unkempt and freaky, but has a winning kind of innocence and a wild mane of Jim Morrison hair. He goes to a late night donut shop to re-familiarize himself with humans and comes to the defense of a slow-witted but endearing young cabbie who is being threatened by murderous mobsters. Meanwhile, an old flame who has aged for the past 25 years stalks the still young looking Boya, demanding that he give her the \"gift\" of eternal life. Viewers can't help getting caught up because the characters are so well acted and well-written. There is a good deal of humor along the way, although in the final analysis it's a sad and touching story. This film is astonishingly entertaining, innovative and effective despite its low budget. Far more so than other bigger budgeted films like \"Tale of a Vampire\" and \"The Wisdom of Crocodiles\" Thanks to Currie's and Louis' wonderful characterizations, audiences will not soon forget the charming, winsome Boya and his new-found human buddy Earl.",
         "The best vampire movie since Lost Boys.. but with very little blood and lots of donuts! The vampire is hot.. the story is both funny and touching.. and the performances are all AMAZING!! I don't' understand why it wasn't a bigger hit.. and I certainly don't understand why it's not available on DVD. The love story between the vampire and the older lady is exceptinally poignant.. Just because it's Canadian doesn't mean it isn't good. PS.. why do comments have to be a minimum of 10 lines.. that' just stupid. I love the movie.. but I don't want to write a dissertation about it!"
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": [
         "Feature Film Project, The",
         "Téléfilm Canada",
         "Ontario Film Development Corporation, The"
      ],
      "summaries": [
         "In 1994, in Toronto, the vampire Boya awakens from his twenty-five years of sleep in a basement hit by a golf ball. He takes a cab to the local cemetery, retrieves his belongings from a grave and lodges in a low budget hotel nearby an all-night donut shop. Boya does not drink human blood anymore but rats and pigeons blood instead. While in the donut shop, Boya befriends and protects the taxi driver Earl, who is having trouble with two criminals, and falls in love for the waitress Molly. Meanwhile, his former passion of 1969, Rita, who misses her lost youth, is trying to locate him.",
         "Boya, a vampire who went to sleep in 1969, is awakened in modern day Toronto by a stray golf ball. He becomes involved in the lives of a hapless cabby, an all-night donut shop clerk, a few local criminals, and his ex-lover from the 60's.",
         "A vampire named Boya is awakened from his sleep by a golf ball. He has not been awake since 1969, and marvels at his new surroundings. He does not feed on humans but instead on rats and animals. He meets up with a cab driver who is in trouble with some criminals, and a female donut shop worker who gets stuck in the middle. Befriending them both, they take on each others problems as he tries to protect them and at the same time endangers them by bringing them to the attention of an ex lover from years past, who has been seeking him since they parted. Now they must all form a bond of survival, instinct, passion, blood, and donuts.",
         "A vampire falls for a woman working at a donut shop."
      ],
      "budget": 350000
   },
   "movielensId": 26889,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-09",
      "dvdReleaseDate": null,
      "directors": ["Holly Dale"],
      "runtime": 90,
      "movieId": 26889,
      "title": "Blood & Donuts",
      "mpaa": null,
      "actors": [
         "Gordon Currie",
         "Louis Ferreira",
         "Fiona Reid",
         "David Cronenberg",
         "Frank Moore",
         "Hadley Kay",
         "J. Winston Carroll",
         "Helene Clarkson"
      ],
      "imdbMovieId": "0112527",
      "originalTitle": "Blood & Donuts",
      "genres": [
         "Horror",
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1994, in Toronto, the vampire Boya awakens from his twenty-five years of sleep in a basement hit by a golf ball. He takes a cab to the local cemetery, retrieves his belongings from a grave and lodges in a low budget hotel nearby an all-night donut shop. Boya does not drink human blood anymore but rats and pigeons blood instead. While in the donut shop, Boya befriends and protects the taxi driver Earl, who is having trouble with two criminals, and falls in love for the waitress Molly. Meanwhile, his former passion of 1969, Rita, who misses her lost youth, is trying to locate him.",
      "tmdbMovieId": 57221,
      "avgRating": 2.9,
      "releaseYear": "1995",
      "numRatings": 5,
      "posterPath": "/fptdameNlReLAB55g0y4bIRcjEB.jpg"
   }
}