{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "ocean",
            "id": 270
         },
         {
            "name": "ship",
            "id": 3799
         },
         {
            "name": "pianistin",
            "id": 5164
         },
         {
            "name": "child prodigy",
            "id": 5561
         },
         {
            "name": "fondling",
            "id": 6930
         }
      ],
      "imdb_id": "tt0120731",
      "video": false,
      "title": "The Legend of 1900",
      "recommendations": [
         11216,
         152742,
         10867,
         25846,
         1429,
         12776,
         38251,
         25300,
         38286,
         11010,
         27670,
         5156,
         179144,
         2639,
         37975,
         19223,
         364433,
         43645,
         24188,
         696
      ],
      "backdrop_path": "/g95aipBRguk1lFwpAU7FJ4Z9cws.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Danny Boodmann T.D. Lemon Nineteen Hundred '1900'",
               "gender": 2,
               "credit_id": "52fe43629251416c7500e4dd",
               "name": "Tim Roth",
               "profile_path": "/hgaIXIW9GKnZhrweplBonG7uhhP.jpg",
               "id": 3129,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Max Tooney",
               "gender": 2,
               "credit_id": "52fe43629251416c7500e4e1",
               "name": "Pruitt Taylor Vince",
               "profile_path": "/p3xmcGJ7IKCxw42lwQbg4WmwPTA.jpg",
               "id": 3201,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "das Mädchen",
               "gender": 1,
               "credit_id": "52fe43629251416c7500e4e5",
               "name": "Mélanie Thierry",
               "profile_path": "/vWP1P4oAPfxntP8xaDbGXguf08J.jpg",
               "id": 59373,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Danny Boodmann",
               "gender": 2,
               "credit_id": "52fe43629251416c7500e4e9",
               "name": "Bill Nunn",
               "profile_path": "/dcZWC2iGjHasKwdYSwpHcWFQX5a.jpg",
               "id": 5502,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Farmer",
               "gender": 2,
               "credit_id": "52fe43629251416c7500e4ff",
               "name": "Gabriele Lavia",
               "profile_path": "/pe0OwFx8gokfPZVMxu9tSJk2OKD.jpg",
               "id": 80503,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jelly Roll Morton",
               "gender": 2,
               "credit_id": "54b19a5cc3a3684012002303",
               "name": "Clarence Williams III",
               "profile_path": "/hDjTPLvUNDnoA6rHDX5JrftAWZa.jpg",
               "id": 15864,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "The Girl",
               "gender": 1,
               "credit_id": "54b19a6dc3a3680939002c2e",
               "name": "Mélanie Thierry",
               "profile_path": "/vWP1P4oAPfxntP8xaDbGXguf08J.jpg",
               "id": 59373,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "'Pops', the Shopkeeper",
               "gender": 2,
               "credit_id": "54b19a7fc3a3680945002bac",
               "name": "Peter Vaughan",
               "profile_path": "/z9ZplbTA1ojYhgZ8kJUKKhsJ7Gs.jpg",
               "id": 386,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Harbor Master",
               "gender": 0,
               "credit_id": "54b19a8e92514107e00012d0",
               "name": "Niall O'Brien",
               "profile_path": "/6qdAoraMGiIOSnhiXtQNfQUHkF2.jpg",
               "id": 104758,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mexican Stoker",
               "gender": 2,
               "credit_id": "54b19aa092514107e00012d2",
               "name": "Alberto Vazquez",
               "profile_path": null,
               "id": 163808,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Neapolitan Stoker",
               "gender": 0,
               "credit_id": "54b19ab1c3a3684138002214",
               "name": "Luca De Luigi",
               "profile_path": null,
               "id": 558801,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Black Stoker",
               "gender": 0,
               "credit_id": "54b19acac3a3680939002c33",
               "name": "Femi Elufowoju Jr.",
               "profile_path": null,
               "id": 1411985,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Chinese Stoker",
               "gender": 0,
               "credit_id": "54b19addc3a368413800221b",
               "name": "Nigel Fan",
               "profile_path": null,
               "id": 1411986,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Irish Stoker",
               "gender": 0,
               "credit_id": "54b19aeec3a3680940002948",
               "name": "Roger Monk",
               "profile_path": null,
               "id": 126316,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Polish Stoker",
               "gender": 0,
               "credit_id": "54b19afe92514107e00012df",
               "name": "Leonid Zaslavski",
               "profile_path": null,
               "id": 1411987,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Boatswain",
               "gender": 0,
               "credit_id": "54b19b0e925141746c002696",
               "name": "Bernard Padden",
               "profile_path": "/u1wnvwnPeQqwUIhMCuaedxrYQbT.jpg",
               "id": 1356009,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43629251416c7500e4ef",
               "name": "Giuseppe Tornatore",
               "profile_path": "/3cmRKkbmiOuuvAO76s3BTjCLqEb.jpg",
               "id": 65314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43629251416c7500e4f5",
               "name": "Alessandro Baricco",
               "profile_path": "/zSBaNWmhGjGFwKf5PViKQYqRRnY.jpg",
               "id": 65315,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43629251416c7500e4fb",
               "name": "Giuseppe Tornatore",
               "profile_path": "/3cmRKkbmiOuuvAO76s3BTjCLqEb.jpg",
               "id": 65314,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56220ade92514171d400aa4c",
               "name": "Ennio Morricone",
               "profile_path": "/tlntfyflyEHgJTFjqIgg8P8UIx9.jpg",
               "id": 1259,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Fantasy",
         "id": 14
      }],
      "popularity": 8.04833,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 10376,
      "vote_count": 752,
      "budget": 9000000,
      "overview": "The story of a virtuoso piano player who lives his entire life aboard an ocean liner. Born and raised on the ship, 1900 (Tim Roth) learned about the outside world through interactions with passengers, never setting foot on land, even for the love of his life. Years later, the ship may be destroyed, and a former band member fears that 1900 may still be aboard, willing to go down with the ship.",
      "similar": [
         228165,
         2756,
         205775,
         1865,
         166426,
         26466,
         1427,
         10140,
         58,
         810,
         10191,
         10830,
         76285,
         407451,
         11836,
         173,
         10144,
         829,
         597,
         3131
      ],
      "original_title": "La leggenda del pianista sull'oceano",
      "runtime": 170,
      "poster_path": "/wss1PkvHD2cYH6lu5mSa2MgGoi.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Medusa Film",
            "id": 6246,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sciarlò",
            "id": 27597,
            "origin_country": ""
         }
      ],
      "release_date": "1998-10-28",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "A beatiful story of a man who could do anything... except be ordinary.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Giuseppe Tornatore"],
      "runtime": 165,
      "synopsis": null,
      "writers": [
         "Alessandro Baricco",
         "Giuseppe Tornatore"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120731/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA3MTcxNjE0NzNeQTJeQWpwZ15BbWU4MDc3NjUxNDAx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tim Roth, Pruitt Taylor Vince, Bill Nunn | See full cast and crew »"],
      "reviews": [
         "It is at a time like this I wish I could expand my vocabulary to better articulate the virtues and qualities of such a fine film. I also find I'm bursting to talk about this film that I regrettably saw alone. I don't want to spoil it for anyone, but desperately want to share it with everyone. The talented star of \"The Legend of 1900\", Tim Roth, presented this film along with Clarence Williams III. His encouragement to the audience was that if anyone was the sort who liked to pick apart at films and critique their lack of realism, they should just leave now. He touted this wonderful vision from the director of Cinema Paradiso, Giuseppe Tornatore, and likened the film to a \"dream\". He also said that if anyone had seen his own film, \"The War Zone\", that \"1900\" was the antidote for it. I was slated to see \"The War Zone\" the next day, but that was fine by me. I managed by a sheer stroke of luck to get into this Canadian premiere and found it to be absolutely extraordinary and the best film I'd seen so far of the Toronto International Film Festival. It seems as though mere moments after the initial credits, that the wonderful storytelling and incredible music combined with stunning visuals almost had me moved to tears. While I'll admit that I'd be seeing films all day, no film in my recollection had such an impact so quickly. The story is one of an abandoned baby who is found on a ocean liner by one of the ship's crew. He is unofficially adopted and named \"1900\" for the year in which he was born. At a very early age the boy demonstrates an extraordinary gift for piano playing which is only strengthened in his passing years. The boy grows up with no official identity, into a man having never taken a step off of the ship onto dry land in his whole life. The young man, played by Tim Roth is encouraged by his dear friend to leave the boat and pursue a life of fame and fortune as the great pianist he has become. 1900 declines, explaining simply that everything he needs is on the boat. Well, that should be enough to intrigue you; there's much more of course, but I've no desire to spoil it for anyone. I must encourage everyone to see this film, I can hardly imagine anyone being disappointed. It's for music lovers, dreamers, romantics and film buffs everywhere and my greatest hope is that it will be seen by many, many people, especially those I know and love. And after seeing the film, and hearing Tim Roth's words echoing in my mind, he was absolutely right. It is like a dream, a wonderful dream that I wished would never end. And for a future prediction, I see this film as a Best Foreign Film Oscar nomination for 1999.",
         "As its pianist, this film could be bound for success, but the fact is, it remained relatively obscure. I can't understand why did a movie with this deepness and feeling end up in oblivion. Because, if there are some beautiful movies, this is one of them, from the moment that fantastic Ennio Morricone score begins until we witness the tear-jerking finale. An epic story from tip to toe, we journey through the original story of a man who becomes a pianist on board the boat where he was born. And as he grows, so does the fascination by the others in his art and the questions whether he should take that leap overboard and become a \"normal\" person. A brilliant movie, from the man who brought us \"Cinema Paradiso\" and made us all cry, this won't disappoint you, and it's worth by Morricone's score alone. The sequence where the piano floats freely through the dance hall is anthological. A legend of its own.",
         "This movie was given to me as a Christmas gift in 2004. My friends know my love of ships and movies, so they knew this would be something I was surely to like. And did I. I would have been deeply disappointed if I had seen this at the local CinePlex, because there are so many excellent scene's you will want to rewind an ponder over, even shed a tear or two. Its the story of a baby boy ( Tim Roth )who is found aboard an ocean liner( by actor Bill Nunn ), who spends his entire life aboard this ship. Its a movie that is wonderfully acted by all the cast. It moves with ease an always keeps you in a slight fog that lifts at the perfect moment. The piano score's are exquisite !!!I found it haunting and moving at the same time. This movie is 2 hours long, but it will glide by so quickly you will want for more. Without spoiling it, the ending scene is powerful, its..............well......I'll let you be the judge. Enjoy, Marco",
         "After seeing this movie I went straight to my video store to buy their copy. Unfortunately, they had only the one copy and wouldn't sell it to me. This movie affected me deeply. It tells the story of a musical prodigy who is born, lives his entire life, and dies on board a cruise liner. The scene where the pianist, named 1900, and his friend \"ride\" the grand piano around the ballroom as the ship rolls brought me to tears. There is a palpable joy in this scene : captivated by the music, they care not where the piano takes them. And take them it does, through the glass wall of the ballroom and down a corridor where they are confronted by ship's the Captain. He does not admonish the pair, just accepts the situation. When 1900 is challenged by jazz great Jelly Roll Morton to a piano duel, he meets the challenge and annihilates Morton with a performance that left me shaking. I replayed that scene over and over. As a pianist myself, I was entranced, thrilled and amazed by the playing. When 1900 delivers the coup de grace, I literally cheered! You must see this film. It is a very special experience.",
         "\"The Legend of 1900\" is not the most attractive title for a film and the Italian original, \"The Legend of the Oceanic Pianist\", is no better. in retrospect there is no title worthy of this film. The marquee should read simply \"See This Film, Your Life Will Be Better for It.\" The story, music, cinematography, direction and, I hazard to say, a near perfect performance by Tim Roth combine to make for a compelling film. The story is told with a poetic lyricism that is immediately captivating and that is more than enhanced by Lajos Koltai's well stated cinematography. Clarance Williams III's controlled overstatement as an unexpectedly nasty Jelly Roll Morton is the perfect contrast to Roth's underplayed and unworldly 1900. The American release of the film is 125 minutes. The Italian release was 160 minutes. What are we missing. Maybe this shorter cut is better but I cannot forget the devastation that was wrought on \"Once Upon A Time In America\" for its 139 minute US theatrical release. I certainly would not be not adverse to being subjected to an additional 35 minutes of the film and judging for myself if it was too long. Aside from its title the films only flaw is the exit song. After two hours of enthralling instrumentals the vocal on the exit song undercuts rather than underscores a masterful filmic experience. ...rmk",
         "This a \"sleeper,\" a very good film few people have heard about. The ones who have reviewed it here obviously know about it and you can see by their comments how well-liked it is.....so if you haven't seen it, check it out. In North America, it's called \"The Legend Of 1900.\" The movie is definitely unique, about a man who spends his entire life on board an ocean liner and is a fantastic piano player. The best thing about this film, to me at least, was not the story- which I did enjoy - but the cinematography. Wow, what a great-looking film. Speaking of looks, Melanie Thierry is gorgeous. Too bad she has only a small part in this movie. It was nice to see Tim Roth play something other than a detestable villain and Clarence Williams was fun as the arrogant \"Jelly Roll Morton,\" who comes aboard ship to challenge Roth to a piano duel, which has to be seen to be believed. Can you say \"outrageous?\" This was filmed by the same man who did the much more well-known Italian film, Cinema Paradiso, and if you appreciate how good-looking that film is, well, this is even better!",
         "On the first day of the twentieth century, an infant is discovered in the coal room aboard a luxury liner. The worker (Bill Nunn) who discovers the child on The Virginian names him 1900 or more accurately Danny Boodmann T.D. Lemon Nineteen-Hundred. Eight years later the boy loses his \"father\" in a ship accident but discovers an amazing ability to play the piano and a legend is born. It is indeed The Legend of 1900, a fable by Giuseppe Tornatore (Cinema Paradiso) based on a dramatic monologue by Italian novelist Alessandro Baricco. The story is about a musical prodigy who spends his life aboard a ship, sailing back and forth between the U.S. and Europe, entertaining the passengers with his unique talent but never sharing it with the rest of the world. The film is narrated by Max (Pruitt Taylor Vince), an American saxophone player whom we meet at the beginning as he tries to pawn his trumpet. On leaving the shop, however, he hears the only recording 1900 ever made, a master that he had broken into pieces but that was later restored. When he finds out that the master came from a ship about to be demolished, he rushes to save 1900 whom he is sure is still aboard. In the process, he tells his story to convince others that 1900 exists. Through flashbacks we learn about 1900 and how he navigated his life from stem to stern. The question throughout the film is whether or not 1900 will abandon the ship and set foot on land? There is a hint that he might do so after he meets a beautiful young woman (Melanie Theirry). She inspires him to compose a beautifully expressive love song while gazing at her through a window, but the only thing that remains is the last copy of the record and an enduring memory. The Legend of 1900 creates its own world and I confess it is one that I got lost in. This is a lovely film that has a heart. It is sentimental without question but is redeemed by the glorious music by Ennio Morricone, beautiful cinematography by Lajos Koltai, and a terrific jazz piano duel between the adult 1900 (Tim Roth) and Jelly Roll Morton played by Clarence Williams III. 1900's world has clearly defined limits and he is fearful of venturing beyond. Land represents for him a place without boundaries, where people can get lost, a place without beginning or end. To me, The Legend of 1900 may be a metaphor for people who find a comfortable niche for themselves in life and are afraid to take risks to see what the possibilities are. In many cases, as with 1900, the world will never know the contribution they might have made.",
         "\"The Legend of 1900\" wistfully tells its creative, capriciously unpredictable, and musical tall tale with excellence in all aspects of film from sets to sound, costume to casting, and script to screenplay. Roth and Vince work well together in this plaintive, simple story which will captivate those who can make the leap of faith required to \"buy in\". A good film for all but critics, \"Legend\" will likely resonate most with those who equate living with musical expression. La vita è musica.",
         "What an excellent movie! I usually am partial to stupid comedies like Zoolander and other \"non-greats\" like like Daredevil and League of Extraordinary Gentlemen, but even I loved this movie! It's a must-see for everyone. My sister wanted to me watch this with her because she had to for a school assignment, and since I know a lot about things she doesn't (i.e., cinematography, costumes, makeup, etc.) she wanted to know my opinion. And, although those other subtle effects were excellent, I couldn't help but notice that this movie, too, was one of the best. I was angry that I had never even heard of it before, let alone not have been nominated for \"Best Picture\" in the 1999 Academy Awards!",
         "Not a classic, but whoa, some of that piano playing just sweeps you right off your feet. Tim Roth is good as the handsome pianist Nineteenhundred and so is all the the rest of the cast. This cast also includes Clarence Williams III, presumably the grandson of Clarence Williams (the man who wrote the song \"Basin Street Blues\" one hell of a classic), as Jelly Roll Morton. This leads me on to one of the most impressive parts of the film where Nineteenhundred and Morton have a match to see who is the best pianist. There is some piano playing in this scene which will leave pianists with there mouths hanging open. Probably the best thing about this film is it's music. There are many rousing themes played throughout the film, especially the love theme played while Nineteenhundred kisses a girl he has fallen in love with, a simple yet very effective theme. Another thing that makes this film very good is the fantastic camera-shots, especially one of Nineteenhundred as he stands halfway across the plank which leads him from the boat to New York, undecided whether or not he should leave the boat and head for world-wide celebrity on land, or stay on the boat and remain unknown to anyone but the passengers. I have got to get myself the soundtrack to this film and you have got to see it somehow. Enjoy!"
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Sciarlò",
         "Medusa Film"
      ],
      "summaries": [
         "Shortly after the Second World War, Max, a transplanted American, visits an English pawn shop to sell his trumpet. The shopkeeper recognizes the tune Max plays as one on a wax master of an unreleased recording, discovered and restored from shards found in a piano salvaged from a cruise ship turned hospital ship, now slated for demolition. This chance discovery prompts a story from Max, which he relates both to the shopkeeper and later to the official responsible for the doomed vessel, for Max is a born storyteller. Though now down on his luck and disillusioned by his wartime experiences, the New Orleans-born Max was once an enthusiastic and gifted young jazz musician, whose longest gig was several years with the house band aboard the Virginian, a posh cruise ship. While gaining his sea legs, he was befriended by another young man, the pianist in the same band, whose long unlikely name was Danny Boodman T.D. Lemons 1900, though everyone just called him 1900, the year of his birth. Abandoned in first class by his immigrant parents, 1900 was found and adopted by Danny, a stoker, and raised in the engine rooms, learning to read by reading horseracing reports to his adoptive dad. After Danny's death in an accident, 1900 remained on the ship. Increasingly lured by the sound of the piano in the first-class ballroom, he eventually became a gifted pianist, a great jazz improvisationist, a composer of rich modern music inspired by his intense observation of the life around him, the stories passengers on all levels of the ship trusted him enough to tell. He also grew up to be a charming, iconoclastic young man, at once shrewd and oddly innocent. His talent earned him such accolades that he was challenged by, and bested Jelly Roll Morton in an intense piano duel that had poor Max chewing paper on the sofa in agonies of suspense. And yet for all the richness and variety of his musical expression, he never left the ship, except almost, once, in the aftermath of his infatuation with a beautiful young woman immigrant who inspired the music committed to the master Max discovers in the pawnshop. Max realizes that 1900 must still be on the ship, and determines to find him, and to find out once and for all why he has so consistently refused to leave.",
         "A baby boy, discovered in 1900 on an ocean liner, grows into a musical prodigy, never setting foot on land."
      ],
      "budget": 9000000
   },
   "movielensId": 2691,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1998-10-28",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Giuseppe Tornatore"],
      "runtime": 170,
      "movieId": 2691,
      "title": "The Legend of 1900",
      "mpaa": "R",
      "actors": [
         "Tim Roth",
         "Pruitt Taylor Vince",
         "Mélanie Thierry",
         "Bill Nunn",
         "Gabriele Lavia",
         "Clarence Williams III",
         "Mélanie Thierry",
         "Peter Vaughan",
         "Niall O'Brien",
         "Alberto Vazquez",
         "Luca De Luigi",
         "Femi Elufowoju Jr.",
         "Nigel Fan",
         "Roger Monk",
         "Leonid Zaslavski",
         "Bernard Padden"
      ],
      "imdbMovieId": "0120731",
      "originalTitle": "La leggenda del pianista sull'oceano",
      "genres": ["Fantasy"],
      "youtubeTrailerIds": ["2uf-LDlZMFE"],
      "plotSummary": "The story of a virtuoso piano player who lives his entire life aboard an ocean liner. Born and raised on the ship, 1900 (Tim Roth) learned about the outside world through interactions with passengers, never setting foot on land, even for the love of his life. Years later, the ship may be destroyed, and a former band member fears that 1900 may still be aboard, willing to go down with the ship.",
      "tmdbMovieId": 10376,
      "avgRating": 3.72934,
      "releaseYear": "1998",
      "numRatings": 859,
      "posterPath": "/wss1PkvHD2cYH6lu5mSa2MgGoi.jpg"
   }
}