{
   "tmdb": {
      "original_language": "da",
      "keywords": [
         {
            "name": "copenhagen",
            "id": 792
         },
         {
            "name": "drug dealer",
            "id": 2231
         },
         {
            "name": "police operation",
            "id": 4668
         },
         {
            "name": "drugs",
            "id": 14964
         }
      ],
      "imdb_id": "tt0117407",
      "video": false,
      "title": "Pusher",
      "recommendations": [
         11328,
         11330,
         17985,
         37861,
         37696,
         12143,
         18533,
         11368,
         2742,
         11782,
         8052,
         9696,
         9519,
         6498,
         45284,
         11942,
         11524,
         4816,
         16608,
         10388
      ],
      "backdrop_path": "/e7GB81SMqqL5RiiYK3MtBYZbOoR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 18,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80415a3",
               "name": "Kim Bodnia",
               "profile_path": "/koWU6vb82cuCDLeYE1erqnQ39cW.jpg",
               "id": 3398,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Tonny",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f804158b",
               "name": "Mads Mikkelsen",
               "profile_path": "/hJTB5odoUVrVmLJdkuAMNBRvyvw.jpg",
               "id": 1019,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Vic",
               "gender": 0,
               "credit_id": "52fe4331c3a36847f8041583",
               "name": "Laura Drasbæk",
               "profile_path": "/4IfDuzjWXpjSyeJiM68PQMhS7f4.jpg",
               "id": 21192,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Milo",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80415a7",
               "name": "Zlatko Burić",
               "profile_path": "/eMqFfRzrtHuQVq8jDQE1R6C5SMJ.jpg",
               "id": 31960,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Radovan",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f8041587",
               "name": "Slavko Labović",
               "profile_path": "/zUiBgsZQTaSJnNISjMIIfkkohwP.jpg",
               "id": 3411,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Hasse",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f804158f",
               "name": "Peter Andersson",
               "profile_path": "/lWbWHUMAeEmTuNyXBMSzqzCbFOc.jpg",
               "id": 21193,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Branco",
               "gender": 0,
               "credit_id": "52fe4331c3a36847f8041593",
               "name": "Vanja Bajicic",
               "profile_path": null,
               "id": 21194,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe4331c3a36847f8041597",
               "name": "Lisbeth Rasmussen",
               "profile_path": null,
               "id": 21195,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mike",
               "gender": 0,
               "credit_id": "52fe4331c3a36847f804159b",
               "name": "Levino Jensen",
               "profile_path": null,
               "id": 21196,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Brian",
               "gender": 2,
               "credit_id": "52fe4331c3a36847f804159f",
               "name": "Nicolas Winding Refn",
               "profile_path": "/Ap0ySsAQfkmBmiBQdH44CqJAQE.jpg",
               "id": 21183,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Junkie",
               "gender": 2,
               "credit_id": "53dbdb050e0a264822000436",
               "name": "Thomas Bo Larsen",
               "profile_path": "/qmxFA16OXlC5yDvHSV6tEipuAlC.jpg",
               "id": 4457,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Uro'er",
               "gender": 0,
               "credit_id": "53dbdb1d0e0a26481f000438",
               "name": "Lars Bom",
               "profile_path": "/zz9m955WAo1rQ0zQ3FZ2rhkf6Ur.jpg",
               "id": 98062,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Uro'er",
               "gender": 0,
               "credit_id": "53dbdb3a0e0a26481f00043e",
               "name": "Michael Hasselflug",
               "profile_path": null,
               "id": 1348454,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Mikkel",
               "gender": 0,
               "credit_id": "53dbdb510e0a26481900047e",
               "name": "Jesper Lohmann",
               "profile_path": "/5Hbf19fAHCE5nevx3UEsgh6v90N.jpg",
               "id": 297106,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Lasse",
               "gender": 0,
               "credit_id": "53dbdb6e0e0a264819000485",
               "name": "Steen Fridberg",
               "profile_path": null,
               "id": 1348455,
               "order": 14
            },
            {
               "cast_id": 28,
               "character": "Anders",
               "gender": 0,
               "credit_id": "53dbdb850e0a26481f00044d",
               "name": "Gordon Kennedy",
               "profile_path": "/l9ChoY2Qctx3ot9i66ohe8Afpvw.jpg",
               "id": 112317,
               "order": 15
            },
            {
               "cast_id": 31,
               "character": "",
               "gender": 0,
               "credit_id": "551049b3c3a368488600cf49",
               "name": "Gyda Hansen ",
               "profile_path": null,
               "id": 578957,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4331c3a36847f8041567",
               "name": "Nicolas Winding Refn",
               "profile_path": "/Ap0ySsAQfkmBmiBQdH44CqJAQE.jpg",
               "id": 21183,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f804156d",
               "name": "Jens Dahl",
               "profile_path": null,
               "id": 21184,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4331c3a36847f8041573",
               "name": "Nicolas Winding Refn",
               "profile_path": "/Ap0ySsAQfkmBmiBQdH44CqJAQE.jpg",
               "id": 21183,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f8041579",
               "name": "Henrik Danstrup",
               "profile_path": null,
               "id": 21185,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f804157f",
               "name": "Povl Kristian",
               "profile_path": null,
               "id": 21186,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4331c3a36847f80415ad",
               "name": "Peter Peter",
               "profile_path": null,
               "id": 69017,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4331c3a36847f80415b3",
               "name": "Morten Søborg",
               "profile_path": null,
               "id": 1175,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4331c3a36847f80415b9",
               "name": "Anne Østerud",
               "profile_path": "/HCQO3VgrWaKRpp3fvoczGracjh.jpg",
               "id": 69018,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53dd45ca0e0a265a930003ea",
               "name": "Teddy Gerberg",
               "profile_path": null,
               "id": 1348784,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "53dd45ec0e0a265a86000471",
               "name": "Peter Aalbæk Jensen",
               "profile_path": "/9Zpmo9qyvyH6ZTO61VsJvQLbBx9.jpg",
               "id": 1174,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.020165,
      "production_countries": [{
         "iso_3166_1": "DK",
         "name": "Denmark"
      }],
      "id": 2061,
      "vote_count": 204,
      "budget": 0,
      "overview": "A drug pusher grows increasingly desperate after a botched deal leaves him with a large debt to a ruthless drug lord.",
      "similar": [
         627,
         1900,
         20289,
         8363,
         12143,
         1368,
         4771,
         180863,
         7516,
         122081,
         319,
         184,
         979,
         807,
         459910,
         2043,
         10474,
         9604,
         11062,
         1586
      ],
      "original_title": "Pusher",
      "runtime": 105,
      "poster_path": "/8z2avGSJmoFdKNYaktA7QWe7m2C.jpg",
      "spoken_languages": [{
         "name": "Dansk",
         "iso_639_1": "da"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Balboa Entertainment",
         "id": 20987,
         "origin_country": ""
      }],
      "release_date": "1996-08-30",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/aNQuRUYTz8CT9HxlNLj4oJ9ctut.jpg",
         "name": "Pusher Collection",
         "id": 203910,
         "poster_path": "/9pM6Rr8WsVqAzTxYswPTNoICNno.jpg"
      },
      "tagline": "You don't have a chance. Seize it!",
      "adult": false,
      "homepage": "http://www.pusher.nu/",
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Color",
      "budgetCurrency": "DKK ",
      "directors": ["Nicolas Winding Refn"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Jens Dahl",
         "Nicolas Winding Refn"
      ],
      "originalLanguage": "Danish",
      "imdbLink": "http://www.imdb.com/title/tt0117407/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwNjg1ODIzOF5BMl5BanBnXkFtZTcwOTM3MDgzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Kim Bodnia, Zlatko Buric, Laura Drasbæk | See full cast and crew »"],
      "reviews": [
         "Wow, I've just watched it. Probably, it'd be better to just lay back, think about the movie and, only after cooling down on emotions, review it. But not this one. \"Pusher\" tells us the story of, perhaps, the worst week of Frank's life, a 'middleweight' dealer caught in an unpayable debt to pay to Eastern European type mafia. And as his story unfolds, your blood pressure will rise just like the incredible tension increasing throughout the movie. No wonder, the debt grows higher and higher every day. Will Frank be able to ever repay it? Its just like the tag-line says: \"You've got no chance! Grab it!\" The fresh thing about this movie is that it shows what is actually happening somewhere in the middle of the 'food-chain' of drug dealing. Not at the top, covered by movies such as Casino, Scarface, Blow, or any other high budget movie made in Hollywood. After all Copenhagen is just not a world of amazing luxury and incredible piles of coke here and there. But the movie doesn't follow another cliché' either. It doesn't show us the bottom, where junkies scavenge on each other, sell their mothers for a gram of heroin, a topic which is usually covered by some low-budget off-movies. Pusher is the ultimate, pure, refined truth about drug dealing. I have a personal experience, myself being for a time an immigrant into Denmark (I've never been a criminal or ever wanted to be, though, just to clarify that matter). And some guys, that I've came across upon coming here, went into this businesses and well, they all hit rock bottom. OK, the movie is hard to get into with its dramatic realism, but I assure you: this movie is as close to coarse truth and gritty reality as it gets!",
         "This is a really good film, one of the most realistic films about drugs and the criminal underworld I've ever seen. The film examines a week in the life of a mid-level drug dealer on the streets of Copenhagen and pulls no punches. Kim Bodina gives a great, nuanced performance as Frank, the dealer and main character. He captures perfectly the snaky charisma, emotional detachment and nihilism of a street dealer. Frank is essentially a sociopath, turning on the charm when it suits him and turning a blind eye on the people in his life when they can't be of any use to him. Especially effective is the portrayal of Frank's relationship with Vic, the high priced call girl he obviously cares about but can't bring himself to get physical with because of his emotional coldness. Frank blames this dilemma on her work, suggesting he can't touch her because she's a whore. However it's Vic he always turns to when things go bad. And things go very bad very quickly for Frank. Through a series of miscalculations and bad luck, he finds himself indebted to a slimy dealer higher on the food chain who's patronizing attitude barely conceals a violent streak. As the week progresses, Frank spirals downward into a desperate attempt to fix his broken life. Trusts are broken, violence and mayhem ensue, and the film finishes on a surprising but perfect note. The director, Nicolas Winding Refn, shows a good command of pacing and camera work. The real star of the film, however is the script. There is never a moment of Pusher that doesn't seem utterly real. Though many may find this film dark and depressing (I won't argue), I think it's strong acting and excellent direction make it well worth seeing.",
         "I just don't know what to say about this film: I just saw it and I feel so ignorant - I don't know who the director is, I don't know who the cast members are, but man-o-man I'm going to find out! What a compelling, gripping story! In this particular case I feel that a few of of us underground movie geeks knowing and loving this film just isn't enough. I feel like I want to run out and tell the world - in brief, I haven't been this excited about a film in a long, long time!",
         "I'm facing a bit of a problem here: what the hell can I possibly say about a film that left me completely speechless? Brilliant \"Pusher\" is prosaic and extremely realistic movie. It's made to look almost like a documentary. One week in the life of a man who makes his living by pushing drugs isn't basically anything so nice to watch but \"Pusher\" is just so upbeat, strong, rough and exciting little movie. It's impossible to ignore it just because it's a portrayal of a truly repulsive and violent lifestyle. Minute by minute the film becomes more and more tense and a viewer starts to wait how dirty can it get and is there any solution ahead or does it all end as it's logical to expect. Well, there's no easy way out. \"Pusher\" shows that it doesn't matter if you're a drug user or a pusher or even both, it's life and death anyway. Actors make the enjoyment prefect. Excellent and impressive Danish thriller that simply won't leave you cold.",
         "PUSHER (Nicolas Winding Refn - Denmark 1996) A genuinely original and completely fresh take on the gangster genre by first time Danish director Nicolas Winding Refn, giving us an insight in the live of Frankie, a lowlife Copenhagen drug-pusher. The film follows his day-to-day pusher-routine during a crucial week in his life but in this particular week things go wrong, as he sets up a heroine deal with a former mate of him, that goes completely bust because the police was informed. He is arrested but is released soon. Problem is, he lost the drugs AND a lot of money and now owes big time to one of the most dangerous criminals in town, a Balkan low-life Yugoslav mafia type, named Milo. Now he desperately tries to find money to repay him in what is very likely to be the last week of his life. There must have been some buzz about this movie when it came out in 1996, but it completely passed me by. Luckily I managed to catch up at the 2006 International Film Festival Rotterdam when hordes of people were attending a screening of the complete Pusher-trilogy ( a bit too much for me at the time, it was sold out anyway). At the same time, Nicolas Winding Refn, was giving an intriguing interview for quite a huge crowd. He had a very dry sense of humor and a scene from MEAN STREETS by Martin Scorsese was shown as his main inspiration for this film, so it stuck with me and I simply had to see it for myself. A tense, exciting storyline, executed in a raw almost documentary-like fashion with a hand-held camera, this film grabs you by the collar and never lets go once it's gets going. Not for the squeamish though, as the sometimes very violent and intense confrontations come very unexpected. Kim Bodnia, who was equally outstanding in NATTEVAGTEN (1994) is exceptionally good. His character, Frank, doesn't invoke much sympathy, but somehow he manages to make his character very much alive and even touching at times. The rest of the cast is equally good with some truly extraordinary performances. Camera Obscura --- 9/10",
         "This movie blew me and my friends away 10 years ago. This rock steady and realistic tale about real criminals, not the typical American teen age- BS. These people are real, that's as simple as it gets. The docu-kind of outlook fits this movie perfect. Someone was complaining how he couldn't sit through this movie because he didn't understand why Frankie made the choices he did. That's the point, there is no reason in real life. People make choices because they are bored or simply don't want to think about life outside the carnival. What is a family, Volvo or a house in the suburbs to a guy, who still at about 35-40 goes out clubbing and gets hi on crank and what-not everyday. These human fates don't need explanation. Perhaps I've been too close to need an explanation. One thing is for sure, these guys have made a great movie that has become a legend within certain groups of people. I guess the point of the movie was very clear in the end. Where does a man go, who keeps pushing the envelope day after day? The answer is - nowhere... Learn your lessons people, no more explanations needed. Absolutely fabulous, that's all I can say... And I won't say too much about the movie, just that it kicks ass. Definitely one of the most enticing criminal stories in the last 20 years.",
         "I think this film is almost without flaws. The dialogue, acting, atmosphere,cutting and soundtrack all mesh in a perfect union. The director has not gotten the international recognition he deserves. Unlike Breaking the Waves and The party the qualities of Pusher are mainly relayed through word of mouth and websites like this. I hope he makes it big with up and coming Bleeder...which by the way also is the name of the band fronted by the guy who scores the films music.(Same guy who did music for Pusher). Anybody who thinks tough street action with good dialogue can only be made by yanks like scorsese, mann and tarantino should think twice and check this one out. It's one of the best.",
         "In the 1990's a new era in the history of Danish cinema began with movies such as NATTEVAGTEN, DE STØRSTE HELTE, PORTLAND and most importantly PUSHER. Nicolas Winding Refn was only 26 years old when he co-wrote/directed this art-house masterpiece debut. I first saw this gem when I was 12 years old. I remember being immediately stunned. It had the stylishness and brutality of Martin Scorsese's GOODFELLAS or MEAN STREETS, the realism and hand-held camera-style of John Cassevettes' THE KILLING OF A Chinese BOOKIE and the cool pop-culture referential dialog of Quentin Tarantino's PULP FICTION, although it easily exceeds being just another post-modernistic Tarantino rip-off. It portrays the milieu and characters in such a realistic and dramatic way that it feels voyeuristic. PUSHER is a docu-drama in the truest sense of the word. Storyline: Frank (Kim Bodnia) is a intelligent, ill-tempered, young drug-dealer who can deliver just the drug for your purposes - hash, heroin, cocaine etc. Frank's everyday life consists of selling drugs with his partner-in-crime/best friend Tonny (Mads Mikkelsen) in Copenhagen's underworld, and hanging out with his girlfriend, the prostitute Vic (Laura Drasbæk) in the evening. They are three drug-addicts themselves. One day two police-men interrupt Frank in a big-time heroin-deal with a Swedish customer. Frank outruns the police-men down to Søerne, where he empties the heroin-bag into the water. Frank is arrested, but the police are forced to release him 24 hours later, since they didn't get the evidence. But now our protagonist has a much greater problem, as he owes away 230.000 Danish kroner for the eliminated heroin to Milo, one of the most dangerous drug-dealers in Copenhagen's underworld. PUSHER portrays a bunch of lost people in the drug milieu of Copenhagen (the capitol of Denmark). Nicolas Winding Refn doesn't care about the drugs or the crimes, he's interested in the humans behind them. Therefore PUSHER feels very real and heart-wrenching. In a very brutal scene Frank locates Tonny at a bar, grabs a baseball bat under the counter, and smashes Tonny to pieces, because the police have informed Frank that Tonny has agreed to witness against Frank. In another scene Frank visits his mother, which he apparently rarely does, in a desperate attempt to loan money. We discover that Frank, unlike most of the lost souls in the crime world, actually comes from a normal danish middle-class family without any negative social heritage. Combining these two scenes illustrates greatly that Frank is a three-dimensional character, because he comes from a socially positive home, and still he's cynical enough to beat up his best friend with a baseball bat. What in Frank's life made him so cold? Hatred for his parents? Boredom? Depression? The answer isn't apparent, and that's what makes it so great. Kim Bodnia (Frank) delivers one of the best performances ever seen in a Danish movie. In fact he's often been compared to Robert De Niro, although I think that image has changed since. Mads Mikkelsen (Tonny) shows much promise in his debut role. Today he's one of the highest regarded actors in Denmark, and in 2004 he continued the Tonny character in PUSHER 2. But the biggest cast surprise is Zlatko Buric (Milo) - an actor you have to see to believe. Many of his dialog improvisations in PUSHER have become popular catch-phrases in Danish youth culture. For example: Du er min veeen, Franke\" or \"Så du er blevet bustet, huh?\" and many more. This is something that you can't pre-invent in any manuscript. Zlatko Buric is a natural! The PUSHER soundtrack consists of amazing 80's-style glam-rock and heavy metal by Peter Peter (ex-member of legendary danish rock group Sort Sol). The hand-held camera work and semi-expressionistic cinematography by Morten Søborg was very innovative for its time, and matched the movie perfectly. The aforementioned cast is great, but also the small cameo-roles played by Lars Bom (Cop), Thomas Bo Larsen (Junkie) and Jesper Lohmann (Mikkel) must receive credits. If you enjoy raw semi-realistic gangster-movies such as THE KILLING OF A CHINEESE BOOKIE or MEAN STREETS, you have to give this a chance. Don't forget its two sequels which, amazingly enough, are even better. 9/10",
         "Pusher is a visceral low-budget movie set on the streets of Copenhagen. Though its director Nicholas Winding Refn is not a part of Dogme 95 the film uses many of the Dogme maxims to better effect. The plot is deceptively simple. Frank (Kim Bodnia)is double-crossed on a deal and has a couple of days to make good the covering loan to a sadistic Balkan gangster. The film's speed rhythms convey the nightmare of time running out, luck running out, and life, shot with hand-held camera in natural light going around in circles until suddenly damnation beckons. Tougher than Tarantino or Trainspotting, it pulls no punches and its running gags fail to draw the sting. One of the great city films of the 1990s.",
         "Pusher is a movie you either love or hate. I'm among those who love it. I especially like the fast cuts between scenes, the camera movements and that the foreign language in the movie hasn't been translated. That gives you a feeling of being there... you're able to feel how the main character must feel in the situations where he's surrounded by the drug dealers. He can't understand what they're saying and must rely on his intuition and their body language - and so is the viewer! The movie is rather brutal, but it seems natural when you're watching it. It's a different movie, but it has a story to tell and it succeeds. And then there's the end.... an open ending, but somehow you know that Frank doesn't really have many oportunities. You feel sympathy for Frank even though he's actually a criminal."
      ],
      "genres": [
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["Balboa Entertainment"],
      "summaries": [
         "Frank is a drug pusher on the roll until he makes a huge deal with dope that he hasn't paid for and he gets busted by the police. He manages to dump the dope in a nearby lake but he owes his supplier a lot of money (not a nice guy to owe money to). Now we follow Frank in his quest to raise money in the underworld of Copenhagen.",
         "A drug pusher grows increasingly desperate after a botched deal leaves him with a large debt to a ruthless drug lord."
      ],
      "budget": 6000000
   },
   "movielensId": 26947,
   "movielens": {
      "languages": ["Dansk"],
      "releaseDate": "1996-08-30",
      "dvdReleaseDate": "2006-11-07",
      "directors": ["Nicolas Winding Refn"],
      "runtime": 105,
      "movieId": 26947,
      "title": "Pusher",
      "mpaa": null,
      "actors": [
         "Kim Bodnia",
         "Mads Mikkelsen",
         "Laura Drasbæk",
         "Zlatko Burić",
         "Slavko Labović",
         "Peter Andersson",
         "Vanja Bajicic",
         "Lisbeth Rasmussen",
         "Levino Jensen",
         "Nicolas Winding Refn",
         "Thomas Bo Larsen",
         "Lars Bom",
         "Michael Hasselflug",
         "Jesper Lohmann",
         "Steen Fridberg",
         "Gordon Kennedy",
         "Gyda Hansen "
      ],
      "imdbMovieId": "0117407",
      "originalTitle": "Pusher",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["kUSomtJF40o"],
      "plotSummary": "A drug pusher grows increasingly desperate after a botched deal leaves him with a large debt to a ruthless drug lord.",
      "tmdbMovieId": 2061,
      "avgRating": 3.71184,
      "releaseYear": "1996",
      "numRatings": 380,
      "posterPath": "/8z2avGSJmoFdKNYaktA7QWe7m2C.jpg"
   }
}