{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pakistani",
            "id": 5471
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "cab driver",
            "id": 11290
         }
      ],
      "imdb_id": "tt0119743",
      "video": false,
      "title": "My Son the Fanatic",
      "recommendations": [],
      "backdrop_path": "/bhEgSbCdLUnrTKPoecoiWwkTpRm.jpg",
      "revenue": 408339,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Parvez",
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd2d",
               "name": "Om Puri",
               "profile_path": "/xjkp1S0XxDBJrjHL8Kq0JD2uvz5.jpg",
               "id": 11851,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Bettina / Sandra",
               "gender": 1,
               "credit_id": "52fe48e7c3a36847f817fd31",
               "name": "Rachel Griffiths",
               "profile_path": "/eufpAqIIViSBe0ZpMRs47drKiQw.jpg",
               "id": 3052,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Farid",
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd35",
               "name": "Akbar Kurtha",
               "profile_path": "/lMrx1hvSerNZAjTuHwCXnPqo4fC.jpg",
               "id": 2981,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Schitz",
               "gender": 2,
               "credit_id": "53064079925141276f00002c",
               "name": "Stellan Skarsgård",
               "profile_path": "/zSCU2agleLtJEvzj98jEesVhBxa.jpg",
               "id": 1640,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Madeline Fingerhut",
               "gender": 1,
               "credit_id": "53064087925141275200002e",
               "name": "Sarah-Jane Potts",
               "profile_path": "/ht2y7pN4Ud91EangkRmnMWYwaJu.jpg",
               "id": 80417,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Minoo",
               "gender": 1,
               "credit_id": "562ec0a2c3a3681b6100c181",
               "name": "Gopi Desai",
               "profile_path": null,
               "id": 1059948,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Fizzy",
               "gender": 2,
               "credit_id": "562ec0b0c3a3681b4d00d2b5",
               "name": "Harish Patel",
               "profile_path": "/yEuGcdTN4Uzz4dKcSYOd2eg4hQ.jpg",
               "id": 53362,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Chief Inspector Fingerhut",
               "gender": 2,
               "credit_id": "562ec0c8925141400600a227",
               "name": "Geoffrey Bateman",
               "profile_path": "/vjR6Toq4ev31Mi3SdrqG0ZS0DeF.jpg",
               "id": 185391,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Druggy prostitute",
               "gender": 1,
               "credit_id": "562ec0d2c3a3681b5c00baf4",
               "name": "Moya Brady",
               "profile_path": "/6uChAZYyn01380K0Os82SLWtBlf.jpg",
               "id": 189921,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Drunk man",
               "gender": 0,
               "credit_id": "562ec0dac3a3681b4b00b15c",
               "name": "Bernard Wrigley",
               "profile_path": "/ymAtIv3TR2uDoHBsp8f9USbJj3Y.jpg",
               "id": 1121491,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Comedian",
               "gender": 0,
               "credit_id": "562ec0e99251410a220076ee",
               "name": "Andy Devine",
               "profile_path": "/rPzhs9YU8y0jsY6M5LHtWJKfjEe.jpg",
               "id": 1159934,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Margot",
               "gender": 1,
               "credit_id": "562ec0f9925141284500b122",
               "name": "Rowena King",
               "profile_path": "/oCb3Pvs2MImZcej54i2gNIpYfAf.jpg",
               "id": 47669,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Maulvi",
               "gender": 2,
               "credit_id": "562ec101925141285300c256",
               "name": "Bhasker Patel",
               "profile_path": "/yL95vZesZfDXIaRDsX94w2BzkFZ.jpg",
               "id": 119792,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Taxi controller",
               "gender": 0,
               "credit_id": "562ec114c3a3681b4b00b166",
               "name": "Dev Sagoo",
               "profile_path": null,
               "id": 1527666,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Man in mosque",
               "gender": 0,
               "credit_id": "57c0a2a79251414ab8006516",
               "name": "Badi Uzzaman",
               "profile_path": null,
               "id": 42644,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Prostitute",
               "gender": 0,
               "credit_id": "5876d40cc3a36850f2000535",
               "name": "Olwen May",
               "profile_path": null,
               "id": 1737280,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Prostitute",
               "gender": 0,
               "credit_id": "5876d423c3a36850e900057f",
               "name": "Alison Burrows",
               "profile_path": null,
               "id": 1240679,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd1d",
               "name": "Udayan Prasad",
               "profile_path": "/rlZmPbmrDdkrIT5HPjlb9qiZvVV.jpg",
               "id": 145304,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd23",
               "name": "Hanif Kureishi",
               "profile_path": "/tpMtQioOfgJGEjH6WNcgknEthZI.jpg",
               "id": 68720,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd29",
               "name": "Hanif Kureishi",
               "profile_path": "/tpMtQioOfgJGEjH6WNcgknEthZI.jpg",
               "id": 68720,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd3b",
               "name": "Chris Curling",
               "profile_path": null,
               "id": 53521,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd41",
               "name": "George Faber",
               "profile_path": null,
               "id": 66129,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e7c3a36847f817fd47",
               "name": "Stephen Warbeck",
               "profile_path": null,
               "id": 469,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.583785,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 55955,
      "vote_count": 4,
      "budget": 0,
      "overview": "Pakistani taxi-driver Parvez and prostitute Bettina find themselves trapped in the middle when Islamic fundamentalists decide to clean up their local town.",
      "similar": [
         1024,
         24420,
         1259,
         276,
         1643,
         13523,
         226,
         44564,
         17612,
         1903,
         68718,
         50544,
         50546,
         46705,
         862,
         13,
         38,
         86331,
         72105,
         28178
      ],
      "original_title": "My Son the Fanatic",
      "runtime": 88,
      "poster_path": "/4NGfgvhcorRalldiTMftmjoG1IQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-10-21",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Udayan Prasad"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Hanif Kureishi",
         "Hanif Kureishi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119743/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MTY1ODY2M15BMl5BanBnXkFtZTcwMjQ4NzMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Om Puri, Rachel Griffiths, Akbar Kurtha | See full cast and crew »"],
      "reviews": [
         "My Son the Fanatic was a surprizing treat. I never heard of it before renting at blockbuster last night. I don't think it ever played in Toronto theatres. Never the less I must applaud at Hanif Kureshi's yet again bold and honest attempt at highlighting a recent phenomenon in the South Asian community: the son going \"holier than thou\" on the family. This film touched me personally because in my case the opposite happened; my father turned fanatic muslim on me. Hanif Qureshi's \"My Beautiful Laundrette\" is one of my favourite films of all time and after \"Budha of Suburbia\" I fell in love with this brilliant man and his work. \"My Son\" is a lot less shocking but still weaves it's way through the father and son conflict elegantly and I am shocked at how blind the Oscar nominators are when it comes to Om Puri's brilliant acting! This is the first film portraying South Asians where the wife has some personality and actually speaks out so I see her as a mother, a wife and a woman that I know because she exists in my community. She is dull and fat and stuck in her little world within the four walls of her home. I dislike her but I know her. The subtle emotions and body language of this lower middle-class family might not be fully understood by a non-south asian critic and that is why some find it moves slowly sometimes. I could not agree with Earnest Hardy more when he says this film (and others by the writer) \"endorse a morality of compassion\". I think that is the only moral value worth pushing!",
         "A Pakistani taxi driver in Britain (Om Puri) is plagued by a bad cosmic joke that seems co-written by Salman Rushdie and Martin Amis: his son, rather than becoming an unrecognizable assimilate, turns into a jihad-embracing Muslim fundamentalist. At the same time, the warmth of a white hooker (Rachel Griffiths) beckons, to the chagrin and hissing tongues of his local countrymen. The writer Hanif Kureishi's onetime Benetton smugness has mellowed into ripe colors of rue, mockery and regret as he eases into middle age, and this adaptation of his short story is a lovely, surprisingly beautifully shot, sneakily haunting small movie. The dialogue sometimes has a novelish explicitness, and the performances are variable--Puri sometimes drifts into F. Murray Abraham terrain, but he has an amazing, craggy, pain-absorbent face. But the movie has a real subject: the ways in which postmod culture-hybridity isn't always a rainbow-colored day at the beach. And the warmth amid desperation of the central relationship suggests what Neil Jordan's MONA LISA might have been without the smoky-sax romanticism. The sad thing about seeing this movie was that, after Miramax gave the movie one of their unceremonious heave-hos (par for the course for their good movies), the audience, unblanketed by buzz, hype, an aura of hot-ticket, reacted as shruggingly as critics seem to have. Too bad: MY SON THE FANATIC evokes the sweet, melancholy fatalism of seventies pictures like THE NICKEL RIDE and STRAIGHT TIME. It has the atmosphere of an overcast crime picture without the crime. And it has at least a handful of real, breathing people in it--as rare an occurrence these days as a flight of the dodo.",
         "This is a great film, however I must comment that I have found many foreign films listed as \"comedy\" or \"humorous\" when in fact they are poignant, disturbing and brilliant (thank you netflix and blockbuster). \"No Man's Land\" and \"Happy Times\" are fantastic movies that are incorrectly labeled as comedy, and \"My Son the Fanatic\" is regrettably categorized as comedy as well. The reality of each character's life is vivid and heart breaking. I felt so uncomfortable witnessing Parvez struggle with his peers, the German, his wife and son, and Bettina. Coupled with \"My Beautiful Laundrette\" you get a taste of immigrant life in Britain.",
         "In light of 9-11, this movie is even more timely than when it first came out. The clashing of consumerism and religious fanaticism is on all our minds. This movie's even handed approach and willingness to show both sides places the viewer on an swerving ideological journey. And Om Puri and Rachel Griffiths give remarkable performances. A must see.",
         "It's a rare treat to see a film character of such complexity. His story, a love story, is as homely and real as a wound. Om Puri's character is not to be forgotten and Griffith gives the searingly intelligent performance I have come to expect of her. Kurtha, as the son, is very poor, his delivery stilted and amateurish, and an outdoorsy scene with the two lovers is cinematographically squandered; otherwise, nothing but raves for this one. Also takes the prize for sexiest and most heartbreaking love scene in movie history.",
         "While this film is superficially about East Indian immigrants in Yorkshire, its themes are universal. Anyone who is or is related to an immigrant should feel at home here. As far as religion goes, these characters could be Jewish or Christian as easily as Moslem. The mediaevalist/modernist conflict is the same. There's no reason why the audience for this film should be just a parochial one. Om Puri gives a brilliant and nuanced performance as the central character, the resilient Punjabi cab driver. Rachel Griffiths is very fine as always as his kindred spirit, a hooker, although her character here is a little more limited in scope than those she portrayed in \"Muriel's Wedding\" and especially \"Hilary and Jackie\". Stellan Skarsgård also steps into a pair of shoes a few sizes smaller than those he has worn in the past. Unheralded though it may have been, this is another thoughtful comedy-drama from Hanif Kureishi, author of \"My Beautiful Laundrette\" amongst others.",
         "My Son The Fanatic demands repeated viewings for its appreciation. It is a dark comedy about an affable taxi driver in the throes of an alcoholic depression, and the eventual disintegration of his family unit. It starts off making you think that this is going to be a comedy about a social-ladder-climbing father undermined by his son's discovery and subsequent rapture of Islamic fundamentalism. When re-viewing the consistency of the tones and hues, it seems that most scenes are being seen through the main character's (Parvez) eyes. And he turns out to be the most unreliable of narrators -- a literary device difficult to translate into film. In most of the darker and smoky hues, Parvez seems to be a warm, loving, tolerant, supportive, and protective soul. In the lighter-toned scenes, we learn that Parvez is actually is clueless to who he is and how he is perceived. The fact is that he is a pathetic failure as a husband, father, and \"career\" man -- a 25-year taxi driver in a poor town in England (Does anyone know what city/town this is supposed to be? It was unclear to me.) where the cab drivers serve as a conduit between prostitutes and their clients. Throughout the movie, he sinks further into the throes of an alcoholic depression. He is an affable and engaging drunk, but a drunk nonetheless. His son's rejection of his depressed and drunken father manifests itself in turning to Islamic Fundamentalism. His wife tries to awaken him as to what is going on, but to no avail. Pervez's sodden eyes sees life only in his own terms. Pervez sees the holy man as a fraud, and thus invents a scene in his mind that everyone else denies, played in near-total darkness, where the holy man asks him for immigration help from his (actually non-existent) political connections with the Fingerhuts, who despise him. Someone else correctly pointed out that the son's adulation of Ayatollah Khomeni is inconsistent with the Pakistani fundamentalist sects that populate Karachi. This is the one well-lit scene where falsehood prevails, but I think that was just a fact-checking error. As he sinks deeper, Pervez conjures up a loving relationship with his favorite whore, the reality of which is depicted in the final scenes as the credits roll. The movie was never really about his son at all. His life was never really about the love he invested in his family at all. It is about a disintegration of a once-noble soul due to depression and alcoholism, and how the world looks through his forgiving eyes. This is a fascinating study in duality, but you need to watch it twice to see it that way. Bravura performances by Puri, the actress who played the wife, and Griffiths as the multi-wigged prostitute are a joy to behold. There are slow and murky patches, but worth sticking with as a fascinating exploration into the culture clashes and reality blurring characteristic of alcoholic depression -- a disease with an acutely higher incidence in the UK among Asian immigrants. Well worth watching.",
         "I was pleasantly surprised when I just saw \"My Son the Fanatic\" (I write this as the video rewinds!). I'm quite averse to watching gratuitous violence and listening to obscenities, and I looked askance at the cover jacket of this video at my public library, thinking it may be akin to films like \"East is East\", \"Sammy and Rosie\", and \"My Beautiful Laundrette\". Like those films, this one explores English lower middle class South Asian immigrants, but I found \"My Son the Fanatic\" to be much more palatable - and in fact endearing and more interesting - than the others. The story is of Parvez (played by Om Puri), a Pakistani who has immigrated to England 25 or 30 years ago. He is a taxi driver and is very proud of his son, Farid (Akbar Kurtha), who appears to be in his mid-20s. The film opens with Parvez, his wife Minoo (Gopi Desai), and Farid all meeting the family of Madelaine (Sarah-Jane Potts), Farid's girlfriend. Madelaine's father is chief of police, and Parvez is enthusiastic for the marriage presumably because the young couple love each other, but also, it seems, because of the status of the chief inspector. Parvez is a hard-working, kind, and friendly man. Some of his customers are prostitutes, and he honorably befriends one, Bettina (Rachel Griffiths), maintaining a respectful and supportive platonic relationship. Life is turned upside down when Farid abandons his engagement and school when religious fundamentalism beckons him. This forms the framework for the climax and resolution of the film. Om Puri, consistent with his reputation, puts in an excellent and believable performance of a parent trying to provide a good life for his family and looking to harness qualities from both his traditional and adopted cultures. Though she seems to be stuck at home, Minoo is more dimensional than other S.Asian mothers are often portrayed to be. I think more could have been done to have developed the son's character, and Bettina had a radiance, charm, and optimism that made it hard to believe her to be a prostitute. \"My Son the Fanatic\" is a film that I enjoyed seeing. It's neither uplifting nor depressing, but the story is interesting and believable, and Om Puri's credible acting is a delight to see.",
         "Om Puri as the character Parvez, opens this film playing a clumsy, overenthusiastic, embarrassing Pakistani immigrant in England, mangling the language and missing every possible social cue. Oh, no, funny little foreign man. Yuk. But then something wonderful happens. We watch Parvez's life fall apart, and he gradually and inexorably turns into a real person of depth and moral struggle. By the end, he has become a person who will live with you long after the film ends. In order to make a living, Parvez drives a cab at night. He also fixes up randy passengers with local hookers, though he is not motivated enough to sample them himself. He feels dirtied by this way of surviving, but does not become a bad person himself. His son, on the other hand, abandons a lovely English girl to join some local Muslim fundamentalists. They are deliberately not clearly identified with either a Sunni or Shiite affiliation, as that is not the purpose of the story. The group imports a radical mullah from the old country, and as he stays in Parvez's house, the son becomes irretrievably estranged from his father. As the action progresses, the son pursues his concept of holiness and purity, and becomes a bad person. Eventually, Parvez's world collapses completely. As Parvez, Om Puri gives a superb performance. What is remarkable about this film is not only the human story, which is real and absorbing, but also a discussion of second-generation Brits turning their backs on Western secular society and reaffirming a rigid, medieval orthodoxy from a country they may never have seen. Now, this is not a documentary and shouldn't be judged as such. What matters here most is the way humans relate to each other in the context of religious zealotry. The scale of violence in this film is modest, but Google \"Finsbury Park Mosque raid 2003\" and \"7 July 2005 London bombings,\" and you will see the eerie predictive power of art. While watching this film, it's hard to remember that it dates from 1998. This is a worthwhile film in terms of human drama, and a tribute to the power of the artist to see into the future. Highly recommended.",
         "I think this movie will resonate especially with any first-and-up generation person whose parents emigrated from east to west. The innocence and almost childlike approach taken by Parvez, Om Puri's character, to things light and dark in England reminded me very much of my own experiences in trying to show my parents \"how things work\" in America. He has done a beautiful job with this character. All in all a well-written and enlightening movie for anyone who is curious about the complex and often convoluted dynamic between immigrants and their transplanted realities."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "BBC Films",
         "British Broadcasting Corporation (BBC)"
      ],
      "summaries": [
         "Parvez was born in Lahore, Pakistan, and as a child was asked to study the Holy scriptures through a Maulvi. When the Maulvi started his sermon, Parvez would fall asleep, this lead to the Maulvi devising a unique punishment, which ultimately compelled Parvez to stop attending. When he grew up, his marriage was arranged with Minoo and they immigrated to a small town in Britain, where Parvez started to make a living driving a taxi, and found himself free from all religious activity. 25 years later, Parvez is an alcoholic, still driving a cab, while people who had immigrated after him have their own businesses and are wealthier. Parvez now has a grown son, Farid, who is the apple of his eye, and is to be engaged to Madeleine Fingerhut, who is the daughter of the local Chief Inspector. After the two families' meet, Farid has a sudden change of heart when he notices that the Chief Inspector detests his family, and it slowly dawns on him that he and his girlfriend are quite different, and he cannot be part of a culture that relies solely on filth, porn, is soaked in sex, along with a mix of Caucasian (white) and Jewish propaganda against Islam. He starts reciting the Holy Quran, and asks permission from his dad to invite some religious leaders from Pakistan, after receiving consent, they do arrive to live in Parvez's home. It is here that Parvez will find that Farid has broken off the forthcoming engagement with Ms. Fingerhut, and has become a born again Muslim. His wife, Minoo, has taken to wearing the Hizaab, remains in the kitchen all day, and is not even permitted to sup or dine with her family, while Parvez finds that he cannot even sleep in his bedroom. Things start to heat up when Farid finds out that his dad has been patronizing a prostitute by the name of Beltina, whose real name is Sandra, and he also notes that his dad is her pimp. Then he and his colleagues set about to cleanse this town of its prostitutes - leading to a confrontation between him and his dad - a confrontation that may well split this family forever.",
         "The gentle friendship between Parvez, a pathetic Pakistani taxi driver and Bettina, a young prostitute gradually develops into a deeper and more passionate relationship as Parvez's home life gradually crumbles. This is due to his son's, Fravid, gradual rejection of Western institutions and values and acceptance of Islamic Fundamentalism. More pressure is brought to bear by a German business man Schitz who makes continual use of both Parvez and Bettina in their professional capacities culminating in his demand for them to organize an orgy to impress some local business colleagues. Everything comes to a head when Farvid and his group decide to rid the town of its corrupting influence and attack the local prostitutes trapping Parvez in the middle forcing him to decide just where his loyalties lie.",
         "Pakistani taxi-driver Parvez and prostitute Bettina find themselves trapped in the middle when Islamic fundamentalists decide to clean up their local town."
      ],
      "budget": 0
   },
   "movielensId": 2697,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-21",
      "dvdReleaseDate": "2000-01-25",
      "directors": ["Udayan Prasad"],
      "runtime": 88,
      "movieId": 2697,
      "title": "My Son the Fanatic",
      "mpaa": "",
      "actors": [
         "Om Puri",
         "Rachel Griffiths",
         "Akbar Kurtha",
         "Stellan Skarsgård",
         "Sarah-Jane Potts",
         "Gopi Desai",
         "Harish Patel",
         "Geoffrey Bateman",
         "Moya Brady",
         "Bernard Wrigley",
         "Andy Devine",
         "Rowena King",
         "Bhasker Patel",
         "Dev Sagoo",
         "Badi Uzzaman",
         "Olwen May",
         "Alison Burrows"
      ],
      "imdbMovieId": "0119743",
      "originalTitle": "My Son the Fanatic",
      "genres": [
         "Drama",
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": ["qq45uHvNvD0"],
      "plotSummary": "Pakistani taxi-driver Parvez and prostitute Bettina find themselves trapped in the middle when Islamic fundamentalists decide to clean up their local town.",
      "tmdbMovieId": 55955,
      "avgRating": 3.62192,
      "releaseYear": "1997",
      "numRatings": 406,
      "posterPath": "/4NGfgvhcorRalldiTMftmjoG1IQ.jpg"
   }
}