{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "campus",
            "id": 8039
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0123034",
      "video": false,
      "title": "Dead Man's Curve",
      "recommendations": [
         69270,
         32284,
         13163,
         60662,
         46286,
         26626,
         7392,
         59797,
         14171,
         51986,
         28746,
         10324,
         20224,
         27253
      ],
      "backdrop_path": "/gJ4mYKK3z43Hbdc5WaSQneht65P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chris",
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065a3",
               "name": "Michael Vartan",
               "profile_path": "/5HCb1CxwIgiZAjKMe9BG8VtHE80.jpg",
               "id": 15424,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065b3",
               "name": "Matthew Lillard",
               "profile_path": "/gJsQkX20g0ABquHqVpBJzMXR2JF.jpg",
               "id": 26457,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Rand",
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065b7",
               "name": "Randall Batinkoff",
               "profile_path": "/aXj1Q2pr70lMPJPRuNB6EIYCujr.jpg",
               "id": 36631,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Emma",
               "gender": 1,
               "credit_id": "52fe4693c3a36847f81065bb",
               "name": "Keri Russell",
               "profile_path": "/6fZ5ceRvZtRkRm06HgaV4qCpJNY.jpg",
               "id": 41292,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Natalie",
               "gender": 1,
               "credit_id": "52fe4693c3a36847f81065bf",
               "name": "Tamara Craig Thomas",
               "profile_path": "/5nyVHz3WrBmMqWxlk2XBDYJfGP6.jpg",
               "id": 20302,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Detective Shipper",
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065c3",
               "name": "Anthony Griffith",
               "profile_path": "/uamriSYnBx3QkygSwCRzkIEVFD0.jpg",
               "id": 131118,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Detective Amato",
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065c7",
               "name": "Bo Dietl",
               "profile_path": "/p4g45Hu2GX8YgzMsAv4DnPvVZjt.jpg",
               "id": 131119,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dr. Ashley",
               "gender": 1,
               "credit_id": "52fe4693c3a36847f81065cb",
               "name": "Dana Delany",
               "profile_path": "/6BfV8TS5Z28VNUVUX5J0NwRIDNT.jpg",
               "id": 65002,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Chancellor Alexander",
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065cf",
               "name": "Henry Strozier",
               "profile_path": "/wfnHPBfsQ1C1a1DZCzIEegreIMx.jpg",
               "id": 131120,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065a9",
               "name": "Dan Rosen",
               "profile_path": null,
               "id": 72620,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4693c3a36847f81065af",
               "name": "Dan Rosen",
               "profile_path": null,
               "id": 72620,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.806868,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44625,
      "vote_count": 24,
      "budget": 1000000,
      "overview": "Two roommates plan to kill a third to take advantage of college policy giving a 4.0 grade to a suicide's roommates.",
      "similar": [
         8090,
         238636,
         5486,
         30833,
         40969,
         3134,
         123109,
         1696,
         49797,
         25155,
         9299,
         2832,
         298312,
         948,
         281957,
         12619,
         3600,
         10285,
         12521,
         168098
      ],
      "original_title": "Dead Man's Curve",
      "runtime": 91,
      "poster_path": "/rgWCi3CB6oTte8e9Iu8S1auxXUy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Trimark Pictures",
            "id": 4063,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Trimark",
            "id": 5935,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-24",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Someone is about to go over the edge.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dan Rosen"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Dan Rosen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0123034/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4NjUxNjI2MV5BMl5BanBnXkFtZTcwMjYzNzYyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Lillard, Michael Vartan, Randall Batinkoff | See full cast and crew »"],
      "reviews": [
         "Some universities and colleges would grant a 4.0 average to the roommates of students that commit suicide. That said, there is always someone who figures out a way to get rid of an obnoxious student if it would mean grades one didn't earn. Leave it to some college kids to figure out a way to get into prestigious schools with little intelligence to justify the artificially inflated grades given to them in order to appease the ordeals they've been through. This is the premise of Dan Rosen's thriller \"Dead Man's Curve\". Mr. Rosen trying to capitalize on other movies directed to younger audiences, created a story with many twists and turns. Some of the plot devices work, while the viewer is left to ponder some of the logic behind what is presented on the screen. The film, as some of the comments do suggest, will resonate more with American audiences because they might be more aware of this curious fact that some of our higher institutions of learning reward students that come close to tragedy. There are four people that can gain admittance to Harvard, one of the elite centers for learning in the country. Tim and Chris conspire to get rid of the boorish and obnoxious Rand and by doing so, they will be admitted to the place of their dreams, almost by osmosis, since they don't have the grades to prove their intelligence. But Rand's body is never found, so can it be considered a true suicide? When the police appears to interrogate them, Tim suddenly switches his story and Chris' account of what happened is questioned by the detectives. The second plot involves Emma, who is Chris' girlfriend. She also has her own agenda. When Natalie, her roommate, who had been going with Rand, tests positive as being pregnant, puts the Canadian co-ed into a suicidal mood. Emma will stand to receive the good grades and has an assured future, or so it seems. It is at this point when another twist that comes out of nowhere occurs. Rand, who didn't die, resurfaces. His explanation doesn't convince, but here is where one gets to the real point in the film. Chris, it turns out has done some planning on his own, really wants to get rid of Tim. The intense Matthew Lillard gives an over the top performance as Tim, the man at the center of the story. Michael Vartan plays Chris and Randall Baliskoff is seen as Rand. Keri Russell, a gorgeous creature, appears as the sweet Emma, an ambitious girl, herself. Dana Delaney's role is not justified as the psychiatrist that acts as a sort of a Catholic priest, knowing the students' secrets, but not coming forward to denounce what really is going on.",
         "Matthew Lillard always manages to be the shining light of a film. He was great in Scream, even better in She's All That,and somehow managed to go one better in Dead Man's Curve. It doesn't matter how bad the film is, you can always count on Matthew Lillard. He plays disturbed killer Tim who, with the help of his room mate Chris(michael vartan), plots to kill other room mate Rand(randall bakinkoff). The story gets even more intense however, when Chris' girlfriend finds out. Lillard gives a fantastic performance(as always). The rest of the cast though, trail behind. They're not terrible, but they're just not as watchable as Lillard who plays his psycho killer with acute accuracy. In my opinion, Lillard is one of Hollywood's best up and coming actors. He has a superb career ahead of him and this film is one huge stepping stone that will be remembered as his leap to success. Top film with a fun and twisted story that will keep you hypnotized throughout. Rating=5/5",
         "The premise behind this movie is, how much is someone to compromise their morals in order to achieve academic gain? In the tradition of movies such as \"The Perfect Score\" and \"Cheaters\", but much, much darker, that question is answered...and then some. Matthew Lillard does an amazing job as a cunning, manipulative, and more than slightly psychotic college roommate willing to do anything to get ahead. The movie contains enough plot turns to make your head spin at times, but the acting is solid and the storyline was more than enough to keep me captivated throughout. Its an old question placed in a contemporary context, and it makes for a damn good horror film.",
         "\"Scream\"'s Matthew Lilard is at his insane best in this variation on student life. Unlike another film which took a comic approach to the \"dead roommate equals good grades\", this film is deadly serious. Good performances aside, the script meanders and lacks true thrills, making it slow going at times. But hang in for the ending - as usual, the best part of the curve is the twist.",
         "Insane college student figures out a way to get his grades the easy way. Murder. Everything goes his way as he outwits the police, fools the university staff, and pins the rap on his dopey partner. However, all is not as it seems and some surprises are in store for the viewer. Interesting little thriller, with some black comedy thrown in the mix: makes a guy wonder if such a rule could exist in a university without causing just such an incident.",
         "I have just finished watching this movie. Sounded good so I thought I would see it. I will never regret it. This movie has a very good script and the acting is great. This could be one of Matt Lillard's best movies. This movie starts out when Tim (Matt Lillard) and his roommate Chris find out if their roommate commits suicide, you automatically get a 4.0. So they murder their roommate and make it look like a suicide. Finally, all the events lead up to the ending of the movie. I have to say this is the best and most clever and shocking ending I have ever seen. I would HIGHLY recommend seeing this movie. I give Dead Man's Curve: 9/10, or a 4.5/5.",
         "I get a kick out of Mathew Lillard's wackiness, so this movie was enjoyable, but by the time it's over it has seriously weakened itself with its desperate plot contrivances. It starts out solid and interesting, without boring pauses or over-long set-ups. It's suspenseful to see Tim's (played by Lillard) obnoxious behavior after pushing his room-mate, Rand, off of the cliff (beginning of the movie, not a spoiler). But the movie goes awry when it tries too hard to force twists & turns into the plot. It's a little suspenseful, but it's really more unconvincing and plot-holed than anything else by the end. One of those times where you say, \"Oh!\" when the surprises first occur, but then start scratching your chin and saying, \"Wait...if he did this and she did that, and they knew this, then why did he ever say that and why did they even do that? Would he really have done that?\" etc. It sacrifices its plausibility for cheap shocks, which aren't all that great. But it is an entertaining flick, and I'm not disappointed I rented it. Pretty good as far as these types of movies go, I suppose. I enjoyed the music and movie references (The Smiths, Joy Division, and \"The Deer Hunter\" becomes \"The Beer Hunter\"), they made it kind of witty and \"hip\" before it scrambled to out-do itself with run-of-the-mill plot-twists. Watch it for casual kicks.",
         "This movie will send your brain through loops you didn't think possible. And don't even try to predict what's going to happen, because you'll be wrong. Trust me. But I know you will, anyway, because that's the fun part. The Curve appears to be a typical teen flick about getting a 4.0 GPA for having your roommate commit suicide. But it is much more, believe, me. The acting is surprisingly good, and, like I said, the plot is superbly done. Go rent it, and good luck figuring it out!",
         "Dead Man's Curve revolves around an urban legend that if your college roommate commits suicide, you get pass grades for the term to help ease your pain. Enter Chris {Michael Vartan} and Tim {Matthew Lillard} who decide to test this theory by offing their buddy Rand {Randall Batinkoff}. It's a deliciously evil premise that thankfully, in spite of the film's low reputation, makes for an enjoyable genre spliced viewing. Directed and written by Dan Rosen, Dead Man's Curve has a clever plot at its core, our pair of rotters, tho Chris is a sheepish accomplice to the dominant Tim, set it up nicely by way of chatty concerns with the school psychologist and the shifty purchase of depressing music. Aided by some women troubles in the mix, the pair execute their plan, but all is not quite that simple as the plot unravels it twists and turns and delivers an ending that is as genius as it is unexpected. And that's in a good way as well. The young cast, handsome and ebullient, do fine work here, particularly Lillard, who expands on his loony turn in Scream from two years earlier with much maniacal relish. The older actors, however, don't fair so well, courtesy of either being underwritten or merely for being plot fillers. But hey, if all lady psychologist's look like Dana Delaney then I'm going to sign myself up for a bit of therapy. Naturally with a premise like this it's far from perfect and the implausibility factors are high, but Rosen has a wry observation on American dorm life. Be it the pressures of success or the need to be part of a group, Rosen and his on form cast have created a darkly comic piece of devilment. The soundtrack is excellent, and for sure it's laden with misery from the likes of The Smiths and Bauhaus, while the Elk Neck Lighthouse location work evokes memories of tidy creepers from days of yore. A fine story told and executed well, give it a go and you may just be as pleasantly surprised as I was. 7/10",
         "***SPOILERS*** Over the top suspense mystery that takes place on an unnamed eastern Maryland collage. Having found out that if a roommate at collage commits suicide you get an automatic 4.0 average both Tim, Matthew Lillard, and Chris, Michael Vartan, who are sub-par students concoct a plan to get their other roommate Rand, Randall Batinkoff, to kill himself! Rand a nasty and arrogant creep who's constituently humiliating his girlfriend Natalie,Tamara Craig Thomas, in public and making a complete a** of himself is the perfect candidate to knock off with nobody, not even his family members, even missing him. Even though at first he thought it was a joke on Tim's part Chris reluctantly goes along with the plan to do Rand in. This happens late one evening at the light-tower just outside of the collage campus. Getting a very depressed Rand, who had just found out that Natalie is pregnant, to dink a full bottle of whiskey laced with rat poison he goes into convolutions and loses consciousness. With Tim leaving a suicide note in the empty bottle it's made to look like Rand did himself in over Nataie, after telling him that he knocked her up, dumping him. With Chris not having the guts to throw Rand down the Cliff, to make it look like he jumped, Tim finishes the job in having him fall to his death, if he wasn't dead already, to the dangerous rocks some 100 feet below. It's then that things start to get a bit, to put it mildly, out of hand with Chris not willing to get, feeling that he didn't earn it, his well deserved 4.0 average and his partner in crime Tim doing everything he can to implicate him in Rands murder!Tim goes as far as staging a tryst with Chris' girlfriend Emma, Keri Russell, for Chris to see in order to get him go to the cops and confess not only his but Tim's crime! While all this is going on Rand's body is never recovered and thus making it impossible for both Tim and Chris to get their coveted 4.0 average and thus being eligible to enter Harvard or Yale! The movie really gets ridicules in it's myriad of twists and turns that are so incomprehensible that their about as illogical as subatomic Quantom reality is towards modern Newtonian physics! You finally get the picture in the end to what's the story behind Rand's demise and who was really the person or persons behind it. But by then your brain has been so brutally battered and beaten by the films confusing and convoluted storyline, with about a half dozen plot twist, that you don't really care what it is!"
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Mount Royal Entertainment",
         "Click Productions",
         "Hope Street Entertainment"
      ],
      "summaries": [
         "Tim, Chris and Rand are campus roommates. They are not the closest of friends. When it is announced as being usual to get the best possible grades as compensation for the psychic stress of a roommates' suicide, Tim and Chris decide to kill Rand. After Rand's \"suicide\", his girlfriend Natalie takes her life, too. She was the roommate of Chris' girl Emma. Who's tricking who?",
         "Urban Legend has it that if you kill your college roomate, you get a 4.0 for the semester. So when Chris goes along with Tim pushing Rand off the curve, they have good reasoning for it. Besides, Rand is always being a jerk to his girlfriend Natalie who is Emma's roomate. After his girlfriend Natalie finds out about his death, she kills herself by jumping off the curve. Later Chris's girlfriend Emma tries to convince him that Tim is setting him up for the murder and trying to seduce her. Then suddenly Chris's girlfriend is taking a 4.0. Is Emma behind this too, is Rand really dead, and does Chris have something planned for Tim? If so why everyone is playing with each others head?",
         "Two college students kill their roommate and make it look like a suicide."
      ],
      "budget": 1000000
   },
   "movielensId": 27016,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-24",
      "dvdReleaseDate": "1999-04-20",
      "directors": ["Dan Rosen"],
      "runtime": 91,
      "movieId": 27016,
      "title": "Dead Man's Curve",
      "mpaa": "R",
      "actors": [
         "Michael Vartan",
         "Matthew Lillard",
         "Randall Batinkoff",
         "Keri Russell",
         "Tamara Craig Thomas",
         "Anthony Griffith",
         "Bo Dietl",
         "Dana Delany",
         "Henry Strozier"
      ],
      "imdbMovieId": "0123034",
      "originalTitle": "Dead Man's Curve",
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["XoiPokum5is"],
      "plotSummary": "Two roommates plan to kill a third to take advantage of college policy giving a 4.0 grade to a suicide's roommates.",
      "tmdbMovieId": 44625,
      "avgRating": 3.06818,
      "releaseYear": "1998",
      "numRatings": 22,
      "posterPath": "/rgWCi3CB6oTte8e9Iu8S1auxXUy.jpg"
   }
}