{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "addiction",
            "id": 6782
         },
         {
            "name": "fashion",
            "id": 15479
         },
         {
            "name": "top model",
            "id": 225014
         }
      ],
      "imdb_id": "tt0123865",
      "video": false,
      "title": "Gia",
      "recommendations": [
         2057,
         18555,
         37636,
         12793,
         10876,
         10691,
         11081,
         29371,
         14695,
         9839,
         13132,
         16643,
         10644,
         15542,
         15647,
         35203,
         5852,
         11093,
         36291,
         9280
      ],
      "backdrop_path": "/ojMaUpBm6acca9mXmLALwHq1tA1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gia Carangi",
               "gender": 1,
               "credit_id": "52fe45fc9251416c75069437",
               "name": "Angelina Jolie",
               "profile_path": "/6tocswK39SrSjZIRDaTpVyPxDz8.jpg",
               "id": 11701,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe45fc9251416c7506943b",
               "name": "Elizabeth Mitchell",
               "profile_path": "/k7Mtxruey23xxZDBWmB7apEHKDy.jpg",
               "id": 31167,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "T.J.",
               "gender": 2,
               "credit_id": "52fe45fc9251416c75069445",
               "name": "Eric Michael Cole",
               "profile_path": "/t66aYWyek7oGGNgD1GpEnosq56v.jpg",
               "id": 83051,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Stephanie",
               "gender": 1,
               "credit_id": "52fe45fc9251416c7506944f",
               "name": "Kylie Travis",
               "profile_path": "/rhVtN91Rf9NBZqZGCmJyDP4gUME.jpg",
               "id": 96043,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Kathleen Carangi",
               "gender": 1,
               "credit_id": "54e35c8cc3a368486f00143f",
               "name": "Mercedes Ruehl",
               "profile_path": "/dGyZ3s7TdC88JgDMQaQqUOwFul0.jpg",
               "id": 2167,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gia Carangi (age 11)",
               "gender": 1,
               "credit_id": "54e35cdec3a368454d0098a6",
               "name": "Mila Kunis",
               "profile_path": "/6Lp9qPkMO740Hcp8NBYZZLWWvJF.jpg",
               "id": 18973,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Wilhelmina Cooper",
               "gender": 1,
               "credit_id": "54e35d1492514119530095f9",
               "name": "Faye Dunaway",
               "profile_path": "/sq12RJZ1HTXHHI48y31YIS2qp87.jpg",
               "id": 6450,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Joe Carangi",
               "gender": 2,
               "credit_id": "5780933f9251415dbe005091",
               "name": "Louis Giambalvo",
               "profile_path": "/5YmQzCe2oU8j978517inEaDFkyK.jpg",
               "id": 168320,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Bruce Cooper",
               "gender": 2,
               "credit_id": "578093e0925141450700359d",
               "name": "John Considine",
               "profile_path": "/paRGlZoJfUAFBtWs6XbeaAItwsY.jpg",
               "id": 74763,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mike Mansfield",
               "gender": 2,
               "credit_id": "5780944992514144db00395d",
               "name": "Scott Cohen",
               "profile_path": "/hYAGNWaiLj2zY3kj7TBUkJuGoTV.jpg",
               "id": 83721,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Francesco",
               "gender": 0,
               "credit_id": "578094bec3a3682e2c005d1e",
               "name": "Edmund Genest",
               "profile_path": null,
               "id": 1074124,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Emergency Room Nurse",
               "gender": 0,
               "credit_id": "578095b7c3a36835e0003bb2",
               "name": "Holly Baker",
               "profile_path": null,
               "id": 1647390,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Disco Doorman Tony",
               "gender": 2,
               "credit_id": "5780966b92514144db003a6b",
               "name": "Joe Basile",
               "profile_path": "/j7hg42fJNwdCHrSV7jXN4sJOHKK.jpg",
               "id": 77586,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Hispanic Stylist Phillipe",
               "gender": 0,
               "credit_id": "578097f7c3a368355b00386d",
               "name": "Rick Batalla",
               "profile_path": "/tWvciPlM9LIuUDYRprrVYO7Zvca.jpg",
               "id": 1647399,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Hood #2",
               "gender": 2,
               "credit_id": "57809955c3a3682e26005bc5",
               "name": "Lombardo Boyar",
               "profile_path": "/7zmk3iK1liMrbCnstNtbmYY3zFN.jpg",
               "id": 4992,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Hood #3",
               "gender": 2,
               "credit_id": "57809c32c3a36824b80000d5",
               "name": "Jules Douglas",
               "profile_path": "/oCtYP7RZqMMWIiSpwxmv2zHAlCa.jpg",
               "id": 1096126,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Amy",
               "gender": 1,
               "credit_id": "58f6dcbb9251415df0006137",
               "name": "Holly Sampson",
               "profile_path": "/tjyrx2Sskh7KLWCJqW2lBV1JMh7.jpg",
               "id": 43504,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Booker",
               "gender": 1,
               "credit_id": "59b6f75192514167cd00046f",
               "name": "Drinda Lalumia",
               "profile_path": "/wUQDTc4Bt3wA5vGiFxz7n9cMtkh.jpg",
               "id": 1886348,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45fc9251416c75069441",
               "name": "Michael Cristofer",
               "profile_path": "/7FbuXmO6dtQ9ZXoon3mth1j9PZV.jpg",
               "id": 21136,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57809d2bc3a36824b8000169",
               "name": "Jay McInerney",
               "profile_path": null,
               "id": 1047730,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57809c95c3a368239e000154",
               "name": "Michael Cristofer",
               "profile_path": "/7FbuXmO6dtQ9ZXoon3mth1j9PZV.jpg",
               "id": 21136,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.728707,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14533,
      "vote_count": 196,
      "budget": 0,
      "overview": "Fact-based story of top fashion model Gia Marie Carangi follows her life from a rebel working in her father's diner at age 17 to her death in 1986 at age 26 from AIDS, one of the first women in America whose death was attributed to the disease. In between, she followed a downward spiral of drug abuse and failed relationships.",
      "similar": [
         152532,
         11202,
         9800,
         45317,
         462,
         640,
         769,
         5915,
         318846,
         324786,
         389015,
         407445,
         363676,
         371638,
         277216,
         396371,
         395991,
         323677,
         228970,
         274479
      ],
      "original_title": "Gia",
      "runtime": 120,
      "poster_path": "/mQ5IPtwD39WLy1lCQxzm371cRwq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "HBO Pictures",
         "id": 3078,
         "origin_country": ""
      }],
      "release_date": "1998-01-31",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Too beautiful to die. Too wild to live.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Michael Cristofer"],
      "runtime": 120,
      "synopsis": "Gia Carangi (Angelina Jolie) is a Philadelphia native who moves to New York City to become a fashion model and immediately catches the attention of powerful agent Wilhelmina Cooper (Faye Dunaway). Gia's attitude and beauty help her rise quickly to the forefront of the modeling industry, but her persistent loneliness after the death of Wilhelmina drives her to experiment with mood-altering drugs like cocaine. She becomes entangled in a passionate affair with Linda (Elizabeth Mitchell), a make-up artist. Their love affair first starts when both pose nude and make love to each other after a photo shoot. However, after a while Linda begins to worry about Gia's drug use and gives her an ultimatum; Gia chooses the drugs. Failed attempts at reconciliation with Linda and with her mother, Kathleen (Mercedes Ruehl), drive Gia to begin abusing heroin. Although she is eventually able to break her drug habit after much effort, she has already contracted HIV from a needle containing infected blood and dies from complications of AIDS in 1986 at the age of 26.",
      "writers": [
         "Jay McInerney",
         "Michael Cristofer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0123865/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczODI1MTg0Ml5BMl5BanBnXkFtZTcwMzk3NDYyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Angelina Jolie, Faye Dunaway, Elizabeth Mitchell | See full cast and crew »"],
      "reviews": [
         "I'm here to write a small human spin on the film Gia. As this film claims, Gia WAS different things to different people. I know because I met Gia in Philadelphia when we were both 16. I casually knew her from her father's hoagie shop because I went in there often to eat. When I chose to go to college in Philadelphia a few years later, I dropped in occasionally at the shop and I always said hello to Gia's dad to ask how she was doing as a model. He was so proud of her and what she was accomplishing in New York and all over the world. He always had that picture of her in Cosmopolitian above his cash register and he let me look at it. I just knew Gia would do well. Years pass, I move to the West coast. In 1982, I'm in New York and I heard she was right up the street from where I was, and I wanted to stop by to say \"Hi\" but never got the chance, I was too busy in meetings and never thought about it again. It wasn't until 1990 I heard she died, and the way she died and it tore me to pieces. So tragic to someone many of us thought from our generation, our backgrounds, our area \"had made it.\" In 1998, this movie was done and I thought done as good as it could be. I know there were those closer to Gia that knew more and didn't appreciate it, but I did, and I miss her. Angelina Jolie did some very serious acting to bring this part of Gia's life to the screen. The movie was of theatrical quality and its a shame it didn't get that release. But thanks to this movie, there was a great deal of Gia's life I knew nothing about after 17 years old. But the ending was what touched me, because that is how I will remember Gia, and wish for everyone to remember her as well, even with the rough and gritty content contained in her life brought to screen. This is a hard must see for those who think a model's life is exciting, it can be, but they will also learn its nothing without the love of your parents, stable friends and relationships and the love of yourself - no matter what yourself may be.",
         "This movie turned out to be a very unexpected favorite of mine. Angelina Jolie stars as the late Gia Marie Carangi, an Italian American woman who rose from a humble Philidephian beginning to worldwide fame as the first known \"supermodel\", and whose short-lived career spanned from the late seventies to the early to mid eighties. Jolie is super-impressive as she portrays the highs and lows of Gia's fame: strutting through a crowd of admirers, the look on her face saying, \"I'm GIA, and you're nobody!\"; endulging in glamour drug of the moment, cocaine; fiercely proclaiming her love for Linda (Elizabeth Mitchell), right in front of Linda's boyfriend; tearfully begging her visiting mother (Mercedes Ruehl) to stay with her, then hurling obscenities at her while throwing her baggage out of the apartment; and quietly and gracefully accepting the most tragic news about her health, just as she's finally getting her life on track. This movie deals very frankly with Gia's sexuality and there is some nudity and scenes of sexuality, but looking past the sex and the drugs and the tough exterior she displayed (especially when someone took her knife away from her), you see a very lost, fragile person. Gia is almost childlike in her disillusionment about the fashion industry, and you feel it in the way she fantasizes about a \"normal\" life with children, the way she feels like people regard her as a \"piece of meat\" with no brains, and the way she is so truly hurt by a fellow model calling her hateful names in a jealous rage. I think this movie is something that should be seen by people of all ages, regardless of its sexual content, because it carries a strong anti-drug message as well as a touching story we can all identify with even if a lot of us are not blessed with the kind of glorious physical beauty Gia was blessed with.",
         "A tremendous biography of a supermodel, Gia Carangi. Her beauty graced magazines profusely in the late 70's. She knew as a little girl just how attractive she was. Her short life dealt with defiance of authority, lesbianism, love/hate relationships, drug addiction and AIDS. Angelina Jolie was excellent as Gia. Her profanity, nudity and lesbian love scenes scorch the screen. Ranking among the best on film. Also in this eye opener is Elizabeth Mitchell, Mercedes Ruehl and Faye Dunaway. With all the violence, nudity and profanity; can not believe this is rated R instead of X. But I am not complaining. This is a tragic story about a complicated life. A very interesting bio.",
         "Gia's a great biographic film with a credible story, great cast and great presentation. Angelina Jolie's performance here is nothing less than incredible, in fact there was a short time when I thought she's really Gia herself and that she's really troubled...that's how convincing her act is. Mercedes R makes a great support role...and a mother as well. There are so many things to learn here, like how fashion was in the 1970's and 1980's, Gia's lesbian crave, the drugs and the AIDS. The film is so realistic, you'll really care for the people and the events that unfold. Definitely a must-view!",
         "I rented the unrated version from NetFlix. Gia is a powerful movie. It is two stories intertwined into one: the life of a confused teenage girl, looking for love and acceptance, and of the modeling industry and its effect on the emotions and egos (no matter how large or small) of those in front of the camera. As a woman who worked within the industry several years ago, I could relate to the confusion that Gia felt. Angelina Jolie gave the viewer an excellent portrayal of a lonely teenage girl who was trapped inside an adult woman, her only comfort being her lover and later, her drugs. The performances of the actresses were on target; the message was clear. A haunting movie worth purchasing.",
         "An unforgettable film about a supermodel, named simply Gia. Stunning performance by Angelina Jolie as Gia and Faye Dunaway as her agent. The movie plays out like a documentary and is filled with interviews by those who knew her during her career as a model and the family who loved her. It's a fast paced film and exciting to see the underground world of modeling. It is based on Gia's often-poignant journal. It gives us a glimpse on the darker side of fame that we do not often look in on. It will be hard to watch at times and harder not to at others. It will make you thankful that if you are thirty or forty-something, that you made it through this difficult time in life, a time when no one knew about the painful consequences that would consume a life. Gia is a movie for the strong at heart or the weak who wish to be stronger. After watching the movie, I looked at her website and was eerily surprised that I recognized that face from one of my mom's Cosmopolitans. I am grateful her memory lives on through her journal and this under-rated film. Two-thumbs up!",
         "Angelina Jolie has slogged her way through so much mediocre material, I can't even begin to understand how she has kept her love for acting. But it's undeniable... her talent and spirit are bottomless, and she could be a superstar if given the right movie role. 'Foxfire' wasn't it. 'Hackers' was a mess. And 'Gia' is well-intentioned exploitation at best. (I love sex scenes between women as much as the next guy, but the movie goes a little overboard..... there's a fine line between character growth and the Spice Channel, apparently.) A decent biography, I guess, and Jolie does as much as possible with the limited script. But if there's any justice in this world, Jolie will be in the Hollywood elite soon, rather than toiling away on hedonistic HBO works.",
         "This movie is your typical \"How deviant sex and drugs ruined a successful person's life\" films we typically get out of television (shades of the Hayes office!). However, Angelina manages to do what many actors fail to do: take a basically unsympathetic character and make you feel sorry for her. I think the role of Mercedes Rhuel has also not been emphasized enough. Throughout the entire film she presented a highly sympathetic, charismatic persona as the mother who could not quick kick her gosling out of the nest. Gia was not a product of the times--she and others like her were the times.",
         "Angelina Jolie is the kind of actress who mixes beauty and talent. In this very good TV movie she has a great performance as Gia Carangie, a 'lost girl'. \"Gia\" is a very realistic and strong film, with a beautiful story. It is not a typical TV movie, so it's worth seeing. Another score for HBO. Rating: 8/10",
         "I knew this was going to be a tough movie to watch, but I never realized how riveting it was going to be! I couldn't stop watching. Angelina Jolie brought an innocence and fragility to the role, that made me care about Gia. I wanted her to be happy. I wanted things to work out with Linda. I wanted her to beat the drugs. And I was devastated when she died. This movie is a morality play showing how we idolize super models and turn them into impossible role models. We give them every luxury money can afford, whether or not that luxury is legal. Then, when these idols become addicted to the drugs and such, we discard them. I just started to type that Gia's life was wasted, but I'm not sure that's the case. Her tragic life can now serve as an example of how bad the excesses can get, and the almost inevitable end that comes with that lifestyle. My heart went out to her. She showed the dignity and grace during her final days that may have been missing in her early life. I've heard that this movie isn't exactly accurate, that Linda never really existed. That doesn't lessen my enjoyment of this movie. This is one of the movies I think any young person needs to see."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "HBO Pictures",
         "Marvin Worth Productions",
         "Citadel Entertainment"
      ],
      "summaries": [
         "When Gia Carangi first arrives in New York City, she's a beautiful drop-out from Philadelphia brashly bursting through the closed doors of top modeling agent Wilhelmina Cooper. Gia's electrifying personality and potent sexuality soon find their way onto the covers of America's top-selling magazines. But being loved by the world isn't the same as being love by one - an unfulfilled desire that can take Gia dangerous places. And for a beautiful woman, one slip could lead to an untimely and terrifying downfall.",
         "Fact-based story of top fashion model Gia Marie Carangi follows her life from a rebel working in her father's diner at age 17 to her death in 1986 at age 26 from AIDS, one of the first women in America whose death was attributed to the disease. In between, she followed a downward spiral of drug abuse and failed relationships. Her drug addiction and emotional instability caused by her mother brings her career and ultimately her life to an untimely downfall.",
         "The story of the life of Gia Carangi, a top fashion model from the late 1970s, from her meteoric rise to the forefront of the modeling industry, to her untimely death from AIDS at age 26."
      ],
      "budget": 0
   },
   "movielensId": 27020,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1998-01-31",
      "dvdReleaseDate": "2004-08-24",
      "directors": ["Michael Cristofer"],
      "runtime": 120,
      "movieId": 27020,
      "title": "Gia",
      "mpaa": "R",
      "actors": [
         "Angelina Jolie",
         "Elizabeth Mitchell",
         "Eric Michael Cole",
         "Kylie Travis",
         "Mercedes Ruehl",
         "Mila Kunis",
         "Faye Dunaway",
         "Louis Giambalvo",
         "John Considine",
         "Scott Cohen",
         "Edmund Genest",
         "Holly Baker",
         "Joe Basile",
         "Rick Batalla",
         "Lombardo Boyar",
         "Jules Douglas",
         "Holly Sampson",
         "Drinda Lalumia"
      ],
      "imdbMovieId": "0123865",
      "originalTitle": "Gia",
      "genres": [
         "TV Movie",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["v2xVI8D2PCY"],
      "plotSummary": "Fact-based story of top fashion model Gia Marie Carangi follows her life from a rebel working in her father's diner at age 17 to her death in 1986 at age 26 from AIDS, one of the first women in America whose death was attributed to the disease. In between, she followed a downward spiral of drug abuse and failed relationships.",
      "tmdbMovieId": 14533,
      "avgRating": 3.38146,
      "releaseYear": "1998",
      "numRatings": 561,
      "posterPath": "/mQ5IPtwD39WLy1lCQxzm371cRwq.jpg"
   }
}