{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0147599",
      "video": false,
      "title": "Thick as Thieves",
      "recommendations": [
         75162,
         30345
      ],
      "backdrop_path": "/fRl1d6LFc25alFj0C9rNco15Mdg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Mackin",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c996b",
               "name": "Alec Baldwin",
               "profile_path": "/zFtp13AZyPbqbj6yHujPWHO5ioh.jpg",
               "id": 7447,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Dink",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c9967",
               "name": "Andre Braugher",
               "profile_path": "/9VtD8RlQ0urgDKS7B8tR456dW50.jpg",
               "id": 6861,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Pointy",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c996f",
               "name": "Michael Jai White",
               "profile_path": "/zvt4lOlPVVq1MZXmJDWNmBQDnWl.jpg",
               "id": 64856,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Petrone",
               "gender": 1,
               "credit_id": "52fe477cc3a368484e0c9963",
               "name": "Rebecca De Mornay",
               "profile_path": "/riQQkeijtaPIAVhPdCcJFPB4FOA.jpg",
               "id": 28412,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Rodney",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c9973",
               "name": "Ricky Harris",
               "profile_path": "/eJEzFSHTjGdUz1JDThdTR5C1Jrd.jpg",
               "id": 158452,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Riles",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c9977",
               "name": "Robert Miano",
               "profile_path": "/sszrBivDN2Ry0I3vWY5k8CjxYdB.jpg",
               "id": 62715,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Bo",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c997b",
               "name": "Bruce Greenwood",
               "profile_path": "/his8sEwC8FLC4dAxVSu9GNicE6Z.jpg",
               "id": 21089,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Sugar Bear",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c997f",
               "name": "Reginald Ballard",
               "profile_path": "/qXIp0OCsERavYTLQu8pbgIBRdQh.jpg",
               "id": 154096,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe477cc3a368484e0c9983",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ricky",
               "gender": 0,
               "credit_id": "52fe477cc3a368484e0c9987",
               "name": "Louis Crugnali",
               "profile_path": null,
               "id": 102317,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c998b",
               "name": "Richard Edson",
               "profile_path": "/7YegwxrBppretnwGEEMxEI453Ef.jpg",
               "id": 6396,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Capetti",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c998f",
               "name": "David Byrd",
               "profile_path": null,
               "id": 9294,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Maloney",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c9993",
               "name": "Michael Hitchcock",
               "profile_path": "/73p9EPqV8fmjRyYnsFW9iFzuuqH.jpg",
               "id": 75463,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "McNamara",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c9997",
               "name": "Al Sapienza",
               "profile_path": "/rWTWUwOcNj5SsLb9FS3dbseosWv.jpg",
               "id": 154917,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Malcolm",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c999b",
               "name": "Michael Jace",
               "profile_path": "/cnULwB3zzpyBqMoUTkdvtAVnpFH.jpg",
               "id": 46921,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Tenesco",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c999f",
               "name": "Erich Anderson",
               "profile_path": "/t56ZBN67R70Z0I9Jo6P9iALN2Q4.jpg",
               "id": 58813,
               "order": 15
            },
            {
               "cast_id": 29,
               "character": "Kendall",
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c99d3",
               "name": "Bradford English",
               "profile_path": "/gyPUlOvV3hTlnCKnbuLDML8XtYX.jpg",
               "id": 1234009,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c995f",
               "name": "Scott Sanders",
               "profile_path": "/ql1ylERLJr8O4fNPhCf3uQ1YLgx.jpg",
               "id": 92657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe477cc3a368484e0c99a5",
               "name": "Patrick Quinn",
               "profile_path": null,
               "id": 164098,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c99ab",
               "name": "Scott Sanders",
               "profile_path": "/ql1ylERLJr8O4fNPhCf3uQ1YLgx.jpg",
               "id": 92657,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe477cc3a368484e0c99b1",
               "name": "Arthur Krystal",
               "profile_path": null,
               "id": 224847,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe477cc3a368484e0c99b7",
               "name": "Christopher Walling",
               "profile_path": null,
               "id": 1168343,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c99bd",
               "name": "John Pace",
               "profile_path": null,
               "id": 959406,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe477cc3a368484e0c99c3",
               "name": "Christophe Beck",
               "profile_path": "/2fnJUmCk6IEpVIptpYaUk31epHx.jpg",
               "id": 23486,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe477cc3a368484e0c99c9",
               "name": "Denise Pizzini",
               "profile_path": null,
               "id": 38021,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe477cc3a368484e0c99cf",
               "name": "Mary Zophres",
               "profile_path": null,
               "id": 7418,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.421752,
      "production_countries": [],
      "id": 67899,
      "vote_count": 14,
      "budget": 0,
      "overview": "Two master thieves go at odds with one another as one sets the other up for a crime. The first, a suave pro who does his job and then hides in his own privacy, listening to old jazz records and caring for his ailing dog, Wally. The other is a local gangster with a taste for the finer life, who decides to eliminate the competition. This ignites a war between the two men and their aides. An angry mob boss and a female police officer try to sort the mess before things get too out of hand.",
      "similar": [],
      "original_title": "Thick as Thieves",
      "runtime": null,
      "poster_path": "/yMF9FTqUtZTbfnQl13xtR1SBV49.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-04-09",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Sanders"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Patrick Quinn",
         "Scott Sanders"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0147599/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MTAwMTI2N15BMl5BanBnXkFtZTcwNzMwOTYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Mark Adair-Rios, Khandi Alexander, Erich Anderson | See full cast and crew »"],
      "reviews": [
         "This film has a good story, but you have to have a certain appreciation for warped humor to appreciate it. The characters range from mildly unusual to downright peculiar. Pointy (Michael Jai White) is a black crime boss who is trying desperately to be a yuppie, playing golf at the country club, owning a French restaurant and lecturing on culture to anyone who will listen. All this is highly incongruous with the drug dealing, cap-busting realities of his crime syndicate, which makes him a droll and entertaining character. Mackin (Alec Baldwin) is a meticulous thief, who does occasional heists for the Mafia. He is an obsessive collector of vinyl jazz albums and takes his dog on capers because he wants to spend quality time with him. When Mackin does a food stamp heist for Pointy, Pointy double-crosses him. This sets up Mackin's revenge, which encompasses most of the film. The vendetta keeps escalating and the Mafia starts losing patience with both antagonists, introducing a third element into the conflict. The plot has a number of interesting twists and the climax is quite unexpected. First time director Scott Sanders' direction was solid but nothing special. The music, especially the jazz, was excellent. His work with the cast was nicely done, adding a sardonic tone to the entire movie, although I thought at times he got carried away with the disjointed humor. The acting was generally very good. Alec Baldwin's quirky portrayal of this painstaking thief was delightful. Rebecca De Mornay played a very different character than we are used to seeing from her. She was terrific as the tough and impassive cop with an understated and sarcastic wit. However, the best performances were given by Michael Jai White and Andre Braugher. White stole the show with his oh-so-refined mob boss impression. Braugher was great as his cool and calculating lieutenant, with nerves of steel and a brilliant criminal mind. Overall, this was a good crime story that meandered a bit too much from the main plot. I rated it a 7/10. Add a point if you like wry incongruous humor because this film has plenty.",
         "I watched this movie late at night, but I was right wide awake! The movie is a story about a thief who after a successful assignment, escapes a attempt at killing him and seeks for revenge after a black gangster who likes the fine things in live. The movie distinguishes itself from other crime movies because of the humor and the witty and funny dialog. Michael Jai White proves to be a very good actor. I knew him from Spawn, but this role is completely different and he is impressive. Baldwin is a very versatile actor who does great in his role as Mackin the thief. The other roles a nicely casted too. It is a well paced, intelligent humorous gangster movie. Rebecca DeMornay proves that you don't have to have a big role to impress. She reminded me of Frances McDormand in Fargo. I can't understand why I didn't hear about this movie before. An example of gems waiting to be discovered by the audience. I loved it.",
         "\"Thick as Thieves\" is a terrific, fast-paced film with exceptional (and very funny) dialogue. As some of the other reviewers have stated, Michael Jai White is exceptional, but the same can be said about Baldwin and the rest of the cast. How many perfectly putrid or at best mediocre films were released and heavily promoted in 1999 while this little gem was swept under the rug? Watch and listen carefully. You'll be glad that you did.",
         "So I'm visiting my brother's house bored to tears and channel-surfing like crazy. All of the sudden, i catch Thick as Thieves coming on. I had never heard of it and the intro was pretty quirky, so i gave it a shot. This movie is one of those best-keep-secrets that most people don't notice. It's not a comdey per se, and not really an action or a Tarantino-esque movie, it kind stands in its own class. The situations the characters get in and out of are humorous-- not \"LMAO\" funny, just amusingly funny wry. The pacing, casting, the characters, the acting and direction are all top notch and very well fleshed out. So far, anyone i've personally recommended Thick as Thieves to has enjoyed. Hopefully you will, too.",
         "It's good to know from reading the user comments here that others are out there who've seen this film (probably on DVD) and enjoyed it as much as me. I don't recall when or where I bought this movie, or what motivated me to do so, but I'm awfully glad I did. Normally, a film's director is the major force in attracting me to buy a film on DVD. Since I had never heard of Scott Sanders, it surely must have been the presence of so many good actors which influenced me to do so. However, if this man never makes another film, he still has made a significant contribution with this one. The actors execute Sander's tight, fast-paced script superbly, as the film flies by so quickly, I was disappointed it was over. Alec Baldwin as the Mafia-connected thief, Bruce Greenwood as his sarcastic sidekick, a black guy whose name I didn't know, who plays Greenwood's foil and sidekick #2, together form a formidable trio of robbers with great chemistry, and much, much sly humor. Pit them against pseudo-sophisticated gang leader Michael Jai White, carelessly arrogant of his bigotry against the \"Eyetalians,\" his #2, a quietly smooth Andre Braugher, and their entourage of bungling underlings, then throw in the middle, laid-back detective Rebecca De Mornay and you have a great crew to execute all the controlled anarchy which ensues. Great acting all around from these fine people. But, it doesn't stop there. There are three or four more guys and gals, again whose names I didn't know, who make vital acting contributions in sizable roles. This is not a \"funny, ha ha\" type film, but its serious nature is always undermined by subtle comedic touches. If there is a serious weakness in the film, I didn't see it. Director Sanders wrote a great story, recruited a team of top-notch talent, mixed it all together and came out with one great film. I've put myself on notice to see if Scott Sanders shows his face again, but so far ... This film was made in 1998. He has plenty of time, but, c'mon now.",
         "I borrowed this film of a friend who said it was one of the best he'd seen in a long time,at first i wasn't sure what it would be like due to the fact i'd never heard anything about it,but after watching it i was amazed that it hadn't come out at the cinema,this was a truly good film. The movie has a great script with some memorable lines,as well as a good jazz soundtrack,but also an excellent cast who give some of the best performances i've seen in a long time. Michael Jai White is awesome as Pointy Williams,the smooth black Ghetto Gangster who's trying to become an upmarket buisnessman. Praises must be given to Reginald Ballard who plays the hard hitting Sugar Bear who seems to be the main muscle in Pointies operation.But the best performance of the film must be given to Andre Braugher who plays Dink,a streetwise gangster who knows the score and is Pointies right hand man,he reminds me of Isiah Washington playing Mac in Romeo Must Die. If you watch this then you are guaranteed a good nights entertainment.",
         "This ranks up there with \"Freeway\" and \"Truth or Consequences, NM\" as far as pleasant surprises go. Those movies with semi-interesting covers at the video store that you chck out on a whim. The ones you really know nothing about, and sit there slack-jawed half way through the movie wondering if it can really continue to be this good until the end, and then nearly shiz yourself when it actually is. This was one of those. Only I'd first heard about it from the Sundance film guide, and I rented it through Netflix. I knew Alec Baldwin was the main star, but that can be good or bad... that was about it. Now don't go in expecting some kind of The English Patient granduer - just renting the friggin' movie, eat your salty snack, sip your icey beverage, and enjoy a good crime movie. I'd never heard of the director, so I looked him up...Nothing. he's done nothing else, and has nothing in the can. Somebody find this guy, cause he put together a very smooth, nearly perfect movie. Alec was in excellent form. The supporting actors did a hell of a job. The plot AND sub plots were timely and substantial. Just the right amount of humor too. Now I got to wait another year or so for my next pleasant surprise. Rating: A",
         "A crime lord decides to double-cross a professional thief that the higher-ups in his organization hired for a food stamp heist. Naturally, the professional thief evades the trap, but then decides to get even. As things escalate the cops become more and more interested. So do the chiefs of the organization, who realize that all this unwanted attention is bad for business, and finally find themselves having to arbitrate the situation. This is a well made crime movie. The movie starts with a humorous scene featuring a cameo by Janeane Garofalo where she and Alec Baldwin deadpan some lies to each other. This scene doesn't lead to anywhere, but is very hip. The movie goes pretty fast through its story with plenty of smart, breezy dialogue. As always, Alec Baldwin is good, but is outshown by Michael Jai White and Andre Braugher, who play the crime lord and his top lieutenant respectively. White plays a not so bright but vicious crime lord with upwardly mobile aspirations. Braugher hits just the right notes of dismayed resignation as he contemplates his boss' follies. Rebecca DeMornay also has a great character to play - a hard-boiled police detective who has seen it all but remains a half-step behind the action. There are lots of well-crafted minor characters as well. The sound track also deserves a special note (no pun intended). It you've seen all the Tarantino and Tarantino-esque movies, and are looking for more, this movie would fit the bill.",
         "Alec Baldwin gives an edgy performance, not unlike his similar character in \"Miami Blues\", as a professional thief who sometimes works for the Chicago mob. When a deal in Detroit goes bad and he is set up by the local hoods, Baldwin's escalating war of revenge pushes the mob to take appropriate action. Good character development, smart dialog, and an excellent supporting cast, lift \"Thick as Thieves\" well above the usual crime drama. There are unexpected moments of dark humor, intermingled with the not too subtle violence. This smart, action-packed film is far more entertaining than some of Tatantino's supposed \"classics\". Seek it out. - MERK",
         "Like Supercords, I regret that Scott Sanders 's Thick as thieves is the sole movie he wrote/directed up to this day. Not having read the novel, I cannot speak of the respective merits of the book and the screenplay; but the screenplay /direction combination results in a very entertaining, swift-paced, well-knit, and clear movie ( in spite of the intricacy of simultaneous action at three different levels: the mob's, Baldwin's, and the cops'), with many welcome humorous touches ; good editing, then, and good musical score, too. Another asset is the cast, apparently selected with great care, up to the smallest parts: if Michael Jay White and Andre Braugher got rightly-deserved praise, all the players rate from very good to excellent: Alec Baldwin and his sidekicks, Bruce Greenwood ( almost unrecognizable ) and Ricky Harris, mobsters Richard Edson and Reginald Ballard,amusing Janeane Garofalo, quietly effective and attractive Rebecca de Mornay, and little-known but accomplished actor Robert Miano as the deceptively mild-mannered second-in command of the local mafia."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Gigantic Pictures (III)",
         "Moonstone Entertainment"
      ],
      "summaries": ["Two master thieves go at odds with one another as one sets the other up for a crime. The first, a suave pro who does his job and then hides in his own privacy, listening to old jazz records and caring for his ailing dog, Wally. The other is a local gangster with a taste for the finer life, who decides to eliminate the competition. This ignites a war between the two men and their aides. An angry mob boss and a female police officer try to sort the mess before things get too out of hand."],
      "budget": 0
   },
   "movielensId": 27077,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-09",
      "dvdReleaseDate": null,
      "directors": ["Scott Sanders"],
      "runtime": 0,
      "movieId": 27077,
      "title": "Thick as Thieves",
      "mpaa": null,
      "actors": [
         "Alec Baldwin",
         "Andre Braugher",
         "Michael Jai White",
         "Rebecca De Mornay",
         "Ricky Harris",
         "Robert Miano",
         "Bruce Greenwood",
         "Reginald Ballard",
         "Janeane Garofalo",
         "Louis Crugnali",
         "Richard Edson",
         "David Byrd",
         "Michael Hitchcock",
         "Al Sapienza",
         "Michael Jace",
         "Erich Anderson",
         "Bradford English"
      ],
      "imdbMovieId": "0147599",
      "originalTitle": "Thick as Thieves",
      "genres": [
         "Drama",
         "Action",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two master thieves go at odds with one another as one sets the other up for a crime. The first, a suave pro who does his job and then hides in his own privacy, listening to old jazz records and caring for his ailing dog, Wally. The other is a local gangster with a taste for the finer life, who decides to eliminate the competition. This ignites a war between the two men and their aides. An angry mob boss and a female police officer try to sort the mess before things get too out of hand.",
      "tmdbMovieId": 67899,
      "avgRating": 3.16667,
      "releaseYear": "1999",
      "numRatings": 3,
      "posterPath": "/yMF9FTqUtZTbfnQl13xtR1SBV49.jpg"
   }
}