{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "religious",
            "id": 14989
         },
         {
            "name": "biopic",
            "id": 235193
         }
      ],
      "imdb_id": "tt0165196",
      "video": false,
      "title": "Molokai: The Story of Father Damien",
      "recommendations": [],
      "backdrop_path": "/jB1vSfFmRvzv4rKRdWsWevEMMVO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Damien",
               "gender": 2,
               "credit_id": "53e362990e0a262b86003e41",
               "name": "David Wenham",
               "profile_path": "/xDUXLTF5i2fYx7eSEAR3IdaUb9y.jpg",
               "id": 1371,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "53e362a20e0a262b8c003d1b",
               "name": "Jan Decleir",
               "profile_path": "/BXOa9XkagvzafGgdmq0kshR0uG.jpg",
               "id": 13514,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "53e362aa0e0a262b8c003d1f",
               "name": "Kate Ceberano",
               "profile_path": null,
               "id": 592594,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "5a43b444c3a3685916053401",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53e363ac0e0a262b8c003d51",
               "name": "Paul Cox",
               "profile_path": null,
               "id": 939275,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a43b4ea9251411fab069e97",
               "name": "John Briley",
               "profile_path": null,
               "id": 11845,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.786135,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         }
      ],
      "id": 21644,
      "vote_count": 4,
      "budget": 0,
      "overview": "The true story of the 19th century Belgian priest, Father Damien, who volunteered to go to the island of Molokai, to console and care for the lepers.",
      "similar": [
         1495,
         424488,
         324786,
         402529,
         133805,
         335778,
         445040,
         13007,
         159128,
         13787,
         425336,
         448776,
         446132,
         180718,
         429197,
         406181,
         269079,
         498737,
         412204,
         85411
      ],
      "original_title": "Molokai: The Story of Father Damien",
      "runtime": null,
      "poster_path": "/jfNjYkWDsa87022kXuROF0gsvn6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2002-06-20",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Paul Cox"],
      "runtime": 109,
      "synopsis": "Exile to Molokai was the means with which leprosy was dealt with in the Hawaiian Islands during the late 1800s. Molokai was an untamed isle located between the islands of Oahu and Maui. Abandoned for all extents and purposes, the lepers attempted to scrape out a living in their squalor without outside aid or care. Enter the courageous Father Damien. He was the first priest to go to Molokai. And even though his bishop strictly warned him that \"he must not touch anyone,\" Father Damien risked his life and health to reach out to the suffering. Gradually, Father Damien was able to gain the trust of the lepers. Additionally, and more importantly, his cries for additional help were heard and heeded by others. The success of his appeals was unbelievably dismaying to superiors who were more interested respect and riches than reaching out to the suffering. Eventually, as expected Father Damien was also afflicted. This, however, only seemed to provide him with an even greater drive to ameliorate the conditions of his now \"fellow\" lepers. After collapsing during Mass, he was carried to the very hospital that he himself had established where he died. There is a touching scene when all gather to pray for him at the hospital's entrance.",
      "writers": [
         "John Briley",
         "Hilde Eynikel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165196/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzQ2NjYwODE5NV5BMl5BanBnXkFtZTcwMzI2NDcyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: David Wenham, Kate Ceberano, Jan Decleir | See full cast and crew »"],
      "reviews": [
         "This story is quite faithful to the facts of the life of this remarkable Belgian priest who chose to live in a leper colony while still a man in his early 30's even though he knew it to be a permanent assignment and a death sentence. The horrors of the leper colony were conveyed realistically while still giving a focus that would allow all but very young audiences to view it. The bureaucrats, both civil and religious, are well portrayed. -- (Derek Jacobi gives his usual fine performance in one of these roles.) This is a \"must see\" for anyone who has never heard the story of Father Damien or knows little about the leper colony on Molokai.",
         "This was a magnificent film. I had heard that there were some creative differences between director Paul Cox and other people involved in the film. But this does not seem to affect the film in total. I found it a very moving uplifting film that presents the best the human species can aspire to. Like Mother Teresa and Gandhi Father Damian was probably a pain in the rear to the authorities civil and religious. But that is the way of people who are so sure of their beliefs. David Wenham, who is well known to Australian audiences, showed yet again what a talented actor he is. The international actors who provided cameo roles were all excellent, particularly Peter O'Toole. I've enjoyed Paul Cox's films many times over the years. They often win awards but are rarely major box office winners, But he has the ability to present the best of the human experience. He portrays real emotions and real people.",
         "I saw this in a film festival just yesterday. It was not really the sort of film I would go to normally (I'm not really into religious themes in film). I already knew a little of Father Damien's story, and I had a fair idea of how the story would end but I was glad I saw it just the same. I wouldn't say I \"enjoyed\" it because the subject matter was in many ways depressing but in a way it was an inspiring story. It showed what one man can do to improve the lives of 1000-odd suffering people that the rest of the world has all but forgotten. Damien had a will of iron and he needed it to counter the resistance of the government and his superiors in getting the help he needed. If this sort of theme appeals to you I'm sure you will appreciate the film, if you definitely don't like religious themes then it's probably better that you don't see it.",
         "This is an unusual film in our present fashion for films to be about a \"day in the life\" of insignificant people doing insignificant (usually antisocial) things. This is a story told with great compassion and notable expertise. The cast is remarkable for the number of \"stars\" playing minor roles. Paul Cox's films leave you with a greater understanding of the human spirit and this was is one of his best.",
         "This is a surprisingly intimate look at some of Father Damien's experiences, but the dramatic structure of the film is often frustratingly fragmented. Scenes of the authorities on O'ahu struggling with how to deal with the amazing man and his demands on behalf of his community seem to have been shot very hastily, and they fit poorly with the more carefully conceived segments from Moloka'i. Even there, the scenes with Peter O'Toole seem poorly integrated into the progression of the story. Despite the participation of many top-flight actors and actual local victims of Hansen's disease, this film offers only fleeting, tantalizing glimpses of what could have been a tremendously powerful drama of the life of a man who may yet become an actual saint. In isolation, the leading performances are very fine, but the package failed to gel and the film is, finally, only a carefully-drawn series of vignettes.",
         "The fact that this movie was primarily filmed in Kalaupapa on the north shore of our island, does not unduly influence my judgment that this is a very interesting movie. The acting of the \"international\" cast is quite fine. But so is that of my childhood friend, Keanu Kapuni-Szasz, as a young girl who contracts leprosy and later presents a slight temptation to Father Damien. Many, many \"topside\" Molokai residents joined with the few remaining Kalaupapa residents (who have Hansen's Disease) in this production. Viewers will be inspired by their beauty and spirit. Aloha.",
         "We rented the movie this evening after spending today touring the tip of Molokai, Hawaii where this story took place. The movie is an excellent supplement for the tour. Richard Marks, our tour guide, did not tell us that he appears in many scenes throughout the movie. He is the tall man who has his feet wrapped in cloth in many scenes. He told us that the movie existed and some background stories about the movie. Anyone wishing to tour this beautiful site should make sure, in advance, that Richard will be their guide. He is an excellent guide and also one of the people who has Hansen's Disease. He is 72 years old (2002) and a dynamic person.",
         "I knew nothing of Father Damien until I saw this movie, but after seeing it I immediately sought more information on him. I strongly recommend this movie for those who are curious about the saint or have a special devotion to him.",
         "Ok, so we have a Dutch/Belgium production, set & filmed in Hawaii, made by an Australian director with Australian, British & American actors. You can't accuse this film of not being an international concern! Solid acting performances by many involved, especially Jacobi, Wenham & O'Toole. Sadly the script lacks depth in many areas, had the director & producers had not been at loggerheads through most of the shoot, this could have been dealt with. Interestingly, Paul Cox still holds some bitterness over this. In a recent interview on the Australian TV channel, Showtime, Cox admitted the film was about 80% of what it could have been if he had his way & that there are too many \"idiots\" running the industry. Not a great film but not bad either, worth checking out but could have been a more indepth film.",
         "This was an almost unrealistically ambitious co-production between Belgium and a whole bunch of other countries, but the many different sources of interference don't hurt the finished product as much as I thought it would. More funding brings more supplies, and that shows. Paul Cox may not be a particularly skilled director, but his country does appear to have a lot of money so it evens out. The visual style to this movie looks really professional, sometimes it'll give you a made for TV-vibe, but that will just be a sporadic feel. The screenplay has some pacing problems, but that doesn't mean it's slow. It just keeps randomly changing in pace, which isn't nearly as exciting as you'd think. There are bunches of scenes where there's nothing happening, but when father Damien ends up contracting leprosy, the movie suddenly looks like it's sick of itself and just takes every possible shortcut to the ending. I do like that very last line though, as corny as it may be, and it is very corny. The biggest plus this movie has is the performance by David Wenham. Hiring an Australian guy to play Damien sounds like the worst idea ever, but he's really authentic. He's pretty much why I kept watching. This movie is fairly well-made, but there's room for improvement."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Era Films",
         "Jos Stelling Filmprodukties BV",
         "Kinepolis Film Productions"
      ],
      "summaries": ["The true story of the 19th century priest who volunteered to go to the island of Molokai, to console and care for the lepers."],
      "budget": 7436800
   },
   "movielensId": 27135,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-06-20",
      "dvdReleaseDate": "2008-02-14",
      "directors": ["Paul Cox"],
      "runtime": 0,
      "movieId": 27135,
      "title": "Molokai: The Story of Father Damien",
      "mpaa": null,
      "actors": [
         "David Wenham",
         "Jan Decleir",
         "Kate Ceberano",
         "Sam Neill"
      ],
      "imdbMovieId": "0165196",
      "originalTitle": "Molokai: The Story of Father Damien",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The true story of the 19th century Belgian priest, Father Damien, who volunteered to go to the island of Molokai, to console and care for the lepers.",
      "tmdbMovieId": 21644,
      "avgRating": 3.71429,
      "releaseYear": "2002",
      "numRatings": 7,
      "posterPath": "/jfNjYkWDsa87022kXuROF0gsvn6.jpg"
   }
}