{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0192455",
      "video": false,
      "title": "Picking Up the Pieces",
      "recommendations": [
         85547,
         76080,
         16405,
         253259,
         38986,
         40546,
         68247,
         78229,
         241432,
         23312,
         31016,
         24214,
         79610,
         15148,
         41156,
         23270,
         48375,
         45608,
         43714,
         40798
      ],
      "backdrop_path": "/iwpGvaHUORUg0ezS1fwH1I7KUbO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Tex Cowley",
               "gender": 2,
               "credit_id": "52fe449e9251416c9101711f",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Candy Cowley",
               "gender": 1,
               "credit_id": "52fe449f9251416c91017123",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Dr. Amado",
               "gender": 2,
               "credit_id": "52fe449f9251416c91017127",
               "name": "Alfonso Aráu",
               "profile_path": "/Agw6LyoGlrfJaBvTOQYzdxwUWHh.jpg",
               "id": 22767,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "CNN Reporter",
               "gender": 2,
               "credit_id": "52fe449f9251416c9101712b",
               "name": "Brian Brophy",
               "profile_path": "/5gBklXXdZqJrvdfrwpOoZYSQXlJ.jpg",
               "id": 48587,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Desi",
               "gender": 1,
               "credit_id": "52fe449f9251416c9101712f",
               "name": "Maria Grazia Cucinotta",
               "profile_path": "/bgI6qh8V7zKslCcGxRflom4H7yS.jpg",
               "id": 10777,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mayor Machado",
               "gender": 2,
               "credit_id": "5416338ec3a3684cf70032f3",
               "name": "Cheech Marin",
               "profile_path": "/efuXbXg7JpORy5hPDU7Zityq3k3.jpg",
               "id": 11159,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Father Leo Jerome",
               "gender": 2,
               "credit_id": "541633a70e0a261c2e00341e",
               "name": "David Schwimmer",
               "profile_path": "/aOW62VZJMGXjiPvwP43xCHS9X4r.jpg",
               "id": 14409,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Officer Bobo",
               "gender": 2,
               "credit_id": "5416380b0e0a261c2a003509",
               "name": "Kiefer Sutherland",
               "profile_path": "/4YvDfOfD4TgyzDkLGoq76g5BZNe.jpg",
               "id": 2628,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Father Buñuel",
               "gender": 2,
               "credit_id": "54163823c3a3684cef003332",
               "name": "Andy Dick",
               "profile_path": "/ebNRu8oV7Ifv5aoP23UyNnx0lZS.jpg",
               "id": 43120,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Sister Frida",
               "gender": 1,
               "credit_id": "5416383a0e0a261c2e0035cb",
               "name": "Fran Drescher",
               "profile_path": "/vQxr8CRgyDkH3GTFLwacs9W9tF4.jpg",
               "id": 53122,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Officer Alfonso",
               "gender": 2,
               "credit_id": "5416386b0e0a261c35003460",
               "name": "Lou Diamond Phillips",
               "profile_path": "/afXcQRss7rZ6Ocx7PUQFbz7tPOm.jpg",
               "id": 38560,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Flaco",
               "gender": 2,
               "credit_id": "5416389cc3a3684d06003549",
               "name": "Joseph Gordon-Levitt",
               "profile_path": "/zSuXCR6xCKIgo0gWLdp8moMlH3I.jpg",
               "id": 24045,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Sediento",
               "gender": 2,
               "credit_id": "541638af0e0a261c2700356d",
               "name": "Eddie Griffin",
               "profile_path": "/jgz5HDtC3aXYXBSULqay1PKWQOL.jpg",
               "id": 62842,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Conchata Ortiz",
               "gender": 1,
               "credit_id": "5771784392514145c300044d",
               "name": "Daisy White",
               "profile_path": "/q3HeEAxBLKMeOBJCtsSZlHjHccD.jpg",
               "id": 1292871,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c91017115",
               "name": "Alfonso Aráu",
               "profile_path": "/Agw6LyoGlrfJaBvTOQYzdxwUWHh.jpg",
               "id": 22767,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe449e9251416c9101711b",
               "name": "Bill Wilson",
               "profile_path": null,
               "id": 108430,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5373794d0e0a267c6e001908",
               "name": "Vittorio Storaro",
               "profile_path": "/4QuZy1Y5TEqSeo3GM3FJYrRM0Xa.jpg",
               "id": 7202,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 5.307038,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31774,
      "vote_count": 32,
      "budget": 0,
      "overview": "A small New Mexican village discovers a severed hand that is considered a miracle of God, when it actually belongs to a murdered spouse with a husband in search of it.",
      "similar": [],
      "original_title": "Picking Up the Pieces",
      "runtime": 95,
      "poster_path": "/pUUh4NsJ1QRLfcO7TupzUsxFvxP.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2000-05-26",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alfonso Arau"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Bill Wilson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0192455/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwMjY1ODI1N15BMl5BanBnXkFtZTcwNTI4ODQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Woody Allen, David Schwimmer, Angélica Aragón | See full cast and crew »"],
      "reviews": [
         "I watched this movie on Cinemax in stunned silence. It contains some of the most sophomoric writing and cheapest sight gags one can imagine outside of a frat-house revue. Throughout the film, both Woody Allen and Sharon Stone keep fixed and glazed grins on their faces, as if they can hardly believe they're saying these horrible lines. That this cast and this director would produce this travesty passes all understanding. The problem isn't the subject matter (hey, I'm all for irreverent treatment of organized religion!), it's that the plotting and the execution leave you wishing you'd spent the last two hours jabbing straight pins into the back of your hand. Or, perhaps, your eyes. It is a film without charm, without wit, without subtlety, without surprise. Your move.",
         "The bawdy, crass jokes and lowbrow humor employed in Bill Wilson's script work in his story about a kosher butcher who catches his unfaithful wife in the act and is driven to homicidal maniacal behavior. From the gags involving a permanently frozen hand with its middle finger extended, to the obvious dialog quips, this movie is highly entertaining, with Farrelly/Coen Brothers influences. The impressive cast executes all the silliness with great ease and skill. Woody Allen's characteristically droll performance makes an interesting backdrop against the film's New Mexico locale. Despite the obvious nature of the story, Director Alfonso Arau's use of visual realism lends to it's contrasting irony. Arau's style is reminiscent of some of Mexico's better comedies celebrating the culture through humorous eyes.",
         "\"Picking Up the Pieces\" is a black comedy involving a gruesome murder, but without explicit violence. It's darkly satiric comments on religion are the centerpiece, with a powerfully expressive focus in the corpse's hand itself. Alfonso Arau has made a small gem of a movie, not to everyone's taste, but hilarious to many. The acting is quite good throughout. Kiefer Sutherland, as the villainous, red-neck cop perhaps overdoes it a bit, but it is satire. David Schwimmer, as a small-town New Mexican priest in love with a local prostitute and whose church is in financial trouble, is exceptionally good. And Sharon Stone (unrecognizable as the super-promiscuous wife of Woody Allen's butcher) is excellent as a woman whose final victimhood allows her redemption from a life of sin. Three and a half Stars. Check it out",
         "\"Picking Up the Pieces\" is one of those nonsense stories that gets morphed into something really neat. In this case, Sheriff Tex Cowley (Woody Allen) tries to bury the body of his wife, but accidentally leaves her hand above the ground. I should identify that her hand has the middle finger sticking out. When a blind woman stumbles upon the hand, she regains her vision, and then the hand starts performing all sorts of miracles. Yes, it's a totally outlandish idea, but they do some really funny stuff with it. I especially liked the scene with \"Ortiz\". One might say that this movie looks at the interconnectedness of everything. Maybe. But overall, I'd say that it's an excuse to have fun. And it sure is something to see Woody Allen in a small Texas town. Also starring Sharon Stone, Cheech Marin, David Schwimmer, Maria Grazia Cucinotta, and Kiefer Sutherland.",
         "Maybe it's just the mood I'm in but after a failed first attempt at viewing this film (lasted about 10 minutes) I just finished seeing the \"hole\" thing and thought \"what a great WA film ala the pre-serious Woody phase that he didn't write! This film was obviously not done with the BIG audience in mind, but out of love for the absurd to a sublime degree. Over the top puns abound in a truly profound way. Like for instance, \"You can save your ass, or you can save your soul. But you can't save both. You choose, ass....soul...etc.,etc. I can't believe the many stars in this cast (albeit off-ctr types) did this for the money, so they must have had a blast making it. And c'mon folks, tell me you didn't love to see Kieffer hung up and beaten like a pinata with fireworks going off on his body. I hven't seen cast interviews, so I'm not as informed as some of the commenteers here are, but the overall message (last words of Woody)of this movie is not to be ignored: \"f__k em if they can't take a joke\". Yeah, the production was cheezy, but it fit so well. The patchwork editing just may have been intentional.... I can easily see how people panned this film. But, no offense intended, maybe you take yourself a bit too seriously. PS: the quip about Jesus' party getting out of hand _was_ Lenny Bruce's comment as stated by Woody in the film. Ahhhhhh",
         "This movie was interesting. I love Woody, and the cinematography was quite, quite excellent, yet the film failed to get me involved. The script, although pretty original, ultimately failed because of its lack of structure. I would hasten to say (and I haven't checked yet) that whoever wrote this was a first timer. The story of the miracle hand was suitable idea, yet I felt more could have been done with it. In addition, the direction (from a director I admire) was sloppy. Much of the acting (Fran Drescher???) seemed less then inspired, although Woody Allen was (and always is) very good comedically. Stone was ok in her brief appearance, and David Schwimmer, although HORRIBLY MISCAST as a priest, (could he be ANY more Jewish?) worked. I think my major problem with the movie was a seeming lack of professionalism, which isn't to say it was bad by any strech of the imagination. Watching a movie like this, you sort of have to suspend your disbelief. Any attempt to take it seriously would ruin the movie (apparently much of the cast and crew didn't take the project seriously) ANYWAY...tough call on this, but 6/10 is my vote~",
         "I am a big Woody Allen fan and greatly admire his early films, up to and including Annie Hall. The only two post A.H. films I have enjoyed are \"Curse of the Jade Scorpion\", and this one, \"Picking Up the Pieces\". There are moments of the old Woody here that have been missing in many of his more recent efforts. He should venture out of his \"New York City comfort zone\" more often. The movie is not perfect, and could / will offend some. I really liked the neon lighting, which in no small way reminds me of \"Vamp\". Do not let the one star ratings steer you away from \"Picking Up the Pieces\", because it is well worth a peek, and especially for those W.A. fans who yearn for the 1970s Woody. - MERK",
         "Anyone taking personal offense from this is missing the point.Maybe films like this should be labeled \"Warning;some people may be religiously offended by this material\". Actually it is another flawed gem of Allen's, an above average black comedy with great spiritual irony and very entertaining as well.Definitely worth seeing for Woody Allen fans and more.",
         "I am surprised at what poor reviews this film has gotten. I myself liked it very much. It's very irreverent, very politically incorrect, and I can see where it would offend a lot of people. However, I didn't think it was mean-spirited at all, and it encourages us to think about our faith and what spirituality means to us. I enjoyed seeing Woody Allen out of his comfort zone--wearing Western clothes, and as a character named \"Tex\"--and, although I am sure that this film didn't make much money, I thought it was adorable. I hesitate to recommend it, though, since it is a very very dark comedy. One of the cast members (I think Fran Drescher) compared it to \"It's A Mad Mad Mad Mad World.\" I would definitely avoid it if you're offended by anyone poking fun at religion.",
         "This is not mass pop entertainment, but a massive Bunuelian romp by a major director, with lots of name-brand, off-kilter stars. It has its highs and lows, but all-in-all it's an intriguing concoction. Just the feat of getting Woody Allen out of NY and into the desert to play a character named \"Tex\" is worth seeing. Throw in some great Woody Allen gags (\"We Jews didn't intentionally kill Jesus, it was just a party that got out of hand\"), a mad trio of investigators from the Vatican (Elliot Gould, Fran Drescher, Andy Dick), and a mayor played by Cheech Marin, and you've a pinata of surprises and fun. It's definitely worth capturing on your TiVo."
      ],
      "genres": [
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Comala Films Productions",
         "Kushner-Locke Company, The",
         "Ostensible Productions"
      ],
      "summaries": [
         "Woody Allen plays Tex, a kosher butcher. Sharon Stone plays his unfaithful wife Candy. Tex catches Candy in the act and in a fit of rage he kills her. To conceal his crime he cuts up her body and buries it in the desert in New Mexico. However, when her hand surfaces, a blind woman trips over it and it restores her sight. The hand is then considered to be the \"hand of the Virgin.\" Despite the church's fallen priest objecting, the ambitious mayor of the town creates an international three-ring circus of miracle-seekers, TV crews, and born-again local prostitutes all interested in the hand. All of this goes on while Tex is desperately trying to recover the hand before the sheriff finds it and uses it as evidence against him.",
         "American-born Tex Cowley is a average-looking male who operates a butcher-shop for a living. Despite of his looks, his wife, Candy, is gorgeous, and he is smitten with her. His world crashes around him when he sees her with another male, a police officer by the name of Bobo. After a confrontation, he kills her. Then using his meat-shop knives, he slices her up, puts her remains in the back of his pick-up truck, and buries her remains in the New Mexico desert, little realizing that some parts of his former wife's anatomy had fallen from the truck, and one part, her hand with the middle-finger raised in salute, will soon be displayed in a church-yard, miracles will occur, and Candy's hand will be worshiped as the hand of the virgin Mary.",
         "A small New Mexican village discovers a severed hand that is considered a miracle of God, when it actually belongs to a murdered spouse with a husband in search of it."
      ],
      "budget": 0
   },
   "movielensId": 27213,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2000-05-26",
      "dvdReleaseDate": "2000-10-17",
      "directors": ["Alfonso Aráu"],
      "runtime": 95,
      "movieId": 27213,
      "title": "Picking Up the Pieces",
      "mpaa": "R",
      "actors": [
         "Woody Allen",
         "Sharon Stone",
         "Alfonso Aráu",
         "Brian Brophy",
         "Maria Grazia Cucinotta",
         "Cheech Marin",
         "David Schwimmer",
         "Kiefer Sutherland",
         "Andy Dick",
         "Fran Drescher",
         "Lou Diamond Phillips",
         "Joseph Gordon-Levitt",
         "Eddie Griffin",
         "Daisy White"
      ],
      "imdbMovieId": "0192455",
      "originalTitle": "Picking Up the Pieces",
      "genres": [
         "Comedy",
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": ["e9OJdNQdLoc"],
      "plotSummary": "A small New Mexican village discovers a severed hand that is considered a miracle of God, when it actually belongs to a murdered spouse with a husband in search of it.",
      "tmdbMovieId": 31774,
      "avgRating": 2.5,
      "releaseYear": "2000",
      "numRatings": 15,
      "posterPath": "/pUUh4NsJ1QRLfcO7TupzUsxFvxP.jpg"
   }
}