{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "germany",
            "id": 74
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "holocaust",
            "id": 1739
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "prejudice",
            "id": 10360
         },
         {
            "name": "nazi germany",
            "id": 11064
         },
         {
            "name": "human rights",
            "id": 18339
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "third reich",
            "id": 161256
         },
         {
            "name": "lgbt history",
            "id": 173504
         }
      ],
      "imdb_id": "tt0236576",
      "video": false,
      "title": "Paragraph 175",
      "recommendations": [
         35849,
         42669
      ],
      "backdrop_path": "/wd20Q4EnOGFWU3XZ2jWM90m2PWe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Narrator",
            "gender": 2,
            "credit_id": "52fe47a0c3a36847f813fd87",
            "name": "Rupert Everett",
            "profile_path": "/jGTaV5htTRo2T0aeM2eoHZcpLG4.jpg",
            "id": 4757,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a36847f813fd8d",
               "name": "Rob Epstein",
               "profile_path": "/2Dt2pa7G45FOedK281eCplnLNOS.jpg",
               "id": 109402,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a0c3a36847f813fd93",
               "name": "Jeffrey Friedman",
               "profile_path": null,
               "id": 109403,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47a0c3a36847f813fd99",
               "name": "Sharon Wood",
               "profile_path": null,
               "id": 125820,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 2.810277,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 49671,
      "vote_count": 7,
      "budget": 0,
      "overview": "During the Nazi regime, there was widespread persecution of homosexual men, which started in 1871 with the Paragraph 175 of the German Penal Code. Thousands were murdered in concentration camps. This powerful and disturbing documentary, narrated by Rupert Everett, presents for the first time the largely untold testimonies of some of those who survived.",
      "similar": [
         449176,
         184352,
         376867,
         424,
         1966,
         289222,
         26280,
         428493,
         9045,
         338189,
         351339,
         1771,
         1213,
         423,
         914,
         228150,
         398818,
         258480,
         26371,
         11000
      ],
      "original_title": "Paragraph 175",
      "runtime": 81,
      "poster_path": "/jpWAael8IHvFJe50WZ1dTOY1kip.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Channel Four Films",
         "id": 181,
         "origin_country": "GB"
      }],
      "release_date": "2000-01-22",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Rob Epstein",
         "Jeffrey Friedman"
      ],
      "runtime": 81,
      "synopsis": "Actor Rupert Everett provides the narration for this disquieting documentary that shines a light on the Third Reich's vicious persecution of male homosexuals during World War II. The title comes from an arcane, 1871 German statute making sodomy punishable by incarceration (with the ultimate goal to eradicate gays completely). Only a handful of survivors -- now frail and withered -- remain to recount their traumatic tales in this poignant film.",
      "writers": ["Sharon Wood"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0236576/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0ODYwMTU0OF5BMl5BanBnXkFtZTcwMTczMTEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Rupert Everett, Klaus Müller, Karl Gorath | See full cast and crew »"],
      "reviews": [
         "I was a bit put off by some of the negative comments, but it is always interesting to then view a film which is praised by some and despised by one or two. As is often the case, the negative views turn out to be more a reflection of personality rather than of serious critical scholarship. Putting together this film was hardly a snap. There are only a handful of survivors still alive and living in central Europe, and some refused to appear in the film. I think the film-makers were very successful in capturing the essence of the homosexual experience during the Nazi times and beyond, as reflected in the footage they obtained from the six or seven survivors who were willing to share their stories on camera. We really don't need any more \"education\" on Nazi legal machinations or conditions in concentration camps. We ARE interested in the experiences and emotions of these particular people, to see them and hear them, before they are swallowed by the inexorable march of time. The film performs this invaluable service and does it well. The interviews are interspersed with a general historical summary of events and their effect on the gay community in Germany during the years between the two great wars, and later on. Yes, these parts may resemble a special on the History Channel. Nothing wrong with that! All in all, a very professional job and a solid achievement.",
         "This film is fantastic. What a powerful 80 minutes of film. It was so informative and emotional without shoving anything down your throat. The way the delicate and sensitive subject matters were handled was graceful and respectful. Kudos. It made me feel angry, sad, and compassion for the people that are struggling to voice their stories without making a fiasco out of what happened to them. Like so many other documentaries, this one did not try and play with my emotion with overly sappy music or editing. It was simple and precise. The music was haunting and had the perfect mood for the piece. The interviews were not overly edited for dramatic effect, but were simple and honest. I watched it twice. Cried both times. And I feel more educated and compassionate for renting this great film.",
         "The concentration camp survivors interviewed in this documentary broke my heart... hearing the man who saw his best friend eaten by German Shepards... and the gay man who courageously freed his Jewish lover, only to see his lover act even more courageously by choosing to return to his sick family, to die together with them. These stories are real, they are devastating, and they MUST be seen by everyone.",
         "I agree that this is an excellent film. One has to admire the willingness of these men to tell their story after so many years. Paragraph 175 remained as a law in the German Penal Code until the 1970s, which is why the gay survivors were not given the same reparations that other survivors received. I saw this film on cable and am planning to get a copy on DVD. However, a previous comment incorrectly stated that this was the first film on this subject in 67 years. There was an earlier film which interviewed gay male Holocaust survivors. The title is \"We Were Marked With a Big Red A.\" I do not see it listed in IMDb, but I have it on VHS. I purchased it in the bookshop at the U.S. Holocaust Museum in Washington. I think that Klaus Müller, who is a consultant to the Holocaust Museum, was also on the crew of this film.",
         "I have seen the movie yesterday and was quite moved by it. I did not expect much (because usually I am not the documentary type), but the mixture of old film footage and photos (with some 20s and 30s music) and interviews of a few of the survivors (7 homosexualls, 1 lesbian) was very interesting. The big thing about this movie is to get to know about what happened in that time, because no one spoke about this when we were talking about the second world war in history class. it is unbelievable that the paragraph 175 existed even till 1969. this is a must-see film !",
         "Paragraph 175 is a powerful documentary that deals with a provocative subject. I just wish filmmakers Jeffrey Friedman and Rob Epstein had fleshed out the subject a bit more. While this film about gay men who were persecuted and imprisoned under the Nazi regime, is in many respects absorbing, the film ultimately suffers from an overly narrow and constricted focus. Perhaps the problem was that there were just not enough men alive today who were willing to talk about their experiences. From the outset, the pool of interviewees was certainly going to be limited, but also limited is the actual archival footage of life in the concentration camps. Instead the directors have chosen to pepper the film with well-preserved family photographs, and lively footage of gay and lesbian culture blossoming during the days of the Weimar Republic after WW1. Sensitively narrated by British actor Rupert Everett, Paragraph 175 is all about the German penal code, which was originally enacted in 1871, and later used by the Nazis, to outlaw homosexuality. The penal code stated: \"An unnatural sex act committed between persons of male sex is punishable by imprisonment; the loss of civil rights may also be imposed,\" But Paragraph 175 was never really enforced until the Nazi's came to power. This documentary centers on six emotional accounts of the most elderly and frail survivors of the concentration camps who, up until now, have repressed their stories. There's a Jewish gay resistance fighter who posed as a Hitler Youth member to rescue his lover from a Gestapo transfer camp in an ultimately futile effort; a photographer who was arrested and imprisoned for homosexuality, who upon his release joined the army because of the lack of men in his hometown and he \"wanted to be with men.\" There's a young man who was freed from a sentence at Dachau only to be interned again at Buchenwald, and a Frenchman imprisoned from Alsace, who breaks down after telling of being raped and subject to inhuman torture. Their stories are indeed heart wrenching, because unlike the Jews, they have forced to live quietly, unable to share their horrific experiences for so long. It is interesting to note that the penal code didn't cover lesbians. The Nazis considered lesbians to be \"curable.\" Women were regarded, as vessels of motherhood - increasing the German population was top priority - therefore, they were exempt from mass arrest. Most lesbians went into exile or quietly married gay men. One woman, who tells her story in the film, was given exit papers and was lucky enough to escape to England. The statistics are staggering: Between 1933 and 1945, some 100,000 men were arrested for homosexuality, roughly half of them were sentenced to prison, and from 10,000 to 15,000 were sent to concentration camps. The camps were used for re-education, slave labor, castration and sadistic medical experiments. It's believed only about 4,000 survived their ordeal. The situation didn't improve after the war. Paragraph 175 remained in force until the late sixties, so many gay men were re-imprisoned and subject to repeated persecution. In this respect, Epstein and Friedman should be largely commended for bringing this subject to the attention of the world, and telling these powerful personal stories before the last survivors die. Mike Leonard September 05",
         "The golden days of decadent Berlin came to a bloody halt when Hitler's regime took over Germany in the early 1930s and gay men were brought down by simple innuendo and gossip (lesbianism was considered curable, but male homosexuality was \"catching\"). Early talk of homosexuality in Hitler's ranks precipitated the reinsertion of Paragraph 175, an old anti-sodomy law from the late 1800s, and gays were branded with the lowly Pink Triangle. Forceful documentary on a little talked-about chapter of history has just a handful of elderly witnesses but a superlative presentation of personally-shot footage mixed with telling photographs. Some of the recollections are haunting; the doomed come back to life in these harrowing stories. *** from ****",
         "PARAGRAPH 175, which premiered in the US (outside of Sundance) last night at the Miami Gay and Lesbian Film Festival, is must-see viewing. When one thinks how many documentaries have been made about the Nazi oppression of Jews, Roma (formerly known as Gypsies), and other groups, it is almost inconceivable that it is only in the year 2000, 67 years after the Nazi persecution of male homosexuals started (in 1933), that a documentary on the subject is finally released. It was high time this happened. This documentary about the terrible fate of this population group aims to inform the general public, and does so well. It is aided by the excellent commentary voiced by openly gay actor and part-time Miami resident Rupert Everett. If it is shown anyplace near you, see it. It might be the only opportunity to do so, unless it is later distributed in video or DVD.",
         "This film is an excellent example of letting people tell their story without embellishing the contextual situation. The extra material added to the interviews is perfectly balanced to put the interviews in their historical and personal context, without unduly expanding the context to overshadow what the (very few) survivors had to tell. Enough information is given about paragraph 175 and it's application during Hitler's reign and after for us to get an insight of its consequences, and the situation of denial of our 'civilised' western countries even today regarding the gay victims of this horror. But the focus is on the survivors' tale, not the context. This technique (too rarely applied) produced an extremely powerful documentary. I have seldom seen such a well balanced work.",
         "If you are gay, lesbian, or simply sympathetic to the lives and struggles of gays and lesbians, you must watch this film. It is the story of gays and although briefly, lesbians, during the early Pre-WWII years and also during the war. Although I had heard of the \"pink triangle\" used by the Nazi's during the war, I had never heard any information about victims of Nazi persecution against homosexuals. Ever. Until now I was in the dark. I shall forever be grateful to the producers, director, and survivors who shared their deeply personal stories, each unique, yet all with a common thread; one of having survived as homosexuals and lesbians during the Nazi era in Germany. The stories are real, the people are real, and the emotions which are displayed and which will be brought forth in you, are real. It is impossible to be a human being, and not be struck deep inside by the faces and stories of these people. Remarkably, even some of the survivors eventually became members of the German Army during the war themselves, so in no means is this a whitewashed film nor is it seen only through rose colored glasses. This is documentary cinema at its very finest. Emotional, insightful, raw, and human in every sense of the word. Do not miss this film!"
      ],
      "genres": [
         "Documentary",
         "History",
         "War"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Cinemax",
         "HBO Theatrical Documentary"
      ],
      "summaries": [
         "By the 1920's, Berlin had become known as a homosexual eden, where gay men and lesbians lived relatively open lives amidst an exciting subculture of artists and intellectuals. With the coming to power of the Nazis, all this changed. Between 1933 and 1945 100,000 men were arrested for homosexuality under Paragraph 175, the sodomy provision of the German penal code dating back to 1871. Some were imprisoned, others were sent to concentration camps. Of the latter, only about 4,000 survived. Today, fewer than ten of these men are known to be living. Five of them have now come forward to tell their stories for the first time in this powerful new film. The Nazi persecution of homosexuals may be the last untold story of the Third Reich. Paragraph 175 fills a crucial gap in the historical record, and reveals the lasting consequences of this hidden chapter of 20th century history, as told through personal stories of men and women who lived through it: the half Jewish gay resistance fighter who spent the war helping refugees in Berlin; the Jewish lesbian who escaped to England with the help of a woman she had a crush on; the German Christian photographer who was arrested and imprisoned for homosexuality, then joined the army on his release because he \"wanted to be with men\"; the French Alsatian teenager who watched as his lover was tortured and murdered in the camps. These are stories of survivors -- sometimes bitter, but just as often filled with irony and humor; tortured by their memories, yet infused with a powerful will to endure. Their moving testimonies, rendered with evocative images of their lives and times, tell a haunting, compelling story of human resilience in the face of unspeakable cruelty. Intimate in its portrayals, sweeping in its implications, Paragraph 175 raises provocative questions about memory, history, and identity.",
         "Historian Klaus Müller interviews survivors of the Nazi persecution of homosexuals because of the German Penal Code of 1871, Paragraph 175."
      ],
      "budget": 0
   },
   "movielensId": 27322,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch"
      ],
      "releaseDate": "2000-01-22",
      "dvdReleaseDate": "2002-07-23",
      "directors": [
         "Rob Epstein",
         "Jeffrey Friedman"
      ],
      "runtime": 81,
      "movieId": 27322,
      "title": "Paragraph 175",
      "mpaa": "PG-13",
      "actors": ["Rupert Everett"],
      "imdbMovieId": "0236576",
      "originalTitle": "Paragraph 175",
      "genres": [
         "History",
         "Documentary"
      ],
      "youtubeTrailerIds": ["i4SfaW708xY"],
      "plotSummary": "During the Nazi regime, there was widespread persecution of homosexual men, which started in 1871 with the Paragraph 175 of the German Penal Code. Thousands were murdered in concentration camps. This powerful and disturbing documentary, narrated by Rupert Everett, presents for the first time the largely untold testimonies of some of those who survived.",
      "tmdbMovieId": 49671,
      "avgRating": 3.54545,
      "releaseYear": "2000",
      "numRatings": 11,
      "posterPath": "/jpWAael8IHvFJe50WZ1dTOY1kip.jpg"
   }
}