{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "yakuza",
            "id": 1794
         },
         {
            "name": "gangster",
            "id": 3149
         }
      ],
      "imdb_id": "tt0239655",
      "video": false,
      "title": "Monday",
      "recommendations": [
         36221,
         104277,
         38013,
         16976,
         36867,
         54858,
         86823,
         8468,
         47748,
         74657,
         73832,
         27245,
         42565,
         183784,
         42368,
         61738,
         13798,
         8898,
         11315,
         82576
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Koichi Takagi, the salaryman",
               "gender": 2,
               "credit_id": "52fe45d89251416c9104059d",
               "name": "Shinichi Tsutsumi",
               "profile_path": "/fmyk4NPuSgdOTgkMzhEfsCok1dz.jpg",
               "id": 58596,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Yuko Kirishima, the yakuza girl",
               "gender": 1,
               "credit_id": "52fe45d89251416c910405a1",
               "name": "Yasuko Matsuyuki",
               "profile_path": "/kdp60RVaTuDW9Ove4F4NaPoP9GV.jpg",
               "id": 127892,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mitsuo Kondo, the dead man",
               "gender": 2,
               "credit_id": "52fe45d89251416c910405a5",
               "name": "Masanobu Ando",
               "profile_path": "/nrOOXnq0fpGIBp2ld1FmMj3T4BI.jpg",
               "id": 74862,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Shingo Kamiyama, strange man of the bar",
               "gender": 0,
               "credit_id": "52fe45d89251416c910405a9",
               "name": "Hideki Noda",
               "profile_path": null,
               "id": 1180893,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kiichiro Hanai, boss of the yakuzas",
               "gender": 0,
               "credit_id": "52fe45d89251416c910405ad",
               "name": "Akira Yamamoto",
               "profile_path": null,
               "id": 1168781,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Yuki Machida, Koichi's girlfriend",
               "gender": 1,
               "credit_id": "52fe45d89251416c910405b1",
               "name": "Naomi Nishida",
               "profile_path": "/xjujoH3S0S7Sb2KN4XrvM8kw9VB.jpg",
               "id": 66153,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe45d89251416c910405b5",
               "name": "Hijiri Kojima",
               "profile_path": "/3s6nAw7C37uJRtIuOtYWzD0Gplo.jpg",
               "id": 228075,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "52fe45d89251416c910405b9",
               "name": "Yoji Tanaka",
               "profile_path": "/uyr22UoXuPgG5iYsK7LDydf4YWG.jpg",
               "id": 115659,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "52fe45d89251416c910405bd",
               "name": "Susumu Terajima",
               "profile_path": "/oZPxC2TvOu9DeeVUg38P043ItpJ.jpg",
               "id": 4990,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "52fe45d89251416c910405c1",
               "name": "Kanji Tsuda",
               "profile_path": "/5SF6Pb7axi78uknOGWB0eF4Beam.jpg",
               "id": 13256,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "52fe45d89251416c910405c5",
               "name": "Nanako Okochi",
               "profile_path": "/eUi4s12EvtoxvGS4Z3JW77r82bc.jpg",
               "id": 1009983,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "52fe45d89251416c910405c9",
               "name": "Nao Omori",
               "profile_path": "/diWmt4sCQSMeBcZg2sQXqb1d7kd.jpg",
               "id": 58604,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Murai Yoshio, the colleague",
               "gender": 2,
               "credit_id": "52fe45d89251416c910405cd",
               "name": "Ren Osugi",
               "profile_path": "/AtITnpwCJXRxaO0K2kKcDYeef7o.jpg",
               "id": 137029,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "54c3e0c19251412489006131",
               "name": "Natsuo Ishido",
               "profile_path": null,
               "id": 1402854,
               "order": 13
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45d89251416c91040599",
            "name": "SABU",
            "profile_path": "/qNjgqL33xBtkEJfW51G2Cc08pu6.jpg",
            "id": 58614,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.71787,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 36246,
      "vote_count": 25,
      "budget": 0,
      "overview": "A simple funeral turns a man's world upside down.",
      "similar": [
         156022,
         2069,
         10651,
         8012,
         769,
         154400,
         64689,
         7516,
         2252,
         186,
         24,
         1422,
         9366,
         245891,
         241554,
         324542,
         9462,
         238,
         261023,
         34851
      ],
      "original_title": "MONDAY",
      "runtime": 100,
      "poster_path": "/1WJKsMLzMq6Ejp6xKm0vNlNmJKM.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "2000-01-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["SABU"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["SABU"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0239655/",
      "coverLink": null,
      "actors": ["Stars: Shin'ichi Tsutsumi, Yasuko Matsuyuki, Ren Ôsugi | See full cast and crew »"],
      "reviews": [
         "Monday is an existentialist movie. For those who are comparing it to Tarantino, please stop reviewing movies. This is more like an anti-Tarantino movie, if it is anything. It questions the use of law. It questions the use of weapons. It questions alcohol. It questions justice versus moral. It questions things that went over my head as well. Does that sound like a Tarantino movie? No, not at all. Please give Sabu the right to call this his own movie, and let this compare-everything-with-Tarantino-nonsense slip away. Its about a person waking up in a hotel room, not remembering who he is or how he got there. Gradually he remembers more and more, and it kind of goes way over-the-top, but in a way that is both funny and thought provoking. It also has quite a surreal laugh-at-life quality in some scenes that should be mentioned. Its kind of an intelligent action movie. Let there be more of these!",
         "Wakarimasen deshita.... Any Japanese movie involving alcohol, beautiful Yakuza brides and guns will be a funny ride into the Asian subconscious, and this movie is no exception. It amalgamates plot elements such as drinking Whisky, hands-free peeing, Yakuza bashing, pacemaker bomb defusing, drinking Whisky, lynching street muggers, Devils, Sprites, an obnoxious but finally sympathetic girlfriend, drinking Whisky, Japanese twist dancing, smoke grenades, drinking Whisky, palm reading, fake laughter and moronic TV talk shows into an adventure of the absurd. A ride into the cesspools of one man's private hell. A blatant appeal against alcohol and weapon abuse, or a devilishly clever satire about modern day Japan and its underworld. Oh...and did I mention drinking Whisky? If you're a fan of Takeshi Kitano's movie, you will like \"Monday\". If you are a fan of Bruce Willis and expect a Japanese \"Die Hard\", you won't find it funny! But if you're open minded, can appreciate satire for what it really is, then you will enjoy this movie thoroughly!",
         "Without these \"enlightening\" fifteen minutes (at the very end) this movie may seem quite hopeless, though. It may seem too simple, too odd, too surreal... phony even. But make no mistake: MONDAY is plotted out much more clever than it appears. It is about a guy waking up in a hotel room with bit of a cloudy memory. Things start to come back to him as he bumps into all kinds of leads he find in his pockets. I imagine that the main thought behind it was, what the human mind capable is of doing with the means it has, and how it could be shown in a film. I can say that the creators have come a long way in showing the answer to this. As said, it will takes time to see there is more to it than it seems. Fortunate enough, the retrospective march of events that made the guy end up where is now, makes it perfectly clear that the unrolling celluloid is to be sure of revealing a well-thought-out plot. Second, the whole story raises enough questions about the sanity of the characters as well as the people who wrote the story, that one will sit it out no matter what, if only excited with hope for a plausible explaination for it all. It is unlikely that MONDAY (by Hiroyuki Tanaka) will be a boring experience to anyone. To many, especially those unfamiliar with Japanese cinema, it will be something different than usual, perhaps less exciting, a bit clownish, here and there the surrealistic texture will be a bit hard to swallow, but it surely will keep one curious. And that is the only thing this film needs. This is a movie, and, I think, Japanese directors, Tanaka in particular, have well understood what this means. It isn't real life and it doesn't have to appear this way. Even though some characters and their actions seem to be right from out of a comic book, this movie is as real as (a movie) can be. I heard someone comparing aspects in this film with Tarantino. I'm not entirely sure about that. Frankly, I believe the approach Tarantino uses in his work isn't that unique to begin with. I think it was to be expected that directors would make films the way he does some day. As for Japanese movies like that of Tanaka, I think it has little to do with Tarantino. I actually think we should speak of it as the 'Japanese approach' than the 'Tarantino approach', anyway. Was \"Reservoir Dogs\" not a remake of an underrated Japanese gangster film??? I think is was. Well. Tanaka is nowhere near Kurosawa yet. But surely no less than Miike, Kitano or Nakano. I therefore rate it 7.5! Watch it and be patient, enjoy it and be astound ;)",
         "The room gets dark, the movie starts and after a short while I thought I knew what kind of movie I was watching. Nothing too fancy. A man awakes in a hotel room, it's Monday and he desperately tries to remember what he as did yesterday. One of those \"flashback\"-movies you would say, with old fashioned chapters and structure (I think that's why it was compared to a Tarantino movie). But then suddenly something unexpected happens, the movie just changes direction on and on and it's getting interesting. Genre, style and sujet and in the end the movie is an enjoyable mix of various elements, very well combined in my opinion. I'm afraid that for some people the movie might be not straight enough but if you are not completely bored of Japanese cinema I'd recommend to take a closer look on this one.",
         "This one is definitively stunning. I've already heard about this director, under the pseudonym \"Sabu\", reading some reviews about his late work \"Drive\" that I hope to see asap.. In fact, this is a very talented director. \"Monday\" is a story of mystery, misfortune, hope and strangeness. I think the comment of the director explain clearly what is really \"Monday\": \"I've just decided to do what I wanted to do, and that was ... a comedy, an action film, a painful story, imaginary with a bit of horror and also a \"dancing\" film very rigorous, intransigent, with much, much, much dancing. I wanted all of these elements to be putted into this movie, I wanted that was full of cynic laughter and also to be less long than 100. I've tried and I made it!\" Just watch it!",
         "Two thirds of the movie are filled with grotesque humorous scenes, whereas at end the tone of the movie changes completely and you get a dead serious message delivered. But the good news are: this somehow works. This is brilliant movie and it got to me form the first scenes. I only wished that the two parts where stronger connected. Was there any indication in the first two thirds, that the movie has the subject: \"is self defense justified?\". No. It was all about palm reading, laughing endlessly and drunk dancing/shooting. I watched the movie now four times, because I can't get enough of the bar scenes. The laughing sequence is the best since Laurel and Hardy's \"Fra Diavolo.\"",
         "Salaryman Takagi wakes up fully clothed in an anonymous business hotel and attempts to recall how he got there. A series of flashbacks reveal how the events that led him to this place escalated out of control. As the audience is drip-fed information on Takagi's weekend from hell, a series of hilarious set pieces ensues, along with a stinging social commentary of Japan's repressed, alcohol-dependent work-obsessed culture. Tsutsumi is masterful as the mouse that roars, ranging from cowardly in a bar scene where he opts to drink down a fag dowt, to darkly heroic in his execution of an out-of-control chinpira and his moll. The supporting cast give strong performances, especially Yasuko Matsuyuki as a femme fatal, seducing Takagi like a siren call to hell. Interestingly, Matsuyuki does not have one line in the film, but is a clearly defined character. Character actors such as the ubiquitous Naomi Nishida shine in their epigrammatic appearances. The film will have you smiling in memory of many scenes long after viewing. Takagi writing his will, prolonging the moment, was dryly amusing. Tsutumi's dance in the yakuza bar is simply hilarious. The final third, unfortunately, drags on far too long, as Sabu's sensibilities and timing seem to fail him. The moment is somewhat redeemed by the 'reveal' that is has all been a daydream, but that final stand-off flags and ultimately spoils what was shaping up to be a perfect film. Not perfect then, but better than most. The first ten minutes, especially, are a masterclass in the set-up area of screen writing. Numerous questions are posed in the sequence, with the pay-offs arriving as the film progresses. For anyone interested in contemporary Japanese fimmaking, this is simply unmissable.",
         "Actors making films is a new trend in Japanese cinema.It is a known fact that many of them are no so successful.The only exception in the history of Japanese cinema is Takeshi Kitano who is good as an actor as well as a film maker.Monday is directed by Hiroyuki Tanaka who is one of the most important actors of Japanese cinema.In this film he has given viewers unfettered access into the minds of various sections of Japanese society.What we see in the film is the way people like a family,a salary man,some yakuzas and some of the police behave in the course of their normal lives.The idea of the film is not to criticize a section to praise a different one.In this film,Sabu wants to show us his protagonists with their real intentions,moods and motives for leading lives which they feel are suitable for them.Monday is also a plea for peace as Japanese people have suffered enormous losses in the past especially during the World War 2.This is the reason why violence has been shunned in this film.PS:kindly watch with close attention the performance of Terajima Susumu who also stars in Sabu's wonderful film \"The Blessing Bell\".",
         "Well, I was getting myself ready to watch Brian De Palma's \"Body Double\" and when I pressed the play button to my surprise I wasn't watching \"Body Double\". I had I got the blank tapes mixed up (because they were unlabeled) and on screen was \"Monday\". To lazy to get up and change, I thought I might as well stick with it since I've been meaning to get around to it anyway. A young salary man wakes up rather confusedly on a Monday morning in a hotel room. He slowly begins to remember what had happened over the weekend - where he attended a funeral, had some drinks with some mafia figures, danced around with one of their girls and finally in a drunken state of mind he murders some petty crooks. This last act has caused a real stir amongst the media with it being discussed on TV and the police have surrounded the building ready to take him into custody. \"Monday\" is my second viewing of a Sabu (Japanese director / writer Hiroyuki Tanaka) film and it was another pleasant surprise, just like \"Drive\" (2002) was. Three things I have come to notice about his work is that his pieces are highly original, the odd sense of humour is darkly downbeat and there's an expressive message on life. This black comedy / thriller just feeds off it's cynical statement on the influence of guns in society and the power it asserts on people. It questions the morality about justice - even if you're are on the laws side and shoot someone that doesn't mean you're not a murderer. Really, are you any better because you have a badge? Even alcoholism gets a spray at. The violence is raw, but from glorified. The tense moment involving a swat team toys around this question. We even get a quick taste of the media's involvement too that really portrays the differing perception on both sides of the coin. But these serious thoughts play out more in a dreamy vibe because of all the kooky situations that occurred, strange folk he encounters and the quirky dialogue we hear. It's a more a spur-of-the-moment build up with the infectious story unfolding in non-linear narrative. That's because half the film is spent with the protagonist putting the blurry pieces together of what had happened over the weekend. Just like the main character you would like to see how this clouded chain of events eventuated and we feel every minute of his misfortunes. Shin'ichi Tsutsumi as Koichi Takagi, the salary man who gets drunk, while carrying around shotgun is superb in demonstrating flexibility in his emotions and it's hard not to feel for the guy. Director Sabu leisurely paces the film with many comic ideas, dim humour, icy scenes mixed with suspense, provocative camera shots and a spanking rock / dance soundtrack. In the end I guess you could say that was one rough weekend just waiting for the consequences (Monday) to come along. A very glum and low-key black comedy that boldly throws up some thought-provoking scenarios in a satisfying manner.",
         "This film that opened the Sabu retrospective at New York's Japan Society and was a real blast. Sabu's fourth film is a kick in the pants. It's a film that starts off with a salary man waking up in a hotel room, unsure of how he got there. He then begins to remember back... it started at the funeral...moved on the bar....then continued on past the Yakuza... I've already told you too much because as with all of Sabu's films, the plot isn't the point, its the connections to the things we don't realize that are important. I don't want to say anything about what happens but the funeral becomes one of the funniest ever put on screen and the dancing puts to shame the much heralded Tavolta/Thurmond pairing in Pulp Fiction. I really like this movie a great deal. I suspect that it's going to hang with me for a few days before I can really find out how I feel about it. Its a film that has lots of stuff going on behind it's eyes as it were. If you can find a copy or see it at some screening I suggest you do so. Its further proof that Sabu is one the best filmmakers working today."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Fantasy",
         "Thriller",
         "Action"
      ],
      "productionCompanies": [
         "Cine Qua Non Films",
         "CineRocket",
         "MMI"
      ],
      "summaries": [
         "A salaryman wakes up in a posh hotel room, totally clueless about how he got there. Slowly, he recalls what happened a day before - attending a funeral, dating but annoying his girlfriend, getting drunk in a pub and getting to know a yakuza and his beautiful mistress, having a gun in his hand and...",
         "A simple funeral turns a man's world topsy turvy."
      ],
      "budget": 0
   },
   "movielensId": 27328,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2000-01-01",
      "dvdReleaseDate": null,
      "directors": ["SABU"],
      "runtime": 100,
      "movieId": 27328,
      "title": "Monday",
      "mpaa": "",
      "actors": [
         "Shinichi Tsutsumi",
         "Yasuko Matsuyuki",
         "Masanobu Ando",
         "Hideki Noda",
         "Akira Yamamoto",
         "Naomi Nishida",
         "Hijiri Kojima",
         "Yoji Tanaka",
         "Susumu Terajima",
         "Kanji Tsuda",
         "Nanako Okochi",
         "Nao Omori",
         "Ren Osugi",
         "Natsuo Ishido"
      ],
      "imdbMovieId": "0239655",
      "originalTitle": "MONDAY",
      "genres": [
         "Comedy",
         "Crime",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A simple funeral turns a man's world upside down.",
      "tmdbMovieId": 36246,
      "avgRating": 3.75,
      "releaseYear": "2000",
      "numRatings": 14,
      "posterPath": "/1WJKsMLzMq6Ejp6xKm0vNlNmJKM.jpg"
   }
}