{
   "tmdb": {
      "original_language": "cn",
      "keywords": [],
      "imdb_id": "tt0244092",
      "video": false,
      "title": "Needing You...",
      "recommendations": [
         43152,
         93387,
         313734,
         73414,
         148380,
         62845,
         18822,
         38030,
         45464,
         41364,
         2463,
         57663,
         55157,
         16657,
         51484,
         45438,
         9581,
         41198,
         44458,
         37702
      ],
      "backdrop_path": "/fq2AJWzkjPzdE0ZcEVrsSZ03H8G.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Andy Cheung / The Cupid Express",
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f81106ff",
               "name": "Andy Lau",
               "profile_path": "/mrGR5igHcVWdUP1X8yIt1qBMX1L.jpg",
               "id": 25246,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Kinki Kwok",
               "gender": 1,
               "credit_id": "52fe46c1c3a36847f8110703",
               "name": "Sammi Cheng",
               "profile_path": "/zw3UIugNkr7KMlG8ze1hKhDryXO.jpg",
               "id": 86318,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Fiona Yu",
               "gender": 1,
               "credit_id": "52fe46c1c3a36847f8110707",
               "name": "Fiona Leung",
               "profile_path": "/nLbGWiD5g0bzeZ2VpZIty1VfrAo.jpg",
               "id": 224060,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Roger Young",
               "gender": 0,
               "credit_id": "572036afc3a36875f4000461",
               "name": "Raymond Wong Ho-Yin",
               "profile_path": "/amnewS6pfcJwVof309zT3hbefdE.jpg",
               "id": 1138772,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ronald (as Hui Siu Hung)",
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f811070f",
               "name": "Hui Siu-Hung",
               "profile_path": "/dYZkmJZJOKi20TgXhrHPc9PcjX6.jpg",
               "id": 63582,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Kitty",
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f8110713",
               "name": "Florence Kwok",
               "profile_path": null,
               "id": 224061,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Martin (as Lam Suet)",
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f8110717",
               "name": "Lam Suet",
               "profile_path": "/lncRaBwS0ok9PZNHkxz5UhANouT.jpg",
               "id": 25251,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Dan",
               "gender": 0,
               "credit_id": "573d8bd89251413678001c97",
               "name": "Gabriel Harrison",
               "profile_path": "/1ZlSuBllEyNvVeBrZxXsjcYnCB2.jpg",
               "id": 108831,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Roger's father",
               "gender": 0,
               "credit_id": "573d8bf8c3a3681b4e001e2b",
               "name": "Henry Yu Yung",
               "profile_path": null,
               "id": 119438,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Roger's mother",
               "gender": 0,
               "credit_id": "573d8c09c3a3685a2700097b",
               "name": "Sam Sam",
               "profile_path": null,
               "id": 1622293,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Kinki's sister",
               "gender": 0,
               "credit_id": "573d8c16c3a3684e9a000a7f",
               "name": "Vanesia Chu",
               "profile_path": null,
               "id": 1622294,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Mr Ko",
               "gender": 0,
               "credit_id": "573d8c459251414bad000828",
               "name": "Four Tse",
               "profile_path": "/uW2Deu2E82sd8pAdI9YguHUuyi9.jpg",
               "id": 1418535,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f81106e9",
               "name": "Johnnie To",
               "profile_path": "/16EPGUx2F8W6Tdjvl7SZyhOcKRX.jpg",
               "id": 25236,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f81106ef",
               "name": "Wai Ka-Fai",
               "profile_path": "/85BebNacv1HUGNqiKlAb3OypP05.jpg",
               "id": 58052,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f81106f5",
               "name": "Cindy Tang",
               "profile_path": null,
               "id": 126848,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f81106fb",
               "name": "Wai Ka-Fai",
               "profile_path": "/85BebNacv1HUGNqiKlAb3OypP05.jpg",
               "id": 58052,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.563063,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 45418,
      "vote_count": 11,
      "budget": 0,
      "overview": "Wah and Kinki both working at the same department of a computer company. Both of them are not getting on very well initially, but friendship develops when they get to know each other after a while. When Wah starts to realize his emergent fondness for Kinki, his ex-girlfriend reappears and plans to gain back his affection. In addition, he notices that his ex-girlfriend arranges a guy to pair up with Kinki. At the same time, his supervisor would like to lay him off at work.",
      "similar": [],
      "original_title": "孤男寡女",
      "runtime": 101,
      "poster_path": "/enjH5yOV0GDFemPwqMpNDAd7Q0b.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Bahasa indonesia",
            "iso_639_1": "id"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [],
      "release_date": "2000-06-22",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Johnnie To",
         "Ka-Fai Wai"
      ],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Cindy Tang",
         "Ka-Fai Wai"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0244092/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0OTE5ODMwNl5BMl5BanBnXkFtZTcwMTI0MDQyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Andy Lau, Sammi Cheng, Fiona Leung | See full cast and crew »"],
      "reviews": [
         "Excellent light romantic comedy. A mix of funny, humor, entertaining movie. Loved the part where the leading male character coached the co-worker how to dump the irresponsible boyfriend. This movie not only showed the supervisor and the subordinate relationship, also detailed the single working girls problem: family, dating , working etc. I really like this entertaining movie, loved the theme song as well, It really fitted the movie scenes where the bustle city scenes of H.K. were featured. I learned something from this movie also. office gossips are the worst part. However, this movie made it very funny to point out how far the gossips can go. This movie also touched upon the ever money hungry parents who forced their kid to date someone who is wealthy. Very selfish indeed. Overall, I find this movie very entertaining and provide insights in a lot of city life.",
         "I won't bother to describe the plot because what's going to happen is obvious within the first ten minutes. So while it may be predictable and even unrealistic, as all romantic comedies are, it's done with such lightheartedness, and with so much comic flair, that it's a joy to watch. Both actors (Sammi Cheng and Andy Lau) are in their element, and although they may not be stretched dramatically, they are convincing and sweet. Watching Kinki put Hua Shao through an emotional wringer that leads him to adopt her habit of chronic cleaning when stressed, is funny and touching. There are logic problems and convenient occurrences that force the characters together, but since that's what the audience wants all along, the pleasure is in watching them get there. This is not a feel-good movie, it's a feel-wonderful movie. Highly recommended.",
         "Popular Hong Kong pop singer Sammi Cheng usually winds up in roles where she plays the \"straight man\" and doesn't get the joke. Andy Lau somehow maintains his attractiveness to young women half his age - at least in his movies. This film is no exception but is nevertheless a sweet romantic comedy that plays well if you haven't tired of films in which Cheng and Lau fumble through romance.",
         "Another success for the guys at Milkyway. Further testament that Hong Kong still produces great films which needn't involve gangsters and crime, and violence, but can produce quirky little gems like this. Although Andy Lau changes very little from role to role, playing himself mainly, he is likeable, and when you see the \"moment of romance\" joke you'll realise that Hong Kong can produce subtle comedies which surprise and make you smile without over sentiment.Yep, Andy is willing to make a fool of himself, and that is the joy of him in this film, he has little to say but you see his tranformation and realisation. Sammi, she's likeable but seldom talks maturely, and is more childish in delivery of her lines, but I would think that was the intentions, to make her seem cute, and she is. Yes I like this film, although less of a languishing film by Johnnie To, like \"THe Mission\", it proves that as long as there is talent like of the same ilk as Johnnie and his merry band, Hong Kong can look a lot more rosy for it. If you like Ally McBeal, you'll like this.",
         "A must see for fans of Andy Lau this is a light-hearted romantic treat with Sammi Cheung lighting up the scenes with her girl-next-door looks and coquettish smile. There are several moments in the film that could have been smoother (the entire \"kidnapping\" is a bit overbearing and Kinki's family acts as if they're in the wrong movie) but there's plenty of whimsical fun and childlike nuttiness that will have you rooting for these two well before the two hours run out.",
         "Sammi Cheng and Andy Lau star in this romantic-comedy--with a particular emphasis on romance. I noticed a couple reviewers didn't like that the film wasn't that funny. I had no problem with it and thought it didn't need to be funnier. When I rented this film, my first thought was 'wow--a film starring Andy Lau that is NOT a martial arts epic or gritty cop film!'. This is because here in the States, most of Lau's films you see are this sort of film--such as \"Internal Affairs\", \"House of Flying Dragons\" and \"Warlords\". Here it is nice to see him in something lighter. The film is set in Hong Kong and involves a nice boss (Lau) and a strange secretary (Cheng). I say strange because on one hand she's a mess. She has no confidence with men and flies off the deep when she has relationship problems. But, on the other hand, she's very loyal, highly skilled and a very important part of her office team--though she's not the sort to seek attention and often lets herself be the fall gal when there are problems. As the film progresses, Lau realizes what a find he has with Cheng--at first as a co-worker and then later...well see the film for yourself to see what's next. Overall, this is a very sweet film--a nice date film. Nothing overly deep or significant here--just a very nice movie featuring some actors who manage to carry off the film quite well.",
         "This effort from Johnny To and his Milky Way cronies is unfortunately a huge step back for the company. While it can be admired that To (along with co-director Wai Ka Fai) is attempting a new genre, the romantic comedy, the cheap gags definitely threaten to bog down the entire picture. Andy Lau and Sammi Cheng star as Andy and Kinki, a pair of office drones in a company that somehow deals with computer chips. You can guess what happens next. The only saving grace here is Cheng's neurotic, charming performance. However, with Kinki's constant putdowns and desperate antics, this character makes Ally McBeal look like a model of feminist restraint. Lau takes his role a little too seriously and his temper tantrums threaten to turn this seemingly lightweight effort into something far more serious. A subplot about an Internet millionaire's affections for Kinki (which could've been nicely lampooned is instead squandered) never takes off. This is generally an unwatchable effort, which is hopefully only a temporary detour for Milky Way.",
         "A very, very average and mediocre film. The storyline isn't bad, but it is badly executed. In a series of very disjointed series of scenes, the characters never fully developed. The film never knew exactly what it wanted to be either. Billed as a romantic comedy, it had funny moments, but never seemed to go far enough. Too many unfunny moments spoiled it for me. The characters lacked chemistry and emotion between them and in many ways, the story came out just depressingly sad. Not a good ingredient in a supposedly funny movie. Anyway, it could have been done a lot better...",
         "Hong Kong seems to love Sammi Cheng in whiny, helpless roles, as evident by her slew of Hong Kong Film Awards acting nominations - for this movie, Love on a Diet (both with Andy Lau), and Fighting for Love (with Tony Leung). While I looked past her annoying character in Love on a Diet because I found its weight-loss theme inspirational, both this movie and Fighting for Love - typical romantic comedies - are merely tolerable, good for a couple of chuckles. Though I understand Sammi's acting range isn't that wide, it's a pity that the Queen of Cantopop is perpetually relegated to such grating cheeseball roles. 6/10"
      ],
      "genres": [
         "Romance",
         "Comedy"
      ],
      "productionCompanies": [
         "China Star Entertainment",
         "Milky Way Image Company",
         "One Hundred Years of Film Company"
      ],
      "summaries": ["Wah and Kinki both working at the same department of a computer company. Both of them are not getting on very well initially, but friendship develops when they get to know each other after a while. When Wah starts to realize his emergent fondness for Kinki, his ex-girlfriend reappears and plans to gain back his affection. In addition, he notices that his ex-girlfriend arranges a guy to pair up with Kinki. At the same time, his supervisor would like to lay him off at work..."],
      "budget": 0
   },
   "movielensId": 27348,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "Bahasa indonesia",
         "普通话"
      ],
      "releaseDate": "2000-06-22",
      "dvdReleaseDate": "2001-02-13",
      "directors": [
         "Johnnie To",
         "Wai Ka-Fai"
      ],
      "runtime": 101,
      "movieId": 27348,
      "title": "Needing You...",
      "mpaa": null,
      "actors": [
         "Andy Lau",
         "Sammi Cheng",
         "Fiona Leung",
         "Raymond Wong Ho-Yin",
         "Hui Siu-Hung",
         "Florence Kwok",
         "Lam Suet",
         "Gabriel Harrison",
         "Henry Yu Yung",
         "Sam Sam",
         "Vanesia Chu",
         "Four Tse"
      ],
      "imdbMovieId": "0244092",
      "originalTitle": "孤男寡女",
      "genres": [
         "Drama",
         "Comedy",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Wah and Kinki both working at the same department of a computer company. Both of them are not getting on very well initially, but friendship develops when they get to know each other after a while. When Wah starts to realize his emergent fondness for Kinki, his ex-girlfriend reappears and plans to gain back his affection. In addition, he notices that his ex-girlfriend arranges a guy to pair up with Kinki. At the same time, his supervisor would like to lay him off at work.",
      "tmdbMovieId": 45418,
      "avgRating": 3.28571,
      "releaseYear": "2000",
      "numRatings": 7,
      "posterPath": "/enjH5yOV0GDFemPwqMpNDAd7Q0b.jpg"
   }
}