{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "teen movie",
            "id": 11870
         }
      ],
      "imdb_id": "tt0250440",
      "video": false,
      "title": "Is It Fall Yet?",
      "recommendations": [
         24232,
         258514,
         164435
      ],
      "backdrop_path": "/kW4foO1aSrE6IUZVk3bT88twId1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Daria Morgendorffer",
               "gender": 0,
               "credit_id": "52fe469ac3a36847f810803b",
               "name": "Tracy Grandstaff",
               "profile_path": null,
               "id": 1229455,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Jane Lane / Helen Barksdale Morgendorffer / Quinn Morgendorffer",
               "gender": 1,
               "credit_id": "5322c4d29251411f89004663",
               "name": "Wendy Hoopes",
               "profile_path": "/76nsNXZO6Jr4mROueUTTZa45yoX.jpg",
               "id": 164040,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe469ac3a36847f810800d",
               "name": "Karen Disher",
               "profile_path": "/xJ2d5qaqbdCCYtxFI5at5rfijPi.jpg",
               "id": 87055,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe469ac3a36847f8108013",
               "name": "Guy Moore",
               "profile_path": null,
               "id": 937124,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe469ac3a36847f8108019",
               "name": "Glenn Eichler",
               "profile_path": null,
               "id": 1229450,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469ac3a36847f810801f",
               "name": "Peggy Nicoll",
               "profile_path": null,
               "id": 158645,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469ac3a36847f8108025",
               "name": "George Brennan",
               "profile_path": null,
               "id": 1275236,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe469ac3a36847f810802b",
               "name": "Janet Wygal",
               "profile_path": null,
               "id": 1275237,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe469ac3a36847f8108031",
               "name": "Karen Sztajnberg",
               "profile_path": null,
               "id": 1275238,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe469ac3a36847f8108037",
               "name": "Tom Marsan",
               "profile_path": null,
               "id": 1275239,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.500923,
      "production_countries": [],
      "id": 44756,
      "vote_count": 27,
      "budget": 0,
      "overview": "Is It Fall Yet? continues the series' running plot from where it left off at the end of season four. In the final episode of season four (\"Dye! Dye, My Darling!\"), Daria Morgendorffer kisses Tom Sloane, the boyfriend of Daria's best friend, Jane Lane. The episode ends with the two friends' future uncertain and Tom and Daria's relationship shaky.",
      "similar": [
         19840,
         272693,
         10625,
         89185,
         10314,
         37725,
         2105,
         449176,
         9880,
         26123,
         9611,
         10206,
         15037,
         57214,
         4951,
         2108,
         8363,
         8193,
         9655,
         277217
      ],
      "original_title": "Is It Fall Yet?",
      "runtime": 75,
      "poster_path": "/2HWu2uLb137EaeS2622mFfHVNn0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-08-27",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Karen Disher",
         "Guy Moore"
      ],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Glenn Eichler",
         "Peggy Nicoll"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0250440/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMzY2NjMxOF5BMl5BanBnXkFtZTcwNjI0OTgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rachel Anton, Brett Barsky, Corey Block | See full cast and crew »"],
      "reviews": [
         "The first ten minutes of this film are the funniest I've seen in any movie. Unfortunately it kind of slows down after a bit, and parts are even a bit sentimental, but there are still some wonderful nuggets of humour along the way. Reluctant volunteer counselor Daria remains wonderfully cynical throughout most of the film, washed up teacher Uncle Anthony is hilarious throughout, and there is no end to the ridicule heaped upon the airhead kids produced by the American school system. Daria rocks!",
         "Being perhaps one of the best teen animated series on television and the only program on MTV that deserves attention of anyone with a bit of intelligence is hard enough but Daria continues to impress its viewers with the release of the first original movie \"Is It Fall Yet?\" It stars... Daria, a teenage goddess of sarcasm and wit. Along with her sibling, parents, Bohemian friend and the rest of the regular Daria cast, the movie introduces some surprising new developments which I am not going to give away. Although Daria has a wide audience, most likely, people who watch it are between the ages of 12 and 25. Younger audiences might simply not understand the dialogue (and some of the socio-cultural references) and older folks... well, especially the baby boom generation will find it tough to relate to it. Despite that, if you enjoy a healthy dosage of sarcasm and need to get away from the stupidity around you, I welcome anyone to watch the movie, whether you are new to the show or have been a dedicated fan since the start.",
         "Nobody who has ever seen Beavis and Butt-head could've imagined that the universe of one of the supporting characters would turn out like this. The opening theme is a spoof of those beach blanket movies of the early-1960's, and the theme song can only be described as an anti-Beach Boys song. Our beloved heroine Daria Morgendorffer(Tracy Grandstaff)spends the summer feeling guilty over how she ended up with Jane's ex-boyfriend Tom, who we find is the son of one of the co-owners of the investment firm Grace, Sloane & Paige. Jane, hoping to escape the turmoil of her relationships with Tom and Daria spends the summer at an artists' colony, which turns out to be populated with a bunch of pretentious snobs. When a tattooed girl named Alison(Alternative rocker Bif Naked)makes sarcastic remarks about a \"mentor\"(voiced by the Foo Fighters' Dave Grohl), Jane thinks she may've found a new partner-in-crime. Unfortunately, she turns out to want something from Jane that Daria never wanted... her BODY! Fans have often speculated Daria and Jane are closet lesbians, simply because they aren't girly-girls. This movie tries to raise the issue and put it to rest, yet both characters remain lesbian icons in some circles. Speaking of girly-girls, Daria's normally happy-go-lucky sister Quinn fears her grades are keeping her from attending a party college, and ends up getting a tutor named David Sorenson(former TRL host Carson Daly), who's not as swayed by her good looks and charms as other boys. And though she tries to keep her tutoring a secret, fashion club rival Sandi uses it to try to humiliate her, but as usual this backfires and makes her more popular. When the other girls give him a try, Sorenson realizes that Quinn is the only member of the fashion four who takes his lessons seriously. But what he doesn't realize is that there's more to this than Quinn's desire to get a passing grade... she actually starts to fall in love with him. But does he feel the same? Meanwhile, Jodie Landon and M.J. \"Mack\" MacKenzie will end up spending another summer apart from each other. Lawndale itself does not realize the misery it'll face when Kevin Thompson and Brittany Taylor are hired as...LIFEGUARDS!! Like Daria, Anthony DeMartino ends up spending the summer at Mr. O'Neill's summer camp program called the \"It's Okay to Cry Corral,\" and if Daria doesn't have enough of a reason to cry already, she befriends a nerdy angst-filled kid named Link, who's more pessimistic than she is. When Mr. D takes his hatred of Kevin Thompson out on a camp bully with a painting of a football player, he actually becomes popular and respected for the first time since who knows when. And when Mr. D. gets fed up with the touchy-feeliness of the camp and takes the kids on a hike in the woods, his popularity with the kids is sealed. The longest song ever performed by Mystik Spiral \"Freakin' Friends\" is a clear plea for Daria & Jane to maintain their friendship. And after seeing Daria secretly harbor(and deny) a crush on Trent in seasons one, two, and much of three, we get to find out how she handles having a boyfriend for real. The only people who would be disappointed with this movie are those who expect Tom to be evil and hope for a street-brawl between him and Trent. Every other Daira fan, will find something they like about it, even if they don't think it's the best Daria episode/movie ever.",
         "Having seen Daria only once or twice in its MTV days (and liking it even then), I recently became a REAL fan when I saw the show's reruns on The N (nearly the only reason that station is worth watching). I since sought out the two films, \"Is it Fall Yet?\" and \"Is it College Yet?\", I was not disappointed. After seeing this one, I was immediately taken by the further depth and insight into the characters, particularly the title character, her best friend Jane and her younger sister Quinn. Daria opens up so far as relationships, but by far the best point is Jane's convictions of who she is and the fact that no one is going to change her mind. Outstanding. I always knew there was more to Quinn than the Fashion Club \"Depths of Shallowness\" (see the episode \"Monster\") and I was glad to see it come to the surface. This was a great one, containing all and more of the wit and dry humor of the series. 10/10.",
         "While it is not necessary to see any previous episode from \"Daria\" to enjoy this TV movie, \"Is It Fall Yet\" serves as a perfect bridge for the chapter \"Dye! Dye! My Darling\" and the fifth season of the series, giving an appropriate closure for the conflict between Daria, Jane and Tom, which started in the episode \"Fire!\". The result is very satisfying, with a funny and heartwarming plot which never turns corny or melodramatic. It also works very well as a moment of character growth for Quinn (Who finally shows that she isn't so shallow as the others think) and Mr. DeMartino, who has the chance to recover his lost love for teaching. I like the way in which this TV movie recovers the comedy missing from the last two episodes (Which were more serious than the rest of the series) But even with all the sarcastic humor than one could expect from \"Daria\" this still manages to be uplifting in a convincing manner, being for that reason very pleasant to watch. Personally, I liked it a lot and I consider \"Is It Fall Yet?\" to be one of the best moments in the entire series.",
         "I watched the Daria TV-movie \"Is It Fall Yet?\" primarily because I have a friend from the Internet (won't name names) who loves the show, and urged me to see it -- and to see the episode before it called, \"Dye! Dye! My Darling!\" (I think that's the title). So, I taped it and last Tuesday, I watched it. And was it ever fun! The movie features the adventures of Daria, Jane, and the rest of the crew from Lawndale High off on summer vacation. However, it's more about how Jane and Daria try to deal with their relationship, which has been tested thanks to the fact that Jane's romance with Tom Sloane didn't work out and he is now dating Daria (something which begins in the earlier episode). Daria feels torn between Jane and Tom and her cynical attitude and her guilt nearly wreck any possible romance between her and Tom! Fortunately, things work out: Jane gets over her understandable feelings of hurt, Daria doesn't lose her friend, and she and Tom try again in their developing relationship. As I said, I really enjoyed it. The movie was very smart and funny, and it was rather deep too, as it dealt with a friendship being strained, and a romance strained by the attitude of Daria and by her own guilt. I was glad that the whole thing was resolved -- Daria and Jane emerge from this crisis with a stronger friendship than before, enabling Daria to try again with Tom. A neat subplot deals with Quinn, Daria's sister, and how she learns she has more depth and more intelligence than she may have once realized. Her seeming lack of depth is a mask -- one of the many masks or defensive shields used by characters in this movie, such as Jane and Daria. In short, I almost wish I had seen the series earlier. I hope to see how things turn out in the fifth season. Belle Book",
         "I was a high schooler int he late 90's when Daria first aired on MTV. I loved the show back then because it hit home for a lot of my high school experience. Now fast forward more than a decade and I found Daria was being streamed on VUDU. I decided to buy the DVD and was surprised to find that there were to made for TV movies that I never knew about. \"Is It Fall Yet?\" filled in some of the gaps between seasons. The setup has the classic Daria humor. It is refreshing that they try to add some dept to some of the characters. Getting Jane to see that the art world was not all she thought it would be, giving here something else to by cynical about. Quinn realizing that she is capable of more than the superficiality that she had been used to really help to expand the environment of the show. However, it is uneven. The series tends to focus the each episode on either the humor, or the emotional ramifications of a character. Here, they try to do both, and don't really make it. The middle of the movie really is not very funny and the ending is not up to the shows normal high standards. The emotional aspects just don't connect as well as they could. In the end, it is still a good way to use an hour and a half of your life. It is good to finally start seeing more life in some of the secondary characters.",
         "I have a confession. Even though I am an adult and parent of a teen, I watched all the Daria TV shows and movies when they first aired. Apparently, this show aimed at teens is something I could still enjoy--even though I am an old fuddy-duddy! Recently I bought copies of the two Daria movies. I would have bought the entire show, but so far they have not been released! How MTV could do that or allow the shows to have been rebroadcast a few years ago on Noggin (chopped up in many cases as well as only showing about half the episodes) is beyond me. If you have never seen the DARIA television show or if a cartoon about teens isn't something that would interest you, then you might not particularly love IS IT FALL YET?. However, being a high school teacher and having two teens of my own, this insightful and funny movie is terrific. At the onset, I need to point out that the quality of the animation for all the DARIA shows and movies is very poor--something typical of almost all the MTV cartoons. However, despite this, the writing is so good and so dead-on that I highly recommend this to anyone--especially those with an irreverent sense of humor. First let's give a general overview of the main character, then let's discuss the film. Daria is a high schooler who is both very bright and very cognizant that many of her contemporaries are idiots. She and her best friend, Jane, are the definite odd-balls on campus as they have no interest in fitting in and they are just biding their time until they can graduate! Additionally, they spend most of their time together making commentaries about the idiocy of the students and faculty of Lawndale High School--commentaries that are extremely accurate. This movie is about the summer before their senior year and Daria and Jane's relationship is very strained due to Daria's poor decision to date Jane's ex-boyfriend. Not unexpectedly, most of the summer is spent apart--Jane at an art camp and Daria working as a counselor at a touchy-feely camp run by Mr. O'Neill. The film not only follows their summer, but also that of several other Lawndale High's students as well. The movie is quite angst-filled as well as very insightful and funny. Teens and parents alike should be able to see a bit of themselves and their classmates in the characters--though of course in an over-the-top manner. For example, while empty-headed jocks are something we all can relate to, finding one as dumb as Kevin is a tough assignment! The only reservations I have at all about the film are the quality of the animation (but I looked past this very quickly and it didn't in any way inhibit my ability to enjoy the movie) and a brief scene involving bisexuality. For teens, this isn't particularly a problem. As a school teacher, I know that teens talk about this a lot--probably too much. But for younger audiences, parents should be aware of this.",
         "Okay, so it's \"technically\" a movie, but it's just a glorified extended episode. And it's great! At this point of the series, the savage, witty writers decided to give more depth to the characters and this was their vehicle to do so. The show was known for its dark humor and fast one liners , and though extremely entertaining, the show was teetering on the edge of becoming monotonous. The decision to add major points of conflict amongst the main characters, Daria and Jane, really helped to shake up the show. This movie picks up at the end of season 4. The school year is over, vacation's begun and Daria and Jane's friendship is on the rocks. Let the lessons be learned! It should also be noted, (if you're not observant or not particularly bright) that this is a bridge between seasons. So you'll want to catch up to know what's going on. Warning: This IS NOT for everyone... The humor is dry, the humor is quick and if you were ever popular in high school and avoided the library at all costs, you will simply not get this movie or get this show. This was created by outcasts for outcasts. If you ever watched \"The Breakfast Club\" and rolled your eyes when Ally Sheedy's character got a make-over... you'll probably like this.",
         "\"Daria,\" as I've said before, stood out like a rose in a cesspool among MTV's lineup. This TV movie from the fourth season takes a standard gambit in teen movies - the summer vacation - and turns it into a hilarious and sensitive tale that (unlike \"Is It College Yet?,\" the feature-length series finale) has no padding whatsoever, and all the better for it. \"Is It Fall Yet?\" has everyone's favourite introvert shanghaied into serving as a counsellor at Mr. O'Neill's It's OK To Cry Corral (\"What about my feelings? What about my rights?... What about my bribe?\"), while her sister Quinn spends the summer under tutorship to the horror of her Fashion Club friends; meanwhile, Kevin and Brittany are lifeguards (!), Mack is working off a debt to his father while Jody is doing pretty much everything under the sun, and Jane's going to an art colony where, among other things that bother her, she gets hit on by another woman. Not that Daria's own love life is too peaceful, with her relationship with Tom going through a rough patch... \"Daria: The Movie\" (as it's also called) is the show at its best; not only is it as effective in showing us what it's like for the unpopular, non-mainstream kids as ever, but this time it actually gives Quinn some development - she and Daria are closer here than they've ever been. I've always liked Daria, but for the first time I actually found myself feeling for Quinn as well; just one of many pleasures from this TV movie. Ironic, well observed and with a merciful lack of the self-adoration that so often blights MTV, this is a treat for series fans... and even some others may find themselves agreeing with how Miss Morgendorffer concluded one episode - \"You gotta admit, there are some pretty choice moments.\""
      ],
      "genres": [
         "Animation",
         "Comedy"
      ],
      "productionCompanies": [
         "MTV Animation",
         "MTV Networks"
      ],
      "summaries": [
         "From the hit series \"Daria\" comes her first movie, \"Is It Fall Yet?\", immediately following season 4 of the show. The movie follows Daria and the students of Lawndale High over their summer vacation. Kevin and Brittany become lifeguards, while Quinn and the Fashion Club all get a tutor, David, who Quinn (surprising even herself) has her eyes on. Mack drives an ice cream truck while Jodie is swamped with volunteer work. Daria and Jane have had a fight over Tom, Daria's boyfriend and Jane's ex, causing them to go separate ways for the summer. Jane goes off to an artists' colony where she meets a fellow artist Alison and big-headed instructor Daniel, self-proclaimed genius. Meanwhile Helen volunteers Daria's service at Mr. O'Neill's summer day camp, the It's OK To Cry Corral, with only hoping-to-be-enlightened Mr. DeMartino for company. There, Daria tries to reach out to troubled Link, a 12-year-old version of herself, all while battling self-doubt and slight resentment towards Tom and his wealthy elitest family. It's going to be a long summer...",
         "This animated made-for-TV movie, based on MTV's hit \"Daria,\" explores the summer vacation of Daria and her classmates at Lawndale High."
      ],
      "budget": 0
   },
   "movielensId": 27369,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-27",
      "dvdReleaseDate": "2002-01-15",
      "directors": [
         "Karen Disher",
         "Guy Moore"
      ],
      "runtime": 75,
      "movieId": 27369,
      "title": "Is It Fall Yet?",
      "mpaa": "PG-13",
      "actors": [
         "Tracy Grandstaff",
         "Wendy Hoopes"
      ],
      "imdbMovieId": "0250440",
      "originalTitle": "Is It Fall Yet?",
      "genres": [
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Is It Fall Yet? continues the series' running plot from where it left off at the end of season four. In the final episode of season four (\"Dye! Dye, My Darling!\"), Daria Morgendorffer kisses Tom Sloane, the boyfriend of Daria's best friend, Jane Lane. The episode ends with the two friends' future uncertain and Tom and Daria's relationship shaky.",
      "tmdbMovieId": 44756,
      "avgRating": 3.67874,
      "releaseYear": "2000",
      "numRatings": 207,
      "posterPath": "/2HWu2uLb137EaeS2622mFfHVNn0.jpg"
   }
}