{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "historical figure",
            "id": 6165
         }
      ],
      "imdb_id": "tt0250934",
      "video": false,
      "title": "61*",
      "recommendations": [
         31065,
         24241,
         37444,
         6945,
         18133,
         28614,
         27655,
         45577,
         53192,
         14137,
         57680,
         72881,
         6883,
         37348,
         25269,
         42212,
         36516,
         41407,
         66617,
         22216
      ],
      "backdrop_path": "/3qQYKHxQ9iircAcC8IdtZFoQ3Ol.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Roger Maris",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006171",
               "name": "Barry Pepper",
               "profile_path": "/xLVueyLs2MERkS9RxERa3VCn95s.jpg",
               "id": 12834,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mickey Mantle",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006175",
               "name": "Thomas Jane",
               "profile_path": "/xAES23Ll0JT0lJADA1SIdTAN0bf.jpg",
               "id": 11155,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Whitey Ford",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e00617f",
               "name": "Anthony Michael Hall",
               "profile_path": "/eQnkUzHVrO69bQ08W82Qa9idJxp.jpg",
               "id": 1904,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Milt Kahn",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006183",
               "name": "Richard Masur",
               "profile_path": "/w8qQdmxLRRSXNXkjHKHlY5vawXG.jpg",
               "id": 15416,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ralph Houk",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006187",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Bob Cerv",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e00618b",
               "name": "Chris Bauer",
               "profile_path": "/3KYVMaGkWTEDQ0T9lsu85pVbP4T.jpg",
               "id": 4445,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pat Maris ('61)",
               "gender": 1,
               "credit_id": "52fe43ecc3a368484e00618f",
               "name": "Jennifer Crystal Foley",
               "profile_path": "/AbtNUXqNx35ZyfebQNj2W6mVljV.jpg",
               "id": 532890,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mel Allen",
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006193",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Detroit Bartender",
               "gender": 0,
               "credit_id": "56b0c56b9251412eb3000095",
               "name": "Haynes Brooke",
               "profile_path": "/zYEntBLk2W3rwDCPWVMEpbgZuoI.jpg",
               "id": 163029,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e00617b",
               "name": "Billy Crystal",
               "profile_path": "/22PBSROMN6GmD7uxHpTNb0Unftt.jpg",
               "id": 7904,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ecc3a368484e006199",
               "name": "Hank Steinberg",
               "profile_path": "/3RMtbxOACPsa9Oz9U0JGfHekv0O.jpg",
               "id": 198764,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5910daddc3a36864d4038f9a",
               "name": "Haskell Wexler",
               "profile_path": "/k3JSEg2tildKuFl6F6T1gLQSwgf.jpg",
               "id": 7067,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 4.971531,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20536,
      "vote_count": 39,
      "budget": 0,
      "overview": "In 1961, Roger Maris and Mickey Mantle played for the New York Yankees. One, Mantle, was universally loved, while the other, Maris, was universally hated. Both men started off with a bang, and both were nearing Babe Ruth's 60 home run record. Which man would reach it?",
      "similar": [
         323677,
         13416,
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         4942,
         10474,
         9563,
         2323,
         86130,
         11202,
         1578,
         5925,
         12163,
         1367,
         1374,
         612
      ],
      "original_title": "61*",
      "runtime": 129,
      "poster_path": "/89J6qPZ6alGafob9ZqQNw6zeczx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "61* Productions Inc.",
         "id": 3795,
         "origin_country": ""
      }],
      "release_date": "2001-04-28",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Billy Crystal"],
      "runtime": 129,
      "synopsis": null,
      "writers": ["Hank Steinberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0250934/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2NDcxMjE4Ml5BMl5BanBnXkFtZTcwMzAwNTYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Barry Pepper, Thomas Jane, Anthony Michael Hall | See full cast and crew »"],
      "reviews": [
         "As a Scotsman raised on football and rugby American sports have often left me cold and were a subject of derision in my household as a child. This film ,brilliantly directed by Billy Crystal, changed all that for me. I bought this film through a region 1 DVD supplier as it is unavailable in the UK and was moved to tears by its moving and heartfelt depiction of the late great Roger Maris who in one season became the most misunderstood and hated figure in baseball history. His crime- he dared to challenge a thirty four year old record set by Babe Ruth for the most home runs scored in a single season and even worse he was in competition with teammate Mickey Mantle for the record. Mantle at the time was the darling of NY Yankee fans and was probably the greatest player of his day, Maris was a small town boy who played the game only as a means to an end, to provide for his family, and cared little for public opinion or the press. The venom to which he is subjected to by the press and fans, brought on by immoral reporters, will make any sports fan angry. This film was a work of joy for director Billy Crystal and his love for the project shows in every shot and especially in the directors commentary. Barry Pepper is an uncanny Roger Maris and his amazing performance pulls us into the suffering the player must have felt. Thomas Jane is a brilliant Mickey Mantle playing the role of American legend with biblical sincerity. The whole project feels classy at all times, despite being made for T.V, and is a monument to both players and the era in which they lived. The film is rounded of by an appearance during the credits by Mickey Mantle's son and grandson, pure class and a tribute to the boyhood idol of Billy Crystal All in all well done to Billy Crystal and cast. Thank you for a wonderful 2hrs and 9mins. I am only sad it wasn't longer. But it has introduced me to the sport of baseball and has compelled me to learn more of both Maris and Mantle. So it has placed me on a journey of discovery. What higher compliment can I pay?",
         "Being 33 years old as of this writing, I knew little about the Roger Maris-Mickey Mantle home run chase of 1961 until the Mark McGwire-Sammy Sosa home run chase of 1998. I didn't learn a whole lot about the '61 chase in '98 but I learned enough to develop a solid interest in it. Still, I didn't have very high hopes for \"61*.\" Most of the made for TV movies that I've seen haven't made a strong impression on me, including those made for cable TV, as this was (for HBO). Furthermore, I've never been a big Billy Crystal fan. Though I love comedy, I've never found him to be that funny. And I didn't have a lot of confidence in him to make a good drama, either. And on top of all that, I often find sports biography movies to be disappointing, often leaving out important details while at the same time over-Hollywoodizing. \"Rudy,\" for example. But when I saw the DVD of \"61*\" at a Family Dollar store, priced at just $6, I took a chance and bought it. And I'm glad I did! Crystal won tremendous respect from me with this movie. Almost flawlessly, he tells one of the most interesting single season sports stories that I know of. And I know of more than probably 99% of the American population! From the start, the 1961 Major League Baseball season was ripe to be a classic. Babe Ruth's single season home run record of 60, set in 1927, was more vulnerable than ever because of two major changes. The Los Angeles (later California and now Anaheim) Angels and Washington Senators (now Texas Rangers) began play, thus spreading the pitching talent more thinly. And the regular season increased in length from 154 games - which had also been the season length in 1927 - to 162, as it remains today. The biggest reason why I find the '61 chase more interesting than the '98 chase is that in '61, the top two contenders were teammates. Both played for - who else - the New York Yankees. One was Mickey Mantle (played by Thomas Jane), who had already spent a decade with the Yankees and was unquestionably the biggest star of the day. The other was Roger Maris (Barry Pepper), who was much less heralded. Maris had just emerged as a star the year before, winning the American League Most Valuable Player award in his Yankees debut, which followed three solid but unspectacular years with other Major League teams. Both Mantle and Maris hailed from rural states - Oklahoma and North Dakota, respectively - but were very different people. Mantle epitomized the word \"superstar.\" Besides excelling at every area of the game, he was a charismatic, care free party animal and a fan favorite, the natural heir to Babe Ruth, Lou Gehrig, Joe DiMaggio and other legends. In sharp contrast, Maris was an introvert who largely shunned the spotlight. He loved the game but never attempted to be what the media and fans wanted him to be. (On a side note, I'm a Maris sympathizer because I can relate to being rejected by people who I don't bother simply because I don't follow the crowd and I believe in judging people based on substance more than anything else. Yankees fans should have loved Maris and embraced his phenomenal achievement that year.) As the season progressed and both Mantle and Maris stayed near the pace to break Ruth's record, it was obvious that the fans favored Mantle by far. And when Mantle was slowed by injuries, the fans generally ranged from lukewarm to hostile in their treatment of Maris as he neared the record. For example, the Yankees' last game of the regular season, which they hosted, drew a crowd of just 22,000 even though Maris entered the game tied with Ruth and even though the Yankees went on to win the World Series that year. This is a sharp contrast to 1998, when McGwire regularly filled stadiums in pursuit of Maris' record even though McGwire's team didn't even make the playoffs that season. And in sharp contrast to McGwire's enthusiasm for breaking the record, Maris did not seem to get a lot of joy out of it. He had a difficult time dealing with negativity from the media and fans and also missed the birth of a son during the season. There are so many things to love about \"61*\" that it's hard to list them all. The movie does a great job recreating 1961 in every way. Crystal even managed to find actors to play not only most of the significant Yankees of the season but also many of their opponents. That is not the case with most sports biography movies. Pepper and Jane both give excellent performances and strongly resemble the men who they play. And the movie is very fair and balanced. It presents the perspectives of both Mantle and Maris and gives us an up close look at their relationship behind the scenes, which was fairly good, all things considered. Mantle even moved in with Maris during the season. The movie doesn't white wash either man, neither of whom was squeaky clean, but it doesn't resort to sensationalism, either. For example, it shows Mantle drink alcohol enough in the movie that we realize he drank too much alcohol, but it doesn't dwell on that fact. In addition, the movie gives us insight into Mantle's philosophy. The men in his family all died by the age of 45 so he figured he wasn't going to live a long life and therefore didn't see a need to take good care of himself. (Shortly before his death from cancer in 1995 at the age of 63, he acknowledged that he would have taken care of himself had he known that he was going to live so long. And in response to witnessing by former Yankees teammate Bobby Richardson, who became a minister after retiring from baseball, Mantle repented and became a Christian.) I've found little to criticize about this movie. I've discovered only a few inaccuracies in it - far less than other sports biography movies - and most are minor. The main thing that I wish Crystal had done differently was to give some information about what ended up happening to Mantle and Maris. Both largely went downhill from there. After a 1962 season that was very good, but far below his '61 magic, Maris fell into mediocrity and injuries. He never made the Hall of Fame and died of lymphoma on Dec. 14, 1985 (my 15th birthday) at the age of 15. Mantle had a few more good seasons, but soon his hard living caught up with him, as mentioned above. In addition to the movie, the DVD of \"61*\" contains an excellent 51 minute documentary about the movie, the Yankees and the '61 season, hosted by Crystal. The documentary contains extensive information about the making of the movie and lots of great stories from Crystal, whose love for and vast knowledge of both the game and the Yankees is absolutely infectious. However, because this movie is unrated, I caution you that this is not a family movie. There is enough profanity and crude sexual humor to get it at least an easy PG-13 rating. In conclusion, the movie and the documentary combine to make \"61*\" a great buy, especially if you find it at as low a price as I did! 9/10.",
         "So superb was the job Billy Crystal did on this movie that it is the best baseball (even sports) film I have ever seen. Every detail is meticulously worked out, even more accurately, I believe, than in The Titanic (which, contrary to popular belief, had a few inaccuracies). And while a strong effort in getting look alikes can never completely pay off with so many people involved, how about Barry Pepper as Maris? (Of course, the most important person.) Mickey Mantle's faults are brought out unrestrainedly by perhaps his No. 1 fan, and yet he still comes across in a positive light, as he should. Maris's problems with the press are also portrayed sympathetically, and yet so are members of the press, who are personalized and humanized and have their side also fairly presented. Particularly moving was the scene at the end where a press person who had been at odds with Maris is cheering him on to break the record. An ornamental portrayal of Pat Maris would of course not be tolerated, but Crystal makes an extra, very successful effort at making her an important part of the film with great character development and a thoughtful inclusion of her problems. In fact, I find it hard to think of another movie in which there is such an absence of plastic people. And in spite of the post-Ball Four attitudes about how athletes really are, this movie appears to be accurate in presenting Maris as a good Catholic (and relatively nonboozing) family man. Yankee haters may not be into this film as much as Yankee lovers, but in any event it brilliantly captures the Yankee mystique (and dominance in this particular season) in the early 60s. Were they the apotheosis of the pre-Vietnam, All-American ideal? If you are one of those people whose main complaint about movies these days is more than specific factors, but the general lack of anything uplifting, see this movie. More in the modern vein than, say, Pride of the Yankees, but no less uplifting.",
         "Billy Crystal lovingly looks back at the New York Yankees of his childhood in `61.' The movie follows teammates Roger Maris and Mickey Mantle through the 1961 baseball season, in which Maris did the unimaginable - and unforgivable, in the eyes of many fans. He broke Babe Ruth's sacred 1927 record of 60 home runs in a season. Mantle chasing the Babe was one thing; Maris doing it was quite another. The self-proclaimed redneck from North Dakota, ill at ease around the big city media and hoopla, was not the golden boy that Mantle was. The Mick had owned New York for years - especially since his phenomenal triple crown year in 1956. Maris had come over from the lowly Kansas City A's a year earlier and had enjoyed what many assumed was his `career year' in 1960, winning the American League Most Valuable Player (MVP) award. The movie focuses on more than just the home run chase. It gives a nice portrayal of Mantle and Maris as men and gives a fairly nice look at Major League life in the slightly less jaded early 1960s. The baseball scenes are quite realistic. Adding to the enjoyment for real baseball fans is the careful attention to detail. Even the opposing pitchers, trying to keep Maris from tying and breaking Babe Ruth's home run record, look real. Knuckleballer Hoyt Wilhelm looks just LIKE Hoyt Wilhelm. Jim Bunning throws just LIKE Jim Bunning. Jake Wood (seen only in a long shot, as a baserunner) looks like Jake Wood! I could go on, but won't. Attention to detail is a major plus for this production. (Note: In the midst of writing this, I just scrolled down the credits and saw that Wilhelm was portrayed by former Major League knuckleballer, Tom Candiotti! Sheesh! No WONDER his knuckleball looked real! It WAS real! lol) Maris is played by Barry Pepper, whose physical resemblance to Maris borders on the scary! From his crewcut to his facial expressions, to his physique, Pepper looks exactly like Roger Maris in 1961! He seems to master the swing and other baseball skills, making me guess that he had played college baseball. He also turns in a convincing performance as the introverted Maris becomes the center of attention, controversy and criticism - not just in The Big Apple, but across the nation. The performance of Thomas Jane as Mantle is also outstanding. He and Pepper accurately portray the stress of a long and grueling baseball season, made more so by separations from loved ones, the pressure of a pennant race and the ever-increasing pressure and scrutiny of the chase on Babe Ruth's hallowed record of 60 home runs. Jane captures the charisma and genuine likeability of Mantle, as well as his less attractive side as a non-attentive parent and unfaithful husband. Chris Bauer, meanwhile, is delightful as outfielder Bob Cerv (pronounced `serve'), a teammate of Maris in KC and his (and later Mantle's) roommie with the Yankees. Crystal's daughter, Jennifer Crystal Foley, is also strong as Pat Maris, struggling hard to support her stressed-out husband and manage their growing family, from halfway across the country. The rest of the cast is first-rate, as well. The tie-in with the present day (or 1998, at least) shattering of Maris' record by Mark McGwire is effective and gives a more heartwarming feel to the film. McGwire was all class in 1998, going out of his way to accommodate the Maris family and to honor Maris himself (who had died several years earlier); of course he was buoyed by a nation that seemed to urge him on, rather than spit venom at him, like the one Maris faced. The final effect seems to be closure for the spirit of Roger Maris. Perhaps it DID take his record being broken for baseball to forgive the outsider from Dakota for having the audacity to break Ruth's record. Perhaps it DID take the goateed McGwire hitting 70 home runs for baseball fans to realize the significance and difficulty of Maris belting 61 in '61 - still the American League record, by the way. Crystal brings home his film in fine style. He also keeps it fairly clean. One off-color clubhouse exchange between Mantle and Whitey Ford seems to be tossed in primarily to give a sense of it BEING a Big League locker room. Thereafter, the film is largely suitable for the entire family. Overall, I would call `61' one of the better baseball movies ever made.",
         "Billy Crystal hits it out of the park with 61*. Brilliantly cast, beautifully shot and at times brutally honest in its storytelling, 61* is an absolute gem. Any baseball fan well knows the story of the great home run chase of 1961. Here, Crystal peels back the curtain and brings us up close and personal with the men who made that season so memorable. In Barry Pepper, who plays Roger Maris, and Thomas Jane, as Mickey Mantle, Crystal found two actors absolutely perfect for their respective roles. The way Pepper and Jane perfectly captured the essence of these real-life heroes goes far beyond the eerie physical resemblances the actors have to the men they portray. Maris was a quiet, serious, introspective family man. And during this particular season it could be said he was a downright tortured man as well. Pepper captures all of this wonderfully. Mantle on he other hand was an outgoing, energetic, fun-loving superstar who took full advantage of all the perks his stardom brought him. And Jane does a fine job bringing this out and really lets you see the wear and tear Mantle's lifestyle had on him as his body began to break down. It would have been easy to gloss over some of the less appealing aspects of Mantle's personality. It also would have been dishonest and Crystal is to be applauded for showing it how it really was. Mantle was a larger than life hero but he certainly had his faults and this film brings them out. Some may find the pervasive profanity and crude sexual humor in the film to be a bit over the top but an honest retelling of the story requires acknowledging the way these ballplayers really were. 61* is not just a movie about baseball, it is at its heart a movie about Roger Maris and the key relationships in his life. Maris and Mantle, Maris and his wife, Maris and the oppressive press...these relationships are all explored as we learn much more about Roger Maris the man than Roger Maris the baseball player. Maris had to overcome a great deal to accomplish what he did and this film does a brilliant job of bringing us along on his magical ride.",
         "First off, I'm a lifelong Boston Red Sox fan and thus not much of a Yankees fan. However, this may be one of the best baseball movies, if not one of the best sports films, ever made; even though baseball fans know how the story ends, your emotions will be stirred and you will find yourself rooting for these two players whether or not you have a preference for pinstripes. Barry Pepper and Thomas Jane steal the show as Maris and Mantle, two Yankee teammates that form an alliance to help carry them through the turmolterous race to break the single-season home run record of Babe Ruth in 1961. While everyone from the press box to the peanut vendor appears to favor seeing the lovable Mick, even the commissioner of baseball seems to have an agenda against the misunderstood Maris. Trying to eclipse a mark of a legend against such adversity proves to be no easy task for either player, and the film does a great job of demonstrating the pressure that each player experienced from his own angle. Director and noted Yankees fan Billy Crystal obviously put his heart and soul into directing and producing this masterpiece and deserves credit for putting an honest face on the race to the home run record between these two legends. Most impressive was how much care was taken to make the actors appear to step comfortably into the roles of each player; Jane and Pepper appear and act so much like \"the M&M boys\" that it's spooky. Being a passionate fan of the game probably puts a bias on this review but, even if you don't know the difference between a squeeze play and a double play, it's a great story about friendship and facing odds.",
         "I could spend hours trying to come up with the perfect words to describe \"61*\" Simply put, its one of the best baseball movies I have ever seen. Barry Pepper and Thomas Jane ARE Maris and Mantle. Billy Crystal did an exceptional job directing this picture. The acting is excellent. A great part of the movie is seeing all the old ballparks that have been refaced and digitally made to look like the parks did in 1961. Turning Tiger Stadium into Yankee Stadium is quite a feat! I would recommend this movie to the die-hards, the casuals, and those who don't know anything about baseball. Billy Crystal -- Thank you for another great movie!",
         "This is a wonderful piece of work from director and executive producer Billy Crystal. A powerful and personal story of the little known amiable relationship between Roger Maris and Mickey Mantle during that dramatic home run race of 1961. The two sluggers were always pictured as being bitter rivals. This is a whole different tale. Mantle(Thomas Jane)being the Yankees 'golden boy' and Maris(Barry Pepper)the ridiculed interloper learned to coexist and become the M & M Boys. Mantle being jaded by the press offered his best advice to the often stoic and sullen Maris on matters of surviving publicity. Most of the home run chase was like a masterpiece on canvas. Maris never seemed to get the respect he deserved, but his fortitude garnered him a place in baseball history. 61* would of course become 61 and then later shattered and surpassed by another home run chase. This movie deserves being ranked among the elite of sports movies and one of the best baseball flicks ever. Pepper is outstanding as Maris. Jane takes a little warming up to as the Mick. A very talented supporting cast includes: Richard Masur, Bruce McGill & Christopher Bauer. Plus most impressive is Billy Crystal's daughter, Jennifer, playing Pat Maris. This is a must see for every sports fan!",
         "Even for the only occasional baseball fan in Europe (i.e. myself) this film gives you excitement about the game the game of baseball, feeling for some of its greatest stars and hits home just how big the sport is across the pond. And it really brings home how much director/producer Billy Crystal loves the game. The strength, however, really rest in the performance of Billy Pepper and Thomas Jane who portray the friendship, rivalry and respect between two great players. I was glued to the screen from moment one would suggest that this is one of the strongest sports films ever made.",
         "Produced obviously as a response to the assault by Mark McGwire (and Sammy Sosa) on baseball's single season home run record, this is a generally entertaining and well-acted story of the friendly battle waged between Yankee teammates Mickey Mantle and Roger Maris to beat Babe Ruth's home run record of 60, back in the year 1961. Billy Crystal (who also produced) showed a surprisingly deft touch as a director, giving viewers a very realistic glimpse of life inside the pressure cooker of Yankee Stadium and major league baseball in general. Maris (Barry Pepper) comes across as an all around good guy who would really rather not be in the spotlight, who nevertheless has to deal with a hostile media and less than supportive home fans, neither of whom really want to see Ruth's record broken and who, if it is to be broken, would rather see Mantle (\"the real Yankee\") do it. Pepper was extremely good in this role. Thomas Jane put on an equally good performance as the wilder Mantle, who actually becomes Maris's roommate partway through the season, mainly to keep himself out of trouble. This is an enjoyable enough baseball movie. Suspense is lacking, because we already know how the thing is going to turn out, but it's worth watching if only to see the dressing room tension building and the effect on the team as a whole. It's also an interesting look at how the media creates and destroys heroes. It's a little bit long (slightly over two hours) but very enjoyable. 7/10"
      ],
      "genres": [
         "Biography",
         "Drama",
         "History",
         "Sport"
      ],
      "productionCompanies": [
         "HBO Films",
         "Home Box Office (HBO)",
         "Face Productions"
      ],
      "summaries": [
         "Summer, 1961: Roger Maris and Mickey Mantle are on pace to break the most hallowed record in U.S. sports, Babe Ruth's single-season 60 home runs. It's a big story, and the intense, plain-spoken Maris is the bad guy: sports writers bait him and minimize his talent, fans cheer Mantle, the league's golden boy, and baseball's commissioner announces that Ruth's record stands unless it's broken within 154 games. Any record set after 154 games of the new 162-game schedule will have an asterisk. The film follows the boys of summer, on and off the field: their friendship, the stresses on Maris, his frustration with the negative attention, and his desire to play well, win, and go home.",
         "Roger Maris and Mickey Mantle race to break Babe Ruth's single-season home run record."
      ],
      "budget": 0
   },
   "movielensId": 27373,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-04-28",
      "dvdReleaseDate": "2001-09-11",
      "directors": ["Billy Crystal"],
      "runtime": 129,
      "movieId": 27373,
      "title": "61*",
      "mpaa": "",
      "actors": [
         "Barry Pepper",
         "Thomas Jane",
         "Anthony Michael Hall",
         "Richard Masur",
         "Bruce McGill",
         "Chris Bauer",
         "Jennifer Crystal Foley",
         "Christopher McDonald",
         "Haynes Brooke"
      ],
      "imdbMovieId": "0250934",
      "originalTitle": "61*",
      "genres": [
         "TV Movie",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["1po8PgfJU_Q"],
      "plotSummary": "In 1961, Roger Maris and Mickey Mantle played for the New York Yankees. One, Mantle, was universally loved, while the other, Maris, was universally hated. Both men started off with a bang, and both were nearing Babe Ruth's 60 home run record. Which man would reach it?",
      "tmdbMovieId": 20536,
      "avgRating": 3.64884,
      "releaseYear": "2001",
      "numRatings": 215,
      "posterPath": "/89J6qPZ6alGafob9ZqQNw6zeczx.jpg"
   }
}