{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "military base",
            "id": 4409
         },
         {
            "name": "victim of murder",
            "id": 4942
         },
         {
            "name": "jeep",
            "id": 5135
         },
         {
            "name": "anime",
            "id": 210024
         }
      ],
      "imdb_id": "tt0275230",
      "video": false,
      "title": "Blood: The Last Vampire",
      "recommendations": [
         15999,
         9463,
         14282,
         1450,
         40037,
         74677,
         44179,
         157974,
         9606,
         38946,
         12140,
         17566,
         25133,
         68509,
         42158,
         74241,
         88067,
         108890,
         84415,
         25525
      ],
      "backdrop_path": "/txiztKRpPqtPPa3hMTPs16t6x4u.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Saya (voice)",
               "gender": 1,
               "credit_id": "52fe428dc3a36847f802772d",
               "name": "Youki Kudoh",
               "profile_path": "/dQHHbR7spJQXp2bi2YQQkMPk3H3.jpg",
               "id": 16145,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Nurse Makiho Caroline Amano (voice)",
               "gender": 1,
               "credit_id": "52fe428dc3a36847f8027731",
               "name": "Saemi Nakamura",
               "profile_path": "/8JsfizCwmpwI3x8xzcN0dQ3nm51.jpg",
               "id": 16146,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "David (voice)",
               "gender": 0,
               "credit_id": "52fe428dc3a36847f8027735",
               "name": "Joe Romersa",
               "profile_path": "/4hgdyGgqWcOSiRHVbCfaj46HggI.jpg",
               "id": 16147,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Sharon (voice)",
               "gender": 0,
               "credit_id": "52fe428dc3a36847f8027739",
               "name": "Rebecca Forstadt",
               "profile_path": "/rZJlKAYlIAWDf0XAK3HjieboBZj.jpg",
               "id": 16148,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Louis (voice)",
               "gender": 0,
               "credit_id": "52fe428dc3a36847f802773d",
               "name": "Stuart Robinson",
               "profile_path": null,
               "id": 16149,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Mama (voice)",
               "gender": 0,
               "credit_id": "52fe428dc3a36847f8027741",
               "name": "Akira Koteyama",
               "profile_path": null,
               "id": 16150,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Teacher (voice)",
               "gender": 0,
               "credit_id": "52fe428dc3a36847f8027745",
               "name": "Tom Fahn",
               "profile_path": null,
               "id": 16151,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "S.P. #1 (voice)",
               "gender": 2,
               "credit_id": "52fe428dc3a36847f8027749",
               "name": "Fitz Houston",
               "profile_path": "/oaXMQHcrngKGNETVY4Lif4yATWn.jpg",
               "id": 16152,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "School headmaster (voice)",
               "gender": 2,
               "credit_id": "52fe428dc3a36847f802774d",
               "name": "Paul Carr",
               "profile_path": "/d3TOH0YCcxS0rJjRDbD7NFG614A.jpg",
               "id": 15628,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe428dc3a36847f80276f9",
               "name": "Hiroyuki Kitakubo",
               "profile_path": "/toKuqZBJCxJZMHyIXGtp4OIBNM5.jpg",
               "id": 16136,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe428dc3a36847f80276ff",
               "name": "Kenji Kamiyama",
               "profile_path": "/adDNnkYAfK9F5AoyCM7w7TUcvCu.jpg",
               "id": 16137,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe428dc3a36847f8027705",
               "name": "Yukio Nagasaki",
               "profile_path": null,
               "id": 16139,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe428dc3a36847f802770b",
               "name": "Yoshihiro Ike",
               "profile_path": null,
               "id": 16140,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe428dc3a36847f8027711",
               "name": "Yuusuke Takeda",
               "profile_path": null,
               "id": 16141,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe428dc3a36847f8027717",
               "name": "Kazuchika Kise",
               "profile_path": null,
               "id": 16142,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe428dc3a36847f802771d",
               "name": "Keiichi Momose",
               "profile_path": null,
               "id": 16143,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe428dc3a36847f8027723",
               "name": "Tokumitsu Kifune",
               "profile_path": null,
               "id": 16144,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe428dc3a36847f8027729",
               "name": "Katsuya Terada",
               "profile_path": "/CpH2XqjqhNn2cW1Pv7LUyscRdD.jpg",
               "id": 16138,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "57ffa8d0c3a368153d0003d0",
               "name": "Mamoru Oshii",
               "profile_path": "/2MXFEwxLu7gT9vvi5Otx4LQgsvZ.jpg",
               "id": 12180,
               "department": "Production",
               "job": "Supervising Producer"
            },
            {
               "gender": 2,
               "credit_id": "57ffa951c3a36815520003b4",
               "name": "Mamoru Oshii",
               "profile_path": "/2MXFEwxLu7gT9vvi5Otx4LQgsvZ.jpg",
               "id": 12180,
               "department": "Crew",
               "job": "Creator"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 5.432867,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 919,
      "vote_count": 88,
      "budget": 0,
      "overview": "In Japan, the vampire-hunter Saya, who is a powerful original, is sent by her liaison with the government, David, posed as a teenage student to the Yokota High School on the eve of Halloween to hunt down vampires. Saya asks David to give a new katana to her. Soon she saves the school nurse Makiho Amano from two vampires disguised of classmates and Makiho witnesses her fight against the powerful demon.",
      "similar": [
         351460,
         81,
         16859,
         4935,
         8392,
         129,
         51739,
         11430,
         1992,
         128,
         9323,
         881,
         391,
         390734,
         372058,
         1949,
         430447,
         374205,
         1580,
         10228
      ],
      "original_title": "Blood: The Last Vampire",
      "runtime": 48,
      "poster_path": "/3ySU3xS4g9KeJNCNDbVniOs3KmG.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Aniplex",
            "id": 2883,
            "origin_country": ""
         },
         {
            "logo_path": "/rwB6w2aPENQbx756pBWSw44Ouk.png",
            "name": "Production I.G",
            "id": 529,
            "origin_country": "JP"
         }
      ],
      "release_date": "2000-11-18",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.bloodthemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hiroyuki Kitakubo"],
      "runtime": 48,
      "synopsis": "The year is 1966. Saya is the only remaining original vampire, and she hunts Chiropterrans--demons who live off human blood. Saya's a testy and demanding little bitch but apparently very valuable to \"the top.\" Her next assignment, as her boss David explains it to her, is to infiltrate the U.S. Yokota Air Base's High School, which has been the scene of several deaths in the past and is thought to be harboring at least two Chiropterrans. Saya's cover is that of a student who will be participating in classes for a few days. Saya's first day at Yokota High is pretty uneventful. After classes are over and everyone has cleared out, Saya snoops around the school and learns that blood has been spilled on the floor in the infirmary. She suspects that the infirmary is the Chiropterrans' feeding room. The next day is the school's Halloween party. After school lets out, the students change into their costumes and head for the dance...all except for Sharon and Linda, that is. Linda isn't feeling well, and Sharon thinks it's a flare-up of Linda's anemia, so she's going to walk Linda over to the infirmary and they will attend the party later. Saya enters the infirmary just as Sharon and Linda are about to feed on nurse Makiho Amano. Linda changes her form into Chiropterran, and Saya slays her with her sword. Saya turns on Sharon and wounds her, but Sharon gets away, spilling blood as she flees. The astonished nurse follows the trail, which leads to the dance hall where she finds Sharon in Chiropterran form hiding under a blanket. While Saya battles the creature, Makiho runs for help. Meanwhile, at a nearby bar, the mama-san sets the bar on fire, takes Chiropterran form, and heads for the army base. She kills the military guard who is escorting the Makiho back to the dance. Saya saves the terrified nurse, and they take refuge in a military garage, but the demon finds them. Saya, without her sword, battles the creature with a shovel while Makiho hops in a jeep and rams through the door. David, who has been looking for Saya and was standing outside the garage, tosses a sword to Saya, and she chops the demon (Sharon) in half. As Saya and David take Makiho from the jeep and lay her unconscious form gently in the grass, they see the mama-san in demon form on the roof, preparing to fly away. David and Saya follow in the jeep. The Chiropterran tries to escape by landing on the wing of a military jet tooling down the runway. The jeep gives chase, and Saya slays the monster. As the Chiropterran lies dying on the runway, Saya feeds it with a few drops of her own blood. Epilogue: Makiho attempts to describe what she saw to the military brass, but she has little proof of anything. When she returned to the infirmary, Linda's body was no longer there and the bloody mess had been cleaned up. The military brass deny knowing anything about David, but they do show Makiho a photo taken in 1892 that clearly shows Saya and has the word \"Vampire\" written on it. Makiho returns to her office, wondering to herself whether Saya is still around and still fighting demons, \"just as we humans continue to kill each other.\" At that moment, an announcement comes over the radio that the Liberation Front has attacked the American Blake base and that Yokota base personnel have been ordered to fly to Don Hoi in North Vietnam. As the credits roll, the background shows some very blurry photos of what looks like American forces in Vietnam. [Original Synopsis by bj_kuehl] [Edited by m-lissa1]",
      "writers": [
         "Kenji Kamiyama",
         "Katsuya Terada"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0275230/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4MjA0NTQ1N15BMl5BanBnXkFtZTYwMzEyMjE5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Yûki Kudô, Saemi Nakamura, Joe Romersa | See full cast and crew »"],
      "reviews": [
         "When I picked up the DVD, it said on the back 80 minutes, so that's what I expected. Instead, I ended up with a 45 minute film. The other 35 minutes has been reserved for the \"Making Of\" and the trailer (Actually, the \"Making Of\" was only 20 minutes. Where did the other 10+ minutes go?). That said, \"Blood: The Last Vampire\" is very much like a roller coaster: Very fast, a lot of fun, but over before you know it. The first three minutes drew me into the whole story very quickly. It has an impressive beginning, a moderately slow-paced lead up, but once the action starts, it becomes very, very cool. I guess that's why after the last battle, I was expecting more, and when it started rolling credits a few minutes after \"officially\" revealing Saya's history, I was expecting this new (but obvious) information to start adding into the story and her character. In the age of 2-3 hour epics, the abruptness caught me off guard. But enough harping about the short film aspect. This is an enjoyable film to watch for its pacing, visuals and sound. The music was very dark and atmospheric, and I thought the voice acting for Saya was good. The CG in the film leads to some very cool effects, but as strange as this sounds, some of its realism (especially with the plane scenes) offsets the animated look. It was an unusual combination of \"CG realism\" and animation. All in all, \"Blood: The Last Vampire\" is worth a watch. It has a lot of really good things going for it, and I'll definitely show it off to friends. Recommended",
         "AARRRGGHH!!! CAN SOMEBODY PLEASE TURN THIS INTO A FULLY FLEDGED SERIES OR MOVIE!!!!!!! I love a story to be fleshed out. I like to know about origins, motivations and characters. And Blood offers just enough to be thoroughly intriguing yet little enough to frustrate the absolute crap out of me. The 'pure' vampire thing is a pretty good angle. I want to know more! That just about sums up Blood for me. Everything it does it does well. Great concept, animation (especially CG) and voice work. There just isnt enough of any of it. At about 48 mins it just barely scratches the surface. You expect another chapter in Saya's mission to directly follow. But you get the credits instead. If this ever fulfilled its potential I think the producers could have an anime milestone on their hands. As it stands Blood is great and frustrating in totally equal parts. >",
         "When you sit down to view Blood: the Last Vampire, the style and setting of this gothic noir anime grabs you instantly. Using a mixture of animation cells and computer-generated backgrounds, this is an effortlessly stylized visual breakthrough that hopefully will launch future endeavors in the style. The problem with this particular film, though, is that it is far, far too short. At just over forty minutes filmed length, the story of a strange girl called Saya that seems to be some sort of vampire slayer barely gets the ball rolling on the enigmas behind this girl, the organization she works for, and the beasts she vows to slay before fading into the end credits. This makes you sit back, blinking at all the dazzling visual beauty that went into this well-crafted film, and wonder, 'what next?' Hopefully, there will be further adventures of Saya and the dingy, grimy world she lives in, each as well-designed as this one was, though with much more payoff. All in all, worth looking at if only to see what the future of animation might look like.",
         "This movie feels rushed at the end. On my DVD, I thought maybe something was wrong. Maybe it skipped a few scenes? But nope. The movie finishes on a note, like most anime's do, which leaves you hanging. But this leaves you hanging, really hanging, saying.... OK, so what is the point of this movie?? This movie had some awesome scenes, great animation, and lots of potential. I loved the vampires, I loved the girl main character (although the tough girl thing is overdone in anime). But it lacked a theme, feel, and.... well.... ending. Too bad, could've been spectacular.",
         "\"Blood: The Last Vampire\" is impressive and not impressive for a number of reasons. The reasons it is impressive is...well, quite obviously the animation is worthy of mention. Taking digital animation much further than in \"Ghost in the Shell,\" this film is probably as state-of-the-art as animation can get these days. They even made alternate takes and angles for use in the trailer, giving it a more live action feel. The visuals are intense, the music is effective, it should be a massive hit, right? Wrong, and for the reasons it's not impressive, which are unfortunately too much to save it. The first problem...it's too short, not even lasting a full hour. Obvious not meant to be a full-on movie, but it should've been. The story is weak, but only because it's not developed beyond a concept, as opposed to a drawn out plot. The concept is Saya is \"the only remaining original\" vampire, and the government contracts her to hunt down vampiric demons. We have little or no back story, no explanation of how Saya is the only original, no explanation of the people she works for, or why she seems to hunt her own kind...or even if they are her own kind. There's so much missing from the story, that one wonders if the workload was really worth it. Bottom line, the plot could've been simple, but it should've been drawn out. MORE, give us MORE! Now, on the other hand, if this were a pilot episode to a series, it might be more tolerable, but with the expenses and effort put into just this one 50-minute feature, it seems unlikely. \"Blood: The Last Vampire\" WANTED to be better than it was, and SHOULD'VE been better than it was. Alas, somebody forgot that what makes a good anime is not just the animation but the story as well, the main thing that distinguishes anime from most other forms of animation.",
         "In Japan, the vampire-hunter Saya, who is a powerful original, is sent by her liaison with the government, David, posed as a teenage student to the Yokota High School on the eve of Halloween to hunt down vampires. Saya asks David to give a new katana to her. Soon she saves the school nurse Makiho Amano from two vampires disguised of classmates and Makiho witnesses her fight against the powerful demons. \"Blood: The Last Vampire\" is an animation of 48 minutes running time with the tormented and skilled samurai Saya. The story is too short and has a poor development of Saya, especially for those that do not know the character. I saw the movie \"Blood: The Last Vampire\" (2009) a couple of years ago and the character Saya is better developed. My vote is six. Title (Brazil): Not Available",
         "This movie is wonderful. Even though it is short, it didn't really need anything else. Mamarou Oshii and his team did a wonderful job at simplifying a potentially aspiring story into great characters and great animation. At first i wondered why the film was so short but the more i thought about it the more it made sense. The film didn't really need any extra story to it. It fits nicely into the package it comes in. They paced it so well that it didn't seem like it needed anything more. The animation was very good as well, Oshii really knows how to use his animation to relate to people. His characters look like normal people, they (for the most part) act like normal people and they have a great deal of time and emotion put into them. His characters were also developed well. Some argue that there was not enough background story in the film but there really didn't need to be. It seems that, Oshii likes to put mystery around his characters. He doesn't give you every little bit of information on them he lets you wonder and examine them so that you can draw your own conclusions about who they are. I highly recommend this movie.",
         "What can I say, but I really loved this anime film. All 48 fricking minutes of its short, well made, coolness. The story of what I was able to peace together, involves Saiya some sort of immortal vampire hunter who might just be a vampire herself, even though thats left to the audiences imagination since the bulk of the story involves suspense with well done action sequences. At the start of the film shes sent off by her boss and his cronie to American Air Force base where there seems to be an infiltration from three confirmed vampires. She then sets off to exterminate them while trying to save a school nurse who seems to be the target of the vampires attention. What follows is then is one long sequence that makes up the rest of the film as Saiya and her boss battle the three vampires while trying to save the life of the nurse. Then its over. Just like that. No resolution to little plot details, like the origins of Saiya, or how she came to work for the orginization that she works for. You never really understand the point of the vampires beyond the fact that they're the villians and they bite peoples necks to kill them. Or for that matter why Saiya acts the way she does at the end of the film. Looking back at what I liked about this film, I think I would have to rank this as another digitally animated film from this year, Final Fantasy: The Spirits Within. Unlike that film though, which left the intrigued viewer wanting more from the story. This film just leaves you wanting more story period. The direction, the animation are all top notch high grade stuff. Its just at the end, you leave yourself feeling as this has been nothing more than a well made tech demo. Well I hope its not, since I'm praying for a longer sequel to be made soon.",
         "Blood is a great anime and it is great to see digital animation. The story is good aswell as the charcters but it is definitely too short and it ends just when you get into it. I also like the fact that it mixes english and japenese. I definitely recommend this to anyone and especially anime fans who haven't seen it.",
         "Standing at 48 minutes long, Blood: The Last Vampire is cornucopia of pure violence, bad a55 combat and suspenseful monster slaying action. It has exceedingly smooth animation combined with highly detailed artwork, appealing character designs(a far cry from the cutesy big eyed girls in most anime) and awesome fight choreography. However, look beyond the \"wow factor\" and there is little else that this film offers. In terms of plot, it is very straight forward and predictable with few story twists. The characters are typical action movie stereotypes with the main character of Saya being seriously under-developed. It is very difficult to emotionally connect to any of the characters at all. There is no sense of peril in the fights due to Saya being characterized as some unbeatable monster hunter extraordinaire. Although the actors do their best to bring out as much emotion from the characters, the flat dialogue falls squarely on the shoulders of the writers. I do, however, applaud the decision to record a mixed language dialogue(western characters speak English, Asian characters speak Japanese) as it enhances the realism of the setting. To top it all off, The pacing of the movie in erratic and it shows in the more subdued scenes of conversation where things get really boring. Lump that together with a huge let-down of an ending and you have Blood: The Last Vampire. Sure, this anime is famous. But we have to look at what made it famous and it definitely was not its half baked story or 1 dimensional characters. I bet It was only the animation. An anime film with good animation only is not a good anime film. There has to be a balance and sadly, Blood: The Last Vampire does not have that balance. A bloody over hyped waste."
      ],
      "genres": [
         "Animation",
         "Action",
         "Horror"
      ],
      "productionCompanies": [
         "Aniplex",
         "IG Plus",
         "Production I.G."
      ],
      "summaries": [
         "In Japan, the vampire-hunter Saya, who is a powerful original, is sent by her liaison with the government, David, posed as a teenage student to the Yokota High School on the eve of Halloween to hunt down vampires. Saya asks David to give a new katana to her. Soon she saves the school nurse Makiho Amano from two vampires disguised of classmates and Makiho witnesses her fight against the powerful demons.",
         "Japan, 1966. Saya is part of a secret team destroying daemons. She is sent undercover as a student at the Yokota Air Base in Fussa-shi, Tokyo, just before Halloween. She discovers that two of her classmates are vampires in disguise just as they are preparing to attack the school nurse; meanwhile, her colleagues have discovered another vampire acting as a bartender in the local red-light district. A spectacular battle ensues."
      ],
      "budget": 0
   },
   "movielensId": 27441,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "2000-11-18",
      "dvdReleaseDate": "2001-08-28",
      "directors": ["Hiroyuki Kitakubo"],
      "runtime": 48,
      "movieId": 27441,
      "title": "Blood: The Last Vampire",
      "mpaa": "PG-13",
      "actors": [
         "Youki Kudoh",
         "Saemi Nakamura",
         "Joe Romersa",
         "Rebecca Forstadt",
         "Stuart Robinson",
         "Akira Koteyama",
         "Tom Fahn",
         "Fitz Houston",
         "Paul Carr"
      ],
      "imdbMovieId": "0275230",
      "originalTitle": "Blood: The Last Vampire",
      "genres": [
         "Fantasy",
         "Animation",
         "Horror",
         "Comedy",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["tYnciEGup9k"],
      "plotSummary": "In Japan, the vampire-hunter Saya, who is a powerful original, is sent by her liaison with the government, David, posed as a teenage student to the Yokota High School on the eve of Halloween to hunt down vampires. Saya asks David to give a new katana to her. Soon she saves the school nurse Makiho Amano from two vampires disguised of classmates and Makiho witnesses her fight against the powerful demon.",
      "tmdbMovieId": 919,
      "avgRating": 3.34746,
      "releaseYear": "2000",
      "numRatings": 295,
      "posterPath": "/3ySU3xS4g9KeJNCNDbVniOs3KmG.jpg"
   }
}