{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0282667",
      "video": false,
      "title": "Kung Phooey",
      "recommendations": [],
      "backdrop_path": "/ux9ddYTaxzvsTzZTXNjEJ8ISPnq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 0,
            "character": "Art Chew",
            "gender": 2,
            "credit_id": "59384b79c3a368781900080c",
            "name": "Michael Chow Man-Kin",
            "profile_path": "/nbq2adMnUKr7vFmIofsIwDxfPx3.jpg",
            "id": 230776,
            "order": 1
         }],
         "crew": []
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.31864,
      "production_countries": [],
      "id": 58255,
      "vote_count": 5,
      "budget": 0,
      "overview": "The plot follows Art Chew's (a pun of the sound one makes when sneezing) quest to retrieve the ancient peach. The movie starts with Art Chew traveling to America, as well as showing Art's training at the Shur-li temple (a play on words with the child actor Shirley Temple), showing many kung-fu clichés such as grabbing the pebble from the masters hand (which Art succeeds without effort), fighting on trees in this case small potted palms and \"listing\" for elements (Earth, Wind and Fire play a funky tune). After the montage is shown Art meets up with his cousin Wayman (A parody on the way Chinese pronounce r as w) a Chinese adult who tries to act American so he isn't embarrassed by stereotypes and foster cousin Roy Lee, an African American who sincerely believes he is a reincarnation of Bruce Lee.",
      "similar": [],
      "original_title": "Kung Phooey",
      "runtime": 87,
      "poster_path": "/teqSB5QIJzxgNnRiFC0p7CRuvNS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2003-03-11",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "All the action, twice the laughs... no M.S.G.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Darryl Fong"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Darryl Fong"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0282667/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzODE2MDQwMV5BMl5BanBnXkFtZTcwMjk3NjUzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Man-Kin Chow, Joyce Brew, Colman Domingo | See full cast and crew »"],
      "reviews": [
         "This is a very enjoyable movie that may not be very deep but definitely achieves getting a few laughs. The jokes are continuous and many do hit the right chord. It's fast paced, silly, and quirky and ends up making a very entertaining spoof. It goes against many stereotypes by spoofing everything. I was watching it with my family and they all enjoyed it. It is a fine movie for kids (despite the ridiculous R rating) and it is also fun for adults. Bottom line: If you like light-hearted slapstick spoofs - give Kung Phooey a try. *** out of ****",
         "I stumbled upon Kung Phooey at a local video store that tends to cater towards the indies and not so much of the mainstream. I was pleasantly surprised to see that a low-budget film could have such a good look to it. The cover just looked too silly for me to pass up. Sure, it's filled with cheap gags and goofy character imitations, but it is a slapstick spoof and that's exactly what I was expecting. Kung Phooey was a huge step up over the extremely disappointing Kung Pow: Enter the Fist. I seemed to notice some familiar faces in the cast too. Not sure why it's rated R...there didn't seem to be anything inappropriate. I watched it with my two kids and they loved it!",
         "Kung Phooey was a light hearted spoof with a lot of very funny scenes. It was not too vulgar or crude but had some moments. The flow of the film was pretty good. The interaction between the characters seemed natural. It was rather witty but not all together original as most spoofs are not. I thought part of the charm in this film was the lack of acting skill by the stereo typed characters. I think this just added to the humor. Face it this is not a big budget film. The plot and delivery are both funny. I would recommend this movie if you need a laugh. I was surprised by the rating. I would not let kids under 13 see the movie Kung Phooey.",
         "Despite the title, Kung Phooey! is really not so much a spoof targeting kung-fu movies as it is a spoof on cultural stereotypes of Asian Americans, particularly Asian-American males. It does take shots at the kung-fu film genre, but it is limited by its budget, and the action scenes, while well-executed considering the limitations, are few and far between. While Kung Phooey! hits a few of the obvious bases in its parodies of martial-arts films, it mostly spoofs them in ways that purposefully examine how they inform popular conceptions of Asians. While the film seeks to hide its social satire within its media/pop culture parodies, its social satire is far too unsubtle to stay below the surface. That's not necessarily a bad thing, since spoofs like this aren't about subtlety anyway, and this cultural perspective is the strongest thing Kung Phooey! has going for it. Besides, it's nice to see a film that has a message of ethnic pride but doesn't use it as an excuse to get overly serious and self-important--and parody is the perfect genre for achieving this. The message is made quite clear, but it never hits you over the head in that obnoxious, self-righteous kind of way. As a kung-fu spoof, the film is a bit lacking, but taken as a satirical response to media portrayals of Asian Americans, it's much stronger. Some jokes play better than others, but overall, it's a satisfying ride--especially for Asian-American audiences who have been thinking these things for a long time, and can now see them acknowledged on screen.",
         "I just rented Kung Phooey. Did I like it? I normally return movies I rent the next day so that I can get an early return credit, instead of keeping them for the full rental period. I rent 2-3 movies a week and I've only kept 2 movies past the first day. Kung Phooey was one of them. I wound up watching it almost daily. The comedy worked on all levels. From stuff my kids laughed at (and me, too), to higher brow stuff that had me rolling on the floor. I especially like the scene with the Jean Claude-esque character. I find myself quoting their fight scene at random moments throughout the day. Many 'indie' films tend to be 'serious' and wind up being melodramatic. I haven't seen many indie comedies, much less ones that made me laugh as much as this film. Come to think of it, most big-budget Hollywood comedies don't make me laugh as much as this film. Great work all around!",
         "Apparently the person above is a narrow-minded Nazi who lets stuff get to him to easily and needs Prozac if he's going to let a little movie ruin his entire week. I thought it was a pretty good movie. I warn you though, if you aren't into the Chinese Kung Fu movies (such as the Chinese Bruce Lee, Jet Li & Jackie Chan movies) you may not get why a lot of the jokes are funny(like the person above). Its a parody of those. If you do like those types, you'll enjoy this. I also recommend Kung Pow 1 & 2. Another thing I really didn't understand is why they give it an R rating in America!? There was hardly anything wrong with it for even a PG rating! They do this with many of the Kung-Fu movies as well.",
         "Kung Phooey is for anyone who has deliberately forced themselves to watch every eastern and western martial arts chop-socky schlock flick known to man, although only a few of these genre fans will truly appreciate where KP is coming from (and ultimately going to). As bad as this film is to any sensible movie critic, the first few minutes alone will have you spurting out your favourite beverage through your nose - the intro recreates the \"Kung Fu sanddune walkabout\" Zucker-style with many of those bizarrely unrelated visual tidbits to keep you guessing every few seconds. The rest of this film however takes itself about as seriously as a secondary school stage play and is probably just about as interesting, at least on the surface. The seemingly $2.50 budget does not give one much expectation for world-class fight choreography or acting for that matter, but if you are willing to forgo these \"small graces\" then there are many mildly amusing filmic, cultural and (the all-important) stereotypical send ups to be savoured here. Basically, Kung Phooey is the martial arts spoof home-movie that you and your mates have always wanted to make but were truly afraid to see through to fruition. As far as sustaining this one-joke-wonder into a 90 minute foray it inevitably falls short of the mark, well below that of the joke-per-minute classics like Flying High (er, Airplane). Instead, the filmmakers decided that if they couldn't be overtly hilarious, then they should at least try and be clever about the self-contained universe that all martial arts films seem to live in. The humour is thence derived from the characters often using real-world logic to dismantle their own movie-world actions and motivations that occur around them (and vice versa if that's possible). If you can, grab the DVD to watch the making-of featurette which shows all the heavenly glory of Z-budget film-making as well as the fun you can have when you really put your mind to it (you can't make a dream come true unless you have a dream). The deleted scenes also go further into a couple of other characters who should have had equal screen time with the Muscles from Brussels when he finally gets his comeuppance in the most painful way imaginable. And of course, don't forget the outtakes! If you have watched (but not necessarily enjoyed) Kung Pow: Enter The Fist for its unique take on this undervalued film genre, who knows if you will get into Kung Phooey or not ... maybe having a bottle of the cheapest booze on hand will help. But one thing is almost certain with this movie ... it will not have a sequel!",
         "This is an amusing film, and I have seen it twice and am willing to see it again; but I can't recommend it. The film is an attempt to develop a type of absurdist, parodic comedy made famous by the Zucker-Abrams-Proft team (\"Airplane!\") within the context of the martial arts genre. There are indeed funny bits throughout the film - but unfortunately they're just not funny enough. The obvious on-screen reason for this is pacing - it's not a slow or boring film; but if some reviewers express that opinion, it's because there's a flaw here that is even worse, for comedy - the timing of the gags is frequently way off. In the title sequence, for instance, we see the protagonist walking across a sand-dune ala Kane in \"Kung Fu\"; gags intervene twice, once with a toy dune-buggy zipping by from out of nowhere, the second time a woman in a bikini dives for a volleyball save. The dune-buggy shows up too late by about two comic beats (it should nearly clip the heel of the protagonist, who in the actual film has almost already walked off screen). The volleyball babe shows up about a beat too early - SHE nearly clips the protagonist's heel (when she should be behind him by at least two steps). The primary behind-camera reason for such mistakes is money; this is a really low budget film, and it's clear that they could only afford one take for most scenes. That's actually very hard to do right, and requires either actors who have their lines and staging down pat, or a really inventive director who can waltz the camera around the actors to gloss over any of their defects, and who can work wonders in an editing room. This film has neither of those counter-balancing accessories. So when a scene goes flat, we're stuck with it. So, while a lot of this movie brings a smile to my face, I can't say I actually laughed out-loud, and it's clear director Fong wants me to. Hopefully, when Fong gets the budget he needs, he can make the film this ought to have been.",
         "In the last few years, there have been several martial arts spoofs that I could recommend. If you like your humor really, really dumb (yet oddly funny), then take a look at KUNG PAO--ENTER THE FIST with Steve Oedekirk. If you want the funniest and most memorable, see Steven Chow's KUNG FU HUSTLE--a film that is much more polished and less dopey than KUNG PAO. In light of these two good and watchable martial arts send-offs, I really can't see why anyone would want to see KUNG PHOOEY!--especially since it is really dumb--and not in a good way. The humor is purely elementary school level with one dull joke after another (such as calling a holy site 'Shir Lee Temple'). Frankly, I kept waiting for the jokes to get better but they didn't. The bottom line is that life is short and I doubt if many people want to see more than one or two parodies of martial arts films--so why bother with this rather limp one?! Watchable but ultimately very stupid and, at times, very annoying.",
         "\"Kung Phooey!\" is a great comedy spoof, and you will find it particularly enjoyable if you liked movies such as \"The Naked Gun\" and \"Airplane\", and of course, also if you like Kung Fu movies. The story in \"Kung Phooey!\" was entertaining and had lots of nice touches to it, as there was references all over the place. And just like \"Airplane\" and \"The Naked Gun\" they were making fun of just about everything and even themselves. The jokes are funny and just as stupid as in other spoof movies of the same type, and that is just what makes the movie so much fun. Nothing is holy here, they make fun of all and everything. As for the action, yes there is action in the movie, it is a Kung Fu spoof after all, then I will say that it was actually quite good. Sure there was poking fun of this as well, but there was some good enough martial arts in the movie as well. The people they had cast for the roles were doing good jobs, and the names of the characters was just hilarious. I loved that touch. I was thoroughly entertained by \"Kung Phooey!\", but of course I do enjoy Kung Fu and comedies. If you like neither of these, I wouldn't recommend you watching \"Kung Phooey!\" because you will find it pointless. Let the quest for the ancient peach begin!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Kung Phooey Productions LLC",
         "Nakota Films",
         "Outpost Studios"
      ],
      "summaries": ["The chosen one from China's mystical Shur-Li Temple embarks on a hilarious quest in this high-kicking spoof of kung-fu films from director Darryl Fong. The champion fighter, Art Chew (Michael Chow Man-Kin), is sent to America by his master on a mission to find a mystical peach that holds the power of eternal life. Assisted by a distant cousin, his best friend, Roy Lee (Colman Domingo), and the comely Sue Shee (Karena Davis), Art travels to the U.S. and must outwit the evil Helen Hu (Joyce Brew) and her henchment in order to complete his mission and earn the eternal respect of his wise, bald Masters. Kung Phooey is Bruce Lee meets Naked Gun in an outrageous spoof with martial arts action and knock-out laughter for the whole family!"],
      "budget": 0
   },
   "movielensId": 27467,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-03-11",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 87,
      "movieId": 27467,
      "title": "Kung Phooey",
      "mpaa": "PG-13",
      "actors": ["Michael Chow Man-Kin"],
      "imdbMovieId": "0282667",
      "originalTitle": "Kung Phooey",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The plot follows Art Chew's (a pun of the sound one makes when sneezing) quest to retrieve the ancient peach. The movie starts with Art Chew traveling to America, as well as showing Art's training at the Shur-li temple (a play on words with the child actor Shirley Temple), showing many kung-fu clichés such as grabbing the pebble from the masters hand (which Art succeeds without effort), fighting on trees in this case small potted palms and \"listing\" for elements (Earth, Wind and Fire play a funky tune). After the montage is shown Art meets up with his cousin Wayman (A parody on the way Chinese pronounce r as w) a Chinese adult who tries to act American so he isn't embarrassed by stereotypes and foster cousin Roy Lee, an African American who sincerely believes he is a reincarnation of Bruce Lee.",
      "tmdbMovieId": 58255,
      "avgRating": 1.16667,
      "releaseYear": "2003",
      "numRatings": 3,
      "posterPath": "/teqSB5QIJzxgNnRiFC0p7CRuvNS.jpg"
   }
}