{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0294918",
      "video": false,
      "title": "Shot in the Heart",
      "recommendations": [38722],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mikal Gilmore",
               "gender": 2,
               "credit_id": "52fe4ad0c3a368484e1686d5",
               "name": "Giovanni Ribisi",
               "profile_path": "/jvq2pimmpNdQj8o75Au9RKC7E1z.jpg",
               "id": 1771,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gary Gilmore",
               "gender": 2,
               "credit_id": "52fe4ad0c3a368484e1686d9",
               "name": "Elias Koteas",
               "profile_path": "/11pXICpcdGJxGG8H8g1Bk3qc66V.jpg",
               "id": 13550,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Frank Gilmore, Sr.",
               "gender": 2,
               "credit_id": "52fe4ad0c3a368484e1686dd",
               "name": "Sam Shepard",
               "profile_path": "/6KincXfDKVQaRHwtX6qMUAwOsR0.jpg",
               "id": 9880,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bessie Gilmore",
               "gender": 1,
               "credit_id": "52fe4ad0c3a368484e1686e1",
               "name": "Amy Madigan",
               "profile_path": "/pNdNJPKRdl3veCRH8fZv3H76ywJ.jpg",
               "id": 23882,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe4ad0c3a368484e1686d1",
            "name": "Agnieszka Holland",
            "profile_path": "/t7OOYOMIre88LLiWYepg8XnF9FD.jpg",
            "id": 1128,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.693895,
      "production_countries": [],
      "id": 125842,
      "vote_count": 6,
      "budget": 0,
      "overview": "AND YOU'RE TO BLAME! Honey, you give love a bad name. (The story of a man coming to terms with the sins and secrets of his notorious brother and, in the process, exploring the legacy of violence in his own family.)",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Shot in the Heart",
      "runtime": 98,
      "poster_path": "/6KoEfokGJvrAoxjR5RUhbBL7eH1.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2001-10-13",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "He was worth more dead than he ever was alive... but not to me. I was Gary Gilmore's brother.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Agnieszka Holland"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Mikal Gilmore",
         "Frank Pugliese"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0294918/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNjY4NTI5MF5BMl5BanBnXkFtZTcwMDc3NTMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Anne Kathryn Parma, Ashley Edwards, Evyn Clark | See full cast and crew »"],
      "reviews": [
         "Shot in the Heart is wonderful. It brilliantly illustrates the plight of Gary Gimore, a convicted murder who requested death. Shot in the Heart shows the ordeal that Gilmore's family, torn up by hatred, went through. This movie is an incredible psychological study, and is wonderfully depressing and uplifting. 10/10",
         "Shot In The Heart tells the familiar Gary Gilmore story from a slightly different perspective, that of his estranged brother Mikal. Those familiar with Gilmore's tale will find this an interesting take on his story, reminding us that the victims he left behind included his own family as well as the families of the men he murdered so senselessly. Gilmore himself (played by Elias Koteas in a fantastic performance) is all here, from his cod philosophy (trust him to have read Nietsche and only quote the bits that suit him) to his complete lack of understanding of his own motives. The star of the show is, however, Giovanni Ribisi as Mikal. He has a rabbit-in-the-headlights quality, looks fragile and vulnerable and you can't believe the two are related, never mind brothers. Since Gary has been in jail pretty much continuously since the age of 14 you can see why they don't know each other, but when the movie starts you also can't see how they ever will. However blood will out ... and they find enough shared memories to build something between them that transcends the time and place in which they do it. Unfortunately there are a few things wrong with this movie. It doesn't purport to tell the whole story of Gilmore's life but that's OK, it doesn't have to. I'm pretty familiar with the source material though, so my boyfriend called on me to answer a seemingly endless run of questions: What happened to Galen? Who's Nicole? How did the two murders happen and how did he get caught? And when the younger Gilmores first appeared ... Who is everyone - which brother's which? Now I don't think a movie has to tell you everything and its sometimes better to leave things hinted at rather than explained, but there is an unnecessary level of confusion here that distracts a neophyte viewer from the action. But I'm nitpicking ... the acting alone is more than worth the price of admission. High points? The two main performances, the slimy, self-interested supporting cast, the theme of white horses, and the mysterious stranger with the sandwiches. Mikal's last meeting with Gary will make you cry ... and if it doesn't, it darn well should. I don't believe this movie got a cinema release in the UK but it is out on video this week so go get it. Highly recommended.",
         "I am a Giovanni Ribisi fan, and this film has to be one of his best. It didn't dawn on me that this was a film about THE Gary Gilmore of the 1970s. Surprise, since I wasn't really into reading newspapers back then. Contrary to other posts, there is a LOT going on in this film. Relationships are clearly defined. The Gilmore parents, Sam Shepard and Amy Madigan have a love/hate relationship. The brothers are all products of a very dysfunctional family. For the most part the plot focus on the relationship between Gary and his youngest brother Mikal. They barely know each other, but become acquainted in gut wrenching prison visits by Mikal. The prison scenes between Gary and Mikal are riveting. Using a prison phone and talking to Gary for what might be the last time Mikal (Ribisi) gives the performance of his life -it's all in the eyes as he soaks in his brother's soul and being, agonizing over what might have been. This tore me up.",
         "The acting- fantastic. The story- amazing. The script- wonderful. Just a few ways to describe this movie. Yes, it's slow and it has mostly talking, but the whole story of all of their lives and how it's told with the flashbacks thrown in and out makes you want to listen to every little thing to learn more about this haunting and tragic story. I, myself, am reading the book that the movie is based off of and it has shown me even more light into this story and answers some questions that were left unanswered in the movie. I'm also to read the Exectioner's Song, which is the 'other' half of the Gilmore story. This movie made me think so much about the phrase \"piering into the other side of the looking glass\". You hear a song in the movie called Gary Gilmore's Eyes, which is by a punk band that wrote a song about what it'd be like to have Gary Gilmore's eyes(which is one of the things Gary gave as a transplant when he died) and as you listen to it, which is after the last time Mikal ever sees Gary, you look at the whole situation a little differently if you were to only here the song itself. This movie opened my eyes in that way and in many others. I recommend this movie(and the book) very very much.",
         "An interesting TV movie based on true fact, betrayed by the description of one of the leading characters, that of a prisoner. Giovanni Ribisi plays his younger brother, who has the delicate mission of deciding if he will appeal to the courts for his brother's death penalty. But when he goes to visit him and enters Elias Koteas, the problem starts. It has nothing to do with Koteas' acting ability. He just looks like the version of a prisoner of proletarian roots according to \"G.Q.\" magazine, with a language too sophisticated for someone who has spent most of his life behind bars. This realization came to me after meeting again an old friend, whom I had not seen for almost 15 years, which he spent in several Panamanian jails. The young man I used to know is gone, not only because he is older, but due to his exposure for a prolonged time to the penal system. There are jails and there are jails, one must say, but this one prisoner in \"Shot In the Heart\" is definitely out of this world.",
         "Shot in the Heart is another of HBO's gems. They make the films that Hollywood generally ignores. Shot in the Heart is a film that takes its time to tell the story of Gary Gilmore and his most dysfunctional family in an intelligent, quite un-mawkish manner. The acting is nothing short of superb. Forget Norman Mailer and savor what must surely be a true story of this very sad event.",
         "\"Shot in the Heart\" is an excellent HBO flick with one huge, glaring fault. It is, in a word, boring. Granted, many will be absorbed by the human drama. However, in the final analysis it's still 75% conversation between a murderer on death row and his estranged brother in which they share perspectives on family matters, the Mormon church, personal perceptions, attitudes, etc. none of which are particularly interesting and much of which are yada-yada-yada about the turkey thing, the Mormon blood-letting thing, the book from Johnny Cash thing, the 1000 pushups thing, the 90 year old man thing, etc. Bravo for making an excellent film. Too bad the subject was Gary Gilmore. Recommended for the not so jaded who may find a rehash of a dysfunctional family's son-gone-wrong story of interest.",
         "This film brings some interesting aspects of modern life on our TV screen. The characters we see aren't really the strangest of all, they're actually quite what does result in such a family as the one we get to see. SPOILERS Four children, all boys. One of them not the result of the current marriage. Interestingly enough, the parents do not tell this to the person we are talking about, Frank. The childhood of the four Gilmore brothers differ from one to the other. Frank, he had to suffer most actually, but he complained least. Gary, as we are told, speaks a lot, is hated by his father but he has his mother on his side. We don't find much out about Gaylen...And the last is Mikal, the one who actually had the best/worst life of them all. He never got beaten, he never had to endure the pain his brothers had to...but he also never really knew his brothers. As it should have come, he is the only one with some success in his life out of the family. He now actually meets his brother in prison. One week before his execution. A murderer who is the result of his family. This is what can become of boy who is not loved. Who is persecuted. Gary... We don't really learn much about him, or about his \"deeds\". He never really answers Mikal's questions, \"Why?\" or \"What if..\" The one answer which kind of might disturb us is the one to the question \"What if you had reached the airport\"...Gary says he would've come and killed him. Why, the answer can be find out of the movie. Still, the way in which he tells it is quite spooky(as a matter of fact)... Do the brothers really get close? I don't believe they do. You can't really learn a man in a week. I don't think so. They might've got to know each other, but time is a luxury which they do not have. Actually, the idea of Mikal's visit to his brother is to learn if he wants to stop his execution, or if he might be able to convince him. Finally it seems that he can't...Gary has his reasons for it, of course. He wants to be free, not to live there in that rotten prison all his life..can't blame him for that, but can blame him for his actions. What I found quite strange were the rules of the prison. Initially all seems very serious, but then people start singing, and a \"one time only\" visit becomes a \"as many times as you want\" visit. I was wondering if this is because it was his last week of life, or...I would've said something about the guards, but we don't really learn much about them. Only from Gary, who is not the most of reliable sources. There is then Schiller, a guy who wants to get money after Gary's life by writing a book, and after that getting it filmed. Gary wants that, because his mother would then get the money she needed to live. It's a strange way to help, but it is all he could do. The other character, Giaque is the one who is against this... the one things I regret is that we don't really get to know these characters, only superficially. The movie as a whole is very interesting, despite having some wholes which should've been filled. Some unfinished characters... But it does make you feel the atmosphere and the pain...strange in its way, and still so normal. The performances of the actors are remarkable too. I especially liked Giovanni Ribisi, who always seemed like he was really living that life. It's worth its time, I'd say. 8/10",
         "Wow, I loved this film. It may not have had the funding and advertising that the latest hollywood blockbusters get but it packs twice the emotional punch. The tale revolves around this one family from Utah and it's the connections between the people in the family that provide the film with its punch. The main lead (Giovanni Ribisi) plays his part very well, at no time does he leave you to believe that he's acting all his feelings. It's his brother (Elias Koteas) who stole the show for me though. When the two were in scenes together they bounded their lines off of each other, giving fantastic performances. Great cast, great film.",
         "This movie affected me in more ways than I can express. It tore my heart out to see how the brothers went from strangers, to brothers. The performances were excellent, especially, the extraordinary Giovanni Ribisi. I am definitely running out to get the book tomorrow."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": [
         "Home Box Office (HBO)",
         "Levinson / Fontana Company, The"
      ],
      "summaries": [
         "In fall 1977, Mikal Gilmore and his older brother Frank Jr. ride through the Salt Lake Valley in a Rolls-Royce driven by ACLU lawyer Richard Giaque. They are on their way to Utah's Draper Prison for a \"one-time-only\" visit with their notorious brother Gary, a death-row inmate set to be executed in a few days. Convicted a year earlier of the brutal murders of two Mormon men, Gary has been sentenced to death in the wake of the Supreme Court's decision to reinstate capital punishment. Since he stands to become the first American in more than a decade to be executed, Gary has become the subject of enormous national attention, and his request to die stuns his ailing mother Bessie and confuses his brothers. Mikal and Frank hope to meet with Gary, change his mind, and get papers signed that will stay the execution.",
         "The story of a man coming to terms with the sins and secrets of his notorious brother and, in the process, exploring the legacy of violence in his own family."
      ],
      "budget": 0
   },
   "movielensId": 27525,
   "movielens": {
      "languages": [""],
      "releaseDate": "2001-10-13",
      "dvdReleaseDate": "2002-03-12",
      "directors": ["Agnieszka Holland"],
      "runtime": 98,
      "movieId": 27525,
      "title": "Shot in the Heart",
      "mpaa": "",
      "actors": [
         "Giovanni Ribisi",
         "Elias Koteas",
         "Sam Shepard",
         "Amy Madigan"
      ],
      "imdbMovieId": "0294918",
      "originalTitle": "Shot in the Heart",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "AND YOU'RE TO BLAME! Honey, you give love a bad name. (The story of a man coming to terms with the sins and secrets of his notorious brother and, in the process, exploring the legacy of violence in his own family.)",
      "tmdbMovieId": 125842,
      "avgRating": 2.5,
      "releaseYear": "2001",
      "numRatings": 6,
      "posterPath": "/6KoEfokGJvrAoxjR5RUhbBL7eH1.jpg"
   }
}