{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0306432",
      "video": false,
      "title": "My Mother Likes Women",
      "recommendations": [
         73738,
         83266,
         80540,
         61539,
         120194,
         115508
      ],
      "backdrop_path": "/xnD4dIfH5a3vTKxjRymDvYkchV7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Elvira",
               "gender": 1,
               "credit_id": "52fe49ed9251416c750d7eb1",
               "name": "Leonor Watling",
               "profile_path": "/lFOK1qKWqXOnJHFrz4MmuiSzpBP.jpg",
               "id": 101,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sofía",
               "gender": 0,
               "credit_id": "52fe49ed9251416c750d7eb5",
               "name": "Rosa Maria Sardà",
               "profile_path": "/s2fMb2fRdAmxb9pYvmYERNhZKPp.jpg",
               "id": 962,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Gimena",
               "gender": 0,
               "credit_id": "52fe49ed9251416c750d7eb9",
               "name": "María Pujalte",
               "profile_path": "/uUanLn2U1LoaEvQtQd1QaxXZDpd.jpg",
               "id": 132996,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sol",
               "gender": 1,
               "credit_id": "52fe49ed9251416c750d7ebd",
               "name": "Silvia Abascal",
               "profile_path": "/m4xb2jKE7JPN6w1K2Em0iRyHSVB.jpg",
               "id": 100667,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Eliska",
               "gender": 0,
               "credit_id": "52fe49ed9251416c750d7ec1",
               "name": "Eliska Sirová",
               "profile_path": null,
               "id": 1014908,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Miguel",
               "gender": 0,
               "credit_id": "52fe49ed9251416c750d7ec5",
               "name": "Chisco Amado",
               "profile_path": null,
               "id": 73697,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Carlos",
               "gender": 2,
               "credit_id": "52fe49ed9251416c750d7ec9",
               "name": "Xabier Elorriaga",
               "profile_path": "/l1Y4idb3SMKjTFIyzh8YuPqf7do.jpg",
               "id": 30357,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ernesto",
               "gender": 0,
               "credit_id": "52fe49ed9251416c750d7ecd",
               "name": "Aitor Mazo",
               "profile_path": "/lATPwtP5S7Egwmb8pvJn93BYBlQ.jpg",
               "id": 1014909,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Javier",
               "gender": 0,
               "credit_id": "52fe49ed9251416c750d7ed1",
               "name": "Sergio Otegui",
               "profile_path": null,
               "id": 1014910,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Bernado",
               "gender": 2,
               "credit_id": "52fe49ed9251416c750d7ed5",
               "name": "Alex Angulo",
               "profile_path": "/6wnu91irLrsgy5nF3IxRoH2qKfl.jpg",
               "id": 3813,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe49ed9251416c750d7ea7",
               "name": "Daniela Féjerman",
               "profile_path": null,
               "id": 130987,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49ed9251416c750d7ead",
               "name": "Inés París",
               "profile_path": null,
               "id": 130988,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.637144,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 97754,
      "vote_count": 10,
      "budget": 0,
      "overview": "\"Sofia introduces her three adult daughters to her new lover who is their age and happens to be a woman. The women, in particular Elvira find it extremely difficult to accept their mothers sudden apparent sexual reversal. The news pushes the neurotic Elvira to the point of nervous breakdown. Sol, the youngest daughter, writes a lude rock song about it and performs in front of them at a concert. The daughters plot together on how to get their mothers new girlfriend, a native Czech, and brilliant pianist, out of her life. Their plot goes terribly wrong and turns the film from a light-hearted comedy, into mildly amusing drama.\"",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         10735,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "A mi madre le gustan las mujeres",
      "runtime": 93,
      "poster_path": "/sByK1IBvjpSt5HGkJSHxAIWNaV8.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2002-01-11",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Daniela Féjerman",
         "Inés París"
      ],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Daniela Féjerman",
         "Inés París"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0306432/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MjAyNjEwNl5BMl5BanBnXkFtZTcwMjMxOTAzMQ@@._V1_.jpg",
      "actors": ["Stars: Leonor Watling, Rosa Maria Sardà, María Pujalte | See full cast and crew »"],
      "reviews": [
         "\"My Mother Likes Women\" is the story of a divorced Madrid concert pianist, Sofia (Rosa Maria Sarda), who stuns her three daughters with the announcement that she has a female live-in lover, a pianist twenty or more years her junior, Eliska (Eliska Sirova). Eliska is a talented Czech studying with Sofia. The two are clearly in love. Sofia's daughters, alternating between trying to accept mom's relationship and being aghast at her taking up with a young woman - or ANY woman - are a handful. The oldest, Gimena (Maria Pujalte), is in a deteriorating marriage which she stays in for the sake of her young son. The youngest, Sol (Sylvia Abascal), is a sharp-tongued rock singer with multi-hued long hair. Most interesting - and really the center of directors Daniela Fejerman and Ines Paris's comedy/drama - is the middle daughter, Elvira, played with extraordinary range and zest by Leonor Watling. The daughters concoct a harebrained scheme to break up their mother's relationship and send Eliska packing. The plan has only two serious flaws: conception and execution. The intended resolution falls prey to pratfalls and comedic miscalculations. At least for a while. There really are two stories here, Sofia and her lover and the trio's interaction with them and the saga of screwball Elvira, an employee at a publishing house, who always manages to mess up and ruin any promising relationship. Deep in therapy with a somewhat seedy psychologist, she's trying to figure out why all her self-fulfilling prophecies of doom invariably come to dreadful fruition. Complicating her life is her growing attraction to established (and very handsome) author Miguel (Chisco Amado) who's both drawn to the very beautiful Elvira and sent running off scared by her flighty, immature behavior. Leonor Watling is terrific as a neurotic in full bloom. Her insight into her very counter-productive behavior grows believably as the story unfolds. Watling has that special ability to telegraph her emotions in effective and often captivating split-second shots - she reminds me very much of the better known French actress Audrey Tautou. All the cast members are excellent but Watling steals this film. There are some nice scenes of Prague and piano pieces by Bach, Schubert and Beethoven add to the aural attractiveness of the film. Almodovar would have made these women more introspective and, surely, both bitingly cynical and more neurotic. Painfully neurotic. These women are too nice for the typical Almodovar flick. \"My Mother Likes Women\" presents complex characters in an appealing, not overly analyzed light. Simply very enjoyable. 8/10",
         "Sofia is the loving mother of three daughters, a concert pianist, and a lesbian -- in that order. Her recent discovery of her lesbian sexuality, and her relationship with Eliska, an illegal alien from the Czech Republic, is almost incidental to the film. It is certainly presented in a very matter-of-fact way, taken for granted as entirely natural and acceptable. It is not milked for titillation or homophobic humor. In fact, despite this movie's title and marketing, the fact that Sofia likes women is merely the plot device that sets things in motion and drives the action of the film. (It is also the subject of the very catchy and bouncy title song.) The real message here is that Sofia is totally in charge of every facet of her life -- something her three daughters emphatically are not. This is especially true of the middle daughter, Elvira. She is the heroine of \"My Mother Likes Women\". Where Sofia is a creative artist, Elvira doubts her ability and keeps her first novel hidden in a drawer. Where Sofia is a passionate lover, Elvira screws up every relationship with a man, including her shrink. By the end, however, Elvira learns to stand up for herself and go after what she wants in life -- and the audience stands up and cheers.",
         "This is a comedy that is best flavored in its original language. Subtitles do not give full credit to the Spanish clever dialog. This is a movie for everyone. Who would not go crazy if your mother do something assumed drastic and unexpected? The reactions of Sofia's daughters when encountered with her mother's new love are funny, then dramatic but finally leveled at the end. I laughted most of the film and the mixed audience at the theater was laughing loud too. I liked the film because it is original and funny. The acting of Leonor Watling is superb. Leonor plays Elvira, the middle daughter of Sofia. Elvira has a bag of insecurities but her sensibility is more keen than that of her sisters. She will join Sol and Gimena, her sisters, in plotting to ruin their mothers love affair with Eliska. Eliska is a talented foreign pianist about the age of Elvira. The unexpected situations created are well presented in the film. This is a wonderful comedy.",
         "In Madrid, the divorced middle-age pianist Sofía (Rosa Maria Sardà) discloses to her daughters Elvira (Leonor Watling), Gimena (María Pujalte) and Sol (Silvia Abascal) on the day of her birthday that she is in love with the talented Czechoslovak pianist Aliska (Eliska Sirová), who is twenty-years younger than she. The bigoted sisters are shocked with the revelation and do not accept the idea that their mother is lesbian. Elvira is an insecure and neurotic young aspirant writer that has a lousy job in a publishing house; Sol is the singer of a rock band; and Gimena is married with a boy and has a troubled marriage with Raúl. When they discover that her mother has lent all her savings to support the education of Aliska, they decide to seduce the girlfriend to make her leave their mother. But when Aliska returns to her country alone and their mother is very depressed, they need to try to revert the situation. Meanwhile the nervous Elvira meets the writer Miguel (Chisco Amado) and has a clumsy relationship with him. \"A Mi Madre le Gustan las Mujeres\" is a witty, funny and highly entertaining comedy with a delightful story of prejudice against sexual preference. The unknown (in Brazil) Leonor Watling is simply fantastic in the role of an unstable end neurotic young woman. There are memorable scenes, like Sol singing her song dedicated to her mother in a rock'n'roll concert; or Elvira having lunch with her boss and Miguel; or the groom kissing the bride in the wedding. In the end, I laughed a lot with this light-hearted dramatic comedy. My vote is seven. Title (Brazil): \"Minha Mãe Gosta de Mulher\" (\"My Mother Likes Woman\")",
         "This movie was really not that bad. I saw this movie as part of my class for Spanish writing, and I was pleasantly surprised. Unless you're studying Spanish, you'd probably prefer this movie in subtitles, but that's okay. Even though a few things that were said in this movie that were funny flew over my head at times, whether it be that Spanish humor is different than American humor or that I just didn't keep track of all that was said, it was still rather funny. The basic plot of the movie centers around a woman who is the middle child in a family consisting of a mother, a father, and three daughters, of which she is the middle daughter. The mother and father are divorced, and, as the literal translation of the title implies, the mother became a lesbian and began to live with a woman who is around the age of the woman that the plot centers around. The movie is basically about how this main woman, the middle child, copes with this change in her life, both on a family level and on her relationships with men. In the aspect about this working-class woman questioning her sexuality, this movie is quite a bit like the recent \"Kissing Jessica Stein\". The family aspect of the movie is a lot like \"Soul Food\", although the mother in \"Soul Food\" wasn't a lesbian. Either way, this movie wasn't a rip-off of either of these movies. The movie was altogether very original, and it had a theme which was very universal. I think that any American that sees this movie will relate to it in some way. It does take place in modern-day Spain, but could easily take place in America or Great Britain, or anywhere else within reason. There is one other thing. The funniest part of this movie is when the youngest daughter, who is in a rock band, sings a song about her mother being a lesbian. The reaction of her family in the audience is classic. I give this movie a 9/10.",
         "Easy and good film, it's about love, not simply lesbian love: family love, male-female love, girl-girl love ... and sex? not at all (amusing film anyway). A well constructed comedy with a funny and beautiful Leonor Watling, great performance, without her the film will be less interesting, and the story is as I have said funny, see it and enjoy it.",
         "Leonor Watling shows her great talent for the comedy genre in this amusing, weel-made film which fails in portraying the central conflict. The lesbian relationship between the mother's character (Rosa Maria Sarda, wonderful as always)and her lover is totally unbelievable and artificial - they don't even kiss each other during the whole film! - and that affects the credibility of it all. You'll sure have a good time, but it's a real pity that the directors didn't hold the central subject with more bravery than that.",
         "This is a very interesting and original film with two great actresses: Rosa Maria Sardà and Leonor Watling; Leonor is very pretty and make a great performance like a girl with a lot of problems. All the film is for laugh, for enjoy....Good. (8/10)",
         "this movie is funny. there are many elements for various plots. the characters are enjoyable as well. the story is cute. but, it lacked strength for a lesbian movie. the relationship between the mother and her young girlfriend seems very much similar to that of the relationship with her daughters. there was no chemistry and no intimacy beyond hugs. yet, the daughters are caught in deep, romantic kisses and the beginnings of sex scenes with men throughout the film. it's quite unfortunate to me that a movie with the main theme of a romantic relationship between 2 women does not have the strength to show that beyond hugs. i believe that censoring took away from the worth of the movie.",
         "\"My Mother Likes Women\" is a subtitled Spanish comedy about what happens when a divorced middle aged Madrid mother introduces her three adult daughters to her new lover...a woman. Bemused at the mother's lesbian leanings the three daughters set about to cope with the situation which, of course, leads to a variety of contrived comic moments. Breezy, fun, bright, and well directed, this film is a showcase for Lenor Watling's worthy characterization of the middle daughter; the centerpiece of the film. \"My Mother Likes Women\" should appeal most to Watling fans, lesbians, females in general, and aficionados of Spanish cinema. Subtitle translations are below par. No nudity and should qualify for about a PG-13 rating for mature theme elements. (B)"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Fernando Colomo Producciones Cinematográficas S.L."],
      "summaries": [
         "In Madrid, the divorced middle-age pianist Sofía discloses to her daughters Elvira, Gimena and Sol on the day of her birthday that she is in love with the talented Czechoslovak pianist Aliska, who is twenty-years younger than she. The bigoted sisters are shocked with the revelation and do not accept the idea that their mother is lesbian. Elvira is an insecure and neurotic young aspirant writer that has a lousy job in a publishing house; Sol is the singer of a rock band; and Gimena is married with a boy and has a troubled marriage with Raúl. When they discover that her mother has lent all her savings to support the education of Aliska, they decide to seduce the girlfriend to make her leave their mother. But when Aliska returns to her country alone and their mother is very depressed, they need to try to revert the situation. Meanwhile the nervous Elvira meets the writer Miguel and has a clumsy relationship with him.",
         "Sofia introduces her three adult daughters to her new lover who is their age and happens to be a woman. The women, in particular Elvira find it extremely difficult to accept their mothers sudden apparent sexual reversal. The news pushes the neurotic Elvira to the point of nervous breakdown. Sol, the youngest daughter, writes a lewd rock song about it and performs in front of them at a concert. The daughters plot together on how to get their mothers new girlfriend, a native Czech, and brilliant pianist, out of her life. Their plot goes terribly wrong and turns the film from a light-hearted comedy, into mildly amusing drama."
      ],
      "budget": 0
   },
   "movielensId": 27576,
   "movielens": {
      "languages": [
         "Český",
         "Español"
      ],
      "releaseDate": "2002-01-11",
      "dvdReleaseDate": null,
      "directors": [
         "Daniela Féjerman",
         "Inés París"
      ],
      "runtime": 93,
      "movieId": 27576,
      "title": "My Mother Likes Women",
      "mpaa": null,
      "actors": [
         "Leonor Watling",
         "Rosa Maria Sardà",
         "María Pujalte",
         "Silvia Abascal",
         "Eliska Sirová",
         "Chisco Amado",
         "Xabier Elorriaga",
         "Aitor Mazo",
         "Sergio Otegui",
         "Alex Angulo"
      ],
      "imdbMovieId": "0306432",
      "originalTitle": "A mi madre le gustan las mujeres",
      "genres": [
         "Drama",
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "\"Sofia introduces her three adult daughters to her new lover who is their age and happens to be a woman. The women, in particular Elvira find it extremely difficult to accept their mothers sudden apparent sexual reversal. The news pushes the neurotic Elvira to the point of nervous breakdown. Sol, the youngest daughter, writes a lude rock song about it and performs in front of them at a concert. The daughters plot together on how to get their mothers new girlfriend, a native Czech, and brilliant pianist, out of her life. Their plot goes terribly wrong and turns the film from a light-hearted comedy, into mildly amusing drama.\"",
      "tmdbMovieId": 97754,
      "avgRating": 3.45,
      "releaseYear": "2002",
      "numRatings": 10,
      "posterPath": "/sByK1IBvjpSt5HGkJSHxAIWNaV8.jpg"
   }
}