{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "eroticism",
         "id": 1664
      }],
      "imdb_id": "tt0323807",
      "video": false,
      "title": "Remember Me, My Love",
      "recommendations": [
         20069,
         38328,
         12308,
         20068,
         40817,
         53915,
         51917,
         53955,
         58219,
         57795,
         38327,
         38366,
         9789,
         56400,
         36940,
         16729,
         15681,
         42399,
         22728,
         42420
      ],
      "backdrop_path": "/wqu0kdq7WAfKclvN43H6jgrhVPT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Carlo Ristuccia",
               "gender": 1,
               "credit_id": "52fe46ef9251416c9106499b",
               "name": "Fabrizio Bentivoglio",
               "profile_path": "/uODahcGkpEJJNPPZNw06ET5V9d5.jpg",
               "id": 121732,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Giulia Ristuccia",
               "gender": 1,
               "credit_id": "52fe46ef9251416c9106499f",
               "name": "Laura Morante",
               "profile_path": "/AgidnVEP8Xpfph6B1RPes1bBjwx.jpg",
               "id": 56654,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Alessia",
               "gender": 1,
               "credit_id": "52fe46ef9251416c910649a7",
               "name": "Monica Bellucci",
               "profile_path": "/nkrIGojQy6FNn9s5cfpiUAmLeNz.jpg",
               "id": 28782,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Paolo Ristuccia",
               "gender": 2,
               "credit_id": "5986454a9251413d5d006f3a",
               "name": "Silvio Muccino",
               "profile_path": "/n4MYkMsLLNRHAM78LYRk10l6Ifv.jpg",
               "id": 87010,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Valentina Ristuccia",
               "gender": 1,
               "credit_id": "52fe46ef9251416c910649a3",
               "name": "Nicoletta Romanoff",
               "profile_path": "/nLr0SEzJQv283lmmOHHkn7EjdrB.jpg",
               "id": 121733,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Alfredo",
               "gender": 2,
               "credit_id": "59864557c3a3683276006579",
               "name": "Gabriele Lavia",
               "profile_path": "/pe0OwFx8gokfPZVMxu9tSJk2OKD.jpg",
               "id": 80503,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Stefano Manni",
               "gender": 0,
               "credit_id": "59864566c3a3683234007a03",
               "name": "Enrico Silvestrin",
               "profile_path": "/rhrs3EJwJTj6C1uiYm5q4EHlv8Y.jpg",
               "id": 120157,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Elena",
               "gender": 0,
               "credit_id": "598645739251413d18007210",
               "name": "Silvia Cohen",
               "profile_path": "/47L62wmoT5nvETWVJEno31IEKn1.jpg",
               "id": 235048,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Riccardo",
               "gender": 0,
               "credit_id": "59864583c3a3683266006e79",
               "name": "Alberto Gimignani",
               "profile_path": "/f3678mPHJldFdVz0vxrT1ZlO8IW.jpg",
               "id": 239482,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Louise",
               "gender": 1,
               "credit_id": "59864590c3a368320e006c8e",
               "name": "Amanda Sandrelli",
               "profile_path": "/nt3vPTOrOYZ8aYl2pixOS9gYYJF.jpg",
               "id": 55913,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Matt",
               "gender": 0,
               "credit_id": "5986459a9251413d39006de4",
               "name": "Blas Roca-Rey",
               "profile_path": "/yaRmENm6mqspc4ZN4thnhWjhse2.jpg",
               "id": 1324217,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Paolo Tucci",
               "gender": 0,
               "credit_id": "598645a7c3a3683251006abf",
               "name": "Pietro Taricone",
               "profile_path": "/btw2NU7M1DpLgJfqHixowyXqHt7.jpg",
               "id": 234860,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Ilaria",
               "gender": 1,
               "credit_id": "598645b59251413d42006f9d",
               "name": "Giulia Michelini",
               "profile_path": "/3kQeCE3mUrTqwbCpXNjErg5ywSA.jpg",
               "id": 120130,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Anna Pezzi",
               "gender": 0,
               "credit_id": "598645c19251413d2b006e93",
               "name": "Maria Chiara Augenti",
               "profile_path": "/rXfIBESqN3Wv9VySBuI9iXFwEIF.jpg",
               "id": 120182,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Luigi",
               "gender": 0,
               "credit_id": "598645cb9251413d5d006fdd",
               "name": "Andrea Roncato",
               "profile_path": "/8RBBWhQQi88Pzrrd2wdGAWTgPM7.jpg",
               "id": 120107,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "André",
               "gender": 0,
               "credit_id": "598645d8c3a3683234007ab2",
               "name": "Stefano Santospago",
               "profile_path": "/hRcZoVi10PRSlAoiRV0PJGMvOzZ.jpg",
               "id": 129625,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Lucia",
               "gender": 0,
               "credit_id": "598645e7c3a368320e006cf9",
               "name": "Isabella Orsini",
               "profile_path": "/qmKLcAcTek7LpQLckIn3kaOuj9k.jpg",
               "id": 1303032,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Martina",
               "gender": 0,
               "credit_id": "598645f5c3a368329b007931",
               "name": "Guaia Marini",
               "profile_path": null,
               "id": 1864309,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Regista",
               "gender": 0,
               "credit_id": "598646059251413d180072b6",
               "name": "Luca Jurman",
               "profile_path": "/kTeyNZlVhFaWo7qydRaB3DBlrnU.jpg",
               "id": 1864310,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Professoressa di Paolo",
               "gender": 0,
               "credit_id": "599c3cb8c3a368783e009867",
               "name": "Clemenza Fantoni",
               "profile_path": "/3DtOVt5BKG7SvRCZShAgC8eKavb.jpg",
               "id": 1871239,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Anestesista",
               "gender": 1,
               "credit_id": "59e3eba2c3a36846ae01c1c1",
               "name": "Roberta Cartocci",
               "profile_path": "/oCltXeLRYmwdCFrdjSiNj7heagD.jpg",
               "id": 1897959,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Ex calciatore",
               "gender": 0,
               "credit_id": "59f3570ac3a36871000148e2",
               "name": "Massimo Molea",
               "profile_path": "/xbh3P8MTtXEBnDAQRM9Q9pZSgpl.jpg",
               "id": 141555,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ef9251416c910649ad",
               "name": "Gabriele Muccino",
               "profile_path": "/uU23lwEwz3TnHl0DvvyePpaGuEG.jpg",
               "id": 20646,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ef9251416c910649b3",
               "name": "Gabriele Muccino",
               "profile_path": "/uU23lwEwz3TnHl0DvvyePpaGuEG.jpg",
               "id": 20646,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.097191,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 38970,
      "vote_count": 68,
      "budget": 0,
      "overview": "The story of a normal Italian family in which come out the dreams of those who have lost their possibilities and of those who want to realize them. Carlo and Giulia are a married couple who have each given up their aspirations in order to live an average life. Their 19-year-old son, Paolo, is having trouble finding an identity, while their 18-year-old daughter, Valentina, has already figured out how to use sex to her advantage. The family goes through a crisis when Carlo begins having an affair, Giulia attempt to seduce the director of a local stage production she is in, and Valentina does what she does best to land an audition for a TV show",
      "similar": [
         64586,
         345,
         10068,
         10497,
         884,
         802,
         26648,
         4561,
         402,
         755,
         9540,
         84427,
         19173,
         53932,
         8653,
         73454,
         3594,
         28468,
         86331,
         418827
      ],
      "original_title": "Ricordati di me",
      "runtime": 125,
      "poster_path": "/abPnBHUm7b3r1NO2LGo0ltlBkRg.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fandango",
            "id": 2441,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Medusa Film",
            "id": 6246,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tele+",
            "id": 15139,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vice Versa Film",
            "id": 34529,
            "origin_country": ""
         }
      ],
      "release_date": "2003-02-11",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Some loves are never forgotten",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Gabriele Muccino"],
      "runtime": 125,
      "synopsis": null,
      "writers": [
         "Gabriele Muccino",
         "Gabriele Muccino"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0323807/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1MTU5NTY3Nl5BMl5BanBnXkFtZTcwODUyMDcyMQ@@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Fabrizio Bentivoglio, Laura Morante, Nicoletta Romanoff | See full cast and crew »"],
      "reviews": [
         "Yesterday I saw this excellent movie, and it is still lingering in my brain and my soul. I merely liked, not loved, Gabriele Muccino's smash Italian hit L'Ultimo Bacio when I saw it, since its depiction of thirtysomething doubts and fears left a sort of slightly fake aftertaste in my mouth. Plus, it waned out of my mind in a couple of hours, even though I had enjoyed while I was in the theatre. Ricordati Di Me is a very, very different deal. It's a delicate, multi-faceted, true and touching punch in your stomach. Well written and well played - especially by the extremely skillful and absolutely charming Fabrizio Bentivoglio, who's one of Italy's most gifted thesps as well as the longtime boyfriend of Rain Man's Valeria Golino (here you see him pouring his heart out onscreen with painful, searing directness) - the movie brings you into the home of a dysfunctional Italian family not dissimilar from so many dysfunctional Italian families. Meet them: there is the melancholic, romantic, slightly frustrated husband Carlo (played by Bentivoglio), who's an obscure white-collar worker who once wanted to be a writer and keeps a sensitivity that leaves him totally exposed to raw emotions and to the eventual unfair blow of fate, all of this while keeping as well a still-unfinished novel in one of his drawers; then there is his VERY frustrated teacher wife (played by the ever-classy Laura Morante), who once wanted to be a stage actress. They've got two teenage kids, one of them a vain and egotistical 18-year-old daughter, keen on only one thing, i.e. becoming a TV starlet (played by stunning newcomer Nicoletta Romanoff), and the other one a vaguely leftish, pot-smoking daydreamer senior high schooler son (played by the director's brother). Nothing new or revolutionary here, be sure of that, but the whole tale elaborated by Gabriele Muccino about the emotional disintegration of this apparently average family is narrated with passion and participation, both by its writer-director and by the actors. The foursome meet enormous difficulties in communicating with each other - not only the parents with their children do, but also each of them with any other one, and egotism and indifference run rampant, especially in the veins of Valentina, the young daughter, who's a truly upsetting spectacle to watch, what with her relentless pursuing of a tinsel world, a world made of garish make-up, TV studios and squalid sex relationships with one or the other TV beefcake idol, since this girl, while still looking very innocent on the outside, would do anything to be cast in some cheesy TV show as one of the decorative babes who strut and grind in the background. So, when you see Carlo, the husband, falling again - after many years - for married and unsatisfied mother of two Alessia (the ever-stunning Monica Bellucci, here way more expressive and intense than usual), an old flame of his youth, you just cannot think, not even for a second, of him as a middle-aged philanderer, or of Alessia as your typical homewrecker. The rekindling of their love is something so pure, so tender, so NEEDED by both these characters, that you can't help rooting for them - and be heartbroken when things just become spinning in a totally unpredicted direction, which I don't want to spoil for you. I also truly appreciated the open ending, which leaves the audience enough room to imagine whatever they like for the future life of these characters, who've just been, anyway, through a journey able to break - once and for all - the walls of hypochrisy that previously surrounded them. Go and see this movie, you won't regret it.",
         "RECORDATI DI ME is a beautifully written and constructed film by Italian director Gabriele Muccino about the workings of a 'normal middle class' family and the bonds and challenges that peak at the time of fragmentation of the family unit that accompanies 1) middle age of the parents and 2) departure of the children at the end of high school. How those crises and adjustments inform the durability of the family unit makes up this thoroughly engrossing and touching film. Carlo Ristuccia (Fabrizio Bentivoglio) is the father embedded in a life long job that is mundane and not at all in line with his dreams of being a writer (he has been writing a novel for years, yet unfinished). His wife Giulia (Laura Morante) is a committed mother but longs to return to the acting stage she abandoned for marriage. Their two children are Valentina (Nicolette Romanoff) who is determined to become a glamorous TV star and Paolo (Silvio Muccino) who is aimless in his desire for a life of meaning, a life which would prove he is not as unexceptional as he views himself. Gradually each member of the family encounters escape routes: Carlo meets his old girlfriend Alessia (Monica Bellucci) and begins an affair with her; Giulia is asked to audition for a part in a play directed by one Alfredo (Gabriele Lavia) who makes her feel desirable and noticed; Valentina sleeps around to land a part in a TV giveaway show 'Ali Babbi', and Paolo attempts to attach himself to a girlfriend by planning a birthday party with contraband hashish which he feels will make him appear important in the eyes of his peers. As each of these crises reaches a peek, Carlo sustains a back injury while fleeing his home and his resultant hospitalization results in altered perceptions of what the family is all about. The twists and turns of the plot are, of course, far more involved than this short synopsis, and it is the development of each of these characters and the way that they approach change that makes the film work so well.The acting is excellent and the direction is past paced even for a two and a half hour movie. Yes, much of this has been said before, but the wit and pathos combine to create a story well worth telling and watching. It is a story about dreams, lost possibilities, and the need to fulfill them.",
         "I watched \"Ricordati di me\" and it felt like a polite conversation that avoids self criticism and only accepts one's personal dreams and ambitions. A conversation that accomplishes nothing since the subconscious is too scared to embark on the dreams because there is no safety net. 'Remember Me, My Love,' as it is known in North America, is a great film that reveals the superficial mask of the family unit. It is the story of a family and its progressive loss of balance between the self and the public sphere of conventional happiness. This film begins beautifully with the personal woes of the family members and the audience can sense the inevitable tipping of the cauldron. The crossroads for most of the characters is based upon their personal potential and their own self-interests versus the ones created by their environments. For Carlo Ristuccia (played wonderfully by Fabrizio Bentivoglio), Giulia (another great performance by Laura Morante) and Alessia (played by the very talented Monica Belucci) the question at hand is based upon their waning existence. They all seem to feel lost and monotone while they struggle to feel the youthful sensation of bliss and love. The opening sequence is perfectly written and shot to portray the Ristuccias one dimensional life. The screenplay, subtle in its work, progressively displays the inevitable choices to be made by the members of the Ristuccia family. However, as the characters embark on their selfish adventures, they digress from their intentions and they seem to blindly be repeating their mistakes. Giulia attempts to reconcile her acting career yet fails to see the theme of the play as a reflection of her own state. Carlo, failing to write the last chapter of his novel, never completes his work because he is afraid to risk and lose. He, along with the rest of his family, tries to balance between the want and the need. A problem that is never realized - even in the end. \"Remember Me, My Love\" is a film that could have benefited from some slight editing, especially concerning Valentina's storyline, yet the end product leaves you feeling like the characters - a false sense of hope but a bigger sense of loss. This film strikes a reminiscent chord for its audience because it deals with loss - the loss of dreams, the loss of love - and its battle with throwing in the towel. None of the characters experience true happiness however they've convinced themselves at times. The first and final shot sum up the film beautifully as it questions the choices made by each of the man characters. It's all a facade, so enjoy the show.",
         "Just like the director's previous effort _The Last Kiss_ this movie is about life. And no one brings more realism to his representations of the human condition than Muccino. There's pain and suffering, there's pleasures and elation, loss and gain, sadness and happiness but mostly a search to find ourselves in the time we have been given. Unlike one-dimensional American movies, Muccino's films show how with pleasure comes pain and that in pain are the seeds of pleasure. The acting is perfect. Bellucci looks gorgeous and so does Laura Morante. There is so much going on in this film that invariably, some story lines will be less interesting to some than others. This and _The Last Kiss_ are great celebrations of life.",
         "\"Remember my Name\", directed by Gabriele Muccino, kept reminding this viewer about his previous film, \"The Last Kiss\", because in both, the main characters at the center of each story are named Carlo and Giulia. Could this 2003 has anything to do with the other one? Or was it just a coincidence? We don't get any actual fact to tie both movies together, but in a way, the two movies deal with an inner crisis that the two Carlos must face and come to terms with. This new film has a frenetic pace in the first hour. It seems as though Giulia and Carlo's relationship is strained, despite the somehow normal family life they lead. This is a film that asks a lot from its viewers, as they try to keep pace with the quick tempo Mr. Muccino gives the picture. It's clear to see that things aren't exactly the best between husband and wife. Carlo is at a point in his life where he can't deal with a job he doesn't care about and Giulia wants to go back to an acting career that didn't materialize when she married Carlo. Valentina, the young daughter, wants to pursue a career in television where beauty and a fast friends view her as a desired commodity. Paolo, the son, is an uncool youth who wants to belong in a world he is not cut out for. When the gorgeous Alissia enters the picture, Carlo can't resist seeing her again; they have been lovers before, but have lost track of each other in the succeeding years. Their relationship has a negative effect on both households, as Alissia is by now married, and Carlo loses his head when he decides to quit his job and renew his relationship with Alissia. When Carlo suffers a freak accident that sends him to the hospital for a long time, Giulia and the children rally to support him. In fact, this should be something to change Carlo's attitude in forgetting Alissia, but is it? We realize the accident and his gratitude to his wife and kids will be questioned again when we see him in the final moments of the film in the supermarket where he sees Alissia with her two young children as they make last minute Christmas preparations. Fabrizio Bentivoglio makes us care for the complex Carlo, a man whose passion has been dormant for a long time. Laura Morante, plays Giulia, the woman who has to make choices and wants to keep everyone together. Monica Belucci is seen as Alissia, the one that never stopped loving Carlo. The movie has a great look thanks to the camera work of Marcello Montarsi. The music by Paolo Buonvino is also an asset in the film. Gabriele Muccino, with this new movie proves to be an important voice in the Italian cinema today and we await for his new film with interest.",
         "In the dysfunctional Italian middle-class family Ristuccia, the middle-aged executive Carlo (Fabrizio Bentivoglio) has a stalled life without passion, bored in his work and having a monotonous life with his wife Giulia (Laura Morante). Giulia is a frustrated and hysterical woman because she gave up of being an actress in her youth to dedicate to the family. Their needy son Paolo (Silvio Muccino) feels lost and rejected, trying to find who he is and flirting with a schoolmate. Their seventeen years old daughter Valentina (Nicoletta Romanoff) is decided to work in a television show, and is fighting to have an audition. When Carlo meets his former sweetheart Alessia (Monica Bellucci) in a class reunion, they confess to each other that their marriages are in crisis and both feel passion arising again. Meanwhile Giulia is invited to an audition in a stage production and to participate of a play. Paolo tries to make friends using marijuana in his birthday party, and Valentina has sex with different guys trying to be a dancer of the famous TV show 'Ali Babbi'. Their relationships change when Carlo has an accident. Two years ago, I saw \"L'Ultimo Bacio\" on DVD, a beautiful and delightful movie about relationship in different phases of life directed by Gabriele Muccino. I was impressed with this director, and recently it was released \"Recordati di me\" on DVD in Brazil. I have just watched and it is amazing the sensibility of this director with the dynamics and feelings of a family, presenting a tale of passion, frustration and dreams. The realistic relationships between the members of this common middle-class family is disclosed though the lost dreams and passions of the parents, and the dreams and aspirations of their son and daughter. The cast is amazing, with a sensational Laura Morante, the stunning Monica Bellucci, the sexy Nicoletta Romanoff and the impressive Fabrizio Bentivoglio and Silvio Muccino, all of them perfect in their respective roles. This movie is recommended for those viewers that want to see a realistic, full of sentiments and never corny dramatic tale. My vote is nine. Title (Brazil): \"No Limite das Emoções\" (\"In the Limit of the Emotions\")",
         "This movie is hard to absorb, partly because the dialogue is difficult in translation and partly because of the fading and mixing of scenes that introduce the 4 character stories within. Four people in a family so plausibly like middle class families everywhere, except here in Italy the members are more likely to be beautiful, handsome, suave, and worth staring at for some feature or another. Muccino shows us that the happiness we work for within a family is easily thrown away (no wonder there is so much divorce), but that the common need to have one place where we think we can be recognized and loved for who we are can bind even the most dysfunctional family unit. Each character here is struggling with ego. Carlo (the handsome Fabrizio Bentivoglio whose hair belongs on marble statues) wants romantic love and an escape from boredom of his job and family -- he ought to have had something different, but he doesn't, and honestly he is the middle of middle class personified -- a salesman working on number 8 sale. Guilia (Larua Morante -- among the most beautiful of Italian actresses currently) is hopelessly insecure but pictures herself as a great stage actress, which is might possibly be -- if it really was her obsession -- the real obsession being to retain the normality of her marriage facade. Valentina (Nicoletta Romanoff) is the a self absorbed teen age bod beautiful with the hips and hair of her generation -- so anxious for a bit role in a dreadful television programme to recognize her beauty. And finally Paolo (A Muccino relative surely) desperate for recognition of his specialness. All want recognition for the specialness and at the same time the security of the familiar. Every moment of this movie shows the tension between the desire for a self-perceived \"fame\" or \"happiness\" based on selfishness and the pull that conventional family love provides. These characters recognize true happiness when the routine is threatened and Fabrizio faces possible paraplegia. The other three cannot (although they do) contemplate anything but return to the beginning. Scene after scene develops the characters -- and portrays their dilemma of self versus family -- something many of us continually face when lucky enough to have a unit that is at the same time crushing of self and supportive of \"love\". The ending is perfect -- smile, Fabrizio-- One was left knowing that nothing had really changed for this family or the individuals involved although 3 of them appeared to get what they wanted -- and even Fabrizio got his \"break\" from routine. Maybe he was the unluckiest and had to smile the hardest as he built his selfish love on a dream that had no apparent fulfillment (NO BRIEF ENCOUNTER THIS -- just a desire for a Brief Encounter). I imagine this movie was very disappointing to many -- it was a treat to one who scoured the video store for something different and found a depiction of every day life that was hopeful and helpless and maybe the description of a happiness that is never fully satisfactory but we are required in the end to accept -- and to live without ever being fully aware.",
         "Spoiler alert! If you go to a movie to see action, special effects, and lots of sex and violence, this isn't the film for you. If you do like to see quality acting and stories about real life and relationships, this is for you. In fact, everyone in Carlo's family (his wife, his son and his daughter) are all looking for something more in life than what they have. Fabrizio Bentiviglio gives an excellent performance as the aloof Carlo, who wants to feel alive again. Laura Morante is also quite good at being the ultra-annoying housewife (Giulia) who does her best to push Carlo away without trying. Monica Bellucci is still beautiful at almost 40 years of age in this film. She plays the other woman (Alessia) who is a long lost love of Carlo's, and she's also married. Before the movie is over, you want to see Carlo and Alessia together, even though both of them have spouses and children to think about. All of the characters experience life-changing events that change them forever; some for the better, others not. The casting is excellent in this film. Silvio Muccino plays Paolo, Carlo's son, who is tired of feeling like a loser and pining for a girl named Ilaria. It's scary how much Silvio looks like a younger version of Fabrizio. Nicoletta Romanoff plays Valentina, Carlo and Giulia's daughter. She wants to be a television star, and will do anything to get there. It is a good movie with exceptional acting that leaves you with a bittersweet feeling in the end.",
         "Ok, we read/heard/saw a lot here in Italy about Muccino's new production before its release and perhaps i was somehow expecting too much when I finally saw it. The movie deals with the difficulties of an italian family whose members either face their youth's broken dreams or try (too?) hard to make them become real. It opens nicely: the characters' personalities are presented in a lively and pleasant way. Carlo's (F. Bentivoglio) routine life is shaken up after meeting casually a former love from high school, Alessia (M. Bellucci); both turn out to be left unsatisfied by their present situation, for slightly different reasons however (one lost his ambitions of becoming a writer, the other is simply hurt by the husband's behavior). They feel attracted by each other again, then decide to catch this opportunity for a brand new start. Carlo's frustrated wife Giulia (L. Morante) once wanted to be an actress on stage but ends up a school teacher because supposedly of her husband's jealousy. It's at the moment her daughter Valentina (N. Romanoff) decides to become a TV starlet that she's offered her first role. Few can be said concerning Carlo's pot-smoking son, Paolo. Well, he appears in sharp contrast with all the other protagonists by his lack of ambitions; his main problem appears to be finding (and keeping) a girlfriend. I really enjoyed the first hour: the rhythm goes higher and higher as the main two characters start again to burn for each other. The scene between Carlo and his boss is simply fantastic in the italian version. Monica Bellucci looks very natural as a beautiful and decided mother in her late thirties. The action is well served by a succession of short but efficient scenes with a very mobile camera and sharp dialogs. Afterwards, the movie sinks into a moralistic tale for conventional italian middle-class. A long description of the superficial and twisted world of TV where Valentina wants to dig her own hole at any cost; is there anything original inside all that ? Besides, not a single minute is spent on her feelings; could it be a 17yrs old girl with no apparent problems filled only with egoism and cynicism ? If yes, what about explaining that a little bit ? Meantime Laura Morante shows all her (big) talent in her hysterical scenes but this doesn't save the day because of many shortcomings in the script. Among many others: how it can be that someone who's ready to leave his family completely forgets to call back for days and weeks ? What about the TV guy getting mad in his house because of his child he cannot see: does this bring anything to the movie's main concern ? And this ultimate try of Carlo trying to meet again with Alessia despite the fact it's not known if he's still able to have sex anymore ... A question raises naturally: why did the director choose to represent every woman (either Alessia or Valentina) who wants to achieve something different compared to the standard italian housewife in such a negative way ? Besides, I've not been able to understand if Carlo's book is crap or not or if Giulia's play is interesting or ridiculous (at least we know it's noisy!). All these points are left open and this prevents the watcher to make any kind of judgement about the adults while the kids are depicted in a simplistic way. All in all, it could have been a great movie: good actors involved in an interesting plot shot in a beautiful location. However, the second part of the film leaves the impression that the director hasn't been able to make all that stick together and then decided himself for a dull conclusion. *** out of 5.",
         "There's a strange sort of paradox at work in \"Remember Me, My Love,\" an Italian film that seems to be operating under some bizarre inverse law of quantum physics. For while the movie itself moves at a breakneck pace, hurtling from one scene to another with near-reckless abandon, we can't help noticing that the faster it goes, the slower it seems. Perhaps, we simply wear ourselves out trying to keep up with it and it is this exhaustion factor that ultimately accounts for our restlessness and ennui. \"Remember Me, My Love\" focuses on a family of four, whose members haven't been getting along too well of late. The parents, Carlo and Giulia, are both trying to find ways to cope with a bad case of middle aged crisis: he, by rekindling a romance with a beautiful former flame, and she, by pursuing the career in acting she abandoned when she became a wife and mother. Their children, Valentina and Paolo, are typical adolescents, all caught up in rebellion, identity crises and complicated affairs of the heart. Although the film attempts to provide some insight into the complexities of modern family life, the characters come across as so whiny and self-indulgent that any sympathy they might have engendered on the part of the audience quickly turns to indifference and even irritation. The actors do their best (particularly Laura Morante as Giulia), but the characters they are called on to play never engage us much beyond the surface level. This lack of depth is further compounded by the whirlwind nature of the storytelling, which rarely allows the actors the time they need to settle down and work out the subtle nuances of their roles. In all fairness, I must admit that, in the second hour, the film improves considerably, trafficking in some genuinely raw emotions that exemplify the devastating effects that a disintegrating marriage can have on all members of a family. Moreover, the film ends on a courageously inconclusive note, which goes a long way towards mitigating some of the theatricality and artificiality that permeate the rest of the movie. Taken as a whole, \"Remember Me, My Love\" turns out to be much less than the sum of its parts, but the performances and a few good scenes do make it palatable."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Fandango",
         "Buena Vista International Film Production France",
         "Vice Versa Film"
      ],
      "summaries": [
         "In the dysfunctional Italian middle-class family Ristuccia, the middle-aged executive Carlo has a stalled life without passion, bored in his work and having a monotonous life with his wife Giulia. Giulia is a frustrated and hysterical woman because she gave up of being an actress in her youth to dedicate to the family. Their needy son Paolo feels lost and rejected, trying to find who he is and flirting with a schoolmate. Their seventeen years old daughter Valentina is decided to work in a television show, and is fighting to have an audition. When Carlo meets his former sweetheart Alessia in a class reunion, they confess to each other that their marriages are in crisis and both feel passion arising again. Meanwhile Giulia is invited to an audition in a stage production and to participate of a play. Paolo tries to make friends using marijuana in his birthday party, and Valentina has sex with different guys trying to be a dancer of the famous TV show 'Ali Babbi'. Their relationships change when Carlo has an accident.",
         "The story of a normal Italian family in which come out the dreams of those who have lost their possibilities and of those who want to realize them. Carlo and Giulia are a married couple who have each given up their aspirations in order to live an average life. Their 19-year-old son, Paolo, is having trouble finding an identity, while their 18-year-old daughter, Valentina, has already figured out how to use sex to her advantage. The family goes through a crisis when Carlo begins having an affair, Giulia attempt to seduce the director of a local stage production she is in, and Valentina does what she does best to land an audition for a TV show."
      ],
      "budget": 5000000
   },
   "movielensId": 27644,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Italiano"
      ],
      "releaseDate": "2003-02-11",
      "dvdReleaseDate": "2005-03-22",
      "directors": ["Gabriele Muccino"],
      "runtime": 125,
      "movieId": 27644,
      "title": "Remember Me, My Love",
      "mpaa": "R",
      "actors": [
         "Fabrizio Bentivoglio",
         "Laura Morante",
         "Monica Bellucci",
         "Silvio Muccino",
         "Nicoletta Romanoff",
         "Gabriele Lavia",
         "Enrico Silvestrin",
         "Silvia Cohen",
         "Alberto Gimignani",
         "Amanda Sandrelli",
         "Blas Roca-Rey",
         "Pietro Taricone",
         "Giulia Michelini",
         "Maria Chiara Augenti",
         "Andrea Roncato",
         "Stefano Santospago",
         "Isabella Orsini",
         "Guaia Marini",
         "Luca Jurman",
         "Clemenza Fantoni",
         "Roberta Cartocci",
         "Massimo Molea"
      ],
      "imdbMovieId": "0323807",
      "originalTitle": "Ricordati di me",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["AFQuK5jOpKU"],
      "plotSummary": "The story of a normal Italian family in which come out the dreams of those who have lost their possibilities and of those who want to realize them. Carlo and Giulia are a married couple who have each given up their aspirations in order to live an average life. Their 19-year-old son, Paolo, is having trouble finding an identity, while their 18-year-old daughter, Valentina, has already figured out how to use sex to her advantage. The family goes through a crisis when Carlo begins having an affair, Giulia attempt to seduce the director of a local stage production she is in, and Valentina does what she does best to land an audition for a TV show",
      "tmdbMovieId": 38970,
      "avgRating": 3.23404,
      "releaseYear": "2003",
      "numRatings": 47,
      "posterPath": "/abPnBHUm7b3r1NO2LGo0ltlBkRg.jpg"
   }
}