{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "mexico",
            "id": 534
         },
         {
            "name": "hacker",
            "id": 2157
         },
         {
            "name": "russian mafia",
            "id": 8045
         },
         {
            "name": "hoodlum",
            "id": 160488
         },
         {
            "name": "voyeurism",
            "id": 178649
         }
      ],
      "imdb_id": "tt0337930",
      "video": false,
      "title": "Nicotina",
      "recommendations": [
         62330,
         69333,
         4868,
         41528,
         3469,
         51092,
         42513,
         10079,
         78237,
         244009,
         19822,
         3051,
         154219,
         41488
      ],
      "backdrop_path": "/oqT0IJxBxM1m0qW4kWqcjwy1sHB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lolo",
               "gender": 2,
               "credit_id": "52fe44599251416c75031945",
               "name": "Diego Luna",
               "profile_path": "/uH8sMbiMmy9sprKr1vJpoPBB40E.jpg",
               "id": 8688,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nene",
               "gender": 2,
               "credit_id": "52fe44599251416c75031949",
               "name": "Lucas Crespi",
               "profile_path": null,
               "id": 69863,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Svóboda",
               "gender": 2,
               "credit_id": "52fe44599251416c7503194d",
               "name": "Norman Sotolongo",
               "profile_path": null,
               "id": 69864,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tomson",
               "gender": 2,
               "credit_id": "52fe44599251416c75031951",
               "name": "Jesús Ochoa",
               "profile_path": "/pUCmBfeImQUlNUDzHpfJf8Xkb75.jpg",
               "id": 69865,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Eulogia",
               "gender": 0,
               "credit_id": "52fe44599251416c75031955",
               "name": "Martha Tenorio",
               "profile_path": null,
               "id": 69866,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44599251416c7503195b",
               "name": "Hugo Rodríguez",
               "profile_path": null,
               "id": 69867,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c75031961",
               "name": "Martín Salinas",
               "profile_path": null,
               "id": 69868,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44599251416c75031967",
               "name": "Federico González Compeán",
               "profile_path": null,
               "id": 69869,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44599251416c7503196d",
               "name": "Laura Imperiale",
               "profile_path": null,
               "id": 7360,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44599251416c75031973",
               "name": "Laura Imperiale",
               "profile_path": null,
               "id": 7360,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44599251416c75031979",
               "name": "Mónica Lozano",
               "profile_path": null,
               "id": 69870,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c7503197f",
               "name": "Martha Sosa Elizondo",
               "profile_path": null,
               "id": 69871,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c75031985",
               "name": "Eckehardt Von Damm",
               "profile_path": null,
               "id": 69872,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c7503198b",
               "name": "Fernando Corona",
               "profile_path": null,
               "id": 69873,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c75031991",
               "name": "Marcelo Iaccarino",
               "profile_path": null,
               "id": 69874,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c75031997",
               "name": "Alberto de Toro",
               "profile_path": null,
               "id": 69875,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.601147,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "MX",
            "name": "Mexico"
         }
      ],
      "id": 11556,
      "vote_count": 22,
      "budget": 0,
      "overview": "A real-time dark comedy about a science geek who tangles with a clutch of Russian gangsters after he delivers them the wrong computer disk.",
      "similar": [
         65754,
         201088,
         15472,
         10429,
         37799,
         33613,
         8374,
         9509,
         186,
         473,
         5236,
         8068,
         1571,
         2034,
         273481,
         245891,
         567,
         332567,
         315837,
         553
      ],
      "original_title": "Nicotina",
      "runtime": 93,
      "poster_path": "/r79nUhqYwsjoFsxGCi8rn6SlZjj.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Altavista Films",
         "id": 5084,
         "origin_country": ""
      }],
      "release_date": "2003-09-08",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hugo Rodríguez"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Martín Salinas"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0337930/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MzQyODkwNl5BMl5BanBnXkFtZTcwMDc3NzYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Diego Luna, Marta Belaustegui, Rosa María Bianchi | See full cast and crew »"],
      "reviews": [
         "For those moviegoers who enjoyed Guy Richie's Snatch, you definitely will be entertained this Mexican film. This film from the producers of Amores Perros won several Ariels, which is the equivalent of the Oscars. The film has superb performances from Deigo Luna and Rafael Inclan. Basically, the film takes place in Mexico City over a span of an hour and a half. The trouble begins when a computer geek attempts to ruin the romantic tryst of his beautiful neighbor. Unfortunately, he gets caught and in a fit of rage, she burns several computer disks, including one with important codes. This sets off a chain of an unbelievable events that will captivate and entertain the audience. The film is wild. Some of the humor is very Mexican. However, everybody will enjoy this particular film. Some of the characters in this film are completely nuts. Nicotina illustrates what happens to people when they are overcome by greed.",
         "There is a problem in the mexican film industry: the mexican directors and producers are filming basically light comedies. Their main goal is to recover their investment, they think that comedies with a simple plot is the best way to bring people to see their movies (and pay for a ticket to do it) So, most of the recent mexican movies are comedies and most of them have a great technical realization but with a poor argument. And off course, the actors are repeating the same characters over and over again. Nicotina is just another urban comedy. As simple As that. The film hasn't any improvement at all. The plot, and the situations are very familiar with some previous films like \"Todo el Poder\" or \"Ciudades oscuras\" Here in mexico we're waiting for a breakthru motion picture, with a good and trascendental plot...Since \"Amores Perros\" or \"Y tu mamá también\" the mexican films are just the same. nicotina is 6 out of 10.",
         "........................................................from Pasto,Colombia...Via: L.A. CA...and ORLANDO, FL Equal parts Tarantinoesque film noir, Greek tragedy plus sociocultural satire, Nicontina makes for a rousingly entertaining 90 minutes. Populated by a rather oddly colorful assortment of characters whose lives, in one way or another, revolve around cigarettes or attempting to curtail their use. Thusly, \"Nicotina\" is a passive cast member. What really makes this work is the quality of the ensemble performance and the uncanny sense of timing of both director (Argentine Hugo Rodriguez-Producer/The Violin) and editor (Alberto de Toro). Diego Luna (Y Tu Mama Tambien) delivers an Oscar nomination worthy performance as the Uber-creepy obsessive voyeur criminal nerd next door. With a Classic flair noir twist, Lolo(Luna)learns a painful Karmic lesson on the nefarious repercussions of his techno-voyeurism. 8.5*...ENJOY/DISFRUTELA!!! Any comments, questions or observations, in English o en Español, are most welcome! KissEnglishPasto@Yahoo.com",
         "'Nicotina' is a dark semi-gangster comedy revolving around gangsters (obviously), a computer geek, a corpulent Russian kingpin, two hairdressers and a convenience shop owner among others. The premise is interesting and I liked the premise and the Mexican humour. However, the film starts off slow. The dialogues are a little repetitive but the pace brilliantly picks up after about the first half hour. Rodriguez could have incorporated more style in his execution. The editing could have been tighter but at the same time, some of the characters could have used more development. The comedic situations, which the characters encounter and deal with, work excellently. The irony is well displayed and the film has a darkly whimsical feel to it. I thought a different background score would have worked better, something with a little more energy. Yet, 'Nicotina' remains an enjoyable urban film. Diego Luna, Martha Tenorio, Rafael Inclán and Rosa María Bianchi are very good. At the time, dark urban comedies may have been a trend in Mexican cinema but that does nOt stop 'Nicotina' from being fun.",
         "Nicotina: 5 out of 10: Nicotina represents a black comedy tradition that has been alive and well in Mexico for over fifty years. Death is around every corner and it is a punch line to boot. All the men are womanizers and many of the women are no better. Director Hugo Rodríguez and Writer Martín Salinas took this beloved tradition and married it to its distant cousin, the Quentin Tarantino crime film. It is a decent fit. The basic plot is that a Mexican criminal gang is switching computer bank codes with a Russian gangster for diamonds. I do not think I am spoiling anything by pointing out that not everything goes as planned. The two criminal gangs end up involving the computer geek that downloaded the data. His next door neighbor, a sexy and promiscuous cellist, played by Marta Belaustegui; Her conductor, a possible future sugar daddy: a plant toting upstairs neighbor: a pharmacist couple, with a beautiful saintly wife played admirably by Carmen Madrid: and a beauty shop couple, with an evil harridan wife played chillingly by Rosa María Bianchi: plus the occasional police officer and a scary dog. Some of the camera tricks can be fancy without any underling purpose, and I have not seen this much pastel neon on buildings since that Don Johnson episode of True Hollywood Stories. Overall, the film is nice. It is a pleasant, good time. It is not particularly scary, thrilling, funny, sexy, or clever and that is it’s only real fault. There is nothing terrible memorable in the ninety odd minutes of movie. Oh and do not watch if you are trying to quit smoking. I have never seen a movie so relentless in its promotion of tobacco. It is like watching Eat Drink Man Woman while trying to diet,",
         "I'd give it a 7.5 if i could, the major problem with this movie is, it is a hell of fun to see the characters slip more and more into their misery... but there is so little room to guess whats happening. You always know whats happening, you are the one that knows just everything, that won't mean the story is predictable but there's just no room for guessing (like in other movies, \"f.i. who's the murder ?\"). Anway it's a very cool movie, if I had to compare it it's like a thrilling story your grandpa tells you. You're eager to know what's happening next but once you heard it you don't want to hear it again. Good and maybe Great but not Excellent.",
         "Hugo Rodriguez' \"Nicotina\" is a fun picture, but it is enough to say that it is a Mexican version of Guy Ritchie's English heist flicks, albeit less so. Less violent, less convoluted, less hilarious. And yet, still violent and convoluted and hilarious enough. So there it is. Diego Luna's in it, and ain't nobody doesn't think he's cute. Rodriguez uses funky wipes as scene transitions, punched up by goofy sound effects, there's a scene where a bitchy barber's wife cuts open a guy's belly to get at some diamonds. And there's that smoking theme -- everybody's quitting, trying to quit, in denial about quitting, can't afford the smokes, can't find any lighter fluid, something. It's a motif and it's a metaphor, though perhaps not the deepest one ever (you never what's gonna kill ya!). It makes for a catchy title, though.",
         "Great actors (and specially actresses), well defined characters (again women make the best), an interesting plot, hilarious situations and decent dialogs make this contemporary mix of violence, action and comedy not a must but a good option. Familiarity with Mexican and Argentinean culture is a plus to fully enjoy the film, although the story is by itself good enough for everyone. Extraordinary, intense and absurd as life in Latin America can be, this is a story that fits just right in a city like Mexico. Do not expect to see something like Amores Perros or Y tu mamá también, but rather something like Snatch with a Mexican flavor.",
         "A voyeuristic computer nerd (Diego Luna) figures out a way to make some extra cash by providing his services to anyone that will hire him. He does a job for his buddy, who in turn is going to sell the information to the Russian Mob (or at least one member of the mob), in exchange for 22 diamonds. The camera brings us along for the ride. Fast paced action features a crisscross of characters making their way through el D.F.The story line runs in 'real time', don't blink, just keep up (don't miss the gross out scene with the barber's wife) . Some people compare it to Pulp Fiction, I saw more Tampopo then Travolta. Nice eye candy in the form of Lucas Crespi and Diego Luna. Excellent soundtrack. A little Run Lola Run, a little Amores Perros, some Lock, Stock...all and all, a good movie, take a long drag and exhale.",
         "It's a warm night in Mexico City and we peek in on 90 minutes of obsessive behavior mixed with criminal activity. Lolo (Diego Luna) is trying to sell codes to a Swiss bank to a Russian in exchange for diamonds, while he peeks in on Andria (María Beláustegui). She discovers his peeping, and destroys the disks he made. Now, the fun begins. Lolo meets Nene (Lucas Crespi) and Tomson (Jesús Ochoa), but he doesn't have the disk they are paying for. Double cross? No, just carelessness, but shooting starts and the Russian starts running. He ends up in a barbershop run by Carmen (Rosa María Bianchi) and Goyo (Rafael Inclán), where things really get bizarre and out of control. Nene ends up in a pharmacy with Clara (Carmen Madrid) and Beto (Daniel Giménez Cacho). Lolo ends up there, too. The whole movie plays like a guy Ritchie caper with a Mexican flavor. The subject of smoking and quitting runs throughout. it provides many moments of humor, and eventually, one smoker's carelessness does him in. At best a PG-13. It' s dark comedy with only suggested sex."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Altavista Films",
         "Arca Difusion",
         "Cacerola Films"
      ],
      "summaries": [
         "\"Nicotina,\" is a crime caper set in Mexico City about a simple exchange that goes awry, causing the lives of nine unsuspecting characters to explode in one tumultuous night over a fortune in diamonds. Diego Luna stars as computer hacker Lolo, who is infatuated with his neighbor Andrea and catalogs her every move via high-tech peeping devices. Lolo teams with amateur criminals Tomson and his younger counterpart Nene in a deal with a Russian mobster that involves the exchange of diamonds for computer access to Swiss bank accounts. But the deal goes terribly wrong after Lolo's attempts to spoil Andrea's romantic trysts spiral out of control. Down the street, the irritable pharmacist Beto and his fed-up wife Clara get inadvertently entangled in the exchange, along with the humble barber Goyo and his domineering other half Carmen. Infected with diamond lust, these characters become obsessed with the intoxicating possibility of an easy life and their greed quickly transforms into fiery desperation. When the haze finally clears, computers have been hacked, people have been whacked and lives have gone up in a cloud of smoke.",
         "A real-time dark comedy about a science geek who tangles with a clutch of Russian gangsters after he delivers them the wrong computer disk."
      ],
      "budget": 0
   },
   "movielensId": 27695,
   "movielens": {
      "languages": [
         "Deutsch",
         "Español"
      ],
      "releaseDate": "2003-09-08",
      "dvdReleaseDate": null,
      "directors": ["Hugo Rodríguez"],
      "runtime": 93,
      "movieId": 27695,
      "title": "Nicotina",
      "mpaa": "",
      "actors": [
         "Diego Luna",
         "Lucas Crespi",
         "Norman Sotolongo",
         "Jesús Ochoa",
         "Martha Tenorio"
      ],
      "imdbMovieId": "0337930",
      "originalTitle": "Nicotina",
      "genres": [
         "Drama",
         "Action",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["7BfgRVqmBnU"],
      "plotSummary": "A real-time dark comedy about a science geek who tangles with a clutch of Russian gangsters after he delivers them the wrong computer disk.",
      "tmdbMovieId": 11556,
      "avgRating": 3.51587,
      "releaseYear": "2003",
      "numRatings": 63,
      "posterPath": "/r79nUhqYwsjoFsxGCi8rn6SlZjj.jpg"
   }
}