{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113808",
      "video": false,
      "title": "Miami Rhapsody",
      "recommendations": [
         40480,
         19760
      ],
      "backdrop_path": "/aPn34vGdbjFCjOnksXfyFY4Zbeu.jpg",
      "revenue": 5,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gwyn Marcus",
               "gender": 1,
               "credit_id": "52fe47239251416c7508eec1",
               "name": "Sarah Jessica Parker",
               "profile_path": "/chjO3dDzkT7UzAZk1AGjXdbezyg.jpg",
               "id": 520,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Antonio",
               "gender": 2,
               "credit_id": "52fe47239251416c7508eec5",
               "name": "Antonio Banderas",
               "profile_path": "/85197jARsr06xQ84NhP9YoBL3sR.jpg",
               "id": 3131,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nina Marcus",
               "gender": 0,
               "credit_id": "52fe47239251416c7508eec9",
               "name": "Mia Farrow",
               "profile_path": "/kuLfS2jQOnfIOwCO7RHlwjDIERQ.jpg",
               "id": 12021,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Matt",
               "gender": 2,
               "credit_id": "52fe47239251416c7508eed9",
               "name": "Gil Bellows",
               "profile_path": "/msGHWcelT17HW70FDIXdjGmPmMK.jpg",
               "id": 6575,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jordan Marcus",
               "gender": 2,
               "credit_id": "52fe47239251416c7508eedd",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Leslie Marcus",
               "gender": 1,
               "credit_id": "52fe47239251416c7508eee1",
               "name": "Carla Gugino",
               "profile_path": "/xddYLCp8zWLgYcQRck7REEgCUWl.jpg",
               "id": 17832,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47239251416c7508eecf",
               "name": "David Frankel",
               "profile_path": "/tpLjh5skSSRdm70dbRocPaBZj33.jpg",
               "id": 5065,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47239251416c7508eed5",
               "name": "David Frankel",
               "profile_path": "/tpLjh5skSSRdm70dbRocPaBZj33.jpg",
               "id": 5065,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.391234,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17402,
      "vote_count": 12,
      "budget": 6,
      "overview": "Gwyn Marcus has always wanted a marriage like her parents. She has just accepted the proposal of her boyfriend Matt, but she has misgivings about their future together. Her fear of commitment grows as she learns of the various affairs that her family is having. With her sister getting married and her brother already married, her mother is growing concerned about Gwyn's being the last single person in the family. But the more she thinks about marriage, the more she must search for the balance between career, marriage and family.",
      "similar": [],
      "original_title": "Miami Rhapsody",
      "runtime": 95,
      "poster_path": "/jn2kmqCgRcloNYr121BB4BmgSRu.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [{
         "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
         "name": "Hollywood Pictures",
         "id": 915,
         "origin_country": ""
      }],
      "release_date": "1995-01-27",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Love is great. Marriage is a completely different affair.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Frankel"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["David Frankel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113808/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNjU3MTk2NV5BMl5BanBnXkFtZTcwMzU0MzQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Sarah Jessica Parker, Mia Farrow, Antonio Banderas | See full cast and crew »"],
      "reviews": [
         "Gwyn and Matt have finally gotten engaged and it looks like she will get what she wanted - a happy marriage just like the rest of her family. However as she looks around with clear eyes she realises that all her family are involved in bad marriages and affairs. As a result she begins to get cold feet, worried the same will happen to her. From the style and music of the opening credits right through to the to-camera conclusion that mirrors the `need the eggs', this film is like a tropical version of Annie Hall with a female playing the Woody Allen role! Even if it is not a total mirror, it is impossible to watch this film without seeing Allen's influence all over it. So immediately large sections of the audience will want to turn off, however I love Allen so am happy to give this a shot on that basis alone. As a film, it's plot is just a collection of messy relationship through which Carrie, sorry, Gwyn learns lessons. It isn't substance rich but that's the point - instead it is quick and rather witty, never sitting still for very long but being quite fun with it. The cast also helps as they do some very fun turns despite some weaknesses. Parker is good and her New York personae certainly seems to fit the material. Bellows is rather bland for the role but there are some great little bits from Banderas, Farrow and Mazursky. It's always good to see Pollack and Piven but Campbell demonstrates why she hasn't moved into a successful film career by reading her lines with all the emotion of iron (although she looked great in the beach-shoot scene). Overall this is a fun little film that is quite slick if you are a fan of Woody Allen's relationship neurosis films. If you're not then you'll probably do well to avoid this film.",
         "I always have used viewer comments and user ratings as guides to what I want to see with near 100% success, but luckily did not rely on the rating and some of the flame comments that this flick received. The soundtrack is excellent, the mood is Miami, the Allenesque milieu is perfect for those attracted to it and not limited to urban New York backdrops for its appreciation. Sarah Jessica Parker is outstanding, Banderas sends himself up perfectly as does Mia Farrow. Other supporting cast is very strong, script is well-written and sparkles in places. I can only attribute the relatively low rating to those that don't like Woody Allen movies; they surely would not like this.",
         "This is one of those movies you either hate or love at first sight. Certainly it has an Allenesque feel to it (It may not be a mere coincidence that Mia Farrow is one of it stars, doing a marvelous send-up of the kind of characters she used to play for Woody, from Hannah to [more closely] Alice Tate), but there's so much more to it than that! Sarah Jessica Parker is the link in the story, but not necessarily the main knot. Take Antonio Banderas's turn parodying himself and the \"suave latino lover\" typecasts, or Carla Gugino's bubbly charm, or Barbara Garrick's bravura performance as the too-briefly seen Terri. Of course, good things always may come hand-in-hand with lackluster spots... one of the biggest here? Naomi Campbell sitting pretty and saying \"Fuck off\" with as much enthusiasm as a laptop computer with a british accent. She is typecast alrigtht, but instead of playing with the possibilities like Banderas did, she just walks by as in a catwalk, but she is remarkably far from fantastic. Now that brings us to another contrast, for Gil Bellows' performance as Matt, the understated and understanding fiance is nothing short of great. His smile can lit up a room (common knowledge) and yet when he has to unburden his anger and pain he does it in a way that is quiet and convincing. No high drama, no storming through doors. His character is a man in love but pushed too hard by his beloved (Parker) so his empathy is believable to a fault. His is one of the most delightful moments of the film, including the possibility of salvage at the closing. The scenery goes well with Mark Isham's excellent score and yes, these characters are perhaps a bit too neurotic to be really lovable, but that is the point of it all, and this movie proves it, hands down. Definitely not a masterpiece, but a good, entertaining and also aching film that is in no way forgettable after all.",
         "I found this movie extremely enjoyable, with a knockout performance by Sarah Jessica Parker and a nice jazzy soundtrack. Parker creates an interesting character, which is difficult in a movie like this because a lot of it is her reactions to everything going on around her. The supporting cast is also first-rate. My only gripe is the title of the movie, which is meaningless.",
         "I would disagree with the previous user comment. Miami Rhapsody was both funny and intelligent. Indeed it saunters along with the rhythm of a Woody Allen flick but this is simply because it captures characters in dialouge rarely heard in most Hollywood films. Furthermore...it was truly refreshing to get to see Sarah Jessica Parker in a role (pre-Sex in the City) that really uses her talents as both as comedian and dramatist. It was super refreshing to see a neurotic thinking womens role that toyed with the notion of marriage and commitment. We may think it is overdone now with the re-runs of Sex in the City and all...but put yourself back in 1995. So Yeah...I liked it.",
         "\"Miami Rhapsody\" is a conversational light-hearted chick flick with Parker at the vortex of a Miami's family's many relationships. The film focuses on the Parker character's musings, contemplations, reflections, and conclusions in an easy going, unpretentious, gentle, and lively way. A must see for Sarah Jessica Parker fans and an enjoyable low cal flick for all others.",
         "Sarah Jessica Parker is a young, female version of Woody Allen. That's pretty much what you get with this movie. Everyone was criticizing Kenneth Branagh (and John Cusack, to a lesser degree) when they did their Woody impersonations in Celebrity and Bullets Over Broadway. But no one seemed to mind when Parker did it in this movie, which Woody Allen had no link to even though it feels that way. Add Mia Farrow to the mix, and the clone is perfected (nevermind the fact that Mia and Woody were estranged when this was made). I found a few funny moments and lines (the business with the monkeys and Parker's reaction to them is memorable, but again totally out of the Woody school). But in the end this is a second-rate Woody Allen film, best suited for rainy days when there is nothing else to watch and you stumble upon this on cable TV.",
         "I can´t seem to find any connection to Woody Allen other than Mia Farrow and the style, this movie is obviously made by someone who liked Allen's Husbands and wives. If you have seen that, then there is no need to see this film, it´s the same!",
         "and well-directed. Anyone who has ever lived in or visited South Florida will enjoy this film. Sarah Jessica Parker is very good, and I am not really an ardent fan of \"Sex and the City\". Mia Farrow and Paul Mazursky portray an older well-to-do Miami couple: ...\"what shall I decorate the den in, sea foam or teal\"..., Mia wonders. While lines like that could seem vacuous, they are humorous when presented in an intelligent way. Infidelity, boredom, job frustration. SJP has some excellent lines, like when she tells her grandmother ...\"your generation had something to fight against Nazis...what does my generation have?\"... . Also when she is demoted at her job, her boss tells her not to buy into the \"glass-ceiling theory\"; she says, as a woman I don't have to buy it I get it for free everyday. Anyone who has ever worked in the superficial world of advertising will get a few laughs. Antonio Banderas is also in a small part, as Farrow's paramour. This film deserves a watch, especially because there are so few intelligent romantic comedies. Definitely worth it.",
         "This comedy follows the relationships of a husband and wife, their 3 adult children, and their romantic partners. The couples' relationships cover a spectrum of durations, from the one couple just beginning to plan a marriage, one married for less than 6 months. one with a young child and another on the way, and the long-time married. Only about half of marriages last, and a good portion of the rest suffer from infidelities, neglect, boredom, etc. These are the issues considered by the unwed daughter, played by Sara Jessica Parker. After watching the movie I went to IMDB to see if Woody Allen wrote or directed it. It seemed very much like one of his. SJP plays the Woody Allen character, very creditably. See it from the beginning; this is not one to pick up in the middle!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Cantaloupe Production",
         "Hollywood Pictures"
      ],
      "summaries": [
         "Gwyn Marcus has always wanted a marriage like her parents. She has just accepted the proposal of her boyfriend Matt, but she has misgivings about their future together. Her fear of commitment grows as she learns of the various affairs that her family is having. With her sister getting married and her brother already married, her mother is growing concerned about Gwyn's being the last single person in the family. But the more she thinks about marriage, the more she must search for the balance between career, marriage and family.",
         "When her long-term boyfriend causually asks her to marry him, our heroine realises she is pretty ambivalent about the whole business. In one way she very much wants to marry him, but looking around at her family she wonders if there's any real point. Her married brother is having an affair with his best friend's wife, while her sister is playing around almost before her wedding's over. But the biggest shock comes when she finds out both her parents are straying. What is a girl to do?"
      ],
      "budget": 0
   },
   "movielensId": 278,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1995-01-27",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["David Frankel"],
      "runtime": 95,
      "movieId": 278,
      "title": "Miami Rhapsody",
      "mpaa": "",
      "actors": [
         "Sarah Jessica Parker",
         "Antonio Banderas",
         "Mia Farrow",
         "Gil Bellows",
         "Kevin Pollak",
         "Carla Gugino"
      ],
      "imdbMovieId": "0113808",
      "originalTitle": "Miami Rhapsody",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["0hN8H5gqPG4"],
      "plotSummary": "Gwyn Marcus has always wanted a marriage like her parents. She has just accepted the proposal of her boyfriend Matt, but she has misgivings about their future together. Her fear of commitment grows as she learns of the various affairs that her family is having. With her sister getting married and her brother already married, her mother is growing concerned about Gwyn's being the last single person in the family. But the more she thinks about marriage, the more she must search for the balance between career, marriage and family.",
      "tmdbMovieId": 17402,
      "avgRating": 3.02248,
      "releaseYear": "1995",
      "numRatings": 1179,
      "posterPath": "/jn2kmqCgRcloNYr121BB4BmgSRu.jpg"
   }
}