{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "red-light disctrict",
            "id": 4750
         },
         {
            "name": "human trafficking",
            "id": 6019
         },
         {
            "name": "calcutta",
            "id": 33485
         },
         {
            "name": "illegal prostitution",
            "id": 33625
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0388789",
      "video": false,
      "title": "Born into Brothels",
      "recommendations": [
         13362,
         40156,
         34005,
         47841,
         47912,
         24587,
         26580,
         199291,
         18902,
         84309,
         15651,
         34595,
         41773,
         47113,
         20989,
         44259,
         41747,
         53104,
         276530,
         138644
      ],
      "backdrop_path": "/cOlVGejT7hLh5oxuUc8vOBymylT.jpg",
      "revenue": 3515061,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Herself \"Zana Auntie\"",
               "gender": 0,
               "credit_id": "52fe42f2c3a36847f802eff7",
               "name": "Zana Briski",
               "profile_path": "/mWDSwjz4go9OE0LSw3VWDNWJwAe.jpg",
               "id": 53384,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "543b928ec3a36819a100510c",
               "name": "Avijit",
               "profile_path": null,
               "id": 1373446,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "543b92970e0a2649a1005308",
               "name": "Geeta Masi",
               "profile_path": null,
               "id": 1373447,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "543b92a20e0a2649a8005223",
               "name": "Kochi",
               "profile_path": null,
               "id": 1373448,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "543b92adc3a3681998004c4b",
               "name": "Mamuni",
               "profile_path": null,
               "id": 1373449,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe42f2c3a36847f802efed",
               "name": "Zana Briski",
               "profile_path": "/mWDSwjz4go9OE0LSw3VWDNWJwAe.jpg",
               "id": 53384,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f2c3a36847f802eff3",
               "name": "Ross Kauffman",
               "profile_path": "/hPZiySVMHWzepWYXFLH5n8DmOtt.jpg",
               "id": 53385,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 4.598414,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1392,
      "vote_count": 81,
      "budget": 350000,
      "overview": "The academy award winning documentary depicting the lives of child prostitutes in the red light district of Songachi, Calcutta. Director Zana Briski went to photograph the prostitutes when she met and became friends with their children. Briski began giving photography lessons to the children and became aware that their photography might be a way for them to lead better lives.",
      "similar": [
         2252,
         112160,
         858,
         141,
         319,
         281,
         634,
         437557,
         297762,
         242224,
         258480,
         43923,
         18221,
         27586,
         466,
         2771,
         145,
         9587,
         3134,
         11236
      ],
      "original_title": "Born into Brothels",
      "runtime": 85,
      "poster_path": "/gteL79uWvdec9Me0mCNHxI1kZdn.jpg",
      "spoken_languages": [
         {
            "name": "বাংলা",
            "iso_639_1": "bn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "thinkfilm",
            "id": 12247,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Red Light Films",
            "id": 93091,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "HBO/Cinemax Documentary",
            "id": 11489,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Creative Visions Productions",
            "id": 89129,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sundance Institute Documentary Fund",
            "id": 93092,
            "origin_country": ""
         }
      ],
      "release_date": "2004-12-08",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.kids-with-cameras.org/bornintobrothels/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Zana Briski",
         "Ross Kauffman"
      ],
      "runtime": 85,
      "synopsis": "Filmed within the Red Light District of Calcutta, India, this documentary uses photography and film to explore the lives of several sons and daughters of prostitutes in the City's brothels. The director (Zana Briski) started the project hoping to photograph the life of India's sex workers, but found it difficult to obtain permission to photograph them. She took up residence in the Red Light District to become a part of their world, and in doing so became very involved with the prostitutes' children. \"Zana Auntie,\" as the children call her, is determined to use photography to provide the children with an opportunity for higher education, hope and a better life. She gives each child a camera and teaches them the basics of photography. The children, literally born into the brothels, are able to capture elements of life in the Red Light District that outsiders cannot. As their photography progresses, Zana seeks to use the children's photographs to help secure them education at boarding schools. She organizes an exhibition of their work in NYC, which the children giddily watch via video. She organizes a second exhibition at a bookstore in Calcutta to show the children the effect their work has on others. As the children receive local and worldwide attention, many of them seem to grow more hopeful that they have future prospects outside the brothel. One of the children, Avijit, separates himself from the rest through remarkable talent, and is selected to represent India as a child representative at a worldwide photography convention in Amsterdam. By the end of the film, Zana has obtained spots for most of the children at boarding schools, hoping to keep them out of the brothels. However, not all children are allowed to leave the brothels by their guardians, and several leave the schools to return to the brothels by the film's end.",
      "writers": [
         "Zana Briski",
         "Ross Kauffman"
      ],
      "originalLanguage": "Bengali",
      "imdbLink": "http://www.imdb.com/title/tt0388789/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0Nzc4NDEwNl5BMl5BanBnXkFtZTcwMjMyNzcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kochi, Avijit Halder, Shanti Das | See full cast and crew »"],
      "reviews": [
         "In India, red light districts are booming in cities like Mumbai, Delhi, and Calcutta where millions of transient men live and work far away from their homes and wives. The oldest and the largest of these is Sonagachi in Calcutta where the women have organized into a sex trade union of more than 5,000 active workers and have spread awareness about AIDS and HIV, making Sonagachi one of the few red light districts in the country that does not accept clients without condoms. Subject to a class system that puts them on the lowest rung of Indian society, the mostly illegitimate children of the sex workers are also expected to \"join the line\" when they reach a certain age. Minor girls are the most sought after in the brothels and secure the highest price, making it very difficult for the parents to let them leave, especially when the only other alternative may be the starvation of their entire family. In 1997, photographer Zana Briski was assigned to capture images of Sonagachi. While the women were reluctant to let her into their lives, the children quickly responded and Briski became a resident of the brothel for five years. During that time, she provided the children with point and shoot cameras, set up classes in photography, and trained them to document the harsh reality of their daily lives. The result is the Oscar nominated documentary Born Into Brothels, a film that takes us inside the squalid brothels and allows us to see the world through the eyes of some of its most vulnerable residents, five girls and three boys, ages ten to fourteen. Shot in dazzling color using a digital camera, we get to know the children through their photos. There is Kochi, age 10, who is strong, resilient, tough, and sensitive. Avijit, age 12, seems to be the most talented of the group. He draws, paints, takes pictures and, through Briski's patient efforts, was able to obtain a passport to be a part of a photo-editing panel in Amsterdam. Shanti, age 11, is most eager to learn but is troubled and often feuds with her brother Manik. The others: Gour, Puja, Tapasi, and Suchitra all show a unique ability to find beauty in their ugly environment. The film documents Briski's uphill efforts to place the children in boarding schools to escape the cycle of poverty and exploitation. Some manage to find places in the schools but the biggest obstacle is shown to be the children's own mothers and guardians, often protective out of the sheer necessity for survival. Born Into Brothels is a testimony to the transforming power of art and of one individual's ability to make a difference. Showing the children's art to Western audiences has helped to raise money for the Sonagachi children's education. It may also serve to make people more aware of the potential talent of millions of other third world children who struggle daily for existence on the streets, the orphanages, and the refugee camps of our teeming world.",
         "Today I saw \"Born into Brothels\" at day 3 of 4 of the Full Frame Documentary Film Festival. Even with another day left, I have some confidence that this will be the film I most appreciated seeing at this festival, and in fact is one of the most inspiring films I have seen in a long time. Directors and producers Zana Briski and Ross Kauffman also hosted a question and answer session after the film, and I had the privilege of meeting and talking with Zana Briski, whose intimate involvement in this film and her selfless efforts have given me tremendous admiration for what she does; as I said in the Q&A period, if we had a few more people like her, the world would be a vastly better place for all of us. Ms. Briski is an established photographer and now first time director who began in 1997 to explore the lives of sex workers in Calcutta's red-light district, Sonagachi, where over 7000 women and (disgustingly sadly) girls are prostitutes. In order to better understand them, Zana lived for months at a time with them, and the children quickly befriended her. The children were curious to try their hands at taking pictures, and Zana helped to empower them and see the world through their eyes by teaching them photography and acquiring point-and-shoot 35mm film cameras for them, as well as helping them to critique and edit their pictures. The resulting pictures that the children took between the years 2000 and 2003 are striking. Some of the children clearly have innate talent in composition and artistry (see, for example, shot 17 \"Girl on a Roof\" or 14 \"Horse\", at the Kids with Cameras site mentioned at the bottom of my review), and all of them have works portraying the vitality of life so much so that Zana helped get one child invited to be part of a children's jury at a World Press Photo Foundation photo exhibit in Amsterdam in 2002, and for him to actually attend. Zana admits in the film that she is not a social worker, but wanted very much to help the boys and girls, for otherwise their future was a dismal one lacking hope beyond prostitution, drugs, pimping, and crime. She organized a photo exhibit in a Calcutta bookstore, garnering Zana's project and the individual children television and newspaper coverage. Zana has recently set up an organization, Kids with Cameras, that sells their prints to raise money for them, with 100% of the profits going to them. Twelve of these prints were the ones chosen for the 2003 \"Amnesty International\" calendar, and she even exhibited and auctioned the children's work at Sotheby's. She has helped to get several of the children into good boarding schools and recently helped a few to get email access and English lessons. The film itself is technically beautiful, with a melange of colors, sounds, and activity, centered on the children but also including others. The filmmakers in no way hide the unsavory life in Sonagachi, including disturbing cursing against the children, hopelessness of being able to in any way be involved in normal society, having no governmental support, facing tremendous bureaucracy to get anything changed even with Ms. Briski's help, and the total lack of police investigation or protection as painfully brought to light when one child's mother is killed by a pimp in a \"kitchen fire\". In making the film, Mr. Kauffman and Ms. Briski effectively used fast camera pans, red overtints, and grainy film at times to portray an environment where participants would not want to be carefully filmed. They could have made this a sad and detailed documentary about this red light slum, but instead chose to recognize its nature but focus on the innocence of the children and hope that could be offered them. If you have the opportunity to see this film at a festival, don't miss it. I understand that HBO/Cinemax may be distributing the film as well to afford a much wider audience. It is a heartwarming film that left me with a jumble of emotions - hopefulness and hopelessness; incredulity and shock at human nature combined with tremendous admiration at the selflessness and difference that one person can make; sadness at the overwhelming poverty, filth, and insouciance of a society that lets a community like Songagachi exist and yet tremendous happiness at the children's glee in living their lives with innocent play and their ambition to move out of the community. For the quality and uniqueness of the film, as well as the tremendous service that Zana Briski portrays, this film gets 10 stars out of 10 in my book. Don't miss this jewel of a film - and consider supporting the work that goes on. --Dilip Barman April 3, 2004",
         "This is a beautifully conceived and directed film. I knew little about the red light district of Calcutta and certainly nothing of the amazing children whose photographs are not only dramatic but also a tool of empowerment, albeit not entirely successful. One of the best documentaries of 2004. There certainly have been several excellent movies about the misery and hopeless nature of life in red light districts throughout the world, particularly southeast Asia. But this film's decision to focus on the children who not only are born in the brothels, but essentially live their entire lives within this damp and dismal walls. Director/photographer Zana Briski is to commended for bringing this to light. Several of my friends had deep empathy for her frustrating experiences with the Indian bureaucracy as she tries to get the children's art work noticed. Great film.",
         "We saw this film at the Cleveland International Film Festival and it was one of the absolute best of the 85 films at the festival. This film is a documentary, made by a photographer, Zara Briski, who lived in the brothels of Calcutta and befriended the children of the women of the brothels. In the film, Zara teaches the children photography by giving them each a point-and-shoot cameras and the children, between ages 10-12, compose and shoot some amazing photographs. Zara tries to raise money to get the children into private schools and get them out of the brothels where the are destined to follow the path of their parents as prostitutes or drug dealers. This is an amazingly rich documentary like none you have ever seen. It touches the lives of these children so personally, and is shot so intimately, that you feel like you are right there with them. I commend the film-makers for completing this moving and important piece of work.",
         "There needs to be more uplifting movies like this one. Truly inspirational and enlightening. People have questioned the motives of the director or author - but all I can say is I don't even care if she did it all for the money. If she did, then capitalism is working here. Those who are complaining probably aren't doing anything to help those kids. With the proliferation of internet porn and sex tourism, it is good thing for people to see a documentary such as this. It is just good material to put into people's heads compared to the nasty stuff that is out there. To me it shows that even in the depths of human degradation and despair there could be hope in a corrupt world. That one person, if they could change a few lives for the better, for whatever motivation, it is a good thing and should be an inspiration for us all. Even in these worst human conditions these beautiful kids just shine out full of hope and potential. If you want to see a true-life story documentary where lives are changed for the better, than watch this one.",
         "This film should be seen by everyone who has any sense of what the world is and can be if we give our attention and empathy to make it a better place --in the background I hear the greed and anger of Donald Trump and it is so jarring (and sad) and disturbing ....it is absolutely amazing the dedication and caring of Zana Briski an Ross Kauffman and their attempt to support and change the destinies of these poor unfortunate children who are doomed to a life of humiliation, poverty and human degradation. It is uplifting to know that there are people who care --who are not driven by greed and avarice-- who will try , no matter what the odds are, no matter what are the bureaucratic difficulties to help and support these poor unfortunate children .. I know that I have been immensely moved by this film and what is going on in a place like the red light district of Calcutta and will do what I can to make some impact with these unfortunate children in all of the various venues that these people have chosen to work in and do these miraculous things that are they are doing.",
         "It would certainly take a filmmaker of much self-consciousness, something which Zana Briski certainly possesses, to make this film the way she has. Having met with uncooperative roadblocks to shooting a documentary about sex-workers and their families within the squalid confines of Calcutta's red-light district, Briski states early on that she decides to have the children themselves tell their story by supplying them with automatic cameras to use in their own personal ways. The film, however, ultimately becomes an account of one outsider's attempt to save these children from their miserable fates - poverty and sexual abuse. With the children's sex-worker mothers and families, many of whom have apparently spent generations in the district with no escape in sight, used as background elements, Briski focuses solely on the children, entering them into an informal photography seminar where they gather to share contact sheets of their pictures and discuss the problems of shooting amidst uncooperative and hostile subjects and why certain pictures work and why some don't. Thankfully, Briski also interviews the children, and while it's not clear they understand her theories on picture composition, they are, despite being denied education and living amidst fairly brutal conditions of abuse, poverty and indentured servitude, very perceptive and wise to the unfortunate conditions in which they live, their prospects and possess an awareness of the possibilities of life outside of the district. Briski becomes further involved with the children by trying to enter them into school, though most will not accept them because they are the children of sex workers. Indeed, it is the indifference of Indian authorities to the children's plight as much as the abuse they receive from their depraved parents that shocks the viewer. Briski, with some help from some photographic arts people in the United States and Amnesty International, is able to use the children's pictures as a commercial vehicle to raise money to enable them to enroll in a private boarding school (the kids are well aware that education is their only way out of the brothels). Here, Briski's movement somewhat takes over the movie from her subjects, proving how futile western notions of compassionate aid often are to endemic and grave third-world situations like we witness here. This is driven home when of the kids accepted into the boarding school, only one eventually remains because of the economic pressures put upon their families in which the children essentially act as indentured servants, performing household tasks day and night and odd jobs for additional income. So, while the film becomes a parade for Briski's noble cause, I would have liked to have seen more background and interaction between the children and their surroundings, other than simply as child photographers who have been given a brief and, for most of them, fleeting reprieve from their depraved surroundings.",
         "The film makers of this documentary take the viewer into areas that would have been off limits to anyone wanting to explore the life of the children of some Calcutta prostitutes. About ten children are showcased in the film as one of the directors of the documentary, Zana Briski, involves the children in something positive as she teaches them how to use the camera in capturing the world around them. In gaining the children's confidence, they, in turn, tell us about how they see life in that hostile environment. Most of the girls shown in the film would probably end up in the same situation their mothers went through, as it appears life for them is a vicious circle in which there is no escape. For the boys, in spite of the natural talent shown as they take pictures, the mean streets of Calcutta don't promise much either. As a documentary, Ms. Briski and Mr. Kauffman, show us how they were able to give the children a different way to look at life, but one wonders what has happened after they finished their work. Are these young girls and boys better off because this experience, or did they go back to the only way of life they knew about? \"Born into Brothels\" is a sad commentary on our society at large, because where there is poverty, as it's the case in Calcutta, women will resort into the kind of life where they can get by without any education or skills. These women are actually the victims of a system that penalizes them for just being in the wrong place, at the wrong time. Let's hope Ms. Briski and Mr. Kaufamn were able to instill in these young girls and boys the idea of looking for something better in their lives if they escape the poor surroundings in which they were born into.",
         "I often disagree with the academy award nominations. It's usually too political to nominate the best movies and performances of the year. Born Into Brothels is an exception, it was nominated and won! The only mistake was not nominating it for best picture. Brothels is the story of a woman, Zana Briski, who traveled to Calcutta to photograph the brothels. She fell in love with the children and began teaching them photography. The movie is seen through their eyes. The result is extraordinary in so many ways. Calcutta's red light district is interesting in and of itself. The setting is the first extraordinary feature. The filming makes you feel like you are there. Director Ross Kauffman captures the feeling of being trapped in dark allies with a dark future. Without a director commentary running though the film, you're able to see it all by the way it's been directed. The dark past and future of these families is presented in a beautiful and horrific way. Secondly, the children are lovable. The story focuses on 8 or 9 children of prostitutes. Each one is unique. Some are incredibly funny, others serious, some are troubled, and at least one has an undeniable talent for photography. You'll leave the theater feeling like you know them. This is documentary film at its best. It transports us to another country and makes us love the troubled children. What was troubling to me was having to leave the theater never to see these troubled children again. Putting aside the incredible movie-making abilities of these creators, Zana Briski is a true hero.",
         "Greetings again from the darkness. Rarely does a documentary attract much of an audience ... that is unless it is one of the slanted visions of Michael Moore. Realizing not many will see \"Brothels\" leaves me feeling both saddened and anxious. What a remarkable story that Zana Briski and Ross Kauffman have brought to our world. The kids will capture your heart within the first few moments of the film. Although the story is definitely the kids, the hero is Ms. Briski. Her tireless efforts to give them hope and a way out should be enough motivation for each of us to realize we can make a difference in the world. This film pulls no punches in showing us the underbelly of one of Calcutta's red light districts and how it so impacts these families. The girls are resigned to the fact that it is their future. The boys are helpless to save their friends. Enter Ms. Briski with cameras in tow. You will feel so energized watching the children explore and capture their world through a lens. The photos are nothing short of stunning and were a hit at the World Festival a couple of years ago. Although not successful in saving them all, Ms. Briski did make a difference and provides a guiding light to us all."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Red Light Films",
         "HBO/Cinemax Documentary",
         "Creative Visions"
      ],
      "summaries": [
         "Admist the apparent growing prosperity of India, there is a dark underbelly of poverty of another side of the nation that is little known. This film is a chronicle of filmmakers Zana Briski and Ross Kauffman's efforts to show that world of Calcutta's red light district. To do that, they inspired a special group of children of the prostitutes of the area to photograph the most reluctant subjects of it. As the kids excel in their new found art, the filmmakers struggle to help them have a chance for a better life away from the miserable poverty that threatens to crush their dreams.",
         "Two documentary filmmakers chronicle their time in Sonagchi, Calcutta and the relationships they developed with children of prostitutes who work the city's notorious red light district."
      ],
      "budget": 0
   },
   "movielensId": 27878,
   "movielens": {
      "languages": [
         "বাংলা",
         "English"
      ],
      "releaseDate": "2004-12-08",
      "dvdReleaseDate": "2005-09-20",
      "directors": [
         "Zana Briski",
         "Ross Kauffman"
      ],
      "runtime": 85,
      "movieId": 27878,
      "title": "Born into Brothels",
      "mpaa": "R",
      "actors": [
         "Zana Briski",
         "Avijit",
         "Geeta Masi",
         "Kochi",
         "Mamuni"
      ],
      "imdbMovieId": "0388789",
      "originalTitle": "Born into Brothels",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "AODZ6k8LgEI",
         "1Man1KT8VkY"
      ],
      "plotSummary": "The academy award winning documentary depicting the lives of child prostitutes in the red light district of Songachi, Calcutta. Director Zana Briski went to photograph the prostitutes when she met and became friends with their children. Briski began giving photography lessons to the children and became aware that their photography might be a way for them to lead better lives.",
      "tmdbMovieId": 1392,
      "avgRating": 3.87129,
      "releaseYear": "2004",
      "numRatings": 808,
      "posterPath": "/gteL79uWvdec9Me0mCNHxI1kZdn.jpg"
   }
}