{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "behind the scenes",
            "id": 9817
         },
         {
            "name": "spa",
            "id": 14791
         },
         {
            "name": "planetarium",
            "id": 171757
         },
         {
            "name": "art imitates life",
            "id": 171758
         }
      ],
      "imdb_id": "tt0188863",
      "video": false,
      "title": "Love Stinks",
      "recommendations": [
         118991,
         39140,
         17836,
         16405,
         38986,
         48689,
         241432,
         10034,
         62135,
         63848,
         40798,
         239552,
         31605,
         55825,
         19489,
         54613,
         82378,
         48375,
         25921,
         121822
      ],
      "backdrop_path": "/d2B4L6yOoomlVOvI8U4W6RWUKln.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Seth Winnick",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071ae3",
               "name": "French Stewart",
               "profile_path": "/8IpVIyRvwRAeWjsGtM7eAcZlj4t.jpg",
               "id": 67711,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chelsea Turner",
               "gender": 0,
               "credit_id": "52fe463c9251416c75071ae7",
               "name": "Bridgette Wilson",
               "profile_path": "/l5bUegMA9PHoeRgBkio2bE9R7Vj.jpg",
               "id": 20751,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Larry Garnett",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071aeb",
               "name": "Bill Bellamy",
               "profile_path": "/khQmLcjaaIgVQr5d91drXVnMhzF.jpg",
               "id": 77896,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Holly Garnett",
               "gender": 1,
               "credit_id": "52fe463c9251416c75071aef",
               "name": "Tyra Banks",
               "profile_path": "/tmNsskMEGCDdTyWS2vNDvzCtyM9.jpg",
               "id": 77897,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rebecca Melini / Juliette",
               "gender": 1,
               "credit_id": "52fe463c9251416c75071af3",
               "name": "Tiffani Thiessen",
               "profile_path": "/bsl5t8SAQ1z1KRgALylk9Oh0Kua.jpg",
               "id": 19187,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Monica Harris",
               "gender": 1,
               "credit_id": "52fe463c9251416c75071b03",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Walter Drooz",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071b07",
               "name": "John O'Hurley",
               "profile_path": "/581dPvFkFTdlLEDeOiKFGuPzX2j.jpg",
               "id": 25311,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Amber",
               "gender": 1,
               "credit_id": "55fa89acc3a3683138001bf0",
               "name": "Ivana Miličević",
               "profile_path": "/ukBpu3MgWoncHcR4Cjs81BCBPvu.jpg",
               "id": 29930,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe463c9251416c75071af9",
               "name": "Jeff Franklin",
               "profile_path": null,
               "id": 60621,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe463c9251416c75071aff",
               "name": "Jeff Franklin",
               "profile_path": null,
               "id": 60621,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.57537,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15122,
      "vote_count": 12,
      "budget": 0,
      "overview": "A movie about a relationship...that's worse than yours. Seth (Stewart), a sitcom writer-producer, meets Chelsea (Wilson), an interior decorator, at his best friend's (Bellamy) wedding. He's immediately sexually attracted to her while she's instantly attracted to his single-ness. They both ditch their wedding dates and start their own date that same night. The two become a couple, appearing very happy until after a couple of years of postponing a marriage proposal. When Chelsea realizes that Seth wants to remain single and together, she becomes quite bitter. In the next hour of the movie, the two engage in behavior that makes the War of the Roses look like child's play.",
      "similar": [
         44826,
         7446,
         856,
         522,
         319,
         1581,
         2294,
         509,
         11216,
         371638,
         74643,
         14,
         4995,
         254,
         340837,
         11353,
         10715,
         4234,
         244,
         11596
      ],
      "original_title": "Love Stinks",
      "runtime": 94,
      "poster_path": "/xeh7zWm0oG7Ws4Zu8mXeCbFSVZL.jpg",
      "spoken_languages": [
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "1999-09-10",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jeff Franklin"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Jeff Franklin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0188863/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5OTI2ODk3NV5BMl5BanBnXkFtZTcwNzA1MTkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: French Stewart, Bridgette Wilson-Sampras, Bill Bellamy | See full cast and crew »"],
      "reviews": [
         "A couple years ago, I was working at Blockbuster right after graduating from college. I saw the cover to this movie on the shelf since I'd starting working there, but judged it as kinetic crap by its horribly cheesy cover and name. Yes, I judged this movie by its cover. A customer about my age (25) then told me, unprovoked, that it was one of the funniest movies he had seen in years. He said he was surprised by it and that I should check it out. So, I did. Wow. I laughed and laughed and laughed. I hadn't seen a movie that made me laugh that hard in a long time. I actually couldn't wait to watch it again--this time with my girlfriend. What a disaster. She absolutely hated it as much as I liked it. We didn't even get through 45 minutes of it because she couldn't take it anymore. Apparently, she thought it was one of the most un-funny movies she'd ever seen. A negative funniness even, if that's possible. What does this tell us? This movie probably has a target audience of 18-30 year old males. Its rather dark view of the motives of women and, to that end, perceived \"psycho\" women, is fit-form to any man who's been with a woman that went too far, too fast--no matter how well the both of you got along. This movie is funny because of the powerlessness men feel in the face of a psycho woman--they can absolutely tear you apart and make everyone else think that it's your fault because you're the one who is falling apart. As Yoda might say: Dark, this movie is. French Stewart is completely impotent emotionally, physically, and mentally in this relationship. If you're a man, you probably know this emotion all too well. This movie capitalizes on that darkest of dark corners with which to view a woman in a relationship such as this. In that sense, the movie is almost hyperbolic. Needless to say, it doesn't paint women in any sort of real favorable light. No wonder my girlfriend hated it. So, guys, watch this movie, laugh you arse off--and don't show it to your girlfriend, she'll hate it. I, on the other hand, watched it three more times.",
         "I normally don't comment on movies, but after seeing the other review listed here, I just had to speak up. Sure, everyone's entitled to their own opinion, and I'm not gonna knock the person who gave \"Love Stinks\" a 0/10 rating, but don't let that one person's opinion keep you away from a VERY funny movie. French Stewart plays a sitcom writer who meets Bridgette Wilson's character when both are in their friends' wedding. They begin dating, but have different ideas on where their dating should lead. He's happy to casually date and have fun, whereas she wants every day they spend together to be one step closer to marriage and kids. Whoa, can I ever relate... :) As time goes on, she continues to push him into commitment while he continues to be dragged along unwillingly. Things eventually turn ugly between the two, but in a hilarious way. The things they do to torture each other are just plain funny. And I won't give away the ending, but it's genius - pure genius. It's not a very well-known movie, but deserves to be checked out. Don't trust my review, and don't be scared off by someone else's poor review. Check it out and decide for yourself. If you like funny movies, I feel pretty confident that you'll love \"Love Stinks.\" My rating: 7/10.",
         "This movie rocks. I love this movie. It has some of the funniest acting and scripting that I have seen in a while. I can't remember when I laughed so hard. This movie is sort of like \"War of the Roses,\" except this is much more psychotic. I highly recommend this movie to those who like their comedies as black as they come. Plot: French Stewart, who is a TV writer, falls in love with a babe who MUST get married soon. She does everything to advance the relationship far beyond its years. Of course, French does not want this, and it leads to some very dark and funny circumstances. It uses sophisticated humor (i.e. how this affects his show and life overall) as well as completely low-brow humor (i.e. using farts as a weapon of revenge.) Script: This movie has some very funny lines. There are some lines that I almost choked on because I was not suspecting them. I am sure that the next time I see this movie I will pick up some very quotable quotes. Listen carefully to what they say, and you will be highly rewarded. Acting: This has some of the funniest and truest acting that I have ever seen. I actually liked Bill Bellamy in his role. Go see this movie when it comes out just for him. French is really decent, but you have to go with him because \"Love will make you do f***ed up things. Everybody else works, especially the girlfriend. The ending just rocks, and it is very fitting. (Unfortunately I have been seeing the ending in the previews...it should be saved.) Everybody should go see this movie. It is very good, and I did not even notice the editing because I was laughing so hard. I took a point off simply because some of the scenes I had seen before. 9/10",
         "Seriously, this movie is hilarious. If your girlfriend doesn't think its funny and you do, you should ask yourself this question-- Is this really the type of woman I want to be with? There is nothing better than a bit of dark humor, especially when it comes to psycho chicks. This girl is completely out of control, and the guy handles it very well. Clever film. What else can be said? This movie wasn't particularly popular when it came out, and the cast members also seem to be kind of obscure. This film will potentially become a cult classic, kind of like the movie Office Space has become. Most people you ask have never heard of it, but ask any movie buff or video store employee (which I used to be and it how I came across it) and they'll laugh and recommend it immediately. The photography and settings in the film are quality; visually pleasing. Even though the cast aren't necessarily your most famous in Hollywood the acting is great. The film does provide an all round positive comedic experience. When you finish watching it, you probably will want to see it again.",
         "I am writing this as I am astonished by some of the vitriolic comments submitted by other members. I have just watched this film, with a hang-over, and laughed out loud for the first time in many months. I liked it a lot. I can only imagine that you have to be able to relate to this film or else it will fly right over your head. So that limits the audience to those who have recent experiences of a relationship with someone who you seriously considered might be the \"one\". I related to Seth - remembering perhaps how I felt when my girlfriend referred to herself as my fiance before I had even proposed!! Actually if I don't do it soon I'll be in big trouble... So don't be put off, give this film a try and there is a good chance that this suprisingly intelligent comedy will strike a chord. If it does you'll be glad you watched it - I am.",
         "I think that every man and woman should watch this movie before they get married!!!! It really displays the true actions of people at their worst!!! It was a great date movie, in fact it was a date movie for my husband and I! And we loved it. We can laugh about all the stuff that happened because we are married now! Their are a few scenes that totally show how men can be immature, in fact those we the scenes my husband laughed the hardest!! There is a lot of strong language in this movie so put the kids to bed 1st or just get a babysitter! This is one of the funniest movies that I've seen and we had never seen it until we were recommended by friends to go see it!!!",
         "I have to admit that I wasn't expecting much, but I was pleasantly surprised, and then some. I see a fairly large number of films, and I saw this film as a preview in Seattle. My wife and I couldn't stop laughing. I'm the kind of person who found \"Something about Mary\" to be funny but too silly to recommend because it insulted my intelligence. This movie was over-the-top funny without being insulting. Every character behaves as a normal person would. The writing was very good, the direction was well-paced and overall pace was better than you'd expect for this genre. All in all, I'd say that this film was an Excellent film for the genre. If you like funny couples films, GO SEE THIS FILM.",
         "Frustration humour is a term me and a pal of mine use to describe comedic situations that rely on the protagonist constantly being put in awful situations (often, but not always, by their love interest). We began using the term in connection to \"Green Acres\" and \"I Dream of Jeannie\" many years ago. A recent film examples of this would be \"Meet The Parents\". If done properly, it can be funny (\"You, Me and Dupree\"). If the correct balance isn't struck, it's just frustrating and annoying (\"License to Wed\"). \"Love Stinks\" pushes it about as far as it can but it's resolution leaves you feeling satisfied. Bridgitte Wilson and French Stewart are both fantastic in this film. I'm truly amazed Wilson hasn't become a bigger star. The film begins with Seth and Chelsea meeting and the chemistry is immediate. We all know that euphoric feeling of early infatuation and it's captured perfectly in this film. I felt myself falling for Chelsea. But as a relationship matures those feelings fade and reality sets in. Sometimes, it isn't pretty. This film is about one of those times and it's truly hilarious. I'm sure most of us has dated someone who turned out to be a little looney. It's always nice to be able to laugh about it later.",
         "Make no mistake, this is an overlooked, funny film. Everyone who watches it will take sides, so let me tell you mine. It was a hoot to see the inner workings of the gold-digging beauties hanging out in the TV Entertainment Business and the non-committal guys who attract them. This woman saw a \"chump\" and thought she'd latch onto him. He saw a beautiful woman he just wanted to have fun with and use as a nice trophy. Sometimes this works an marriage insues..that is, unless the guy is a total neurotic and marriage was not in his overall plan which this guy was. She didn't get it. She thought because she was \"beautiful, fun and thin\", that that's all it takes. She found out, that that is all it takes to get in his bed...not in his heart. (Unless he is shallow -- but that's another film!) Then as he tried to get to KNOW her, she became an obsessive marriage lunatic, hell bent on ruining his career until she gets what she wants...or gets out of him what she wants. Either way..win/win for her..craps for him. This is a painfully funny film. You're laughing at the jokes, but then you think about the situations. Who's right? Who's wrong? Was he too permissive and should have stopped her dead in her tracks from day one?Was she too \"I got my hooks in a rich man and want marriage' and no matter WHAT he said wouldn't listen? That's up to you to decide. But the way this film puts it, you cannot help but laugh at it all.",
         "Let's start off by saying that this is the wrong movie to see if your girlfriend is trying to pressure you into marriage. With that said, let's talk about how funny this movie is. French Stewart and Bridgette Wilson star in this satrical, un-romantic comedy. From first frame to fade-out, LOVE STINKS will make you laugh harder than you have in a long while. Seth (Stewart) and Chelsea (Wilson) are madly in love with each other. Problem is: Chelsea wants to get married and Seth doesn't. Coming up with a compromise, they say that if they are still together in a year, they will get married. When the year goes by, and Seth still doesn't want marriage, Chelsea wants revenge. This movie is nothing like what you are expecting it to be. See it and discover for yourself the film that truly lets you know what Hell is like. LOVE STINKS gets 5/5."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Baumgarten-Prophet Entertainment"],
      "summaries": ["Seth Winnick has it all: a successful career in television, good friends, and a passionate relationship with beautiful Chelsea. However, when he fails to make a timely marriage proposal, Chelsea tries to make his life hell."],
      "budget": 4000000
   },
   "movielensId": 2809,
   "movielens": {
      "languages": [
         "Português",
         "English"
      ],
      "releaseDate": "1999-09-10",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["Jeff Franklin"],
      "runtime": 94,
      "movieId": 2809,
      "title": "Love Stinks",
      "mpaa": "R",
      "actors": [
         "French Stewart",
         "Bridgette Wilson",
         "Bill Bellamy",
         "Tyra Banks",
         "Tiffani Thiessen",
         "Colleen Camp",
         "John O'Hurley",
         "Ivana Miličević"
      ],
      "imdbMovieId": "0188863",
      "originalTitle": "Love Stinks",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A movie about a relationship...that's worse than yours. Seth (Stewart), a sitcom writer-producer, meets Chelsea (Wilson), an interior decorator, at his best friend's (Bellamy) wedding. He's immediately sexually attracted to her while she's instantly attracted to his single-ness. They both ditch their wedding dates and start their own date that same night. The two become a couple, appearing very happy until after a couple of years of postponing a marriage proposal. When Chelsea realizes that Seth wants to remain single and together, she becomes quite bitter. In the next hour of the movie, the two engage in behavior that makes the War of the Roses look like child's play.",
      "tmdbMovieId": 15122,
      "avgRating": 2.56401,
      "releaseYear": "1999",
      "numRatings": 289,
      "posterPath": "/xeh7zWm0oG7Ws4Zu8mXeCbFSVZL.jpg"
   }
}