{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0181833",
      "video": false,
      "title": "The Source",
      "recommendations": [20152],
      "backdrop_path": null,
      "revenue": 360895,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "William S. Burroughs",
               "gender": 2,
               "credit_id": "5845f5c7c3a36844c00076bd",
               "name": "Dennis Hopper",
               "profile_path": "/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg",
               "id": 2778,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Allen Ginsberg",
               "gender": 2,
               "credit_id": "5845f5d6c3a368466401b891",
               "name": "John Turturro",
               "profile_path": "/70V4hwvWN0J3aX2LzQg7eKCeq29.jpg",
               "id": 1241,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "59e392f79251410b670002ca",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Jack Kerouac",
               "gender": 2,
               "credit_id": "59e392f79251410b670002cc",
               "name": "Johnny Depp",
               "profile_path": "/ctaca3ALycPP0vPhRSYK5DTBEPF.jpg",
               "id": 85,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "576f25c0c3a3680a3500106a",
            "name": "Chuck Workman",
            "profile_path": null,
            "id": 44931,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.702772,
      "production_countries": [],
      "id": 51679,
      "vote_count": 6,
      "budget": 0,
      "overview": "Traces the Beats from Allen Ginsberg and Jack Kerouac's meeting in 1944 at Columbia University to the deaths of Ginsberg and William S. Burroughs in 1997. Three actors provide dramatic interpretations of the work of these three writers, and the film chronicles their friendships, their arrival into American consciousness, their travels, frequent parodies, Kerouac's death, and Ginsberg's politicization. Their movement connects with bebop, John Cage's music, abstract expressionism, and living theater. In recent interviews, Ginsberg, Burroughs, Kesey, Ferlinghetti, Mailer, Jerry Garcia, Tom Hayden, Gary Snyder, Ed Sanders, and others measure the Beats' meaning and impact.",
      "similar": [],
      "original_title": "The Source",
      "runtime": 88,
      "poster_path": "/3C6B4u9QIQqmvtw3YHTcx2ubsXj.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-01-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Chuck Workman"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Chuck Workman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181833/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4NjUxMzgxNV5BMl5BanBnXkFtZTcwMzYwNzYxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Johnny Depp, John Turturro, Dennis Hopper | See full cast and crew »"],
      "reviews": [
         "The Source takes some priceless footage of this country's seminal beat poets and traces their impact on our society over 5 generations, from the 50's up through present time. Back in the 40's a young football player named Jack Kerouac at Columbia College in New York broke his leg and spent some time talking with other intellectuals, befriending one spindly young lad named Allen Ginsberg. Eventually they met up with another fellow named William S. Burroughs. From this small kernal sprang a movement that begat or aided in the progress of other movements throughout the past 50 years. Piecing together footage from home movies, interviews, TV shows, films, and many other sources, Workman has built a very effective argument for this thesis: young intellectuals sharing thoughts about humankind's existence and our reason for being. It was right after the atomic bomb had been dropped. Film noir reflected the country's fears and anxieties. The world was no longer what it seemed. Existentialism and intellectualism were entering a new phase in society, and a group of free thinkers were born. Kerouac published a book which gave this group a name - \"beats.\" Thus the beatnik was born. Gone. Crazy. Hip. Far out. Anything that questioned authority or existence, whether art, music, poetry, writing, performance...anything. Strangers in their own country, these restless explorers were considered too weird for maintstream society, and were largely ignored or shunned. Eventually beatniks were accepted for what they were, evolving into \"hippies.\" The movements of the 60's gave us \"special interest groups\" - gay & lesbian groups, the feminist movement, and others that owe a debt of gratitude to the free thinking beats.",
         "Chuck Workman did a fantastic job recreating the beat generation, via old footage, and vignettes involving Johnny Depp as Jack Kerouac, and Dennis Hopper as William Burroughs. This is truly a \"must see\" little gem of a film.",
         "They were called the Beatniks.The Source (1999) tells how Allen Ginsberg and Jack Kerouac met at Columbia University in 1944, and started an era of the Beats then.Many others joined the group, like William S. Burroughs.Kerouac died in 1969, Ginsberg and Burroughs in 1997.There are three famous actors playing these three and speak the words of these geniuses.The legendary Dennis Hopper is Burroughs.The brilliant John Turturro is Ginsberg.And Johnny Depp, who's only the hottest actor today, is Kerouac.There are some great people talking about the Beat movement and seen in archive footage, like Steve Allen, Amiri Baraka, Lenny Bruce, Walter Cronkite, Bob Dylan, Jerry Garcia, Philip Glass, Billie Holiday, Bob Hope, Robert F. Kennedy, Ken Kesey, Martin Luther King, John Leguizamo, Norman Mailer, Steve Martin, Groucho Marx and Henry Rollins.There's a clip from Happy Days with Tom Bosley, Marion Ross and Ron Howard discussing about the whole Beat thing at the table.The Source is a fascinating documentary.It's also very educational telling you everything you ever wanted to know about the topic.So all of you that have some interest for the Beat, open your eyes and watch The Source.",
         "\"The Source\" is witty, intelligent and fun. This is a nostalgic romp through our Cultural History that will entertain and validate anyone who has felt alien in this culture. The directive is to enjoy.",
         "The Source was the first documentary I have ever seen on the big screen beside those huge IMax films. The Source was very enjoyable film. I have always read Kerouac and Burroughs w/ much enthusiasm and this film helped me to fall in love w/ their work all over again and some more. The Beats were an aquired taste, but if you are searching for yourself (and I believe most people are) these guys can help you start. They don't show you the way but they give you a good start. This film was very insightful into the lives of these life searching nomads. See this if you enjoy their work. Even if you never read any of their stuff, see it anyway.",
         "This film is simply a love letter to the three writers Allen Ginsburg, Jack Kerouac, and William Burroughs. The film offers no dissenting viewpoints, and provides very little evidence to back up its claims that these three men were somehow 'The Source' for all counter culture movements that followed them. This is a preposterous claim. The Beats were simply part of a long tradition of counter culture art that began in earnest in the mid 19th Century. Anyways, outside of some sloppy history, the film does at least seem to capture the spirit of who the Beats were. What it fails to do, however, is convince me that I should still actually care who they were. So, for a fan this film will be a joy ride, but for people, like me, who have always been somewhat ambivilant about the Beats, it doesn't do much convincing.",
         "The Source was the first documentary I have ever seen on the big screen beside those huge IMax films. The Source was very enjoyable film. I have always read Kerouac and Burroughs with much enthusiasm and this film helped me to fall in love with their work all over again and some more. The Beats were an aquired taste, but if you are searching for yourself (and I believe most people are) these guys can help you start. They don't show you the way but they give you a good start. This film was very insightful into the lives of these life searching nomads. See this if you enjoy their work. Even if you never read any of their stuff, see it anyway.",
         "All I have to say is that if you liked this documentary, you should also check out \"The Beat Generation: An American Dream\". Maybe if I convince everyone to watch this, people may start to notice what is wrong with this generation",
         "No comment can make them alive again: they have gone some other place, some other time... Those crazy poets, wonderful wanderers, so human and so divine, so simple and still so far from the ordinary. They are the true spirit of the first pioneers, seeking an unknown unexplored space, inside! To have a glimpse of those gone lands, to scratch the surface of those lost moments, watch this and if you find yourself asking where those Beats have gone, you will find the answer. The cuts are clean, the time of recollection is brought by silence, between words, between the frames. Very polite, and sincere, almost an apology. The longing remains. Can you still hit the road to enlightenment? No answer is given. And them survivors can still proclaim 'I'm still burning'. Them dead are still dead, their dry mouths wording without sound. The fire has spread, from lamp to lamp, and the trip has now some clear signs along the path. This is the witness bringing testimony to their uncommon greatness. Observe it!",
         "This film is perhaps the greatest documentary ever made of the Beat Generation. It has engrossing interviews, heightened by some of the finest performances ever done by the actors. Dennis Hopper deserved an acting Oscar, but Tuturro and Depp also did a great job."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History"
      ],
      "productionCompanies": [
         "Beat Productions",
         "Calliope Films",
         "WNET Channel 13 New York"
      ],
      "summaries": ["Traces the Beats from Allen Ginsberg and Jack Kerouac's meeting in 1944 at Columbia University to the deaths of Ginsberg and William S. Burroughs in 1997. Three actors provide dramatic interpretations of the work of these three writers, and the film chronicles their friendships, their arrival into American consciousness, their travels, frequent parodies, Kerouac's death, and Ginsberg's politicization. Their movement connects with bebop, John Cage's music, abstract expressionism, and living theater. In recent interviews, Ginsberg, Burroughs, Kesey, Ferlinghetti, Mailer, Jerry Garcia, Tom Hayden, Gary Snyder, Ed Sanders, and others measure the Beats' meaning and impact."],
      "budget": 0
   },
   "movielensId": 2813,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": "2000-07-05",
      "directors": ["Chuck Workman"],
      "runtime": 88,
      "movieId": 2813,
      "title": "The Source",
      "mpaa": null,
      "actors": [
         "Dennis Hopper",
         "John Turturro",
         "Steve Martin",
         "Johnny Depp"
      ],
      "imdbMovieId": "0181833",
      "originalTitle": "The Source",
      "genres": [
         "Documentary",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Traces the Beats from Allen Ginsberg and Jack Kerouac's meeting in 1944 at Columbia University to the deaths of Ginsberg and William S. Burroughs in 1997. Three actors provide dramatic interpretations of the work of these three writers, and the film chronicles their friendships, their arrival into American consciousness, their travels, frequent parodies, Kerouac's death, and Ginsberg's politicization. Their movement connects with bebop, John Cage's music, abstract expressionism, and living theater. In recent interviews, Ginsberg, Burroughs, Kesey, Ferlinghetti, Mailer, Jerry Garcia, Tom Hayden, Gary Snyder, Ed Sanders, and others measure the Beats' meaning and impact.",
      "tmdbMovieId": 51679,
      "avgRating": 3.27622,
      "releaseYear": "1999",
      "numRatings": 143,
      "posterPath": "/3C6B4u9QIQqmvtw3YHTcx2ubsXj.jpg"
   }
}