{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cia",
            "id": 591
         },
         {
            "name": "office",
            "id": 1438
         },
         {
            "name": "condor",
            "id": 181230
         }
      ],
      "imdb_id": "tt0073802",
      "video": false,
      "title": "Three Days of the Condor",
      "recommendations": [
         10518,
         891,
         4909,
         1051,
         592,
         9277,
         1623,
         988,
         983,
         5924,
         8333,
         910,
         5916,
         488,
         1654,
         93,
         2322,
         9040,
         17365,
         642
      ],
      "backdrop_path": "/liBsuBCVx4FMGTCckxkmZdOzrpF.jpg",
      "revenue": 27476252,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Joseph Turner",
               "gender": 2,
               "credit_id": "52fe44aa9251416c7503cc79",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Kathy Hale",
               "gender": 1,
               "credit_id": "52fe44aa9251416c7503cc7d",
               "name": "Faye Dunaway",
               "profile_path": "/sq12RJZ1HTXHHI48y31YIS2qp87.jpg",
               "id": 6450,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "J. Higgins",
               "gender": 0,
               "credit_id": "52fe44aa9251416c7503cc81",
               "name": "Cliff Robertson",
               "profile_path": "/q8DvYrkVZ6GajgU2V771Y0dOGWy.jpg",
               "id": 19153,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "G. Joubert",
               "gender": 2,
               "credit_id": "52fe44aa9251416c7503cc85",
               "name": "Max von Sydow",
               "profile_path": "/nwRB1DDylWFC4120kfbtPq2pZzA.jpg",
               "id": 2201,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Mr. Wabash",
               "gender": 0,
               "credit_id": "52fe44aa9251416c7503cc89",
               "name": "John Houseman",
               "profile_path": "/yN0o6KfCD7Lbb50oYuYn1oxHONB.jpg",
               "id": 11783,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Leonard Atwood",
               "gender": 0,
               "credit_id": "52fe44ab9251416c7503cc8d",
               "name": "Addison Powell",
               "profile_path": null,
               "id": 13948,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Sam Barber",
               "gender": 2,
               "credit_id": "52fe44ab9251416c7503cc91",
               "name": "Walter McGinn",
               "profile_path": null,
               "id": 81734,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Janice Chon",
               "gender": 1,
               "credit_id": "52fe44ab9251416c7503cc95",
               "name": "Tina Chen",
               "profile_path": "/AjCx3HCq5HeABQt0EtLTe1Srcwc.jpg",
               "id": 44550,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Beefy Man",
               "gender": 2,
               "credit_id": "57b1e526925141478400253d",
               "name": "John Randolph Jones",
               "profile_path": "/1MY1dOY9TG3BK5iwY0s7579uG6d.jpg",
               "id": 6758,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "S.W. Wicks",
               "gender": 2,
               "credit_id": "59a5ba12c3a368403b0111ec",
               "name": "Michael Kane",
               "profile_path": null,
               "id": 72659,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Dr. Ferdinand Lappe",
               "gender": 0,
               "credit_id": "59a5ba219251412f3e0110e7",
               "name": "Don McHenry",
               "profile_path": null,
               "id": 1229745,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "The Major",
               "gender": 2,
               "credit_id": "59a5ba40c3a368402500feea",
               "name": "Jess Osuna",
               "profile_path": "/nbUeUI3aBuNYhyuuQKqs97ZChA2.jpg",
               "id": 218432,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "59a5ba4ec3a3684005011726",
               "name": "Dino Narizzano",
               "profile_path": null,
               "id": 1704442,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Mrs. Edwina Russell (as Helen Stenbure)",
               "gender": 1,
               "credit_id": "59a5ba6dc3a368402500ff14",
               "name": "Helen Stenborg",
               "profile_path": "/1Wh5u9uJPrUa7KS5PRRsRW0e6Cw.jpg",
               "id": 160261,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Martin",
               "gender": 2,
               "credit_id": "59a5ba7ec3a3683fb8010546",
               "name": "Patrick Gorman",
               "profile_path": "/5cGqMcS0M3NX9jaMGf2Lfop7eLq.jpg",
               "id": 136921,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Jennings (as Hansford H. Rowe Jr.) (as Hansford Rolle)",
               "gender": 2,
               "credit_id": "59a5ba8ec3a3683fdb010a11",
               "name": "Hansford Rowe",
               "profile_path": null,
               "id": 1214035,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "Mae Barber (as Carlin Gylnn)",
               "gender": 0,
               "credit_id": "59a5baa19251412f16010d93",
               "name": "Carlin Glynn",
               "profile_path": null,
               "id": 203731,
               "order": 17
            },
            {
               "cast_id": 30,
               "character": "Mailman",
               "gender": 2,
               "credit_id": "59a5bab5c3a368403701045a",
               "name": "Hank Garrett",
               "profile_path": "/mnnUSRsf7DGCwHHCh37YTwpx5PG.jpg",
               "id": 129663,
               "order": 18
            },
            {
               "cast_id": 31,
               "character": "Fowler",
               "gender": 2,
               "credit_id": "5a78c0fdc3a368227b01a6ab",
               "name": "Michael Miller",
               "profile_path": null,
               "id": 52191,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c7503cc51",
               "name": "Sydney Pollack",
               "profile_path": "/zxkoU2diKtvarV1Qk4z9He2lJj9.jpg",
               "id": 2226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aa9251416c7503cc57",
               "name": "James Grady",
               "profile_path": null,
               "id": 71113,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c7503cc5d",
               "name": "Lorenzo Semple Jr.",
               "profile_path": "/sjsfQ8EHjZZv0qHFlAajJlMlZzX.jpg",
               "id": 10931,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c7503cc63",
               "name": "David Rayfiel",
               "profile_path": null,
               "id": 11056,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c7503cc69",
               "name": "Stanley Schneider",
               "profile_path": null,
               "id": 71114,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aa9251416c7503cc6f",
               "name": "Owen Roizman",
               "profile_path": "/3dl1QnuVmqz0US2t5tMVmNqPK7u.jpg",
               "id": 16331,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aa9251416c7503cc75",
               "name": "Don Guidice",
               "profile_path": null,
               "id": 71115,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ab9251416c7503cc9b",
               "name": "Dino De Laurentiis",
               "profile_path": "/l5skcaSr7QLDMOpAahznDjUW9Ec.jpg",
               "id": 5398,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ab9251416c7503cca1",
               "name": "Sydney Pollack",
               "profile_path": "/zxkoU2diKtvarV1Qk4z9He2lJj9.jpg",
               "id": 2226,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ab9251416c7503cca7",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 9.059212,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11963,
      "vote_count": 314,
      "budget": 0,
      "overview": "A bookish CIA researcher finds all his co-workers dead, and must outwit those responsible until he figures out who he can really trust.",
      "similar": [
         137094,
         10945,
         954,
         47964,
         955,
         146216,
         254904,
         1247,
         11808,
         9331,
         302699,
         3132,
         4614,
         1669,
         1369,
         26389,
         27576,
         11679,
         9509,
         11439
      ],
      "original_title": "Three Days of the Condor",
      "runtime": 117,
      "poster_path": "/gbd3kO5kANvFrgPyxB0p6RNsOQC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dino De Laurentiis Company",
            "id": 10308,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Tom Ward Enterprises",
            "id": 10879,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Wildwood Enterprises",
            "id": 316,
            "origin_country": ""
         }
      ],
      "release_date": "1975-09-24",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "His CIA code name is Condor. In the next seventy-two hours almost everyone he trusts will try to kill him.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sydney Pollack"],
      "runtime": 117,
      "synopsis": "Joe Turner (Robert Redford) is an employee of the CIA. He's not a secret agent, his job is to read, and he and his co-workers at the American Literary Historical Society read everything; books, comics, magazines, and they scan everything into a database to be cross-checked against real CIA operations. On a rainy December morning it's business as usual, so no one notices the non-descript man sitting in plain sedan across the street from Joe's building, checking off names of every employee as they enter. Inside, Joe looks for an answer to a letter he'd sent to the main CIA office at Langley. He has a theory about connections he's noticed between operations in Venezuela, Saudi Arabia, and other locations around the world, but so far there's no response. Noon approaches, and it's his turn to go out for lunch. Since it's still raining, he ducks out the basement door (which is against regulations) and cuts through several back alleys to the deli. Meanwhile, the sedan out front quietly pulls away after signaling to 3 men waiting in the street. They move in with quiet determination and knock on the front door. At the deli around the block, Joe picks up lunch for the others and then runs back. Since the rain has stopped, he goes to the front door, and buzzes the security intercom to be let in, but gets no answer. Pushing on the door, he finds it is unlocked, which it never is. Inside he finds a scene of carnage. Everyone has been murdered, shot to death in the few minutes he has been gone. Fighting down his shock and horror, he grabs a pistol from the receptionist's desk and flees. Suddenly, everyone on the street looks suspicious, and Joe realizes that whoever killed his coworkers is probably still looking for him. He finds a payphone and calls an emergency contact number at the CIA. \"This is...uh...'Condor'\" Joe says, fighting through the shock to remember his code name. \"The section's been hit. Everyone's dead.\" Told not to panic, and to call back in two hours, a CIA response team quickly arrives and verifies Joe's story. Higgens (Cliff Robertson), the section chief in New York, wonders why in the world someone would take out a research office like this, and calls his supervisor at CIA headquarters. Joe calls back and is told to stay alive 1 more hour. He's to meet his dept. head in a specified back alley off 72nd street where he'll be picked up and brought in safely, but when Joe enters the alley, shots ring out. His own department head is trying to kill him. Joe fires back and wounds the man, then runs away in a panic. Convinced he can trust no one, in desperation he kidnaps a woman on the street as she gets into her truck. Kathy (Faye Dunaway) is terrified, but drives Turner to her apartment. Terrified himself, he holds the gun on her as he tries to figure out what to do next. Gradually, Kathy begins to realize that Turner is in real trouble and doesn't want to hurt her, but she still doesn't believe his story. He goes out to try and contact an old friend and get some help, but at the friend's apartment, he finds only another bullet-riddled body. Realizing the assassin is hard on his tail, he tries to get out of the building alive, and when he gets on the elevator, Joe finds himself next to a quiet man in a trenchcoat. Some inner sense tells him that this fellow is part of the problem, and Joe hesitates as the other man slowly walks out through the lobby. Convincing a group of loitering youth to walk out with him, he makes it back to Kathy's Bronco as the trenchcoated man waits across the street, a rifle trained on Turner's back. Unable to get a clear shot, Joubert (Max Von Sydow) runs after the truck and manages to get the license plate number. Returning to Kathy's apartment, he agrees to let her take a shower and get changed. While waiting, a mailman knocks at the door with a package. Joe opens the door and once inside he pulls a machine gun on Joe and opens fire. Diving behind the furniture, he fires back with the pistol, and both men wind up in a fight to the death. Kathy emerges from her shower to find her apartment trashed and Joe sitting next to a dead mailman. Now that \"they\" know where he is, she's involved too, and they must flee before another hit man arrives. Despite his fear, Joe has the beginnings of a plan, and Kathy agrees to help. They visit the NYC office of the CIA and Kathy pretends to apply for a job, then gets \"lost\" while she looks for Joe's section chief, Higgins. Once spotted, she helps Joe kidnap him while he eats lunch, and Higgins is hustled into the back of Kathy's Bronco. Interrogated by Turner, he confesses that he doesn't know what's going on any more that they do. \"This is obviously an inside operation\", he says. Joe manages to put the pieces together by tracking down Joubert, the quiet man in the trenchcoat. Tapping into the phone exchange in Joubert's hotel, he monitors the calls, and places an anonymous one himself to Joubert. \"Do you believe the Condor is an endangered species?\" he asks, and hangs up. Joubert quickly calls his controller, and Joe is able to track the call to a man named Atwood, a high-level supervisor in the CIA. As he prepares to confront Atwood, Joe thanks Kathy for all her help, and reluctantly leaves her. At Atwood's country home, the stereo suddenly comes on in the middle of the night, and when he investigates the noise in his study he finds Turner sitting quietly in a chair, holding a gun. Forced to confess, Atwood tells Joe that the hit on the section was due to that paper he'd sent to CIA headquarters, the one about the connections to various countries around the world. Atwood is involved in a scheme to manipulate the world's oil markets and Turner's paper had hit too close to the truth. He and anyone else who might know about it had to be eliminated. Furious, Joe points the gun at Atwood. \"Drop the gun,\" says a quiet voice; It's Joubert, standing quietly behind him. Realizing his defeat, Joe drops the pistol on the floor and waits for the inevitable, thinking that at least now he knows why all this has happened. But when Joubert fires, Joe is startled to see that it's Atwood who's been shot instead. Joubert calmly begins to wipe down the room, explaining that 'Condor' was no longer the target. \"Atwood had become an embarrassment,\" he explains to a stunned Joe, leading him outside the house and handing back his pistol. \"Can I drop you somewhere?\" he asks in a friendly tone. With a new lease on life, Joe still has a few loose ends to tie up. Returning to New York, Joe waits for Higgins to walk past on the street, and they have a tense final confrontation. Higgins explains that the CIA does business this way because they need to. There is no other way. Turner disagrees, and as they stop in front of the offices of the New York Times, Turner tells Higgins that they've become too used to killing people as part of their job. He's told a reporter everything. \"Ah, you fool,\" sighs Higgins. \"You've done more harm than you know.\" As Turner walks away, Higgins calls after him. \"It didn't have to end this way Condor. You're about to become a very lonely man.\" Joe seems not to care. He's had his revenge on the CIA, and he fades away into the crowd.",
      "writers": [
         "James Grady",
         "Lorenzo Semple Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073802/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NjYxMTI2MV5BMl5BanBnXkFtZTcwOTg2NzEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Redford, Faye Dunaway, Cliff Robertson | See full cast and crew »"],
      "reviews": [
         "Three Days of the Condor is a classic spy thriller with a bit of a twist, it takes place inside the U.S.A. There are no flashy locales, no super-hero types, and no ultra-menacing bad guys who spew cheesy dialogue; instead, we have a common man (Robert Redford) battling for his life in an uncommon situation. This is similar to Alfred Hitchcock's North By Northwest in its theme and intensity and Sydney Pollack pulls it off to perfection. Robert Redford stars as Joseph Turner a \"reader\" for the CIA who finds himself on the run after everyone in his office is assassinated. Pollack wisely allows us to share in Turner's horror and confusion upon finding his dead co-workers. We witness his scramble for protection and his shaky call to the CIA Headquarters, as he demands to be brought in. The wheels start turning and it seems that all will be resolved, safely and quickly, but things don't go as planned. After a shoot out in an alley, Turner is seen as a possible rogue agent sending him into greater peril. Now everyone is out to get him. Only through quick, imaginative thinking and survival instincts can Turner stay ahead of those who are out to kill him. In a moment of desperate improvisation, Turner kidnaps Faye Dunaway to elude his pursuers. This turn allows us to have someone else view Redford's character for us and provide a different intensity, a sexual intensity, to the film. Again, this is somewhat reminiscent of Cary Grant meeting Eva Marie Saint on the train in North by Northwest. But this story has more of an edge to it and Dunaway's character has greater depth and purpose than we imagine possible. She acquiesces to her captor's demands as she tries to understand him and learns quickly to appreciate him and the situation he's in. Through Dunaway's help, Redford is allowed to meet up with the man (Cliff Robertson) who he believes is pulling the strings inside the CIA. The story turns more cerebral as we learn why Turner's office was hit and who was behind it. Furthermore, we understand how truly alone Redford's character really is. The audience is kept guessing through to the very end as to whether or not Redford's character will survive. This is one movie that provides action and excitement coupled with a strong plot and solid characters. Max Von Sydow is excellent as a Joubert, a sophisticated, calculating, even-keeled assassin who is only doing what he is paid to do. Redford shines as a man whose entire world is thrown into violent disarray forcing him to fight for his survival. His ability to project his thoughts and concerns through his actions and facial expressions holds the audience to him. While this movie does not have the overwhelming paranoid feel to it that a movie like The Parallax View had, it is stylish, convincing, and an intriguing movie. Sydney Pollack doesn't fill the scenes with deep shadows and hard camera angles, as some would do. Instead, most of this story takes place in broad daylight, which actually increases the tension. There's no easy place to hide, no dark doorways to duck into, no characters stepping out of the fog when we least expect it. Like Hitchcock, Pollack knows that exposing his hero to the light of day is to abandon him to his pursuers. The audience is pulled in right along with the Redford's character and we can't let go until we know we're safe.",
         "A cold, rainy day in New York City...a small, cramped office building where a friendly, diverse group of CIA administrative types do research...one employee, a young 'reader' (Robert Redford), is assigned to pick up sandwiches, and takes a short cut through back alleys to a local deli...a van pulls up in front of the building, a group of disguised, armed assassins disembark, enter...and brutally kill every person in the building, leaving just before the 'reader' returns, to face the carnage... With this visually gripping sequence, the stage is set for one of the best suspense films of the 1970s, Sydney Pollack's classic THREE DAYS OF THE CONDOR. In a novel twist of the Hitchcock 'Man Who Knew Too Much' theme, Redford's 'Joseph Turner' (code name 'Condor'), whose employment consists of reading novels and publications for any reference to the CIA, develops an 'imaginary' scenario of an agency 'inside' the agency, working independently, which his boss forwards to Washington for review. Unfortunately, the scenario is true, and Turner and his co-workers must be eliminated, to keep the secret intact. By sheer luck, Turner survives the 'hit', and the bookish 'admin type' must now run for his life, utilizing survival skills he didn't know he possessed, while trying to discover the reason for his 'death sentence'... The tension never lets up in this grim, exciting tale, as Turner discovers he can trust no one, and barely survives assassination attempts, again and again. Forced to kidnap a young woman (Faye Dunaway, more vulnerable than usual) to aid him, it takes a death attempt to convince her to believe him, but Turner refuses to allow her to continue to risk her life protecting him, so, ultimately, it becomes a 'David and Goliath' struggle between Turner and the 'outlaw' CIA and it's hired assassins. Featuring Max von Sydow as a sophisticated 'hit man', John Houseman as a mysterious CIA senior official, and Cliff Robertson as an agent with an agenda, THREE DAYS OF THE CONDOR influenced a generation of similar-themed thrillers, including Mel Gibson's CONSPIRACY THEORY, and Will Smith's ENEMY OF THE STATE. The Robert Redford film is the best of the crop, by far!",
         "This film was very effective in maintaining the tension not only of the Condor's life and death mission to discover the reasons for the massacre of his colleagues but also the relationship between him and Kathy. The cast is uniformly good though Redford obviously carries the film. Von Sydow is again great as the strictly professional assassin. The entire film had an aura of authenticity that had me entirely engrossed. Recommended, 8/10.",
         "Loved this film. One of the best from the golden age of cinema (1970's). Robert Reford was as his peak. Faye Dunaway's best role since Thomas Crown Affair. Not to be missed for those fans of 70's cinema... Really touches on Big Brother and the threat that a secret government entity lived and breathed within the CIA. Robert Reford's character embodied the unsuspecting paranoia that characterized that time. A very non-Hollywood ending will surprise you. The cinematography was top-noch (Owen Roizman). Nothing has come close to this film. This film has intrigue, suspense, and above all a moral conscience. It presents the idea that what does our government do, and at what cost?",
         "Being someone who wants to tell his stories for a living this movie was a revelation. I saw it when I was not quite 18. Over ten years ago. I came across it on one of the movie channels. It opens so quietly. Just everyday life going on. A guy late for work. Coming in by bike and in the rain no less. His workplace is comprised of superiors he wont conform to please and those he works alongside that apprciate that quality in him. He has the air of a man that knows who he is. Gently he sets the tone for his corner of the world and those around him are much the better for it. He goes out for lunch and returns to find everyone in his office cut down like they were nothing. Even though we saw it happening. We still feel his horror at returning to find his sanctuary torn asunder. When he finds his feet again he calls in and in a panic tells his superiors. Everyone's dead! When they try to run him through the usual protocols he reponds. I'm not a field agent I just read books! He doesn't go charging off for revenge like so many action heroes. This guy just wants out. He's seen his world demolished and he just wants to survive the day. He's panicked and alone. But when his saviours turn out to be, if not in league with the devil at least working the same side of the street. He has to fend for himself. Having run out of options and with nowhere to turn this CIA reader realizes if there's any saving to be done he'll have to do it himself. And as John Houseman's Big Guy at the CIA asks Cliff Robertson's Director Higgins \"how is he doing this\" Higgins replies \"He reads. He reads... everything\" Houseman nods knowingly. The message here? Knowledge is power. And while these men have their offices and expense accounts Joseph Turner is a man who knows things. He borrows some equipment from the back of a Telephone repairman's truck and taps a telephone line in a NY city Hotel. Another character we might think this an unlikely skill to just happen to come in handy but it's been established. The guy is brilliant and has a job reading and analyzing books all day every day five days a week. He isn't everyman. He's just the hero any one of us COULD be. He is believable which makes all that he achieves all the more impressive. The moments of tension between Turner and Joubert the Assassin are beautifully done. From the initial scene where the hit on his office goes down we know that this hitman knows he is standing next to the only one of his targets that is still running free. Joseph it seems has a sense of it. As you watch the scene play out as they move between floors. You feel trapped there with them. Joubert is like a force of nature. He harbours no personal motives and so it's difficult to harbour any against him. As to whether Joseph knows it was he that personally killed the people at his office. Its unsure. But I feel like at the final interaction between them one thing is clear. Turner is at least at that moment unable to switch gears from the natural gratitude he must feel at being saved by this man and however coincidentally aided by his actions. He feels safe enough to talk comfortable with him. I could write pages more but time escapes me.",
         "How many movies about events that were happening at the time that they were released stand the test of time, in this case almost 30 years after the movie was made. \"Three Days of the Condor\" wasn't a major blockbuster in 1975 and didn't win any Academy Awards the next spring, But if it were remade today it would hold up as good as any film about government secret covert policies and behind the scenes action as any movie about the same subject would now. The movie \"Three Days of the Condor\" eerily as well as accurately predicts the very situation that the US has got itself into now,in 2003,in the oil-rich Middle and Near East some twenty eight years ago back in in 1975! Robert Redford, Joe Turner, works for the CIA and is doing his job like he's done it for years. He reads and interprets books, without the slightest suspicion of how he, as well as his co-workers, is looked upon when it comes to the real scheme of things to what his bosses think about what's going on in the world. Turner takes his employment in the CIA, which is one that he obviously needed to get a very high government clearance, like most working people would;a 9 to 5 job with a months vacation and a good government pension waiting for him when he retires. One day when it, unknowing at the time to Turner, luckily comes his turn get lunch for his co-workers that he finds out that working for an outfit like the CIA is a lot more dangerous then him getting mugged or having his motor bike stolen on his way to work. From then on until the end of the movie and even beyond Turner is a marked man, not marked by the enemies of the US but by his CIA bosses themselves. \"Three Days of the Condor\" is a true \"Man without a Country\" movie when Turner as well as those that he worked with, who were loyal to their country and the agency that employed them, were deemed expendable because of a slight case of paranoia from a top administrator in the agency. The CIA outfit that Turner was in were checking out a book, that seemed to be some kind of secret blueprint, written in a number of unlikely and foreign languages about a Western-type country plotting to, and taking over, an or a number of oil-rich Middle-East nations! This is exactly what's happening in Iraq today! I doubt that A movie like \"Three Days of the Condor\" would be made today given the climate of the September 11, 2001 attacks and the \"War on Terrorism\" in both Afghanistan & Iraq that quickly followed. But back in 1975 when we here in the USA were living in a more peaceful and secure time and with the Frank Church Commission investigating in public the accesses of the US intelligence agencies it could. I especially liked the cast of Cliff Robertson, Higgens, Max Von Saydo, Jobert, and Faye Dunaway, Kathy, besides of course Robert Redford's Joe Turner. I liked the contrast between Higgens and Jobert in the fact that Higgens was a career man working for the government and Jobert was a contract killer only working for whoever paid him. Even though Jobert should have been the heavy in the film he was by far more sympathetic because what he did was only a job, and that all it was, to him and his encounter with Turner towards the end of the movie, who's job it was for him to kill, wasn't that threatening and not at all as personal as Turners scenes with Higgens were. Higgens always came across as a con-man who would shoot you, or have someone shoot you, in the back as soon as you turned around. This contrast goes to show you that a person who hires a killer to kill someone is far more guilty then the one that does the killing himself. Charles Manson didn't kill anyone, he had others do the killing for him, but he's more responsible for those murders back in 1969 then the ones that did the killings themselves. Faye Dunaway as Kathy was great as the innocent bystander who's life was turned upside down, by all these events that she had no knowledge or control of. She showed fear and outrage at first and then later realizing that Turner was telling the truth and that she ,like him, had no choice in the matter because she \"knew too much\" but to risk her life, what else could she do. Kathy ended up helping him because helping Turner or not she was also targeted like he was so she might as well do what was right. I'm surprised that I didn't read or hear anyone talk about, not all these years after \"Three Days of the Condor\" was released, the fact that a good part of the movie as shot in and around the ill-faded World Trade Center in NYC. In fact I think that \"Three Days of the Condor\" was the first major motion picture that was filmed there. The WTC was opened to the public in 1974 and the movie was made in late 1974 and early 1975. Even more ironic about the film is that Higgens, who was undoubtedly the villain in it, had his CIA offices located in of all places, you guessed it, the World Trade Center.",
         "This had everything a political thriller should have - excellent acting by Redford and Dunaway and a well-written internally-consistent plot. Robert Redford plays a CIA agent who read books - that's all, just read books. He gets involved with a CIA plot when all of his coworkers are assassinated. I like this movie on several levels. The thing that stands out is that Redford isn't an \"action hero\". He stays ahead of the game - just barely - by using his intelligence. This make for a much more interesting movie than the simple-minded shoot 'em up of the current action heros.",
         "Sidney Pollack is a great admirer of Alfred Hitchcock, which he also proved with \"The Interpreter\". Apparently he loves suspenseful thrillers and I sure hope for him that his movies will age as well as those that Hitchcock made. And I guess they do. Even though it was made thirty years ago, \"Three Days of the Condor\" still hasn't lost any of its power. Sure, you could call it a typical product of the seventies, but even today this movie feels up-to-date and believable. Turner works for the American Literary Historical Society, or at least so it seems. In reality he is a CIA researcher, with the code name Condor, who gets paid to read books, in which he has to find possible scenarios that could be used in intelligence work. When he returns to his office after he went out to get lunch, he finds all his colleagues dead and he doesn't know who shot them. He immediately calls a superior who sends his section chief to get him out of there. But when the man arrives, he immediately opens fire on Turner. In an act of pure desperation - he no longer knows who he can trust - Turner kidnaps a woman he has never seen before and forces her to hide him. He will stay in her house until he can find out what exactly is going on. But even there he isn't save. He is discovered and attacked in the woman's house, but is able to kill the man. Now he knows one thing for sure: the man too had a connection to the CIA, which means that someone in the CIA must be behind all this... I guess the best thing about this movie is the fact that it doesn't give away all its information at once. At first Turner appears to be an ordinary guy who arrives late for work. Nothing special there. But because he gradually builds up tension by slightly releasing more information, the writer knows how to keep you focused and interested. I guess the best way to describe this movie is calling it a classic spy thriller without James Bond-like locations or bad guys and and no super hero who can beat all the bad guys with a blink of an eye. No, this is a normal man who was at the wrong place at the wrong time and who now has to face an unusual and life threatening situation. I guess that's where this movie gets its strength: you can easily identify with him, even though he is a spy. And yes, the whole concept of the movie is very seventies: the paranoia towards the government, the insecurity of not knowing who your enemies or your friends are... all give it that typical feeling. but even today this movie hasn't lost any of its power or relevance. All in all this is a very good and stylish thriller that offers plenty of tension and some very nice acting. Especially Robert Redford and Faye Dunaway were very nice to watch, but the other actors did a fine job too. Thanks to the combination of the acting, a good story and some nice camera-work, Pollack has created a movie Hitchcock might have been proud of if he had done it. That's why I give this movie a 7.5/10.",
         "10 out of 10. And it took about 5 seconds to decide on that. This is simply a brilliant film. It's so smart, it doesn't feel like it has to explain everything that happens over and over again. And the story here is so deep and well-structured that it's possible to find several alternate movies inside the main one that could all work almost as well as the final product. There might not be perfect films, but THREE DAYS OF THE CONDOR is as close to perfect as any film of the modern era.",
         "Every now and then a film emerges which illuminates our government and all it's secret covert operations. Sometimes, government official are very embarrassed with just how close the movies are to their real life escapades. In this story a small group of government researchers are working at their daily humdrum jobs, when without notice, an assassin enters their building and murders them. Did I say all? Well unfortunately for the assassin, one employee Joseph Turner (Robert Redford) was literally 'out to lunch.' When he returns and finds everyone murdered, he keeps his cool and with a logical approach, must discover the who and why, his entire team was eliminated. It's a real-life cat-and-mouse game which if not played correctly, will end with the last member of the team code name Condor, dead with the outside world never knowing why. As Condor seeks those who ordered the murders and cover-up, he also discovers a professional killer is after him. Further, his immediate superiors do not want his coming in from the cold, they would prefer him dead. Condor learns quickly not to trust anyone and therefore takes steps to stay away from making 'predictable' mistakes. With the superior cast of Cliff Robertson as Higgins, John Houseman as Mr. Wabash, the international star, Max Von Sydow as Joubert and Faye Dunaway as Kathy. this film easily generates enough platitudes to support it as a Classic. ****"
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Dino De Laurentiis Company",
         "Paramount Pictures",
         "Wildwood Enterprises"
      ],
      "summaries": [
         "A mild mannered CIA researcher, paid to read books, returns from lunch to find all of his co-workers assassinated. \"Condor\" must find out who did this and get in from the cold before the hitmen get him.",
         "Joe Turner, code name Condor, works as a reader for Section 17 - fronting as the American Literacy Historical Society - of the Central Intelligence Agency (CIA). The section's readers read everything that is published to see if the material is being used or planted by national security agencies for the US or enemy regimes in actual operations. The office for the section, which is comprised of eight people in total, is located in a nondescript but secure building in New York City. After returning to the office from a lunch food run for which he initially left the building through an unofficial entrance/exit, Condor finds that all six of his colleagues at work that day, including his girlfriend Janice Chon, have been executed, their dead bodies strewn throughout the office. The seventh has been murdered in his home. Not knowing any of his superiors outside the section, Condor slowly begins not to trust the organization itself. After a botched attempt to bring him in, Condor decides to go on the run and try and figure out what is happening on his own. In his quest, Condor kidnaps a young, seemingly lonely woman named Kathy Hale, who, despite being scared by what is happening, eventually believes Condor's story and decides to help him. He also believes the executions have something to do with the tall Alsatian accented man he keeps encountering, and the last report he wrote and submitted to his superiors outside the section.",
         "A man named Turner works for the CIA reading books and postulating possible scenarios that could be applied to inteliigence work. He goes out to get lunch but when he returns everyone at the center has been killed. He calls his superior and asks for someone to bring him in, he tells him that his section chief will get him but when he arrives, the man tries to shoot him, he manages to shoot back and escape. In an act of desparation, the abducts a woman and forces her to shelter him until he can figure out what is going on. When someone goes to the woman's house and tries to kill him, he kills the man and discovers that he has a connection to the CIA, which means that someone in the CIA is behind the attempt on him.",
         "A bookish CIA researcher finds all his co-workers dead, and must outwit those responsible until he figures out who he can really trust."
      ],
      "budget": 0
   },
   "movielensId": 2819,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1975-09-24",
      "dvdReleaseDate": "1999-08-17",
      "directors": ["Sydney Pollack"],
      "runtime": 117,
      "movieId": 2819,
      "title": "Three Days of the Condor",
      "mpaa": "R",
      "actors": [
         "Robert Redford",
         "Faye Dunaway",
         "Cliff Robertson",
         "Max von Sydow",
         "John Houseman",
         "Addison Powell",
         "Walter McGinn",
         "Tina Chen",
         "John Randolph Jones",
         "Michael Kane",
         "Don McHenry",
         "Jess Osuna",
         "Dino Narizzano",
         "Helen Stenborg",
         "Patrick Gorman",
         "Hansford Rowe",
         "Carlin Glynn",
         "Hank Garrett",
         "Michael Miller"
      ],
      "imdbMovieId": "0073802",
      "originalTitle": "Three Days of the Condor",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [
         "6WobtaO4PhA",
         "tX6Ez5cpvxw"
      ],
      "plotSummary": "A bookish CIA researcher finds all his co-workers dead, and must outwit those responsible until he figures out who he can really trust.",
      "tmdbMovieId": 11963,
      "avgRating": 3.95794,
      "releaseYear": "1975",
      "numRatings": 3899,
      "posterPath": "/gbd3kO5kANvFrgPyxB0p6RNsOQC.jpg"
   }
}