{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "secret society",
            "id": 2908
         },
         {
            "name": "incan",
            "id": 10600
         },
         {
            "name": "human sacrifice",
            "id": 10864
         },
         {
            "name": "hidden treasure",
            "id": 208278
         }
      ],
      "imdb_id": "tt0010726",
      "video": false,
      "title": "The Spiders - The Golden Sea",
      "recommendations": [92332],
      "backdrop_path": "/gpqO9SlahiFkGgcavKTPMpBON0G.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Kay Hoog",
               "gender": 2,
               "credit_id": "52fe48e99251416c750b73d5",
               "name": "Carl de Vogt",
               "profile_path": "/etLaf9zTQTw49zgbVBgKoNTkTLx.jpg",
               "id": 46500,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Lio Sha",
               "gender": 0,
               "credit_id": "52fe48e99251416c750b73d9",
               "name": "Ressel Orla",
               "profile_path": null,
               "id": 1121846,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Dr. Telphas",
               "gender": 0,
               "credit_id": "56a9453d9251417db9001e9f",
               "name": "Georg John",
               "profile_path": null,
               "id": 29129,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Sonnenprieserin Naela",
               "gender": 0,
               "credit_id": "52fe48e99251416c750b73e1",
               "name": "Lil Dagover",
               "profile_path": "/lksn2PhJAxIGaWKDbLflQpyIycl.jpg",
               "id": 3005,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48e99251416c750b73c5",
               "name": "Fritz Lang",
               "profile_path": "/fQAlhdBDnUYXzkezvyzjLB72pvw.jpg",
               "id": 68,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e99251416c750b73cb",
               "name": "Fritz Lang",
               "profile_path": "/fQAlhdBDnUYXzkezvyzjLB72pvw.jpg",
               "id": 68,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e99251416c750b73d1",
               "name": "Erich Pommer",
               "profile_path": "/oClAs4W1TRc2jtYCU4CdtXlEhPZ.jpg",
               "id": 67,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 1.597615,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 91893,
      "vote_count": 5,
      "budget": 0,
      "overview": "In San Francisco, well-known sportsman Kay Hoog announces to a club that he has found a message in a bottle with a map drawn by a Harvard professor who has gone missing. The map tells of a lost Incan civilization that possesses an immense treasure. Hoog immediately plans an expedition to find it. But Lio Sha, the head of a criminal organization known as the Spiders, is determined to get the treasure for herself and plans a rival expedition.",
      "similar": [
         36669,
         37724,
         206647,
         646,
         954,
         691,
         36670,
         253,
         47971,
         10764,
         207703,
         657,
         658,
         668,
         681,
         699,
         708,
         714,
         700,
         9486
      ],
      "original_title": "Die Spinnen, 1. Teil - Der Goldene See",
      "runtime": 69,
      "poster_path": "/89HHXHuyqn181J6IwR83ooYtg13.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Decla-Film-Gesellschaft Holz & Co.",
            "id": 44382,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Decla-Bioscop AG",
            "id": 6762,
            "origin_country": ""
         }
      ],
      "release_date": "1919-10-03",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Spiders Serial",
         "id": 189295,
         "poster_path": "/qrIkWMlpPL6WBPKJQVgjO5lygxc.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Fritz Lang"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Fritz Lang"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0010726/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1NjAyMzkxNF5BMl5BanBnXkFtZTgwODk2NDk0MjE@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Carl de Vogt, Ressel Orla, Georg John | See full cast and crew »"],
      "reviews": [
         "This first episode of Fritz Lang's \"The Spiders\" is an entertaining adventure story, and it is particularly notable for its imaginative settings and visuals, and for the way that each sequence leads smoothly into the next. The story is far-fetched, of course, but Lang tells it quite well, and it makes for enjoyable viewing. The basic setup of the sinister organization of \"Spiders\" involves some of the themes that Lang used in more detailed form in his Dr. Mabuse movies. Here, the story is strictly for entertainment purposes, and as such it works well. Ressel Orla is suitably elegant as the leader of the \"Spiders\", and she usually makes the best of her opportunities. The opening message-in-a-bottle scene sets the tone, establishing tension and mystery right away. From there, Lang builds up the story nicely, as the characters learn about the hidden treasure and compete with each other and with other adversaries to find it. His style here is similar to that in some of the best of contemporary action movies, such as the Indiana Jones films. Most of the scenes work well in themselves, and once it gets going, each scene also moves the story ahead immediately to the next scene, without letting you pause for breath. Lil Dagover also adds a lot in her role as the priestess. Carl de Vogt is adequate as the hero Hoog, but he does not have a lot of presence or charisma, and most of the energy level in the characters comes from the female leads. This episode got \"The Spiders\" off to a good start, and it is the best of the two segments that Lang actually filmed. It does not have the deep themes found in Lang's best movies, but as entertainment it works quite well.",
         "In 1919 Fritz Lang passed up the opportunity to direct the now better-known Cabinet of Doctor Caligari, arguably the first German Expressionist Film, in order to make this apparently lightweight and simplistic adventure yarn. This is perhaps a surprise for those who see Lang as obsessed with deep and dark psychological studies but, in truth, Lang had a passion for easygoing comic book fare. Here Lang gets to indulge an action-adventure streak that carries through his work right up to his Indian diptych of 1959. It has to be said, the story of The Spiders' is paper-thin. Lang would construct far stronger plot lines in his collaborations with Thea von Harbou, but he penned this one on his own. His approach to storytelling is almost childlike, full of bizarre turns and constantly changing location and pace, as if to cram in as many ideas as possible. Yes, it's altogether flimsy and lacking in any depth, but it barely matters when the plot functions largely as an excuse for leading onto the next action set piece. It actually also occurred to me that Kay Hoog abandoning his yacht race to embark on a search for treasure might be a tongue-in-cheek reference to Lang's rejection of the Caligari project. Unlikely, but it would be very apt. As to Fritz Lang's abilities as a filmmaker, well, he had a fair way to go still in terms of grasping the form. In terms of staging action he follows the parallel editing techniques of DW Griffith. That's not a bad thing in itself, it's just that sometimes there's not enough correlation between the individual shots, and it gets a bit confusing as to where everyone is in relation to each other. Take for example the opening scene where an Inca stalks an explorer. We can infer that they are wandering around on the same cliff edge, but we don't really sense the danger the hunted man is in. Lang could have solved this by throwing in a point-of-view shot of the Inca looking down at the explorer or, better still, have the Inca appear in the frame behind and above him in a long shot. It's as if Lang knows what the script demands, but can't visualise the finished product and isn't experienced enough to know what will and won't work. What is distinctive about The Spiders however, and what makes it recognisable as one of Lang's, is its use of space. Lang trained as an architect at one point in his youth, and this is reflected in his shot composition. The sets here were designed by Hermann Warm, and they are very impressive so Lang was almost obliged to show them off, but it's the way he shoots them and the actors within them that is unique to him. While they are not as stark and stylised as the very typically Langian sets of the Dr Mabuse films or Metropolis, they are used in the same way. Lang often shows characters dwarfed in massive rooms, even when normal film convention would demand a mid-shot. He also likes to form geometric patterns in his shots, often with converging or criss-crossing diagonals. In fact, so good is Lang at showing off the architecture in The Spiders, it's actually to the detriment of the actors. He hasn't yet learnt how to focus our attention on the most important points of action. For all its flaws, The Spiders can be enjoyed as the pure and simple adventure flick that it is at heart \u0096 leaping from espionage to western to human sacrifice at the drop of a hat. It's very much in the tradition of Indiana Jones or the Tintin books (in fact it may well have been a direct influence on Prisoners of the Sun). The only trouble is there are far betters books and films in that tradition, so perhaps this is really one for Fritz Lang completists only.",
         "Die Spinnen, 1. Teil: Der Goldene See/Spiders Part 1(1919) was one of the first films to ignite the golden age of German silent film. Part 1 introduces arch villainous and adventurer Lio Sha. Part One deals with the search for the Golden Lake. This is one of the few early Fritz Lang films to be available on home video. The set designs are stunning and the costumes are wonderful. Spiders Part 1(1919) is a visual treat to behold.",
         "In San Francisco, the sportsman Kay Hoog (Carl de Vogt) tells to the members of a club that he has found a message in a bottle with a map from a Harvard's professor telling about a treasure of an Inca lost civilization still alive. He decides to go to Peru to seek the gold. However, members of the secret criminal organization \"The Spiders\" leaded by Lio Sha (Ressel Orla) break in Kay's mansion during the night and steal the map. Kay Hoog travels to Peru, where he retrieves his map and a document about the Diamond Ship from The Spiders. Later he saves the Priestess of the Sun Naela (Lil Dagover) and brings her to San Francisco. However, The Spiders kill Naela and Kay Hoog promises revenge for the death of his love. \"Die Spinnen,1. Teil - Der Goldene See\" is so far the weakest movie of the Master Fritz Lang that I have seen. The silly adventure is messy and pointless, with the (weak) hero going to the Inca civilization without supplies and returning engaged of their priestess that falls in love with him without any explanation. The Incas are destroyed by the criminals, and in the end I really did not like the story of this film. Anyway, Kay Hoog seems to be the source of inspiration of Indiana Jones. My vote is six. Title (Brazil): \"As Aranhas Parte 1 \u0096 O Lago Dourado\" (\"The Spiders Part 1 \u0096 The Golden Lake\")",
         "Imagine waking up and turning over to your lover only to find her missing and a huge black spider on her pillow. Imagine parachute jumping from a hot-air balloon high above the ruins of an Incan city in Mesoamerica. Imagine the chief protagonist dressed like Batman sans cape and living shipboard in a crate complete with your favorite liquors, a reading library and arsenal. Imagine a primary character name Kay Hoog \u0096 who happens to be a man. If you can imagine that, then it might be a flash-back to this film. Fritz Lang showed his filmmaking genius early in his career with \"The Spiders.\" These two first installments, beg for a remake and for some creative effort to produce the final two segments - \"The Secret of the Sphinx\" and \"For Asia's Imperial Crown\" - that were never made.",
         "A surprisingly weak film. The pacing is haphazard. The special effects are ineffectual. It's hard to believe that these pitiful sets were from the set designer for The Cabinet of Dr Caligari. The actors use guns the way that inexperienced toddlers might. And the Americans, Peruvians, and Inca all look very, very German. This film is only for the compleatist, desiring to view all of the films of Fritz Lang or of this genre. Don't come here for entertainment.",
         "Well, well... Even if you're a fervent admirer of Lang's silent films, this early one - the first part of a two-part unfinished four-part serial(!) - will leave you in doubt about Fritz's narrative skills. (His directorial skills aren't that evident either, but here and there one senses his talent for building up atmosphere.) The pic's just pure juvenile nonsense, which wouldn't be half as bad, were it not for the long ponderous stretches in between the childish action scenes. But the whole affair almost gets by on its amiable innocence. 4 out of 10 Inca treasures",
         "This film has an enormous amount of action and adventure in it. Characters are jumping from one country to the next in the matter of minutes. There is hardly a dull moment. My only problem with this film is that it seems to jump around too fast. One episode is barely finished, and boom, you're zapped to another location. If this movie had not been made in 1919, I would swear it had copied MTV's jump cut style. All in all, The Spiders, is a good introduction in the silent film adventure genre.",
         "Whoever likened this one to RAIDERS OF THE LOST ARK certainly knew whereof he spoke. He might, as well, have likened it to some of the adventures of the pulp heroes that followed. \"Kay Hoog\" reminds one more than a little of both Lamont Cranston (The Shadow) and Clark Savage (Doc Savage). (The Shadow, quintessential man of mystery- and the very first \"Dark Knight\"- was also thought to be one Kent Allard. If one were to take Savage's first name first and add to it the Kent, you end up with- voila- Clark Kent. Funny, innit?) Like Indiana Jones, Hoog isn't above pilfering the artifacts of an ancient civilization (though his thefts are often more blatant and less \"charmingly roguish\" than Jones's). Unfortunately, this two-parter is a far cry from subsequent serials (from any era) in terms of overall quality. One of the first indications that something is amiss vis a vis the cinematic storytelling is a scene where desperados on horseback, quite literally breathing down his neck, simply watch as Hoog escapes their clutches in a hot air balloon. Why they don't bother to shoot down the balloon is just one of the many movie-making mysteries that plague these two films. The second half of this two-parter is even worse than the first. Granted, this was one of the first ever serials and, as such, should be cut a bit of slack- but there are limits, even, to tolerance. (At one point, the capture of the hero is effected not on screen, but in the narration itself! Talk about cutting corners...) Fritz Lang happens to be one of the greatest filmmakers to ever make films; unfortunately for those of us who admire most of what he did, THE SPIDERS is a bitter pill indeed to swallow...",
         "Originally, \"The Spiders\" was planned as a four-part serial, and it shows. I dislike serials; they're typically ridiculous, convoluted and banal. This one is no exception. In the first part of \"The Spiders\", \"The Golden Lake\", a rich adventurer thwarts the plans of a gang of criminals--the Spiders--to steal gold from Incans. A silly love triangle ensues, with some Cowboys and Indians action. The sensationalism and exotica of it didn't entertain me. One can legitimately trace themes from this two-part series to Lang's later, far superior work. And, the film-making is better than in other serials I've seen from this time, including \"Les Vampires\" (1915). In \"The Spiders\", the camera isn't as static, and this film is fast paced, thankfully. The tinting and lighting are adequate, too. None of that's remarkable, though. It's nearly unseemly, however, in how closely this series resembles Louis Feuillade's serials; the criminal gang dresses and behaves like those in \"Les Vampires\"--only the names, and to a lesser extent, the situations have changed. For the further comments on The Spiders series, see the web pages for it."
      ],
      "genres": [
         "Adventure",
         "Western"
      ],
      "productionCompanies": [
         "Decla-Bioscop AG",
         "Decla-Film-Gesellschaft Holz & Co."
      ],
      "summaries": [
         "In San Francisco, the sportsman Kay Hoog tells to the members of a club that he has found a message in a bottle with a map from a Harvard's missing professor telling about a treasure of an Inca lost civilization still alive. He decides to go to Peru to seek the gold. However, members of the secret criminal organization \"The Spiders\" leaded by Lio Sha break in Kay's mansion during the night and steal the map. Kay Hoog travels to Peru, where he retrieves his map and a document about the Diamond Ship from The Spiders. Later he saves the Priestess of the Sun Naela and brings her to San Francisco. However, The Spiders kill Naela and Kay Hoog promises revenge for the death of his love.",
         "A desperate, haggard-looking man puts a message into a bottle, and is able to throw it into the sea just as he is shot by an arrow. Some time later, well-known sportsman Kay Hoog announces to a large audience that he has found the message, which tells of a lost civilization that possesses an immense treasure. Hoog immediately plans an expedition to find it. But Lio Sha, the head of a criminal organization known as the Spiders, plans her own expedition, and she is determined to get the treasure for herself.",
         "Kay Hoog finds a message that indicates that some Incas are still alive, but the secret organisation \"Die Spinnen\" wants the Incas' gold...."
      ],
      "budget": 0
   },
   "movielensId": 2823,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1919-10-03",
      "dvdReleaseDate": "1999-08-17",
      "directors": ["Fritz Lang"],
      "runtime": 69,
      "movieId": 2823,
      "title": "The Spiders - The Golden Sea",
      "mpaa": null,
      "actors": [
         "Carl de Vogt",
         "Ressel Orla",
         "Georg John",
         "Lil Dagover"
      ],
      "imdbMovieId": "0010726",
      "originalTitle": "Die Spinnen, 1. Teil - Der Goldene See",
      "genres": ["Adventure"],
      "youtubeTrailerIds": [],
      "plotSummary": "In San Francisco, well-known sportsman Kay Hoog announces to a club that he has found a message in a bottle with a map drawn by a Harvard professor who has gone missing. The map tells of a lost Incan civilization that possesses an immense treasure. Hoog immediately plans an expedition to find it. But Lio Sha, the head of a criminal organization known as the Spiders, is determined to get the treasure for herself and plans a rival expedition.",
      "tmdbMovieId": 91893,
      "avgRating": 2.71591,
      "releaseYear": "1919",
      "numRatings": 44,
      "posterPath": "/89HHXHuyqn181J6IwR83ooYtg13.jpg"
   }
}