{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0119586",
      "video": false,
      "title": "Lucie Aubrac",
      "recommendations": [
         100075,
         54012,
         203814,
         17376,
         64559,
         80336,
         52216,
         39968,
         81119,
         44442,
         86727,
         83994
      ],
      "backdrop_path": "/vXBCrgU1pWBvZ0Ud5THqr6g9DLO.jpg",
      "revenue": 458557,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Lucie Aubrac",
               "gender": 1,
               "credit_id": "52fe4827c3a36847f815a4bd",
               "name": "Carole Bouquet",
               "profile_path": "/xgntdhH1TKSbNEEWa8hxWdFYd5r.jpg",
               "id": 10500,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Raymond Aubrac",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4c1",
               "name": "Daniel Auteuil",
               "profile_path": "/lWXsmJwL4H2RyJpC8p7hLFl27pZ.jpg",
               "id": 6012,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Jean Moulin",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4c5",
               "name": "Patrice Chéreau",
               "profile_path": "/8Qbylwv2JLQVQsEYz9u1oUnVruf.jpg",
               "id": 23724,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Maurice",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4c9",
               "name": "Jean-Roger Milo",
               "profile_path": "/qIyAqoLvvbpQikebeHJwgIVfVwW.jpg",
               "id": 70168,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Serge Ravanel",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4cd",
               "name": "Eric Boucher",
               "profile_path": "/oH9dvoOWK8IirP7jnE4zdQ0fHXC.jpg",
               "id": 146207,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Charles-Henri",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4d1",
               "name": "Bernard Verley",
               "profile_path": "/9WhRSjAdYJOzY49eAtqwBGq4qDC.jpg",
               "id": 32514,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "René Hardy",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4d5",
               "name": "Pascal Greggory",
               "profile_path": "/1J3QISHIZg6C1xkhvshtX2lEiDG.jpg",
               "id": 16923,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "le colonel allemand",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a4d9",
               "name": "Hans Wyprächtiger",
               "profile_path": null,
               "id": 146209,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "le lieutenant Schlöndorff",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4dd",
               "name": "Andrzej Seweryn",
               "profile_path": "/cv5QWhXGPhWdFYsGOtg3856uNYJ.jpg",
               "id": 2829,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "le colonel Lacaze",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a4e1",
               "name": "Jean-Claude Bourbault",
               "profile_path": null,
               "id": 133836,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "l'attorney",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a4e5",
               "name": "Roland Amstutz",
               "profile_path": null,
               "id": 35002,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "le père de Raymond",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a4e9",
               "name": "Jean-Claude Grumberg",
               "profile_path": null,
               "id": 56837,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "la mère de Raymond",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a4ed",
               "name": "Danièle Goldmann",
               "profile_path": null,
               "id": 146210,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Paul Lardanchet",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4f1",
               "name": "Jean Martin",
               "profile_path": "/f7J7ItHt6AHz8z2PQuWpdH0lCHz.jpg",
               "id": 39953,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4827c3a36847f815a4f5",
               "name": "Marie Pillet",
               "profile_path": "/39EBKcbGa8PUIRL2q0dF31LZ4fQ.jpg",
               "id": 3731,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Booboo",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a4f9",
               "name": "Maxime Henry",
               "profile_path": null,
               "id": 146211,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "M. Henry",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4fd",
               "name": "Jean-Louis Richard",
               "profile_path": "/wAjzD4mkSgwL67EtZCRukwHUw86.jpg",
               "id": 18558,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Pierre",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a501",
               "name": "Grégoire Oestermann",
               "profile_path": "/e64VnLTfZy8G6VxcAkUz27hqr0c.jpg",
               "id": 146212,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Judith",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a505",
               "name": "Olga Grumberg",
               "profile_path": null,
               "id": 146213,
               "order": 18
            },
            {
               "cast_id": 24,
               "character": "Dr Dugoujon",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a509",
               "name": "Hubert Saint-Macary",
               "profile_path": "/dIZMy9tcqTgeJ7TQ0bxNZUS0RY7.jpg",
               "id": 44560,
               "order": 19
            },
            {
               "cast_id": 25,
               "character": "Bruno",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a50d",
               "name": "Yves Neff",
               "profile_path": null,
               "id": 146214,
               "order": 20
            },
            {
               "cast_id": 26,
               "character": "Pascal",
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a511",
               "name": "Jacques Bonnaffé",
               "profile_path": "/omETyIWs4pPtiWL6R6c2VQxV7po.jpg",
               "id": 5082,
               "order": 21
            },
            {
               "cast_id": 27,
               "character": "Klaus Barbie",
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a515",
               "name": "Heino Ferch",
               "profile_path": "/g8NRSFfRxGXutPCmgfjf4ouTpDn.jpg",
               "id": 1086,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4ad",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4827c3a36847f815a4b3",
               "name": "Lucie Aubrac",
               "profile_path": null,
               "id": 145854,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4827c3a36847f815a4b9",
               "name": "Claude Berri",
               "profile_path": "/1gpsO0gdsHJPhUzFGMHvE3Qo5yZ.jpg",
               "id": 20718,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.582814,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 52366,
      "vote_count": 12,
      "budget": 0,
      "overview": "A love story or a tale of the resistance, this poignant movie tells both the haunting story of a French resistance cell in Lyon but also the love of Lucie Aubrac for her husband...",
      "similar": [],
      "original_title": "Lucie Aubrac",
      "runtime": 115,
      "poster_path": "/emVEqXnFbIrFP7PeKg3KsM4CXs1.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "D.A. Films",
            "id": 6541,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pricel",
            "id": 6542,
            "origin_country": ""
         }
      ],
      "release_date": "1997-02-26",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Berri"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Lucie Aubrac",
         "Claude Berri"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0119586/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3NDY5NzI2OV5BMl5BanBnXkFtZTYwOTU2Nzg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Carole Bouquet, Daniel Auteuil, Patrice Chéreau | See full cast and crew »"],
      "reviews": [
         "Engaging story and performances involving members of the French resistance during World War II. Although I have not yet read the account on which it is based, I have no reason to believe the film takes too many liberties with the truth. The locations and sets seem very authentic, and the dialogue is evocative of the way people spoke at the time. Something exceptional is presented by way of action sequences, in fact, where attempts at re-enacting simple events on film often fail; namely, the interdiction of a convoy carrying prisoners and a particularly realistic execution scene. High marks are due the production crew for this one. The overall history of the French resistance is an extremely complicated tale to be retold for purposes of explaining just how this story resonates. Young viewers need to educate themselves in that history in order to appreciate fully this film's merits.",
         "I love french movies what can I say. This one is really good as well. Interesting story I'd never really thought about. I was worried it would be old and bad you know like many period films are but this one is pretty well done. The acting is up to scratch and especially moments when the captives are in the prison and they really are feeling the pain and torture and still managing to resist the urge to stop it. Very few weaknesses as well. Lucie is really beautiful as well a pleasure to watch. Very desparate film which is well resolved. Overall worth a watch. I gave it 8.",
         "First-rate acting and smooth direction make this personal recounting of controversial Resistance events well worth seeing. As with all films by Claude Berri, the storytelling is direct and the cinematography is both poignant and sensitive. Daniel Auteuil is great as usual. Carole Bouquet also contributes, albeit with less emotional range. The movie focuses as much on the love between Lucie and Raymond Aubrac as on the historical events surrounding them as they participate in the French Resistance to German occupation during World War II. The movie also contains powerful action scenes of escape and guerilla fighting (which the Germans considered terrorism at the time). Watch for a striking scene where Heino Ferch (as Klaus Barbie) tortures Auteuil (as Lucie's husband Raymond) to obtain information about Resistance leader \"Max\". Not only is this scene memorably acted and filmed, but it bears on a most controversial event in the history of the Resistance. The script follows a book by Lucie Aubrac that is ostensibly autobiographic. To this day, historians debate whether the Aubracs remained committed to the resistance or whether Raymond actually cracked under torture and betrayed resistance mastermind Jean Moulin (\"Max\"). Moulin was arrested soon after Raymond left prison and died a hero, refusing to speak under the torture of Klaus Barbie, the \"Butcher of Lyons\". These events and Barbie's much later in persona trial (1987) still rattle many people's understanding of the morals and history of France in the last sixty-plus years.",
         "This film is an excellent tribute to the bravery of the men and women of the French Resistance during the Second World War. The film revolves around Lucie and her attempts to rescue her husband, after he is arrested by the Gestapo at a Resistance meeting. This film is indeed a testimony to Lucie and Raymond's relationship, but in my mind, the film serves equally as an insight into France during the occupation and the political state at the time. An excellent film. - Jonno",
         "It's always problematical when a given actor/actress is replaced during filming for whatever reason. Personally I thought Ray Walston was fantastic in 'Kiss Me, Stupid' and can't visualize Peter Sellars even equalling Walston's performance, let alone eclipsing it. So it is here. One commentator bizarrely described Juliet Binoche as the best actress in France. I have every admiration for Binoche and see as many of her films as possible but has the commentator in question never heard of Isabelle Huppert, Nathalie Baye, Suzanne Flon, Sandrine Kiberlain, Manu Beart, etc. Nevertheless this is still a great movie and I for one cannot imagine anyone other than Carole Bouquet as the eponymous heroine. Were this fiction it may be thought a tad over the romantic top to have two lovers celebrate the date they first made love and take a vow to be together on that particular anniversary for as long as they live, but, as we know, this is a True story and BOTH lovers, Auteuil and Bouquet make it believable. There is a certain symmetry here too if anybody asks you. Having established under the credits an active Resistance group in which Auteuil (as Francois Samuel, 'Aubrac' was the Resistance name of the husband and wife team)is prominent we then see him at home in a tender scene with his wife (Bouquet) which establishes the secondary (or primary, depending on your point of view) theme of enduring love, and then, to put things in perspective, we see Lucie in her day job of schoolteacher, spelling out to les enfants the value of history as a learning tool and reminding them that even as they speak they are themselves living history. We are then into a somewhat conventional Resistance story. Brave freedom fighters captured and tortured, one woman's love overcoming the might of the occupying forces. It is interesting that Berri has opted to show Lyon as a sun-filled city - perhaps a hangover from his Jean de Florette/Manon des Sources gig a dozen years earlier - and this not only makes a contrast from the usual bleak, overcast, settings of other Resistance movies, but also points up the horror/barbarism occurring behind closed shutters while the sun pours down on France's Second City. Of course any film on the Resistance has to compete with 'L'Armee des Ombres' and, to a lesser extent, 'Laissez Passer' and if Lucie doesn't quite make it she makes a very creditable and honorable attempt. 8/10",
         "Claude Berri began filming this movie in 1996 with Daniel Auteuil and Juliette Binoche. Berri and the headstrong Binoche came to (creative) blows over script changes. He wanted to make it more of a love story, she wanted it to remain more factual and so in a move unheard of in French cinema he fired his leading actress, who also happened to be the biggest French star in the world. A few monthe later she won an Oscar for The English Patient and berri recast his movie with Carole Bouquet in the lead. Bouquet is a talented actress, but not in the same league as the extremely gifted Binoche. Auteuil as usual gives a fine performance, but the whole excersise seems leaden down by romanticism. Binoche and Auteuil went on to star together in Leconte's altogether better La Veuve de Saint-Pierre",
         "This is a rather small and quiet WWII film. While the film excels at its realistic portrayal of the French Resistance, it is a film that would be \"box office poison\" in America because its commercial marketability is pretty limited. This is NOT a film that teens or many prospective viewers would rush to the theaters to see! There are few explosions and the nudity isn't the least bit gratuitous. Because of this, it would only have been made abroad or by an independent film maker and so it wasn't surprising that this film was shown on the Sundance Channel. The story purports to be about a real couple who worked for the resistance movement. When the husband (Daniel Auteuil) is taken by the Nazis, his devoted wife (Carole Bouquet) tries desperately to free him. Both actors are pretty recognizable to American audiences, as Auteuil has appeared in tons of films--playing a sort of \"everyman\" character and Bouquet played the female lead in one of the Bond films (FOR YOUR EYES ONLY), though she's done plenty of films as well. For a 40 year-old lady, Bouquet is amazingly beautiful and sensuous--way to go, girl! The action is very low-key but tense and the film is a very enjoyable history lesson designed for an adult and discriminating audience.",
         "\"Lucie Aubrac\" tells a slightly tweaked version of the true story of one woman's heroic struggle as a member of the underground Resistance in WWII occupied France. Though artistically and technically excellent, many will find this story only marginally interesting as it lacks the usual suspense, action, and other excesses which the public, especially the young theater-going audiences, expect of such films. Nonetheless, just watching two fine French actors (Bouquet & Auteuil) at work telling a story not oft told in film will be sufficient for many, especially those into Europics who don't mind subtitles.",
         "Lucy Aubrac (Carole Bouquet) is a woman in love with her husband Raymond (Daniel Auteuil). He is an important member of the French resistance and arrested with his friends in a meeting after being betrayed. Lucy will try to rescue him from the Gestapo prison using all the possible ways. A beautiful romance in the Second World War, based on a true story. A correct direction and good performances of the cast make this movie a worthwhile entertainment. My vote is seven.",
         "While not on a par with Berri's remarkable 2 film epic \"Jean de Florette\" and Manon of the Spring\", this is a fairly engrossing, romantic, if somewhat romanticized true story of a married pair of resistance fighters in WWII France. Both Daniel Auteil and Carole Bouquet are solid as the couple, especially in their scenes together, which nicely capture the erotic tension of a married couple deeply in love, whose passion is not just physical, but fed by the fact they admire each other as human beings as well. It's also nice to see a war film where the woman pulls off the heroics to try and save her man, rather than the other way around. But the darkness of occupied France seems a but sanitized here, the awful price paid by those fighting back and their innocent families is alluded too but never fully dealt with, and there is something a bit light weight about it in the end. Bouquet keeps everything so hidden when not around Autiel that she becomes somewhat opaque. It's always interesting, but a bit stolid. Rarely truly tense, frightening or emotional. Still it's a good, decent, involving film, if not a great one."
      ],
      "genres": [
         "Biography",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Centre National de la Cinématographie (CNC)",
         "D.A. Films",
         "October Films"
      ],
      "summaries": [
         "A love story or a tale of the resistance, this poignant movie tells both the haunting story of a French resistance cell in Lyon but also the love of Lucie Aubrac for her husband, and the lengths she goes to to rescue her husband from prison on more than one occasion. Based on a true story Lucie Aubrac works as both history lesson and love story.",
         "Based on Lucie Aubrac's autobiographic novel, the movie tells the story of a couple of participants in the French Resistance to German occupation during World War II. Passion and wit help Lucie free her husband Raymond from certain death at the hands of the Gestapo (the German Secret Police) on more than one occasion. The movie highlights the relationship between Lucie and Raymond, and their and others' heroism in battle. Historians still debate whether, in reality, the Aubracs became turncoats and betrayed Jean Moulin (\"Max\"). Moulin, the Resistance's mastermind and most famous hero, subsequently died without speaking at the hands of notorious Gestapo officer and torturer Klaus Barbie, the \"Butcher of Lyons\"."
      ],
      "budget": 0
   },
   "movielensId": 2833,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1997-02-26",
      "dvdReleaseDate": "2004-06-28",
      "directors": ["Claude Berri"],
      "runtime": 115,
      "movieId": 2833,
      "title": "Lucie Aubrac",
      "mpaa": "R",
      "actors": [
         "Carole Bouquet",
         "Daniel Auteuil",
         "Patrice Chéreau",
         "Jean-Roger Milo",
         "Eric Boucher",
         "Bernard Verley",
         "Pascal Greggory",
         "Hans Wyprächtiger",
         "Andrzej Seweryn",
         "Jean-Claude Bourbault",
         "Roland Amstutz",
         "Jean-Claude Grumberg",
         "Danièle Goldmann",
         "Jean Martin",
         "Marie Pillet",
         "Maxime Henry",
         "Jean-Louis Richard",
         "Grégoire Oestermann",
         "Olga Grumberg",
         "Hubert Saint-Macary",
         "Yves Neff",
         "Jacques Bonnaffé",
         "Heino Ferch"
      ],
      "imdbMovieId": "0119586",
      "originalTitle": "Lucie Aubrac",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A love story or a tale of the resistance, this poignant movie tells both the haunting story of a French resistance cell in Lyon but also the love of Lucie Aubrac for her husband...",
      "tmdbMovieId": 52366,
      "avgRating": 3.28804,
      "releaseYear": "1997",
      "numRatings": 184,
      "posterPath": "/emVEqXnFbIrFP7PeKg3KsM4CXs1.jpg"
   }
}