{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0050814",
      "video": false,
      "title": "The Pajama Game",
      "recommendations": [
         37467,
         35009,
         126919,
         32552,
         49836,
         85642,
         27506,
         77955,
         43810,
         37358,
         43044,
         52282,
         27505,
         85637,
         68440,
         46932,
         22178,
         74469,
         19335,
         52276
      ],
      "backdrop_path": "/yRBeb51uDzAyuS9kD3l32lvqAOV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Katherine 'Babe' Williams",
               "gender": 1,
               "credit_id": "52fe45a8c3a36847f80d3401",
               "name": "Doris Day",
               "profile_path": "/wX7nvD6VYrp98SxkwszHrOLONou.jpg",
               "id": 8237,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sid Sorokin",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d33e1",
               "name": "John Raitt",
               "profile_path": "/vDZC3s2uFEyZqXafgUJYbhU7pEz.jpg",
               "id": 124879,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Gladys Hotchkiss",
               "gender": 1,
               "credit_id": "52fe45a8c3a36847f80d33e5",
               "name": "Carol Haney",
               "profile_path": "/x3kRKdP9JfRghuAugh4QyxI3cdU.jpg",
               "id": 124880,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Vernon 'Hinesie' Hines",
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d33e9",
               "name": "Eddie Foy Jr.",
               "profile_path": "/o8ydEPgEfdc913AdyPDkXRx5lQ0.jpg",
               "id": 30278,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Mabel",
               "gender": 1,
               "credit_id": "52fe45a8c3a36847f80d33ed",
               "name": "Reta Shaw",
               "profile_path": "/vEiRl8Mj51VCykLT3TQox05CGKt.jpg",
               "id": 5828,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Poopsie",
               "gender": 1,
               "credit_id": "52fe45a8c3a36847f80d33f1",
               "name": "Barbara Nichols",
               "profile_path": "/5327cqoUJIWAg3iatFdVWQmpoW3.jpg",
               "id": 14575,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Mae",
               "gender": 1,
               "credit_id": "52fe45a8c3a36847f80d33f5",
               "name": "Thelma Pelish",
               "profile_path": null,
               "id": 45613,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Prez",
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d33f9",
               "name": "Jack Straw",
               "profile_path": null,
               "id": 124881,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Myron Hasler",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d33fd",
               "name": "Ralph Dunn",
               "profile_path": "/rb3xuZbdVkwxpYrae1KyV0jNW8a.jpg",
               "id": 124882,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Pajama Girl",
               "gender": 1,
               "credit_id": "58df4868c3a3683d2a004aa0",
               "name": "Larri Thomas",
               "profile_path": "/gzVGA3VB6Zi0ZWZc4AhAdvHTjS9.jpg",
               "id": 1787560,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d3407",
               "name": "George Abbott",
               "profile_path": "/fFnbYNzHLfQjxl3BH6u7glnXwL1.jpg",
               "id": 2004,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d340d",
               "name": "Stanley Donen",
               "profile_path": "/8r91mtKkWdYri739IilAvTVzr1E.jpg",
               "id": 13284,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d3413",
               "name": "George Abbott",
               "profile_path": "/fFnbYNzHLfQjxl3BH6u7glnXwL1.jpg",
               "id": 2004,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d3419",
               "name": "Richard Bissell",
               "profile_path": null,
               "id": 1162826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57ebf3ecc3a36813e9000c90",
               "name": "Harry Stradling Sr.",
               "profile_path": null,
               "id": 10537,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.574719,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40867,
      "vote_count": 14,
      "budget": 0,
      "overview": "Employees of the Sleeptite Pajama Factory are looking for a whopping seven-and-a-half cent an hour increase and they won't take no for an answer. Babe Williams is their feisty employee representative but she may have found her match in shop superintendent Sid Sorokin. When the two get together they wind up discussing a whole lot more than job actions! Written by A.L. Beneteau",
      "similar": [
         812,
         872,
         224141,
         10530,
         11224,
         38757,
         11631,
         114,
         15121,
         703,
         134,
         252,
         3933,
         18947,
         19404,
         46195,
         254470,
         11970,
         10020,
         342473
      ],
      "original_title": "The Pajama Game",
      "runtime": 101,
      "poster_path": "/fGzJvlWYcGfBwf81fOSjVSkILx5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1957-08-29",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Based on the hit Broadway musical, featuring the choreography of Bob Fosse.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "George Abbott",
         "Stanley Donen"
      ],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "George Abbott",
         "Richard Bissell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050814/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1NTM0MjIzNF5BMl5BanBnXkFtZTgwMjYyNjIzMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Doris Day, John Raitt, Carol Haney | See full cast and crew »"],
      "reviews": [
         "When I purchased \"The Pajama Game\", I felt confident that the same team that brought me my all-time FAVORITE musical, \"Damn Yankees\", would not let me down. I was right. The dynamic team of George Abbot & Stanley Donen, Bob Fosse's oustandingly quirky choreography, and the wonderfully superb music and lyrics provided by Adler & Ross bring me more satisfaction than the 7 1/2 cents raise when it was given to the Sleep-Tite employees. Doris Day is charmingly witty and All-American in the role of Babe Williams... a role that allows her to radiate that eternal sunshine that seems to constantly course through her veins. Watch her vitality in numbers like \"7 1/2 Cents\" and \"I'm Not At All In Love,\" her energy and vivacity in \"There Once Was a Man\", and the romance in her \"Hey There\" reprise. But let's keep in mind that Doris is also the only cast member not imported from the original Broadway show. (Much as I love Doris... what the heck was wrong with Janis Paige? Rent the film Silk Stockings... I think she would have been perfectly darling!) The show cast is an ensemble of sheer perfection! Reta Shaw is terrific as Mabel, Barbara Nichols and Thelma Pelish are riots as Poopsie and Mae, Jack Straw is superb as Prez, and Ralph Dunn is sublime as Mr. Hasler (\"Now that isn't nice!\"). John Raitt is great in reprising his role of Sid Sorokin... the man with stars in his eyes and a company to run. Whatta voice! And how about that Eddie Foy, Jr.? As Vernon Hines (aka \"Hiiiiinesy\"), he's an absolute TRIP! What's better than a drunken knife thrower who is having a hard time trusting his girlfriend? AND he sings and dances. Such an ADORABLE guy with a bundle of talent! However, my PERSONAL favorite is none other than that smashing, electrifying dancer with the absolute LONGEST limbs ever... Carol Haney, as Gladys Hotchkiss.. She is not only BRILLIANT but gives an absolutely FLAWLESS performance, in my opinion. Her dancing is not to be reckoned with... just look at her go in \"Steam Heat\" (breath-taking choreography and dancing!), and even \"Hernando's Hideaway\", as well as \"Once-A-Year Day.\" Her comedic timing is uncanny, and with that grainy voice and pixie hair cut, she absolutely STEALS every scene she's in. It's most unfortunate that she died so young and was unable to pursue a further career in movies or on Broadway. All in all, this is a WONDERFUL piece of musical cinema, and I definitely recommend it!",
         "in this breezy version of the 50s stage smash. Fun all the way with many songs that became 50s standards: \"Hey There,\" \"Hernando's Hideaway,\" \"Steam Heat.\" Great supporting cast led by Carol Haney, Reta Shaw, Eddie Foy, Jr., Ralph Dunn, Thelma Pelish, and Barbara Nichols. Peter Gennaro is one of the dancers. Raitt is hunky and butch in the musical lead, and Day is at her tomboy best. \"There Once Was a Man\" is a super duet for the stars, allowing them to be be funny while they belt out this classic, while Shaw and Foy shine in \"Picture This.\" The \"Hey There\" number with Raitt playing back the song on his dictaphone and responding to it is a true classic and was also a smash 50s hit for Rosemary Clooney. But Haney just about steals the show as Gladys in the \"Steam Heat\" and \"Once a Year Day\" numbers. She's also hilarious in the \"Hernando's Hideaway\" number and following comic scenes. Haney is a combo of Gwen Verdon, Carol Burnett & Alice Ghostley. Haney was also a featured dancer in Kiss Me Kate. Great fun.",
         "When it was released in 1957, The Pajama Game joined a long procession of song and dance Movies that grabbed us all who watched them with their energy, vitality and infectious romance. Doris Day bounces and radiates her way across the screen as only she can and has done many times previously in musicals, singing, dancing and looking great, teaming up this time with some of the cast from the Broadway Production, Eddie Foy Jnr., Carol Haney, Rita Shaw and John Raitt. As you would expect from this array of talent something special would arrive, and it didn't take long for us to taste it. In the opening minutes we are treated to one of Choreographer Bob Fosse's routines with Eddie Foy Jnr. and Rita Shaw singing and stepping to 'I'll never get jealous again ' and as the show moves on more memorable sequences appear like Carol Haney dancing to ' Steam Heat,' Doris Day singing ' Seven and a Half cents ' and everyone it seems giving a rousing rendition of ' Hernando's Hideaway.' The Pajama Game is alive with Fiftie's colour, vigour and good old fashioned song and dance, put together by ideas and talent that perhaps in those days we had the chance to take it all for granted. Sadly.....these days, with the absence of musicals we don't have that opportunity.",
         "Who'd have thought that a labor dispute could be such fun? Just add Doris Day's smile, Bob Fosse's choreography, amazing music and dancers and a bag of popcorn! This is a highly energetic film, super-charged with charisma. I can't count the number of times I hit \"pause\" and \"rewind\" just to get another look at a surprise dance move. Boy, do I dare say that this may have been what \"Grease\" was hoping it could aspire to? I want to see this one again real soon!",
         "Even with three numbers from the Broadway production missing, and even with some lyrics sanitized for middle-America, \"The Pajama Game\" remains one of the most successful stage-to-screen transitions. Except for Doris Day stepping in for Janis Paige, all the principals of the Broadway production are also aboard. You can compare for yourself Day's performance to Paige's (if you can get your hands on the original cast recording) but it's not hard to understand the producers' choice to go with at least one movie box office name. In old man Hasler's words, it's a \"COMPROMISE!\" \"The Pajama Game\" is (with one unfortunate exception) unapologetically stagy. And why apologize? By keeping the feel of a stage production the movie preserves the flavor of the performances. Reta Shaw and Eddie Foy Jr. team up for a winning soft shoe routine in \"I'll Never Be Jealous Again.\" \"Racing With the Clock\" benefits from dolly shots that open up the number without closing out the visual ironies. The unfortunate exception is \"Once a Year Day,\" which takes to the not-so-great outdoors to destroy a once-great production number. The legendary Bob Fosse choreography is badly served by a multiplicity of camera angles that actually dilute the dancing. Oh, well. Luckily, there is \"Steam Heat,\" completely undiluted, offering Fosse as one of the dancers. I am now about to make myself feel very old by saying (oh, dear): They don't make 'em like this anymore. But, you see, they can't because Broadway doesn't make 'em like this anymore except in revival. Wait, let me sing it: \"The nostalgia game/ is the game I'm in/ And I'm proud to be/ in the nostalgia game/ I love it...\" And I love this movie. Don't miss it if you can.",
         "Almost 30 years ago I went on my first flight ever (London). I was so excited but I made the fatal flaw of staying up to watch \"The Pajama Game\". I had never seen the film before and knew only 'Hey, There' from the score. Needless to say I became almost as excited about \"Pajama Game\" as about England! I am perplexed that some viewers find this film... boring (e.g. 'Pajama Lame'). People really do live on 'different planets'. For me, then as now, I am amazed that this film is so 'up'- with one rousing song after another ('I'm Not at All in Love', 'Once a Year Day', 'There Once Was a Man', 'Hernando's Hideaway', 'Steam Heat'). The quiet songs- 'Hey, There', 'Small Talk', and the video-appended 'The Man Who Invented Love' are charming too. How anyone can sleep-through or flat out dislike this film is beyond me. The film IS dated (male/female roles), very 1950s. But sometimes the '50s are a fun place to go. Doris' greatest Day. HJ",
         "The 1957 film version of the Broadway musical THE PAJAMA GAME is one of the best translations of a stage musical to the screen ever. The screen version is extremely loyal to its origins, utilizing almost all of the original Broadway cast (except for Janis Paige, who lost the role of Babe to 50's box office powerhouse Doris Day)and keeping most of the original score intact (only one song \"Hers Is\" was not used in the film and a song written especially for Doris for the film, ended up being cut). This delightfully original musical centers around the Sleep-Tite Pajama Factory where the head of the grievance committee (Doris) is trying to negotiate a 7 and a 1/2 cent raise for the factory workers by butting heads with the new factory supervisor (John Raitt, reprising his Broadway role)but eventually falling for him. Musicals were past their prime by the time this one made it to the screen, but it is still beautifully mounted and has some of the greatest songs in musical comedy (\"Hey, There\", \"I'm not at all in love\", \"There Once was a Man\"). Day and Raitt make an engaging screen couple (Day has rarely been so adult or sexy on screen) and the imaginative choreography by the legendary Bob Fosse is a big plus. Carol Haney's \"Steam Heat\" is classic Fosse and one of the highlights of this wonderful stage musical that inexplicably died at the box office upon release. A great musical that is a must for Day and Fosse fans.",
         "With all of the original cast members intact (John Raitt, Reta Shaw, Gwen Verdon, Eddie Foy, Jr.) except for the exceptionally talented Doris Day filling in for Janis Paige, 'The Pajama Game' is rollicking good fun and a smash hit once again with all of Bob Fosse's show-stopping choreography given top-rate exposure. Who would think a story about a labor dispute in a pajama factory could be turned into such a joyous musical? Carol Haney is priceless doing 'Steam Heat' and 'Hernando's Hideaway' with great finesse. Day sings her heart out on 'Hey There' and other tunes, while Raitt reprises his Broadway role as the factory foreman who comes up against the stubborn and feisty Babe, head of the grievance committee. Day and Raitt can do no wrong, whether they're singing a ballad or a jump tune, whether singing or dancing, whether sparring or smooching. It's all great fun done up in gaudy technicolor and undoubtedly one of the great film musicals of the '50s, the kind that we sorely miss today. One great song-and-dance routine follows another with no shortage of imagination as to staging and concept. A treasure! See it and enjoy!!",
         "One of the truly unsung musicals of the 1950s, with a remarkably convincing performance from Doris Day, an impressive movie debut by John Raitt and wonderful choreography by Bob Fosse. Pajama Game is probably one of the two most successful musical movies that Warner Bros produced, the other, of course, also starring Doris Day: \"Calamity Jane\", which reversed the order of Adler and Ross's wonderful creation by moving to the theatrical stage after the movie was made. Stanley Donen and George Abbot have produced and directed a total joy of a movie, creating a believable factory environment and giving the union demands for a pay rise the full strength. Carol Haney (from the record breaking Broadway production) makes a wonderful front office employee and with her number \"Steam Heat\" gives Fosse's choreographic skills full rein! Truly a joy of a movie, wonderfully photographed in magical colours and in excellently framed CinemaScope. How hard to think this film has been overlooked for so long. Definitely a must for any fan of musical movies and it warrants repeated viewing on a regular basis. A gem just waiting to be rediscovered.",
         "I believe \"The Pajama Game\" is the quintessential 1950s musical comedy. Although the film cut a few of the songs from the Broadway version, there were none added, so what is seen is a very faithful version of the source material. Another bonus with the film is that much of the Broadway cast is featured in the movie version. Doris Day, is as usual, wonderful, as is a young Bob Fosse's choreography. The \"Steam Heat\" and \"Once A Year Day\" numbers are highlights. The DVD features a cut number written for the movie. It is quite good, but it is also understandable why they didn't use it, in that it would have slowed the momentum of the film had it been used. All in all a very entertaining film."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Employees of the Sleeptite Pajama Factory are looking for a whopping seven-and-a-half cent an hour increase and they won't take no for an answer. Babe Williams is their feisty employee representative but she may have found her match in shop superintendent Sid Sorokin. When the two get together they wind up discussing a whole lot more than job actions!",
         "Myron Hasler, Vice-President of the Sleeptite Pajama Company, hires Sid Sorokin, new to town, as the company's new factory superintendent, with who the union workers on the floor will have to deal. Sid, in negotiations with the union, primarily has to deal with \"Prez\", the union President, and Katie Williams - Babe to her friends - the chair of the union's grievance committee. Babe does her union job well as she can tell how legitimate her member's claims are and how hard to push for them against management. Despite their professional management-union struggles, both Sid and Babe are attracted to each other, something that Sid is more willing to recognize than Babe. But their professional lives and their personal lives may not be able to mix, especially as the union has an outstanding grievance for an across-the-board 7½¢ per hour wage increase, which would bring their wages in line with the industry standard. Despite the company doing good business, Hasler has thus far refused them the raise, blaming the Board of Directors who have to approve it. This standoff could ruin any chance of a personal relationship between Babe and Sid, unless this problem is resolved, which doesn't look like will happen without drastic measures on one or both sides."
      ],
      "budget": 0
   },
   "movielensId": 2874,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-08-29",
      "dvdReleaseDate": "1999-09-21",
      "directors": [
         "George Abbott",
         "Stanley Donen"
      ],
      "runtime": 101,
      "movieId": 2874,
      "title": "The Pajama Game",
      "mpaa": "",
      "actors": [
         "Doris Day",
         "John Raitt",
         "Carol Haney",
         "Eddie Foy Jr.",
         "Reta Shaw",
         "Barbara Nichols",
         "Thelma Pelish",
         "Jack Straw",
         "Ralph Dunn",
         "Larri Thomas"
      ],
      "imdbMovieId": "0050814",
      "originalTitle": "The Pajama Game",
      "genres": [
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": ["CeQZ7ZIggFU"],
      "plotSummary": "Employees of the Sleeptite Pajama Factory are looking for a whopping seven-and-a-half cent an hour increase and they won't take no for an answer. Babe Williams is their feisty employee representative but she may have found her match in shop superintendent Sid Sorokin. When the two get together they wind up discussing a whole lot more than job actions! Written by A.L. Beneteau",
      "tmdbMovieId": 40867,
      "avgRating": 3.36762,
      "releaseYear": "1957",
      "numRatings": 491,
      "posterPath": "/fGzJvlWYcGfBwf81fOSjVSkILx5.jpg"
   }
}