{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0129884",
      "video": false,
      "title": "Dog Park",
      "recommendations": [
         24186,
         34564,
         55660,
         38554
      ],
      "backdrop_path": "/7UtRnJA2s4Q6NJSrf2KQVDyHx8J.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Lorna",
               "gender": 1,
               "credit_id": "52fe4696c3a368484e098e53",
               "name": "Natasha Henstridge",
               "profile_path": "/z0gm11WfolcmUUGDsTusUZsR60Y.jpg",
               "id": 57395,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Andy",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e57",
               "name": "Luke Wilson",
               "profile_path": "/n7CRA7h1z3FVOzBJ5EjfSrPQbvl.jpg",
               "id": 36422,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Jeri",
               "gender": 1,
               "credit_id": "52fe4696c3a368484e098e5b",
               "name": "Janeane Garofalo",
               "profile_path": "/jwZs05qdp8kh6IwfECxDyRrteK8.jpg",
               "id": 21197,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e5f",
               "name": "Bruce McCulloch",
               "profile_path": "/eVzci8ojDci3NpEoCBN2CNZSerA.jpg",
               "id": 73499,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Keiran",
               "gender": 1,
               "credit_id": "52fe4696c3a368484e098e63",
               "name": "Kristin Lehman",
               "profile_path": "/Ap4B4W3eR8WWaFmMn9sSrigBkYQ.jpg",
               "id": 148112,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "52fe4696c3a368484e098e67",
               "name": "Amie Carey",
               "profile_path": null,
               "id": 99513,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Trevor",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e6b",
               "name": "Gordon Currie",
               "profile_path": "/h06Vpwv0XHCogV4xULwNBVXN6dI.jpg",
               "id": 51539,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Callum",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e6f",
               "name": "Harland Williams",
               "profile_path": "/yAJrKIKT2OgbdMSZvpDJ3p203MY.jpg",
               "id": 16846,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Dr. Cavan, Dog Psychologist",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e73",
               "name": "Mark McKinney",
               "profile_path": "/4ylJGA141TC8ypPp44xocInZFmK.jpg",
               "id": 56867,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Male Dog Owner #1",
               "gender": 2,
               "credit_id": "535a50860e0a26640d001769",
               "name": "Ron James",
               "profile_path": "/z2FatYUMADjSCyQCGQco5pvUC3Z.jpg",
               "id": 1231704,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Male Dog Owner #2",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e77",
               "name": "Albert Schultz",
               "profile_path": null,
               "id": 184488,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Norm",
               "gender": 0,
               "credit_id": "52fe4696c3a368484e098e7b",
               "name": "Jerry Schaefer",
               "profile_path": null,
               "id": 193043,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Dougie",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e7f",
               "name": "Zachary Bennett",
               "profile_path": "/jWjUO3GgDlzeqQKPN7GrKpLout8.jpg",
               "id": 5918,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Cheryl",
               "gender": 1,
               "credit_id": "52fe4696c3a368484e098e87",
               "name": "Kathleen Robertson",
               "profile_path": "/dDokQ6zSfzkaZRvDfvEHglWMb90.jpg",
               "id": 33676,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Neighbor",
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e8b",
               "name": "Peter MacNeill",
               "profile_path": "/wNBsE9FqylAdCwzRvZtkvZJCfVI.jpg",
               "id": 229,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Ge Groovy Lesh",
               "gender": 2,
               "credit_id": "5a25830fc3a3680b8f0dc515",
               "name": "Boyd Banks",
               "profile_path": "/mDsIaLKyGqyV1Nt0pV9joGkQNSP.jpg",
               "id": 20196,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e49",
               "name": "Bruce McCulloch",
               "profile_path": "/eVzci8ojDci3NpEoCBN2CNZSerA.jpg",
               "id": 73499,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4696c3a368484e098e4f",
               "name": "Bruce McCulloch",
               "profile_path": "/eVzci8ojDci3NpEoCBN2CNZSerA.jpg",
               "id": 73499,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.138271,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 62994,
      "vote_count": 6,
      "budget": 0,
      "overview": "Sex comedy takes a look at contemporary dating mores and hypothesizes that the new dating location may be the dog walk in the park. A mild-mannered man loses his present girl friend to another man. His attraction to a kid's TV show hostess goes nowhere because of her obsession with her dog, Peanut. He then gets hooked up with an overly exuberant blonde who overwhelms him. He even lost his collie, Mogley, when his girl friend moved out. In a funny sub-plot, the collie is going to a doggie psychiatrist who determines the dog is being traumatized by his mistress' sexual antics. Jeri and Jeff are best friends whose constant smooching simply makes the leads life less comfortable.",
      "similar": [],
      "original_title": "Dog Park",
      "runtime": 91,
      "poster_path": "/fXq3pWtHrcfXFg6m7sLZoJRmBBq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-09-14",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "When it comes to dating, you better watch your step.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruce McCulloch"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Bruce McCulloch"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0129884/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzAzMzUzMTY5Ml5BMl5BanBnXkFtZTcwMTk5MTUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Natasha Henstridge, Luke Wilson, Kathleen Robertson | See full cast and crew »"],
      "reviews": [
         "Andy (Luke Wilson) has just been dumped by his girlfriend. To add insult to injury, she took the dog as well. Andy, not used to being on his own, meets Lorna (Natasha Henstridge) in a bar and a few sparks fly. Yet, Lorna, who has recently lost her boyfriend as well, is not interested in starting anything new and rejects Andy's advances. Jeri (Janeane Garofalo), as Andy's close co-worker, arranges for him to participate in a bachelor auction. Unfortunately, Kieran, loose and crazy, bids for him and promptly moves in with him. Complicated? You bet! Oh, and everyone walks their dogs in the dog park and takes their canine friends to obedience school with the same dog psychologist. Will the doggies get their diplomas even as their mixed-up owners try to straighten out their lives? This is, by no means, a successful romantic comedy. Instead, it falls into the category of an interesting also-ran. The main characters are appealing (Janeane Garofolo looks wonderful) but the plot's haphazard storyline is always throwing in more loose ends without connecting them in a logical fashion. The humor is not laugh-out-loud but rather mild and quirky. Fans of romantic comedies will probably stick this one out and enjoy it. Luke Wilson's ever-growing fan club will want to see it, also. All others will be less enchanted and find it a off-beat diversion with no memorable qualities.",
         "I liked it a lot. It's about people, not things or action or plot. That's uncommon these days, and should be applauded and supported by movie goers. People complain about f/x flicks, big cash blockbusters, and formulaic \"lowest common denominator\" pop-trash movies. That's a noble sentiment, but why not walk that talk? Why not get out to the theaters and pay to SEE movies that attempt to break out of the pop-culture molds? One of the reasons f/x (etc.) movies are almost all Hollywood makes anymore is because that's mostly all you and I pay to see anymore. Well, here's your chance to put your money where your mouth is and support something a little bit different. \"Dog Park\" had a few annoying \"snotty chick\" cliches, but not too many, nor too bad. Whether or not this movie represents real life or not, I cannot say. Whether or not a movie, any movie, even SHOULD represent real life--who knows that, either? But, if art, good or bad, is designed to evoke a certain feeling, and certain vibes, then this movie does that very well. The specific events may or may not be \"accurate,\" but the vibe and the results are. Minor flaws aside-- and they are mostly mere quibbles-- this is a bright, charming, thoughtful movie about contemporary people. I think everyone could relate to, and benefit from, \"Dog Park\"'s exploration of the heart: its fear, courage, deadness, commitment and connection. I gave this movie an 8 out of 10. This",
         "\"Dog Park\" is a lukewarm, enjoyable, and critically condemned contemporary romantic comedy which is low on romance, has a quirky \"Kids in the Hall\" sense of humor (for obvious reasons), and spends most of its time looking at the foibles of relationships. An so-so watch for channel surfers in the mood some light off-the-wall comedy.",
         "This is quite an odd film, but pleasant throughout due to the likeable actors and some laugh out loud moments. There are musings throughout about dating and love, none of which really hit the mark. The ending was somewhat unsatisfying, and loose ends weren't really tied up. In addition, Bruce McCullough, from Kids in the Hall, who directed and wrote the film, somewhat underutilized himself in the movie. He could have added some more hilarious moments for himself, but his Kids In the Hall partner Mark McKinney gets most of the laughs as a dog psychiatrist. I appreciated that it seemed to be trying something new in the field of romantic comedy, and was less predictable than many similar films. Overall, I did enjoy it and would say it is worth a rental, but I can't really justify giving it more than 6/10.",
         "I thought that this movie was a bit far fetched, that it all fell together a bit to easily (as romantic comedies sometimes have a tendency to do). It's a little short on laughs, the emphasis is definitely on romance over comedy. However, Luke Wilson is, as always, charming, and overall the movie is an enjoyable, easy way to pass the time.",
         "Jeez, I think I saw a different movie. Let's see.....nope, it WAS \"Dog Park.\" Apparently we have a whole class of film students here who were given the assignment, \"Pan a Film and Get Your Review Published\" and IMDb was the only place that would put them in print. Dog Park is fine. It's nice. It's even intriguing. Its humor is low key, except where it's laugh-out-loud, which was in several places when I saw it (25 yr. old black woman and 50 yr. old white guy, 15 rows apart, the only 2 in the theater; we laughed at different parts, but we laughed). Luke Wilson is terrific, a curious blend of David Duchoveny and Bill Pullman. I'll go to his next movie. Natasha Henstridge can actually act! Brava! OK, so it's not an Oscar contender. I go into a theater to enjoy a movie, not to trash it, and I enjoyed this one just fine.",
         "I wanted to like this movie. It was an interesting concept of people meeting at a dog park as they struggled to establish relationships. There was good comedic actors and cute pooches. But since it was supposed to be a romantic comedy, I didn't see much comedy and even less romance. All the characters were struggling and not having much enjoyment in their relationships. The actors Luke Wilson and Janeane Garofalo did their job OK but were working with weak material. None of it jelled and some of the characters such as the dog trainer sounded retarded. The dialog was wimpy and desperate at times. Sad. Lame. Lame. Lame.",
         "Apparently the trend of human excrement movies has run its course, and now we are on to dogs. Many screenwriting textbooks teach that any scene that does not drive the story or reveal character should be omitted. Just how a scene about people searching in the dark for dog droppings does either is beyond me. But then I wasn't brilliant enough to get a movie into theatrical release. This movie is a crushing bore. Actors on Valium spew an endless stream of the most mind-numbing dialog ever written, accompanied by an inscessant soundtrack of elevator music. Incompetent direction and camera work. Flat photography. Even the dogs are boring, and there are plenty of them. What's the deal with the smoke machine in the doggie psychiatrist's office? Did I miss a meeting? If they edited out all the dead air, this movie would be thirty minutes shorter. Then if they edited out all the boring parts, it would be its own trailer. Who's responsible for this?",
         "My wife and I are regular dog park visitors, and we rented this movie purely on the title. We hoped that Janeane Garofalo would be as good as she was in The Truth About Cats and Dogs. The Truth about Dog Park is that it ain't about dogs, it ain't about parks, it ain't funny, it ain't sexy, it ain't about Janeane Garofalo, and it ain't worth $1.99 on the discount rack.",
         "When watching this movie I kept wondering how anyone would ever have released it. The movie was unfocused and flat and left me wondering what better things I could have spent my money seeing. The only bright side was watching Janeane Garofalo who still manages to deliver her lines and make them funny. If you were expecting another \"Truth About Cats and Dogs\" you will be terribly disappointed."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Accent Entertainment Corporation",
         "Canadian Film or Video Production Tax Credit (CPTC)",
         "Harold Greenberg Fund, The"
      ],
      "summaries": ["Sex comedy takes a look at contemporary dating mores and hypothesizes that the new dating location may be the dog walk in the park. A mild-mannered man loses his present girl friend to another man. His attraction to a kid's TV show hostess goes nowhere because of her obsession with her dog, Peanut. He then gets hooked up with an overly exuberant blonde who overwhelms him. He even lost his collie, Mogley, when his girl friend moved out. In a funny sub-plot, the collie is going to a doggie psychiatrist who determines the dog is being traumatized by his mistress' sexual antics. Jeri and Jeff are best friends whose constant smooching simply makes the leads life less comfortable."],
      "budget": 0
   },
   "movielensId": 2884,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-14",
      "dvdReleaseDate": "2004-03-02",
      "directors": ["Bruce McCulloch"],
      "runtime": 91,
      "movieId": 2884,
      "title": "Dog Park",
      "mpaa": "R",
      "actors": [
         "Natasha Henstridge",
         "Luke Wilson",
         "Janeane Garofalo",
         "Bruce McCulloch",
         "Kristin Lehman",
         "Amie Carey",
         "Gordon Currie",
         "Harland Williams",
         "Mark McKinney",
         "Ron James",
         "Albert Schultz",
         "Jerry Schaefer",
         "Zachary Bennett",
         "Kathleen Robertson",
         "Peter MacNeill",
         "Boyd Banks"
      ],
      "imdbMovieId": "0129884",
      "originalTitle": "Dog Park",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["BfbRJ9X4AcA"],
      "plotSummary": "Sex comedy takes a look at contemporary dating mores and hypothesizes that the new dating location may be the dog walk in the park. A mild-mannered man loses his present girl friend to another man. His attraction to a kid's TV show hostess goes nowhere because of her obsession with her dog, Peanut. He then gets hooked up with an overly exuberant blonde who overwhelms him. He even lost his collie, Mogley, when his girl friend moved out. In a funny sub-plot, the collie is going to a doggie psychiatrist who determines the dog is being traumatized by his mistress' sexual antics. Jeri and Jeff are best friends whose constant smooching simply makes the leads life less comfortable.",
      "tmdbMovieId": 62994,
      "avgRating": 2.49841,
      "releaseYear": "1998",
      "numRatings": 315,
      "posterPath": "/fXq3pWtHrcfXFg6m7sLZoJRmBBq.jpg"
   }
}