{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0087980",
      "video": false,
      "title": "The Razor's Edge",
      "recommendations": [
         75946,
         44181,
         52741,
         32343,
         19604,
         89904,
         28073,
         18192,
         21840,
         42040,
         17926,
         30198,
         36584,
         61178,
         40208,
         16922,
         55066,
         35866,
         16375,
         70500
      ],
      "backdrop_path": "/rOFSF4bEEY5yBywQuIuiNSX4ylA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Larry Darrell",
               "gender": 2,
               "credit_id": "52fe4496c3a368484e02b6cb",
               "name": "Bill Murray",
               "profile_path": "/7BOoOAIA1CnSzFSVSJP7saniQaB.jpg",
               "id": 1532,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sophie MacDonald",
               "gender": 1,
               "credit_id": "52fe4496c3a368484e02b6cf",
               "name": "Theresa Russell",
               "profile_path": "/wsuvlVzWU5V96QG0Nh8902ZxvBk.jpg",
               "id": 9207,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Isabel Bradley",
               "gender": 1,
               "credit_id": "52fe4496c3a368484e02b6d3",
               "name": "Catherine Hicks",
               "profile_path": "/b1UONnn9lsxqsxJYXnp3DWpUwpm.jpg",
               "id": 2022,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Elliott Templeton",
               "gender": 2,
               "credit_id": "52fe4496c3a368484e02b6d7",
               "name": "Denholm Elliott",
               "profile_path": "/oR6GnGecov6Mjg0cLasCawyz3mF.jpg",
               "id": 656,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Gray Maturin",
               "gender": 2,
               "credit_id": "52fe4496c3a368484e02b6db",
               "name": "James Keach",
               "profile_path": "/5k6C8JLApbI52sjaYAHHnIdsrnv.jpg",
               "id": 408,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mackenzie",
               "gender": 2,
               "credit_id": "54f63c50c3a3683a57000bea",
               "name": "Peter Vaughan",
               "profile_path": "/z9ZplbTA1ojYhgZ8kJUKKhsJ7Gs.jpg",
               "id": 386,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Piedmont",
               "gender": 2,
               "credit_id": "54f63c679251412402000b71",
               "name": "Brian Doyle-Murray",
               "profile_path": "/fRLFXdb8UQvJs4euZ2sE6CpjbXn.jpg",
               "id": 1535,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Malcolm",
               "gender": 2,
               "credit_id": "54f63c7fc3a3683a57000bee",
               "name": "Stephen Davies",
               "profile_path": null,
               "id": 103592,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Raaz",
               "gender": 2,
               "credit_id": "54f63c90c3a3683a6e000c73",
               "name": "Saeed Jaffrey",
               "profile_path": "/nDSQCtZjVNqeOWG1QooKq2NkElb.jpg",
               "id": 11852,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Louisa Bradley",
               "gender": 1,
               "credit_id": "54f63ca8c3a3683a61000c3c",
               "name": "Faith Brook",
               "profile_path": "/vKejvmwvtmuROMoflpBGHxmAWi5.jpg",
               "id": 27281,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b6e1",
               "name": "John Byrum",
               "profile_path": "/r2NoRtAuBWFtM0RDi6MuhMJNn4l.jpg",
               "id": 32767,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b6e7",
               "name": "W. Somerset Maugham",
               "profile_path": "/mseHL0TUkLcRXds5Pwjmbec8hyt.jpg",
               "id": 27916,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b6ed",
               "name": "John Byrum",
               "profile_path": "/r2NoRtAuBWFtM0RDi6MuhMJNn4l.jpg",
               "id": 32767,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b6f3",
               "name": "Bill Murray",
               "profile_path": "/7BOoOAIA1CnSzFSVSJP7saniQaB.jpg",
               "id": 1532,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54f63cf0c3a3683a57000bf5",
               "name": "Harry Benn",
               "profile_path": null,
               "id": 23650,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54f63d1192514151c60006ab",
               "name": "Harry Benn",
               "profile_path": null,
               "id": 23650,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "54f63d30c3a3683a6e000c94",
               "name": "Jason Laskay",
               "profile_path": null,
               "id": 1392678,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "54f63d4fc3a3683a57000bf9",
               "name": "Robert P. Marcucci",
               "profile_path": null,
               "id": 1434774,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54f63d629251415019000715",
               "name": "Jack Nitzsche",
               "profile_path": null,
               "id": 7066,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "54f63d70c3a3683a73000c04",
               "name": "Peter Hannan",
               "profile_path": null,
               "id": 57699,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54f63d8492514151c60006c2",
               "name": "Peter Boyle",
               "profile_path": null,
               "id": 8307,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54f63da2925141240e000ae8",
               "name": "Philip Harrison",
               "profile_path": null,
               "id": 10936,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "54f63db69251412411000b2c",
               "name": "Malcolm Middleton",
               "profile_path": null,
               "id": 9024,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "54f63dfd9251415019000743",
               "name": "Stuart Rose",
               "profile_path": null,
               "id": 23773,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "54f63e0f9251412402000b8e",
               "name": "Ian Whittaker",
               "profile_path": null,
               "id": 5060,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54f63e24925141240e000b03",
               "name": "Shirley Russell",
               "profile_path": null,
               "id": 39815,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.229838,
      "production_countries": [],
      "id": 24453,
      "vote_count": 20,
      "budget": 0,
      "overview": "He had everything and wanted nothing. He learned that he had nothing and wanted everything. He saved the world and then it shattered. The path to enlightenment is as sharp and narrow as a razor's edge.",
      "similar": [],
      "original_title": "The Razor's Edge",
      "runtime": 129,
      "poster_path": "/ai6iFng036xuBGeDVSEOdhkKrZ2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1984-10-19",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "The story of one man's search for himself.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Byrum"],
      "runtime": 128,
      "synopsis": null,
      "writers": [
         "W. Somerset Maugham",
         "John Byrum"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0087980/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1MzM1MzA5M15BMl5BanBnXkFtZTcwODA4ODEyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Murray, Theresa Russell, Denholm Elliott | See full cast and crew »"],
      "reviews": [
         "The remarks of the detractor in this array of reviews is confusing and confused. Look. I read Maugham's book in the late 40s and saw the Tyrone Power, Gene Tierney, Clifton Webb film. So what? This film was neither one but that's beauty of art, dudes. It doesn't have to. The Razor's Edge is an odyssey of a man in search of himself. The transit nature of life and the brutality of war turn him into a \"superfluous\" man, who goes off on a quest to find himself. We can inundate this issue with metaphors until the cows come home, but that's Maugham's story. Old Somerset, a closet homosexual who was a volunteer in the horrorific WW1 went through a similar transformation and in a way, this novel, which he began back in the 20s, reflects that journey. Murray takes the character of Larry Darrell into a new domain. Why shouldn't he? He's not Tyrone Power. He's a comedian who plays a tragic role straight. There is much in this film that makes it superior to the 40s version. A stronger statement of the tragedy of the entanglement of the two women and a more intense presentation of the character of Larry. I saw this film when it first aired and recalled a young high school kid remarking to a friend upon exiting, \"Man, this is a totally awesome movie.\" I agree. Alas, the critics and comedy-addicted Murray fa ns didn't and it flopped. Pity. It is a totally awesome movie.",
         "If you are an intelligent viewer who is looking for a significant and possibly mind expanding movie event then `The Razor's Edge' is for you. It has remained one of my favorite films for fifteen years, and I have owned it and replayed it many times. If you look at the viewer feedback for this film you will find that the vast majority of people rate is as `Excellent' movie (29% of IMDB viewers give it a perfect `10/10' rating). Those who fail to see it's qualities can be divided fairly equally into the `don't get it' camp (Unlike the typical Hollywood lowest denominator flicks, the minimum IQ for viewing is Razor's Edge is probably at least 100, and that leaves ½ the population out), and the `disappointed' crowd, who have so typecast the star (Bill Murray) that they wanted `Caddyshack' and just can't allow him to be a serious actor. You must set aside your prejudices and give the man a chance-Bill Murray is a Harvard grad who co-wrote the screenplay-this was a labor of love for him. Just because he has a sense of humor does NOT make him a lightweight, as this film demonstrates for anyone with the eyes to see it. Based upon the 1942 W. Somerset Maugham novel, it follows the evolution of a spoiled upper class boy from Illinois (Larry, Bill Murray), who volunteers to be an ambulance driver in WW I for a little `fun and adventure' and instead gets a dose of PTSD (post traumatic stress disorder). His world was forever changed by the events he experienced. He literally could not go home again after the war. He tried, and found the lives of those around him to be shallow and meaningless, and their pursuits and interests just trivial. There had to be a reason why he was here, and this sets the stage for the real point of the movie, which is an exploration of the meaning of life. (I told you it wasn't Caddyshack!) Obsessed with these existential issues, and finding that alcohol did not make the need go away, Larry travels to Paris, and starts to read, serious books on philosophy and religion, supporting himself as a laborer. He does not care much for his surroundings-his lack of materialism is in marked contrast to his peers and friends from before, whose dreams are to grow wealthy in the stock market. As such Larry was an early Bohemian. I found this particularly poignant, realizing as I watched this movie that it foreshadowed yet another stock market boom and bust: a whole new generation of crass materialists have had their world was just as rocked by a stock market crash in 1999 as in 1929. History does repeat, and these themes are timeless. His fiancee could not deal with his `common' friends and lack of modern plumbing, and left him to marry someone she did not love but who had money. Another contrast to the shallow and materialistic, which is a recurring theme throughout the film-what brings happiness to a man? Larry's journey took him to India, and Hindu religion, and then on to Tibet to discover Buddha-the scenes filmed there are absolutely breathtaking, so I hope you can find a letterbox laserdisc or they finally bring this out on DVD-it is worth it to see the whole screen. There is romance, and love, and loss. I won't reveal the ending, which is truly bittersweet, and a bit nihilistic. This is truly the best thing this fine actor ever accomplished, and I rate it a strong `10'. This should have won many awards, and should also be considered a true classic; I am disappointed in my fellow man that they so typecast the star that they could not see what a great contribution he made with this effort here. Not light fare, and a long film, but one worth seeing.",
         "I was prepared to hate this movie, when I first rented it. It was a 'curiosity pick': I liked the title, I didn't have anything else in mind, and my thought was, of course, \"Bill Murray!?\" It turned out to be one of my all-time favorite movies in the 'character-transformation' genre. It's a compelling story of choices in life and how those choices affect or disaffect perceptions of that life. Murray is perfection in this role, because we seem him change from something we recognize to something quite different. It is a palpable and comprehensible transformation - the movie draws us in, it allows us to change with him. The rest of the characters are well cast and provide definitive counterpoint to the protagonist - the bon-vivant aristocratic uncle Elliot who simply lives his life appreciatively, the unthinking and manipulative Isabel concerned only with her own comforts and social standing, the uncertain Sophie that allows her uncertainty to trap and destroy her, the practical yet contemplative Raaz who challenges Darrell's notion of things, constructively, and leads him to further his quest. Good character development, all around. Finally, I was impressed with the faithfulness to the book. It's difficult for a movie to be that, and still be an watchable movie.",
         "I have to say that the first time I saw the movie, I was about five years old and saw it in a movie theatre. But as young as I was, it had a deep impression on me. I could not forget it, and by chance, received a copy of it as a gift my first year of college. It was so much better than I remembered...Although it is a bit different from Maugham's original book, I would (and have) highly recommended it to anyone. I realize I'm probably the only person in the world who thinks this movie is so absolutely incredible, but there is so much about it that stands out to me. Besides the bit of eastern philosophy that is thrown in, I am truly in love with the portrayal of the time period and the love triangle(square, rectangle) between Larry, Isabelle, Sophie, and Gray. I think I have seen this movie about 1000 times, and look forward to watching it 1000 more.",
         "that proves Bill Murray can really act and is not just a comedian. Unfortunately, it also didn't do well because his regular fans weren't ready for this transformation. If you like Bill Murray and aren't afraid of drama, check it out. It's very deep and will change your mind about Murray, even if it's already favorable.",
         "Bill Murray produced something he really wanted to do, and it shows! This is a wonderful, true-to-the-book film about how life is not the destination, it is the journey! Wonderful cinematography, great story by Somerset Maugham, and brilliant acting all around. Look for the scene of \"Sophie\" in the hospital trying to explain what her loss is like. This is one of the best scenes in all of cinema.",
         "This is one of my favorite films of all-time. Bill Murray is excellent as the lead in a dramatic movie, much to my surprise. I think his performance in this film is every bit as good as his work in \"Lost in Translation.\" Murray is far more flexible as an actor than he usually demonstrates or is given credit for. He is more than just a comedian. The failure of this movie at the box office rests squarely on the shoulders of Paramount. They gave this movie so little support or advertising money that it was almost doomed to fail. To be honest, if the internet and IMDb had existed back then, the coast to coast word of mouth that could have been generated might have made this movie a winner at the box office. There is a story about this movie that I once heard. Murrary had read the book and the script by Byrum, who also directed. Murrary approached the studio and told them he wanted to make this movie. The story goes that they respond with, \"Sure, Bill, we'll make The Razor's Edge for you if you will make this little movie called Ghostbusters for us.\" He agreed and Paramount technically stuck to the deal, but they put no money into its promotion and it dead an untimely death. This is one of the great films of all-time and it is just a shame that more people have not seen it.",
         "I saw this movie when it was released in 1984. Being a big Bill Murray fan drew me to it and the story did the rest. It was my first year in college and I dreamed of running away with nothing but some books and a canvas bag. I dreamed vicariously through this movie for awhile. Who hasn't wanted to travel the world anonymously? It is the essence of life, the secret to life, that is held in the dream that Mr. Murray must have had at some point in his lifetime that drove him to make this movie. For all you naysayers out there: Movies don't have to be perfect. Some can be appreciated for the trash quality (Wild Things), some for crassness (Something About Mary), and others for a single scene (Saving Private Ryan). This movie is for dreamers who don't give a fck what everyone else is doing.",
         "This adaptation of Somerset Maugham's novel is wonderful in so many ways. The dialogue is well written, the actors and actresses involved are excellent and believable in their roles, and the screenplay is spiritually faithful to the novel. Theresa Russel is a gem in this movie, as the troubled Sophie, but it is Bill Murray's portrayal of Larry that truly stands out here ... mainly because, as far as I know, this is his only non-comedic role. One of the best movies I've seen!",
         "Those who don't get it are perhaps the most enlightened of us all: that is exactly what this amazing movie was all about. In the end Larry's search was fruitless. No book, no bottle, no friend could provide the answer because it did not exist. Life, meaning, purpose, all of these things were succinctly, artfully and convincingly tossed aside as incidental, even distracting to the true meaning of life, which is nothingness. Hopefully that's not too disarming, because the film is simply one of the best ever made (top ten? certainly.). It was an almost incalculable improvement over the 1946 version, which was truly awful. Murray did not preach, he showed by example, whereas the early version was like a post-WWII government instructional film on how to attain karma. Murray's performance was so subtle as even to be missed all together (in my opinion the best acting of all), whereas Power was begging you to see the light. Please, don't miss this film, and if you don't \"get it\" first time around, empty your mind of distracting clutter and see it again. See it fifty times if you have to. When the message finally does come through, you'll know it was worth it."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Colgems Productions Ltd.",
         "Marcucci-Cohen-Benn Production"
      ],
      "summaries": [
         "Larry Darrell returns from the battlefields of World War I to America a different person. His fiance (Isabel) resigns herself to a delay in the wedding plans when Larry heads off to Paris. There he finds he prefers a simpler existence and begins to read. One book inspires him to visit India and on to Nepal where he finds spiritual help from a lama. On returning to Paris he finds Isabel and some old friends. Everyone has changed.",
         "Second filming of W. Somerset Maughan's classic novel about a World War 1 veteran (played by Bill Murray) who travels the world from Tibet to Paris in an attempt to find some meaning in his life.",
         "He had everything and wanted nothing. He learned that he had nothing and wanted everything. He saved the world and then it shattered. The path to enlightenment is as sharp and narrow as a razor's edge."
      ],
      "budget": 13000000
   },
   "movielensId": 2928,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-10-19",
      "dvdReleaseDate": "2002-08-20",
      "directors": ["John Byrum"],
      "runtime": 129,
      "movieId": 2928,
      "title": "The Razor's Edge",
      "mpaa": "PG-13",
      "actors": [
         "Bill Murray",
         "Theresa Russell",
         "Catherine Hicks",
         "Denholm Elliott",
         "James Keach",
         "Peter Vaughan",
         "Brian Doyle-Murray",
         "Stephen Davies",
         "Saeed Jaffrey",
         "Faith Brook"
      ],
      "imdbMovieId": "0087980",
      "originalTitle": "The Razor's Edge",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["kp3khtzYgAc"],
      "plotSummary": "He had everything and wanted nothing. He learned that he had nothing and wanted everything. He saved the world and then it shattered. The path to enlightenment is as sharp and narrow as a razor's edge.",
      "tmdbMovieId": 24453,
      "avgRating": 3.32554,
      "releaseYear": "1984",
      "numRatings": 556,
      "posterPath": "/ai6iFng036xuBGeDVSEOdhkKrZ2.jpg"
   }
}