{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "insane asylum",
            "id": 4924
         },
         {
            "name": "insanity",
            "id": 6255
         },
         {
            "name": "psychiatric hospital",
            "id": 10323
         },
         {
            "name": "psychological thriller",
            "id": 12565
         },
         {
            "name": "psychiatry",
            "id": 159313
         },
         {
            "name": "telekenesis",
            "id": 197365
         }
      ],
      "imdb_id": "tt0091214",
      "video": false,
      "title": "Man Facing Southeast",
      "recommendations": [
         69912,
         104294,
         85926,
         142143,
         162755,
         146362,
         88186,
         117982,
         142196,
         148118,
         147975,
         147312,
         148209,
         129979,
         191398,
         144490,
         174097,
         195804,
         42481,
         189576
      ],
      "backdrop_path": "/2sGZP7Pt9u7Pi2oBC7EDtvVgAlA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dr. Julio Denis",
               "gender": 2,
               "credit_id": "52fe4775c3a36847f8136cdd",
               "name": "Lorenzo Quinteros",
               "profile_path": "/qDHvJM2vM2CskLfwGORhRMvmYN8.jpg",
               "id": 105740,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Rantes",
               "gender": 2,
               "credit_id": "52fe4775c3a36847f8136ce1",
               "name": "Hugo Soto",
               "profile_path": null,
               "id": 1102442,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Beatriz Dick",
               "gender": 1,
               "credit_id": "52fe4775c3a36847f8136ce5",
               "name": "Inés Vernengo",
               "profile_path": null,
               "id": 573528,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "57ab1ae2c3a3682787000e30",
               "name": "Cristina Scaramuzza",
               "profile_path": null,
               "id": 1664253,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "57ab1ae99251414a160001b3",
               "name": "Tomas Voth",
               "profile_path": null,
               "id": 15572,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "57ab1af0c3a368519c0001e9",
               "name": "David Edery",
               "profile_path": null,
               "id": 1664254,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Doctor Prieto",
               "gender": 0,
               "credit_id": "57ab1afb92514110e40015da",
               "name": "Rúbens Correa",
               "profile_path": null,
               "id": 1664255,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "57ab1b05925141125e0017db",
               "name": "Tito Haas",
               "profile_path": null,
               "id": 1534476,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "57ab1b0e9251412a38000d28",
               "name": "Andrés Tiengo",
               "profile_path": null,
               "id": 1664256,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53dbd22f0e0a26481f000321",
               "name": "Eliseo Subiela",
               "profile_path": "/VnJ7QQwEjNrLXC1rJBKXaZwxx8.jpg",
               "id": 81116,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53dbd2380e0a264822000330",
               "name": "Eliseo Subiela",
               "profile_path": "/VnJ7QQwEjNrLXC1rJBKXaZwxx8.jpg",
               "id": 81116,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57ab1b26c3a3687884001a79",
               "name": "Pedro Aznar",
               "profile_path": null,
               "id": 1126231,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "57ab1b3192514149e40001eb",
               "name": "Ricardo DeAngelis",
               "profile_path": null,
               "id": 967715,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "57ab1b3bc3a368519c000217",
               "name": "Luis César D'Angiolillo",
               "profile_path": null,
               "id": 1427374,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.589841,
      "production_countries": [{
         "iso_3166_1": "AR",
         "name": "Argentina"
      }],
      "id": 48797,
      "vote_count": 16,
      "budget": 0,
      "overview": "A new patient mysteriously appears in a psychiatric ward. He claims to come from another planet to study humans and their behavior. The alien is gentle but criticizes humans for their harsh treatment of each other. The assigned psychiatrist is himself unhappy, and affected by the patient's insight. But he is ordered to treat the patient according to institutional procedure.",
      "similar": [
         64568,
         103620,
         50698,
         13548,
         134366,
         3526,
         3117,
         2891,
         39893,
         39263,
         96648,
         28264,
         363889,
         42735,
         496005,
         39925,
         40210,
         94123,
         263393,
         38446
      ],
      "original_title": "Hombre mirando al sudeste",
      "runtime": 103,
      "poster_path": "/xb8voDxmQnMHVKdNNGtxZFZ9dGx.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Transeuropa S.A. Cinematografica",
            "id": 80256,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinequanon",
            "id": 16918,
            "origin_country": ""
         }
      ],
      "release_date": "1986-09-09",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "Somewhere Between The Insane And The Unreal Lies The Mystery Of The Man Facing Southeast.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eliseo Subiela"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Eliseo Subiela"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0091214/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxNDYzODUxNF5BMl5BanBnXkFtZTcwNzU1NDM0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Lorenzo Quinteros, Hugo Soto, Inés Vernengo | See full cast and crew »"],
      "reviews": [
         "I don't normally bother to write comments like this but I was shocked by the other reviewer's perspective. I think perhaps he likes things spoonfed to him. Regardless, this is a fairly obscure film. It's Argentinian. It's a so-called \"art movie\". It doesn't feature any well known actors. The plot and many of the scenes were reproduced in the recent Hollywood version. Several other scenes have been lifted wholesale and used in other Hollywood movies. That alone suggests that the movie has merit (particularly in terms of story and direction). Over and above that, the acting is very good, and the pace, while slow, builds inexorably. There is no succinct resolution to the plot. That is the point. You have to think for yourself and it is a deeply thought provoking story. I think the central theme is a meditation on thought defining reality and seems to reference the Buddhist belief that our lives are a creation of our minds. But like any good work of art there are many layers open to interpretation. There are no overt references but this being an Argentinian affair, the tone of the movie reminded me of Jorge Luis Borges and Adolfo Bioy Casares. It's philosophical, and quite surreal in places. Some of the scenes are straight out of a Goya painting, and some of the camera motions are so graceful- almost imperceptible sometimes- that I thought of Kubrick. There's an awful lot going for this film. I don't want to ruin the story for anyone but I do rate it very highly.",
         "For those of you who have seen K-Pax, please watch this one. In 1986 Eliseo Subiela made this intriguing, intelligent film dealing with the human condition and its contradictions. It has long been known to spanish-speaking audiences, so it's a shame to see a pale copy like K-Pax being lauded (or at least being credited with the idea).",
         "An outspoken, gifted stranger suddenly \"appears\" at an insane asylum, claiming to be from another planet. Each day he stands in the open yard facing southeast to receive telepathic messages from his home. His presence has a profound effect upon the psychologist who is treating him for his delusions. But is the patient REALLY delusional? Or could his extraordinary story be quite possibly true? That is the crux of \"Man Facing Southeast\", a remarkable apologue from Argentina concerning sanity and madness, Heaven and Hell, faith and incredulity, presented with unmitigating perspicacity and intelligence. The film never talks down to its audience, and its message is delivered with a clarity that is both subtle and stunning. Warm, touching, and inspirational, it is firmly entrenched in my personal Top Five \"Favorite Films of All Time\" list. Apparently first-time viewers should be certain to rent or purchase the sub-titled version and NOT the English-dubbed version.",
         "I think that the question, \"Is he really from outer space?\" is irrelevent to the movie--what matters is that the man, Renates, is completely foreign. It's not a feel-good movie, it's a thought-provoking movie, one that brings up the question, why is compassion so foriegn to us, and why do we fear the compassionate? Those with power (the doctors) are so afraid to lose that power that they force their subjects into a forgetful stupor and deny their humanity--just as the military under Videla and the junta tortured over 30,000 people only two decades ago. This film is a brilliant commentary on human nature and modern Argentine history.",
         "Today nearly everyone is familiar with holograms; three-dimensional images projected into space with the aid of a laser. As a result of their research with subatomic particles, some scientists now believe that the universe itself is a holographic projection and that all things are infinitely interconnected at a deeper level of reality. Rantes (Hugh Soto), an \"extra\" patient who just shows up at a mental hospital in Buenos Aires, would probably agree. In Eliseo Subiela's science fiction thriller, Man Facing Southeast, Rantes tells Psychiatrist Julio Denis (Lorenzo Quinteros) that he is a projection who has been sent from another planet to study humanity and help the suffering. He claims that man is \"in the prehistory of holographic projection\" and that \"his notions are delusionary\". Rantes spends many hours simply standing in the courtyard-facing southeast, ostensibly transmitting and receiving messages from his home planet. He seems to have all the normal attributes of a human being but tells Dr. Denis that he does not have any human feelings. Though Denis concludes that Rantes is insane and treats him with drugs and \"counseling\", he becomes increasingly fascinated with this strange individual who appears to possess extraordinary abilities. During their talks, Rantes articulates his thoughts about the human condition with amazing insight, telling the doctor that the patients are the sane ones since they do not subscribe to the blatant stupidity of so-called normal people. He tells Denis, \"Your reality is terrifying, Doctor.\" Possessing a charisma that attracts other patients to him, the skeptical Dennis compares Rantes to a Christ figure and remarks that he himself has become the Pontius Pilate in this story. The situation gets more involved when Denis falls in love with Beatrice Dick (Ines Vernengo), an attractive woman who visits Rantes in the hospital, claiming that she met him at her church. Their deepening relationship culminates in a concert in the park where Rantes, suddenly infected by human feelings, takes over the orchestra and conducts Beethoven's Ode to Joy as the audience and hospital patients' break into a Dionysian dance. When the episode is reported in the newspaper, the doctor is called to task by his superior and told to increase Rantes' medication. Denis, becoming increasingly isolated and depressed, agrees but begins to question the entire psychiatric establishment. Man Facing Southeast is a thought provoking and entertaining film that examines the values society uses to judge those that are different. Though Rantes claims he is unfeeling, the contrast between his level of awareness and the closed-minded psychiatrists can perhaps stand as a metaphor for the leaders in today's society and those that are being led. Is Rantes a madman, a robot, a Christ-figure, an extra-terrestrial? Are the greatest virtues of mankind: love, compassion, and justice rational or irrational? This haunting Argentine film allows the viewer to provide the answers.",
         "Man Facing Southeast is a very good, deep, thought-provoking film. Beautiful, stark visuals, music, and good acting all work to create a very intense and utterly mesmerizing atmosphere. But don't bother renting it - as far as I know only the dubbed version is available on video. With dialogue that takes itself this seriously, it takes extreme skill to keep it from being merely pretentious and ridiculous - a skill which the dubbers completely lacked. Thus a great, serious film is turned into one of those completely unwatchable abominations where you don't know if you should laugh or cry.",
         "I loved this film. Not just because I'm an (ex-)Argentine but because it just works. It is delightful, thought-provoking and bittersweet. The same themes we loved in One Flew Over The Cuckoo's Nest, the destruction of innocence, the quashing of independence/individuality and the gray, foggy area of mental illness-- are all present in this fine film. Alas, most American viewers will not be familiar with the fine cast but no matter. This is a film that should be watched and enjoyed. You don't have to stick into a Hollywood pigeonhole to appreciate the fine artwork. It will leave you with that same wistful feeling that have done so many other films touching on the institutionalizing of mental patients-- with the possible exception of Harvey.",
         "Those who complain about this movie being \"depressing\" and full of unanswered questions miss the point. An intelligent viewer must look beneath the surface; there's a clever story and a set of plot twists that await whomever is willing to make the minimum effort required to do that. The movie keeps the viewer's interest by using a series of cinematic devices and by raising questions. The important ones get answered all right, while some unimportant ones are left open. Subiela himself admitted later that there is no real reason for Beatriz's changes of shoes, or for the blue liquid coming out of her mouth. But the central theme remains that of a man that approaches sainthood (note the numerous parallels with the story of Christ) by just doing what is logical---not out of any belief from a contrived moral system.",
         "Yes it does. My first thought was that if they meant to picture a financially struggling institution, they did a perfect job: it looked so real with its dirty, cracked walls, plain furniture and doors in dire need of painting that it brought up my childhood memories about the hospital I've been in in the eighties. I watched this movie in Spanish with no subtitles, so I don't know the dialogues, but they must be well good if they are half as good as the nonverbal parts, and there were so many great scenes with no words. My favourite one is when Rantes slides the plates in front of that poor hungry family (and you could see the mother really put her children first, they all looked better then herself), and his eye-communication was the icing on the cake. Or when he walked past the security guard when he slipped out of the institute at night \u0096 he timed it so perfectly that he could be confident enough not even to need to rush much, and I liked the music in the scene as well. I was very impressed with the acting throughout \u0096 of course Julio was bored and Rantes was unemotional for a reason. All the more uplifting the moment of Rantes and Beatriz starting to dance to the Ode of Joy was (and another music I like). The boarding of the patients was outrageous \u0096 I can only hope it wasn't based on reality. Judging from their appearance, patients of various severity of disorders seemed to be dumped together, possibly having a bad effect on one another, their clothing was insufficient, they were fed from dogs' bowls, instead of the staff it was Rantes who noticed when they were cold, needed attention or more to eat, and he was all right exactly to the point until his treatment started. The procedure of turning this bright, well-meaning person into a mental and physical wreck was very well pictured and heartbreaking to watch. One consolation for the similarities between the K-PAX movie (which, unfortunately, had parts added or altered from the book it was based on to make it similar to MFS, but its atmosphere is still different enough \u0096 especially regarding the state of the hospital and the way patients were treated \u0096 that it is worth watching) and this one is that it's good advertising for it. I only heard about, bought and watched MFS because it was mentioned in the K-PAX reviews, which is a real shame because it's better than the K-PAX movie (I gave it six stars in my review), and as good as the novel. The scenes with the coffin and the brain are much slagged off as unnecessary but I think they couldn't have been better calculated. Handling of the bodies and the brain only turns rough after we learn Rantes is to get \"medication\", and so the scenes give us an idea how he would end up \u0096 just after he washes the brain down the drain come the injections and wash all the thoughts out of his brain. But I think the disfigured faces suddenly popping up much earlier, after the scene of Rantes and Julio talking outside walking down stairs were completely unnecessary. The only part I hated \u0096 minus 1 star for including this regurgitated, cheap crappy horror-movie scare tactic trick in this great movie.",
         "This is the movie that brought recognition for the first time to Eliseo Subiela. Many times described as \"ET\" for adults, that cliche is both accurate and misleading. As I write this, a movie with an identical premise is being advertised in the States (K-PAX). I hope lawyers have a field day. The mysterious patient Ramses, who has suddenly appeared in this Argentinian clinic, is convinced to have come from another world. Capable of rational thought and of an apparent high IQ, a doctor begins a treatment to cure him from his dellusion. But does he need to be cured? Isn't the doctor more insane that his patient? Haven't we forgotten what it means to live and enjoy life? The movie moves slowly, but keeps itself interesting. The dialogue is sometimes too academical to be believable (even in Spanish), but its intentions are more powerful than the presentation. Except for Beethoven's Ode to Joy sequence, the movie is not very cinematic, but once again, it never feels to drag. The depiction of the asylum is also one of those you won't see in your typical Hollywood movie: as we see how the dead corpses of the inmates are carried over to be used for medical studies."
      ],
      "genres": [
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Cinequanon",
         "Transeuropa S.A. Cinematografica"
      ],
      "summaries": [
         "A new patient mysteriously appears in a psychiatric ward. He claims to come from another planet to study humans and their behavior. The alien is gentle but criticizes humans for their harsh treatment of each other. The assigned psychiatrist is himself unhappy, and affected by the patient's insight. But he is ordered to treat the patient according to institutional procedure.",
         "A patient in a mental hospital claims to be an extraterrestial. Could he be right?"
      ],
      "budget": 0
   },
   "movielensId": 2938,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1986-09-09",
      "dvdReleaseDate": null,
      "directors": ["Eliseo Subiela"],
      "runtime": 103,
      "movieId": 2938,
      "title": "Man Facing Southeast",
      "mpaa": null,
      "actors": [
         "Lorenzo Quinteros",
         "Hugo Soto",
         "Inés Vernengo",
         "Cristina Scaramuzza",
         "Tomas Voth",
         "David Edery",
         "Rúbens Correa",
         "Tito Haas",
         "Andrés Tiengo"
      ],
      "imdbMovieId": "0091214",
      "originalTitle": "Hombre mirando al sudeste",
      "genres": [
         "Mystery",
         "Science Fiction",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A new patient mysteriously appears in a psychiatric ward. He claims to come from another planet to study humans and their behavior. The alien is gentle but criticizes humans for their harsh treatment of each other. The assigned psychiatrist is himself unhappy, and affected by the patient's insight. But he is ordered to treat the patient according to institutional procedure.",
      "tmdbMovieId": 48797,
      "avgRating": 3.89555,
      "releaseYear": "1986",
      "numRatings": 292,
      "posterPath": "/xb8voDxmQnMHVKdNNGtxZFZ9dGx.jpg"
   }
}