{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fishing",
            "id": 1495
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "duringcreditsstinger",
            "id": 179431
         },
         {
            "name": "old men",
            "id": 208510
         }
      ],
      "imdb_id": "tt0113228",
      "video": false,
      "title": "Grumpier Old Men",
      "recommendations": [
         11520,
         10859,
         11821,
         10765,
         11418,
         9099,
         9409,
         13203,
         14742,
         9304,
         26044,
         12518,
         11310,
         18080,
         2620,
         10631,
         13997,
         6472,
         11584,
         26255
      ],
      "backdrop_path": "/1ENbkuIYK2taNGGKNMs2hw6SaJb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Max Goldman",
               "gender": 2,
               "credit_id": "52fe466a9251416c75077a8d",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John Gustafson",
               "gender": 2,
               "credit_id": "52fe466a9251416c75077a91",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ariel Gustafson",
               "gender": 1,
               "credit_id": "52fe466a9251416c75077a95",
               "name": "Ann-Margret",
               "profile_path": "/jx5lTaJ5VXZHYB52gaOTAZ9STZk.jpg",
               "id": 13567,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Maria Sophia Coletta Ragetti",
               "gender": 1,
               "credit_id": "52fe466a9251416c75077a99",
               "name": "Sophia Loren",
               "profile_path": "/emKLhbji1c7BjcA2DdbWf0EP9zH.jpg",
               "id": 16757,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Melanie Gustafson",
               "gender": 1,
               "credit_id": "52fe466a9251416c75077a9d",
               "name": "Daryl Hannah",
               "profile_path": "/4LLmp6AQdlj6ueGCRbVRSGvvFSt.jpg",
               "id": 589,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Grandpa Gustafson",
               "gender": 2,
               "credit_id": "53e5fcc2c3a3684430000d65",
               "name": "Burgess Meredith",
               "profile_path": "/lm98oKloU33Q7QDIIMSyc4Pr2jA.jpg",
               "id": 16523,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jacob Goldman",
               "gender": 2,
               "credit_id": "53e5fcd4c3a3684433000e1a",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe466a9251416c75077a89",
               "name": "Howard Deutch",
               "profile_path": "/68Vae1HkU1NxQZ6KEmuxIpno7c9.jpg",
               "id": 26502,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe466b9251416c75077aa3",
               "name": "Mark Steven Johnson",
               "profile_path": "/6trChNn3o2bi4i2ipgMEAytwmZp.jpg",
               "id": 16837,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe466b9251416c75077aa9",
               "name": "Mark Steven Johnson",
               "profile_path": "/6trChNn3o2bi4i2ipgMEAytwmZp.jpg",
               "id": 16837,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5675eb4b92514179dd003933",
               "name": "Jack Keller",
               "profile_path": null,
               "id": 1551320,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.611574,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15602,
      "vote_count": 112,
      "budget": 0,
      "overview": "A family wedding reignites the ancient feud between next-door neighbors and fishing buddies John and Max. Meanwhile, a sultry Italian divorcée opens a restaurant at the local bait shop, alarming the locals who worry she'll scare the fish away. But she's less interested in seafood than she is in cooking up a hot time with Max.",
      "similar": [
         40807,
         888,
         376660,
         1267,
         80038,
         62211,
         290762,
         61979,
         863,
         585,
         594,
         38365,
         109414,
         77338,
         82693,
         41630,
         49013,
         10358,
         858,
         862
      ],
      "original_title": "Grumpier Old Men",
      "runtime": 101,
      "poster_path": "/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lancaster Gate",
            "id": 19464,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-12-22",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": "/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg",
         "name": "Grumpy Old Men Collection",
         "id": 119050,
         "poster_path": "/nLvUdqgPgm3F85NMCii9gVFUcet.jpg"
      },
      "tagline": "Still Yelling. Still Fighting. Still Ready for Love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Howard Deutch"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Mark Steven Johnson",
         "Mark Steven Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113228/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1MTk4MDQ4OF5BMl5BanBnXkFtZTYwNDYyMzg4._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Walter Matthau, Jack Lemmon, Ann-Margret | See full cast and crew »"],
      "reviews": [
         "Some people see this as an inferior sequel to the first movie \"Grumpy Old Men\". I don't agree, i love the first one but i think this one is every bit as good and in some ways..even better than the original. Walter Matthau and Jack Lemmon are my favorite comedy team. The Fortune Cookie is a classic and i also love \"Buddy Buddy\" and \"The Odd Couple Parts 1 and 2 but the Grumpies hold a special place in my heart. I was personally hoping for another Grumpy movie but sadly we've lost both of these wonderful stars so that will never happen. At least we will always have these fine films to enjoy and treasure. I have them on Dvd and watch them regularly..they never fail to touch my heart and make me smile.",
         "Sequels are rarely half as good as the original film. Matthau and Lennon would prove this at the tale end of their film partnership with THE ODD COUPLE PART II. But it has happened. ANOTHER THIN MAN is as good a film as THE THIN MAN. Vincent Minelli's follow up to FATHER OF THE BRIDE may lack the satire of weddings the original had, but FATHER'S LITTLE DIVIDEND is well made and entertaining in it's own right. And then there is this film. Of the first movie, GRUMPY OLD MEN, I have made a comment elsewhere. GRUMPIER OLD MEN is a neat follow-up, as we find how Max Goldman (Matthau) finds his new mate, Maria Ragetti (Sophia Loren). It also settles the future of Max's son Mayor Jacob Goldman (Kevin Pollak) and John Gustafson's (Lemmon's) daughter Melanie (Darryl Hannah), and gives a bitter-sweet farewell to John's father (Burgess Meredith). I think the reason the sequel works is that there is a sense of time and continuity here that is not usually found. In GRUMPY OLD MEN, the reactions of Lemmon and Matthau to the death of their close friend Chuck (Ossie Davis), who had only recently been their rival for Ariel (Ann-Margaret) showed them to be human beings - not just two good comic actors trading insults for yucks. Here, it is watching the final scenes of Grandpa Gustafson (ironically Burgess Meredith's final role - and a fittingly good one for that fine actor). In the first film Meredith was always acting like a wild authority figure: over ninety years old, but threatening to tan the hides of the middle aged Matthau and Lennon like they were still kids when he stops them fighting. Here we see him in several guises. He is a loving grandpa - he is seen telling Allie (Katie Sagona) the story of Goldilock and the Three Bears (with his own modern interpolations), and then singing \"Dream a Little Dream of Me\" to put her to sleep. He is vulgar, but in a loving, sensible way. When Allie swallows a quarter, he suggests that it is normal - all kids swallow or try to swallow coins - and one only should worry if the kid excretes two dimes and nickel. He loves sexual encounters (in the first film he suggests that if Lemmon and Matthau can't get Arial he can!). Here he meets somebody to romance (Anne Gilbert), and they have a nice time together. But it is a brief one. Having reached 95, God finally comes for Grandpa, and his death manages to bring the other characters from cross purpose quarrels to sanity. It also brings the sweet image of Gilbert depositing a rose over the spot that Grandpa's ashes are scattered. The continuity theme is also in the portion about \"Catfish Hunter\" the local lake legendary catfish. Grandpa tells John, at one point, that the catfish was old when he was a boy (which begs the question, why did they name the catfish after a major Yankee baseball player of the 1970 teams? - long after Grandpa's youth). The locals all hope to catch the fish and mount it on their walls. We see it at one point jumping late at night, alone, into the air and back into the late in the glorious moonlight - the monarch of the lake. But at the end, when the catfish is caught by Matthau and Lemmon together, Lemmon (probably influenced by Ann-Margaret, who did the same thing in the first film) gets Matthau to agree to return the catfish to the lake, where it can join Grandpa's ashes. So the legend is returned to it's base. Even in the final moments of the film, with another marriage and a joke reminiscent of the first film's conclusion, suggests continuity. So there is a type of structural vigor in the two films, that strengthens their stories and increases the viewers pleasure watching them. Yes indeed, this is one sequel that works very well.",
         "\"Grumpier Old Men\" is the equally funny sequel to \"Grumpy Old Men\". Jack Lemmon and Walter Matthau return as John and Max, the longtime neighbors who in this movie have reconciled their friendship. Ann-Margret is back as Ariel, John's new wife. So is Burgess Meredith as Lemmon's horny dad, and also returning are Daryl Hannah and Kevin Pollak as Lemmon's daughter and Matthau's son who are now engaged to each other and their fathers help them out to plan their wedding with some bizarre ideas. But the real scene stealer in \"Grumpier Old Men\" is the wonderful Sophia Loren as the new Italian woman in Wabasha, Minnesota. Loren plans to turn the grumpy old men's beloved bait shop into a 'ristorante' as she puts it. The grumps don't like that one bit and try to drive her out of town, but ends up falling for Matthau. It's great to see Loren get an opportunity to do comedy, and she gets her share of big laughs throughout the film. This film and it's predecessor once again will remind you of what a great team Lemmon and Matthau made. ***1/2 (out of four)",
         "Nothing's different in this lovely follow up to the sleeper hit original. Lemmon and Matthau still jab at each other while Sophia Loren practically steals the film with her still astonishing beauty. Things only get better with age.",
         "This movie is downright hilarious with tons of good one-liners. Walter Matthau and Jack Lemmon (may they both rest in peace) are two of the funniest actors in history. No one else could have played Max & John. Sophia Loren is still one of the most beautiful women in movie history! One of the funniest scenes is when she says \"Holy moly\" after being kissed by Max. Watch this movie. You will enjoy it, if you have a sense of humor!",
         "This movie just happens to be yet another installment of an endearingly hilarious story. The chemistry between Messrs Matthau and Lemmon has been obvious since their earlier days in \"The Odd Couple\" and seems to have gotten even better as the years ensued. The acting is superb, the direction impeccable, the entire cast is phenomenal and with the addition of \"Maria\" and her mom it simply completes the entire storyline to make for one whale of a good time. The innate beauty of both Ms. Margret and Ms. Loren is timeless. Burgess Meredith's role has been stepped-up from his previous one, as the cynical, openly opinionated, Lothario wannabe, lol, a resounding achievement for a gentleman of his longevity, yet he pulls it off famously. There is some really hilarious banter between him and Maria's mother \"Mama Ragetti\", I laughed out loud. I must confess, I laughed out loud at so many of the scenes in this film, I can't even begin count them. There is a real synergy to this movie, a compilation of comedic moments. I can't imagine how anyone wouldn't enjoy this movie. I'm \"hooked\"...",
         "While \"Grumpy\" was enjoyable, I think \"Grumpier\" is the better overall movie. More attention is given to the supporting characters, the plot is slightly more complex, the lines are better, the jokes are better, and Lemmon and Matthau once again give excellent performances. Granted, this still isn't as good as it could be, but I think it's a noticeable step up from the original. I really don't get all the negativity toward it... come on, people, it's just a silly comedy. Lighten up. Speaking of negativity, another reviewer, whom I won't name here (oh all right, it's John Ulmer), seems to think this movie is nothing more than a \"shouting match,\" and is concerned about the age difference between the Old Men and their lady friends. I disagree on both points. The dialogue doesn't have as much shouting this time around, and Matthau's girl is most certainly NOT \"fortysomething.\" Believe it or not, she was 61 at the time, and I must say it's quite amazing how good she looks for a woman her age (Matthau was 75--a pretty big age difference, true, but I can't imagine there's a lot of men to choose from when you're single and in your 60s!). I hate to chastise another reviewer like this, but I thought it was worth mentioning. So in conclusion... it's a good movie. Doesn't deserve its bad rap. 7/10 stars.",
         "Grumpier Old Men is one of the cutest movies I have ever seen. It is a fitting follow - up to Grumpy Old Men. Matthau and Lemmon shine in this great film. My favorite performance in this film would have to go to the wonderful actress Sophia Loren who plays a feisty newcomer in town. Burgess Meredith is marvelous in his role, and he had me rolling! This film is excellent, and I am proud to own it. I suggest that anyone looking for a lots of laughs, and a cute romance story see this movie.",
         "As a 50++ female who married again only 2 years ago, the romance between senior cits hit home with me. It IS possible for us older folks to find companionship, friendship, and fantastic SEX. This movie was absolutely hilarious! I know what it is like to have a child (college age) driving me insane, plus family pets underfoot, while also falling head over heels in love. I also know the pain of a parent dying with me right there. Jack Lemmon and Walter Mattau hit it all right on the mark. Grief, laughter, and love. It is hard to beat this combination. This movie made me laugh harder than I have in years, and that at 7 AM!!! Enjoy it folks!!!",
         "For the most part, \"Grumpier Old Men\" is pretty silly. Max Goldman (Walter Matthau) and John Gustafson (Jack Lemmon) are still at each other's throats when Italian immigrant Maria Ragetti (Sophia Loren) arrives in town and throws everything into flux. What actually struck me most about the movie was how different the town looked in this one from the original. Obviously, it was a different time of year, but maybe the different look was meant to show how everything might be changing in the town. Other than that, Ann-Margret returns as Ariel, and she's still as free-spirited and vivacious as she was in the original. Burgess Meredith - in his final role - is still the grandfather who can exercise absolute authority over the youngsters, although he now has the hots for Maria's mother (Ann Morgan Guilbert, aka Millie on \"The Dick Van Dyke Show\"). Kevin Pollak and Daryl Hannah also reprise their roles from the original...ah, and there's that fish. All in all, a fairly interesting movie. Not any kind of masterpiece, but it showed that Lemmon and Matthau still had it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Lancaster Gate",
         "Warner Bros."
      ],
      "summaries": [
         "Things don't seem to change much in Wabasha County: Max and John are still fighting after 35 years, Grandpa still drinks, smokes, and chases women , and nobody's been able to catch the fabled \"Catfish Hunter\", a gigantic catfish that actually smiles at fishermen who try to snare it. Six months ago John married the new girl in town (Ariel), and people begin to suspect that Max might be missing something similar in his life. The only joy Max claims is left in his life is fishing, but that might change with the new owner of the bait shop.",
         "John and Max resolve to save their beloved bait shop from turning into an Italian restaurant, just as its new female owner catches Max's attention."
      ],
      "budget": 25000000
   },
   "movielensId": 3,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-22",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["Howard Deutch"],
      "runtime": 101,
      "movieId": 3,
      "title": "Grumpier Old Men",
      "mpaa": "PG-13",
      "actors": [
         "Walter Matthau",
         "Jack Lemmon",
         "Ann-Margret",
         "Sophia Loren",
         "Daryl Hannah",
         "Burgess Meredith",
         "Kevin Pollak"
      ],
      "imdbMovieId": "0113228",
      "originalTitle": "Grumpier Old Men",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["rEnOoWs3FuA"],
      "plotSummary": "A family wedding reignites the ancient feud between next-door neighbors and fishing buddies John and Max. Meanwhile, a sultry Italian divorcée opens a restaurant at the local bait shop, alarming the locals who worry she'll scare the fish away. But she's less interested in seafood than she is in cooking up a hot time with Max.",
      "tmdbMovieId": 15602,
      "avgRating": 3.17358,
      "releaseYear": "1995",
      "numRatings": 15552,
      "posterPath": "/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg"
   }
}