{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dancing",
            "id": 246
         },
         {
            "name": "great depression",
            "id": 5571
         },
         {
            "name": "marathon dance contest",
            "id": 200658
         },
         {
            "name": "ballroom",
            "id": 209342
         },
         {
            "name": "santa monica california",
            "id": 216966
         }
      ],
      "imdb_id": "tt0065088",
      "video": false,
      "title": "They Shoot Horses, Don't They?",
      "recommendations": [
         42740,
         3011,
         43838,
         20003,
         8217,
         32499,
         4173,
         45578,
         26268,
         24748,
         33632,
         34148,
         39946,
         66027,
         42678,
         25188,
         31587,
         24807,
         38724,
         14441
      ],
      "backdrop_path": "/uZyvkWSQZsv0XqcotfteXcYznVr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe457cc3a368484e05e1eb",
               "name": "Jane Fonda",
               "profile_path": "/y1QtAxHn8XOi4cHzDRJUuvK3aFp.jpg",
               "id": 6352,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e1ef",
               "name": "Michael Sarrazin",
               "profile_path": "/yPTnNIssj1NnlByuxTV8BP2YXfc.jpg",
               "id": 30428,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe457cc3a368484e05e1f3",
               "name": "Susannah York",
               "profile_path": "/z21rG8L8RsDOEl2iG467cWPud3T.jpg",
               "id": 13326,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Rocky",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e1f7",
               "name": "Gig Young",
               "profile_path": "/b3ygoxK0hWTDtKdwE0C8fUgLoLu.jpg",
               "id": 70985,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sailor",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e1fb",
               "name": "Red Buttons",
               "profile_path": "/iog7plLpG4qvBlkq1aKSutkAys.jpg",
               "id": 7503,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Rudy",
               "gender": 1,
               "credit_id": "52fe457cc3a368484e05e1ff",
               "name": "Bonnie Bedelia",
               "profile_path": "/10JhoIaKHQGG0DNbQECTI4gHNn9.jpg",
               "id": 7673,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Rollo",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e203",
               "name": "Michael Conrad",
               "profile_path": "/kleHZkUDjC1mVLJFSEajRRQoGO6.jpg",
               "id": 40390,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "James",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e207",
               "name": "Bruce Dern",
               "profile_path": "/fYhCiXGBARWUevnWDkeCEpwi4h4.jpg",
               "id": 6905,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Turkey",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e20b",
               "name": "Al Lewis",
               "profile_path": "/4gm2p5AkJVrYU6wLHPpu3ehOFEP.jpg",
               "id": 99825,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Cecil",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e213",
               "name": "Severn Darden",
               "profile_path": "/aLIhcERvzViemlgvTovyKJ7A6zZ.jpg",
               "id": 99829,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Shirl",
               "gender": 1,
               "credit_id": "52fe457cc3a368484e05e217",
               "name": "Allyn Ann McLerie",
               "profile_path": "/tVkJUSsKrPlAullwRfpit2RHfW4.jpg",
               "id": 76382,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Mrs. Laydon",
               "gender": 1,
               "credit_id": "52fe457cc3a368484e05e21b",
               "name": "Madge Kennedy",
               "profile_path": "/ahpHo5Z7XTo9ywtwCL7aWbO3nc9.jpg",
               "id": 16765,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Mario",
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e223",
               "name": "Felice Orlandi",
               "profile_path": "/uh1gUkBeBUK4ch002jylSf4HuJl.jpg",
               "id": 14068,
               "order": 12
            },
            {
               "cast_id": 13,
               "character": "Joel",
               "gender": 0,
               "credit_id": "52fe457cc3a368484e05e20f",
               "name": "Robert Fields",
               "profile_path": null,
               "id": 99826,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Jackie",
               "gender": 0,
               "credit_id": "52fe457cc3a368484e05e21f",
               "name": "Jacquelyn Hyde",
               "profile_path": "/dbc2a2hFeCVDJeAi0Gc1bNgmHfV.jpg",
               "id": 69570,
               "order": 14
            },
            {
               "cast_id": 28,
               "character": "Male Dancer #74",
               "gender": 2,
               "credit_id": "5907e2eec3a36858d6003ff2",
               "name": "Ian Abercrombie",
               "profile_path": "/uywWX3MCmr9N2WFBcsInPzGFV4X.jpg",
               "id": 11764,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e1db",
               "name": "Sydney Pollack",
               "profile_path": "/zxkoU2diKtvarV1Qk4z9He2lJj9.jpg",
               "id": 2226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e1e1",
               "name": "Horace McCoy",
               "profile_path": "/sOVY2EXiDC4P0GedVVT9gMyXoHQ.jpg",
               "id": 82838,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe457cc3a368484e05e1e7",
               "name": "James Poe",
               "profile_path": null,
               "id": 3638,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55ca11fdc3a3687520001a3c",
               "name": "Robert E. Thompson",
               "profile_path": null,
               "id": 1192281,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55ca121dc3a3687520001a40",
               "name": "Robert Chartoff",
               "profile_path": null,
               "id": 16514,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55ca12349251410c52001e21",
               "name": "Irwin Winkler",
               "profile_path": "/chJjLXD7PlFhuyeverNCgemIAAC.jpg",
               "id": 11472,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55ca147cc3a368752c002043",
               "name": "Philip H. Lathrop",
               "profile_path": null,
               "id": 1939,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55ca1490c3a368597b0012f3",
               "name": "Fredric Steinkamp",
               "profile_path": null,
               "id": 10640,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55ca14a39251410c5b001cd2",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "55ca14b79251410c4f001c15",
               "name": "Donfeld",
               "profile_path": null,
               "id": 10189,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "57696a78c3a368696f000484",
               "name": "Johnny Green",
               "profile_path": "/r5zYJNDDygX7Vtnp8VZc7S7jqAG.jpg",
               "id": 175505,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.419588,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28145,
      "vote_count": 67,
      "budget": 0,
      "overview": "Desperate characters stake their fortune on a Depression-era dance marathon.",
      "similar": [
         68817,
         85373,
         1788,
         44214,
         9762,
         88,
         497,
         1585,
         41592,
         3082,
         4147,
         55787,
         46705,
         335797,
         82693,
         316029,
         264660,
         9836,
         38050,
         755
      ],
      "original_title": "They Shoot Horses, Don't They?",
      "runtime": 129,
      "poster_path": "/4VtS9rHREjuzDZAiegZlqwj7rRv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Palomar Pictures (I)",
            "id": 29363,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American Broadcasting Company (ABC)",
            "id": 3065,
            "origin_country": ""
         }
      ],
      "release_date": "1969-12-10",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "People are the ultimate spectacle.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sydney Pollack"],
      "runtime": 129,
      "synopsis": null,
      "writers": [
         "Horace McCoy",
         "James Poe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0065088/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMzY1MzY3OF5BMl5BanBnXkFtZTYwMjIwOTg4._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Jane Fonda, Michael Sarrazin, Susannah York | See full cast and crew »"],
      "reviews": [
         "\"They Shoot Horses, Don't They?\" is such a fascinating film that it made worthwhile a little research into the dance marathon craze of the 1920s and early 1930s. According to the DVD extra, the set was modeled on the old Aragon Ballroom, built in the 1920s on the Lick Pier at Santa Monica, California. The once-elegant ballroom had grown seedy by the early 1950s, at which time it enjoyed a brief revival as the location of early Lawrence Welk show broadcasts. In the 1960s, the Aragon was again revamped under a different name as a short-lived rock concert venue - with appearances by Alice Cooper (is his pre-Cooper days) and Jim Morrison of the Doors. It was destroyed by fire shortly afterward. Marathon dancing was, according to most historians, as brutal and exploitive as it is depicted in \"Horses.\" It was for that reason that this early 20th century variety of Roman coliseum culture was banned in much of the country by the late 1930s. This movie uses fictitious characters to tell a story that appears to be remarkably accurate from a historical point of view. Jane Fonda's ultra-cynical, sharp-tongued character, Gloria, along with ruthless manager/promoter Rocky (played by Gig Young), contrast perfectly with the eerily-resigned and unpretentious Robert (Michael Serrazin). The casting and dialogue are brilliant. The visual effects are haunting. This film is not for everyone. But for those interested in the social pathology that allows human suffering to become a form of amusement, the malicious ill-treatment of the poor, or the harsh realities of the depression era, this is multifaceted cinema that can be watched again and again, each time yielding new subtleties. It is a morbidly fascinating character study that reflects a truly desperate time. For those watching on DVD, it is advisable to see the short background feature before the movie in order to fully appreciate its context. The movie is unforgettable, a true classic.",
         "In this movie's only moment of deadpan black humor, a nurse asks Gloria Beatty (Jane Fonda) after an exhausting dance session that has lasted nearly 1,000 hours, \"Can I get you something for your feet?\" Her response, as black as night, is, \"How about a saw?\" Taken out of context, her retort would inspire at least a barf of nervous laughter -- comic relief mirroring the temporary relief that particular something would give Gloria. But knowing the fury that her character has, this dissatisfaction with life in general, it wouldn't be a far stretch to see her amputate her feet right off and be done with it as the band plays on and Gig Young herds his cattle into mindless motion, for a promise of a little over one grand as a prize. She has nothing, she expects nothing -- and this is her last exit to a better life. Such is the heroine of Horace McCoy's novel of the same name, which appeared in 1935 and told a story so lurid it could not possibly be true: that of the horror of dance marathons in which people down on their luck danced for interminable hours with brief \"rest periods\" no longer than 15 minutes, and all for free food and money. The ultimate price to pay for an era of abundance turned inside out into the belly of the beast the Depression Era was. All the time while Ginger and Fred danced under the stars and brought Hollywood magic to their eyes, all false promises. The greater irony is that its plot is set right at the edge of the world: the West, where dreams have been known to come true, especially for aspiring actors looking for their Big Break. That it was written by someone who was himself in the fringes is only fitting: some of the more effective stories come from people at the edges of society. In a tone similar to Hubert Selby's REQUIEM FOR A DREAM, several characters are caught under the wheels of the American Dream and the need to escape the rampant poverty that had the nation under a vise. Dancing with Gloria are Robert Syverton (Michael Sarrazin), who seems to have committed a crime which makes this a story told in extensive flashbacks; Alice LeBlanc (Susannah York), who with partner Joel (Robert Fields) aspired to be a star; Ruby (Bonnie Bedelia) and James (Bruce Dern), a young married couple expecting their first child; and the Sailor (Red Buttons), a veteran of dance marathons. Rocky (Gig Young), the emcee, holds the ultimate poker card as to who will win this coveted prize and has the morals of a two-dollar bill. What neither of them begin to suspect is that there is no light at the end of this tunnel. Rocky, the emcee, as corrupt as he is, is the only one who knows the final outcome and plays the game and each contestant until many of them literally fall dead... or worse, become raving lunatics moving for the sake of moving. Like the quick fix that the characters of REQUIEM were hooked on, he is just that to these people who soon progress from dancers full of life to zoned-out zombies in one horrific shot where we see their reflections through shards of broken glass, their eyes staring, looking at nothing, as they shuffle about in mock-dancing. Alice will lose her dreams and turn into a shell of her former self: a scene in which she tries to seduce Robert is painful, especially when it happens right by a picture of an actress she emulates, Jean Harlow. Gloria will become even more bitter, and a sense of Hell on Earth will be the dominant feeling once the stakes become higher. And throughout it all, the dance. But if the dancing in itself is punishing, nothing can account or compare to the two horrifying sequences where all of the contestants must race around the ballroom and avoid at all costs at being the last three couples, grounds for elimination. The first of them runs for the entire duration of its ten minutes and is a reverse chariot sequence in BEN HUR: instead of chariots, there are desperate people -- one of them, Ruby, is seven months pregnant -- and instead of a whip we have the emcee. It is interminable, and hits home at just how inhuman this contest is. The second one is even more terrible: the unforgettable image of Jane Fonda dragging the Sailor behind her back, a symbolic horse trying to remain in the game. THEY SHOOT HORSES, DON'T THEY? comes with a heavy dose of nihilism that would be the tone set throughout the Seventies and in many ways, it can be said that Seventies cinema began in 1969 with this and with MIDNIGHT COWBOY, both films about the underbelly of society. Every performance in the movie is on-target including that of Michael Sarrazin who is looks like a non-entity but is more the chewed-up remains of the dream machine. Sydney Pollack uses a number of flashy techniques appropriate of the time -- flashcuts, stylized sequences that seem out of a narrative structure -- and in doing so has created his own masterpiece. Timeless, the story of human exploitation is even more relevant today with the advent of reality game shows like Fear Factor and its self-degrading contestants. It's an ugly portrayal of us as a society, willing to partake in the spectacle of seeing people worse than we are acting little more than animals destined for carnage.",
         "A brutally bleak screen adaptation of the pulpy Horace McCoy novella, about a Depression-era dance marathon where down-and-outers drive themselves to the brink of exhaustion to win the cash prize. This film has become relevant again today in the age of reality T.V., where people tune in to watch strangers be humiliated, rejected and made fun of. Meanness and suffering sells today, and apparently it sold back then as well. The M.C. of the dance marathon, played wonderfully by Gig Young in one of his last (if not the last) film performances before the troubled actor murdered his wife and then killed himself, creates little narratives and dramas around each of the dancers, so that the audience can have their favorites to root for. Every once in a while, someone will show off a special talent, singing a song or hoofing a little dance number, and the audience will throw change at them, which the performer then frantically scrabbles up like a desperate pigeon. The cast of dancers is led by Jane Fonda, in a break-out role as Gloria, the jaded woman-of-the-world who's seen it all and doesn't want to see anymore; Susannah York, as a pretentious wannabe actress, who acts up a storm during a mesmerizing breakdown scene; Red Buttons, as an aging ex-serviceman who struggles to keep up with the young kids around him; and Bruce Dern and Bonnie Bedelia, as a sweet couple of country bumpkins who are desperate to win the cash for their unborn baby. And yes, that is Al Lewis (aka Grandpa Munster) lurking around in the background as one of the dance marathon officials. Director Sydney Pollack vastly improves on the source material, making something much richer and deeper out of McCoy's lurid novella. He uses an edgy, jarring style that's suited perfectly to the material, and which he would never again display. \"They Shoot Horses, Don't They?\" holds a sort of grisly fascination over its audience. Bleak as it is, it's also entertaining in a rather morbid way, making us feel like we're members of the audience watching this sick spectacle and making it that much harder for us to condemn the film audience without labeling ourselves as hypocrites. Grade: A",
         "When I saw this movie in the theater over 35 years ago, I found it very interesting and one of those movies you don't forget about an hour after you leave the theater. This was a haunting type of story, especially when my folks, who went with me, informed me that these marathon type of dance contests really did happen. The characters might have been fictional, but not story of these awful contests. Jane Fonda plays the central character, \"Gloria Beatty,\" an angry-at-the-world and profane woman who certainly has a cynical attitude. It almost echoed her real-life persona at the time, but I won't go there. I was more fascinated with Gig Young's performance in this film as the ruthless dance promoter - emcee \"Rocky.\" To me - and Academy Award voters - his performance stands out among all the others, even though everyone does an outstanding job. That includes director Sydney Pollack, who had only made a few movies until this one. The deep cast in this film did not include big-name stars but they were known celebrities: actors like Michael Sarrazin, Susannah York, Red Buttons, Bonnie Bedalia, Bruce Dern and Al Lewis. This is a sad tale of desperate people in desperate times trying to make a few extra bucks during the Great Depression years. Dancing in pairs, they literally risked their health by trying to stay on their feet by dancing longer than every other couple. One became mentally exhausted just watching these poor people on screen trying to survive these \"marathons.\" Like a lot of movies which deal with unpleasant topics, this is a haunting film that will leave you thinking about it for a long time afterward. I can't say I enjoyed watching it the second time around, on VHS - Fonda's nastiness too much to take - but I certainly wouldn't discourage anyone from watching this movie. It's a story about an unique event in American history guaranteed to be one you won't forget.",
         "THEY SHOOT HORSES DON'T THEY? This movie stays in the memory, partly because it stands out from other mainstream Hollywood products of its time in subject matter (the dance marathons of the 20s and 30s) and tone (pitilessly and harshly negative; even the humor is bleak). The message: life (the marathon) is a desperate rat race with a rigged outcome. How certain actors end up with certain roles depends on the crazy complicated game known as Hollywood casting, but sometimes even a miscast performer will bring an unexpected something to the table and triumph. Such was the case with Bette Davis in ALL ABOUT EVE (written with Claudette Colbert or Gertrude Lawrence in mind) and such is the case with Jane Fonda in a role that would have been better suited to someone like Stella Stevens. Fonda overcomes the odds as Gloria, the morbidly cynical and impoverished young woman whose brief life has been a series of abuses, disappointments and defeats. Even though the actress looks and speaks like a patrician, her defiant, angry, controlled desperation burns through the superficialities. Her performance culminates in an emotional meltdown which she handles with skill. It was her great breakthrough as a screen actress. Another career peak is reached by Gig Young who, as the master of ceremonies, personifies all the dishonesty, cruelty and pathos of the marathon itself. Bonnie Bedelia and Susannah York also score as different kinds of vulnerable innocents. Michael Sarrazin as Fonda's dance partner serves as the passive instrument that allows Fonda to play out her tortured personal drama. His unchanging wounded puppy dog expression speaks for itself. Ironically, the musical arrangements by John Green, a brilliant and very active composer of early 30's popular songs (including \"Body and Soul\"), sound more like Lawrence Welk than a real third-rate dance band of the early Depression era. As musical supervisor of this film I wonder if it was Green who anachronistically included songs that hadn't even been written when the story takes place, including \"I Cover the Waterfront\" (1933) and \"Easy Come, Easy Go\" (1934), both of which Green composed himself. For some reason the scriptwriter chose to move the story to 1932 from its original placement in 1934 by author Horace McCoy in the novel on which this film is based. At one point an old lady tells Fonda and Sarrazin that they are her favorite dance couple because they're wearing the number \"67\" which is the year she was born (1867). Later Fonda calculates her age: \"Sixty-five.\" Which enables us to figure out that the action is taking place in 1932. In another scene Fonda, referring to Bonnie Bedelia, quips, \"If she's not pregnant, then I'm Nelson Eddy.\" Eddy didn't become a nationally known name until 1935 when he teamed with Jeanette MacDonald. He didn't even appear in a major motion picture until 1933 (DANCING LADY, MGM). A woman of 1932 would have been more likely to say \"Bing Crosby\" or \"Rudy Vallee\" or even \"Russ Columbo.\" So one can't help wondering why the screenwriter bothered to move the action backwards by two years. Exhausted couples staggering around a dance floor under a shining, spinning ball composed of mirror fragments that reflect off the ceiling, walls and floor - a symbol of Earth and the cosmos around it and oppressed humanity on the bottom grimly pressing on. That's the film in a nutshell.",
         "During the Depression, many had nothing... and the few that did were almost equally as miserable. This movie displays a dance marathon, held for the entertainment of the latter, and the expense of the former. The contestants dance for daily meals and a place to sleep, and the weak hope of a prize, if they are the last couple standing. The rules are cruel, and whilst the many dancers fight to remain standing, the audience is served snacks and fast-food. The film shows how callous people can be, sometimes. The plot is magnificent, the story-telling excellent. Acting(Sarrazin can exude an extraordinary amount of emotion through his eyes), casting, editing(with extremely few slightly weak moments), pacing, direction, cinematography, lighting, music, production design, everything, it's all amazing. This is a very difficult film to watch(which is by no means to say that I regret doing so). It is not entertainment, nor is it something to escape one's everyday life with. It is brutal and uncompromising, a window into an era and an event, both of which show humanity at its worst. A masterpiece. I intend to look for other films by Pollack, there is no doubt about that... fortunately, my fiancée has told me that he has done lighter fare(I would prefer watching something less bleak than this for the next of his movies I view). This is a very important movie, particularly in today's world, where reality shows are all over TV. I recommend this to anyone certain that they can sit through it. 8/10",
         "Viewing \"They Shoot Horses, Don't They\" is like rubbernecking a horrific traffic accident, or watching a train wreck. The images, no matter how painful, are too disturbing to turn away. This movie documents the depression era pathos by showing us a glimse of a group of dance-marathon contestants battling it out for a winner-take-all purse. Their lives become symbolic of their efforts in the marathon: inexorable pain, constant cramping, and a constant questioning of just \"why live in all this misery?\" Eventually, the lead performances, especially those of Susanna York and Jane Fonda, show at once characters strong-willed but overcome by simple animal survival. The rest of the stellar cast captures this bleakness as well (watch a young Bonnie Bedelia sing for thrown pennies!!!). Eventually the movie painfully climaxes to let one realize the issues raised by the movie title. The film is stunning in capturing the simple struggle of humanity; it's a must-see, but only once!!!",
         "This is one of the best movies I have ever seen. Set in the 1930s, it revoleved around a group of people entering/running a depression dance marathon. The group entering the contest(The principle characters being Fonda, Sarrazin, York, Buttons, Bedilia, Fields)Can't pass up the seven meals a day, or the top prize of 1500 dollars, no matter how grueling the dance will be. Fonda, is a drifter looking for money, Sarrazin wanders into the contest by accident, York and Fields are an actor and actress hoping to be \"Discovered\", and Buttons is also looking for money. The management of the contest is represented by Young, Lewis, and (To a lesser extent)Conrad. While this is not a \"Pick me up\" movie, it is definitely worth seeing. The cast is excellent, and the movie moves along well. Director Sydney Pollack filmed the movie in sequence, which helps to show the fatigue that the characters are feeling. They Shoot horses was nominated for nine academy awards, inglinging Best actress(Fonda), Best Supporting Actress(York) and Best Director(Pollack). However, only Gig Young walked away with the statuette(For best Supporting Actor) and he deserved every inch of it. Playing against typecasting, he knew he was getting the role of a lifetime and he gives one of the best performance of his career. I actually liked Rocky, with his White Tux and his \"Yowza!Yowza!Yowza!\" I don't know if I would have liked the character if Gig Young had not been in the role. Overall, this movie is definitely worth seeing. If you have a chance, give it a look. 10/10 ***** out of *****",
         "This is the movie that \"The Day of the Locust\" might have aspired to be. It captures the tone of desperation and helplessness of Depression-era characters (would-bes, wanna-bes, and fade-outs) like few films I've seen. It's a fascinating downer, ripe with interesting losers and gritty drama. Jane Fonda's performance as a marathon-entry at the end of her rope ranks with her very best work, and Oscar-winner Gig Young is smashing as the M.C. Also superb: Susannah York as a glamor girl who gets her clothes (and sanity) dirty, and Red Buttons as an over-the-hill sailor. There's not a happy or hopeful moment in sight, but for gripping human drama you could do no better. James Poe and Robert E. Thompson adapted their screenplay from Horace McCoy's novel; Sydney Pollack directed, impeccably. ***1/2 from ****",
         "A few months ago, I saw 1969's THEY SHOOT HORSES, DON'T THEY? for the first time in its entirety. I had heard a lot about this film when it was first released and had seen bits and pieces of it in the past,but I found watching the entire film to be a devastating and shattering experience. I must concur with another poster's comparison to the marathon dance contest participants to today's reality show contestants...there is an air of desperation surrounding these people that is sad and frightening to watch. Some of these people have pinned their entire existence on winning this marathon and you just know everyone can't win. As a matter of fact, if memory serves, we never find out who won, because the film focuses on those losers who have pinned their entire lives on this and don't make it. Jane Fonda should have won the Best Actress Oscar for her Gloria Beatty, a strong yet pathetic creature who MUST win this marathon. Michael Sarrazin had the role of his career as Robert, the young man who becomes Gloria's partner by fate and becomes drawn into her web of depression and loneliness. Gig Young won an Oscar for his ultra-slick turn as the host and promoter of the marathon. Memorable characterizations of other participants in the marathon are offered by Suhsannah York, Red Buttons, Bonnie Bedelia, and Bruce Dern. This film is not for very taste, but can be a haunting yet satisfying film experience for those who can handle it. Definitely not for the faint of heart and way ahead of its time. Exceptional direction by Sidney Pollack."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "American Broadcasting Company (ABC)",
         "Palomar Pictures (I)"
      ],
      "summaries": [
         "Gloria is a young woman of the Depression. She has aged beyond her years and feels her life is hopeless, having been cheated and betrayed many times in her past. While recovering from a suicide attempt, she gets the idea from a movie magazine to head for Hollywood to make it as an actress. Robert is a desperate Hollywood citizen trying to become a director, never doubting that he'll make it. Robert and Gloria meet and decide to enter a dance marathon, one of the crazes of the thirties. The grueling dancing takes its toll on Gloria's already weakened spirit, and she tells Robert that she'd be better off dead, that her life is hopeless - all the while acting cruelly and bitterly, alienating those around her, trying to convince him to shoot her and put her out of her misery. After all, they shoot horses, don't they?",
         "In 1932, in the Great Depression, a group of hopeless people participates of a dance marathon contest on the Santa Monica Pier in California. Among them are the bitter and disillusioned Gloria; a sailor that fought in the war; the aspirant actress and actor Alice and Joel; the farmer James and his pregnant wife Ruby; all of them expecting to win the award of US$ 1,500.00. Gloria's partner has a threatening cough and is disqualified before the contest. However, the Master of Ceremony Rocky summons the stranger Robert (Michael Sarrazin) to replace her partner and dance with Gloria. Along more than forty days, the weakest couples are disqualified from the contest. When Rocky proposes that the exhausted Gloria and Robert get married during the dance marathon to raise money with the gifts, Rocky discloses that the winners will have their expenses deducted from the prize resting almost nothing from the US$ 1,500.00. Gloria leaves the contest with Robert and asks him for an ultimate solution for her suffering.",
         "The lives of a disparate group of contestants intertwine in an inhumanely grueling dance marathon."
      ],
      "budget": 0
   },
   "movielensId": 3011,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-12-10",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["Sydney Pollack"],
      "runtime": 129,
      "movieId": 3011,
      "title": "They Shoot Horses, Don't They?",
      "mpaa": "",
      "actors": [
         "Jane Fonda",
         "Michael Sarrazin",
         "Susannah York",
         "Gig Young",
         "Red Buttons",
         "Bonnie Bedelia",
         "Michael Conrad",
         "Bruce Dern",
         "Al Lewis",
         "Severn Darden",
         "Allyn Ann McLerie",
         "Madge Kennedy",
         "Felice Orlandi",
         "Robert Fields",
         "Jacquelyn Hyde",
         "Ian Abercrombie"
      ],
      "imdbMovieId": "0065088",
      "originalTitle": "They Shoot Horses, Don't They?",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ke-sWMXspNA"],
      "plotSummary": "Desperate characters stake their fortune on a Depression-era dance marathon.",
      "tmdbMovieId": 28145,
      "avgRating": 3.66609,
      "releaseYear": "1969",
      "numRatings": 1159,
      "posterPath": "/4VtS9rHREjuzDZAiegZlqwj7rRv.jpg"
   }
}