{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0376568",
      "video": false,
      "title": "Sexual Dependency",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1009,
               "character": "Jessica",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8ab",
               "name": "Alexandra Aponte",
               "profile_path": null,
               "id": 1032535,
               "order": 0
            },
            {
               "cast_id": 1010,
               "character": "Sebastian",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8af",
               "name": "Roberto Urbina",
               "profile_path": "/mFPSXSlzfpHJ2evXLxFTuU4uCAb.jpg",
               "id": 1032537,
               "order": 1
            },
            {
               "cast_id": 1011,
               "character": "Choco",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8b3",
               "name": "Jorge Antonio Saavedra",
               "profile_path": null,
               "id": 1032538,
               "order": 2
            },
            {
               "cast_id": 1012,
               "character": "Adinah",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8b7",
               "name": "Ronica V. Reddick",
               "profile_path": null,
               "id": 1032539,
               "order": 3
            },
            {
               "cast_id": 1013,
               "character": "Tyler",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8bb",
               "name": "Matthew Guida",
               "profile_path": null,
               "id": 1032540,
               "order": 4
            },
            {
               "cast_id": 1014,
               "character": "Sean",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8bf",
               "name": "Matt Cavenaugh",
               "profile_path": null,
               "id": 1032541,
               "order": 5
            },
            {
               "cast_id": 1015,
               "character": "Fabian, Sebastian's Cousin",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8c3",
               "name": "Rodrigo Mendez-Roca",
               "profile_path": null,
               "id": 1032542,
               "order": 6
            },
            {
               "cast_id": 1016,
               "character": "Love, Choco's girlfriend",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8c7",
               "name": "Liv Fruyano",
               "profile_path": null,
               "id": 1032543,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a877",
               "name": "Rodrigo Bellott",
               "profile_path": null,
               "id": 1029145,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a87d",
               "name": "Rodrigo Bellott",
               "profile_path": null,
               "id": 1029145,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a883",
               "name": "Lenelle N. Moise",
               "profile_path": null,
               "id": 1032531,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a889",
               "name": "Rodrigo Bellott",
               "profile_path": null,
               "id": 1029145,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a88f",
               "name": "Gerardo Guerra",
               "profile_path": null,
               "id": 1032532,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a895",
               "name": "Ara Katz",
               "profile_path": null,
               "id": 23406,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a89b",
               "name": "Gregory Leonarczyk",
               "profile_path": null,
               "id": 1032533,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8a1",
               "name": "John Dobrynine",
               "profile_path": null,
               "id": 592636,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a8a7",
               "name": "Jeremiah Vancans",
               "profile_path": null,
               "id": 1032534,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.108513,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "BO",
            "name": "Bolivia"
         }
      ],
      "id": 47614,
      "vote_count": 3,
      "budget": 0,
      "overview": "A poor girl, a rich stud, a university student and a model -- nothing in common, except the desire to experience true intimacy. Their stories unfold and overlap as each becomes victim to their own sexual dependencies, self-perceptions and illusions. Thematically structured around issues of femininity, masculinity, virginity, rape and sexuality, each teen struggles to make sense of their own identity, reaching for ideals that represent everything they feel they are supposed to be, but are not.",
      "similar": [],
      "original_title": "Dependencia sexual",
      "runtime": 104,
      "poster_path": "/jxEkso14KNatQtvEpj7I6XA8nQR.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "BoSD Films LLC",
            "id": 18541,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bods Film LLC",
            "id": 18542,
            "origin_country": ""
         }
      ],
      "release_date": "2003-08-31",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Bare your body, bare your soul.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Bolivia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rodrigo Bellott"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Rodrigo Bellott",
         "Lenelle N. Moise"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0376568/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQwNzc2MDQ5MV5BMl5BanBnXkFtZTcwMDMwMjUyMQ@@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Alexandra Aponte, Roberto Urbina, Jorge Antonio Saavedra | See full cast and crew »"],
      "reviews": [
         "This is not an easy movie to watch. Not only is the topic rather heavy, but the way the director shows the images is in the beginning very disturbing and tiresome: you constantly see two images at the same time, like the screen is split in a left and a right half! Sometimes it's two totally different images from two different story-lines, at other times it's just two different camera-angles of the same going-ons. At first I thought it would eventually turn to one image, or it would just get split-up again when there was some specific reason for it. But when it dawned on me that this would go on throughout the whole 105 minutes, it almost made me turn the thing off. Luckily I didn't, because gradually your eyes and brain apparently get used to this, and I have to say: the movie itself is really good!! It was advertised on my DVD-box as some sort of sequel to Kids or Ken Park movie, which I think doesn't justify it. Sure, it's got the same sense of documentary, young actors going about as if they're not acting at all, and camera's wavering about, and it's as candid in the way the different stories are told and shown. But it's a lot less superficial, you seem to get more into the characters of the persons, which at least enables you a little bit to comiserate and care for them. It's about some 5 young kids who all have reasons for frustrated feelings about sex and sexuality. Some in a very simple way, like the young village-girl with the raving strict father, who's dying for her first experience. Or the young virgin guy who gets forced by his drunk and roaring friends to visit a prostitute. In others it's more complicated: hidden homosexual feelings in a macho latino, or coping with the experience of a rape. The different story lines are cleverly woven into eachother, in a very natural way (witch is helped of course by the splitting of the screen) and somehow I didn't even notice it much when the story brought us to a Spanish or an American spoken scene. Of course you're not to expect any happy ending with this kind of bare, painfully honest movies, and the one here is equally depressing, just giving you the hope that everyone will somehow have learned something from his or her bad experiences. Maybe that's my main criticism: there's very little room for a smile, it's maybe all a bit too pitch-black. However: absolutely worth while. 8 out of 10.",
         "This movie is very good. A bunch of reasons make me say this. First of all, I am a person who has been around many countries in South America (i.e. Latin America) and I can very well relate everything that this movie showed. The movie is based on a reality that Bolivia, specially Santa Cruz (the city), lives day by day. This reality shows how people think, and how very small societies can play important and determinant roles in people's way of thinking, way of acting, and even sexuality (title of the movie.) The split screen is a very good effect. I have to admit that it is weird at the beginning, b/c first of all i have never watched a movie like that--with a split screen--and i am pretty sure many people haven't either. After 10 to 15 minutes you start to realize why the director did this, and you start to understand how he focus different things, at different times, for different purposes. Its just like real life; you just don't go around looking for one thing at a time, the effect of multi-focusing gives the movie a special taste, and most importantly, it gives the movie a very realistic taste. The movie ending is one of the best ones that i have seen in my entire life, totally unexpected, totally shocking, and makes you think about every single thing that you saw in the movie. I would strongly recommend it. Trust me, just see it, with an open mind, and you will like it. 10/10",
         "I think this could have been a good film, but, as others have mentioned, the split-screen 'style' (?) is incredibly annoying over 100-odd minutes of watching, or, in this case, watching TWICE. That adds up to 200-odd minutes of watching five different stories, all while distracting you with camera gimmickry. In the mid-1960s, a graphic designer from Toronto, Ontario, Canada named Chris Chapman created the split-screen idea for a short film on the Province of Ontario for the provincial government. It was a sensation at Expo '67 in Montreal, and was such a novel idea that Toronto director Norman Jewison (and others) used it in 1960s films. The idea, predictably, went nowhere. It was trendy, had flair, but was not sustainable over the length of an entire film. Jewison used it sparingly in The Thomas Crown Affair (1968), and it annoyed critics even then. And here, almost 40 years later, we have a director who thinks it would be a great idea to try it again, this time (unlike Jewison, who was far more judicious) over the ENTIRE STRETCH of a movie. I was astounded that this was done. It defies basic physical laws. The human eye just cannot catch up with a blizzard of jump cuts (and that's what they really amount to) over a feature-length. Instead of intensifying the drama, it instead made me truly irritated. Repeat: I THINK this could have been a good film. Or is that films, as in plural?",
         "it is one of the best movies i've ever seen, first of all because i saw it in a movie theater in Cochabamba Boliva, i am from Bolivia and i lived in a everyday basis watching how everything is just as the movie portrays it, not only the split screen factor is a new thing in the style of the movie, but the way of mixing two places that differ so much from one another and still teenagers have the same problems, it doesn't matter who you are where you live you can always relate yourself to the movie, i saw it and i could only think of how much truth the director poured into the movie. Finally I would like to add that not only the plot but the way the story is told gives it more dramatism and realism, it is just incredible that something of that quality was produced in my country I feel really proud to see that the international market is ready to see what Bolivia has to offer in art material",
         "In 'Sexual Dependency', writer/director Rodrigo Bellot delivers a stark, brutal and overwhelmingly honest portrayal of humanity as driven by their sexual urges, desires, and fears. Reduced to animals, the human condition is merely a thin veneer stretched tightly over millennia of instinct. However, the film is also about the ever-changing roles of people as determined by shifting environments and perspective, which Bellot drives home through the use of a fairly uncommon and at times disconcerting film technique. So as to ensure the central message that sexual politics and animal group dynamics are fundamental to all, Bellot and fellow co-writer Lenelle N. Moise, rather than zooming in on one small cross-section of society as representative of all humanity, present a series of loosely-connected short stories populated with a number of different social groups. To really hammer the point home and ensure the viewer doesn't dismiss the unsettling narratives as simply the darker side of Bolivian culture, the action transfers halfway through to New York, where the same fundamentals of aggression are at work. Another function of the anthology is to show a progression of both sexual awakening and the inevitable consequences of social groups led by dominant and aggressive leaders. Thus the first segment explores the difference between fantasy and reality as centred around a 15-year-old girl when the testosterone-filled vultures begin to circle. However, while male dominance and aggression are undeniably the driving force of all conflicts throughout 'Sexual Dependency', the young girl's unpressured curiosity and awakening sexual desires against the juggernaut of a young man whose hormones will brook no disagreement are thrown into sharp contrast with the unwitting young man forced into sexual adventure by his peers in the next segment. By the end of the film, the dominated males are no less numerous. The third segment then shifts the focus from the weak to the sexual predator, exploring the ways in which they remain leader of the herd and how these acts impact those around them. Importantly, it also delves into the insecurity of that psyche, which plays an even greater role later on. It is here that the action relocates to New York, with one of the key Bolivian characters moving there and discovering both the true fragility of the world they have built up for themselves and that the law of the jungle is the only universal constant. In this way, the cultural shift not only reinforces the argument that basic social behavior is the same everywhere, but also demonstrates that positions of dominance are entirely relative. Here, the hunter of one world may become the prey of another, though in a film set in two countries, cultural difference in and of itself becomes a contributing factor. Besides this, the New York half of 'Sexual Dependency' goes on to explore themes not already addressed earlier, such as homophobia, rape, and reinforcing heterosexual group dynamics north of the border. The overall progression from innocence to revelation and fall continues throughout and the final segments begin to blur together in a chaotic mess (carefully structured) so as to echo the crushing mental and physical pain brought on by fear, loathing, victimization, realization, and the fall from innocence. Full credit must go to Bellot for choosing a cast who clearly understood what was being asked of them and performed it with absolute believability. I can't think of a single actor present who didn't deliver. The subtitles also were absolutely spot-on, with excellent use of equivalent English slang and colloquialisms to really ensure that cultural difference didn't distract from the underlying message. I was also quite impressed by the overall thematic progression and the way in which the way the film was edited together managed to match the escalating drama unfolding on screen, leading to a rich and layered experience as a result. The most obvious example of this is the way the film itself was shot. Bellot experiments with the widescreen format to a degree not often seen before, by having two moving images at once. For the most part, this simultaneous imagery is of the same subject, with one camera filming from a different angle. However, one video is often a few seconds out of sync with the other, providing a sort of 'echoing' effect, which is most effectively used in a monologue segment later on. At other times, the two images may be entirely different, with one intended as a thematic contrast to the other, and by the time of the drama's chaotic climax-as-descent, the visual confusion rises to a crescendo. The overall success of this technique is varied, in some places proving quite effective, while at other times being quite disconcerting and overcomplicated and in some places, not especially necessary. Another criticism I would make has to do with the murky breaking of the fourth wall that occurs toward the end of the film. Metatextuality is an art in its own right and often hard to pull off without being seemingly over-clever or gratuitous. Suffice to say, 'Sexual Dependency' is a title both of and within the film. It doesn't dampen the overall aim of the film, but it did make me feel a little cheated and emotionally 'exploited', although perhaps I simply didn't see what other viewers may regard as glaringly obvious. The bleak nature and stark reality of the subject matter unapologetically makes for a rather uncomfortable and disturbing film at times. Two hours in the company of base human desire is certainly not an easy ride. It should cause the viewer to look at themselves and how they may fit into the social hierarchy. It bypasses our rational excuses for ourselves and holds the truth up to the mirror where we can't escape. While certain aspects of its presentation and narrative manipulation didn't always work for me, 'Sexual Dependency' is a powerful, thought-provoking work of cinema and a sobering commentary on this most fundamental part of the human animal.",
         "While a lot of the time, I am a mainstream guy - who likes to watch known films with a lot of buzz and famous celebs, one in a while I take myself more seriously, and venture out to explore on foreign terrain. This time, I decided to listen to my gut feeling, and rent Sexual Dependency. While usually, Spanish-language films annoy me - the premise behind Sexual Dependency sounded interesting, especially to me - a guy who enjoys movies with sexual themes. I was pleasantly surprised by this movie: when I started watching it, and the split screen appeared, with dramatic music in the background - I was a bit hesitant. I though \"Well, there starts another tears-filled international drama\". In edition, the split screen really confused me in the beginning, and I thought to myself \"Where the hell should I look?\". But after you get the deal with the filming, you learn to appreciate this work of art: the idea of different perspective to each scene is amazing! Whoever though of showing us this split world is a genius! Another thing to like about this movie is the collection of people, whose stories interweave amongst each other. Even though some stories are more interesting and unique, and other are a bit more commercial and clichéd - the general picture is quite nice. The end of the movie is highly surprising, though weak, and a lot of ends don't create a tie - yet still, you feel fulfilled after you watch this film. While it is not perfect, it falls quite closely - thanks to an interesting plot construction, amazing filming, and even a little bit of South American music can't hurt. If you're into unique work of cinematic art - especially international film fans - you cannot afford to miss this creation.",
         "There are some movies you start watching with \"oh what now?!\" and at the end you thank the Providence you did... I avoid describing formal part - it's something you can discuss for long if you like after the movie and maybe it makes you watch it again \"to fully understand\". Whatever. Don't forget a wonderful selection of the music - at least for this reason the movie is something to see for those who are not interested for the other reasons. The importance for me consists in a topic. Let's say it simply - the mentality of a straight-male world. \"Oh, they are not all the same.\" Of course, we talk about those who are. About the chronical misunderstanding between genders - \"marry me, let's make children, build a house,...\" and the other gender, that learned that \"I love you!\" is a good way to say \"I wanna f..k you\" without offending the romantic ideals of the other one. I am not a frustrated woman whose feelings were hurt. I am a gay man - who just watches this never-ending game as a third part (with insight to both sides) and has \"fun\". Sometimes not so funny-kind-of-fun. I'd relate it to a movie In The Company Of Men - that was told \"to divide times\" to Before and After. May it be so. Now perhaps again, from different continent(s) - and with more characters to watch (maybe in different times) - so the image we are served is to be much more \"universal\"-like. But - it's not Bolivia, it's not America - this is the slight touch to the general mentality what the masculine thinks about what their masculinity is. That men never grow up inside from the age of 15...? They are the hunters in the core? They are expected to be so? What you think? At least consider... And now time for the point - the movie is a precise composition of the images that will be burnt in your head like a CD. And if not the scenes, not the dialogs, then for sure all the feelings and tunings and small internal shame you'll experience. One of the reasons to recommend this movie is the one mentioned in the title - for me it took days to digest it - even if my opinion was similar before. It HAS A TASTE - maybe bitter - but it's more then nowadays you can expect from the other politically correct and all-is-nice or all-will-be-OK films. Enjoy it, first feel, then think, admit, then the change will come itself. Let's hope.",
         "With generosity and patience one could appreciate this movie. However, the director's choice of using split screens throughout is an overwhelming mistake that gets in the way of everything else he is trying to do. It becomes annoying, like receiving text totally underlined and in capital letters: not everything is equally important nor do the images on one side of the screen contribute continuously in any significant way to what happens on the other side nor enhance our grasp of the whole. So, we are regretfully left with a boring and pretentious conceit of the sort that should have been outgrown in film school. Rodrigo Bellott is nowhere near being a Peter Greenaway who can manipulate aspect ratios and split screens to profound dramatic effect, thereby creating effective, well-structured wholes (e.g. The Pillow Book, a film only done full justice on a theatre screen where the diverse aspect ratios which occur throughout the film can be shown.... DVD's can't do it). Better luck next time.... and I truly hope there is a next time for Mr. Bellott. Forcing oneself to ignore his unfortunate aesthetic choice (and this is hard, for there is no avoiding it for the whole frigging movie) one realizes that Mr. Bellott may indeed have something worthwhile to say. I wish him to try again, preferably with a strong, experienced but sensitive producer at his side.",
         "Sexual Dependency is an interesting movie, very different from the movies produced in Hollywood. However I agree with the user commenting that \"it could have been a good movie\". Unfortunately it has many deficiencies. One of the biggest one is that the small little stories are quite scarce and non-realistic, e.g. the first one and the last one. I don't understand the director/writer why he changed the location of the last scene... Why did he move the story from Bolivia to USA? This gave me the impression that the stories are completely different and they won't have any meeting point, or anything in common (then at the end it turns out they have). The filming technique is also quite tiresome. You see two screens, sometime having completely different action in one than in the other. And as the movie is shot is Spanish, you have to keep an eye on the subtitle. So it's really hard and tiring to follow both screens. Sometimes I had the feeling that I'm bored, at some point (after the second scene) I thought I should stop watching the movie."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "BoSD Films LLC",
         "Bods Film LLC"
      ],
      "summaries": [
         "A poor girl, a rich stud, a university student and a model -- nothing in common, except the desire to experience true intimacy. Their stories unfold and overlap as each becomes victim to their own sexual dependencies, self-perceptions and illusions. Thematically structured around issues of femininity, masculinity, virginity, rape and sexuality, each teen struggles to make sense of their own identity, reaching for ideals that represent everything they feel they are supposed to be, but are not.",
         "Five teenagers in the U.S. and Bolivia try to make sense of their sexuality and the complexity of their identity."
      ],
      "budget": 0
   },
   "movielensId": 30698,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2003-08-31",
      "dvdReleaseDate": null,
      "directors": ["Rodrigo Bellott"],
      "runtime": 104,
      "movieId": 30698,
      "title": "Sexual Dependency",
      "mpaa": "",
      "actors": [
         "Alexandra Aponte",
         "Roberto Urbina",
         "Jorge Antonio Saavedra",
         "Ronica V. Reddick",
         "Matthew Guida",
         "Matt Cavenaugh",
         "Rodrigo Mendez-Roca",
         "Liv Fruyano"
      ],
      "imdbMovieId": "0376568",
      "originalTitle": "Dependencia sexual",
      "genres": [
         "Drama",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": ["A9pFeni8zO8"],
      "plotSummary": "A poor girl, a rich stud, a university student and a model -- nothing in common, except the desire to experience true intimacy. Their stories unfold and overlap as each becomes victim to their own sexual dependencies, self-perceptions and illusions. Thematically structured around issues of femininity, masculinity, virginity, rape and sexuality, each teen struggles to make sense of their own identity, reaching for ideals that represent everything they feel they are supposed to be, but are not.",
      "tmdbMovieId": 47614,
      "avgRating": 2.35714,
      "releaseYear": "2003",
      "numRatings": 7,
      "posterPath": "/jxEkso14KNatQtvEpj7I6XA8nQR.jpg"
   }
}