{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "sailor",
            "id": 41599
         },
         {
            "name": "tap dance",
            "id": 193206
         }
      ],
      "imdb_id": "tt0027387",
      "video": false,
      "title": "Born to Dance",
      "recommendations": [],
      "backdrop_path": "/6jXvTqQ9F0tGbNocejrodwaSeeb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Nora Paige",
               "gender": 1,
               "credit_id": "52fe4667c3a36847f80fd1c5",
               "name": "Eleanor Powell",
               "profile_path": "/yXNHco1FrBghoJJeG6lHfzXitPs.jpg",
               "id": 237562,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Ted Barker",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd1c9",
               "name": "James Stewart",
               "profile_path": "/aBLtt0Sl4AZVNclzFrXzbndRzux.jpg",
               "id": 854,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Lucy James",
               "gender": 1,
               "credit_id": "52fe4667c3a36847f80fd1cd",
               "name": "Virginia Bruce",
               "profile_path": "/qTtSm59QeywDqLYi1LJSQQ4YWH9.jpg",
               "id": 95314,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jenny Saks",
               "gender": 1,
               "credit_id": "52fe4667c3a36847f80fd1d1",
               "name": "Una Merkel",
               "profile_path": "/hBDjQyU2xJ9vELw0H63igS7ugSD.jpg",
               "id": 13963,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "'Gunny' Sacks",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd1d5",
               "name": "Sid Silvers",
               "profile_path": "/1LXtmHbWr0jePRs3s0eZJPTjRoc.jpg",
               "id": 227511,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "'Peppy' Turner",
               "gender": 1,
               "credit_id": "52fe4667c3a36847f80fd1d9",
               "name": "Frances Langford",
               "profile_path": "/3LpOzWsxaU0ocWsoUG50MtScdHb.jpg",
               "id": 30275,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Captain Dingby",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd1dd",
               "name": "Raymond Walburn",
               "profile_path": "/pKt1WAQqKhCbTfnWfyLpn8BhjuR.jpg",
               "id": 89673,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "McKay",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd1e1",
               "name": "Alan Dinehart",
               "profile_path": "/zItSFkXyFGu1MInFuLaKNvhooNr.jpg",
               "id": 34348,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "'Mush' Tracy",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd1e5",
               "name": "Buddy Ebsen",
               "profile_path": "/xBscNtDuEAUld96AlFEUPKM8TG9.jpg",
               "id": 1935,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Sally Saks",
               "gender": 1,
               "credit_id": "52fe4667c3a36847f80fd1e9",
               "name": "Juanita Quigley",
               "profile_path": "/2tcqIsqKVBPRgEGGNHvMB542adE.jpg",
               "id": 1011213,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd1ed",
               "name": "Georges",
               "profile_path": null,
               "id": 1266627,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd1f1",
               "name": "Jalna",
               "profile_path": null,
               "id": 1266628,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Policeman",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd1f5",
               "name": "Reginald Gardiner",
               "profile_path": "/97xWD5zL5UP7sTy3yAHMKgCxOiC.jpg",
               "id": 14029,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Floorwalker",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd1f9",
               "name": "Barnett Parker",
               "profile_path": "/b0ISw7aMM8gBUz04IIrYMWar7po.jpg",
               "id": 141520,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Member of The Foursome",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd1fd",
               "name": "J. Marshall Smith",
               "profile_path": null,
               "id": 1266629,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Member of The Foursome",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd201",
               "name": "L. Dwight Snyder",
               "profile_path": null,
               "id": 1266630,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Member of The Foursome",
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd205",
               "name": "Jay Johnson",
               "profile_path": null,
               "id": 1009902,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Member of The Foursome",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd209",
               "name": "Del Porter",
               "profile_path": null,
               "id": 1266631,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Sailor Quartette",
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd20d",
               "name": "The Foursome",
               "profile_path": null,
               "id": 1266632,
               "order": 18
            },
            {
               "cast_id": 26,
               "character": "Hector's Secretary (uncredited)",
               "gender": 1,
               "credit_id": "580de13fc3a368259f0189d9",
               "name": "Barbara Bedford",
               "profile_path": "/l38SsTAJXINLIaXpzZH3LR486gp.jpg",
               "id": 148527,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4667c3a36847f80fd1b5",
               "name": "Roy Del Ruth",
               "profile_path": "/vm5P5O0qcLYqhdPXw17U4CkBEsV.jpg",
               "id": 94218,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd1bb",
               "name": "Jack McGowan",
               "profile_path": null,
               "id": 132800,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4667c3a36847f80fd1c1",
               "name": "Sid Silvers",
               "profile_path": "/1LXtmHbWr0jePRs3s0eZJPTjRoc.jpg",
               "id": 227511,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "530eb33c925141733200033d",
               "name": "Jack McGowan",
               "profile_path": null,
               "id": 1011497,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "530eb35692514173780002fb",
               "name": "Sid Silvers",
               "profile_path": "/1LXtmHbWr0jePRs3s0eZJPTjRoc.jpg",
               "id": 227511,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "530eb36a925141739b000316",
               "name": "Buddy G. DeSylva",
               "profile_path": null,
               "id": 14972,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "582940959251417b260353d6",
               "name": "Ray June",
               "profile_path": null,
               "id": 16750,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.329184,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43872,
      "vote_count": 1,
      "budget": 0,
      "overview": "Sailor Ted meets and falls in love with Nora Paige, an aspiring Broadway show dancer, at the Lonely Hearts Club. After Ted rescues Lucy James' Pekinese during a public relations campaign on his submarine, Lucy falls in love with Ted; and Ted's captain orders him to meet Lucy for a date at a night club breaking a date with Nora. When she sees a picture of Ted and Lucy in the newspaper, Nora, who lives with Jenny and her daughter (Jenny's husband is Gunny), no longer wants anything to do with Ted.",
      "similar": [
         872,
         224141,
         11224,
         11631,
         114,
         812,
         15121,
         703,
         134,
         252,
         3933,
         18947,
         19404,
         46195,
         254470,
         11970,
         10020,
         342473,
         194662,
         196867
      ],
      "original_title": "Born to Dance",
      "runtime": 106,
      "poster_path": "/70AuRQClUSOZayCJ4EerulG2Z0R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1936-11-27",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "M*G*M's successor to 'THE GREAT ZIEGFELD'",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Roy Del Ruth"],
      "runtime": 106,
      "synopsis": "The film's plot involves three submarine mates, Ted Barker (James Stewart), Gunny Saks (Sid Silvers), and Mush Tracy (Buddy Ebsen), arriving in New York City after four years at sea. The film opens as their sub reaches New York harbor with the sailors singing \"Rolling Home.\" Featured in the number are Gunny, Mush, Ted and a quartet called The Foursome. As many of the sailors receive liberty, Gunny and Mush were denied shore leave until their Captain sends them to deliver a letter to Rear Admiral Stubbins. Nora Paige (Eleanor Powell), a singer and dancer, who has just lost out on a Broadway show, enters the Lonely Hearts Club suitcase in hand. The club's receptionist, Jenny (Una Merkel), offers to share her apartment with Nora. When she introduces Nora to the others at the club, Nora demonstrates her talents by singing and dancing to \"Rap Tap on Wood\" (Miss Powell's vocals are dubbed by Marjorie Lane). Also featured was The Foursome, a quartet of harmony singers, who also play a penny whistle and different sizes of ocarinas (also known as sweet potatoes). Ginny tells Nora about her marriage to a sailor who was her partner in a twenty-eight day marathon dance. They conceived a daughter, Sally, in the two days they had together before he shipped out and she never told the guy he was a father. That guy was Gunny, who is anxious to rekindle a relationship with his wife. Meanwhile, Mush falls for a talented singer/waitress, Peppy Turner (Frances Langford). Romance enters Nora's life in the form of Ted Barker. At their first meeting at the Lonely Hearts Club, Ted sings \"Hey, Babe, Hey\" to Nora as they dance. Then several other members of the cast sing a chorus including Nora, Gunny, Ginny, Peppy, Mush and the Foursome. The number ends with the sailors and their girl friends tap dancing. Later, Captain Percival Dingby (Raymond Walburn) announces Lucy James (Virginia Bruce), a famous actress, is coming aboard the sub. The men sing about her arrival. Once she comes aboard with her cute little dog under her arm, Miss James sings \"Love Me, Love My Pekinese.\" During a photo session with the Captain, he drops her dog overboard; all the sailors dive in to rescue the pup. The next days newspaper features a photo of Ted handing the soaked dog to Miss James. McKay, her agent, immediately plots to cook up a romance between Ted and Lucy to generate publicity for her new show. The next scene is one of the most, if not the most, famous musical sequence from the film. Ted begins crooning \"Easy to Love\" to Nora as they stroll in Central Park. After they kiss, Nora sings; they kiss again and she dances while Ted conducts an imaginary orchestra. A Central Park policeman (Reginald Gardiner) takes over the symphony maestro role as he directs the imaginary orchestra in a combination of Ponchielli's \"Dance of the Hours\" and \"Easy to Love.\" By the end of the number, the policeman/conductor keels over in a dead faint. Lucy and McKay arranged with Captain Dingby for Ted to have dinner with Lucy at the Club Continental. The evening's entertainment was Georges and Jalanas (Georges and Jalana appeared as themselves) ballroom dancing to \"I've Got You Under My Skin.\" Ted had told Nora he would meet her later in Central Park, but, after waiting far past the appointed time, Nora dejectedly leaves. The next morning's newspaper features a photo of Ted and Lucy together, which, of course, disturbs Nora. When Ted calls to apologize, she hangs up on him. Ted goes to McKay's office to bargain with him to give Nora a job in Lucy's new production, but he doesnt want Nora to know about their arrangement. McKay makes her Lucy's understudy. Ginny, Sally, and Nora visit the sub, but Ginny still isn't sure she wants Gunny to know he has a daughter, so Nora claims Sally as her child. Ted assumes Nora is married and backs off. Lucy begins to care for Ted and refuses to allow any further publicity about their relationship. She says if any more articles or photos appear in the newspapers she won't perform on opening night. During Ted's visit to Lucy's apartment, she confesses her increasing affection towards him by singing the film's most famous song, \"I've Got You Under My Skin.\" Peppy Turner reprises \"Easy to Love\" in a rehearsal of Lucy's show while the limber-limbed Mush, now out of the Navy, dances around her. Lucy gets more and more upset. She doesnt like a costume and thinks the song's arrangement is undanceable. McKay asks Nora to dance to the arrangement, which she does brilliantly. When Lucy realizes what is happening, she demands McKay fire Nora, which, reluctantly, he does. Ginny confesses to Ted, who is also out of the Navy now, that Sally is her child, not Nora's and that Nora loves him. She also tells him about Nora getting fired from the show. Ted calls the press and gives them a cooked up story. When the next morning headlines proclaim that Lucy James is going to marry an ex-sailor, she stays true to her threat and won't go on (which means, of course, that her understudy, Nora, would become the show's star). The film's finale is a gigantic production number from the show, \"Great Guns.\" Set on an Art Deco battleship, it opens with Peppy singing \"Swingin' the Jinx Away,\" backed by a male chorus of singers and dancers. After some acrobatics by sailors, Mush takes his turn with the tune as he sings and dances backed by a female chorus of singers and dancers in front of the ship's stylized guns. After more singing by the male and female chorus, Peppy and the Foursome perform more of the song. Finally, Nora makes her entrance down the spiral stairs of the ship's superstructure and then slides to the stage via a pole. Dressed in a stylized drum major outfit, she taps to \"Swingin' the Jinx Away\" and then leads the band and chorus in \"Hurrah for the Red, White and Blue,\" a very patriotic finale for a non-wartime movie. Just before the credits roll, Ted congratulates Nora on a splendid performance and Ginny finally tells Gunny he's a father (unfortunately, he has already signed up for four more years in the Navy).",
      "writers": [
         "Jack McGowan",
         "Sid Silvers"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0027387/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5Njk4MjgwOF5BMl5BanBnXkFtZTcwNDQ5MTE2MQ@@._V1_SY317_CR23,0,214,317_AL_.jpg",
      "actors": ["Stars: Eleanor Powell, James Stewart, Virginia Bruce | See full cast and crew »"],
      "reviews": [
         "BORN TO DANCE (Metro-Goldwyn-Mayer, 1936), directed by Roy Del Ruth, is, according to its title, one starring Eleanor Powell as the one born to dance. Being the third in the series of Navy musicals produced within the year, following SHIPMATES FOREVER (Warners, 1935) with Dick Powell and Ruby Keeler; and FOLLOW THE FLEET (RKO, 1936) with Fred Astaire and Ginger Rogers, the title \"Born to Dance\" translates itself as a musical, whether a song and dance or backstage story, being a combination of both, it gives no indication as one with a U.S. Navy background. Regardless, BORN TO DANCE ranks the best of the trio, thanks to a fine score by Cole Porter, witty dialogue, particularly from the secondary characters (Sid Silvers and Una Merkel), as well as the very young James Stewart surprisingly effective singing through his soft-spoken Fred Astaire-ish style of vocalizing. The second of its annual Eleanor Powell musicals, BORN TO DANCE brings back her co- stars from her initial MGM musical, Broadway MELODY OF 1936, including Sid Silvers, Una Merkel, Frances Langford and Buddy Ebsen, with Virginia Bruce substituting for June Knight as the temperamental actress. As an added plus Frances Langford, who, in Broadway MELODY of 1936, only participated in the song numbers, this time gets to belt out her songs and take part of the plot. Following the opening titles with a background of musical notes (yes, this is a musical) and still silhouette dancing images of Eleanor Powell, the story opens with singing sailors submerging from a submarine and going on shore leave in New York City. Ted Parker (James Stewart) meets Nora Paige (Eleanor Powell) at a Lonely Hearts Club, managed by Jenny Saks (Una Merkel), who is married to a Ted's fellow Navy partner, \"Gunny\" (Sid Silvers), whom she hasn't seen in four years, and through him, is the mother of a three-year-old daughter (Juanita Quigley). While Jenny finds Gunny to be a big disappointment to her, and unwilling to tell him that he is a father, Ted finds himself becoming very much interested in Nora, whose ambition is to become a dancer (hense the title). Their romance is soon broken up when Lucy James (Virginia Bruce), a famous musical-comedy star, along with her press agent, James McKay (Alan Dinehart), visits Ted's ship for publicity pictures, and after her Pekinese dog falls over board with Ted jumping in to save it, McKay then makes a romance story out of it. Ted finds his time being occupied being with Lucy, and away from Nora. However, Ted arranges for Nora to get into Lucy's upcoming show as her understudy without either girl being aware as to whom was responsible for this arrangement. As Ted is going through his complications such as believing Nora to be a mother to Jenny's little girl, there is \"Mush\" Tracy (Buddy Ebsen) who finds time in becoming the romantic interest of another Lonely Hearts Club employee, \"Peppy\" Turner (Frances Langford). Song numbers include: \"Rolling Home\" (sung by the Foursome Quartet, Sid Silvers, Buddy Ebsen and James Stewart); \"Rap-Tap on Wood\" (sung and danced by Eleanor Powell); \"Hey Babe, Hey Babe\" (sung by James Stewart, Eleanor Powell, Sid Silvers, Una Merkel, Buddy Ebsen and Frances Langford); \"Here Comes Lucy James\" (sung by sailors); \"The Captain Had a Very Bad Night Last Night\" (recited by Raymond Walburn); \"Love Me, Love My Pekinese\" (sung by Virginia Bruce/ chorus); \"Easy to Love\" (sung by James Stewart & Eleanor Powell); \"I've Got You Under My Skin\" (danced by George & Jalna/ sung by Virginia Bruce); \"Easy to Love\" (sung by Frances Langford/ danced by Buddy Ebsen); \"Love Me, Love My Pekinese\" (audition dance by Eleanor Powell); \"Swinging the Jinx Away\" (sung by Frances Langford/ with Buddy Ebsen/ danced by Eleanor Powell); and \"Easy to Love\" (sung by cast). The other members of the cast consists of Raymond Walburn, Barnett Parker, Jonathan Hale and Reginald Gardiner, making his movie debut, in an awkward but amusing cameo as a policeman in Central Park who fantasizes himself as conducting to the score to \"Easy to Love\" with an unseen orchestra (only in New York!). As with Powell's other \"Broadway Melody\" series, BORN TO DANCE includes moments of singing and dancing on cue, with a full orchestra playing in the background, whether it be at the Lonely Hearts Club, on the Navy vessel or in the middle of Central Park. Comedy also takes its toll in BORN TO DANCE, including Walburn as the confusing captain who can't distinguish the difference between the very tall Mush (Ebsen) and the ultra short Gunny (Silvers), asking them if they are twins, and in giving an assignment for Mush deliver an important message to a Rear Admiral Stubbins at the Brooklyn Navy Yard. Mush, however, keeps forgetting, and when he does remember, can't find Brooklyn and ends up in Yonkers; as well as Helen Troy's classic bit as sharp-tongue Brooklyn-ese switchboard operator. Troy must have been an inspiration for Lily Tomlin's comedic character in later years when appearing as a telephone operator in the late 1960s variety comedy show of LAUGH-IN. BORN TO DANCE is light on plot, memorable on songs and well constructed with dance numbers as choreographed by Dave Gould, highlighted by the lavish but classic 13 minute finale of \"Swingin' the Jinx Away\" (portions would be reused again for the finale in Eleanor Powell's latter 1943 musical titled I DOOD IT, newly re-scored to appeal more to the big band era for the time of its release). Other than having its presentations on commercial television some decades ago, the original soundtrack recording to BORN TO DANCE was displayed in record stores in the late 1970s. If there is any Eleanor Powell worth seeing, it's BORN TO DANCE, by all means, that's what she was, and does it well. Available viewing on Turner Classic Movies. (***1/2)",
         "This is one of the all-time corny movies ever made, especially since it features Jimmy Stewart singing. How often have you seen/heard that? Actually, the \"corn\" is the fun of this film, and I enjoyed watching this more the second time knowing it was going to be so corny. Some of the lines in here are legitimately funny, particularly by cute Una Merkel, who could zing 'em with the best. She was fun, as was her husband in here, \"Gunny Sacks,\" played by Sid Silvers. Those two, plus Buddy Ebsen and Eleanor Powell make for a likable cast. Both Powell and Ebsen were great dancers, too, with Powell, of course, being the more famous. This is just a nice, old- fashioned film, probably more for older folks, but who knows?",
         "Even though they look like brother and sister, Jimmy Stewart and Eleanor Powell ease into one of the most endearing and uplifting love affairs in musical film. If you've ever tap danced, even a little bit, you'll want to put on those old taps and chew up the kitchen linoleum when Eleanor effortlessly goes at it. And who cares if long after a song keeps humming in your head, as long as it's \"Easy To Love\" or \"I've Got You Under My Skin\". Wouldn't this film have been so much less in color?",
         "This is a film that has a minimum plot. Sailors chase girls and along the way, everybody sing and dance. Eleanor Powell shows her talent, tapping in a spetacular specialty number called `Swinging the Jinx Away'. A young James Stewart warbles `Easy to Love' in a charming way. But the real curiosity is to watch Buddy Ebsen. I bet that many people that watched him in TV series such as Beverly Hillbillies and Barnaby Jones didn´t had a clue that in his youth he was a very acomplished dancer. The songs by Cole Porter are top notch and `I've got you under my Skin' and `Easy to Love' became standarts. If you like 30's musical, is well worth to take a look in Born To Dance.",
         "With Born to Dance MGM succeeded in combining two musical types, the sailor story with the Broadway opening night story. Although the plot is down right silly, that hardly makes Born to Dance unique back in its day. What you take from it is the wonderful singing and dancing and the glossy production values of an MGM musical. And of course Cole Porter's score. It contains two of his most beloved standards, Easy to Love and I've Got You Under My Skin. The rest of the score is serviceable for the plot. I particularly like Hey Babe Hey in which all the principals of the plot participate. How they got James Stewart to dance must have been a challenge. Of course Born to Dance is famous for Easy to Love being introduced by James Stewart. Stewart had always maintained that the proof of Easy to Love being a great song is that it survived his singing of it to become a great popular standard. His singing is adequate, but for the life of me, I'll never understand why Allan Jones who was up for the part wasn't picked. Especially since I've heard Allan Jones's contemporary recording of Easy to Love. Stewart is all right, but the part isn't exactly a stretch for his thespian talents and for cryin' out loud, Jones was one of the best movie singers ever. The other standard is introduced by Virginia Bruce, spoiled mantrap of a Broadway musical star who takes a shine to Stewart after he saves her Pekingese from drowning while Bruce is visiting his ship at the Brooklyn Navy Yard. Bruce sings I've Got You Under My Skin directly to Stewart with a come hither glance to lure him from Eleanor Powell who is her show's understudy. Borrowing from Hit the Deck with a plot of three sailors and three civilian women, Born to Dance pairs off Stewart with Powell, Buddy Ebsen with Frances Langford, and Sid Silvers with Una Merkel. Raymond Walburn is at his avuncular best as the ship's captain who keeps entrusting Silvers and Ebsen to deliver a message to the Admiral and they keep getting sidetracked by their women. With Powell as the understudy to Bruce and them both vying for Stewart, you can readily guess how this story will resolve itself. Eleanor dances divinely, especially in the finale number Swinging the Jinx Away which Frances Langford sings and Buddy Ebsen also dances. With all the talent involved and a plot which is a walking cliché, but easy to take, it's easy to love Born to Dance as I do.",
         "If ever a person was truly \"born to dance,\" it was Eleanor Powell--the first of MGM's great dancing stars and a performer still considered by many to be the single finest tap dancer to emerge from Hollywood. And with the 1936 film BORN TO DANCE, MGM offered Powell the single finest film of her entire career. Although extremely lightweight, the story of three sailors and their romantic complications has a very playful tone and witty script--which forms the perfect frame for a memorable score by the celebrated Cole Porter. The musical numbers are staged with a more subtle flash than one normally finds in 1930s musicals, and there are several complex ensemble numbers and the memorable \"Easy to Love\" and \"I've Got You Under My Skin.\" Not only was Powell a greatly gifted dancer, she was a clever comedian with a pleasing singing voice, and her playful performing style is particularly charming in such numbers as \"Rap-Tap on Wood\" and \"Swinging the Jinx Away.\" Her leading man, somewhat surprisingly, is none other than James Stewart--and although he wasn't really a singer or a dancer he does extremely well with both, and he and Powell make a very entertaining couple. The entire cast is their equal, with Phil Silvers and Una Merkle amusing as bickering lovers, Buddy Ebsen demonstrating his remarkable talents as both eccentric dancer and clever comic, and Virginia Bruce the perfect femme fatale. Everything about the film sparkles and shines, right down from the sets to the polished performances. If you enjoy classic musicals of the 1930s, BORN TO DANCE is a must have! Strongly recommended. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "Eleanor Powell has come to New York to make it, and make it she does in \"Born to Dance,\" a 1936 musical also starring James Stewart, Virginia Bruce, Buddy Ebsen, Una Merkel, and Sid Silvers. There's not much of a story, and not much of one is needed. Newcomer to the big city Nora Paige (Powell) meets sailor Ted (Stewart). They fall in love; meanwhile, she gets into a show understudying the lead, the great Lucy James (Bruce). Ted saves Lucy's Pekinese when it jumps into the water, and the producers use that for publicity, cooking up a romance between Ted and Lucy. Nora is heartbroken, believing that Ted is cheating on her. They fight. Lucy ends up walking out of the show; Powell then becomes the star - you can guess the rest. Certainly this is a wonderful score, one of the best, with the wonderful \"Easy to Love,\" \"I've Got You Under My Skin,\" \"Rolling Home,\" \"Rap-Tap on Wood,\" and others. The surprise of the cast is James Stewart, singing in a Fred Astaire sort of way - he's delightful, very musical, with a sweet voice that goes well with his boyish demeanor. Eleanor Powell is one of the great film tap dancers, and she gets to do a lot of numbers. She's a very pretty woman with a wide smile. I find her non-tap work a little odd, as her choreography always seems to include a front kick which looks awkward. It's the kind of move that non-dancers like Raquel Welch do in nightclub acts and it doesn't really suit Powell. She is a very likable presence and it's really fireworks when she gets a-tappin'! Una Merkel, Sid Silvers, et al. provide excellent support and good comedy, which is abundant in the script that makes the most of dialogue even if the story is thin. Virginia Bruce is great as the glamorous Broadway star. She performs \"I've Got You Under My Skin,\" beautifully. Stewart sings \"Easy to Love,\" and I can still remember the look on Carol Burnett's face when he sang it to her many years ago, I believe on her TV show. She spoke of going to the movies with her grandmother and watching him on the screen. To have him sing that song to her was an overwhelming moment. It's one of the nicest scenes in the film, too, to see this tremendous star when he was so young and fresh. This is simply a wonderful walk - or should I say tap - down memory lane. Don't miss it.",
         "From the rollicking opening of the camaraderie of a returning U.S. submarine crew to the booming \"Great Guns\" of the movie's finale, it's easy to understand why this movie was an antidote to the Depression Era. I personally discovered Eleanor Powell for the first time in this movie. She sure knows how to dance! Jimmy Stewart, who plays a clean cut sailor in this film, shows his talent, not just as an actor but as a singer and dancer as well. A little known Sid Silvers, who plays \"Gunny Saks\"in this movie is a short, stocky energetic dynamo who probably deserves more recognition, also is credited for the screenplay of the movie. Another actress I discovered for the first time when I saw this movie was Virginia Bruce and she is captivating in the musical number aboard the submarine with her Pekingese companion, \"Cheeky\". I had recognized the name but another actress who I had little knowledge of was Frances Langford and she is natural to dance with the young boot scooting Buddy Ebson. All of the other character actors in this film are a joy to see. The no-expense-spared musical number at the end of this movie is inspiring. Out of all the movies, I own, I watch this one over and over again, especially when I'm in a good mood.",
         "(Spoilers, sort of) If \"Born To Dance\" distinguishes itself in any particular way, it's in the film's budget. Probably the most stock plot in depression-era musicals was sailors-on-leave meeting girls. Stage shows like SHORE LEAVE and HIT THE DECK began the trend, and it would continue into the 30's and 40's with films like FOLLOW THE FLEET, SKIRTS AHOY, and ON THE TOWN. In this case, navy man Jimmy Stewart (you have to call him 'Jimmy;' he looks like he's only about 19 years old) meets aspiring dancer Powell at a Lonely-Hearts boarding house, with fine support from the extremely gangly Buddy Ebsen and semi-newlyweds Una Merkel and Sid Silvers (who offer an interesting subplot as kids who impulsively married immediately before he shipped out- and four years later really don't know each other and are parents of a 3-year-old). But make no mistake; this is one of those richly-produced MGM extravaganzas with fine Cole Porter music and competent Roy Del Ruth direction. The film's two big centerpieces are Stewart crooning \"Easy To Love\" to Powell in a park (a scene much remembered from the 1974 documentary THAT'S ENTERTAINMENT!) and the finale, which shows understudy Powell finally getting the lead in the show (42nd STREET, anyone?) to the song \"Swingin' The Jinx Away.\" This number has to be seen to be believed. Others have already acknowledged the 12 minute length of the number; in that passage of time you have a swing band gliding across the stage with chorus girls, a vocal by Frances Langford, a dance reprise by Ebsen, and finally Powell in nautical sequins sliding down a firehouse pole, conversing in taps, lunges, and 170-degree kicks all around the stage, and finally flipping into a salute in close-up as cannons fire into the camera in an all-encompassing pullback shot. When it's all over you'll need a stiff drink, I promise you.",
         "There are so many reasons to like this musical comedy. Firstly, the Cole Porter songs. Secondly, the bits with character actors: Charles Trowbridge as a model home spokesman with stiff upper lip (movie butlers probably took notes); Reginald Gardiner as a policeman in Central Park who conducts an invisible orchestra (his wild, flopping hair and frantic moves are much like Danny Kaye as a music teacher in The Secret Life of Walter Mitty, 1947); Helen Troy as McCoy's telephone operator must be the inspiration for Lily Tomlin's snooty switchboard gal on Rowan & Martin's Laugh-In in the late 1960s; and Virginia Bruce singing 'Love Me, Love My Pekinese' is sheer Gilbert & Sullivan in its wit (the cast is smiling behind the lead stars because they know it's a very funny number. As for the stars, Elenore Powell is especially good at tap dancing and OK at singing. James Stewart has charm and good looks but hardly dances, and he sings much like Fred Astaire (who was a top-notch dancer). In fact, Elenore Powell, in this screenplay, is a dancer who's an understudy for a singer. This detail is never explained. This movie may have been a wellspring not only for comedy but also for a music video. The big finale number 'Swingin' The Jinx Away' is set on a typical musical comedy battleship, with its big guns pointing out at the camera. It looks like that idea was used for Cher's 1991 music video 'If I Could Turn back Time', only using a real battleship."
      ],
      "genres": [
         "Musical",
         "Comedy"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Sailor Ted meets at the Lonely Hearts Club of his friend Gunny's wife, Jenny, a girl, Nora Paige, and falls in love. Nora wants to become a dancer on Broadway. Ted rescues the Pekinese of Lucy James, a Broadway star during a public relations campaign on his submarine. Lucy falls in love with Ted, and Ted is ordered by his Captain to meet her in a night club, in spite of the fact that he has a date with Nora. Nora, who lives with Jenny and her and Gunny's daughter, doesn't want to hear anything from Ted, after she spotted a picture of Ted and Lucy in the morning paper. Lucy convinces her manager Dinehart to stop the press campaign and tells him that she would leave the production, if another photo or article of her and Ted is published. Nora has become her understudy, and she begins to think her behaviour to Ted over. Suddenly she is fired after Dinehart told her to dance a number Lucy James called undanceable. But when Ted is told the whole story, he knows what to do."],
      "budget": 0
   },
   "movielensId": 30776,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-11-27",
      "dvdReleaseDate": "2008-04-08",
      "directors": ["Roy Del Ruth"],
      "runtime": 106,
      "movieId": 30776,
      "title": "Born to Dance",
      "mpaa": "",
      "actors": [
         "Eleanor Powell",
         "James Stewart",
         "Virginia Bruce",
         "Una Merkel",
         "Sid Silvers",
         "Frances Langford",
         "Raymond Walburn",
         "Alan Dinehart",
         "Buddy Ebsen",
         "Juanita Quigley",
         "Georges",
         "Jalna",
         "Reginald Gardiner",
         "Barnett Parker",
         "J. Marshall Smith",
         "L. Dwight Snyder",
         "Jay Johnson",
         "Del Porter",
         "The Foursome",
         "Barbara Bedford"
      ],
      "imdbMovieId": "0027387",
      "originalTitle": "Born to Dance",
      "genres": [
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": ["-txGiUtVAjM"],
      "plotSummary": "Sailor Ted meets and falls in love with Nora Paige, an aspiring Broadway show dancer, at the Lonely Hearts Club. After Ted rescues Lucy James' Pekinese during a public relations campaign on his submarine, Lucy falls in love with Ted; and Ted's captain orders him to meet Lucy for a date at a night club breaking a date with Nora. When she sees a picture of Ted and Lucy in the newspaper, Nora, who lives with Jenny and her daughter (Jenny's husband is Gunny), no longer wants anything to do with Ted.",
      "tmdbMovieId": 43872,
      "avgRating": 3.3,
      "releaseYear": "1936",
      "numRatings": 5,
      "posterPath": "/70AuRQClUSOZayCJ4EerulG2Z0R.jpg"
   }
}