{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baltimore",
            "id": 2672
         },
         {
            "name": "coming of age",
            "id": 10683
         }
      ],
      "imdb_id": "tt0165859",
      "video": false,
      "title": "Liberty Heights",
      "recommendations": [
         63437,
         49803,
         38509,
         25576,
         20021,
         15720,
         15503,
         18856,
         38554,
         21887,
         55026,
         41971,
         14256,
         77223,
         40480,
         40506,
         67307,
         19150,
         36709,
         34615
      ],
      "backdrop_path": "/wQUoNGN7gxTEdwHbGYZoY0szU3o.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Van Kurtzman",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d259",
               "name": "Adrien Brody",
               "profile_path": "/zvMslH1C8xmEBpGgDsdzL797Rv.jpg",
               "id": 3490,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ben Kurtzman",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d25d",
               "name": "Ben Foster",
               "profile_path": "/kETVqU8PMDM44wM5mxPeegdGt2F.jpg",
               "id": 11107,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Little Melvin",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d261",
               "name": "Orlando Jones",
               "profile_path": "/7QOW3bgYjPxnjwrZDclmnJenhPH.jpg",
               "id": 18270,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ada Kurtzman",
               "gender": 1,
               "credit_id": "52fe4530c3a368484e04d265",
               "name": "Bebe Neuwirth",
               "profile_path": "/xm58rpMRVDHS0IGttw1pTlqGwkN.jpg",
               "id": 10739,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Nate Kurtzman",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d269",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Yussel",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d26d",
               "name": "David Krumholtz",
               "profile_path": "/5171elOp1qFxf9c8DkpeyhHBB6d.jpg",
               "id": 38582,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Charlie, Nate's Assistant",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d271",
               "name": "Richard Kline",
               "profile_path": "/zyerRkkzsuFMYaMOtkaNjb7t0P7.jpg",
               "id": 97065,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Pete, Nate's Assistant",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d275",
               "name": "Vincent Guastaferro",
               "profile_path": "/8ABrbH97eeImEWLcZgUBsCGgvml.jpg",
               "id": 97068,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Trey Tobelseted",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d279",
               "name": "Justin Chambers",
               "profile_path": "/uh40a9Fv2PJ4nZHEZwsI5g0KiNj.jpg",
               "id": 20746,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Dubbie the Blonde",
               "gender": 1,
               "credit_id": "52fe4530c3a368484e04d27d",
               "name": "Carolyn Murphy",
               "profile_path": null,
               "id": 97072,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Sylvia's Father",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d281",
               "name": "James Pickens Jr.",
               "profile_path": "/iddDcaysDQ6IVMUjJ97Bv3lTBCu.jpg",
               "id": 25544,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Grandma Rose",
               "gender": 0,
               "credit_id": "52fe4530c3a368484e04d285",
               "name": "Frania Rubinek",
               "profile_path": null,
               "id": 97074,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Scribbles",
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d289",
               "name": "Anthony Anderson",
               "profile_path": "/xcMJimUAcQJGCSw25je1TLMy8rC.jpg",
               "id": 18471,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Annie the Stripper",
               "gender": 1,
               "credit_id": "52fe4530c3a368484e04d28d",
               "name": "Kiersten Warren",
               "profile_path": "/nzbUkAYhC6x3Zwdmm93nusN5vg6.jpg",
               "id": 23504,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Sylvia",
               "gender": 1,
               "credit_id": "52fe4530c3a368484e04d291",
               "name": "Rebekah Johnson",
               "profile_path": "/v3Mg3DvZewaah5GPz0f4A5tAmL.jpg",
               "id": 78596,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Ted",
               "gender": 2,
               "credit_id": "58a9481ac3a3680bdc0036b1",
               "name": "Shane West",
               "profile_path": "/58qjzrYQOL2YfRvUdH2wL1ttIHK.jpg",
               "id": 81295,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Gail",
               "gender": 0,
               "credit_id": "5a1ad47dc3a3680b8803ee7d",
               "name": "Cloie Wyatt Taylor",
               "profile_path": "/oJJZveBomfm8JoeSSCMG4uzYVQI.jpg",
               "id": 1465285,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d24f",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4530c3a368484e04d255",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.447476,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27141,
      "vote_count": 19,
      "budget": 0,
      "overview": "Anti-Semitism, race relations, coming of age, and fathers and sons: in Baltimore from fall, 1954, to fall, 1955.",
      "similar": [
         84892,
         398818,
         449176,
         11421,
         26371,
         308369,
         152584,
         376660,
         1391,
         9779,
         11887,
         2105,
         10229,
         14,
         112160,
         76726,
         376867,
         391713,
         85350,
         281007
      ],
      "original_title": "Liberty Heights",
      "runtime": 127,
      "poster_path": "/o9lUIJWeSWGtgw9xVH1GtpvwWcI.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Baltimore Spring Creek Pictures",
            "id": 14719,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-11-17",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "You're only young once, but you remember forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Barry Levinson"],
      "runtime": 122,
      "synopsis": null,
      "writers": ["Barry Levinson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1NTc3NTAzM15BMl5BanBnXkFtZTcwNjk0NTYyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Adrien Brody, Bebe Neuwirth, Joe Mantegna | See full cast and crew »"],
      "reviews": [
         "LIBERTY HEIGHTS (LH) is a fine addition to writer/director Barry Levinson's series of nostalgic autobiographical Baltimore-set films. This episodic but heartfelt comedy-drama, set in the mid-1950s, stars Adrien Brody and Ben Foster as brothers Van and Ben Kurtzman, who come of age while grappling with anti-Semitism, their loving dad's (Joe Mantegna) shady business dealings (he runs both a burlesque house and a low-profile numbers racket. My late dad, a bookie, would've loved this guy! :-), racism (Ben and his pretty black classmate Sylvia, appealingly played by Rebekah Johnson, start seeing each other on the sly), and classism (Van falls hard for blonde WASP dream girl Dubbie, who turns out to be a nightmare -- a tragic figure, in fact -- but is capably played by supermodel Carolyn Murphy in her first and, to date, only film role that I know of). While LH isn't quite as sharp and knowing as Levinson's modern classic DINER (with which LH would make an interesting double feature; the DVD includes the DINER trailer, by the way), it's rendered with great affection and attention to detail about the characters, their world, and the changing times they're living in. For me, the wittier moments really made the film -- Ben's anarchic streak livens things up, to say the least! Best Ben moments: 1) his scandalizing his family by dressing as Hitler on Halloween; 2) the act of defiance he and his friends eventually pull at the \"NO JEWS...\" pool; and 3) the tender yet chaste kiss he gives Sylvia at graduation, freaking out both sets of parents. LH is worth a rental, at the very least!",
         "this was a fine film, if not anything to blow one's hair back, leave one humming, or slipping into the dialogue. The story was set in the mid-1950s, accurately looks the part, and is actually three tales involving the three males in a middle class family. Yes, there is the treatment of racism and the self-consciousness that it spawns on both sides, and yes, the death throes of anti-semitism (at least among decent people). A middle-aged man finds he has outlived the world in which he came to prosper, and does not know what to do. There is something else: the \"grass is always greener\" hypothesis in ethnic/social class mixing. One of the protagonists meets his \"shiksa goddess\" and her lot, longs to cross a divide he does his best to bridge -- and finds his betters have feet of clay for all their poise and social standing. LIBERTY HEIGHTS is in the best sense a North American story. Leaving one's ghetto, the benefits of learning to do so, and creation of a better world. Note how toward the end, the flawed and even cruel W.A.S.P. society boy becomes better for having accepted the hand of friendship of someone his father might have avoided.",
         "In Baltimore, 1954, the Kurtzman family is a Jewish family living in the area of Liberty Heights. Ben (Ben Foster) is a rebel teenager, who has a crush on his black friend Sylvia (Rebekah Johnson). His college brother Van falls in love with Dubbie (Carolyn Murphy \u0096 why this gorgeous actress has just this movie in her filmography?), a very problematic girl. He becomes friend of Trey Tobelseted (Justin Chambers), a young man from a very wealth family and boyfriend of Dubbie. Nate (the excellent Joe Mantegna) is the father, who lives from an illegal lottery of numbers. Nate loves his family and keeps them apart of his legal problems. Ada (Bebe Neuwirth) is the mother, who keeps the tradition of their family. Little Melvin (Orlando Jones) is a drug dealer, who wins a fortune of US$ 100,000 (in 1954) in Nate's lottery, raising a serious situation in the plot. This movie is wonderful: the soundtrack, photography and costumes are marvelous. The story, about segregation of Jews and blacks and love between races, is very beautiful. The viewer will not be disappointed with this entertainment. My vote is eight.",
         "This movie is sort of like the concept of the TV show Seinfeld-- it's about nothing. By this I don't mean that it lacks substance, in fact, it has plenty, but I mean rather that it does not involve an intense plot line. It's more like a series of snapshots taken out of one family's album, like a brief recording of one year in their lives. It's as if these people were real, simply going about their lives in their times, and we got to peek in on them, and it is acted in just that way. I think it's very true to director Barry Levinson's vision, a vision that is clear upon viewing his other films that he includes with Liberty Heights as his \"Baltimore\" films. These include Diner, Avalon, and Tin Men. Because this is not the typical problem arises-conflict ensues-climax is reached-conclusion is found film, Levinson shows us that these people's lives were a series of ups and downs, joys and losses, that summarize American middle-class youth in all ages in history. There connections between the different walks of life and the idea of growing up and discovering diversity around you is what makes this film universal and beautiful, all without handing you morals and themes on a silver platter. This film takes a wonderfully objective viewpoint that allows you to make meaning of it rather than spelling it out for you.",
         "From time to time one comes across remarkable films like Liberty Heights where simple story is told in extraordinary manner. This film is about the Jewish Kurtzman family, but we follow the father and his two sons as three separate stories. Each one of them having their own struggle and challenges to face. What struck me as the most amazing part of the story was the easiness of it, how it flowed and gently tackled serious issues in the community of that time. It portrait itself in a realistic manner, where there were no real baddies or large showdown, just people going through life. The performance of the actors was brilliant, with Joe Mantegna (the father), showing once more what a talent he is. This film won't leave anyone untouched. 8/10",
         "I found \"Liberty Heights\" an immensely entertaining movie which shows great talent, especially actor-wise. The movie is a great portrayal of how things looked like in America in the 50's, showing religious, racial, social and other differences and also showing how these differences can easily be overcome once a person realizes(or as was the case in this movie-doesn't even consider) that different only and always means worse. Ben Foster steals the show from the first scene and Adrien Brody is in close second place. And because they had such screen persona, or power if you will, I found if distracting and a bit out of place when at the end the story shifted too much to Joe Mantegna, their movie father. I have much respect for the man, he's an immense and always fun-to-watch actor, but in this movie it was him that was overshadowed, which is ironic since HE was the one who usually did this. A great, lightheaded growing-up movie that begins and ends with a nostalgic note, once again making me wish I'd have a chance to live in that day and age. Much praise to Barry Levinson for composing \"Liberty Heights\". 8/10",
         "Liberty Heights illustrates Anti Semitism and race relations in the 1950's very well. It shows how two Jewish brothers find that there is a whole different world outside their insular Jewish community. Liberty Heights is an excellent film. Barry Levinson has created a gem of a film, another of the Baltimore series.",
         "This movie is challenging on many levels and best of all is it does not insult the viewer's intelligence with pat plot lines and easy resolutions. It is very much a slice of life movie and provokes serious thought about growing up and the meaning of prejudice and racial barriers. It is a lovely film and I have resolved to see some other efforts from Barry Levinson as his is a rare talent. He lovingly captures Baltimore in the fifties in all its facets of neighbourhoods, the cast is stellar, not a false note among them, the music is wonderful and all the plot lines come together. I felt sad that it was over, I found myself quite involved with the characters who were multi dimensional with teasing snippets of background as in the disturbed Dubbie saying to Van she did not like spending time with her father and his boyfriend. And Sylvia's family being black and wealthiest by far than the others and she was following her mother and grandmother into a Black College so she could preserve the continuance. 8 out of 10. Recommended.",
         "This was a wonderful movie about coming of age. The characters in the movie were SO real, even though they were in high school in the '50s. Just shows how little people change in nature. The movie followed three story lines very well: the older brother, the younger brother, and the father. They all had difficult-to-them things to deal with and each learned something valuable in the process, both about themselves and the world in which they lived. Integrating the three story lines was done flawlessly. The movie was also very tastefully done -- a very wholesome movie in a world of trashy movies.",
         "While hardly the gems that are Diner, and especially Avalon, Levinson here offers another sweet meditation on his Baltimore roots. The love story between Ben and Sylvia is especially moving to every white boy who ever fell in love with a black girl before it was acceptable, and most of the credit goes to the enchanting Rebekah Johnson. Older brother Van's travels in WASPland are more cliche-ridden, though one must salute the acting of Adrien Brody and his friend Trey, who actually make their unlikely friendship believable. Trey's deb girlfriend is pure cardboard. The real standouts here are Joe Mantegna and Orlando Jones going toe-to-toe in dangerously caricaturish territory. Both manage to pull it off. One anachronistic comment- Scribbles calls one of Nick's men the Pillsbury Jewboy--far as I know that advertising icon didn't appear till 10 years after the film's 1954-55 setting. Again, no one will call this film a classic, but seen as part of a 4 film whole (Tin Men is more the aberration than Liberty Heights) it stands proudly and pulls at these 40 year old heartstrings from a very similar North Bronx background."
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Baltimore Pictures",
         "Spring Creek Productions"
      ],
      "summaries": ["Anti-Semitism, race relations, coming of age, and fathers and sons: in Baltimore from fall, 1954, to fall, 1955. Racial integration comes to the high school, TV is killing burlesque, and rock and roll is pushing the Four Lads off the Hit Parade. Ben, a high school senior, and his older brother Van are exploring \"the other\": in Ben's case, it's friendship with Sylvia, a Black student; with Van, it's a party in the WASP part of town and falling for a debutante, Dubbie. Sylvia gives Ben tickets to a James Brown concert; Dubbie invites Van to a motel: new worlds open. Meanwhile, their dad Nate, who runs a numbers game, loses big to a small-time pusher, Little Melvin; a partnership ensues."],
      "budget": 0
   },
   "movielensId": 3078,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         ""
      ],
      "releaseDate": "1999-11-17",
      "dvdReleaseDate": "2000-06-20",
      "directors": ["Barry Levinson"],
      "runtime": 127,
      "movieId": 3078,
      "title": "Liberty Heights",
      "mpaa": "R",
      "actors": [
         "Adrien Brody",
         "Ben Foster",
         "Orlando Jones",
         "Bebe Neuwirth",
         "Joe Mantegna",
         "David Krumholtz",
         "Richard Kline",
         "Vincent Guastaferro",
         "Justin Chambers",
         "Carolyn Murphy",
         "James Pickens Jr.",
         "Frania Rubinek",
         "Anthony Anderson",
         "Kiersten Warren",
         "Rebekah Johnson",
         "Shane West",
         "Cloie Wyatt Taylor"
      ],
      "imdbMovieId": "0165859",
      "originalTitle": "Liberty Heights",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["5HHBBSRr2KY"],
      "plotSummary": "Anti-Semitism, race relations, coming of age, and fathers and sons: in Baltimore from fall, 1954, to fall, 1955.",
      "tmdbMovieId": 27141,
      "avgRating": 3.52229,
      "releaseYear": "1999",
      "numRatings": 830,
      "posterPath": "/o9lUIJWeSWGtgw9xVH1GtpvwWcI.jpg"
   }
}