{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "godzilla",
            "id": 7671
         },
         {
            "name": "kaiju",
            "id": 161791
         }
      ],
      "imdb_id": "tt0061856",
      "video": false,
      "title": "Son of Godzilla",
      "recommendations": [
         3115,
         19336,
         38582,
         39462,
         19545,
         39464,
         3107,
         15766,
         3160,
         1682,
         18289,
         39264,
         1679,
         39256,
         19333,
         15767,
         36243,
         18983,
         1680,
         39465
      ],
      "backdrop_path": "/ynPqCZDLkXu7DLAfnFoIyO4eEsb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Kusumi",
               "gender": 0,
               "credit_id": "52fe478b9251416c7509d441",
               "name": "Tadao Takashima",
               "profile_path": "/4hR77rR15N8I74f7XB8bhEEERcU.jpg",
               "id": 18612,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Goro Maki",
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d445",
               "name": "Akira Kubo",
               "profile_path": "/twe3lU2nP2sVphNgpQ1JySEpdGr.jpg",
               "id": 30469,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Riko (Saeko) Matsumiya",
               "gender": 0,
               "credit_id": "52fe478b9251416c7509d449",
               "name": "Bibari Maeda",
               "profile_path": "/3bHLT5tC3isTPWZZJDGKx7yK1DO.jpg",
               "id": 83361,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Fujisaki",
               "gender": 2,
               "credit_id": "557dc83ac3a36821a1000117",
               "name": "Akihiko Hirata",
               "profile_path": "/hfJ3M03wlP0lhXpPRejONiKXfg0.jpg",
               "id": 30568,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Fujisaki",
               "gender": 2,
               "credit_id": "557dc84f9251410a2a00010c",
               "name": "Yoshio Tsuchiya",
               "profile_path": "/mU0dJP8dZxSucRTung1mZmL2TDh.jpg",
               "id": 17540,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Morio",
               "gender": 2,
               "credit_id": "557dc861c3a36821b0000115",
               "name": "Kenji Sahara",
               "profile_path": "/544eLJEuliVTsxQ27DGCSSh99bV.jpg",
               "id": 18613,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Ozawa",
               "gender": 2,
               "credit_id": "557dc88bc3a36821b000011c",
               "name": "Ken'ichirô Maruyama",
               "profile_path": "/lzf4OQhGU6hyxGN6FkhlEksIQoA.jpg",
               "id": 1477239,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Tashiro",
               "gender": 0,
               "credit_id": "55934212c3a36869e8001a97",
               "name": "Seishirô Kuno",
               "profile_path": "/uz83PPbmGjTgm0HaGDzSYqPvnea.jpg",
               "id": 119000,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Suzuki",
               "gender": 0,
               "credit_id": "55934e42925141674c000597",
               "name": "Yasuhiko Saijô",
               "profile_path": "/cvoSGiryPENHTiD5oHqOV7nONJ6.jpg",
               "id": 1200237,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Navigator",
               "gender": 2,
               "credit_id": "55934e519251415df8002bd2",
               "name": "Susumu Kurobe",
               "profile_path": "/iMRdCBvpP7KPpb9EVNFWcAoEyL2.jpg",
               "id": 129509,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Pilot",
               "gender": 0,
               "credit_id": "55934e5dc3a36804f3001881",
               "name": "Kazuo Suzuki",
               "profile_path": "/yzeSTcbZ9bATL1Njp1oUrpUjkDJ.jpg",
               "id": 121191,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Radio Operator",
               "gender": 0,
               "credit_id": "55934e6992514152de002e56",
               "name": "Wataru Ômae",
               "profile_path": "/7fvtaP6157lROlkBTwEgdarAB1R.jpg",
               "id": 235720,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Surveyor",
               "gender": 0,
               "credit_id": "55934e74c3a3682d35000878",
               "name": "Chôtarô Tôgin",
               "profile_path": "/t6rhfy9hVKl9jx8PNrfY1pKGCV5.jpg",
               "id": 30474,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Submarine Captain",
               "gender": 2,
               "credit_id": "55934e8892514152de002e5d",
               "name": "Osman Yusuf",
               "profile_path": "/lz90CPk0S4c855Z0v0jukLouTfu.jpg",
               "id": 134264,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Godzilla",
               "gender": 0,
               "credit_id": "55934e9cc3a36804f3001886",
               "name": "Seiji Onaka",
               "profile_path": null,
               "id": 1483429,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Godzilla",
               "gender": 2,
               "credit_id": "55934ea7c3a368775d002ab1",
               "name": "Yû Sekita",
               "profile_path": null,
               "id": 1482691,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Godzilla (water scenes only)",
               "gender": 2,
               "credit_id": "55934eb892514121c70009af",
               "name": "Haruo Nakajima",
               "profile_path": "/u5CbtBOHgp3k7pJY20ZJ8ZW17sc.jpg",
               "id": 235722,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Minilla",
               "gender": 0,
               "credit_id": "55934ec6c3a3682cc800083b",
               "name": "'Little Man' Machan",
               "profile_path": null,
               "id": 1185644,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d44f",
               "name": "Jun Fukuda",
               "profile_path": null,
               "id": 30561,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d455",
               "name": "Shinichi Sekizawa",
               "profile_path": null,
               "id": 18611,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe478b9251416c7509d45b",
               "name": "Kazue Shiba",
               "profile_path": null,
               "id": 1021568,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d461",
               "name": "Masaru Satô",
               "profile_path": "/eXVLW2cSdIqQmwvXqlN0soZwYNz.jpg",
               "id": 18609,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d467",
               "name": "Tomoyuki Tanaka",
               "profile_path": null,
               "id": 18604,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d46d",
               "name": "Kazuo Yamada",
               "profile_path": null,
               "id": 30562,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 1.949822,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 18627,
      "vote_count": 21,
      "budget": 0,
      "overview": "The 8th Godzilla film is aimed at an even younger audience than its predecessors.  In the South Seas, scientists conducting weather experiments encounter gigantic mantises and a giant spider that are attacking Godzilla's offspring.",
      "similar": [
         15766,
         15767,
         19545,
         1682,
         124905,
         39256,
         373571,
         7191,
         929,
         5876,
         68726,
         268896,
         620,
         15092,
         293167,
         1680,
         315011,
         1678,
         6593,
         3107
      ],
      "original_title": "Kaijūtō no Kessen: Gojira no Musuko",
      "runtime": 86,
      "poster_path": "/96OonHTaOh9xrSpDg6cASy2xDoZ.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "1967-12-16",
      "vote_average": 5.2,
      "belongs_to_collection": {
         "backdrop_path": "/dx9YSup5zEOjxYwG4UkYBVAZIXo.jpg",
         "name": "Godzilla (Showa) Collection",
         "id": 374509,
         "poster_path": "/pcxnBlJ7GNvJNnkL0g5rHCyd015.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jun Fukuda"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Shin'ichi Sekizawa",
         "Kazue Shiba"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0061856/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4OTMyNDg2OV5BMl5BanBnXkFtZTcwNDM0MjcyMQ@@._V1._CR10,42,322,419_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Tadao Takashima, Akira Kubo, Bibari Maeda | See full cast and crew »"],
      "reviews": [
         "Wow! I expected something along the lines of GODZILLA'S REVENGE, what I got instead was a pretty exciting giant monster film. Sure Minya does make for a few cutesy moments but I didn't feel these were overdone as badly as they could have been. Plus I thought the ending embrace was quite moving..of course it does work to take some of the hard edge off of Godzilla so some may hate it for that. I'd recommend this one mostly to older kids who love science fiction adventure stories and who won't be frightened by all the cool-looking giant insect critters. Too bad Minya and Godzilla look so thoroughly silly and goofy in comparison.",
         "This is the Godzilla which I watched as a kid, back when I was still in the States, this movie which features a hatch ling of Godzilla's kind, though goofy looking, it was cute and silly, and it blows rings of energy instead of the flame Godzilla does. It has a parent-child relationship like story between Minya and Godzilla, like when the giant monster insects attack, Godzilla helps it, and tries to show it how to really use the fire breath, but then it improves in the end, and it also shows that Godzilla really does care for the young one after all(awwwww). And of course it has its shares of giant beasts that dare challenge Godzilla, and the hapless humans who get caught in between, especially the giant spider that traps them with a web. Bad dubbing, no sfx, just extra parts to use as special effects, goofy designs, but overall a good movie, better than the US Godzilla(1998). It is worth adding to the collection for every Godzilla fan out there.",
         "Son of Godzilla is one of those weird movies which inspire strange feelings. The story is unique, no Godzilla doing his typical destruction. The story centers on the very human relationship between Godzilla and his son, Minya. This movie really touched me on this level. Some scenes really stick in my mind. The great scene with Godzilla teaching Minya how to shoot radioactive fire comes to mind. There is a real bond that comes out. When Minya is confronted with a monster, i.e. a bully, Godzilla makes Minya fight his own battle but is always there to back up his son. Godzilla protects Minya and teaches him lessons; and in one of the climactic scenes, the son fights for his father's life; this is poignant. The scene at the end of the film in which father and son embrace to huddle from the cold is touching. If you divorce this from the typical Godzilla movie, what you are left with is a movie about a very close bond between father and son. I think I'm probably the only one who appreciates this movie on this deep a level. One question: What Hollywood movie has a positive view of a father and son relationship?--- This movie made me very emotional, go figure. In short, if you want to see a typical camp Godzilla, look elsewhere. If you want to see something with emotional content; see this movie 8++++++/10",
         "i don't understand why most shred this movie to pieces: a) it has far better special effects than its ancestors in the 50's b) its plot tries to offer an alternative to 60 minutes of a man in rubber suit smashing pongo or cartonbox minatures...in fact some people criticize both THAT kind of monster movies & THIS kind, where they try to stretch the joke a bit further. We get to see godzilla's son and the plot revolves around a clumsy reporter - the Asian version of charlie sheen- bothering a few scientists on a remote island for a secret weather experiment while looking for a scoop, and buddying a super hot -at the time, 1967 of course- girl left behind by her parents who died on that same island. She's very decent at acting, too...after all we're dealing with a C low budget Japanese movie, not Star Wars XVIII. Then you have lots of monsters, overgrown mantises, a giant spider...reminiscent of classic US movies from the silver era. Baby godzilla looks like Mickey Rooney but it's nice...i admit i laughed a couple of times. At least i give them credit for going beyond the old clichés. Character development is close to zero but it's about right...monster movies are not plays from Poe or Kafka...",
         "This kaiju movie is associated with a more youthful audience. Like the previous film, this movie was set on an island, where scientists test weather experiments. When one of the experiments goes wrong, it mutates life on the island, including three giant praying mantises. The bugs discover a monster egg and out hatches a slimy, buff, sickly- looking monster that is supposed to be the son of Godzilla. But, this monster is in no way close enough on resembling the Big G. Its eyes are huge, head and face are round and mostly spits radioactive smoke rings. He makes these annoying babyish sounds (wagwagwagwag!) and has behavior problems similar to that of a little kid (isn't he supposed to be a monster?). He should be the son of Barney. If you would like to see a better-looking Son of Godzilla, catch the young Godzilla of the Heisei Series. But, the good stuff we get to see in this movie is Masaru Sato's likable and comforting music score and Shinichi Sekizawa's adventurous and positive story. The special effects are pretty good, handled by Teisho Arikawa, and good directing by Jun Fukuda. A lot of recognizable Toho actors appear in this film, including Tadao Takashima, Akira Kubo, Akihiko Hirata, Yoshio Tsuchiya and Kenji Sahara. The monster battles are great; I especially like the the mantises and the huge spider sequences - effectively executed. Not much of a plot though, but a nice movie nonetheless with plenty of monster action. Grade B",
         "I am a huge Godzilla fan, I grew up with Godzilla, I just love seeing this awesome monster just destroy cities and fighting other monsters. I like his enemies as well but Godzilla is the Icon! This Godzilla film is a great one. The story is very good and I really love the way Godzilla looks in this film. I love it when he roars and moves his tail. The big G is joined by Minilla and they are great and I love it when they roar as well! As for their enemies Kamakiras and Kumonga they too is awesome. I love it when they roars. The fights between the monsters is really good. The acting by the film's human stars are also good. The music is just excellent! I really love this Godzilla film for many reasons and its arguably the best! If you love Godzilla I strongly recommend that you do what I did and buy The Son of Godzilla today!",
         "This movie and \"Godzilla vs the sea monster\" makes up a double header of Godzilla movies where almost all the action takes place on an island. Both are pretty good, and I can't really say I have a preference for one or the other. This movie has Godzilla at the beginning of the movie seemingly going in the direction of some mysterious waves that cause interference with radars and such. The waves are coming from an island where a team of scientists are conducting weather control research. A reporter kind of invades their little clan, but quickly joins it. They begin the experiment, but as things are going smoothly the interference comes and causes the experiment to go bad. The island heats to to very high degrees and the giant mantis's on the island get super big. They find and egg that turns out to be a baby Godzilla whose screams for the bigger Godzilla are the cause for the interference. Godzilla makes his way to the island to protect and teach one of his own. I am not sure if it is really Godzilla's own offspring, or just the fact they are the same species that brings Godzilla. While on the island the scientists have their troubles such as the heat, a strange sickness, and some of the group going crazy and Godzilla has his such as keeping his son in line (which is kind of hard), fighting the mantis, and a huge spider. All in all a nice little Godzilla flick to watch. On a side note, both footage from this movie and the sea monster movie would literally combine to form the atrocious Godzilla's Revenge.",
         "To look at the other reviews, one can see that many don't appreciate this film. It is understandable why someone may not like it. No one dies. No cities are destroyed. It has a hopeful ending. Baby Godzilla is overly cute and cuddly. The list can go on, but I feel that these attributes as well as the setting, the story about scientists on an island trying to change weather patterns, and the overgrown monsters of a spider and several praying mantis, along of course with Godzilla enhance the film and make it one of my favourites of the series. Not one of the best, however. Baby Godzilla is a real hoot to watch, and seeing Godzilla practice fatherly ways with him is fun to watch. We get to see a human side to a killing machine. Don't get me wrong, the film is hokey - but for me it brings back memories of my childhood when on many a summer day I would be camped in front of the television watching a Godzilla film.",
         "The beast Godzilla movie is the remake from 1998. Maybe you don't think so that's OK. But if your really mad about it come down you pooh pooh heads. This is a very good movie. It's the 8th Godzilla movie. It's not as good as the 1st Godzilla movie Godzilla King of the monsters. The 16th Godzilla movie The return of Godzilla. Part 23 to the Japan Godzilla sires Godzilla vs M.e.g.a.g.u.i.r.u.s is also better. But this is still a very good movie . See it. Some people are stuck on an island with giant monsters. Very scary. Great monster movie. See it see it see it. Great movie great movie great movie. It is very entertaining. Part 25 to the Japan series is Godzilla M.o.t.h.r.a and King G.h.i.d.o.r.a.h giant monsters on an all out attack. That one is better. The remake form 2014 is also better. But still a very good movie see it.",
         "Despite being enjoyable films, the last two Godzilla installments had not matched the success of Ghidorah, The Three-Headed Monster (1964) and had fallen below expectations at the box office. In an effort to boost audience attendance, Toho Studios made the decision to soften the king of the monsters and give him a cute baby son. The first Godzilla film to be geared directly towards children, Son of Godzilla (1967) is harmless fun and sweet - the cinematic equivalent of a gum drop. Alas, the film proved to be the most poorly attended Godzilla film yet. Either Toho's kiddie approach had backfired or the film just couldn't compete with the rising popularity of television. Son of Godzilla (1967) shouldn't be the first Godzilla movie you see, or even the second or third. With the Godzilla suit from Invasion of the Astro Monster (1965) torn and frayed, a new one was constructed. Unfortunately, it is one of the most poorly designed suits in the series - bulky legs, large doll-like eyes, and a toad's head. However, it is arguably better than the one audiences would behold six years later in Godzilla vs. Megalon. If you have small children and want to introduce them to kaiju films, I recommend Son of Godzilla."
      ],
      "genres": [
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": ["Toho Company"],
      "summaries": [
         "A group of scientists are on tropical Solgel Island in the Pacific to conduct weather control experiments. Just before they begin, they find giant preying mantises measuring 25 feet tall called Kamakaras. They decide to go ahead with the experiments, but a malfunction in one of the devices and as a result a radioactive storm that pushes the temperature up to two hundred degrees. The storm also causes the mantises to grow even bigger to 100 feet tall. The mantises then make their way to a huge mound where they uncover a giant egg which contains a young Godzilla, later named Minilla. Eventually, Godzilla shows up and saves his offspring. The rest of the movie features Godzilla taking care of and teaching his young son the skills that will eventually help him to become the new \"King of Monsters\" as well as fighting the Kamakaras and a giant spider named Kumoga.",
         "Scientists experimenting with changes in weather on a tropical island get more than they bargained for when Godzilla shows up to battle humongous insects and protect his newborn child."
      ],
      "budget": 0
   },
   "movielensId": 31079,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1967-12-16",
      "dvdReleaseDate": "2004-12-14",
      "directors": ["Jun Fukuda"],
      "runtime": 86,
      "movieId": 31079,
      "title": "Son of Godzilla",
      "mpaa": null,
      "actors": [
         "Tadao Takashima",
         "Akira Kubo",
         "Bibari Maeda",
         "Akihiko Hirata",
         "Yoshio Tsuchiya",
         "Kenji Sahara",
         "Ken'ichirô Maruyama",
         "Seishirô Kuno",
         "Yasuhiko Saijô",
         "Susumu Kurobe",
         "Kazuo Suzuki",
         "Wataru Ômae",
         "Chôtarô Tôgin",
         "Osman Yusuf",
         "Seiji Onaka",
         "Yû Sekita",
         "Haruo Nakajima",
         "'Little Man' Machan"
      ],
      "imdbMovieId": "0061856",
      "originalTitle": "Kaijūtō no Kessen: Gojira no Musuko",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": [],
      "plotSummary": "The 8th Godzilla film is aimed at an even younger audience than its predecessors.  In the South Seas, scientists conducting weather experiments encounter gigantic mantises and a giant spider that are attacking Godzilla's offspring.",
      "tmdbMovieId": 18627,
      "avgRating": 2.51053,
      "releaseYear": "1967",
      "numRatings": 95,
      "posterPath": "/96OonHTaOh9xrSpDg6cASy2xDoZ.jpg"
   }
}