{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "seduction",
         "id": 3182
      }],
      "imdb_id": "tt0189744",
      "video": false,
      "title": "Miss Julie",
      "recommendations": [],
      "backdrop_path": "/ztu2XaDPB1VijzliV7pEJxop1Vh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Miss Julie",
               "gender": 0,
               "credit_id": "52fe4ac8c3a368484e166b31",
               "name": "Saffron Burrows",
               "profile_path": "/1X9gJnDIYE4N52UtPZ9qM3Bi2TM.jpg",
               "id": 9825,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jean",
               "gender": 2,
               "credit_id": "52fe4ac8c3a368484e166b35",
               "name": "Peter Mullan",
               "profile_path": "/g344UcfsoYtz3Lt148mDtuQ9CQ0.jpg",
               "id": 3064,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Christine",
               "gender": 1,
               "credit_id": "52fe4ac8c3a368484e166b39",
               "name": "Maria Doyle Kennedy",
               "profile_path": "/nK8DmGEgzGXIbyv3VyK6j7M0Gvw.jpg",
               "id": 33394,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Servant",
               "gender": 1,
               "credit_id": "554cca58925141400b001e2c",
               "name": "Joanna Page",
               "profile_path": "/i0Mgrg3K2HvcQWnQmliD3FesBAk.jpg",
               "id": 7061,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Servant",
               "gender": 1,
               "credit_id": "554cca77c3a3685e4c005391",
               "name": "Eileen Walsh",
               "profile_path": "/vQfrnNfyQDiwc1pys052Hg8zSqy.jpg",
               "id": 53999,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Servant",
               "gender": 0,
               "credit_id": "5747bc1ac3a368288c0006c8",
               "name": "Tam Dean Burn",
               "profile_path": "/9KvZPsDzvP58t1vIvEK0m1x36YZ.jpg",
               "id": 116130,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ac8c3a368484e166b2d",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ac8c3a368484e166b3f",
               "name": "Sandy Powell",
               "profile_path": "/6J0JwsWmFv3vKEguRTV71aK5J.jpg",
               "id": 9027,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "53c855c00e0a26648a0000df",
               "name": "Helen Cooper",
               "profile_path": null,
               "id": 1342791,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "554cc9a8925141400b001e02",
               "name": "Harriet Cruickshank",
               "profile_path": null,
               "id": 1465049,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "554cc9bf92514140e9001dde",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "554cc9da925141402a002008",
               "name": "Benoît Delhomme",
               "profile_path": "/qa2h6tyIG4iIc700VN7acYnhU4v.jpg",
               "id": 21655,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "554cc9f8925141402a00200f",
               "name": "Jina Jay",
               "profile_path": "/rMuj07hjZnT0zMC1kiBOs6IWCdO.jpg",
               "id": 474,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "554cca1ec3a3685e55005389",
               "name": "Mary Boyle",
               "profile_path": null,
               "id": 1465050,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.62643,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 125520,
      "vote_count": 3,
      "budget": 0,
      "overview": "A footman seduces a count's daughter. Adaptation of August Strindberg's famous play.",
      "similar": [
         263472,
         22705,
         27066,
         859,
         19918,
         14174,
         796,
         2149,
         1259,
         316410,
         37247,
         1813,
         80752,
         81774,
         44214,
         106646,
         112160,
         4995,
         27,
         88
      ],
      "original_title": "Miss Julie",
      "runtime": 103,
      "poster_path": "/7eBM9T0CKZpy59dIsvAg4GArTg8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Red Mullet Productions",
            "id": 24827,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Moonstone Entertainment",
            "id": 22289,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-12",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Worlds apart... bound by desire.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Figgis"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Helen Cooper",
         "August Strindberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0189744/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NjUyOTIzN15BMl5BanBnXkFtZTcwMTg4ODMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Saffron Burrows, Peter Mullan, Maria Doyle Kennedy | See full cast and crew »"],
      "reviews": [
         "August Strindberg is one of Sweden's most important writers from the late 19th and early 20th centuries. \u0091Miss Julie' is one of Strindberg's plays written around the turn of the century. This is a powerful story of anger, hate, lust and class envy. The play revolves around two main characters. Jean (Peter Mullan) is a footman, a servant to a Count in northern Sweden in the late 1890's. Julie (Saffron Burrows) is the Count's shrewish and self loathing daughter. Jean is tormented by his attraction to Julie and his simultaneous hatred of her class. The play focuses on an encounter they have one midsummer's night in the servants' kitchen. Jean takes his resentment out on Julie with sarcastic remarks and open disdain for the gentry of which she is a part. She responds sometimes docilely and contritely, and at others with condescending vitriol. This open antipathy belies their sexual attraction and the embattled conversation leads to a seduction, which is really less of a seduction than a mutual ravishment. Afterward, as Julie is more vulnerable, Jean attempts to manipulate her into stealing money from her father and running away with him so he can indulge his secret ambition to own a hotel and become a part of the upper class he now so despises. The film ends on a decided downbeat, which is no surprise given the characters' deeply disturbed personalities. The story is intense, intelligent and visceral. It is has more the feel of a play (one set, crude props, only one or two costumes per actor). However, though the acting is more that of a theatrical production, it is shot more like a modern motion picture. Director Mike Figgis does a good job with the camera, using some innovative techniques to keep it from looking like you are watching a play through a window. The story is likely to be appreciated by only a very small audience. Not only is it very dark, but all the characters are distasteful. Jean is angry, sardonic, obnoxious and manipulative. Julie is shrewish, condescending, self hating, and insecure. There is really no one with whom the audience can identify. This renders the entire story potent but extremely unpleasant. Also, it deals with themes that were mainstream in 1900, but are generally beyond the ken of today's audiences. The actors were fabulously cast and the acting superb. Peter Mullen is short, craggy and Napoleonic, while Saffron Burrows is tall, willowy, and graceful. Besides being well cast for their stations, she was at least four inches taller than he, and this worked well with all the allusions to the aristocracy being `up there' and the servants being `down here'. Peter Mullen played the part flat out. He was pugnacious and full of indignant rage, envy and spurn. The acclaim Saffron Burrows received for this performance was well deserved. She handled the difficult range of emotions deftly, moving effortlessly from whimpering child to haughty bitch and all the complex self torturing emotions in between. I rated this film an 8/10. This is not a film for everyone. In fact it is a film that most people will probably dislike. I would recommend it for the ardent theatergoer who is a battle tested veteran of microscopic character studies involving flawed characters. To like this film you have to be one who can appreciate trying and disturbing emotional portrayals without a need to like any of the characters. For everyone else, it will probably be a harrowing and disagreeable experience.",
         "Sexual and power politics get a late Victorian Era workout in `Miss Julie,' Mike Figgis' bleak, rather stagy adaptation of August Strindberg's classic play. Saddled with what is essentially a one-set, two-character chamber piece, Figgis has chosen, for the most part, not to open-up the work cinematically very much, but rather to concentrate on the stark human drama at its core. This editorial decision keeps the film more faithful to the spirit of the original author's intent perhaps, but it also, by necessity, limits the possibility that we will see Strindberg's work in a new and exciting way. In his tale, the Swedish author strips the age-old theme of the eternal class struggle to its barest, bleakest essentials. Miss Julie is a beautiful young countess who feels trapped by the stifling provincialism of her privileged position. She yearns to climb down off her well-guarded pedestal and experience life in all the rawness and vigor with which she imagines the lower social orders live out their days. During a Midsummer celebration, in which she attends the raucous revels of the servants in her employ, she begins to make sexual overtures to Jean, a man whose position in the house is that of her father's loyal footman and who, in a parallel of sorts to his mistress, feels just as strongly as she does the stifling demands of his less-than-privileged position. In direct opposition to Miss Julie, Jean has always yearned to gain acceptance in the very social world from which she is trying to escape. Together, they attempt to bridge the unbridgeable gap between gentry and peasant on the common ground of mutual sexual attraction. They discover, though, that some gaps exist never to be filled and that the interjection of the sexual element into their relationship can result in at best only a temporary reversal in their power positions before the much stronger forces of the societal caste system reassert themselves and restore the `normal' balance. Strindberg's characters and the relationship between them are very complex in their nature. Although Miss Julie and Jean appear to be groping for a safe middle ground where the two of them can find a level of stasis and equality, mostly they end up constantly shifting positions of power in a class struggle that can never be ended in the time and society that has entrapped them. We sense the futility of their aim all throughout the play \u0096 and the bitterness and harshness of their love/hate relationship imply that the characters sense it as well. This is why `Miss Julie' must inevitably end in tragedy for all involved. The world at that time offered no alternative endings for such a situation. By bringing a raw physical intensity to their roles of the would-be lovers, Saffron Burrows and Peter Mullan help to modernize the characters, emphasizing the sexual passion that holds them in its grip. It is difficult to know how Figgis, as director, could have expanded the play beyond its claustrophobic theatrical limitations without violating the spirit of the work. For his refusal to in any way really open it out in cinematic terms, `Miss Julie,' for all its intensity of theme and character, ends up as a rather static, talky film. Thus, it is left to future directors, I suppose, to take up the challenge of making a real movie out of `Miss Julie.' If they can only figure out how!",
         "This movie is worthwhile to see due to the powerful performances of Saffron Burrows and Peter Mullan. Mike Figgis once again displays a knack for digging in deep into a story and opening a pandora's box of human emotions; leaving the viewer to make their own conclusions of the politics of a sexist, class conscious society and how it wrecks havoc on the souls of two vastly different people.",
         "I have just seen miss Julie for the first time on BBC 2 here in the UK and thought Saffron Burrows performance was quite wonderful! She show such range of emotions along side Peter Mullan who played the role Jean opposite her who also outstanding.A few years ago i had the pleasure of meeting Saffron Burrows over a few occasions and found her quite delightful and a witty lady.I urge who have not seen Miss Julie to rent it out because Mr Mike Figgis has done great creative job bringing this play to the screen. I must see some other work Mrs Burrows has done and hope that some of it is of the same high class as this production showed!! I just wished the Hollywood studios could produce more high value productions as Mrs Juile instead of remaking original cult classics such as The Italian Job and my father's movie The Wicker Man remade by Mr Nicholas Cage! Oh well we can only hope for better things for the future.",
         "Nothing outside of Saffron Burrows and Peter Mullan exists while watching this film. I sadly missed it in the theatre, but rented it just recently. The intensity of the interplay between Julie & Jean, and the play of chemistry between Saffron & Peter, completely absorbs. No room, no telephone, no kitten getting into things, no knock on the door. A physical sex scene that feels like a mental rape. A servant Aristocrat and an Aristocratic servant: how far does a social role penetrate our being? The air of the film brims with violence, loathing, mutual envy and lust but...no gun, no breast. The emotional manipulations between the characters manipulate the viewer's emotions much more than any weapon or nudity could. The performance of Saffron Burrows is absolutely astounding. One moment you loathe Julie, the next you just want to comfort her. Peter Mullan works in perfect tune with Burrows and even when the characters onscreen are at odds, there is perfect harmony within the player's performances. Through the film you feel as though you can see through layers and layers of this character Julie and at the end are left numb, but awe-stuck. Thank You Mike Figgis, Saffron Burrows, Peter Mullan and Maria Doyle Kennedy! (now, to pick up kitten's fun. . . )",
         "I don't quite understand why I'm reading so many negative reviews of this movie. I admit that at first I was turned off just a bit from when I saw the camera work in the beginning. It seemed too sloppy and jerks the viewer around too much; zooming in on wine glasses and faces and other irrelevant things. This only lasted for few minutes though. The cinematography is thrilling in this film: the dreamy, unrealistic landscape of the garden and the water mill, the close-ups of Julie's wrist under running water, the split-screen view of that incredibly intense sex scene, and the distorted reflection of Julie's face before she commits suicide. I don't think the speech in the movie was hard to comprehend at all. But, again, I really can't understand all the negative comments. This is a wonderful movie, including it's fiercely sharp cello and violin based soundtrack. Perhaps people find it difficult to appreciate a film that takes place in only 2 or three rooms and that focuses on just 3 characters.",
         "Strindberg's midsummer nightmare to Shakespeare's dream. 'miss julie' has been touted (by its director, at any rate) as a new way of filming works of classic literature. The film begins, however, as almost all adaptations of plays do, with bustle, hyperactive camerawork and editing, and lots of people (and therefore lots of centres of interest), to fool the viewer into thinking they are watching cinema, and to avoid making the next two hours of stagy talk seem so much like stagy talk (a recent example of this nethod is the Nick Nolte/Jeff Bridges film 'simpatico'). And what follows, sure enough, is two hours of stagy talk. Figgis' current inspiration is the Dogme 95 collective of Danish filmmakers, although when the opening titles proclaim 'A Mike Figgis Film', we realise that it's not going to be THAT radical (Dogme directors do not sign their work (although, curiously enough, we all know who they are)). For all its self-imposed constraints, Dogme is a model of freedom - by banishing shackles of conventional cinema, they are free to pursue other stylistic methods that are not 'allowed' in 'proper' filmmaking. 'julie', however, is only superficially a Dogme film. It has the rough texture and grainy look, the disruptive editing, jarring compositions and unstable camerawork. But everything is so controlled, and the main reason for this is the fact that it is an adaptation of a classic play. Figgis can do all he likes to break the text, and in one way the film is a fascinating exploration of theatre space, as if the play was a tangible, physical entity, and the film was a documentary crew filming around and through it. In the film's crucial scene, when Jean violates Julie in a dark corner of the kitchen, the screen splits in two, something theatre can't do. This provides a number of functions - it (rather obviously) singles out the scene as important; it visualises the various ruptures (class, sex, power etc.) the play narrates; it jolts the audience out of the piece, forcing us to ask ourselves what Figgis is doing with form, rather than simply follow the content; it gives us alternating views of the same scene, although two is as arbitrary as one, and the differences between the scenes are hardly Cubist. All of this is good, but the text always intrudes. Figgis, unlike, say, Von Trier in 'the idiots', cannot go one way, because Strindberg goes another. The actors, astonishing though they are, cannot truly free themselves, lose themselves, explore themselves, because they have to remember the next line. The symbols of the play have to be worked in, which requires further conventions; but if the image of the caged bird is a cliche, its fate is truly shocking; even better are the images of water, the mill, the repetition of Julie's life, the sense of hereditary bad blood, linked to sex and virginal penetration and death, all culminating in the brilliant image near the end of bloody water. 'Julie' may not work as a Dogme film, or as a radically different literary adaptation, but it's still a good movie, largely because Strindberg's play is so brilliant. Often seen as the source of modern drama, its austere study of power and sex, its sado-masochistic rituals, the magnificent trap it sets for its characters, can be seen in its influence, not only on playwrights like Genet, Ionesco and Beckett, but directors like Sirk, Bergman and Fassbinder. Played 'straight', the piece could be stiff and RADAstifled - Figgis' style does create greater immediacy, so that you genuinely cringe and even feel for two not particularly likeable characters. Figgis doesn't have to do much to draw out the modernity of Strindberg's play - it is all already there - but his screenplay is pungently fruity. If the film had been less cinematic, more theatrical, some of Strindberg's metaphors would have worked better - the running motif of the theatre, of playing roles (the events are overlooked by a scarecrow of the count), the masque-like intrusions of the servants, and Julie's final appearance, like a shabby old actress with her make-up mussed, lose their effect, although the servants-scene is very frightening and potent in its carnivalesque overturning of the social order. Strindberg is literature's most famous misogynist, and yet his women are often highly sympathetic, or their plight accurately described - Saffron Burrows' humiliating decline is harrowing to watch, but I think Figgis avoids exploitation. what is most interesting is the nationality of the casting: the aristocratic English heroine attacked and undermined by her Scottish and Irish servants. it is the unseen Count who pulls the strings though; when he goes away, chaos reigns, servants become counts, countessess whores; when he returns, order is restored, deviants expelled. But for how long?",
         "Mike Figgis' 'Miss Julie', an adaptation of a Strindberg play, tells the story of a relationship struggling in the face of class divisions, and protagonists torn between their obsessions and ambitions. Figgis gets intense performances out of his cast, the music (written by himself) is excellent and in spite of its origins on the stage, he avoids an overly static feel; and the language (rendered in English) seems fresh. But the characters themselves are a little too archetypal, their feelings theatrically contrived into dialogue; personally I couldn't care too much about their ultimate tragedy. An immaculately made film, but somehow less than the sum of its parts.",
         "This play is a stark portrayal of the heavy price that must be paid when social conventions are thrown to the winds. Moral relativism as a topic of cocktail party chatter is amusing, as a guiding principle in real life one discovers that there is nothing very amusing in the bottomless pit to which it can lead. The acting of Peter Mullan and Saffron Burrows is nothing short of electrified and provides a neon lit twenty four hour period in which life changing decisions transport the main characters to levels of existence of which they had not previously even dared to dream. As the play begins, there is not even a hint of the journey that is in store for Miss Julie and her father's valet as their incipient flirtation with disaster rains sparks amid the tinder of an aristocratic manor house.",
         "The word 'Strindberg' enticed me. How close this movie is to the play, I have no idea. But there are a few questions that marred the movie for me: Why would the stablemen take the word of a scullery maid over a footman in giving up the horses for his escape?, Why would the woman want to commit suicide? What drove her mad? Having had a friend who did commit suicide, I know that in her last stages of depression she fell in love with an ex-con who delighted in telling us how he and his buddies killed another inmate at Kilby Prison with a broom handle. She was highly educated, artistic and giving.....we all should have seen the signs. So this woman's dalliance with an ambitious footman (who at first seems quite virtuous) is to be understood. See the movie and tell us how close it is to Strindberg himself."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Moonstone Entertainment",
         "Red Mullet Productions"
      ],
      "summaries": [
         "Midsummer night, 1894, in northern Sweden. The complex strictures of class bind a man and a woman. Miss Julie, the inexperienced but imperious daughter of the manor, deigns to dance at the servant's party. She's also drawn to Jean, a footman who has traveled, speaks well, and doesn't kowtow. He is engaged to Christine, a servant, and while she sleeps, Jean and Miss Julie talk through the night in the kitchen. For part of the night it's a power struggle, for part it's the bearing of souls, and by dawn, they want to break the chains of class and leave Sweden together. When Christine wakes and goes off to church, Jean and Miss Julie have their own decisions to make.",
         "A footman seduces a count's daughter."
      ],
      "budget": 0
   },
   "movielensId": 3116,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-12",
      "dvdReleaseDate": "2000-05-30",
      "directors": ["Mike Figgis"],
      "runtime": 103,
      "movieId": 3116,
      "title": "Miss Julie",
      "mpaa": null,
      "actors": [
         "Saffron Burrows",
         "Peter Mullan",
         "Maria Doyle Kennedy",
         "Joanna Page",
         "Eileen Walsh",
         "Tam Dean Burn"
      ],
      "imdbMovieId": "0189744",
      "originalTitle": "Miss Julie",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["bj2Mwwy9B0w"],
      "plotSummary": "A footman seduces a count's daughter. Adaptation of August Strindberg's famous play.",
      "tmdbMovieId": 125520,
      "avgRating": 2.6875,
      "releaseYear": "1999",
      "numRatings": 48,
      "posterPath": "/7eBM9T0CKZpy59dIsvAg4GArTg8.jpg"
   }
}