{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "speech",
            "id": 6001
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "star crossed lovers",
            "id": 165086
         }
      ],
      "imdb_id": "tt0048034",
      "video": false,
      "title": "The End of the Affair",
      "recommendations": [
         43693,
         118534,
         41996,
         43199,
         62655,
         151138,
         43358,
         89484,
         37658
      ],
      "backdrop_path": "/2Z3eCyCHVOrZk5VT68sx84gC1ru.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sarah Miles",
               "gender": 1,
               "credit_id": "52fe4994c3a368484e132c1f",
               "name": "Deborah Kerr",
               "profile_path": "/snyKI73NycIaXjU4GyxDq92ZRo5.jpg",
               "id": 20141,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Maurice Bendrix",
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c23",
               "name": "Van Johnson",
               "profile_path": "/6sWt0ilIFgggXr2wtUia3iv8dYa.jpg",
               "id": 37446,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Albert Parkis",
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c27",
               "name": "John Mills",
               "profile_path": "/5MiJRQj6irdxqCtAhX00YWqmGjZ.jpg",
               "id": 11859,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Henry Miles",
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c2b",
               "name": "Peter Cushing",
               "profile_path": "/1qtKVu16REL2YLVrhayjVey4al.jpg",
               "id": 5,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Smythe",
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c2f",
               "name": "Michael Goodliffe",
               "profile_path": "/mVLnHVX3VvDAk3UNBrBtxxPsVje.jpg",
               "id": 78940,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "le père Crompton",
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c33",
               "name": "Stephen Murray",
               "profile_path": null,
               "id": 38999,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Savage",
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c37",
               "name": "Charles Goldner",
               "profile_path": null,
               "id": 115062,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mme Bertram",
               "gender": 1,
               "credit_id": "52fe4994c3a368484e132c3b",
               "name": "Nora Swinburne",
               "profile_path": "/cCzOzfmNtMGgxRgnUo2ciQZF1xC.jpg",
               "id": 88895,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "le docteur Collingwood",
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c3f",
               "name": "Frederick Leister",
               "profile_path": null,
               "id": 127024,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "la femme de ménage",
               "gender": 0,
               "credit_id": "52fe4994c3a368484e132c43",
               "name": "Mary Williams",
               "profile_path": null,
               "id": 583455,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4994c3a368484e132c1b",
               "name": "Edward Dmytryk",
               "profile_path": "/s7E1zzpOeg7VBmLjA9MBgl2jizD.jpg",
               "id": 64114,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4994c3a368484e132c49",
               "name": "Graham Greene",
               "profile_path": "/cz2Nnw7YASKCOHB5B9cgHT7mZuH.jpg",
               "id": 15379,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4994c3a368484e132c4f",
               "name": "Lenore J. Coffee",
               "profile_path": "/4izZTE5jXntDj7BX3HFVpNr1sRu.jpg",
               "id": 84237,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Romance",
         "id": 10749
      }],
      "popularity": 1.102374,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 78256,
      "vote_count": 3,
      "budget": 0,
      "overview": "A civil servant's wife (Deborah Kerr) in wartime London vows to leave her injured lover (Van Johnson) if he recovers.",
      "similar": [
         14484,
         195589,
         8363,
         376659,
         325133,
         8456,
         109414,
         627,
         122081,
         9777,
         22318,
         19053,
         2770,
         4964,
         319,
         597,
         9029,
         10229,
         409,
         454
      ],
      "original_title": "The End of the Affair",
      "runtime": 105,
      "poster_path": "/xGJzPsiz9kgDRaIq5DbI73ZdKhQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Coronado Productions",
            "id": 13719,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1955-02-23",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edward Dmytryk"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Graham Greene",
         "Lenore J. Coffee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048034/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMjI4NzkzOF5BMl5BanBnXkFtZTcwMjcxMzgxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Deborah Kerr, Van Johnson, John Mills | See full cast and crew »"],
      "reviews": [
         "I am indebted to Turner Classic Movies for televising this film today. I had not seen it. I am a great admirer of both the novel and the 1999 film version by Neil Jordan. I count it as one of the greatest love stories in literature. Yes, Van Johnson is miscast as Maurice Bendrix. Still, he is a sincere actor and his work is good considering that Maurice has been \"Americanized.\" I wasn't prepared for the devastating performance by Deborah Kerr. Sarah Miles is one of literature's greatest creations. The \"saint\" as \"whore.\" Or is it the \"whore\" as \"saint?\" I found myself engrossed and deeply moved watching her. It only confirmed my belief that she was with Vivian Leigh one of the two best English actresses in cinema. I love Julianne Moore in the 1999 version and equally love Deborah Kerr in the 1954 version. Sarah Miles is such a great creation that it would be wonderful to see another filmed version and compare the work of three actresses. Incidentally, \"The End of the Affair\" is one of those notable works of literature that went from the page to the screen to the opera house (Jake Heggie, composer -- commission by The Houston Grand Opera -- 2004.) I do like the treatment given to the other characters in the 1954 film version. We get to meet Smythe and the priest and Sarah's mother. In the Neil Jordan screenplay, Smythe and the priest are combined into one character, a Catholic priest named Smythe. Sarah's mother is omitted in that version. If I was disappointed in the 1954 version it has to do with the character of Smythe. His character has a horrible facial birthmark that Sarah kisses when she parts from him. In the novel we are told that the birthmark disappeared upon her death. We have no idea that this happens in the 1954 film version. In the 1999 film version, the birthmark is given to Lance, Parkis's son. Also, in the novel, Lance suffers from stomach disorders. We learn that he is cured of that upon Sarah's death. No mention is made of this disorder in the 1954 film version. Henry Miles, the cuckold, is more tragically portrayed in the 1999 film version. I tip the scales in favor to Stephen Rea whose performance is so true to the gravity of Graham Greene's creation. A great story of human and Divine love with Maurice and Henry fighting for possession of Sarah's soul and only God receives it.",
         "This is an astonishing artifact from 1955 -- astonishing because it is so grownup and sophisticated in its outlook, and because it grapples with moral complexities and ambiguities that English language films of this period never went near. An adulterous affair begun with a certain amount of cynicism on both sides grows into a true and passionate love affair, which in turn raises issues of guilt, trust, duty, self-denial and religious belief. As a story, it holds our interest and causes us to wonder where it will end. As a parable and philosophical meditation on belief and its role in love and contemporary life, it is both stimulating and unexpectedly moving. That a novel as layered and difficult was attempted with major stars at this time is surprising enough. That THE END OF THE AFFAIR succeeds on so many levels seems miraculous, especially in the context of most mainstream film product of the mid-'50s. Van Johnson is not as expressive or deep an actor as the excellent Deborah Kerr and Peter Cushing (and John Mills, Michael Goodliffe and Nora Swinburne) yet his character's relaxed masculinity, reluctant anguish and saturnine, rather malicious jealousy are well-conveyed, and he manages to be a presence you remain interested in. As Greene's Mary Magdalene character, the woman in whom the sacred and profane are mingled, Kerr is terrific in a complex role that is an interesting inversion of her promiscuous, childless woman in the far more famous and popular FROM HERE TO ETERNITY of just two years before. ETERNITY, done for Columbia, the same studio that released this, was far more shallow and conventional in the way it dealt with Kerr's Karen Holmes and her redemption. Just as shallow (and evasive) was TEA AND SYMPATHY, which Kerr did after this, and which received far more fame and attention than was merited. This 1955 version of THE END OF THE AFFAIR deserves to be much better known and remembered, and all concerned deserve belated kudos for attempting such a provocative film in the midst of Hollywood's synthetic movies of the period. I saw this after recording it on TCM, and would like to see it scheduled in prime time, to perhaps begin to get the wider audience it deserves and to hear commentary from moderator Robert Osborn (for that matter, he ought to do one hour interviews with both Kerr and Johnson while they are still around). Let the rediscovery and rehabilitation of this good film begin . . .",
         "When I saw that this movie was by Graham Greene, I expected a suspense story, maybe a spy story. So I wanted to warn people that this movie is nothing like that. It is about faith and God. It is couched as a love triangle melodrama. This disguise is so well-wrought that it seems to have fooled a lot of people into thinking the movie is a love story. But all that is merely an excuse for the rather deep philosophical issues that the movie tackles. In typical Greene manner, though, it is rife with unexpected plot twists. For example, just when I thought the movie was about to wrap itself up, it launched into the real reason for its existence, via a flashback into \"what really happened\" in Sarah's life. This is an unusual place in a movie to have a long flashback, it seems to me. After this point, there is one change of direction after another. Up until the very last scene, the movie is quite ambiguous, and it is not at all clear whether Greene views belief in God as a bad, destructive thing or not. Even the last scene does not completely resolve this question. Johnson has a particularly unusual part, his all-consuming passion for Sarah inadvertently causing her misfortune after misfortune. His understated guilt and horror each time he discovers the effects of his actions is an interesting part of the story. The acting by the three mains, Kerr, Johnson and, surprisingly, Peter Cushing, is top notch. This movie is not \"entertainment,\" however. It is an intellectual challenge, engaging the viewer to wrestle with issues most thinking humans must come to terms with at one time or another in their lives. The dialogues between Johnson and Kerr remind me very much of a non-humorous presentation of the themes dealt with in \"The Screwtape Letters,\" with Johnson (and Goodliffe) presenting all the rational, reasonable conclusions favoring atheism, but Kerr inevitably being drawn deeper and deeper into faith in God, more because of their efforts than in spite of them. As has been demonstrated in other comments, this movie will not be enjoyed by those unwilling to examine their stances towards these fundamental issues of human existence.",
         "This is not a great film, but it is better than many critics said it was when the 1999 remake came out. THE END OF THE AFFAIR was one of the key novels of Graham Greene in the 1950s that delved into his intense Catholicism. With a background of World War II, neighbors Maurice Bendrix and Sarah Miles (Van Johnson and Deborah Kerr) have a deep, passionate romance. But they are separated for a year or so, and when they try to resume the relationship (or when Johnson tries to resume the relationship - Kerr seems relatively hesitant). It turns out that, due to personal experiences, Kerr has had a religious revelation. She is listening to a Catholic priest. She is also trying to help a man with a deformity (a birthmark) on his face who hates God. She is also concerned about the spiritual health of Johnson and of her actual husband Henry (Peter Cushing, in a very moving - and non-horrific role). The film shows how Kerr affects all the lives around her, even beyond her death after a short illness (as the novel does). Yes, it is too talky - novels about ideas (and here it is the age old question of what is real love, the spiritual or the profane)usually are. Greene, good Catholic exponent that he was, would have said that Kerr's devotion to her God was an outpouring of divine true love to her fellow creatures. Her death is not a tragedy. But Greene the novelist and part-time realist cannot leave it there. Johnson's character is bitter at the end of this remarkable novel, and at the end of the film. And his bitterness is directed at the source of that love that triumphed over his profane one.",
         "This is the first version of the movie Neil Jordan remade in the late nineties.Based on a Graham Greene novel,it looks like a melodrama ( the chandelier scene is pure poetic melodrama) but with a strong metaphysical side. The construction of the film is complex,showing the same events from two points of view.Sometimes you may lose the vital lead ,for a lot of important things are not necessarily on the screen. If the movie is successful ,it's because of Deborah Kerr's extraordinary skills.She is sensational in her part of an unhappy woman,in search of something really worthwhile.Whereas Maurice (Van Johnson) is all passion and jealousy,her quest is much more demanding. A lot of us have ,at least once in our lives,asked God for something.And if this wish comes true,is it proof positive that God exists?And if the person who prayed Him is an atheist?Does it mean that she has got to change her way of thinking? That she is indebted to Him?That's Sarah's moral dilemma ,lost between her love for Maurice and her moral concern,and trying to find her way ,helped by two men Father Crompton and Smythe. Deborah Kerr's fans should watch this . At the time,Edward Dmytryk had probably moral concern too.",
         "Van Johnson is miscast but still surprisingly good as the loving/bitter writer who tells this story; Kerr is very good and Cushing is even better. In fact, Cushing is distinctly superior to Stephen Rea, who played the role of the husband in the 1999 version. Rea was mopey and morose, but Cushing is a mild man doing the best he can, a picture of unexpected courage -- and frailty. It's one of the best performances he ever gave; it's a shame it didn't lead to bigger roles. The movie does not, cannot, express the passion so much a part of Neil Jordan's version; furthermore, it's talkier, and the talk isn't as good. It doesn't capture the period (World War II and just after) in the slightest, despite some newsreel footage, but otherwise London is presented very well in handsome black and white photography. It's an honest and respectable version of Greene's novel, but Jordan's is the classic.",
         "I noticed in this film Van Johnson's voice has started to obtain gravel. Previously he just had a kind of whiny snide voice (Best example of this is in the 1948? 49? film \"Battleground\") I will always love Deborah Kerr, from my POV she can never do any wrong. It is all the better when she was handed a good script and a good director. I would classify this as one of the better scripts. This film is almost like a comedy of errors, instead it is a tragedy of errors. Actually it is quite a sad movie, I would have to read the original book that this was based upon. What attracted me to this film, are the spiritual aspects. If this film were to be remade today, and I see it was remade in 1999, I wonder how much of the spirituality would remain? I have yet to see the newer version. This film is a quest into the reason behind Faith. I can't explain it, but this film makes a lot of sense. Mrs Miles questions to the priest, to the atheist, and to God are all valid. Most people will see this film and will only consider the \"affair\" between Johnson's character and Kerr's... But that is not what this film is about at all: The affair is just a device author Graham Greene used to tell a story about Faith: What it means to have, and what is expected of us who have it. Of course this film has its melodramatic aspects. Also it has Peter Cushing, who is not chasing vampire Christopher Lee for once. The only weak things in this film are the confrontations between Van Johnson and Cushing- If I were Cushing and I had a wife that looked like Kerr I would have punched Johnson in the nose. But maybe the weakness of the encounters were to display that Cushing really did not care about his wife, being more interested in becoming a Lord or some important personage.",
         "****SPOILERS**** Schmaltzy yet very penetrating film about forbidden love in the betrayal of one's spouse that leads to a series of life changing, as well as ending, events to all those involved. American writer Maurice Bendrix, Van Johnson,had been discharged from the US Army because of a trick knee and decided to spend the rest of the war in London writing a novel about the British civil service system. Meeting the Miles at a party Maurice notices civil servant Henry Miles',Peter Cshing, sexy wife Sarah, Deborah Kerr, smooching with a British Tommy out of the corner of his eye, in a back-room mirror, and feels that she's easy. The first time he's alone with Sarah in a pub, Maurice makes his move on her. Sarah is immediately smitten by the handsome and sweet talking American who's just the opposite of her dull by the books civil service husband Henry. Because Maurice has a very suspicious mind, unlike Henry, his affair with Sarah has a lot of bumps in it. The end comes when he's all alone with her while, like almost during the entire film, Henry is away at work. The Miles house is hit by a German V1 rocked knocking Maurice down a flight of stairs and burying him in the rubble. It's when Maurice miraculously recovers that he notices that the concerned for his life and safety Sarah had completely changed but the reason for her disaffection for Maurice is totally misunderstood by him. That's what leads to the crisis that follows in later driving both lovers to the brink of madness or even death and self-destruction. The movie cleverly has a number of parallel scenes inserted into it where we see what's the real reason behind Sarah's strange behavior, it has to do with her religious beliefs. Sarah is torn between her religion, Catholicism, and her love, while she's married to Henry, for another man Maurice. We also see that Marcice is determined to have Sarah all to himself and that he doesn't care it if would in the end not only kill Sarah but her weak and overly sensitive husband Henry ,who's life without her would be worthless. The ending is a bit too over dramatic even for this schmaltzy tear-jerker with Maurice almost on the brink of an emotional melt-down. He's****MAJOR SPOILER***told by the Miles family doctor that his beloved Sarah's, who at first was only suffering from a very bad cold, condition turned for the worse and with that she suddenly and unexpectedly passed away. It's the guilt of not leaving Maurice and getting on with her life with Henry that seemed to have driven Sarah, unconsciously not willfully, to kill herself! Even though it wouldn't conflict with her religious beliefs and in the end make everything turn out for the better in this three sided wild and forbidden love affair. Somewhat dated but still hits the spot with Deborah Kerr as both beautiful and sexy as ever, even with all her clothes on. Deborah or Sarah does her best and succeeds in showing how it's hard to overcome one's emotions when nature or what turned out to be the man of her dreams, Maurice, takes hold of them. You have to give both Deborah Kerr and her co-star Van Johnson credit in generating enough heat in the theater, or at home of those watching the movie, without having to turn to up the thermostat and thus saving a mint on the energy bill.",
         "The Hays Moral Code specifically stated \"Adultery and illicit sex, sometimes necessary plot material, must not be explicitly treated or justified, or presented attractively.\" Still in effect at that time, this is certainly the most explicit treatment of the subject of adultery during the time of the code's strict enforcement from 1935-1955. (\"Baby Doll\" released in December, 1956 goes a bit further). While the movie should gets points for its explicit and adult treatment of the subject matter, the film does explicitly preach Catholicism which may be the reason that the theme was allowed. In the 1950's and early 1960's there was a Catholic anthology drama series on U.S. television which often dealt with serious issues like adultery, communism, abusive families, racism, incest, rape and abortion; issues that were almost never raised on television at the time. The show was apparently given a pass because it always ended with one character realizing the issues of his/her ways and having their soul redeemed by joining or rejoining the Catholic Church. This movie reminded me of that show. The movie does have terrific performances by Deborah Kerr, Van Johnson, and Peter Cushing. It should be watched just for the performances. They underplay their roles beautifully and hit emotional high points in just the scenes that need them. Graham Greene is an excellent writer and knows how to keep a plot moving and constantly surprises the audience. One can dismiss this movie as Catholic Propaganda, but the movie is touching, thoughtful and well done. The Catholic Propaganda only mars it slightly, a small price to pay for the pleasure it brings. It is a good affair between two handsome/beautiful people, even if it ends with a bit of repentance and feelings of guilt.",
         "An American writer meets the wife of a civil service acquaintance and quickly starts an affair with her. However Maurice is plagued with feelings of guilt and jealousy against Henry having Sarah, and bitterness that Sarah is being deceitful to her husband and perhaps, him too. After a bombing falls near their love nest, Sarah leaves and Maurice assumes that she had wished him dead. When Henry confides in him about his wife's possible infidelity, Maurice poses as her husband and hires a private detective to follow her and find out what she's doing. I have not seen the remake but was quite interested to see how a 1950's movie would manage to depict the illicit affair between Maurice and Sarah without breaking every moral code of the day. The answer is \u0096 with lots of talking. The film is significantly shorter than the modern version and had less controversy (or at least, does now) but it still manages to bring things out. The plot is pretty good but relies very heavily on the extended flashback/journal sequence to keep things going. The talk heavy feel is a little tiring but does work well \u0096 the characters' emotions are brought out well without profanity or nudity. I don't think Johnson fitted the role that well but he was still good. His inner bitterness and guilt came out well at points and he brings his complex character out well. Kerr is also good although her role is less difficult. She does have to carry the whole journal sequence near the end and she doesn't let the film dip. Cushing only has a few scenes but he is very good. He gives an English gent performance but eventually you can see the cracks as he tries to hold his feelings together. Overall this is a solid adaptation of the book that manages to bring out the subject matter without the sexual excess of the modern version. While it is a little heavy on dialogue at times, the emotions come out with all the stilted control of the period and it works quite well as a subversive melodrama."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Coronado Productions"],
      "summaries": ["In wartorn London Maurice Bendrix falls in love with neighbor Sarah Miles. They begin an illicit romance behind Sarah's husband's back. While war does not last forever, neither does love in this existentialist tale."],
      "budget": 0
   },
   "movielensId": 3126,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-02-23",
      "dvdReleaseDate": "2000-05-16",
      "directors": ["Edward Dmytryk"],
      "runtime": 105,
      "movieId": 3126,
      "title": "The End of the Affair",
      "mpaa": null,
      "actors": [
         "Deborah Kerr",
         "Van Johnson",
         "John Mills",
         "Peter Cushing",
         "Michael Goodliffe",
         "Stephen Murray",
         "Charles Goldner",
         "Nora Swinburne",
         "Frederick Leister",
         "Mary Williams"
      ],
      "imdbMovieId": "0048034",
      "originalTitle": "The End of the Affair",
      "genres": ["Romance"],
      "youtubeTrailerIds": [],
      "plotSummary": "A civil servant's wife (Deborah Kerr) in wartime London vows to leave her injured lover (Van Johnson) if he recovers.",
      "tmdbMovieId": 78256,
      "avgRating": 3.1962,
      "releaseYear": "1955",
      "numRatings": 79,
      "posterPath": "/xGJzPsiz9kgDRaIq5DbI73ZdKhQ.jpg"
   }
}