{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "panic",
            "id": 4210
         },
         {
            "name": "attack",
            "id": 10563
         },
         {
            "name": "sexual attraction",
            "id": 11190
         },
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "organ transplant",
            "id": 33773
         },
         {
            "name": "parasite",
            "id": 157634
         },
         {
            "name": "infestation",
            "id": 163395
         },
         {
            "name": "sex fiend",
            "id": 176792
         },
         {
            "name": "body horror",
            "id": 191564
         }
      ],
      "imdb_id": "tt0073705",
      "video": false,
      "title": "Shivers",
      "recommendations": [
         28942,
         29437,
         9538,
         27346,
         9540,
         24274,
         27813,
         11298,
         884,
         29161,
         13555,
         18196,
         26517,
         27814,
         14029,
         22244,
         28498,
         1694,
         15516,
         15762
      ],
      "backdrop_path": "/geNQL14KwHrRJKSMSiwTBI0soRL.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5288c7a0760ee32e64020612",
         "content": "Disease is the love of two creatures for one and other.\r\n\r\nShivers is written and directed by David Cronenberg. It stars Fred Doederlin, Paul Hampton, Lynn Lowry and Barbara Steele. Music is by Ivan Reitman and cinematography by Robert Saad.\r\n\r\nMontreal's Starliner Island Complex suddenly becomes home to parasitic organisms that upon entering a human host, turns them into flesh-eating sexual predators.\r\n\r\nCronenberg's first commercial feature film has become a little too over analysed over the years due to the Canadian auteur's subsequent career. Meanings and motives within Shivers have been searched and scrutinised so as to give it more resonance. It really isn't worthy of that sort of cranial thinking, but what Shivers is is a fun low-budget horror film, a movie that has dashes of Cronenberg magic that shows he started as he meant to go on.\r\n\r\nWith its chaotic observation of mundane everyday people suddenly turned into sexually charged beings now devoid of inhibitions, it's not hard to see why it caused some controversy upon release. Yet that sort of controversy is gold publicity really, and ultimately when you look at it now, it's played out as being more tongue in cheek than any design to shock the audience out of their seats. That's not to say there isn't horror here of course, one only has to see the brilliant opening to know this, but there is an intentional airiness about the piece, and yes! This is even as the director pushes buttons by pushing taboo subjects into our visual event.\r\n\r\nThe acting is generally poor, the sound mix is off and some of the dialogue is awfully cheesy, but Shivers still comes out in considerable credit. It's an important movie in the pantheon of horror because of its director, while it's enjoyable to tick off some of the traits that would dominate his work from this point on. It also makes you evaluate the state of horror as a genre today, with the ream of sequels, remakes and unsurprising slashers dominating the box offices, now more than ever we could do with a young up and coming Cronenberg type to announce himself to our cinematic world. We can but hope. 7.5/10",
         "url": "https://www.themoviedb.org/review/5288c7a0760ee32e64020612"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Roger St. Luc",
               "gender": 2,
               "credit_id": "52fe4549c3a368484e051777",
               "name": "Paul Hampton",
               "profile_path": "/ayJd34mycfSKp0HZ0AKbxGFoxxr.jpg",
               "id": 98476,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rollo Linsky",
               "gender": 2,
               "credit_id": "52fe4549c3a368484e05177b",
               "name": "Joe Silver",
               "profile_path": "/mjWYOWrluWOnJJLgyqRL71C5WP5.jpg",
               "id": 98477,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nurse Forsythe",
               "gender": 1,
               "credit_id": "52fe4549c3a368484e05177f",
               "name": "Lynn Lowry",
               "profile_path": "/90LneFEXHYxre58PYhK3huzLFM1.jpg",
               "id": 98420,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Betts",
               "gender": 1,
               "credit_id": "52fe4549c3a368484e051783",
               "name": "Barbara Steele",
               "profile_path": "/vhRuGp59lX3rB8h3k2zCS6ZC95w.jpg",
               "id": 5685,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nicholas Tudor",
               "gender": 2,
               "credit_id": "52fe4549c3a368484e051787",
               "name": "Allan Kolman",
               "profile_path": null,
               "id": 31533,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Janine Tudor",
               "gender": 0,
               "credit_id": "52fe4549c3a368484e05178b",
               "name": "Susan Petrie",
               "profile_path": null,
               "id": 98478,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ronald Merrick",
               "gender": 0,
               "credit_id": "52fe4549c3a368484e05178f",
               "name": "Ronald Mlodzik",
               "profile_path": "/k4CyONV4R4ncrMoFnYOFpLfdw6F.jpg",
               "id": 98479,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Detective Heller",
               "gender": 0,
               "credit_id": "52fe4549c3a368484e051793",
               "name": "Barry Baldaro",
               "profile_path": null,
               "id": 98480,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Kresimer Sviben",
               "gender": 2,
               "credit_id": "52fe4549c3a368484e051797",
               "name": "Vlasta Vrána",
               "profile_path": "/ug27TmlJNKvhJEa6xWGCpPz4o2q.jpg",
               "id": 58169,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4549c3a368484e051773",
               "name": "David Cronenberg",
               "profile_path": "/nFHIlkIuile5RmtSqbyCB4w8SpH.jpg",
               "id": 224,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4549c3a368484e05179d",
               "name": "David Cronenberg",
               "profile_path": "/nFHIlkIuile5RmtSqbyCB4w8SpH.jpg",
               "id": 224,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4549c3a368484e0517a3",
               "name": "Ivan Reitman",
               "profile_path": "/vYT8xpWCzKZc9F02Oqihxx1GFyg.jpg",
               "id": 8858,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4549c3a368484e0517a9",
               "name": "John Dunning",
               "profile_path": null,
               "id": 31180,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4549c3a368484e0517af",
               "name": "André Link",
               "profile_path": null,
               "id": 103867,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4549c3a368484e0517b5",
               "name": "Alfred Pariser",
               "profile_path": null,
               "id": 1022306,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4549c3a368484e0517bb",
               "name": "Robert Saad",
               "profile_path": null,
               "id": 65689,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4549c3a368484e0517c1",
               "name": "Patrick Dodd",
               "profile_path": null,
               "id": 957581,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4549c3a368484e0517c7",
               "name": "Erla Gliserman",
               "profile_path": null,
               "id": 1022308,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4549c3a368484e0517cd",
               "name": "Joe Blasco",
               "profile_path": null,
               "id": 103869,
               "department": "Visual Effects",
               "job": "Creature Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4549c3a368484e0517d3",
               "name": "Joe Blasco",
               "profile_path": null,
               "id": 103869,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe4549c3a368484e0517d9",
               "name": "Suzanne Garand",
               "profile_path": null,
               "id": 1286348,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "52fe4549c3a368484e0517df",
               "name": "Don Carmody",
               "profile_path": null,
               "id": 8303,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.926955,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 27429,
      "vote_count": 158,
      "budget": 179000,
      "overview": "The residents of a suburban high-rise apartment building are being infected by a strain of parasites that turn them into mindless, sex-crazed fiends out to infect others by the slightest sexual contact.",
      "similar": [
         485415,
         19908,
         72190,
         336843,
         82654,
         766,
         10925,
         15762,
         8408,
         9035,
         9003,
         24929,
         24920,
         14451,
         11683,
         19185,
         290999,
         21588,
         16281,
         19204
      ],
      "original_title": "Shivers",
      "runtime": 87,
      "poster_path": "/a9w5pMzS4xh9itERx3mlWjnf3Zt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "DAL Productions",
            "id": 15989,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canadian Film Development Corporation (CFDC)",
            "id": 4952,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinépix",
            "id": 6270,
            "origin_country": "CA"
         }
      ],
      "release_date": "1975-10-10",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Going mad is just the beginning of the terror...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["David Cronenberg"],
      "runtime": 87,
      "synopsis": "At Starliner Towers, a modern high-rise apartment complex on Starliner Island located just outside Montreal, prospective tenants are welcomed by the smarmy manager Merrick. In one of the apartment, Dr. Emil Hobbes, attacks a young woman, named Annabelle, who wears a school uniform. He strangles Annabelle to death, slices open her stomach, and pours acid in before slitting his own throat. In another apartment, Nicholas Tudor, sits in front of a bathroom mirror, apparently suffering from stomach convulsions. Tudor goes to Annabelle's apartment, and recoils from the scene of carnage, but leaves without telling anyone about it. The two bodies are found by a resident doctor who calls the police. The resident doctor, Roger St. Luc, is quite calm about it as the paramedics carry the bodies away. St. Luc goes to the office of Hobbes medical partner, Rollo Linsky, who describes the project they were working on which Rollo explains it as: \"a parasite that can take over the function of a human organ\", and he also reveals Hobbes' penchant for pedophilia, telling St. Luc that he was once caught \"examining a young girl's breasts for cancer\" when the girl was 12 years old. Meanwhile, Nick Tudor's neglected and concerned wife, Janine, seeks advice from St. Luc about her husband's sickness and reluctance to see a doctor. At the same time, Tudor leaves work early and goes home to Starliner Towers after more convolutions. At his apartment, he vomits what appears to be feaces over the balcony, just as two old women pass below. It thumps onto one of the women's umbrella, startling them. They think a dead bird landed on them due to the blood-stained splat on the umbrella. The fecal parasite slithers away into the undergrowth. In the laundry room of the building, an old woman investigates a trail of brown slime leading from an open window to a washing machine. As she lifts the lid, the parasite hurtles out and clamps onto her cheek. She tries to pull it off but cannot. At Dr. St. Luc's office, an elderly man complains to the doctor about stomach lumps saying that he may have caught them as a sexually transmitted disease from \"the girl in 1511\" - Annabelle Brown. Meanwhile, a distressed Janine Tudor visits her friend Betts to confide in her about Nick's recent behavior. Betts tells Janine to give Nick some space while she clearly makes sly remarks to Janine about how she looks. When Janine returns to the apartment, Nick has passed out on the kitchen floor after throwing up blood. In a corridor, two children play door knocking pranks until a parasite appears in the mail box opener at one of the doors (the Tudor apartment) and the kids flee away in terror. Inside the Tudor apartment, Nick callously dismisses Janine's worry about his health. When he is alone, he lays on his bed and encourages his chest lumps to move, talking to them as if he is talking to a pet. Meanwhile, Betts runs a bath, listening to a radio announcement about the murder and suicide at Starliner Towers. In the building physician's office, Dr. St. Luc seems indifferent to the amorous advances from his nurse, Miss Forsythe. They are interrupted by the telephone. Linsky calls St. Luc from Hobbes office downtown where he found Hobbes notes, which far exceed their original project. According to Linsky reading one paper, Hobbes wrote: \"Man is an animal who thinks too much\", and had a vision about creating a parasite which was \"a combination of aphrodisiac and venereal disease that will hopefully turn the world into one mindless orgy\". He was also using Annabelle as a guinea pig for his experiment and that he infected with a parasite through sexual contact but when she got out of control he killed her since she could infect others with the parasites. St. Luc tells Linsky that apparently Annabelle was very sexually active and infected three or four men at Starliner Towers and explains about the few cases of stomach lumps already and mentions that Janine Tudor's husband may have been one of Annabelle's sexual partners. Linsky arranges to meet them later in Tudor's apartment to confirm and warns St. Luc about encountering anyone at the building complex behaving in a strange way. Meanwhile, Betts continues to relax while soaking in her bath, unaware of the parasite forcing its way up through the plughole and heading right for the nearest orifice. Betts screams and struggles as the bathwater turns red and thrashes in agony... At this point, the chaos really begins as it reaches inexorable ascendancy. Nurse Forsythe stabs a sex-crazed man who jumps her in apartment. St. Luc arrives just as the infected man flees. He takes a sample of the infected man's blood for the lab to examine. At the same time, a parasite attacks an old French-speaking couple in the corridor before being impaled on the end of the old lady's walking frame. Soon, more assault by residents on others become more frequent. The old lady from the laundry room attacks a delivery man who shows up near her door. The infected delivery man then attacks a young woman and her little daughter in an elevator. Then the delivery man and infected woman and girl attack and infect the lobby security guard, and so on... Nick attempts to seduce Janine, but she resists when she feels the lumps moving in his stomach. At the same time, St. Luc finds the old French couple who tell him about their encounter with the parasite. While Nurse Forsythe keeps them company, the doctor the searches the basement dumpster where the old man claims to have threw the dead parasite, but gets ambushed by another infected man. Dr. St. Luc overpowers his assailant and unhesitatingly beats him to death. Afraid over what is happening to Nick, Janine is standing by her man as he sleeps... until a bloody parasite emerges from his mouth onto the pillow beside her. In a state of shock, she runs out of the apartment and into Betts... whom is also infected. Nurse Forsythe then leaves the elderly French couple and decides to try to leave from the building. St. Luc goes to Merrick's office and tells him to call the police. By now a zombie-like mob of people infected by the parasites is roaming all the corridors of Starliner Towers. The mob breaks into the old French couple's apartment and apparently infects them as well. In the basement garage, St. Luc finds Nurse Forsythe about to be raped by the infected security guard, and he shoots the man in the back, killing him with a gun that he takes from the guard. After attempting to escape from the car park, they are rammed by one of the 'crazies'. They try to get out on foot, but find the garage door closed and locked, and several 'crazies' approaching them. They are forced to flee back into the building. St. Luc and the injured Nurse Forsythe hide in the basement, waiting for the police to show up. In the lobby of the building, a young couple complains to Merrick (clearly infected at this point) about the disturbances. He ushers them into his office where the couple are immediately pounced on by a delirious group of orgyists and are infected as well. In Betts apartment, she comforts Janine, stroking her hair and leaning in close. She tells Janine that she always had a crush on her. As the two of them kiss, a parasite exchange takes place and Janine becomes infected. A little later, Linsky arrives at the Starliner Towers and hears distant noises, but nobody is around the lobby or anywhere else. He goes up to the Tudor apartment and finds the door wide open. Tudor is lying on the bed, his stomach seething with parasites. One of them lunges at Linsky who tries tearing them off with pliers. As Dr. Linsky stabbs the parasite with a kitchen knife, he is attacked and beaten to death by Tutor, who tears the parasite off the dead Linsky's face and crams it into his own mouth as an act of ownership. In the basement, Nurse Forsythe relates a dream she had about an old man saying: \"he tells me that even old flesh is erotic flesh, that disease is the love of two alien kinds of creatures for each other, that even dying is an act of eroticism\". A parasite appears crawling out of her mouth, and St. Luc knows right away that she is infected. He punchers her unconscious. As he carries her along a corridor, the wooden wall panels burst apart and a sea of arms break through, reaching at them. St. Luc is forced to leave the infected Forsythe behind and runs to Tudor's apartment. He encounters Tudor in the kitchen kneeling over Linsky's bloody corpse. St. Luc shoots Nick Tudor dead. He then tries to escape from the building, but finds all the exits blocked. He encounters a gay couple trying to get at him, then an old man with a young girl in another apartment. St. Luc makes his way to the indoor swimming pool where he sees the infected Betts and Janine there fooling around. St. Luc finds an open patio door and walks out. Sensing that he is free, he runs away from the pool area and outdoor patio and up a grass river embankment only to be confronted by HUNDREDS of \"changed\" people slowly and silently advancing towards him. Forced to retreat back into the pool area, he is pushed into the pool where the infected Betts, Janine, and even Nurse Forsythe await. As the mob of 'crazies' jump in and attack him from all directions, St. Luc finally loses his struggle to remain 'human' and allows the mob to consume him. In the final scene, the time is 5:26 a.m. about an hour before dawn as a radio announcement describes a wave of unexplained sexual assaults across Montreal and the surrounding area which may have originated at Starliner Towers and that the authorities as well as the centers for disease control are currently investigating a possible epidemic of some kind. The final shots over the end credits show a long line of cars with infected people leaving Starliner Island and driving across the bridge leading to Montreal and the rest of the outside world....",
      "writers": ["David Cronenberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073705/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NzY1NjM1MV5BMl5BanBnXkFtZTcwOTE4MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Paul Hampton, Joe Silver, Lynn Lowry | See full cast and crew »"],
      "reviews": [
         "Shivers(1975) is a fascinating first film especially for a person who was learning to direct professionly on the job. An interesting part about this movie is that Cronenberg did Shivers(1975) without having a clue of what people in the film crew does or containing knowledge of film terms. The fact that he made a cult classic is a testament to his potential at the time to be an excellent movie maker. Shivers is basically the first horror film made in Canada as far as I know and David Cronenberg was the first director to open the flood gates for the horror film in Canada. This motion picture mixes together the erotic with the zombie genre made famous by George Romero in 1968. In fact, there are many references to the zombie classic Night of the Living Dead. The movie is about parasites who enters people's bodies and turn them into sex maniacs. It dares to break many sexual taboos that many film makers would be afraid to explore. Shivers would provide a starting point for some themes that David Cronenberg would explore in later films like Rabid(1977), The Brood(1979), Scanners(1981), Videodrome(1983), The Fly(1986), Dead Ringers(1988), and Crash(1997). The two themes are disease as the transformation of the body into the next state of evolution for the human being and the other theme of the outsider who does not understand why they are so different from other people. Barbara Stelle provided the movie with many memorable moments especially the infamous \"bath tub\" scene. It is a groundbreaking movie because it would become a source of many movie directors for the next two decades. One great scene is the \"bath tub\" scene which is a classic example of building up suspense until the final moment when the scene ends. Another excellent scene is when the protagonist tries to escape outside and he goes back in as swarms of Sex zombies go chasing after him. I consider this movie the beginning of a trilogy I call the 'sexual evolution' trilogy. The trilogy starts out with Shivers(1975), continues with Videodrome(1983), and finishes with Crash(1997). Shivers(1975) would be a major influence for the scifi-action thriller The Hidden(1987), especially with the idea of a parasite entering a person's body and changing their entire personal behavior. Also influenced by Shivers were the Alien series(especially Alien(1979) which was made four years after Cronenberg's directioral debut) and there are a couple of examples of this influence. First, the two movies involve parasites who go in and put out of a person's body as well as having acid for blood. Second, They both take place in an isolated and high placed area with Alien(1979) taking place on a spaceship in the middle of nowhere and Shivers(1975) takes place on a apartment complex called the Skyliner Towers on the middle of an island that is isolated from the rest of Canada.",
         "Cronenberg's variation on the Zombie theme was his first full length feature film and for this it is surprisingly good. From the technical point of view, it is very amateurish. The lighting and camera work are highly reminiscent of home made Super 8, and the sound is bad beyond belief. Although the mindless creatures attacking anything that moves immediately recall the Zombies, Cronenberg's movie has some original ideas. In fact, watching German television these days, the subject of bored middle class diving into sex orgies (at least in their fantasy) seems more up to date than ever. Unlike Romero's Zombies, Cronenberg's creatures simply embark into endless sexual excesses, including minors. Indeed, one of the most scandalous scene shows two young girls on dog leashes, climbing up a stair and barking - unexcusable image! The special effects in \"Shivers\" work very well and are more slimy, organic, and visceral than say Romero's, and give better testimony of the vulnerability of the human body. They set the tone for Cronenberg's use of gore in his subsequent films. \"Shivers\" earned Cronenberg immediately the title of the \"reigning king of shlock horror\" - very appropriate.",
         "In the fancy Starliner compound in an island near Montreal, a mad scientist tests a parasite in the body of his mistress. He believes that man is an animal that thinks too much, and he develops a parasite to increase the violence and sexual desire of mankind. There is an outbreak in the condominium, with the fierce dwellers becoming zombies of sex. \"Shivers\" is the third feature of this great Canadian cult director David Cronenberg, indeed a very low budget trash movie, with a final cost of US$ 179.000,00. The story mixes humor and horror and the effects are very nasty and disgusting, a trademark of Cronenberg. The story is a kind of sexual version of \"The Night of the Living Dead\", with people turning out zombies of sex. The screenplay of 1979 \"Alien\" used many concepts of this movie. The interview of David Cronenberg in the DVD is excellent, and it is very funny to know that the actress Sue Patrick asked him to slap her face in the scenes that she needed to cry, and Barbara Steele reaction to this physical assault. My vote is seven. Title (Brazil): \"Calafrios\" (\"Shivers\")",
         "I'm a big fan of the director's but had never seen this one until the other day (the VHS re-release \"director's cut\" or whatever). The other user comments had let me to expect an amateurish curiosity, but I found it polished and feel no need to make any excuses for it (perhaps the new release is a cleaner print). It's pretty sly, the acting's not bad and I found the film most remarkable for its restraint and subtlety. I'm not sure I buy the idea that the parasites are a metaphor for Americanization - Cronenburg's concerns are, I think, more personal and abstract than such a reading gives him credit for. The movie is deliberately paced and the shock/gore factor is relatively low. I found it to be a modest footnote in a career that later bore stranger, richer fruit.",
         "An early piece from David Cronenberg, this is his first cinematic exploration of themes which he would continually come back to throughout his career in films such as eXistenZ, Videodrome, The Fly and Crash. to best explain these themes, i must qoute the man himself, \"I was saying, I love sex, but I love it as a veneral disease. I am Syphilis. I am Enthusiastic about it, but in a very different way from you.\" and while that doesnt shed a whole lot of light on the film, it sure is a hell of a qoute :) the plot of Shivers, aka The Parasite Murders, revolves around a parasite which has been bred to heighten sexual desire and other primal instincts while dampening our mental awareness. this parasite has been let lose within a high-tech high rise block thanks to the experiments upon a young girl by an older scientist. the horror begins immediately, as do the social metaphors and ideas of sex and death. it is interesting to note this film was produced before the outbreak of AIDs, but is entirely applicable in our modern world. in some ways this is a tale of warning, of what can go wrong and how we can destroy ourselves. but above all, cronenberg delights in sinking us into the flesh, so the film can also be seen as fable of a world gone mad with life and freedom, which many would not consider so horrific. it defies simple catergorisation, it is not just a story about rampantly sexually active teenagers like so many of its kind. it is a story about every person's desire for safety, and the darker desires which hide behind it. wonderfully directed, intriguingly written, there is little that i can fault this film for, except perhaps its little to obvious reference to Romero's Night Of The Living Dead. while it is obviously partly inspired by that film, and brilliantly reinterprets it for a new age and a new social strata, the tiresome zombies that stagger about like slugs are a little out of place, but fortunately it does not let the film down. a must see.",
         "Cronenberg's directorial feature film debut is built around a now-familiar amalgamation of sex, technology, and medicine gone mad. The Canadian \"Shivers\" (original American release title \"They Came From Within\", aka \"The Parasite Murders\") opens with a slide show advertising a creepily perfect-sounding high-rise apartment building isolated on an island but just minutes away from downtown Montreal. We are told that the complex contains practically everything necessary to maintain a comfortable life- medical and dental practices, clothing stores, a gift shop, a deli, recreation, etc. Ideally, it would seem, the only reasons a resident would leave would be to work, socialize with non-residents, or take a vacation, if that wasn't too redundant. But of course, something terrible is just under the polished surface. Cronenberg's direction is obviously not as polished as in later features, but we begin to see his signature style translated well into a full-length format.",
         "***MAJOR SPOILERS*** Having felt that man has not lived up to his potentials since he's restricted by the laws imposed on him by society Dr. Emil Hobbs, Fred Doedrlein, has developed this parasitic type earthworm. The parasite when entering the human body, orally as well as sexually, will cause the person to drop all his or her inhibitions, as well as their pants and skirts, and let it all hang out attacking and raping anyone they come in contact with. Having implanted his new \"invention\" on one of his patients Annabelle, Kathy Graham, Dr. Hobbs soon realized that he had created a Frankenstein monster! In a wild frenzy Dr. Hobbs strangled Annabelle in his suite at the Starliner Apartment Complex before , feeling a deep sense of guilt, slitting his own throat. It turned out to be too late for the guilt-ridden Dr. Hobbs to stop the sexually transmitted plague that he created. It soon becomes evident that the parasite left the dead Annabelle's body and started infecting everyone in the apartment complex. Traveling though the air-condition ducts garbage disposal and plumbing systems of the apartment complex the parasite has easy excess to everyone living there. By the time the movie is over everyone living and working in the apartment complex had become a victim of the attacking parasite. Both young and old, from pre-teenagers to senior citizens, people that were infected by the parasite became so horny and sexually aroused that they went on a full scale wild orgy by the time the movie ended. These uncontrollable sexual acrobatics not only spilled into the surrounding neighborhoods but city's and towns as well. Even though the movie \"They Came from Within\" or \"Shivers\" was made some five years before the emergence of the deadly AIDS epidemic in the early 1980's its striking similarities to that both sexually and blood transmitted disease is absolutely amazing. The deadly parasite, like the AIDS virus, enters it's victim and causes him or her bodily defenses to totally collapses: It's there where the similarities between the AIDS virus and parasite ends. The parasite soon causes its infected host to go out looking, like a vampire looking for blood to survive, for new victims and strikes out at anyone uninfected in a wild sexual frenzy. This ends up with the infected person implanting the parasite in his or her victims body to start the whole cycle, person to person transmission, all over again. The film is a lot like \"Invasion of the Body Snatchers\" in that nobody knows who's been infected, like the people who's bodies were taken over by the body snatchers, by the parasite until it's too late. The resident doctor at the apartment complex Dr.Roger St Luc, Paul Hampton, gets the lowdown to what exactly is going on there from his colleague Dr. Rollo Linsky, Joe Silver. Rollo had been working with the late Dr. Hobbs before he completely cracked up and killed, along with Annabelle, himself. It's later that Rollo himself falls victim to the deadly parasite when he's attacked by Nicholas Tudor, Allan Kolman, a resident at the apartment complex. Tudor had been infected by the parasite when, cheating behind his wife' Janine's (Susan Petie) back, he had a sexual tryst with Annabelle. Trapped in the complex with its sex-crazed residents trying to both rape as well has induct Roger into their ranks has him make an desperate attempt to escape the fate that awaits him there. Roger tries to cross the causeway, connecting Starliner Island to the mainland, making a wild dash to both freedom safety. *****SPOILERS****** It's then that Roger realizes just how helpless his both escape attempt and him warning the general public is! The cat, or parasite, is out of the bag, or plumbing system! And with it being able to greatly intensify man's most darkest and suppressed, through laws and religion, thoughts and taboos there's nothing on God's green earth, military medically or psychologically, that can stop it!",
         "For me, the best of Cronenberg's earlier works is an exercise in claustrophobic tension building, wrapped in a concept of pure exploitation, and all further used as an excuse for a wicked Buñuelian-like satire on the woes of contemporary consumer culture and the antiseptic nature of modern living. The way that Cronenberg creates this world of gated purification turned into a beacon for the very best of late twentieth century existence, only to then pull the walls down from within as the characters are turned into dribbling, sex starved deviants is not only an effective horror-film scenario - drawing on the prevalent notions of isolation and paranoia usually found in films of this particular nature - but also as a comment on the vapid, overwhelming sense of boredom that modern life, with all its consumer fads and soulless pursuit of social fulfilment can present. Like the very best of these retro exploitation films, Shivers (1975) works on at least two distinct levels of enjoyment and interpretation, with the obvious shocker elements suggesting an even more warped take on the territory of Night of the Living Dead (1968) - with sidelines into the same kind of atmosphere created by John Carpenter in his subsequent Assault of Precinct 13 (1976) - while the more personal and psychological aspects of the script complement the more recognisable elements of horror in a way that creates a perfect symbiosis between presentation and form. Admittedly, the look of the film and the obvious limitations of the low budget might disappoint some viewers more accustomed to glossier, 21st century thrillers; whilst the once shocking elements of the film might even seem somewhat quaint, especially in light of the veritable pornography of violence in films such as Saw III (2006), Hostel (2005) and The Hills Have Eyes (2006). Nonetheless, I think many viewers more familiar with horror/thriller/science-fiction cinema of this particular period will still be able to appreciate what Cronenberg was trying to achieve with this depiction of violence and depravity; with the scenes and scenarios - especially in the film's frenzied final act - really going for the jugular in terms of outré shock spectacle and the subversion of traditionally wholesome, all American iconography. The idea of a small band of survivors coming together in the name of self-preservation as an inexplicable horror affects those closest to them is still a well worn concept in horror cinema, and one that works incredibly well when combined here with Cronenberg's cold, Kubrickian vision of a sterile, social environment as sex and death become distorted amidst moments of stock exploitation, sly wit and a genuinely subversive sense of satirical absurdity. Though it is admittedly rough around the edges and lacking in the obvious prestige of films like The Brood (1979) and Videodrome (1982), I'd still take this over A History of Violence (2005) or Eastern Promises (2007) any day; with Shivers standing out as not only one of Cronenberg's very best films, but one of the most unique, unconventional and completely engrossing exploitations works of this particular cinematic period.",
         "The first big screen flick for Canadian horror master David Cronenberg was this skin-crawling B horror movie. Residents of a high rise apartment building are being attacked by parasites that are turning them into crazed zombies with nothing but sexual assault on their minds! Shivers is an effectively disturbing movie, not unlike most of Cronenberg's later horror classics. It's had a good hand in influencing later creature flicks. The story has a good premise and builds some terrific tension as it escalates to a great claustrophobic climax. What's clever about this movie is that most of the horror is suggested, we don't see the parasites much and their elusiveness just helps to create more tension. The makeup effects are decent for a low budgeter and the cast turn in some adequate performances, horror veteran Barbara Steele is a nice addition to the cast. Shivers is a entertaining slice of B horror that manages to live up to its title well. A must-see for Cronenberg fans. *** out of ****",
         "If nothing else, this film offers proof that the brilliant and sick director David Cronenberg wasn't always brilliant, but he sure was sick from the get-go. This low-budget classic is awash in bad acting, awful dialogue, poor visual effects, and Ed Woodian continuity errors (a doctor is eating a pickle; he takes one bite, and by the time he takes a second bite, another doctor has met with several patients and a businessman has gone to and from his office). The appearance of the parasitic creatures is particularly amusing (but probably not on purpose). What's astonishing is that, despite all the plot holes, technical problems, and general unintentional hilarity, Cronenberg manages to sneak in a few truly disturbing moments that rival anything he'd do later. The opening slide-show with its unnaturally chipper voice-over is chilling, vaguely recalling \"The Shining\" and \"The Stepford Wives\" (neither of which were made yet). Lynn Lowry's monologue about \"the flesh\" (a recurring Cronenberg theme, whatever it means) is extraordinarily creepy. The Cronenberg feel can be felt throughout: basically, the contrast of a shiny, high-tech surface with an unspeakably nasty primal evil lurking just underneath. Many scenes go on for too long, but this would become a big part of his style; keeping the cameras running long after most directors would have cut away from the gore and weirdness. And how can you completely hate a movie that ends with Montreal being destroyed in a mindless orgy of sex and violence?"
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Canadian Film Development Corporation (CFDC)",
         "Cinépix",
         "DAL Productions"
      ],
      "summaries": [
         "A scientist living in an apartment complex kills a girl and uses acid to destroy her internal organs, and then kills himself. While investigating, a doctor discovers that the scientist was doing experiments on the use of genetically engineered parasites as organ transplants. Soon, other people in the complex begin showing signs of carrying the parasites, spreading the things through wanton orgiastic abandon, and the complex begins suffering an attrition problem.",
         "In the fancy Starliner compound in an island near Montréal, a mad scientist tests a parasite in the body of his mistress. He believes that human is an animal that thinks too much, and he develops a parasite to increase the violence and sexual desire of humankind. There is an outbreak in the condominium, with the dwellers becoming fierce zombies of sex.",
         "The residents of a suburban high-rise apartment building are being infected by a strain of parasites that turn them into mindless, sex-crazed fiends out to infect others by the slightest sexual contact."
      ],
      "budget": 179000
   },
   "movielensId": 31270,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-10-10",
      "dvdReleaseDate": "1998-09-30",
      "directors": ["David Cronenberg"],
      "runtime": 87,
      "movieId": 31270,
      "title": "Shivers",
      "mpaa": "R",
      "actors": [
         "Paul Hampton",
         "Joe Silver",
         "Lynn Lowry",
         "Barbara Steele",
         "Allan Kolman",
         "Susan Petrie",
         "Ronald Mlodzik",
         "Barry Baldaro",
         "Vlasta Vrána"
      ],
      "imdbMovieId": "0073705",
      "originalTitle": "Shivers",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["eK9Wal9Dvic"],
      "plotSummary": "The residents of a suburban high-rise apartment building are being infected by a strain of parasites that turn them into mindless, sex-crazed fiends out to infect others by the slightest sexual contact.",
      "tmdbMovieId": 27429,
      "avgRating": 3.375,
      "releaseYear": "1975",
      "numRatings": 300,
      "posterPath": "/a9w5pMzS4xh9itERx3mlWjnf3Zt.jpg"
   }
}