{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "james dean",
         "id": 4425
      }],
      "imdb_id": "tt0050558",
      "video": false,
      "title": "The James Dean Story",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081611",
               "name": "Martin Gabel",
               "profile_path": "/nkfnHSpO3c9HzLjnaMqBRzepsIu.jpg",
               "id": 6931,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "himself",
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081615",
               "name": "James Dean",
               "profile_path": "/aXH6h7YIEtMOE5SZQmr79nJguQt.jpg",
               "id": 2749,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "himself",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081619",
               "name": "Lew Bracker",
               "profile_path": null,
               "id": 44625,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "himself",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808161d",
               "name": "Marvin Carter",
               "profile_path": null,
               "id": 44626,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "himself",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081621",
               "name": "Patsy D'Amore",
               "profile_path": null,
               "id": 44627,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "himself",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081625",
               "name": "Charles Dean",
               "profile_path": null,
               "id": 44628,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "himself",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f8081629",
               "name": "Emma Dean",
               "profile_path": null,
               "id": 44629,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "himself",
               "gender": 0,
               "credit_id": "52fe4415c3a36847f808162d",
               "name": "Louis de Liso",
               "profile_path": null,
               "id": 44630,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "himself",
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081631",
               "name": "Clark Gable",
               "profile_path": "/cebtqK6Ydrhi5ip0V12MDj3bDvd.jpg",
               "id": 11492,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "himself",
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081635",
               "name": "Dennis Hopper",
               "profile_path": "/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg",
               "id": 2778,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "himself",
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081639",
               "name": "Rock Hudson",
               "profile_path": "/reiGa8Kj40Mg9A23Emg6tp9qkm.jpg",
               "id": 18735,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "himself",
               "gender": 1,
               "credit_id": "52fe4415c3a36847f808163d",
               "name": "Jayne Mansfield",
               "profile_path": "/dvxjjuKMWICK5pjAFj7rWoVlMwU.jpg",
               "id": 40177,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4415c3a36847f8081641",
               "name": "Natalie Wood",
               "profile_path": "/1Z4HYNFGVpXfvteNLGJteetojfW.jpg",
               "id": 2769,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f80815d7",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f80815dd",
               "name": "George W. George",
               "profile_path": null,
               "id": 44623,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4415c3a36847f80815e3",
               "name": "Stewart Stern",
               "profile_path": null,
               "id": 2768,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f80815e9",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f80815ef",
               "name": "George W. George",
               "profile_path": null,
               "id": 44623,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f80815f5",
               "name": "Leith Stevens",
               "profile_path": null,
               "id": 40460,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f80815fb",
               "name": "Robert Altman",
               "profile_path": "/xA6n9OVD5pVrctLtmxwyhtVFcEf.jpg",
               "id": 9789,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4415c3a36847f8081601",
               "name": "George W. George",
               "profile_path": null,
               "id": 44623,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53da86c40e0a265a520001b2",
               "name": "Leith Stevens",
               "profile_path": null,
               "id": 40460,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "53da86580e0a265a46000175",
               "name": "Maurice Binder",
               "profile_path": null,
               "id": 1348145,
               "department": "Crew",
               "job": "Title Graphics"
            },
            {
               "gender": 0,
               "credit_id": "53da86790e0a265a4c000154",
               "name": "Louis Lombardo",
               "profile_path": null,
               "id": 1348146,
               "department": "Crew",
               "job": "Production Office Assistant"
            },
            {
               "gender": 0,
               "credit_id": "53da86850e0a265a46000182",
               "name": "David Stone Martin",
               "profile_path": null,
               "id": 1348147,
               "department": "Crew",
               "job": "Title Graphics"
            },
            {
               "gender": 0,
               "credit_id": "53da86e50e0a265a56000192",
               "name": "Bert Schoenfeld",
               "profile_path": null,
               "id": 122083,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "53da87240e0a265a43000198",
               "name": "Jack Kirschner",
               "profile_path": null,
               "id": 1348149,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "53da87320e0a265a59000199",
               "name": "Cathey Burrow",
               "profile_path": null,
               "id": 1348150,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "53da874f0e0a265a4c00016c",
               "name": "Louis Clyde Stoumen",
               "profile_path": null,
               "id": 44624,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5766af659251411f6c000a29",
               "name": "James Nelson",
               "profile_path": null,
               "id": 14842,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.844382,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 5652,
      "vote_count": 6,
      "budget": 0,
      "overview": "Released two years after James Dean's death, this documentary chronicles his short life and career via black-and-white still photographs, interviews with the aunt and uncle who raised him, his paternal grandparents, a New York City cabdriver friend, the owner of his favorite Los Angeles restaurant, outtakes from East of Eden, footage of the opening night of Giant, and Dean's ironic PSA for safe driving.",
      "similar": [
         17654,
         51828,
         41630,
         200727,
         10358,
         10096,
         38,
         28468,
         18239,
         35056,
         11322,
         388,
         4233,
         2667,
         254470,
         11216,
         16869,
         639,
         668,
         301337
      ],
      "original_title": "The James Dean Story",
      "runtime": 81,
      "poster_path": "/3R1cmF49zhMnXegSlkKdVypaIze.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1957-08-13",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Robert Altman",
         "George W. George"
      ],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Stewart Stern"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0050558/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0OTYzNDcwNF5BMl5BanBnXkFtZTcwNzAzMzU1MQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Martin Gabel, James Dean, Lew Bracker | See full cast and crew »"],
      "reviews": [
         "Perceptions will vary wildly about this film and may parallel some misunderstandings of who Dean was: Unless you have an intuitive view, you might think of Dean as arrogant or standoffish...the icon you see in posters of \"rebel\". In reality he was shy, tender, yet very driven to constant self-exploration. This documentary, shot not long after Dean's passing, successfully tells his story through his real friends and family. Hollywood apparently no longer aspires to make this kind of honest film without the sensationalism and innuendo heaped in for \"box office\". Back in '57 folks didn't cry on cue just to prove the depth of their sentiments while being interviewed. Yet one can plainly feel the love felt and the deep impression Dean made on those around him. Altman and George reveal that the \"rebel\" aspect attributed to Dean was not some sort of love of violence (a la today's Pulp Fiction), but was Dean's expression of loneliness and search for acceptance...much like the character Cal in East of Eden.",
         "I liked this documentary THE JAMES DEAN STORY a lot when I watched it for the first time. As I had not really seen any other documentaries about Dean to compare with, it provided me with much information about the actor unknown to me at the time. When I watch it again now, I realize that there have been made several more thorough, and perhaps less speculative documentaries about James Dean since this was first released in 1957. This documentary is clearly a product of its time; Dean had tragically passed away only two years before, and one senses that the film tries to present him in a way to match the expectations of his fans. Whereas some later documentaries (and biographies) have made a point of trying to separate the man and the myth, THE JAMES DEAN story is transparently calculating at times. The narrator Martin Gabel also speaks in rather calculating (if engaging) manner, as if able to walk into Dean's soul and read his thoughts (a side-note: Marlon Brando reportedly considered doing the narration, but finally declined). This film is clearly aimed at a popular audience, who has not been constantly fed with documentaries about anything and everything through TV such as today. On the plus side, however, the documentary is not so overly concerned with Dean's status as a \"Hollywood rebel\" as one might expect. Much focus is also given to other aspects of his life than being a movie star, such as his interest in painting and playing the drums. Some of the interviews are also of interest; the recollections of the two bartenders whom Dean used to hang around with shed light on the cheerful, less solemn side of James Dean. The part where Dean's cousin Marcus (at that time about ten years old) reads out loud a letter he received from Dean a few months before the latter's sudden death is quite touching. Leith Stevens' jazzy soundtrack is excellent, and really fits the mood of the film. In the end, THE JAMES DEAN STORY is by all means worth to watch to anyone interested in the life and talent of James Dean, though there have been made more all-around satisfying documentaries since the time of its making. (This review has later been somewhat revised and updated)",
         "I know nothing of this film's release history -- how it was received, whether it played as a feature or what -- but either it reflects the mythology that was growing in 1957 around the actor who died only two years before this fillm was released, or it actually help create the mythology. Camera work is wonderful and there is outstanding use of archive stills, and some of the reinactments are actually effective. There is a certain heavy handedness, however. The narration is both ham-fisted and flowery, and Martin Gabel's delivery sounds somehow threatening, especially when he doubles as an interviewer of the friends and acquaintances who share their recollections on screen. The Dean family participated, and I can't help but think director Robert Altman had to have tricked them to get them to do things like giving startled reactions for him to cut in at the moment when James Dean's death is reported in the film. Still, there are wonderful things I've never seen or heard in a lifetime of absorbing Dean biographies of every stripe, such as a tape recording Dean himself made of a conversation with his uncle about what makes a good auctioneer.",
         "If you know anything about James Dean, then this movie will probably not add much to your knowledge. What we see of Dean is mainly through still photographs. Most of these are just portraits that add little to the film, but there is an occasional one that surprises, like a nice one of Dean enjoying himself in a ballet class. The scene of real interest, which is saved for the end, is from a black-and-white audition Dean did for \"East of Eden.\" The tone of the narration would be appropriate for the biopic of a saint--you are made to think that Dean's early death was some sort of national calamity. There are several interviews with some of Dean's relatives, friends, and even some restaurant owners and taxi drivers. The depth of the questioning is often inane, such as when the interviewer asks the restaurant owners, \"How was his appetite?\" We watch as a previous friend rummages through a box of Dean's miscellaneous stuff like phone numbers and a note from his laundry. It seems that everything that Dean touched was sacred. We don't even get any insights from Dean's girlfriend, the one with whom, \"for the first time he found the timid belief that life was possible.\" The most frustrating thing about this film is the narration's constant speculations about Dean's motivations and thoughts. For example, consider this, \"He took his envy to the beach. He looked at the ocean and he was jealous of its power. He envied the gulls for having found each other. He envied them their freedom and their solitary flights. Suddenly he knew that as an actor he could be the ocean and flood everything with his power. As an actor he could be a gull.\" A good part of the movie is filled with such florid prose that has no basis in fact. Amid all of the speculations there is none about the common one of Dean's being homosexual, or bisexual. He supposedly avoided the draft by registering as a homosexual. The main question I have always had about Dean is the extent to which he manufactured his own myth of being the sensitive, misunderstood, moody, independent intellectual. This film got me no closer to answering that.",
         "There is something very appealing about a documentary that dares to psychologize its subject (if not to the point of the Self digression), because so many documentaries, these days, try to feign objectivity to the breaking point, even when, ala Michael Moore, their position- pro or con, is manifest from the get-go. Similarly, the personal accounts of Dean seem far more genuine than later documentaries in which interviewees seem to mug for the camera, and pull apocryphal tales out of their asses, just to get their own lousy fifteen minutes in the sun. The interviewees here are speaking contemporaneously, before Dean's legend really took off, and there is none of the deliberate or unintended fuzzing of memories towards the better angels of Dean's nature. The lone exception to this particular good quality of the film, is a scene where Altman gets the family and friends of Dean to re-enact their reactions to first hearing of Dean's death in a car crash of his Porsche on September 30th, 1955. What makes this section so poor a piece of filmmaking is the fact that earlier, we get to listen to a surreptitiously recorded 'real' conversation between Dean and his relatives, and the contrast between that and the 'scripted' parts is so great. Also, the film makes good use of the slow panning technique over still photographs that would later be used so successfully by documentarian Ken Burns. However, a caveat should be noted, and that is that the reason the technique works so well in the film is that the source photos are so intriguing. Yes, Dean comes off as a terminal narcissist, but he really did know how to strike the pose, and surround himself with photographer pals to immortalize himself. That said, the film, even at its mere 79 minutes of length, tends to wear a bit thin after the hour mark, because the reality is that Dean, despite this film's best intentions and claims, was not a particularly good actor. He was a relentless and born ham, and one need only watch Marlon Brando and Montgomery Clift, vis-à-vis Dean, to see the gulf between good and mediocre Method actors. Yet, while scenes from his films are few, there are some good passages with some of Dean's friends from New York and Los Angeles restaurants, some outtakes from films, newsreels of the opening of Giant, and a Public Service Announcement for safe driving, which more than make up for the film's deficiencies. Thus, The James Dean Story is a film and DVD worth watching, even if there are no extras, for its dated style becomes that rare quality that enhances even as it detracts. When was the last time you engaged a piece of art you could say even that of?",
         "I watched the movie because Robert Altman directed it, but I'd assumed it was going to be a straight forward documentary of Dean's life. Then about half way through it something didn't feel right. The people being interviewed spoke like they were on automatic pilot and the childhood photographs chosen for the movie had the quality of a spoof. I watched it a second time and realized it was Altman's documentary of the American Celebrity Cult, not James Dean. Our devotion to movie actors was reaching a new zenith in the 1950's and the life and death of Dean was a timely example of it. It's a movie about us in the same way Nashville is, or A Wedding, or Short Cuts.",
         "The James Dean Story is the first documentary made about James Dean two years after his death in 1957.Martin Gabel provided the narration that chronicled Dean's short life and career using still photographs.Also included were interviews from relatives,friends and the owner of his favorite restaurant located in Los Angeles.Finally,the viewer is also treated outtakes from his movie East Of Eden and the videos of the opening night of his other movie,Giant. Considering that this documentary is done almost 60 years ago,I still think that it was good during its time.It probably helped in forming the James Dean myths of an actor who died early considering that the best is yet to come from this \"one of a kind\" and enigmatic movie star.",
         "\"The James Dean Story\" is introduced as \"A different kind of motion picture,\" explaining, \"The presence of the leading character in this film has been made possible by the use of existing motion picture material, tape recordings of his voice and by means of a new technique - dynamic exploration of the still photograph.\" The only \"tape recordings of his voice\" noteworthy is one short recording Mr. Dean make while visiting his family in Indiana; he wanted to record any family recollections of his great-grandfather Cal Dean, intrigued because he played a similarly named \"Cal\" in \"East of Eden\". Dean asks if Cal Dean was interested in art, and learns the relative was an auctioneer. James Dean was interested in art and had warm relationship with his family, obviously. That's the only 100% accurate revelation in this documentary. James Dean was interested in art and had warm relationship with his family. An amazing \"screen test\"/\"outtake\" from \"East of Eden\" appears near the film's end. It's a black and white scene between Dean (as Cal Trask) and co-star Richard Davalos (as Aron Trask). Dean is at his mesmerizing best. If this scene appeared only here, and no \"East of Eden\" film was completed, this documentary would be an essential, high rated film. But the scene, a perfect \"10\" in isolation, should be considered an \"East of Eden\" extra. Dean's \"Traffic Safety Film\" is also worth seeing. There are the expected interviews with family and friends. My favorites were the guy (Lew Bracker) going through a box of stuff Dean left with him, and Dean's family. There wasn't enough from Aunt Ortense and the letter from Dean to his little cousin was very nice. More reading of Dean's letters would have been welcome. Dean's unidentified writer friend seemed to have a better thesis for the film; filmmakers might have considered developing it as a main focus. Robert Altman's direction of Martin Gabel's reading of Stewart Stern's script is dreadful. What were they thinking? Perhaps, filmmakers can be forgiven due to the closeness of Dean's passing. Don't expect \"The James Dean Story\" at all. This movie is more about Dean's effect on people (both the fans and filmmakers) than the man. It is very clearly an early piece of the James Dean myth-making \"legend\". Tommy Sands sings \"Let Me Be Loved\". The narrative refers to Dean as \"He\" with a god-like air. The shots of Dean's family seeming to \"know\" the moment he dies are truly wretched. ** The James Dean Story (8/13/57) Robert Altman ~ James Dean, Martin Gabel, Richard Davalos",
         "This 1957 documentary was thrown together to capitalize on the Dean legend and hopefully cash in on it. Out of luck - even Dean's ardent fans avoided this turkey. Using still photography and a morose narrator, Martin Gabel, this contains little useful information not already known about Dean. Interviews with family and neighbors back home shed little light - they are so terminally dull and brimming with flat affect, one is astonished that Dean's fluidity of expression and sensitivity grew out of this environment. Of some value is an outtake from EAST OF EDEN (presented here in dimly lit black and white) between Dean and Davalos. It's a gruelling 82 minutes.",
         "It was amusing when a voiceover told me at the beginning that \"a revolutionary new technique will be used, the moving exploration of photographs,\" by which they meant that instead of showing footage of Dean, they would pan from the bottom corner of a still photograph up to his face, or do crazy closeups into his face to show him coming towards us. This is the only funny thing about this very drab account of the same old rubbish about Dean. The one thing this one has above the others is a lot of interviews with real people in Dean's home town, his parents - many of who documentarians would not be able to find today. But perhaps that's a good thing, because none of them have anything interesting to say. A real piece of rubbish. 0/5."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "This documentary, which was undertaken soon after James Dean's death, looks at Dean's life through the use of still photographs with narration, and interviews with many of the people involved in his short life. Interviewees include the aunt and uncle who raised him after his mother's death (when James was 9), his fraternal grandparents, a cabdriver friend in New York City, and the owner of his favorite restaurant in Los Angeles. James's father, who was alive when the film was made, does not get a single mention.",
         "Portrait of James Dean assembled from existing material includes Jenseits von Eden (1955) outtakes, shots from the opening night of Giganten (1956), and his TV safe driving message (Dean died in a car crash)."
      ],
      "budget": 35000
   },
   "movielensId": 3136,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-08-13",
      "dvdReleaseDate": "1999-11-23",
      "directors": [
         "Robert Altman",
         "George W. George"
      ],
      "runtime": 81,
      "movieId": 3136,
      "title": "The James Dean Story",
      "mpaa": "",
      "actors": [
         "Martin Gabel",
         "James Dean",
         "Lew Bracker",
         "Marvin Carter",
         "Patsy D'Amore",
         "Charles Dean",
         "Emma Dean",
         "Louis de Liso",
         "Clark Gable",
         "Dennis Hopper",
         "Rock Hudson",
         "Jayne Mansfield",
         "Natalie Wood"
      ],
      "imdbMovieId": "0050558",
      "originalTitle": "The James Dean Story",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Released two years after James Dean's death, this documentary chronicles his short life and career via black-and-white still photographs, interviews with the aunt and uncle who raised him, his paternal grandparents, a New York City cabdriver friend, the owner of his favorite Los Angeles restaurant, outtakes from East of Eden, footage of the opening night of Giant, and Dean's ironic PSA for safe driving.",
      "tmdbMovieId": 5652,
      "avgRating": 2.81915,
      "releaseYear": "1957",
      "numRatings": 47,
      "posterPath": "/3R1cmF49zhMnXegSlkKdVypaIze.jpg"
   }
}