{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "deep sea",
         "id": 2769
      }],
      "imdb_id": "tt0417415",
      "video": false,
      "title": "Aliens of the Deep",
      "recommendations": [
         38275,
         86598,
         58789,
         159673,
         322603,
         5521,
         27816
      ],
      "backdrop_path": "/l4LNrumbRW9Z34kIvijAEllKVG8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4446c3a368484e019bcd",
               "name": "Anatoly M. Sagalevitch",
               "profile_path": "/wyQbndvdr7j05GaO6Bmp2O5fB0N.jpg",
               "id": 93215,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4446c3a368484e019bd1",
               "name": "Pamela Conrad",
               "profile_path": null,
               "id": 93216,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "55fda47a92514152ae0013e0",
               "name": "James Cameron",
               "profile_path": "/zy2foCd8PEtvCcsX48cROdQdDLB.jpg",
               "id": 2710,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4446c3a368484e019bc3",
               "name": "James Cameron",
               "profile_path": "/zy2foCd8PEtvCcsX48cROdQdDLB.jpg",
               "id": 2710,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4446c3a368484e019bc9",
               "name": "Steven Quale",
               "profile_path": null,
               "id": 93214,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55422fec9251414aee003e34",
               "name": "Rachel Wyn Dunn",
               "profile_path": null,
               "id": 1447557,
               "department": "Crew",
               "job": "Compositors"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.197155,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22559,
      "vote_count": 20,
      "budget": 0,
      "overview": "James Cameron teams up with NASA scientists to explore the Mid-Ocean Ridge, a submerged chain of mountains that band the Earth and are home to some of the planet's most unique life forms.",
      "similar": [
         56288,
         173,
         276909,
         67675,
         9728,
         11607,
         40978,
         46020,
         11019,
         19492,
         63333,
         32147,
         18735,
         168399,
         33627,
         77485,
         65695,
         40534,
         73303,
         54487
      ],
      "original_title": "Aliens of the Deep",
      "runtime": 47,
      "poster_path": "/pB1HMawACKSpuxcYiufw2pzX63c.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Walden Media",
            "id": 10221,
            "origin_country": ""
         }
      ],
      "release_date": "2005-01-21",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "James Cameron",
         "Steven Quale"
      ],
      "runtime": 100,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0417415/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NjU2ODA1M15BMl5BanBnXkFtZTcwNzI0NDcyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: James Cameron, Anatoly M. Sagalevitch, Genya Chernaiev | See full cast and crew »"],
      "reviews": [
         "OK.. i was super excited to see this movie.. i didn't care that the 3-d glasses were giving me a mild headache and i had to cock my head and squint to make things go into \"3-d focus\" sometimes. The Movie was awesome until the end when they showed the computer rendered graphics of what they thought the actual aliens might look like.. that was a super bad way to end a good film. Also.. it was WAY TO SHORT FOR THE MONEY I SPENT. what i'm saying is, they had a lot of really good underwater footage of animals a person does not get to see in action very often at all.. so instead of showing them for 10-20 seconds, why not show them for at least 5 minutes each, and maybe talk about what animal it is. I mean c'mon these people are marine biologists, and all they say is \"neat, cool, look at that\" i mean DUH!! if i was there, that is what i would say to!!! tell me something i don't know. the movie was so short they should've shown the animals for way longer, i would not have gotten bored seeing them... to bad i don't even know what they are called, because the retards just said \"wow, thats cool\" instead of \"this is this kind of animal. this is how it survives, etc...\" I don't regret going to the movie. but i just wish they would've shown more of the footage they had, and the ideas about exploring space were cool and informative, but i really hated the computer graphics stuff they did. they could've shown those crazy octopus things for like 10 minutes and i would not have gotten bored with the image at all.... and the same goes for basically all the animals they ran into down there.",
         "When it comes to action movies, James Cameron is one of my favorite directors. In particular, \"The Abyss\" and \"Terminator 2\" are two of my all-time favorite movies. Like others, I'm disappointed to see that since \"Titanic\" Cameron is only making documentaries and I'm looking forward to see his \"Battle Angel\" (currently scheduled for a 2007 release), which will be his first feature in 10(!) years. I didn't really like \"Expedition: Bismarck\" and \"Ghosts of the Abyss\", so my expectations from \"Aliens of the Deep\" weren't that high. Still, I got disappointed. I watched the 95-min DVD version and felt like I was watching a \"behind the scenes\" featurette of the real movie. The movie promises to show us \"aliens\" from the bottom of the sea. It surprised me that during the entire duration, you don't get to see more than 10 minutes of that - most of them are the same creatures. TV shows like the excellent \"The Blue Planet (2001)\" by the BBC already gave us all these creatures (and many others not shown here) in a MUCH clearer view and better photography. Instead, this movie focuses on showing all the people and equipment involved in making the dives. It was interesting in the first 10 minutes and it would have been alright if I wanted to know more about the making of the movie. But it's not interesting to see Cameron and crew for 95 minutes discussing how things should be made. Except for the few short computer animations in the movie, I got a feeling that I was watching an unedited material. Cameron puts himself and lots of people with Ph.D. in front of the camera, but he is more interested in showing us them playing, making faces, modeling to the cameras and having really shallow discussions instead of giving some in-depth analysis of the subject. Most of the underwater dialog consists of \"Wow\" and \"That is amazing\". The narration is horrible right from the beginning and the lowest point - for me - was during the explanation how these creatures were first discovered, which actually used the phrase: \"These scientists went like 'Wow!'\". Most of the underwater material shows the submarines and the people instead of the creatures. Is it because they didn't find what they wanted and didn't have enough material to shows us? When you finally get to see some creatures, you have absolutely no explanations about them. So many educated scientists around and you don't even get to know the names of the creatures! You just watch it like you would if you dived yourself. Cameron himself sums it pretty well in one scene, when a beautiful jelly-like creature passes and he says \"I have no idea what that is\". I don't blame you - you're not a scientist, but what are all the people around for? Summing it all up - this movie was a big disappointment and boring enough for me to fast-forward parts of it. If you want to see the creatures promised here, see another documentary; if you want to see a good Cameron project - go and watch any of his brilliant action movies. But save yourself from watching this.",
         "When I saw James Cameron on The View when he was promoting this movie, I could not wait to see it. I love nature shows and the way he talked about it, the movie would be filled with many many kinds of undersea creatures never before seen. As the movie did not even play in my state, I drove over 3 states to see it. After seeing it, I can see why it was not more widely distributed. The movie seemed to me to be more fitting to be played as something on career day for grade school. This movie would be good PR for trying to interest children in becoming marine biologists. It was not, as Cameron said, filled with unusual sea creatures. As a matter of fact, in the clip that he showed on The View, he showed all the creatures that I'd never seen before so by the time I saw the film, there was nothing new to see. And not only that, the percent of the film where creatures were shown was not that great. I think they spent more time talking to the scientists and looking at the submarines than they were showing creatures. It should have been called \"Submersibles of the Deep\". If you have an interest in deep sea submersibles and the actual scientists that operate these pieces of equipment or if you are a grade schooler with an interest in seeing yourself as a marine biologist when you grow up, this movie is for you. If, however, you fit neither category, save your money. One thing I don't understand is why was it billed as an IMAX feature and then play in a multiplex on the tiny screen? The 3-D glasses made me dizzy and were not all that effective. The best part of this movie occurred when the film broke early on and we got our money back and were invited to see it again for free. At least I did not have to pay to see it.",
         "One of the best things about this movie - specifically with regard to bringing kids to see it - is this: we see attractive, personable scientists who are excited - genuinely _excited_ - to be doing science. And, of course, the eye candy of the science they're doing - submersibles, robot cameras, and so on. I'm convinced there'll be a few marine biologists twenty years from now who'll remember this movie as the first step on their road to discovery. I'm raising a lively and inquisitive seven-year-old son, and one of my personal challenges is inoculating him against the pervasive anti-intellectualism of this culture. This movie makes being a marine biologist look cool and fun, and for that I'm profoundly grateful. The ending _is_ a bit cheesy, but hey - most people like cheese.",
         "I did not see the IMAX version, so maybe that makes a difference. I just watched the DVD, which was long. However, it seems like a lot of people did not get the point of this movie, which was absolutely excellent and very exciting. We are on the frontier of a lot of exciting discoveries, and leaps and bounds are being made in marine exploration. People complain that the animals shown were not explained enough. That's because THEY DON'T KNOW WHAT IT IS. They say \"Oooh, look at that! Wow! What is it?\". This is exploration, people. They are finding new types of animals. If they can't capture it, they are going to have to take pictures of it and study how it moves etc. etc. and go through a long process of figuring out what it is and how it lives. The point of this movie wasn't necessarily to show pretty pictures of all of the animals, although I was stunned by the visual beauty of it. The point was to tie marine exploration to space exploration, hence the title. I loved seeing what goes on with the machinery and finding out all of the different people involved in this research, showing us all the different groups that come together from different fields to explore together and work on their individual goals. A lot of people complained that they didn't want to see the engineers and the subs and robots, but the people who do that incredible work should get more credit than they often do and should definitely be introduced in the movie. This technology is absolutely amazing and the people who do it deserve to brag. They are showing us the incredible things that the human mind can achieve. I also loved seeing how excited they were. This movie has a lot of very important things to say and did a great job illustrating the massive activity going on in this sector of science. Not only has it made me enthused about the things I'm going to see in my lifetime, it has made me believe that one of those things is probably going to be life on another planet. After day after day of being depressed about the state the world is in, petty political and religious arguments, seeing this movie definitely made me feel hope for the human race again. These people put most of us to shame. This movie doesn't deserve to get blasted the way it has been and these brilliant folks don't deserve to be called \"retards\". How silly! So maybe you don't like the way it looked, or thought they should have done something different. Whatever. These guys are ridiculously hardworking, are doing amazing things, and are trying to show the world and let us get in on it. Geez. People just love to insult things.",
         "This movie had phenomenal 3D effects which rather than serving as a distraction or a novelty served to enhance my enjoyment. At the bottom of the Atlantic we find that in the absence of light life can be supported by heat - heat on the ocean floor with temperatures in excess of 700 degrees generated by underwater chimneys. Despite these extreme conditions many varied and beautiful life forms are found in abundance. In addition to exploring underwater sea life this movie includes a glimpse into the possibilities of discovering life on another planet's moons. The graphics demonstrated one way that a deep space probe could penetrate 3 to 16 miles of a moon's frozen exterior. I highly recommend this movie.",
         "This was excellent. James Cameron all the way again. It's a shame that I never got to see it on IMAX. This film is important for the future project of the space program subject on NASA as well. James Cameron is one of the planet's most important creators and directors of all time without no doubt. The film was beautiful, excellent and great to follow. There is so little we know about ourselves and our planet. Only in 3.500 meter under the ocean it seems to another world has opened the door for us to discover the truth about humans and the start of everything. This 3D technology helps Cameron and his team to go forward and create an entire new world on film in the upcoming Avatar (2009) and Battle Angel after that.",
         "What a disappointment! I felt so robbed after seeing it that I was inspired to get an IMDb account and so that I could warn others. I went to this movie after hearing it touted on Talk of the Nation Science Friday. I went expecting to see wondrous sea creatures and learn more about deep ocean life. What I got was a bunch of shiny smiling model-types talking about how important it is to explore space. Half of the crew on the mission filmed worked for NASA, and were practicing for space exploration. This film was clearly meant to convince the public to support funding their NASA projects. Very few animals were shown and almost no information was given about those we did get to see. The film shows the scientists oohing and ahhing over what they saw out their windows, but most of the time they and the narrator didn't even give the creatures' names. There were some high spots, such as a 3-D view of the exploration vehicles floating through a rain of krill. The geological formations were interesting looking, but not well explained. The 3-D seemed wasted on people talking about how great sea and space exploration is. If you actually want to learn something, stick to PBS",
         "I've been always a fan of James Cameron and his movies. And I will never forgive myself for taking so much time to watch this one. I wish I could had seen it before his newest masterpiece, Avatar, which I'm looking forward to write about too. I'm still overwhelmed by the whole thing. Cameron presents us some of the people he worked with in this movie and they're all illuminated and wise human beings. It's a pleasure too see these people working together to give us a fantastic adventure. The way Cameron works, how he talks to his crew, how he describes some life forms (''look at this creature, it's beautiful, looks like a dancer'' or ''I could watch this guy all the time, it seems it is glowing from within''), how he films the diving sequences, it's all amazing. Cameron is a visionary, a surprisingly talented filmmaker, who is also bold and courageous like no other director. This film is inspirational. Watch it for beautiful underwater sequences, the energy of Jim Cameron and the talent and knowledge of all these people that worked with him.",
         "wow.this is a truly beautiful piece of work.it is a documentary By James Cameron.Cameron and his crew basically explore the depth of the ocean,looking g for clues to life in outer space.they meet some very beautiful creature on their journey an some very strange ones.the movie is beautifully photographed,giving the viewer an astounding look at life under the sea.it is a slow moving film at times,ad veers off into talking about the people involved and other projects they are working on.i don't mean to be callous.i believe the people involved should certainly be introduced to the viewer,as all involved make a worthy contribution to the film.However,in a film such as this,the focus should be more on the creatures found,than the human beings.This movie sometimes plays like a National Geographic film,many of which also suffer from the same flaw.that said, this is very watchable film.just have your hand on the fast forward button. 6/10"
      ],
      "genres": [
         "Documentary",
         "Family"
      ],
      "productionCompanies": [
         "Buena Vista Pictures",
         "Earthship Productions",
         "Walden Media"
      ],
      "summaries": [
         "James Cameron journeys to some of the Earth's deepest, most extreme and unknown environments in search of the strange and alien creatures that live there. Joining him is a team of young NASA scientists and marine biologists who consider how these life forms represent life we may one day find in outer space not only on distant planets orbiting distant stars, but also within our own solar system. Aliens of the Deep is the result of expeditions to several hydrothermal vent sites in the Atlantic and the Pacific. These are violent volcanic regions where new planet is literally being born and where the interaction between ocean and molten rock creates plumes of super-heated, chemically-charged water that serve as oases for animals unlike anything ever discovered. Six-foot tall worms with blood-red plumes and no stomach, blind white crabs, and a biomass of shrimp capable of \"seeing\" heat all compete to find just the right location in the flow of the super-heated, life-giving water or to fry trying. Not dependent on sunlight (like all other life on earth), these ecosystems are as close to alien as anything ever imagined and provide one possible blueprint for the life that might exist beyond our world.",
         "James Cameron teams up with NASA scientists to explore the Mid-Ocean Ridge, a submerged chain of mountains that band the Earth and are home to some of the planet's most unique life forms."
      ],
      "budget": 0
   },
   "movielensId": 31429,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-01-21",
      "dvdReleaseDate": "2005-11-01",
      "directors": [
         "James Cameron",
         "Steven Quale"
      ],
      "runtime": 47,
      "movieId": 31429,
      "title": "Aliens of the Deep",
      "mpaa": "",
      "actors": [
         "Anatoly M. Sagalevitch",
         "Pamela Conrad",
         "James Cameron"
      ],
      "imdbMovieId": "0417415",
      "originalTitle": "Aliens of the Deep",
      "genres": [
         "Action",
         "Documentary",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "James Cameron teams up with NASA scientists to explore the Mid-Ocean Ridge, a submerged chain of mountains that band the Earth and are home to some of the planet's most unique life forms.",
      "tmdbMovieId": 22559,
      "avgRating": 3.26163,
      "releaseYear": "2005",
      "numRatings": 86,
      "posterPath": "/pB1HMawACKSpuxcYiufw2pzX63c.jpg"
   }
}