{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "callboy",
            "id": 6739
         },
         {
            "name": "wedding",
            "id": 13027
         },
         {
            "name": "escort",
            "id": 156731
         },
         {
            "name": "fake boyfriend",
            "id": 156760
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0372532",
      "video": false,
      "title": "The Wedding Date",
      "recommendations": [
         14844,
         2642,
         10761,
         11137,
         4599,
         7303,
         13476,
         25195,
         3638,
         11529,
         10735,
         13401,
         13596,
         13477,
         10720,
         1257,
         45156,
         38073,
         12090,
         2018
      ],
      "backdrop_path": "/gd7tcogaC8UhtDhepsT0jCsF65K.jpg",
      "revenue": 47175038,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kat Ellis",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094e69",
               "name": "Debra Messing",
               "profile_path": "/d2LQbdccJbMSDC9Qm6vTn4qa0Ly.jpg",
               "id": 23959,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nick Mercer",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094e6d",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Amy Ellis",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094e71",
               "name": "Amy Adams",
               "profile_path": "/tk5eWJcOBr9uRefeUm9ntvehbLA.jpg",
               "id": 9273,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Edward Fletcher-Wooten",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094e7b",
               "name": "Jack Davenport",
               "profile_path": "/4asp2xBJS98Tx8yKTLyWn7fjLKj.jpg",
               "id": 1709,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jeffrey",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094e7f",
               "name": "Jeremy Sheffield",
               "profile_path": "/i3lxH9b9aWyN0UVwSr81kXoa5Q4.jpg",
               "id": 53013,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Victor Ellis",
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094e83",
               "name": "Peter Egan",
               "profile_path": "/kmJJEd3MXSXzbRACya76avqSB8w.jpg",
               "id": 16480,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "TJ",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094e87",
               "name": "Sarah Parish",
               "profile_path": "/mpvkccfyyjcnG5I6xkYrbCELHab.jpg",
               "id": 17693,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Bunny",
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094e8f",
               "name": "Holland Taylor",
               "profile_path": "/oPcA8Ju1rBGlDCRqbyVD7S5vakY.jpg",
               "id": 11318,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "The Flight Attendant",
               "gender": 0,
               "credit_id": "55a3937fc3a3681811000357",
               "name": "Jay Simon",
               "profile_path": "/mAc7MfZNXLtO34syB2fg9D9z7dV.jpg",
               "id": 185400,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Pretty Woman",
               "gender": 1,
               "credit_id": "593bae22c3a3680f14009d6e",
               "name": "Danielle Lewis",
               "profile_path": "/v9HYIWhLkzhTpgHlMHHl8j6WgMe.jpg",
               "id": 121847,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094e77",
               "name": "Clare Kilner",
               "profile_path": null,
               "id": 51600,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094e95",
               "name": "Jessica Bendinger",
               "profile_path": "/wIDJcpdLI0VC3pffXRt9cTP2te7.jpg",
               "id": 53014,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe446bc3a36847f8094e9b",
               "name": "Nathalie Marciano",
               "profile_path": null,
               "id": 53015,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094ea1",
               "name": "Paul Brooks",
               "profile_path": "/uy7mhHQSwl5IHdKgLgNDGGAJ9oe.jpg",
               "id": 16854,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe446bc3a36847f8094ea7",
               "name": "Michelle Chydzik Sowa",
               "profile_path": null,
               "id": 53016,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446bc3a36847f8094ead",
               "name": "Blake Neely",
               "profile_path": null,
               "id": 53017,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094eb3",
               "name": "Mary Finlay",
               "profile_path": null,
               "id": 53018,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe446bc3a36847f8094eb9",
               "name": "Tom Burton",
               "profile_path": null,
               "id": 53019,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094ebf",
               "name": "Barbara Herman-Skelding",
               "profile_path": null,
               "id": 53020,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe446bc3a36847f8094ec5",
               "name": "Louise Page",
               "profile_path": null,
               "id": 53021,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe446bc3a36847f8094ecb",
               "name": "Dana Fox",
               "profile_path": "/xCCmrWHrz26dFg1LElUrvVsYlek.jpg",
               "id": 56718,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56bfa32d92514170aa0037e6",
               "name": "Adam Levine",
               "profile_path": "/oHNBWCQRBlcEHKuRpID9lRQNMej.jpg",
               "id": 217371,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.889317,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6961,
      "vote_count": 321,
      "budget": 15000000,
      "overview": "With the wedding of her younger sister fast approaching, Kat Ellis faces the undesirable prospect of traveling alone to London for the ceremony. While this is bad enough, Jeffrey, the man who left her as they moved closer to marriage, happens to be the groom's best man. Determined to show everyone -- most of all Jeffrey -- that her romantic life is as full and thrilling as ever, Kat hires a charming male escort as her date.",
      "similar": [
         13,
         858,
         51828,
         376660,
         109689,
         17612,
         5781,
         40807,
         4476,
         8273,
         634,
         35,
         773,
         4347,
         11224,
         137106,
         72105,
         118,
         319,
         22971
      ],
      "original_title": "The Wedding Date",
      "runtime": 88,
      "poster_path": "/A2m90ko1FCnJqEkpbHwMq3BDgx6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Visionview Production",
            "id": 29018,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gold Circle Films",
            "id": 12026,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "26 Films",
            "id": 2157,
            "origin_country": ""
         }
      ],
      "release_date": "2005-02-04",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Love doesn't come cheap.",
      "adult": false,
      "homepage": "https://www.uphe.com/movies/the-wedding-date",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Clare Kilner"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Elizabeth Young",
         "Dana Fox"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0372532/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2NzQ0MDYyOF5BMl5BanBnXkFtZTcwMzA4NzcyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Dermot Mulroney, Debra Messing, Jack Davenport | See full cast and crew »"],
      "reviews": [
         "If you see a preview for The Wedding Date before you go see it, you understand what type of movie this is. It's a chick flick. It's a cute, mildly funny, sometimes sappy, story about a woman, Kat, played by Debra Messing, so wrecked from her last relationship that when she has to go to her sister's wedding where she knows that he ex will be she hires a male escort to go and make him jealous and her family get off her case. The escort, Nick, played by Dermot Mulroney, isn't your average Gigolo. No, he's what you would consider the cream of the crop, and he doesn't come cheap. A cute, non-threatening premise, for a genuinely cute, non-threatening, romantic comedy. You can't go in expecting genius, because that's not what you'll get. The Wedding Date, however, is a glorious, indulgent movie that will leave you smiling. It's a movie for women, by a woman director, and it's really for any girl who ever wished she could have a happy ending like Cinderella. It's not all roses, of course, which keeps it interesting. It's all par for the course, however, when it comes to romantic comedies. Plus, the few glimpses of a bare-bottomed, Mulroney will keep you interested, too. I ranked this movie an 8 out of 10. I wasn't comparing it to Gone with the Wind, or the Godfather. I was comparing it to other cute romantic comedies, and as far as they go, this was a good one.",
         "Kat (Debra Messing), an airline executive, fears going alone to her snooty sister's wedding in London. This is especially so because her ex-fiancé will be there as well. Though young and beautiful, Kat nevertheless plunks down a cool $6,000 for a professional escort. In return, the gorgeous Nick (Dermot Mulroney) must play the role of her new and attentive boyfriend. Kat's sister, Amy, a la Monsoon Wedding, has planned her wedding extravaganza to last four days, complete with picnics, cricket, splashy parties and more. Can Kat and Nick pull it off? Do they have enough natural attraction for each other? And what about past loves? Messing and Mulroney make this film work, period. The script has some weaknesses and letdowns, but the darling duo rises above them. The nice scenery and costumes are also a bonus. There is a moment when Kat tells Nick he is worth every penny. The same could be said of the ticket price, as watching Debra and Dermot is very satisfying. Sometimes, the world just needs a silly love movie. What's wrong with that? I'd like to know.",
         "The Wedding Date is an excellent date movie. You can't help but empathize with the characters in this \"Pretty Woman\" type movie. The two main cast members are a perfect match for each other. More than just a romantic comedy, it is a good people movie in which you can visualize yourself (or someone you know) embodied in one of the cast's believable characters. There are several belly laughs peppered with a few moist-eyed moments making this a very good movie for teens and the young at heart, regardless of age. Granted, it may not be nominated for any academy-type awards, but it rates high marks as a delightful people's choice contender. The movie's entertainment value is clearly worth the price of box office admission. I left the theater giggling to myself...",
         "I want see this movie again. After reading some reviews, I had my doubts, but I have to say that I had a good time watching Wedding Date. I found myself laughing throughout the movie, and Mulroney is absolutely hot. Messing is perfect as Kat. They have great chemistry. The writing is smart and fun. I liked how the story unfolded, and the pace was just right. Wedding Date has a few twists and turns to keep it from being another formula flick. The story and characters are refreshing and different enough that it doesn't mimic other movies for me. The English countryside is beautiful, and the other scenes added a romantic touch too. I liked the decor of the her parents' home and her old bedroom. It complimented the romantic theme well and made me look. Any romantic will enjoy this fun and sexy romp.",
         "Critics shritics. I loved the movie. To me, this is a great romantic comedy. It has a sweet heroine and a gorgeous man who literally is the perfect guy for her. Like critics say, it was predictable. But the movie ended exactly like I wanted it to so I wasn't disappointed at all. I left my boyfriend in front of the TV drinking beer and watching the superbowl with his buddies. Hey, if men can have a fantasy world to escape in to, so can I. Sometimes it's great to just go to the movies and escape into a romantic fantasy. I wish that every guy would see this movie because they could learn something about what women want from the leading man. It's really not that hard guys. I think this movie was the perfect escape for women who don't want to watch football.",
         "that is what i am and that is what this movie is. I don't think it is supposed to be a profoundly deep movie. This is a very welcomed break from the good, but overdone dramas of the day. I love them, but who doesn't like to see a guilty pleasure movie every now and then? This movie can cure the worst attitude and your craving fora good chick flick. It is very funny and the clichés they use are used to please the audience and the characters. so, i mean give it up, sit back, and just enjoy this very awesome movie. The actors are very well cast, and while i must agree that some of the many plot lines are mostly left hanging, the important ones are not.",
         "I went to this movie hoping for a fun enjoyable romantic comedy. I was rewarded with a truly wonderful romantic comedy. I loved everything about it - the cast, the writing and the setting. Debra Messing and Dermot had good on screen chemistry and there were twists in the plot that I don't think anyone could have foreseen. I hear this movie was done on the cheap but it sure doesn't look it. Debra brought her comedic skills to the big screen showing she isn't just a TV star she is now a full fledge leading lady - watch out Julia! I highly recommend this movie to anyone who enjoys the romantic comedy genre. I loved it so much I would have bought a copy on the spot leaving the theatre to have as my own. Don't believe the critics who are panning this movie see for yourself a wonderful romantic film.",
         "This movie was soooo cute!!! It was one of the better romantic comedies that I've seen in awhile. I much prefer Dermot Mulroney in this movie than in My Best Friend's Wedding with Julia Roberts. While the movie did have a very simple plot it was made totally enjoyable by the wacky cast of characters and great one-liners that they tossed out. It highlighted how families can put the 'fun' in 'dysfunctional'. It also had some very good serious moments between father and daughter, and man to man. The movie was about a wedding, and like weddings it encompasses both endings and beginnings. I highly recommend this to anyone who loves to laugh and loves happy endings.",
         "I saw this movie tonight, the night it came out and it was wonderful. The plot of this movie reminds me of A Walk in the Clouds (Debra Messing's first movie). What chemistry between the main characters! Debra Messing's character reminds me somewhat of her Will and Grace character. She is classic,elegant, and beautiful with her style. Dermot Mulroney is sexy and charming. It was funny and romantic and had some really great quotes. The music was fun so you may want to run out and buy the soundtrack after singing out loud in the theater. I loved every minute and thought it was worth every penny.I will buy this movie the day it comes out on DVD.",
         "There have been so many many films based on the same theme. single cute girl needs handsome boy to impress ex, pays him and then (guess what?) she falls in love with him, there's a bit of fumbling followed by a row before everyone makes up before the happy ending......this has been done many times. The thing is I knew this before starting to watch. But, despite this, I was still looking forward to it. In the right hands, with a good cast and a bright script it can still be a pleasant way to pass a couple of hours. this was none of these. this was dire. A female lead lacking in charm or wit who totally failed to light even the slightest spark in me. I truly did not care if she \"got her man\" or remained single and unhappy. A male lead who, after a few of his endless words of wisdom, i wanted to kill. Just to remove that smug look. i had no idea that leading a life of a male whore was the path to all-seeing all-knowing enlightenment. A totally unrealistic film filled with unrealistic characters. none of them seemed to have jobs, all of them had more money than sense, a bridegroom who still goes ahead with his wedding after learning that his bride slept with his best friend....plus \"i would miss you even if we had never met\"!!!!! i could go on but i have just realised that i am wasting even more time on this dross.....I could rant about introducing a character just to have a very cheap laugh at the name \"woody\" but in truth that was the only remotely humorous thing that happened in the film."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Gold Circle Films",
         "26 Films",
         "Visionview Production"
      ],
      "summaries": [
         "\"The Wedding Date\" centers around Kat Ellis (Messing), who returns to her parents' London home for her sister's wedding. Afraid of confronting her ex-fiancé, who dumped her two years before, she hires a top-drawer male escort (Mulroney) to pose as her new boyfriend.",
         "Single-girl anxiety causes Kat Ellis (Messing) to hire a male escort (Mulroney) to pose as her boyfriend at her sister's wedding. Her plan, an attempt to dupe her ex-fiancé, who dumped her a couple years prior, proves to be her undoing."
      ],
      "budget": 15000000
   },
   "movielensId": 31433,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-02-04",
      "dvdReleaseDate": "2005-08-16",
      "directors": ["Clare Kilner"],
      "runtime": 88,
      "movieId": 31433,
      "title": "The Wedding Date",
      "mpaa": "PG-13",
      "actors": [
         "Debra Messing",
         "Dermot Mulroney",
         "Amy Adams",
         "Jack Davenport",
         "Jeremy Sheffield",
         "Peter Egan",
         "Sarah Parish",
         "Holland Taylor",
         "Jay Simon",
         "Danielle Lewis"
      ],
      "imdbMovieId": "0372532",
      "originalTitle": "The Wedding Date",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["DS1bOLtMNfc"],
      "plotSummary": "With the wedding of her younger sister fast approaching, Kat Ellis faces the undesirable prospect of traveling alone to London for the ceremony. While this is bad enough, Jeffrey, the man who left her as they moved closer to marriage, happens to be the groom's best man. Determined to show everyone -- most of all Jeffrey -- that her romantic life is as full and thrilling as ever, Kat hires a charming male escort as her date.",
      "tmdbMovieId": 6961,
      "avgRating": 3.25304,
      "releaseYear": "2005",
      "numRatings": 986,
      "posterPath": "/A2m90ko1FCnJqEkpbHwMq3BDgx6.jpg"
   }
}