{
   "tmdb": {
      "original_language": "nl",
      "keywords": [],
      "imdb_id": "tt0152432",
      "video": false,
      "title": "Siberia",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hugo",
               "gender": 2,
               "credit_id": "52fe45529251416c9102e63b",
               "name": "Hugo Metsers",
               "profile_path": "/gf3gkI9KriXNXqNKBFmJ4OCCeYs.jpg",
               "id": 211010,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lara",
               "gender": 0,
               "credit_id": "52fe45529251416c9102e63f",
               "name": "Vlatka Simac",
               "profile_path": null,
               "id": 1027821,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kristy",
               "gender": 1,
               "credit_id": "52fe45529251416c9102e649",
               "name": "Nicole Eggert",
               "profile_path": "/xkpPODDLjrwcNNaDcWcbnwwPWJs.jpg",
               "id": 44711,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Goof",
               "gender": 2,
               "credit_id": "52fe45529251416c9102e64d",
               "name": "Roeland Fernhout",
               "profile_path": "/zLOPcZ3LARYsuVO0W2amG8NGHTR.jpg",
               "id": 28892,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "5a46774a9251411f4f092bf2",
               "name": "Alessia Sorvillo",
               "profile_path": null,
               "id": 1949938,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe45529251416c9102e645",
            "name": "Robert Jan Westdijk",
            "profile_path": null,
            "id": 91518,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.156393,
      "production_countries": [{
         "iso_3166_1": "NL",
         "name": "Netherlands"
      }],
      "id": 34090,
      "vote_count": 4,
      "budget": 0,
      "overview": "Goof and Hugo are flatmates in Amsterdam who have made a tidy sum from having sex with tourists, then robbing them. Their goal is to spend the money together on a world trip and their scam is going well until they meet Lara, originally from Siberia, whom Goof becomes besotted with (IMDB)",
      "similar": [],
      "original_title": "Siberia",
      "runtime": 91,
      "poster_path": "/oFZHxEsqknSI8Fi1ZXWv0XhkkCZ.jpg",
      "spoken_languages": [
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "1998-08-27",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Jan Westdijk"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Jos Driessen",
         "Robert Jan Westdijk"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0152432/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2Njk2ODYzN15BMl5BanBnXkFtZTcwMjkyNjcyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Roeland Fernhout, Hugo Metsers, Vlatka Simac | See full cast and crew »"],
      "reviews": [
         "The film deals with two apparently heartless, empty men, Goof and Hugo, who seduce tourists and then rob them of their passports and some of their cash. This is until they meet Lara and Goof finds himself too attached to continue his ruthless ways. In looking at these two empty men, this film seems to ignore the fact that it is as empty and soulless as the two protagonists. The film has a very slight story - so slight that it's hard to care. Basically the two men find their match in the equally untrustworthy Lara, there's also a love triangle plot and a bet. But really it's very thin and without substance. The performances are pretty good, although Goof is not totally convincing. However the script lets everyone down and the director cannot hide it. The director tries to be as hip as possible (he's obviously seen Trainspotting and the like), he uses a pumping dance soundtrack, he uses different film stocks, slow-mo, different camera angles etc etc. It really like he's making a 90 minute pop video - but that doesn't make a good film, instead it just highlights how empty the whole thing is. The ending doesn't really mean anything and the film doesn't have any moral or message. Instead this just wants to get a young audience by having drugs and sex, fast music, music video direction and hip, morally ambiguous characters.",
         "Guess this is well made, if you like endless jump cuts, black and white grainy shots that are almost impossible to see (and understand), music that assaults the ears, and characters that are very difficult to like. This film took a dive only 20 minutes in, after I discovered what Goof and Hugo, the two Amsterdam hustlers, were up to. Basically, they not only exploit young female tourists, but all but ruin them in the bargain (they steal their money and rip out the first pages of their passports to 'prove' they've made a conquest). This obnoxious stuff becomes a 'contest' no less. They do all of this with such glitz and chutzpah that I became really irritated -- both with the characters and the filmmaker, who somehow (and enigmatically) tried to almost romanticize grossly reprehensible behaviour. When you base a movie on the dreamlife of scumbags, there's a good chance you're not going to have a sympathetic audience. Even the ending is 'cutesy,' for God's sake. The scumbags find happiness with a dog. Just what in the world was the filmmaker trying to convey here? That lack of any moral sense is rewarding, that it's a gratifying life choice? If this is the point, about 98 per cent more irony needs to be injected into the 'story'. Most of the film was just zip-zip, whiz-bang irritation for me. Even the 'plot,' if that's what it's called, is derivative, altogether too familiar, and, well, pretty stupid. Maybe I'm too old and not 'hip' enough to appreciate this nonsense. Instead, I felt a lot of pain for the victims of these shitheads.",
         "This is a surprisingly good movie from the people who brought us the Dutch movie Zusje. Although Zusje was a big hit (especially for a Dutch movie) in the Netherlands, this film has had a short cinema rotation due to lack of success. I wonder why. To me Siberia is as good as the first film by Westdijk. Reading the plot makes you wonder if there's any plot at all. The basic story of Siberia seems a bit simplistic at first: two guys (Hugo and Goof) get their kicks from sleeping with female tourists and robbing these girls from their money and passport the morning after. When they meet Lara from Siberia their lives change and their friendship is put to the test. This may seem quite a standard tale, but it's not because of the way the story is told. In it's dynamics and sound it's a bit similar to Lola Rennt: a lot of camera movement, thundering beats in the exiting soundtrack by Junkie XL and as a viewer you can feel the adrenaline as if you're in the movie too. There are blurry black & white shots to make several scenes even more intense. This is one of those movies that have a look and feel of a music video with the way it's directed, but it only accentuates the emotions and actions in Siberia. And although the idea is not knew, Siberia is intriguing and fresh. The acting is terrific and the dialogs are great and sometimes very funny (Hugo gets dressed in the morning after sleeping with a tourist girl, when the girl wakes up: \"Hugo?...\" \"Yes, I Go\", Hugo replies). Warning: the film has a very nice ending, after it seems to have ended...!!! Definitely 9 out of 10 for me.",
         "After I saw \"Karakter\" (Character) I knew that in The Netherlands we could also make movies worth looking. This one proves that also. After seeing too many movies with an \"American way of life\"-look it is a relief to see something completely Dutch. While it's not so perfect as \"Character\" it's still much better than the average which comes from Hollywood. The actors are exactly at the right place, and the music from Junkie XL is really cool , but I always liked the Prodigy-style.",
         "Goof and Hugo are friends with a hobby. In Amsterdam, they pick up female tourists and get intimate quickly. When the girls are asleep, their money is stolen along with the first page of their passport. The scheme is upset when Lara comes to town and gets treated by Goof and Hugo. Goof habitually falls in love with the girl, but this time Hugo cannot get him to move on. Will Lara's desire to take Goof home to Siberia drive the friends apart? Given that it is a low-budget Dutch production, this movie has a lot going for it. Most of the conversations are in English, which should limit subtitling to a minimum. The score by Amsterdam-based DJ's Junkie XL is excellent and the movie has a good pace. Those who have been to the city, or are familiar with the tourist scene in Amsterdam, are sure to have a good laugh at some of the characters in the movie.",
         "\"Watch out ...... these guys are dangerous\" This poster displayed in Amsterdam warns visiting tourists that all is not well in the streets of the big city because Hugo and Goof are abroad with intent to rob female backpackers after having a night of sex with them. Their technique seems faultless. Show a little kindness to the visitor by suggesting suitable accommodation for the night and hey presto! the takings are soon in the kitty. That is, until silly Goof falls in love with Lara from Siberia. The situations are quite amusing and the repartee between the two guys quite witty. It's a nice twist when Hugo's mother keeps telephoning him on his mobile at the most inappropriate moments. \"Not now, mother, I'm on day shift!\" The pace of the film is just right although I think the use of the blurry black and white segments interspersed with the colour is somewhat overdone. Sudden bursts of white flashes and out of focus characters do little to explain what is going on. The music however blends nicely with the action and pushes the story along. The writers make attempts to lift the film at the end by inserting a comic scene after the credits. Here they are, Hugo and Goof, stumbling across the snowy waste land of Siberia calling for Lara at the top of their voices which indicates I think that despite all their cunning and devious behaviour neither one of them has much between the ears.",
         "So it is actually funny to see a movie about what we all think when we see you tourists walking around in Amsterdam: You're helpless and clueless. Yes you are! All you're interested in is the red light district and marihuana. This movie is about two \"scoundrels\" who take advantage of the gullibility of young female backpacking tourists to steal their money and their passports. Then they meet one that is a little cleverer than they think.... The soundtrack is _very_ good (that is if you like loud electronic dance music by JunkieXL) and together with the way this movie is filmed (quick switches between black & white & colour, video and film, nice effects) it gives you the impression of a very long video clip. But a good one at least. Nice shots of the city I know so well, but the directors have escaped the threat of making one of those \"holland promotion\" things: no shots of people eating salted herrings, no wooden shoes, no windmills and no tulips, Hurray! They have succeeded in showing the city as a young backpaking tourist might perceive it: up and down Damrak, being hassled by dope-selling thugs and pickpockets, spending the day smoking in Bob's youth Hostel (or Freddy's piece hotel as it's called in the movie). I'm not so impressed by the acting. Fernhout has a highly irritating grin on his face throughout the movie, and Metsers appears just to be playing himself: highly convinced about what a remarkable guy he really is. I happen to think his acting is very mediocre, but you may feel different. So, not bad on the audio&video level. The story is a bit thin though. But do see for yourself....",
         "Since last summer I am a big fan of Dutch cinematography. I saw movies of Jos Stelling, Gert de Graaff, Paula van der Oest and Mike van Diem. Every movie represents absolutely different style, but all of them are on the highest level. And so is Siberia. It is not the best I have ever seen, but it is a professional movie with very good story. Sometimes it is good to see \"wrong\" heroes. You don´t have to agree with every thing they do but still you can enjyo it. What I want is to see some Czech movies like this - showing the problems of the presence and not the past. And not trying to solve them. So I vote 8/10.",
         "That director Westdijk is capable of doing something right, did he prove with his debut 'Zusje'. But this pic is over the top, tedious and simply very bad. Zero stars",
         "I did like this movie. Mostly because it is just much fun and very recognizable, mainly becuase it plays in Amsterdam, where I live. But it is more than just a fun movie. Although it isn't brilliant, it is good enough. A feel good movie which makes you glad to live in Amsterdam, glad you are not a tourist here!"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Goof and Hugo are flatmates in Amsterdam who have made a tidy sum from having sex with tourists, then robbing them. Their goal is to spend the money together on a world trip and their scam is going well until they meet Lara, originally from Siberia, whom Goof becomes besotted with.",
         "Gentle Goof and his domineering mate Hugo have turned the art of seducing into a criminal profession, as they systematically rob their one-night-stands, usually tourists, in the morning. Lara however captures Goof's heart to the point that he refuses to let her be robbed by either of them, even if that endangers their partnership. He now wishes to earn enough to travel to Siberia, her declared home. They're all three in for surprises."
      ],
      "budget": 0
   },
   "movielensId": 31606,
   "movielens": {
      "languages": [
         "Nederlands",
         "English"
      ],
      "releaseDate": "1998-08-27",
      "dvdReleaseDate": "2005-01-18",
      "directors": ["Robert Jan Westdijk"],
      "runtime": 91,
      "movieId": 31606,
      "title": "Siberia",
      "mpaa": null,
      "actors": [
         "Hugo Metsers",
         "Vlatka Simac",
         "Nicole Eggert",
         "Roeland Fernhout",
         "Alessia Sorvillo"
      ],
      "imdbMovieId": "0152432",
      "originalTitle": "Siberia",
      "genres": [
         "Drama",
         "Crime",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Goof and Hugo are flatmates in Amsterdam who have made a tidy sum from having sex with tourists, then robbing them. Their goal is to spend the money together on a world trip and their scam is going well until they meet Lara, originally from Siberia, whom Goof becomes besotted with (IMDB)",
      "tmdbMovieId": 34090,
      "avgRating": 2.5,
      "releaseYear": "1998",
      "numRatings": 8,
      "posterPath": "/oFZHxEsqknSI8Fi1ZXWv0XhkkCZ.jpg"
   }
}