{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0407121",
      "video": false,
      "title": "Pooh's Heffalump Movie",
      "recommendations": [
         13691,
         15655,
         16394,
         14903,
         250480,
         21385,
         13378,
         51162,
         10010,
         14873,
         14885,
         13654,
         21448,
         13706,
         9904,
         13700,
         15400,
         300176,
         9948,
         15657
      ],
      "backdrop_path": "/hzQ9VVlODgIDt6m9aQM2VoMtkcj.jpg",
      "revenue": 52900000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Winnie the Pooh / Tigger (voice)",
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a29d",
               "name": "Jim Cummings",
               "profile_path": "/i9frXvIJsGtoFikBEFVqE7uN8Bq.jpg",
               "id": 12077,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Piglet (voice)",
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2d1",
               "name": "John Fiedler",
               "profile_path": "/wjhOLcxWaum0JIBIRMZaQQjrhQw.jpg",
               "id": 5247,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Roo (voice)",
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2a1",
               "name": "Nikita Hopkins",
               "profile_path": null,
               "id": 90453,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kanga (voice)",
               "gender": 1,
               "credit_id": "52fe458b9251416c7505a2a5",
               "name": "Kath Soucie",
               "profile_path": "/urLkA155Yc19TKyeCUYGwzEt2PO.jpg",
               "id": 60739,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rabbit (voice)",
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2a9",
               "name": "Ken Sansom",
               "profile_path": "/el8Oje4diZsMZBk91q0xDOZH0Bq.jpg",
               "id": 77482,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Eeyore (voice)",
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2ad",
               "name": "Peter Cullen",
               "profile_path": "/bEOlxkKjGKRHIwUDfPN3JlFffpx.jpg",
               "id": 19540,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mama Heffalump (voice)",
               "gender": 1,
               "credit_id": "52fe458b9251416c7505a2b1",
               "name": "Brenda Blethyn",
               "profile_path": "/wp0tIM7dGDmc9TOrm9fgL7JkzQQ.jpg",
               "id": 4154,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lumpy (voice)",
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2b5",
               "name": "Kyle Stanger",
               "profile_path": "/hBfPbFjDt6r6PWX4tT3X6JNhcLQ.jpg",
               "id": 77484,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2bb",
               "name": "Frank Nissen",
               "profile_path": null,
               "id": 73161,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2c1",
               "name": "Brian Hohlfeld",
               "profile_path": null,
               "id": 85914,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2c7",
               "name": "Evan Spiliotopoulos",
               "profile_path": "/xxpG0j3g2IJY3EPy9tUbdsABfCC.jpg",
               "id": 80675,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe458b9251416c7505a2cd",
               "name": "A. A. Milne",
               "profile_path": null,
               "id": 77545,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "5ab3fedc9251417afb00d716",
               "name": "Jessica Koplos",
               "profile_path": null,
               "id": 1492568,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ab3ff26c3a368616300f21d",
               "name": "Joel McNeely",
               "profile_path": null,
               "id": 49285,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5ab3ff309251417b0b00e0a7",
               "name": "Robert Fisher Jr.",
               "profile_path": null,
               "id": 993265,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5ab3ff3a0e0a265f3000e346",
               "name": "Nancy Frazen",
               "profile_path": null,
               "id": 1767023,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5ab3ff460e0a265f3300d886",
               "name": "Anthony Rocco",
               "profile_path": null,
               "id": 1381898,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 8.453225,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13682,
      "vote_count": 118,
      "budget": 20000000,
      "overview": "Who or what exactly is a Heffalump? The lovable residents of the Hundred Acre Wood -- Winnie the Pooh, Rabbit, Tigger, Eeyore, Kanga and the rest of the pack -- embark on a journey of discovery in search of the elusive Heffalump. But as is always the case, this unusual road trip opens their eyes to so much more than just the creature they're seeking.",
      "similar": [],
      "original_title": "Pooh's Heffalump Movie",
      "runtime": 68,
      "poster_path": "/e9yRYPCDIQV9npIOUUqeo1Thu4b.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/o5AcK10ViutenSa4XTD18ClCEWe.png",
         "name": "DisneyToon Studios",
         "id": 5391,
         "origin_country": "US"
      }],
      "release_date": "2005-02-11",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "There's something new in the Hundred Acre Wood.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Frank Nissen"],
      "runtime": 68,
      "synopsis": "A heffalump is heard trumpeting in the hundred acre woods. Winnie the pooh, tigger, and piglet are scared and rush to Rabbit's house for advice. Roo joins them and they all agree that heffalumps are nearby after finding a huge footprint. They decide to set out on an expodition to catch the heffalump. Roo is not allowed to come along because he is too little. The expedition is fruitless and the gang (including eyore) return to their own part of the hundred acre wood. Meanwhile Roo sets out on his own to catch the heffalump and finds Lumpy, a young heffalump. Roo captures Lumpy with a rope and brings him to his own neighborhood. Although Roo starts out suspicious of Lumpy they eventually become friends. Lumpy becomes upset when he can't find his mother and Roo takes him to see his own mother, Kanga. Rabbit, Tigger and the others take Lumpy for an enemy and tie him up. This scare lumpy and he runs away only to be captured in a booby trap. He then trumpets for his mother who comes to his rescue. Meanwhile Roo falls in a dangerous pit full of fallen trees. Lumpy's mother rescues Roo and this act of kindness endears the heffalumps to the other dwellers of the hundred acre wood. the end",
      "writers": [
         "Brian Hohlfeld",
         "Evan Spiliotopoulos"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0407121/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyOTk5MDM4N15BMl5BanBnXkFtZTcwMTM0NDcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jim Cummings, Brenda Blethyn, Kyle Stanger | See full cast and crew »"],
      "reviews": [
         "This movie was the perfect first movie to bring our 3 and a half yr old daughter! It had a wonderful lesson for all of us: don't be judgmental about things we don't yet know. There is a most tender moment between Roo and Kanga, which is coupled with a heartbreakingly sweet song, sung mostly by Carly Simon. (We bought the CD and it gets a lot of playtime.) Little Roo was courageous and wise - even seeking his parent's help when he couldn't solve a serious problem on his own. Pooh and the gang are featured throughout but are not the 'stars'. Roo plays a charming character growing up just a little bit, and my daughter related to him very well. NOTE, however, there is a scene that can be seen as a little scary for little ones. My daughter ended up sitting on my husband's lap for security about half way through the film, and stayed there through the end. Afterwards we talked about it a little bit and she hasn't had any bad dreams that we know of. All in all, a new generation of Hundred Acre Wood movies has begun, and so has a new fan base! SEE IT!",
         "It's been awhile since I've watched Winnie The Pooh,and I was abit unsure about watching another again when my sisters rented it out. The thing is that I loved it! It's a very cute movie with cute original characters and It has a Very nice story and I don't have a problem when watching it again. It begins where all of a sudden there's been some strange happenings in the Hundred Acre Wood and Winnie the pooh and his friends try to get to the bottom of it,only to find out that Heffalumps (Big elephants) have moved in. The rest I leave to you to find out,but overall it's cute,fun and something that you can never be too old to watch. So yeah,watch it...it's definitely something that kids as well as the rest will enjoy. PS: Note how many \"cutes\" I've put in,if it's more than 2 then it's worth a movie ticket.",
         "At 18, you may think I am a little old to be watching this movie, but as a lover of the Winnie the Pooh characters I thought why not? So I watched Pooh's Heffalump Movie and was delighted by it. It is so charming, sweet and endearing and has a lot of heart too. Plenty of funny and touching moments here too. It isn't as good as the 1977 movie or the 80s TV show, but it is still a delightful movie, with enough charm for especially children. Adults may complain there aren't enough jokes for them, but if they see the movie they will probably be content by their child's happy smile as they watch it and by the charm the film has. The film is very short, but it moves very quickly and doesn't feel boring. The story is also very simple, but it is effective and innocent with a nice message that I actually didn't find preachy. The animation is lovely, and the music while not the best in the world is still delightful and serves its purpose very well. Even the dialogue had some nice moments- I smiled and I was moved too. The characters are a delight, especially Lumpy who is so cute and endearing I fell in love with him the very first moment I set eyes on him. And the voice acting is excellent. Overall, charming and delightful. 9/10 Bethany Cox",
         "I've rarely liked most of the Disney spinoffs and sequels but to me the 'Winnie the Pooh' sequels are an exception. I've only seen the delightful 'Piglet Movie' and now I've had the joy to watch 'Pooh's Heffalump Movie'. I miss the handdrawn Disney movies nowadays and it is great to see that Disney still makes such quality stuff even though that's rare thanks to nonsense like 'High School Musical' dominating the franchise. In 'Pooh's Heffelump Movie', the animation is vivacious as ever but where it succeeds most is with its adorable characters who have maintained their essence and consistency. The whole gang, that is Pooh, Piglet, Tigger, Kanga, Rabbit, Roo and Iyor are here. The comic situations are hilarious and the story is fun too. It has heart and is told in an endearing way that will capture children's attention (yes, there is a lesson to be learned too) but adults can enjoy it just as much with their kids. The new character, Lumpy, has got to be one of the cutest 'member' of the elephant family. But, Lumpy isn't merely some cute caricature. He is brilliantly written and voiced as a real character, that of a curious playful child seeking for adventure with a new friend. The score is splendid and it is always a pleasure to hear Carly Simon's beautiful voice. This little movie is neatly packed in a solid 75 minutes but it doesn't feel rushed at all. One of the last few underrated little gems of Disney.",
         "First off I am going to say that I am not a fan of Pooh. I am a HUGE Disney fan, and I work in a video rental store, so I decided to go ahead and watch the movie one day while I was working. I LOVED it!!!! This is the best thing that happened to pooh in a long time. Keep in mind I am in my 20's and I now a stuffed Lumpy because he's just great! I made everyone at work watch it and they agreed with me it's got a good story that makes you feel like a kid again and the character's are great. At one point one of my male co-workers had the sniffles. I think that everyone who likes Disney movies or cartoons in general should watch this film. Disney I give you two thumbs up!!",
         "I saw this movie for the first time yesterday. I'm not a mushy kind of person by any means and there are few things that just melt my heart, but this movie did it. The kid that did the voice of Lumpy the Heffalump has the most adorable voice and a giggle that just captures your heart. I think the songs are phenomenal and having grown up with the friends of the Hundred Acre Wood, they're still doing a fantastic job. I'm glad after all these years we finally got to meet a Heffalump and learn they're not as scary as Pooh and his friends have thought they were. This movie was just absolutely phenomenal (although I do agree there was nowhere nearly enough Eeyore), and it's absolutely heart capturing. I've already watched it abut five or six times since yesterday. I hope to see more Lumpy movies and continue to hear Kyle Stanger doing his voice. I highly recommend Pooh's Heffalump Movie for any one age 1 to 101.",
         "I have always been a fan of the AA Milne books and have read them to all three of my children, who are now adults, as well as to my great niece, who is now 4. On top of this, elephants just happen to be my favourite animals and so to have a film dedicated to a heffalump, along with the other AA Milne characters, is fine by me. I am well over the age, and then some, that this film is directed at, but can't see what difference that makes, if you like something it doesn't matter how old you are, does it? The little boy who does the voice of Lumpy is just perfect, absolutely adorable and makes this film for me. My only complaint is that the plot is a bit thin on the ground, but the beautiful voice of Carly Simon, singing the songs, makes up for that and I really enjoyed it.",
         "Is it just me, or is that Lumpy the cutest Heffalump EVER??? He has his little accent, and cuddly little ears... he is just too cute! They really should have more movies like this one. I am a big Winnie the Pooh fan! And it makes me a little upset, when I heard that they are going to change Christopher Robin, who was the name of AA Milne's son, with a little girl. I'm like, WHAT??? They didn't do it in this movie, but, still! Come on people! AA Milne wrote these stories for his little son!!! We grew up with Christopher Robin!!!! But, anyway, this movie is too cute! You have to see it! I highly recommend this movie! Watch it! You won't be disappointed!!!",
         "What a lovely storybook film...with a truly beautiful musical score by Joel MeNeely is basically my adult opinion...as I was enchanted by the music score more than anything else...and everything else is so easy to enjoy..I know Carly Simon wrote the songs (and they were nice...!) but the actual score was more enjoyable. My 4 year companion stayed in his seat and laughed (as I did) at Roo and Rabbit's antics especially. This neat and clean 68 minute Disney pic is exactly what I was ready to enjoy but was quite surprised at how gently funny and enchanting it was. If I had a cinema (still) I would have asked Disney to double it for me with DUMBO and sold all seats for $5 to delighted adults who would have brought every kid they knew so we could have a hilarious elephant afternoon.",
         "This is a movie that I really enjoyed when I first saw it and continue to enjoy to this day. We get introduced to Lumpy, a young heffalump. If you remember the original film, heffalumps are creatures that are to be feared, along with the woozle. However, little Lumpy is nothing of the sort. He's a charming character that you warm up to pretty quickly, as does Roo. When Roo tries to convince the rest of the gang that Lumpy is harmless, the others don't believe him and instead live with their prejudices. In the end, the Hundred Acre crew learns that just because someone's different, doesn't mean they can't be good people. If you're looking for a flick that has a charming character and a charming lesson with Pooh and his crew, this is for you. Heffa nice day. :)"
      ],
      "genres": [
         "Animation",
         "Family",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "DisneyToon Studios"
      ],
      "summaries": ["A heffalump is heard trumpeting in the hundred acre woods. Winnie the Pooh, Tigger, and Piglet are scared and rush to Rabbit's house for advice. Roo joins them and they all agree that heffalumps are nearby after finding a huge footprint. They decide to set out on an expedition to catch the heffalump. Roo is not allowed to come along because he is too little."],
      "budget": 20000000
   },
   "movielensId": 31687,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-02-11",
      "dvdReleaseDate": "2005-05-24",
      "directors": ["Frank Nissen"],
      "runtime": 68,
      "movieId": 31687,
      "title": "Pooh's Heffalump Movie",
      "mpaa": "G",
      "actors": [
         "Jim Cummings",
         "John Fiedler",
         "Nikita Hopkins",
         "Kath Soucie",
         "Ken Sansom",
         "Peter Cullen",
         "Brenda Blethyn",
         "Kyle Stanger"
      ],
      "imdbMovieId": "0407121",
      "originalTitle": "Pooh's Heffalump Movie",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Who or what exactly is a Heffalump? The lovable residents of the Hundred Acre Wood -- Winnie the Pooh, Rabbit, Tigger, Eeyore, Kanga and the rest of the pack -- embark on a journey of discovery in search of the elusive Heffalump. But as is always the case, this unusual road trip opens their eyes to so much more than just the creature they're seeking.",
      "tmdbMovieId": 13682,
      "avgRating": 2.99286,
      "releaseYear": "2005",
      "numRatings": 210,
      "posterPath": "/ow61dkcJcfVFW2n7YpUVsMzcpk5.jpg"
   }
}