{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0169156",
      "video": false,
      "title": "The Quarry",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "The Man",
            "gender": 2,
            "credit_id": "52fe4ac2c3a368484e1656af",
            "name": "John Lynch",
            "profile_path": "/2OHQ4Hck4QlCqDjQ4mK6OMW65n3.jpg",
            "id": 28743,
            "order": 0
         }],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe4ac2c3a368484e1656ab",
            "name": "Marion Hänsel",
            "profile_path": "/4FnSPGI0KbRXmrTo8P9YAzQxOE6.jpg",
            "id": 22812,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.10061,
      "production_countries": [],
      "id": 125317,
      "vote_count": 2,
      "budget": 0,
      "overview": "This thriller investigates the mysterious assassination of a gay pastor in rural South Africa. Without witnesses or explanations, the crime appears to the police and others as a jigsaw puzzle without enough pieces. The police then suspect and arrest people based on the usual prejudices, black and coloured people who plant marijuana in this case. Meanwhile, the true assassin not only goes his way unpunished from the very beginning, but becomes one of the rural town's most respected citizens. The sheriff at one point does begin having certain suspicions, and from there on the bulk of the plot is played out. The location is a very arid part of South Africa, so with so much desert rock, there are bound to be quarries. Some may reveal important secrets.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         112160,
         858,
         141,
         634,
         242224,
         376867,
         394117,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "The Quarry",
      "runtime": 112,
      "poster_path": "/xb8VFyrZya7SlhqnLuXgz5VJxpP.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-09-09",
      "vote_average": 2.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marion Hänsel"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Damon Galgut",
         "Marion Hänsel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0169156/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0MDI3MTcxOV5BMl5BanBnXkFtZTgwNDQzMjAxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Lynch, Jonny Phillips, Oscar Petersen | See full cast and crew »"],
      "reviews": [
         "In this very low-key film set in the rugged back country of South Africa, a desperate and reticent fugitive takes on a false identity to escape his past. The plot is slow and methodical. Dialogue is minimal. The eerie musical score is used sparingly. Sporadic conversations and the sounds of nature heighten the realism, and allow the viewer to participate in each moment of the film, as it is occurring, without thought of what may happen next. \"The Quarry\" is a strange and enigmatic film. There's a curious lack of exposition, or background information. So much of the story is left out. But that intensifies the mystery. Things just happen. We're left to wonder what brought all of this on. And the film's final scene is so unfathomable as to imply a deeply embedded subtext. I am inclined toward a metaphysical interpretation. No matter how hard we may try to hide from our past transgressions, our own karma will exact, in one way or another, a penalty in proportion to those transgressions. This film will appeal to viewers who like plots, especially character studies, expressed in a manner that is simple and technically well done, but without the overlay of distracting cinematic gimmicks. It will also appeal to viewers who value film as philosophic or artistic expression.",
         "In life every choice you make has some consequences , and you have to accept them after you have made your choice.But your choice doesn't always condemn you and can still lead to salvation .. or not. In this quiet sometime sombre movie by Marion Hansel , a mystery man arrives out of nowhere and commits a crime and assumes the identity of his victim to save himself. The only problem is that his crime was not perfect and his victim was a baptist reverend. He amazes the people (and himself) with his sermons and the conflict in him starts to rise. The conflict between himself and God , but also between himself and the others who have been falsely accused of his crime. Reveal himself and lose all he has built upon or stay hidden and see innocent people judged for his own crimes . ] The slowmoving nature of this film just highlights the lives of all the characters in the movie. Valentine and Small, the villains in the movie are not what they seem. Brothers and friends to the end and living their own quiet life, now suddenly interrupted by these events. Inspector Moll, biased against race but a secret or two in his own life, and finally the mystery man, where did he come from , who/what was he running away from ? Some answers stay unknown but some others are answered in this movie which shows that despite the past, salvation lays ahead for all those who will accept it ... and accept the concequences .",
         "A fugitive is given a ride by a minister on his way to a new church in a remote part of the Northern Cape Province South Africa. The minister comes on to the fugitive who accidentally kills him being frustrated with persistent timid drunken sexual advances. Not knowing what to do he hides the body in a quarry (title) and falls into assuming the minister's identity to hide from the police. This movie was made 4 years after white rule ended in South Africa-- during the rainbow honeymoon. This has to be one of the most unique movies I have watched in a long time--the director is Belgian and the original movie was surely entirely in Afrikaans?? In the version I watched the main roles The Fugitive---The Minister--The Police Chief etc...appeared to be dubbed into English and a poor job of it at that--most dubbers try to match up sound with lip movement not this one. Either that or the sound track was wildly out of sync? It is a film noir with black majority rule sensibilities. The police chief has a black mistress who happens to be in charge of the church house keeping. The blacks are handled in a PC manner. The only one to get the PC shrift is the gay minister although his killer had trouble burying him. This movie could also be interpreted as a liberal attempt to analyze the evils of apartheid. The movie has extremely authentic views of small town rural SA 1998. I saw nothing overpoweringly religious in it as other reviewers did perhaps just the opposite--the minister smoked and drank--what kind of baptist was he? The church was burned down by the marijuana smoking thief--biblical? or ironical a sort of satire it could be interpreted either way. Yes there is lots of symbolism....the torn umbrella at the end is a version of the black cloak...it will not protect the thief either. In jail there is a WHY ME? carved into the cell wall....lots of symbolism...am still trying to figure out the blue flower. With some tweaking this could have been a really great movie--by toning down or even discarding! the PC baggage---a dream that will never happen. The music is great (Takashi Kako)--and won an award. RECOMMEND FOR ITS UNIQUENESS AND AUTHENTIC SCENERY",
         "I just finished watching this movie this minute and i don't feel satisfied, it did not get together in the end, maybe that is the whole point when one looks at it on a larger scale concerning the human situation keeping at heart and in mind the stirrings of the soul. i mean this film did have its moments and it did keep me interested and maybe I dare to say that it was overall tight to the subject. I knew way in advance that he would give himself up, due to the fact that he was dealing with The book of books here and the fact that the priest he killed did tell ask him to open up \"What are you running away from?\" The barren desert areas do suggest a biblical story. Finally the fact that the younger brother not without reason nicknamed \"Small\" is the greatest and the one who is set free. This film echoes the words of The Lord. I got to point out how other characters besides our hero here have secrets and their share of sins, like the rest of us, which they want to conceal, the conscience is making them feel a sense of shame like the love affair between the chief cop and the lady carer. the cop winds up committing the same crime/sin as our \"hero\". I like the fact that the hero is shot dead on the rail track which makes a lot of sense since he was, or at least we are given the impression that he has been living a trail of the kind of stuff we are allowed to know of him from when the movie begins, he is already running away."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Man's Films",
         "SNG Film / Studio Nieuwe Gronden",
         "Tchin Tchin Productions"
      ],
      "summaries": ["This thriller investigates the mysterious assassination of a gay pastor in rural South Africa. Without witnesses or explanations, the crime appears to the police and others as a jigsaw puzzle without enough pieces. The police then suspect and arrest people based on the usual prejudices, black and coloured people who plant marijuana in this case. Meanwhile, the true assassin not only goes his way unpunished from the very beginning, but becomes one of the rural town's most respected citizens. The sheriff at one point does begin having certain suspicions, and from there on the bulk of the plot is played out. The location is a very arid part of South Africa, so with so much desert rock, there are bound to be quarries. Some may reveal important secrets."],
      "budget": 0
   },
   "movielensId": 3191,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-09-09",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Marion Hänsel"],
      "runtime": 112,
      "movieId": 3191,
      "title": "The Quarry",
      "mpaa": null,
      "actors": ["John Lynch"],
      "imdbMovieId": "0169156",
      "originalTitle": "The Quarry",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "This thriller investigates the mysterious assassination of a gay pastor in rural South Africa. Without witnesses or explanations, the crime appears to the police and others as a jigsaw puzzle without enough pieces. The police then suspect and arrest people based on the usual prejudices, black and coloured people who plant marijuana in this case. Meanwhile, the true assassin not only goes his way unpunished from the very beginning, but becomes one of the rural town's most respected citizens. The sheriff at one point does begin having certain suspicions, and from there on the bulk of the plot is played out. The location is a very arid part of South Africa, so with so much desert rock, there are bound to be quarries. Some may reveal important secrets.",
      "tmdbMovieId": 125317,
      "avgRating": 2.875,
      "releaseYear": "1998",
      "numRatings": 8,
      "posterPath": "/xb8VFyrZya7SlhqnLuXgz5VJxpP.jpg"
   }
}