{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0097115",
      "video": false,
      "title": "Courage Mountain",
      "recommendations": [],
      "backdrop_path": "/nA21fzQyPIADsR9531aZPKHJRbj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdceb",
               "name": "Charlie Sheen",
               "profile_path": "/g4e1QpcNTpmq2uPr5GDNuMvjRuU.jpg",
               "id": 6952,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Heidi",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdcf5",
               "name": "Juliette Caton",
               "profile_path": null,
               "id": 135172,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ursula",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdcf9",
               "name": "Joanna Clarke",
               "profile_path": null,
               "id": 135173,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ilsa",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdcfd",
               "name": "Nicola Stapleton",
               "profile_path": null,
               "id": 135174,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Clarissa",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdd01",
               "name": "Jade Magri",
               "profile_path": null,
               "id": 135175,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gudrun",
               "gender": 1,
               "credit_id": "52fe466ac3a36847f80fdd05",
               "name": "Kathryn Ludlow",
               "profile_path": null,
               "id": 135176,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Grandfather",
               "gender": 2,
               "credit_id": "58ff726392514150f200009d",
               "name": "Jan Rubeš",
               "profile_path": "/hrzcIOLEMhcnYiRbNYoqGJD1AwK.jpg",
               "id": 37422,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Jane Hilary",
               "gender": 1,
               "credit_id": "58ff72aa92514150f900009d",
               "name": "Leslie Caron",
               "profile_path": "/9IUrXqu5QnfEb0pAkXaYQu5f2lc.jpg",
               "id": 5320,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Signor Bonelli",
               "gender": 2,
               "credit_id": "58ff731e92514151080000eb",
               "name": "Yorgo Voyagis",
               "profile_path": "/bTqroXMCv3t9b0aXUjIM05t3HKU.jpg",
               "id": 24696,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe466ac3a36847f80fdcf1",
               "name": "Christopher Leitch",
               "profile_path": null,
               "id": 57436,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5509d20792514110dd003f78",
               "name": "Weaver Webb",
               "profile_path": null,
               "id": 1441846,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5831dce092514162c3027d62",
               "name": "Jacques Steyn",
               "profile_path": null,
               "id": 66187,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5831dcebc3a3685bb0026dc3",
               "name": "Sylvester Levay",
               "profile_path": null,
               "id": 58120,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5831dd1c92514162d202869b",
               "name": "Martin Walsh",
               "profile_path": "/eFdV5n5GV01fwNRzrJn299aFUsq.jpg",
               "id": 9154,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5831dd3d92514162cf02850d",
               "name": "Stephen Ujlaki",
               "profile_path": null,
               "id": 929941,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5831dd4cc3a3685ba102c8f6",
               "name": "Joel Douglas",
               "profile_path": null,
               "id": 57309,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5831dd5cc3a3685ba8028434",
               "name": "Norbert Blecha",
               "profile_path": null,
               "id": 64395,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5831dd6bc3a3685b9a02876c",
               "name": "Robb Wilson King",
               "profile_path": null,
               "id": 21640,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5831dd74c3a3685ba102c922",
               "name": "Damien Lanfranchi",
               "profile_path": null,
               "id": 1536255,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5831dd7f92514162d2028702",
               "name": "Edith Poussou",
               "profile_path": null,
               "id": 1711584,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5831dd91c3a3685b9d029c21",
               "name": "Françoise Charlap",
               "profile_path": null,
               "id": 1711586,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58ff74cac3a3680485000016",
               "name": "Richard Shorr",
               "profile_path": null,
               "id": 1409485,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "58ff754492514159ca000050",
               "name": "Michael P. Redbourn",
               "profile_path": null,
               "id": 1370961,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "58ff75b0c3a368043d00007b",
               "name": "Patrick Cauderlier",
               "profile_path": null,
               "id": 16347,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "58ff763ac3a36804bf0000cf",
               "name": "Ronnie Rondell Jr.",
               "profile_path": null,
               "id": 161824,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.328331,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 43912,
      "vote_count": 3,
      "budget": 0,
      "overview": "In this version of \"Heidi,\" a young Swiss girl is sent off to boarding school at the beginning of World War I.",
      "similar": [],
      "original_title": "Courage Mountain",
      "runtime": 98,
      "poster_path": "/y1mwtX7t2lTr6mhgvimayCjTUww.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Stone Group Pictures",
            "id": 3470,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Epic Productions",
            "id": 1988,
            "origin_country": ""
         }
      ],
      "release_date": "1990-02-14",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Their climb to freedom will become the greatest adventure.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Leitch"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Fred Brogger",
         "Mark Brogger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097115/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMjM2MzMxN15BMl5BanBnXkFtZTcwMTQ0ODYzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Juliette Caton, Charlie Sheen, Joanna Clarke | See full cast and crew »"],
      "reviews": [
         "Courage Mountain is one of many well-made movies that have fallen into the black oblivion of cinema history. A sequel to Heidi, the beloved classic that makes many people think of Shirley Temple, it tells the story of a teenage Heidi who is sent to boarding school in Italy, during World War One. But circumstances force Heidi and her new school friends to embark on a dangerous journey through the warring countryside, bound for the mountain that will take them safely to Heidi's homeland of Switzerland. One of the prime delights in this movie is the splendid scenery, with sweeping views of the Alps from all sorts of different angles. As for the movie itself, it has a compelling enough plot, and one certainly appealing to the family audience- courageous children fighting against all odds to find freedom during troubling times. The characters are interesting and somewhat Dickensian, though at times you feel like we move to the next scene before we've had a chance to really get to know any of them. Fortunately, most of the cast is excellent, especially 15-year-old Juliette Caton, who plays Heidi, and the other four girls (who are these wonderful actresses, and why didn't we see them again after this movie?). Leslie Caron (remember An American in Paris?) is nice as the warm-hearted headmistress, and Jan Rubes is the perfect Grandfather. And three cheers for another marvelous but relatively unknown actor, Yorgo Voyagis (perhaps most widely seen as Jospeh in the epic miniseries Jesus of Nazareth), who plays the villainous factory owner to wicked perfection. The only actor who is completely out of place is the actor who gets his name at the front of the credits, Charlie Sheen. Perhaps it's the fact that he doesn't even try to hide his American accent, or perhaps it's because he is playing an 18-year-old when he is actually in his mid-twenties (at the time). Or perhaps it is an attempt to have a \"star\" so that the movie will be easier to promote (a device that never works). Surprisingly enough, Mr. Sheen is not in the movie very much. And everything else is really a worthwhile adventure for the entire family, without any pesky off-color jokes and bad language (a rarity in family movies these days). And be sure to listen to the music. It's just as majestic as the mountains.",
         "*SPOILERS* This movie is a sequel to the children's story, Heidi. Heidi, now a teen, is accepted to a girls' school in Italy. She decides to go, right when WWI is starting. She leaves neutral Switzerland to go to soon to be war-torn Italy. When her school closes to become Italian troops headquarters; she and her friends, Ilsa, Gudrun, and Ursula are taken from her headmistress's, Madame Hilary, care and put in an orphanage. This is really a dirty factory run by the evil Signor Bonelli and his wife. The girls escape one night, along with two new orphans, Clarissa and Giovanni. Signor Bonelli sets out looking for them and chases them all over Italy. The kids are headed over the Alp Mountains to Heidi's home in Switzerland. Meanwhile, the Madame Hilary has alerted and gone to Heidi's grandfather for help. He asks Heidi's childhood friend, Peter to look for the girls. Eventually it ends with a brutal fight on the mountain b/t Bonelli and Peter, because Bonelli found the girls and had tied them to climb the mountain & push them off the top. Of course the story ends happily ever after with all the girls returning to Heidi's house with Grandfather & Madame Hilary. A nice family movie that tugs the heartstrings!",
         "I have watched this movie several times. It has always been good. We like to bring it to sleepovers with young girls they all like it. I like that it is like a continuation of Hidi. She falls for her best friend Peter. There is suspense & danger. Also a love story. It is not only for girls but the guys would like the suspenseful parts. The lead actress I had never seen before but she is wonderful. Then of coarse then is the handsome Mr. Sheen. When he comes to the rescue my heart skips a beat. This is a movie for the family on a Friday night. Get the movie pop some popcorn & spend some good quality time with your family. You may even want to start a talk about what World War I was all about. If you had a grandfather or Uncle in the service during that time. Talk with your kids let the know their history.",
         "****There are some slight spoilers, but I'm not going to give away any finer details.**** I guess there are a lot of down points to this film. Miscasting, revisionist literature, et cetera. But despite all this Courage Mountain is still a rather entertaining movie. A sequel to Heidi, one of the world's most beloved children's books, our protagonist finds herself with a large inheritance. So Grandfather sends her to an elite school for girls where she can learn to fend for herself like any rich girl. She travels to Italy and spends only a short time in the school when World War One breaks out. The Italian Army commandeers the school and the children (including Heidi) whose parents could not be reached are shipped to an orphanage where they are forced to do hard labor. The orphanage is run by a sinister man, a really evil version of Mr. Bumbles from Oliver!, who works the poor children to death. Literally. Then they plan to escape across the Alps to Switzerland to Heidi's Grandfather. But to complicate their plans the orphanage owner persues them across war-torn Italy with the sole intention of killing them. Sounds reasonably good? Well, it is. Despite the occasional miscast like Charlie Sheen as Peter, Heidi's love, there is good acting now and then, especially from Juliette Caton who plays Heidi. There's also the good production design and cinematography. Courage Mountain also has the feel of adventure; a sense of urgency. It's not perfect, as mentioned. The movie has the feeling that it had been longer and better written, but that it has been cut to make it more Kiddy-Friendly. Scenes pass too quickly for the acting to be engrossing. Detail has been given to the narrative yet the human element (character development) has been left out. Ultimately it is the Great Escape for children with elements from Oliver Twist and Heidi thrown in to create a movie, which, despite being somewhat watchable, could have been great! I give it a 7 out of 10. It should really get a 5 but I added two points for effort. Not all my agree (especially if your picky) with my score but face it: it could have been worse and there worse movies out there.",
         "I'm 34 and I can't remember exactly when I first saw this movie, but I probably saw it right around when it came to video. I had never watched Heidi before, so really had no experience with the \"Heidi\" story. This movie could not have been a better introduction and I have never wanted to watch another Heidi version since. I love this movie and we have a family tradition of watching it every Christmas. I also pull it out of the vault and watch it at ANY time of the year because I love it so much. This movie not only has beautiful shots and scenery in it, but shows that a young woman or any woman for that matter can be beautiful being her natural self. Heidi is gorgeous, naturally beautiful without artifice, and very self confident and sure of herself. She lives her life simply and doesn't know any other way, and even when she finds out that her lifestyle is considered \"old fashioned\", she doesn't let it get her down. The story line in this movie is simple, yet tugs at the heart strings. There is adventure, the awkwardness of new experiences, the buddings of first love, new friends to be made, and challenges to be overcome, all the while amidst the back drop of snowy caped mountains and rustic villages. If you are a fan of period romances, westerns, frontier type movies, or just a simple romantic at heart, then I would give this movie a try. You might be surprised that hidden underneath that unassuming title and DVD graphics is a true gem. Ohh..did I mention, TOTALLY kid friendly and morally appropriate!!!",
         "Thoroughly enjoyable. I only slightly remember the prior film to this sequel, but it is not needed. This one stands on its own. There is no point where you will believe this story. It is just too far-fetched with usually mediocre acting (that's child actors for you, though, usually mediocre). The heart in this story is it's driving force. It's about love and survival; Heidi's love for, well, nearly everyone; the children's love for each other; and more. Although the cover and title may not seem very promising, it is worth watching. Give it a chance."
      ],
      "genres": [
         "Family",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": [
         "Epic Productions",
         "Stone Group Pictures"
      ],
      "summaries": ["In this version of \"Heidi,\" a young Swiss girl is sent off to boarding school at the beginning of World War I."],
      "budget": 0
   },
   "movielensId": 32062,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-02-14",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Christopher Leitch"],
      "runtime": 98,
      "movieId": 32062,
      "title": "Courage Mountain",
      "mpaa": "",
      "actors": [
         "Charlie Sheen",
         "Juliette Caton",
         "Joanna Clarke",
         "Nicola Stapleton",
         "Jade Magri",
         "Kathryn Ludlow",
         "Jan Rubeš",
         "Leslie Caron",
         "Yorgo Voyagis"
      ],
      "imdbMovieId": "0097115",
      "originalTitle": "Courage Mountain",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["vo2acPtk-Os"],
      "plotSummary": "In this version of \"Heidi,\" a young Swiss girl is sent off to boarding school at the beginning of World War I.",
      "tmdbMovieId": 43912,
      "avgRating": 2.9375,
      "releaseYear": "1990",
      "numRatings": 8,
      "posterPath": "/y1mwtX7t2lTr6mhgvimayCjTUww.jpg"
   }
}