{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0084784",
      "video": false,
      "title": "That Championship Season",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "George Sitkowski",
               "gender": 2,
               "credit_id": "52fe4b99c3a36847f820b6b1",
               "name": "Bruce Dern",
               "profile_path": "/fYhCiXGBARWUevnWDkeCEpwi4h4.jpg",
               "id": 6905,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "James Daley",
               "gender": 2,
               "credit_id": "52fe4b99c3a36847f820b6b5",
               "name": "Stacy Keach",
               "profile_path": "/9G0urAVBBP9FRX1wrxkdZCj3VCW.jpg",
               "id": 825,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Coach Delaney",
               "gender": 2,
               "credit_id": "52fe4b99c3a36847f820b6b9",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tom Daley",
               "gender": 2,
               "credit_id": "52fe4b99c3a36847f820b6bd",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "5688b9d39251414ecb017010",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "5a7e79d5c3a3681895004476",
            "name": "Jason Miller",
            "profile_path": "/wwExdVTadL0jd8kqEicjK8k6yu8.jpg",
            "id": 21736,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.158648,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 116698,
      "vote_count": 3,
      "budget": 0,
      "overview": "It started as a friendly meeting between 4 old buddies with their basketball coach and ended up in revealing the truth about their relationship. The meeting forces the five men to reveal their true identity, to be honest with each other for the first time in their lives. When the night comes to an end they decide to go back to the old glorious days and reunite into the team which won that championship season, back in 1957.",
      "similar": [],
      "original_title": "That Championship Season",
      "runtime": 110,
      "poster_path": "/yJwiRI4Di6Y4KwIBGNsZ32FzLPB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
         "name": "Cannon Group",
         "id": 1444,
         "origin_country": ""
      }],
      "release_date": "1982-12-09",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jason Miller"],
      "runtime": 110,
      "synopsis": "It's ellection time, and mayor George Sitkowski (Bruce Dern) is standing for re-ellection. It's difficult, because his main opponent is young and popular. He decides to go for a stunt, hiring a she-elephant for his first political meeting. Many people go to the meeting to see it, but she dies, and Sitkowski needs to get rid of it secretly. However, a journalist (Edward Cunnigham)decides to broadcast the news live, so that the stunt becomes bad publicity for Sitkowski, while his men are trying to get rid of the dead animal throwing the corpse into the abandoned mines. Tom Daley (Martin Sheen) arrives. He meets Sitkowski, his brother James, who is the campaign director (Stacy Keach), wealthy enterpreneur Phil Romano (Paul Sorvino) and retired coachman Delaney (Robert Mitchum). They won the 1954 Pennsylvania Estate basketball championship back at high school. They meet to celebrate it, but there is one more player missing. This one never appears, and later the audience will learn that he had played it so tough that he ended sending to hospital one member of the runner-up team, pressured by Delaney's instruction. Romano doubts if Sitkowski can really make it to the city council this time, because of his policy of keeping the old buildings, like the old high school and the never-used-anymore train station. He'd like to open a shopping mall instead of making a museum. They drink and remember their happy times when they were young. At one moment, James tells everybody that Mariam, Sitkowski's wife, has been going to bed with Romano, and that everybody knows. Sitkowski has doubts whether he can keep on accepting Romano's money for his campaing -he's his main contributor-. The coachman wants them all to pull together and fight re-election, but it seems impossible. Romano phones Shermen, the younger and more handsome politician who is running for mayor, offering to finance his campaign as well. He is dismissed jockingly, and his attempt to blackmail Shermen because of a communist cousin of his ends in complete failure. Tom refuses to write the speeches for Sitkowski's campaign. He drinks too much, showing that he's an alcoholic. Sitkowski phones his wife, who tells him she has been unfaithful in order to get the money to finance his campaign. James offers Romano himself to stand for mayor's office, wanting to have the opportunity of leaving his badly-paid position as high school headmaster. Tom leaves the reunion after having seen Romano taking some cocaine. James and Sitkowski fight each other. However, in the end, coach Delaney will put the tape of the old game when t hey won the championship and they all decide to leave their differences aside so as to work for Sitkowski's profit. Even Tom comes back to Delaney's to do his part of it.",
      "writers": ["Jason Miller"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084784/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MTE5Mzc3NF5BMl5BanBnXkFtZTcwODQ2NzI5NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bruce Dern, Stacy Keach, Robert Mitchum | See full cast and crew »"],
      "reviews": [
         "I'm writing this hopefully to have these comments take the place of the inane, untrue comments by another viewer whose comments' title is \"a failure\". This film is full of performances that are a primer for anyone wishing to be an actor; and I watched it expecting it to be play-ish and dry: it was not, it was expertly directed (rare for a playwright to do that so well; Mamet can't even do it), expertly paced, expertly shot and edited. This film richly reflects the excellent play and is a championship effort by all. (I am a produced playwright and screenwriter; most likely the viewer/commentator who deemed this film \"a failure\" is a failure himself.)",
         "I won't carry on forever but I should say that this film is something of a well-kept secret it seems. One thing about \"little gems\" like this one is that if you hype them too much they become something else. If you see this movie with expectations too high then you might be disappointed, if on the other hand you watch it expecting to see one of the best low key character dramas you've probably seen in a while then you'll feel rewarded. Ultimately this is a film driven by SIX great performances (that's one for every member of the ensemble and another by the director/writer Jason Miller). What is there to say, they were all flawless and not once did the writing sink into cliché or formula. For once it was just great to watch a movie where, personally, every time I thought I knew what would happen, my expectations were defied. I'm not talking about any, now all too popular; so-called clever twists but just subtle turns in unexpected directions. In other words this is truthful cinema at its best, unexpected in the way life often really is. To say that 'That Championship Season' is simply an allegory for faith in God is far too reductionist when discussing a film that has this much to say. Of course the film could be read this way but I feel religious or political undertones are the in-essentials of this story. What is essential is the recognition of a little of ourselves in these characters that have been drawn so well, bitterness, regret, self-pity, greed, lust, bigotry but also love, sacrifice, forgiveness are all here in all characters and in more or less equal measure and depending on your point of view they have nothing to do with religion. In short no one in this movie seems constructed, they simply live and breath the way we all try to, the lesson if any is simply to admit to some or all of those qualities in ourselves and to try and live a little better.",
         "That CHAMPIONSHIP SEASON examines the effects of strong emotions based on long standing friendships and winning teamwork on four former high school teammates and their coach, now middle aged men. This film shows the winning out of long standing bonding among five guys (for 25 years), now middle aged, over practicality and common sense. i.e. the guys backing Sitkowski (Bruce Dern) for re-election, even though he is probably washed up. This movie shows how old friendships and fond memories of the past can triumph over the stressful realities of the present. Down yuppyism, up corny, melodramatic memories and buddyism! I think this movie is great for the human spirit! Its also a dark comedy and, therefore, should be taken lightly. No political correctness here! Its like Woodstock lasting for 25 years. I, a hopeless romantic, give this movie a 10. The impact on the five old comrads of hearing the replay of the championship game's last seven seconds is both corny and dramatic. In today's eye for an eye, cut-throat world it is doubtful if these guys would have ever remained lifelong friends.",
         "Based on Jason Miller's Pulitzer Prize winning play, \"Championship Season\" succeeds in a department many stage adaptations often find insurmountable: the transition from boards to big screen. \"Season's\" die-hard critics cried foul when Miller presented his work with changes in original flow and format, forgetting how such blind loyalty to purity often trapped many good works into the category of 'too boring to watch.' Some of \"Championship Season's\" best moments, ironically, arrive in the first half hour when Miller went out and captured his hometown of Scranton, Pennsylvania at one of its most desperate times; the blue collar fabric of the community had eroded so dramatically during the 'oil glut' recession that the very face of the city was changing. As Miller's characters seem desperate to cling to their old ways, the deteriorating streets of Scranton reflect their struggle. Further criticism was levelled at the play's strong language; there's something to offend just about every race, sex and religion. Miller toned it down, slightly, again - an accurate depiction of the city's character. One need only to recite their address in Scranton for any resident to know their life's story. Italians live over there, Jews there, blacks there, the Irish over there, on and on. Scranton is an old city with an old fashioned, quiet system of segregation that may not be as unusual as we'd like to think. When the Coach talks about \"as a race, can't trust 'em,\" remember - it isn't the playwright speaking, but rather an entire city being indicted. That said, \"That Championship Season\" can be an enjoyable and moving film experience - that is, for those who don't carry the baggage and prejudices of the past.",
         "To me the outstanding feature of this movie is the acting of Robert Mitchum, who superbly fits the role of coach to a group of men who gather to reminisce and during the course of their encounter, almost tear each other apart--verbally, physically and emotionally. The others are outstanding as well and are all great actors. However, Mitchum shows the range he has as an actor that many of his earlier roles didn't allow him. A note of division is introduced into the proceedings that lays raw their emotions. It leads to an escalation of bitterness and recriminations. During it all, they find out about themselves and what they have become because of the brutal honesty of one another. None of them are plaster saints, far from it, they are classic alpha males, no worse or better than most of us. In the end, they probably realize that they are better for the brutal honesty that they can share with one another.",
         "This is a great story based somewhat factually on events in the City of Scranton. I was cast as an extra (as was many of the Scranton Inhabitants)I was the kid with the red stripped Tube Socks walking on the left of the Elephant in the parade. The events of the Elephant actually happened in Scranton about 1976. The Main Characters are based on High School Basketball Players that Jason Miller went to High School with at Scranton Central High School. The Stores that line the street that the parade moved past, were blown up @1992 to make way for a shopping mall. Jason Miller became a Drama Professor at the University of Scranton. At Miller's Funeral, many of the original stars of the movie were in attendance.",
         "When the names of producers Menahem Golan and Yoram Globus are mentioned, it seems that the first thought that comes to mind are the schlocky B-grade action movies that they made. While this is understandable (they *did* make a lot of those movies), what has faded from people's minds is that they produced a number of arty, serious-minded dramas as well. That includes \"That Championship Season\", which is pretty unknown today despite getting some respectable reviews at the time. It's a movie that deserves to be rediscovered. No, it's no classic, but it has a lot going for it, the most obvious thing being its cast. The cast is first-rate, with all five players giving top-notch performances. The characters they play are interesting as well - they are all flawed (including, but not limited to spouting racial slurs), but interesting in their flaws and how they deal with them when exposed. I was interested in how these characters would end up at the film's end. It isn't a perfect movie - it's obvious which parts of the movie were not in the original play, for one thing, and most of the movie is stuck in the ground floor of a house - but it is *good*, and will make you wonder why Golan and Globus' tries for respectability were rejected by audiences.",
         "Where would we be without mythology? Up the creek. Cultural anthropologists have a respectable amount of information available on about four thousand independent societies, and every one of them has an organized system of myths that explains, among other things, where we came from, how we got here, and what hold us together. This movie is a kind of case illustration of how it all works. \"That championship season\" -- a time in the long past when a group of now overgrown high school kids under the tutelage of a coach of limited mental means but considerable moral stature guided them to the top. Well, it wasn't simply a season, according to this film, but their Garden of Eden, their Golden Age. The entire underpinning of the film is an allegory regarding religious mythology. It mirrors current society in that the myth has become hoary and is beginning to show many cracks. Lord knows people are staying away from mainstream churches (and other ideologies, such as Marxism) in droves. \"The boys\" have turned into philanderers, drunks, and shady businessmen, and their solidarity is falling apart. None of them is noble in any way. At critical moments, it is the \"coach\" and their faith in him that holds them together. And when, after all the arguments and recriminations and name-calling, they stare at their meaningless trophy and hold hands in an empty gymnasium, the scene must touch the stoniest heart. The trophy, and the coach who gave it to them, don't amount to very much -- a cheap piece of metal symbolizing little, and a man now grown older who dispenses clumsy advice like -- \"Boys, don't lose your poise.\" It isn't much but they hang onto it for the simple reason that they have nothing else. It is their little myth, and there is no replacement for it. John Ford made a similar point in \"Steamboat Round the Bend,\" but his story was more optimistic. Will Rogers comes to manage a steamboat with an exhibit of old wax statues of mythological figures and historical persons like Napoleon. There is a distinct absence of customers because no one cares about seeing a likeness of Hercules anymore. What does Will Rogers do? He throws out the old costumes and dresses them in new, more modern, more \"reform\" garments. Romulus and Remus become Frank and Jesse James, and so forth. In other words, when the old myths are worn out, you create new ones that attract people. Joseph Campbell would have approved. But these boys are shackled to the past and lack such resources. The film is well played and has many dramatic moments -- and humorous ones too. The coach expounding on a professional athlete's achievements and referring to him as \"a splendid (N word).\" A failed attempt to bury an elephant (!). I thought this movie was excellently done. Miller did a fine job of directing his own play and opening it up. Mitchum effortlessly plays the naive and well-intentioned Mentor. He should have received more recognition for his talents than he did, though, to be sure, he walked through some parts and chose others badly. \"That Championship Season\" isn't shown on TV very often. Too bad. It ought to be seen.",
         "Obviously anyone who finds this film boring would be better off not watching films based on plays such as \"Glengarry Glenross\" or \"Who's afraid of virginia wolf?\" What did you think it was going to be about? Flashbacks of basketball scenes or a chase through Scranton. It's a movie based on a play. The play had only 5 characters and this movie focuses on those 5 characters. Do you not know the difference between a film adaptation of a play and a regular film? It's okay to hate this movie. It just goes to show that it's not your type of film. I, for one, hate Lord of the Rings movies but I won't say they're poorly made, I just don't enjoy those films. The performances in this film are all excellent, especially Mitchum and Sheen.",
         "It took about a decade for Jason Miller's Pulitzer Prize winning play That Championship Season to finally make it to the big screen. But even with Miller himself writing an introductory prologue for the screen it never quite loses its stage origins. I have to say that Miller tried though, he was clearly influenced by the film adaption of Long Day's Journey Into Night where the Tyrone house almost becomes a character unto itself. But the coach's house in this film does not quite have the same grandeur. What's reuniting Coach Robert Mitchum and his boys from the 1954 state championship basketball team is the re-election campaign of Bruce Dern one of the members. The other three of the four remaining starting five are brothers Stacy Keach and Martin Sheen and Paul Sorvino who is now one of the richest men in town. Keach is now the principal of the high school where he was a star athlete and his brother Sheen is a ne'er do well drunk. They've all got their secrets and during the coach's efforts to get his boys working in tandem again a lot of dirty little secrets come out about all of them. Mitchum was not the original choice for the part of the coach, the role was slated for William Holden who died before shooting could start. According to Lee Server's biography of Mitchum, Bob had real difficulty with the role because he was not particularly a sports fan, of basketball or anything else for that matter. He had a hardscrabble life as a kid and didn't do much or learn much in the way of sports. It was part he could never quite get into, especially using all the sports idioms to make a point. On stage the part was done by Charles Durning. Paul Sorvino was the only member of the original cast to repeat his role. The original play did not have the whole business about the elephant dying and Dern's attempts to get rid of the body shown on screen. That was Miller's new writing to get more of a movie feel to his project. The film was shot entirely on location in Scranton, Pennsylvania though the bulk of it was in and around the coach's house and that could have been done anywhere. That Championship Season is not a bad film, but considering the author himself helped with adaption it should have turned out better."
      ],
      "genres": ["Drama"],
      "productionCompanies": [],
      "summaries": ["It started as a friendly meeting between 4 old buddies with their basketball coach and ended up in revealing the truth about their relationship. The meeting forces the five men to reveal their true identity, to be honest with each other for the first time in their lives. When the night comes to an end they decide to go back to the old glorious days and reunite into the team which won that championship season, back in 1957..."],
      "budget": 0
   },
   "movielensId": 32082,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-12-09",
      "dvdReleaseDate": "2005-02-08",
      "directors": ["Jason Miller"],
      "runtime": 110,
      "movieId": 32082,
      "title": "That Championship Season",
      "mpaa": "R",
      "actors": [
         "Bruce Dern",
         "Stacy Keach",
         "Robert Mitchum",
         "Martin Sheen",
         "Paul Sorvino"
      ],
      "imdbMovieId": "0084784",
      "originalTitle": "That Championship Season",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "It started as a friendly meeting between 4 old buddies with their basketball coach and ended up in revealing the truth about their relationship. The meeting forces the five men to reveal their true identity, to be honest with each other for the first time in their lives. When the night comes to an end they decide to go back to the old glorious days and reunite into the team which won that championship season, back in 1957.",
      "tmdbMovieId": 116698,
      "avgRating": 3.42308,
      "releaseYear": "1982",
      "numRatings": 13,
      "posterPath": "/8TQcvlteF1QaVpdilxn5DwVcjvA.jpg"
   }
}