{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0106264",
      "video": false,
      "title": "Amongst Friends",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Laura",
            "gender": 1,
            "credit_id": "52fe4958c3a368484e126d03",
            "name": "Mira Sorvino",
            "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
            "id": 23931,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4958c3a368484e126cff",
               "name": "Rob Weiss",
               "profile_path": "/3UNvtHbCmJXjeTu5PXVid85LXvZ.jpg",
               "id": 183055,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5509d15c92514110cc003e6c",
               "name": "Rob Weiss",
               "profile_path": "/3UNvtHbCmJXjeTu5PXVid85LXvZ.jpg",
               "id": 183055,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 1.0E-6,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 77041,
      "vote_count": 3,
      "budget": 0,
      "overview": "Director Robert K. Weiss gives a good accounting of himself in his first feature-length effort Amongst Friends. The film is set in an affluent Long Island neighborhood, the home of boyhood chums Patrick McGaw, Steve Parlavecchio, and Joseph Lindsey. With too much time on their hands, the kids turn to crime for \"kicks\". Events snowball into a climactic life-or-death drug deal, which threatens to end in disaster when one of the boys capriciously pulls a double cross. Barely released in 1993, Amongst Friends will probably get more play in future years thanks to the presence in the cast of Oscar-winner Mira Sorvino.",
      "similar": [],
      "original_title": "Amongst Friends",
      "runtime": 88,
      "poster_path": "/rJOL0DIytXxbCSiewviSnBp5S0E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1993-11-03",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "When Crime is a Way of Life, You Never Know if You're Amongst Enemies...or Amongst Friends.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rob Weiss"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Rob Weiss"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106264/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxMDQ3MDIwOV5BMl5BanBnXkFtZTcwMDI4NTcyMQ@@._V1_SY317_CR19,0,214,317_AL_.jpg",
      "actors": ["Stars: Joseph Lindsey, Patrick McGaw, Steve Parlavecchio | See full cast and crew »"],
      "reviews": [
         "I know I'll be yelled at for giving this movie such a high rating but it was one of the surprise flicks of the 90's for me. I didn't catch it at the theatres but saw the trailer on another video I'd rented. It caught my eye and when I saw it on another video as a preview I made a note to get it. Time went by, I finally found a copy and was glued to the screen. Not everything is perfect mind you but the fact that a life of crime is no life is clearly defined. If you have a young person who thinks a life of drugs is cool, show him or her this movie and see the tragedy of such a lifestyle front and center. The performances in this movie range from good to outstanding. I was riveted to the narrative and the soundtrack one of the most superb ever. I was stunned at the contrast of composers and you go from the master Ennio Morricone to MC Lyte! You can't beat that! The comic characters are realistic. We laughed and cried throughout the movie. You couldn't ask for more realism. These were people who weren't \"Hollywood\" models but people with character, charisma, and most of all charm. This was a story about choices and repercussions that spanned a couple of generations all wound up in some gut wrenching violence in some scenes and comic violence in others. Rigoletto the classic opera comes to mind. That swing back and forth from tragedy to tragic comedy to frustration and all the emotions in between. Everyone did such a fine job that it's one of the few memorable movies from the 90's. You will get some big laughs, I mean big laughs from this movie but don't let that fool you one iota. There are heartbreaking scenes of such tragedy that it will twist you up inside and make you so angry at crime you'll be ready to spit nails. How writer Weiss pulled this off is a miracle. It defines several points in modern history and of course pays tribute to gangster films past and present. If Weiss put together more projects like this I'd be happy. Bring tissues, popcorn, and enjoy a real modern day classic. Did I mention I loved every single person cast in this movie? Even the extras? Just perfect. I've been writing gangster and crime stories for 25 years and Amongst Friends really hit home for me. So many of the characters were like mirrors to people I'd tangled with in the past I could see that I had made the right decisions the character Andy hadn't. Get this vid for your kids out there and you won't be sorry.",
         "This movie is worth watching if only for the Mick Jones score, however there are several solid performances here, including David Stepkin who plays the old Jewish gangster, not too mention the 3 friends who play in the starring roles. There may have been a bit too many stereotypical New York Characters but that is really done for comic relief. It provides an interesting perspective into growing up in suburban Long Island, although the characters could have had some more depth. I thought the narrative added a whole new dimension to the film. The film does have an interesting look to it and is entertaining to watch. I recommend it and enjoyed it very much.",
         "This movie is a must see for young wannabe gangsters. It has a measure of authenticity that is absent from other films in the genre. The story takes you from the childhood through the young adulthood of three \"friends\", one of which is overambitious and jealous of his former cohert that just returned from prison (After doing a stint for the very guy that turns out to be his nemesis). This movie captures the essence of being young in an underground environment and having aspirations of criminal life. If you grew up in New York or Chicago, this movie is a must see and you will definitely relate. It also is a shining example of where \"the life\" can get you. That is to say.....absolutely nowhere!",
         "i may be biased because i live in the area in which this film takes place, so i see a lot of subtle things other people may not see. i enjoyed the portrayal of rich Jewish kids who wanna be gangsters for no good reason at all. this was an impressive debut movie, but needed a little more story and deeper characters. 5/10",
         "I thoroughly enjoyed this film. I may be somewhat biased insofar as I grew up in the five towns and went to school there. Although the film has drawn some criticism as simply being a \"Mean Streets\" with the seedy, urban locale transposed to a wealthy, suburban environment, this is not the whole story. Similar events to those depicted in the film were happening with kids in these areas, so it really is not a mere rehash of Scorcese. The plot involves three inseparable childhood friends, sons of wealth and privilege. Andy (Steve Parlavecchio), Trevor (Patrick McGaw), and Billy (Joseph Lindsey), grow up in the Five Towns L.I. They enjoyed doing petty crimes as youngsters for the respect it earned them as well as to escape boredom. After finishing high school, in the late 1980s, Billy asks Andy to make a drug delivery for him. Once Andy says yes, the stage is set for a story involving drugs, wealth, Jewish gangsters, and the bonds of friendship. Definitely worth a look if you enjoy this type of film, but admittedly falls somewhat short of its lofty goals insofar as a lack of character development and overall plot structure. Interesting note - Mira Sorvino shows glimpses of the future in her first real movie role in the film.",
         "I first saw this movie when I was in college and man could I relate. I'm 30 now and recently saw it for the first time since then when I watched it a billion times. I won't pretend that it has passed the test of time with flying colors, but it does what it sets out to do extremely well and without a lot of bells and whistles. Synopsis: 3 fellas from upper crust families play grown-up from an early age and have varying results as they enter adulthood. Drama ensues. Resolution meets some better than others. I really enjoy the Steve Parlavecchio kid and will, after concluding this review, seek out his career accomplishments, if he had any. Also of note, I believe this was the first substantive role for Mira Sorvino. I assume that without daddy Paul blazing trails for her, she never would have gotten much farther than this flick. Perhaps most important: A KILLER soundtrack for any child of the late 80's/early 90's with solid score by Ennio Morricone. I will never forget finding the soundtrack in a Used bin for $1.99 back in '95. This is the polar extreme of a GoodFellas/Godfather epic in the same vein. Take it for what it is, and I say you'll really enjoy it.",
         "Poor acting by most involved, as well as some other obvious flaws are'nt enough to destroy this movie for me~ They're even part of the tragic air of the film~ and almost add a particular charm to it.. Maybe you must be able to relate to certain aspects of this movie to appreciate it, particularly the time and/or place of the \"sub-culture\" involved.. but I will just simply say that despite all of it's technical flaws, it's still a film that stands out in my mind throughout the years.. and one that I still find myself putting into the dusty VHS box every so often.. Perfect example of how all enjoyable entertainment need not meet the \"professional criteria\" of it's respective industry..",
         "If you were born or grew up on Long Island, New York, you just might relate in some way to the plot of this film and the great acting by all the actors who portray various backgrounds, Italian, Jewish, and the league of Nations! In many ways this film makes people think that the only way to make a living is cheating, stealing or just plain Wheeling & Dealing. Many families moved from Brooklyn, N.Y. to the suburbs of Long Island, like Merrick, Freeport, Lindenhurst, Lynbrook, and Valley Stream. This film does paint a horrible picture of evil young people following in the footsteps of gangs and mobsters! The ending of this picture was rather sad, lacking in any love or romance, just plain BORING!",
         "Even though many critics have labeled \"Amongst Friends\" as just a 90's version of \"Mean Streets\", this is not necessarily a criticism. The acting is solid (see Mira Sorvino in an early role) and the drama level is kept high throughout the film. Basically it's a tale of Jewish Long Island kids growing up to be gangsters, and I recommend it.",
         "I would definitely recommend this movie to all gangster movie fans. I am the dancer in the nightclub. This was shot at the Port O Call nightclub in Brooklyn, NY. I was handpicked & am trying to get my name listed in the credits as the actors have dialog about me & I appear in most of the trailers of the movie. I still have all my business cards from that night, i.e. Outlaw Bikers, John Landis, etc. The movie is really comparable to any of the great gangster flicks. Definitely would recommend this. The acting is excellent, good storyline & lots of action. Up there with the likes of Casino & Goodfellas. Definitely a must see!"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Island World",
         "Last Outlaw Films"
      ],
      "summaries": ["Three bored Long Island buddies seek excitement on the streets, with perilous results."],
      "budget": 0
   },
   "movielensId": 32120,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-11-03",
      "dvdReleaseDate": "2005-02-15",
      "directors": ["Rob Weiss"],
      "runtime": 88,
      "movieId": 32120,
      "title": "Amongst Friends",
      "mpaa": "",
      "actors": ["Mira Sorvino"],
      "imdbMovieId": "0106264",
      "originalTitle": "Amongst Friends",
      "genres": [
         "Crime",
         "Drama",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Director Robert K. Weiss gives a good accounting of himself in his first feature-length effort Amongst Friends. The film is set in an affluent Long Island neighborhood, the home of boyhood chums Patrick McGaw, Steve Parlavecchio, and Joseph Lindsey. With too much time on their hands, the kids turn to crime for \"kicks\". Events snowball into a climactic life-or-death drug deal, which threatens to end in disaster when one of the boys capriciously pulls a double cross. Barely released in 1993, Amongst Friends will probably get more play in future years thanks to the presence in the cast of Oscar-winner Mira Sorvino.",
      "tmdbMovieId": 77041,
      "avgRating": 2.25,
      "releaseYear": "1993",
      "numRatings": 16,
      "posterPath": "/rJOL0DIytXxbCSiewviSnBp5S0E.jpg"
   }
}