{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0038477",
      "video": false,
      "title": "The Diary of a Chambermaid",
      "recommendations": [
         107426,
         109379,
         118534,
         20372,
         144650,
         104806,
         200140,
         183725,
         118509,
         99657,
         73313,
         85923,
         145283,
         340336,
         175455,
         45946,
         48712,
         129339,
         362475,
         117975
      ],
      "backdrop_path": "/rK846iWEEhmWnO5vvYjwDor5VcJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Célestine",
               "gender": 1,
               "credit_id": "52fe46b5c3a36847f810dde7",
               "name": "Paulette Goddard",
               "profile_path": "/8MuOzgtsI1PQUIlj2e2Y1UFLpTc.jpg",
               "id": 14027,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Captain Mauger",
               "gender": 2,
               "credit_id": "52fe46b5c3a36847f810ddeb",
               "name": "Burgess Meredith",
               "profile_path": "/lm98oKloU33Q7QDIIMSyc4Pr2jA.jpg",
               "id": 16523,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Georges Lanlaire",
               "gender": 2,
               "credit_id": "52fe46b5c3a36847f810ddef",
               "name": "Hurd Hatfield",
               "profile_path": "/rtJEdDRiJK3xU7QVzs0lj0UUgwA.jpg",
               "id": 80620,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Joseph",
               "gender": 2,
               "credit_id": "52fe46b5c3a36847f810ddf3",
               "name": "Francis Lederer",
               "profile_path": "/rUgnduJ3DIeBxAKG462BtK5T7Kr.jpg",
               "id": 13906,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Madame Lanlaire",
               "gender": 1,
               "credit_id": "52fe46b5c3a36847f810ddf7",
               "name": "Judith Anderson",
               "profile_path": "/ryTVWN7XI2WejLsFhicfx3yJ6y9.jpg",
               "id": 3362,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Rose",
               "gender": 1,
               "credit_id": "52fe46b5c3a36847f810ddfb",
               "name": "Florence Bates",
               "profile_path": "/88b2ljcVKqcIiInibVvQWriXRLP.jpg",
               "id": 3367,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Louise",
               "gender": 1,
               "credit_id": "52fe46b5c3a36847f810ddff",
               "name": "Irene Ryan",
               "profile_path": "/t713VBd3lzPSKl6FiTnKqQn5tkD.jpg",
               "id": 116660,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Captain Lanlaire",
               "gender": 2,
               "credit_id": "52fe46b5c3a36847f810de03",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Marianne",
               "gender": 1,
               "credit_id": "52fe46b5c3a36847f810de07",
               "name": "Almira Sessions",
               "profile_path": "/9KaLRatIUKBnjNNIFS3PlVLNYXY.jpg",
               "id": 107678,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46b5c3a36847f810ddc5",
               "name": "Jean Renoir",
               "profile_path": "/jiMgUC1NWlXjGvfyYHPL3VBpseE.jpg",
               "id": 11528,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b5c3a36847f810ddcb",
               "name": "Burgess Meredith",
               "profile_path": "/lm98oKloU33Q7QDIIMSyc4Pr2jA.jpg",
               "id": 16523,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b5c3a36847f810ddd7",
               "name": "André Heuzé",
               "profile_path": null,
               "id": 132484,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b5c3a36847f810dddd",
               "name": "André de Lorde",
               "profile_path": null,
               "id": 132485,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b5c3a36847f810dde3",
               "name": "Thielly Nores",
               "profile_path": null,
               "id": 132486,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.131061,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 45212,
      "vote_count": 9,
      "budget": 0,
      "overview": "Celestine, the chamber-maid, has a new job in the country, at the Lanlaires. She has decided to use her beauty to seduce a wealthy man, but Mr. Lanlaire is not a right choice: the house is firmly controlled by Madame Lanlaire, helped by the strange valet Joseph. Then she tries the neighbour, former officer Mauger. This seems to work. But soon the son of the Lanlaires comes back. He is young, attractive and does not share his mother's antirepublican opinions. So Celestine's beauty attracts Captain Mauger, young Georges Lanlaire, and Joseph. Three men, from three different social classes, with three different conceptions of life. Will Celestine be able to convince Georges of her sincerity?",
      "similar": [],
      "original_title": "The Diary of a Chambermaid",
      "runtime": 91,
      "poster_path": "/dMlNoH6Cls6T1mFEqvHCCPlKx9p.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Benedict Bogeaus Production",
         "id": 5426,
         "origin_country": ""
      }],
      "release_date": "1946-02-15",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jean Renoir"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Burgess Meredith",
         "Octave Mirbeau"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038477/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNzU2NDU4MF5BMl5BanBnXkFtZTYwMTY5NjE5._V1._CR12,25,258,407_SX214_AL_.jpg",
      "actors": ["Stars: Paulette Goddard, Burgess Meredith, Hurd Hatfield | See full cast and crew »"],
      "reviews": [
         "I cannot pretend to explain all the allusions and metaphors Renoir intended to convey with this impressionistic comedy. Paulette Goddard, as the main character, is magnificent. She conveys her feelings and thoughts through her diary, but in a manner that is always blurry and full of confusion. And speaking of confusion, Hurd Hatfield is on hand as the scion of the odd home. Burgess Meredith, Francis Lederer, and Irene Ryan all add terrific seriocomic support in their roles. Be prepared to experience many conflicting feelings while viewing this film.",
         "Chambermaid Paulette Goddard (Celestine) and the feeble, irritating Irene Ryan (Louise) arrive at the stately home in which they are to serve. They first meet the rather unpleasant valet, Frances Lederer (Joseph) before being introduced to Reginald Owen (Captain Lanlaire) and his wife Judith Anderson (Madame Lanlaire), who have an ill son, Hurd Hatfield (George). It becomes clear that it is Goddard's role to make his life better. Can she succeed....? Paulette Goddard, Frances Lederer and Judith Anderson carry the film in terms of having a good cast but I'm afraid that's it. The film suffers by having too many buffoons - virtually everybody else. While Reginald Owen is OK as a bumbling old man, one is enough for any film. Unfortunately, we are also given Burgess Meredith as an extremely annoying old codger of a neighbour - he must be the most annoying character EVER. He constantly jumps and bounces around just like all old people do - you get my drift? He is so unconvincing that it's embarrassing. He is meant to be a likable, cheeky chappy. He isn't. Frances Lederer has a great moment with him towards the end of the film. Marvelous! Frances Lederer keeps the tension ticking and is very watchable as the valet with something sinister going on in his head. The plot is good and keeps us watching as to how things will pan out for Goddard. Time to check the silverware.",
         "Almost a film noir movie, this dark film tells the story of Celestine, a young girl (Paulette Goddard) who comes to work for a well to do family. The parents (Reginald Owen and Judith Anderson) have a son (Hurd Hatfield) who seems to be too ill to care about life or love. Spice this with Celeste in the house and you can take it from there. Seems the Mama wants her to seduce her son and make him happy. Meanwhile, next door is a neighbor, Burgess Meredith, who is a bit looney yet lovable. He causes all sorts of raucus in his mischief and courts Celestine as well. However, along the way he is done in for his money by the butler of the house (Frances Lederer in a very spooky performance). Alls well that ends well and Hatfield gets his girl. What makes this film interesting, wonderfully directed by Jean Renoir, is the bleakness of the scenes. Darks and lights are used very effectively as are the costumes and Miss Goddard as a blonde was a good choice. This was a joint venture for Miss Goddard and Meredith (real husband and wife at the time) as producers.",
         "(WARNING - CONTAINS MILD SPOILER) The film is first of all a charming, well-shaded portrait of the foibles and oddities of a complex household, reveling in such easy diversions as neighbour Meredith's eccentric feud with the master of the house, and initially casting Goddard as a straightforward gold-digger - her performance is beautifully ambiguous in the way she might or might or not be genuine in her response to her various suitors. Later (and not entirely smoothly; some scenes, and the thing as a whole, feel a bit forced and/or abbreviated) it turns into a quivering, troubled parable on unravelling patriarchal and political structures - the scene where the household carries out its bizarre, defiant, hopeless ritual of anti-revolutionism is amazing. Lederer's mutation into a murdering capitalist is a bit overstated; as is the underlining of Goddard and Hatfield's rebellion across class lines by having him triumph over a debilitating illness, but all is justified by the film's superbly orchestrated crowd scene climax, which has the chaotic sweep of real history and perfectly places the human melodrama in its proper context.",
         "This film is not to be confused with the film by the same name which was made in 1964 by the famed director Luis Buñuel. While the theme of a conniving maid who is using her wiles to get ahead is in both and they have the same name, otherwise the films are very dissimilar--mostly because the bizarreness of Buñuel's version is missing. No foot fetishes, no rape, no murder and no antisemitism in the 1946 film! Jean Renoir's vision for the story is light-years different from Buñuel's. Personally, I think both versions have their strengths and both have their flaws, but I think the latter version is a bit better. Paulette Goddard plays the title role. She is a conniving woman who comes to her new home as a maid in order to marry a rich man. She's mostly interested in the master's son--but the young man is an indifferent suitor at best (Hurd Hatfield). There's also the old and VERY wacky neighbor (Burgess Meredith) and the valet--played in a very creepy manner by Francis Lederer. Who will she get by the end of the film? And, unfortunately, who care? My biggest problem with this film is Goddard. I have long wondered why she got so many plum roles as she was only a fair actress--and here she often overplays her part. Any sort of subtlety is missing from her portrayal--and the role really needed this, as the woman SHOULD have been played like a master manipulator. As far as the direction goes, it wasn't bad--and had the nice look Jean Renoir was noted for in his films. But he probably should have reigned in a few of the more florid portrayals (not just Goddard's)--though Lederer was BRILLIANT and the best thing about the film. Also, Goddard's character was a bit too sympathetic--she should have been much more amoral and manipulative in order to make the movie more enjoyable. Overall, I prefer the 1964 version a bit more--though I think this film could use yet another remake--one that is more subtle and without the weird 'extras' Luis Buñuel put in his film that tended to distract the viewer. Worth seeing but nothing more--and it should have been better. A great script idea that should have been even better--and juicier. FYI--Burgess Meredith and Paulette Goddard were married while they were making this film. Seeing Meredith wearing so much makeup and playing a very old man was rather funny--as they are almost the same age.",
         "A little less than 100 after the French Revolution, the aristocracy targeted by the peasants are still not completely gone. During this era of Napolean III towards the end of the French monarchy (as ruled by an Italian), one family is desperate to keep its treasures and status of its once great name. That is the Lanlaire family, headed by domineering Judith Anderson who totally controls her husband Reginald Owen and has caused her son Hurd Hatfield to run away. The addition of two new servants (Paulette Goddard and Irene Ryan) is the opening trumpet blast towards their downfall. The impending return of Hatfield stirs Anderson into action: she wants attractive maid Goddard to seduce her son so he will remain under her roof and ultimately under her control. Francis Lederer plays the butler who is equally domineering and is also obviously dangerous. Goddard refuses to take any guff from Lederer, while Ryan (\"Beverly Hillbilly's\" beloved Granny) is an all-out scaredy cat. Next door are the strange Burgess Meredith and his obsessed companion, Florence Bates, who is immediately furious over Meredith's interest in Goddard. Meredith has an obsession with breaking the glass in his snooty neighbor's greenhouse and is also quite mad. There is a scene where he accidentally kills a pet squirrel that is quite disturbing. As Hatfield and Goddard become friendlier, Lederer gets more obsessed with Goddard, whose character Celestine is a follow-up to the same year's \"Kitty\". But unlike the mainstream \"Kitty\", \"Diary of a Chambermaid\" is a very strange movie, like a parallel universe where nothing seems right and everybody is acting mad like it was the norm. Owen's character is only feisty when Anderson is off the screen (until the very end) and of course, he too has a hankering for Celestine. Hatfield, quite different than his role in \"The Picture of Dorian Gray\", seems to take brooding to the excess here, but watching him come out of his shell with Celestine around is interestingly portrayed. Ryan shrieks more than Una O'Connor throughout the film so she can only be described as shrill. (It was good practice for her hysterical crying of \"Jed!\" on \"BH\" 20 years later.) As for Anderson, she starts off fine, understated, dignified and cool. But as we see the real motives of this messed-up mother, Anderson brings out all of her theatrics. She's dressed to the nines and spouts her lines dramatically as if she was just getting into her soon-to-be famous stage role of \"Medea\". Her character's obsession with the family's precious china is hysterical. Goddard has some very strange lines and her interactions with everybody around her appears as if she was spouting her lines as if they were Shakespeare's. In her interactions with off-screen hubby Burgess Meredith, it's almost amusing to think of them as a couple. He's obviously made up to play this psychotic neighbor and was apparently quite dashing off stage. Francis Lederer chews the scenery even more than Anderson so much that one expects him to bite into the secret treasures of Anderson's family. The usually sedate Florence Bates reads her lines with such hyperism she seems ready to have a heart attack at any minute. One must take films like this with a grain of salt. These period Gothic dramas are hit or miss. Hardly any of them are worthy of awards; They are simply pure escapism that post War audiences needed to see. Now that Europe was practically in ruins, seeing it as it was before the end of the monarchies was a hopeful sign that they could rebuild.",
         "Paulette Godard has never been more than the faintest blip on my personal radar but that, of course, may be my problem rather than hers. Her particular allure and/or charm has always eluded me and I've never accused her of being anything more than competent in the Acting department. That out of the way I have to say she makes a reasonable fist out of Celestine, the gold-digging chambermaid who fetches up in one of those eccentric households that are the backbone of Fiction, Theatre and Silver Screen. In something of a twist on a prevailing trend expatriate Jean Renoir opted to shoot a French story in Hollywood though he would, of course, also shoot American subjects there along with Max Ophuls who clearly became infected with the same bug as Renoir and made Letter From An Unknown Woman there two years later. The semi-classic novel which had also been dramatised for the stage was given a new lick of paint by actor Burgess Meredith - married to Godard at the time - who, as Producer, cast himself as the elderly Captain rather than the love interest, no doubt in an effort to display another of the strings on his bow. It's a strange melange and the presence of Judith Anderson should be sufficient to alert the cognoscenti to the tone - this time around she encourages a servant to seduce her son - and overall this is a movie that needs to be viewed more than once in order to formulate a balanced opinion.",
         "Octave Mirbeau's brilliant, chilling novel was written more than 100 years ago, but its sordid, sexy, near-surrealistic mood and story could not possibly be given a worthy treatment in 1946, and certainly not in an America still subject to the Hays code. This film takes only some of the incidents in the episodic novel and tries to make the story into an eccentric romantic comedy. But, minus the mood and ambiance of the novel, the result is awkward and odd. An important aspect of the novel, anti-semitism (the book was written when France was torn apart by the Dreyfus case) is completely left out, and, instead of perversion and cruelty, Celestine experiences, from her employers, only annoyance. The performances are lightweight, except for Francis Lederer (always good at gentlemanly brutes) as the sinister valet. The film's only moments of horror occur when he indulges his talent, and taste, for discreet violence. Nothing the great Renoir directed is without interest, and this Diary certainly has moments of beauty and affectionate comedy. But a much more accurate adaptation was Bunuel's in 1964. He left in the anti- semitism, and his own sexy-sadistic-surrealistic mood was a perfect match for Mirbeau's. One moment in this story reminded me of a similar incident, one of my favourites in a Bunuel film. The family for whom the chambermaid works lives next to a peppery, eccentric old man who demonstrates his loathing for his neighbours by throwing rocks through the panes of their greenhouse. In The Exterminating Angel, the partygoers are frightened when a brick is thrown through the window. The host calms them with \"It's nothing. Just a passing Jew.\" Priceless!",
         "The Diary of a Chambermaid is a transitional film in the development of Renoir's lesser known stylistic system. Braudy would later distinguish Renoir's two systems as being tied to theater and realism respectively (although there have been compelling arguments about these categories being either reductive or simply misnomers). Goddard is the focus of the story (much in the same way Renoir later uses Magnani, Arnoul and Bergman). The camera tracks her action, her closeups are one-shot, there are alternating shot scales in single scenes to emphasize her character's psychological reaction to events, studio exteriors help idealize the framing of her screen personality and high/low angle shots purvey her psychological perspective on group dynamics. Celestine (Goddard) has an ambiguity to her motivation that heightens psychological identification. It is unclear as to whether she sees the world divided into classes or sexes, or both. The ending is a happy one, and the politics is further subverted through jovial and emotionally-charged highly-individualized characters. Non-diegetic soundtrack is employed to increase distinctions in the emotional responses of different characters. Depth of field is at the service of Celestine's staging while obstructions in the mise-en-scene become incorporated into the plot. In this respect, the camera is not an unobtrusive one. There is an inconsistency in the use of stylistics, where on one hand reframing pans are fully at the service of psychological identification and privilege of the transcendental subject position while the long take mobile framing of the July 14th celebration reminisce on M.Lange, Illusion and Regle. Diary is a melodrama with comedic elements to take the edges off, but when the master of the house reads in the morning paper \"another woman murdered in Paris, another woman cut to pieces\" there is no doubt that Renoir is infusing a consideration for the plight of women in a misogynist society. This was very important to him and perhaps the dark undertones of this film have something to say about the repression he experienced working in Hollywood for the war. How Burgess Meredith factors into all that remains to be seen.",
         "I have seen a french movie \"Journal d'une Femme de chambre\" by Luis Bunuel...It seems that Remoir just regurgitated this movie...I saw \"La Règle du Jeu\"...and was not at all impressed...Renoir is very over-rated...In fact Bunuel's movie has same plot...beautiful chambermaid goes to country and everybody is impressed by her charm...his master tries to seduce her...the neighbor flirts with her...the head-servant likes her but ridicules her all the time...we see the movie through her eyes...she does seduce somebody but thats not for money...in a sense that seduction is for greater good...furthermore Bunuel's movie has a very strong political message apart from being a commentary on french bourgeois habitudes...It is very powerful extreme left propaganda movie...Jeanne Moreau of course is subliminal as usual... Renoir sucks..."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Benedict Bogeaus Production"],
      "summaries": ["Celestine, the chamber-maid, has a new job in the country, at the Lanlaires. She has decided to use her beauty to seduce a wealthy man, but Mr. Lanlaire is not a right choice: the house is firmly controlled by Madame Lanlaire, helped by the strange valet Joseph. Then she tries the neighbour, former officer Mauger. This seems to work. But soon the son of the Lanlaires comes back. He is young, attractive and does not share his mother's antirepublican opinions. So Celestine's beauty attracts Captain Mauger, young Georges Lanlaire, and Joseph. Three men, from three different social classes, with three different conceptions of life. Will Celestine be able to convince Georges of her sincerity? Will sinister and inflexible Joseph let his views on Celestine be ruined? A quite disillusioned depiction of humanity."],
      "budget": 0
   },
   "movielensId": 32181,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1946-02-15",
      "dvdReleaseDate": null,
      "directors": ["Jean Renoir"],
      "runtime": 91,
      "movieId": 32181,
      "title": "The Diary of a Chambermaid",
      "mpaa": "",
      "actors": [
         "Paulette Goddard",
         "Burgess Meredith",
         "Hurd Hatfield",
         "Francis Lederer",
         "Judith Anderson",
         "Florence Bates",
         "Irene Ryan",
         "Reginald Owen",
         "Almira Sessions"
      ],
      "imdbMovieId": "0038477",
      "originalTitle": "The Diary of a Chambermaid",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Celestine, the chamber-maid, has a new job in the country, at the Lanlaires. She has decided to use her beauty to seduce a wealthy man, but Mr. Lanlaire is not a right choice: the house is firmly controlled by Madame Lanlaire, helped by the strange valet Joseph. Then she tries the neighbour, former officer Mauger. This seems to work. But soon the son of the Lanlaires comes back. He is young, attractive and does not share his mother's antirepublican opinions. So Celestine's beauty attracts Captain Mauger, young Georges Lanlaire, and Joseph. Three men, from three different social classes, with three different conceptions of life. Will Celestine be able to convince Georges of her sincerity?",
      "tmdbMovieId": 45212,
      "avgRating": 3.125,
      "releaseYear": "1946",
      "numRatings": 8,
      "posterPath": "/dMlNoH6Cls6T1mFEqvHCCPlKx9p.jpg"
   }
}