{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "grizzly bear",
            "id": 2522
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "research",
            "id": 3664
         },
         {
            "name": "canuxploitation",
            "id": 206850
         }
      ],
      "imdb_id": "tt0117395",
      "video": false,
      "title": "Project Grizzly",
      "recommendations": [],
      "backdrop_path": "/6PQQBrlaTtqa9acCtgDLu6vdEM2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 0,
            "credit_id": "52fe494ec3a36847f8193633",
            "name": "Troy Hurtubise",
            "profile_path": null,
            "id": 1188009,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55db1c3292514143f000750a",
               "name": "Michael Allder",
               "profile_path": null,
               "id": 1242782,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db1c3ec3a36831fc007715",
               "name": "Gerry Flahive",
               "profile_path": null,
               "id": 1261494,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db1c4dc3a368166f002bd7",
               "name": "Louise Lore",
               "profile_path": null,
               "id": 1352147,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db1c58c3a368166f002bdc",
               "name": "Emmet Sheil",
               "profile_path": null,
               "id": 1500042,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55db1c649251417d7c000e07",
               "name": "Anne Bourne",
               "profile_path": null,
               "id": 1500043,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55db1c6fc3a36831fc00771e",
               "name": "Ken Myhr",
               "profile_path": null,
               "id": 1500044,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55db1c7a92514143e000783b",
               "name": "Tony Wannamaker",
               "profile_path": null,
               "id": 1500045,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55db1c8b92514143f3007548",
               "name": "Caroline Christie",
               "profile_path": null,
               "id": 1500046,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b8dc09c3a3687469000825",
               "name": "Peter Lynch",
               "profile_path": null,
               "id": 279107,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.506994,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 57953,
      "vote_count": 6,
      "budget": 0,
      "overview": "Documentary about the lifelong project of Troy Hurtubise, a man who has been obsessed with researching the Canadian grizzly bear up close, ever since surviving an early encounter with such a bear. The film documents Hurtubise's diligent work to improve his homemade \"grizzly-proof\" suit of armour, his efforts to test its resilience, and his forays into the Rockies to track down the grizzlies he dreams of meeting. The film manages to capture the humor of the project as well as its sincerity.",
      "similar": [
         281957,
         9433,
         75174,
         22538,
         290512,
         19898,
         7518,
         1562,
         2787,
         9693,
         568,
         9388,
         20766,
         5876,
         7191,
         764,
         5915,
         5176,
         238636,
         49049
      ],
      "original_title": "Project Grizzly",
      "runtime": 72,
      "poster_path": "/2prZK9AbaZRdjNTlaJ3dJohLEos.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/lMUDQZVtg8On4PAW5XFQPaQy6UK.png",
         "name": "National Film Board of Canada",
         "id": 10473,
         "origin_country": "CA"
      }],
      "release_date": "1997-10-03",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Whenever I have that dream... something bad happens.",
      "adult": false,
      "homepage": "http://www.nfb.ca/film/project_grizzly/",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Lynch"],
      "runtime": 72,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117395/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMDQ2Njg3OV5BMl5BanBnXkFtZTcwNDA4NjcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Troy Hurtubise, Peter Gzowski | See full cast and crew »"],
      "reviews": [
         "This short documentary (72 min) introduces North Bay, Ontario's Troy Hurtubise, and I can assure you you won't soon forget this guy. After a near-encounter with a giant grizzly in the Canadian Rockies, Hurtubise becomes seized with the idea of building a protective body suit strong enough to let him wrestle 'the Old Man' mano-a-mano and live to tell about it. Just the sight of this contraption will make you laugh, and there are enough scenes of the 'field-testing' to keep you in stitches as he is knocked over by flying logs, run into by a pick-up truck doing 35 clicks and shot at with a variety of firearms, all without suffering any ill effects. Hurtubise was apparently annoyed that the film ignores the 'science'. No doubt there are practical uses for this seemingly impenetrable body suit, but discussing the chemical properties of titanium won't make for a good film. Project Grizzly is the story of a man who follows the beat of his own drummer. And it is a very funny film. Early on, the laughter may be directed AT Hurtubise, but by the end of the film the viewer has come to respect the integrity of this man's quest and to feel certain that he will achieve his objectives someday, if not just yet. An entertaining and off-beat film.",
         "I first became aware of this film and that figure of fun Troy Hurtubise on the hilarious British TV show \"In Bed With Me Dinner\" with Bob Mills lampooning the film. Although somebody reading this would say \"Don't laugh about it, you haven't seen the full film\". Well, I bought the full \"Project Grizzly\" video a while ago from a friend, and I have to say that this is the most unintentionally funny piece of documentary film-making. Troy: What can be said about the man. He just doesn't see the humour that's so clearly visible to the viewers, but you've got to take your hat off to him, purely because he seriously has a screw loose. For any novices out there, root out the scene where one of Troy's buddies is talking about the game for all the family 'Out Run The Hand Grenade', or any scene involving testing the suit. I have to say as well, that I didn't go into viewing the film being snobby about anything, or expecting a marvelous piece of dramatic film. Plus Bob Mills reigned supreme on his show by poking fun at the whole idea of Troy and his little journey. Honestly, I knew that Troy would keep going with the bear business, but I never thought that in Old Blighty, I'd see him poking out of magazines (in that probably unmovable suit to match!), and being lampooned on that old chestnut \"Have I Got News For You\". What else is there to say, this isn't no Academy Award winning triumph, but it's definitely worth buying or renting if you see it available. In short words: this is excellent, you have to see it.",
         "I heard about this movie somewhere and it intrigued me. Man designs a bear proof suit. Sounds pretty cool I thought. Found the poster. Saw the suit. Looks pretty cool I thought. Rented the film. Saw the film. What a chump I thought. Don't get me wrong, Mr Troy Hurtubise's dedication to his cause is highly respectable. He has clearly spent vast amounts of his time and money designing and building this suit, which he intended to use to study grizzly bears up close and personal, without fearing for his life. The film is pretty much structured in two halves. In the first half, Troy is pretty much hanging with his family and friends, most of whom seemed as bored of their lives and everyone around them. (The scene in the diner is priceless). Troy shows off his suit with a series of tests and odd stunts. Whilst wearing the suit (The mark VI) he gets his pals to swing huge logs into his chest, beat him up with baseball bats and pool cues. They even shoot the suit at one point. Don't worry even Troy wasn't dumb enough to be inside it at the time. Showing the suit off in an urban environment, its clear that he practically immobile, which makes the second half so funny. When they eventually get to \"Grizzly Country\" he finds out to his horror that he can't even stand in it on rough ground and keeps falling over. The look of despair on his face would be really sad if it weren't so funny. He spends five days up in the mountains, spends his time talking gibberish, showing off his knives and moaning about the suit. He even shaves with his massive bowie knife like Crocadile Dundee. Troy tries so hard to come across as a mans man. But to me, it just seemed he was trying so hard to escape the monotony of his boring day to day life that he couldn't see the forest for the trees",
         "Troy Hurtubise is putting together a bear-proof suit to get close to the grizzlies. He recounts an encounter with a grizzly bear he calls the 'Old Man'. It's a strange obsession and not necessarily a healthy or smart one. It's not that he's a raving lunatic or that he's some kind of idiot. It's that he is fully committed. At times, one does wonder whether this guy is real or not. Some of the testing is hilarious like Three Stooges. His wilderness outfit hints at some kind of theatricality. His fringe jacket and beret looks like some costume. Part of this is absolutely showmanship unless bears started breathing fire. There's no reason to test the suit against an inferno. In the end, this is a character study but I still need that bear attack. I expected a bear attack. A bear needs to attack that suit.",
         "As many have noted, this film is not about a man fighting a grizzly bear, despite what the pitch would seem to promise. It's about a man eccentric enough to build a suit for a rematch against a bear that once pushed him over. In other words, it's about a fricking egotistical moron with too much time and money on his hands and a documentary crew giving us the most boring version. It's Moby Dick for rednecks and this time there is no climax. Troy talks about his knives, his father and rambles almost incoherently about an encounter with a bear. He makes a number of suits and there are some funny Jackass like test runs. Had the documentary explored more of the mans psychosis (like the incredible Grizzly Man) it would be of some interest, instead it pats Troy on the head to elicit cheap laughs. You're better off going elsewhere for more intelligent and well constructed documentaries.",
         "I saw this film at the theater when it first came out and then again a couple of weeks ago ( I bought the DVD). I found it equally as enjoyable the second time around and applaud the talents of Lynch and Hertubise. I highly recommend this film to anyone who likes the real life quirkiness of the common obsessionist or a Canadian film buff. This film made me laugh out loud more than once and kept me interested throughout. I found that the humanness and the landscape of the film rings true and I believe that most people will relate to the character(s) on some level. I will definitely share this one with friends; it has party movie written all over it. Just sit back and take a sometimes fast, sometimes zany, ride. There are moments of tension, triumph and defeat that I find unforgettable.",
         "This is a hilarious documentary about Troy Hurtubise, a Canadian scrapyard worker who, after an encounter in the forest with a grizzly bear, devotes his life and money to researching and building a grizzly-proof suit. Troy's dialogue alone is reason enough to watch this movie, but add camera shots of his \"research\" (Troy (in the suit) standing in front of a 5-ton pickup at 50km per hour, throwing himself off the Niagara embarkment, getting hit by a huge log suspended in a tree) and it's brilliant comedy.",
         "Interested in seeing a kind of half-baked superhero-themed movie? Do Not Be Deceived. Project Grizzly is not about Troy-Man from the Great White North Bay; rather, it is a chilling tale about a normal (?) fellow who's taken his defiance of nature to a level not fit for yourself or your friends. And trust me on that. And while it is hard not to watch Troy get repeatedly whupped by log-catapults and pick-up trucks, or be pushed off the Niagara Escarpment (!) during 'tests' of his bearproof suit, the picture does run on. Ahhh, but wait. You'll be left curiously satisfied by watching it - knowing that your crazy friend Troy from grade school who ate worms, marbles, gravel or what-have-you might just have amounted to something.",
         "The movie was funny and brilliant. Here's your everyman trying to make something different and following a dream. The funny thing isn't that he tried to design the suit for Grizzly bears but that after the film he actually redirected his thinking towards a suit designed to protect firefighters. While doing this and discovering his suit wasn't safe unless it was fireproof, he managed to create a compound that MIT professors said couldn't be made. He created a ceramic? compound that he demonstrated in his own unique way. He placed a small brick of it on top of a helmet and had a braizing torch directed on the top of it for 10 minutes (at 5000 degrees). After 10 minutes the temperate had risen barely 10 degrees. A crackpot? no doubt :) But likely a backyard genius too. See it once and remember that not all inventions in history were used in the original purpose that the creator envisioned.",
         "I enjoyed this film for a number of different reasons, and although it is certainly flawed, I'm definitely happy that I saw it. Troy Hurtubise comes off as an extremely likable person, and you just have to respect his effort to make a practical \"grizzly-proof\" suit, even if it does seem like a rather odd obsession. The movie was sometimes funny and often fascinating, so it was unfortunate that there were some boring scenes that made it past the final cut. But even with the slow spots, I have to heartily recommend this unique film. And, on a personal note, it was pretty cool to see my hometown on film..."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["National Film Board of Canada (NFB)"],
      "summaries": ["A documentary follows a Canadian fellow working on his dream: building a suit of armor so he can observe grizzly bears from a close distance."],
      "budget": 0
   },
   "movielensId": 32225,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-03",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Peter Lynch"],
      "runtime": 72,
      "movieId": 32225,
      "title": "Project Grizzly",
      "mpaa": "",
      "actors": ["Troy Hurtubise"],
      "imdbMovieId": "0117395",
      "originalTitle": "Project Grizzly",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["sLUdtF7aG7o"],
      "plotSummary": "Documentary about the lifelong project of Troy Hurtubise, a man who has been obsessed with researching the Canadian grizzly bear up close, ever since surviving an early encounter with such a bear. The film documents Hurtubise's diligent work to improve his homemade \"grizzly-proof\" suit of armour, his efforts to test its resilience, and his forays into the Rockies to track down the grizzlies he dreams of meeting. The film manages to capture the humor of the project as well as its sincerity.",
      "tmdbMovieId": 57953,
      "avgRating": 3.6,
      "releaseYear": "1997",
      "numRatings": 15,
      "posterPath": "/2prZK9AbaZRdjNTlaJ3dJohLEos.jpg"
   }
}