{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "middle class",
            "id": 6071
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "computer animation",
            "id": 10159
         },
         {
            "name": "urban setting",
            "id": 33556
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "grandmother",
            "id": 164039
         },
         {
            "name": "japanese family",
            "id": 188849
         },
         {
            "name": "haiku",
            "id": 188850
         }
      ],
      "imdb_id": "tt0206013",
      "video": false,
      "title": "My Neighbors the Yamadas",
      "recommendations": [
         15283,
         15080,
         21057,
         37797,
         15370,
         37933,
         13754,
         83389,
         149871,
         41017,
         239367,
         11621,
         14087,
         100271,
         15371,
         74982,
         25938,
         105280,
         21793,
         14945
      ],
      "backdrop_path": "/l3aaz7SB1Qm3JSkEqulv18aKriV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Yamada Noboru (voice)",
               "gender": 2,
               "credit_id": "52fe46b59251416c75080da5",
               "name": "Hayato Isohata",
               "profile_path": null,
               "id": 120801,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Yamano Shige (voice)",
               "gender": 0,
               "credit_id": "52fe46b59251416c75080da9",
               "name": "Masako Araki",
               "profile_path": null,
               "id": 120802,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Yamada Nonoko (voice)",
               "gender": 0,
               "credit_id": "52fe46b59251416c75080dad",
               "name": "Naomi Uno",
               "profile_path": null,
               "id": 120803,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Yamada Takashi (voice)",
               "gender": 2,
               "credit_id": "52fe46b59251416c75080db1",
               "name": "Tôru Masuoka",
               "profile_path": null,
               "id": 120804,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Yamada Matsuko (voice)",
               "gender": 0,
               "credit_id": "52fe46b59251416c75080db5",
               "name": "Yukiji Asaoka",
               "profile_path": null,
               "id": 81242,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Fujihara Sensei (voice)",
               "gender": 0,
               "credit_id": "52fe46b59251416c75080db9",
               "name": "Akiko Yano",
               "profile_path": null,
               "id": 78352,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Haiku Reader (voice)",
               "gender": 0,
               "credit_id": "52fe46b59251416c75080dbd",
               "name": "Kosanji Yanagiya",
               "profile_path": null,
               "id": 120805,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46b59251416c75080d53",
               "name": "Isao Takahata",
               "profile_path": "/fzteqJkXW3mzNC9KZuH5ejPSut1.jpg",
               "id": 628,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d59",
               "name": "Hisaichi Ishii",
               "profile_path": null,
               "id": 117934,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b59251416c75080d5f",
               "name": "Isao Takahata",
               "profile_path": "/fzteqJkXW3mzNC9KZuH5ejPSut1.jpg",
               "id": 628,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d65",
               "name": "Leo Chu",
               "profile_path": null,
               "id": 117935,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b59251416c75080d6b",
               "name": "Eric Garcia",
               "profile_path": null,
               "id": 114405,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d71",
               "name": "Rick Dempsey",
               "profile_path": null,
               "id": 627,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b59251416c75080d77",
               "name": "Michael Johnson",
               "profile_path": null,
               "id": 88892,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d7d",
               "name": "Ned Lott",
               "profile_path": null,
               "id": 631,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d83",
               "name": "Takashi Shoji",
               "profile_path": null,
               "id": 78359,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b59251416c75080d89",
               "name": "Yasuyoshi Tokuma",
               "profile_path": null,
               "id": 19595,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d8f",
               "name": "Seiichiro Ujiie",
               "profile_path": null,
               "id": 78360,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d95",
               "name": "Akiko Yano",
               "profile_path": null,
               "id": 78352,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080d9b",
               "name": "Youji Takeshige",
               "profile_path": null,
               "id": 19598,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b59251416c75080da1",
               "name": "Naoya Tanaka",
               "profile_path": null,
               "id": 78378,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55344c9892514152910063a6",
               "name": "Shin'ya Ôhira",
               "profile_path": null,
               "id": 1456632,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5534512f925141529100645e",
               "name": "Masashi Ando",
               "profile_path": null,
               "id": 40336,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "575535859251417af1001494",
               "name": "Masaaki Yuasa",
               "profile_path": "/7hpIHGkFOqzf7KVbpKHua0WAKwN.jpg",
               "id": 93107,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.480622,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 16198,
      "vote_count": 95,
      "budget": 0,
      "overview": "The Yamadas are a typical middle class Japanese family in urban Tokyo and this film shows us a variety of episodes of their lives. With tales that range from the humourous to the heartbreaking, we see this family cope with life's little conflicts, problems and joys in their own way.",
      "similar": [
         30061,
         408220,
         242643,
         382322,
         251519,
         14011,
         65291,
         49026,
         49521,
         209112,
         1924,
         141052,
         272,
         155,
         1452,
         297762,
         324849,
         40662,
         8536,
         297802
      ],
      "original_title": "ホーホケキョとなりの山田くん",
      "runtime": 104,
      "poster_path": "/tuKO2PLGDcJj5vpfAYKSQcnLEpD.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": "/dT3UbXjca6TClutHJtr7GhkRALP.png",
            "name": "Studio Ghibli",
            "id": 10342,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "Buena Vista Home Entertainment",
            "id": 11200,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hakuhodo DY Media Partners",
            "id": 11846,
            "origin_country": ""
         }
      ],
      "release_date": "1999-07-17",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "The safety of family is the wish of the world",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": null,
      "budgetCurrency": "JPY ",
      "directors": ["Isao Takahata"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Hisaichi Ishii",
         "Isao Takahata"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0206013/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMzk0MDE1OF5BMl5BanBnXkFtZTcwMzc4MjAzMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Hayato Isohata, Masako Araki, Naomi Uno | See full cast and crew »"],
      "reviews": [
         "This is a Studio Ghibli movie: The Totoro is displayed at the opening, and the animation is very well done. There end all similarities. The word to describe it is \"different\". Different graphics, different animation, different kind of story... Nothing my knowledge of previous Ghibli films could have prepared me to see. Especially coming from the director of such films as \"Hotaru no Haka\" (aka \"Grave of the Fireflies\") When seeing the very first pictures, I wondered what these drawings were, so far from the characters I got used to see, and like... And then, the magic of its humor took me. The auditorium was fully filled (some people had to sit on the stairs), and everyone was laughing out loud, having no problem at all to follow the jokes (the movie was subtitled) even if we may have missed a few of them, due to a possible lack in cultural knowledge. Yet, I don't think I missed so much... This Yamada family is close enough to us, and their behavior seemed rather universal to me. I spent a great time watching it... But I have perhaps only one regret: I'm afraid I won't find the same pleasure I always find to see a Ghibli film again and again. The graphics aren't the main interest in the film, and when you already know the jokes, well... Therefore, I would rate it differently for the first seeing, and the ones after. A high rating anyway, especially for having been able to make us laugh so much without ever using any \"dumb\" easy joke as we could now find so (too) often in nowadays films. But I will never watch it again and again as I could do with a \"Kiki\", a \"Nausicaa\", or (my favorite) a \"Mimi o Sumaseba\" (aka \"Whispers of the Heart\"). So, don't hesitate if you have the opportunity to go and see it. You should appreciate it at least once. Then you could wish to own it, most probably to be able to show it to some friends or family.",
         "The new Ghibli Studio production, Tonari no Yamadakun, is two years after \"Mononoke\" a new masterpiece of animation. The story... Well, there is no story. Just a superposition of sequences, each being more hilarating than the preceding. Director Takahata, using computers generated \"hand-like\" drawings, wanted the result to be as close as possible to the original newspapers comic, and he fully suceeded. In spite of the apparent graphic simplicity, the astounding quality of the animation makes the characters so lively that it seems sometimes more \"real\" than conventional cell animation. The yamadas are a typical japanese family, living in the Kansai area (Osaka). They do not speak standard japanese, especially the Granma, so as almost all of the gags are not visual, so if you plan to see it in Japanese, you should have very strong basis of the language. This is one of the most inventive animation movies I've seen since a very long time...",
         "While Miyazaki is the best known (and most successful) of the non-demon-fixated/violent-porn anime directors, his sometime producing partner and fellow Studio Ghibli alumni easily equals him in breadth of vision, commitment to art and passionate filmmaking. And although it's Miyazaki who alone seems to possess the Midas touch of his uniquely innocent, melancholic, optimistic, whimsical sensibility, Takahata has arguably pushed the envelope further back in terms of Japan's commercial animation vocabulary. Witness the neo-realism of Grave Of The Fireflies, fearless indictment of globalisation in Pon Poko, and now this utterly charming adaptation of the popular manga, My Neighbours The Yamadas, rendered in a style new to Anime features, but utterly faithful to the original text. A series of vignettes rather than one overall plot, it is nevertheless easy to find the running time flying past you as you take in the idiosyncratic characters, semi-bizarre situations (although a moment's thought reveals that your family was probably just like this), and beautiful performances (from animators and voice artists alike), finishing with a sense of the family's strength as a unit through a love for each other that's expressed more through their tolerance of each other's peculiarities than in open declarations of affection. And like Grave Of The Fireflies and Whisper Of The Heart, a popular western song that no one of my generation (20s) would ever dream of listening to seriously is made poignant, rousing and brimming with emotion. Ten out of ten: films this good are rare.",
         "What an amazing movie! I was not expecting it! The story is a very simple one, I would even say this movie has an\"episodic\" nature because it tells the daily-life chronicles of the Yamadas, some shorter, some longer. However its never dull or boring, all these episodes in the Yamadas' lives felt interesting, funny and refreshing one after another, switching the spotlight of the family members in each one. The art style is very unusual, sketchy and fits the story incredibly well. It's undoubtfully different than your standard anime visuals, but beautifully hand-drawn nonetheless. I really liked it. The characters are all superb! To the serious, old fashioned and wise grandma who still thinks she has a lot to give, to the hard-working, day-dreamer and misunderstood father who dreams about breaking the routine and to be acknowledged by his family (that in fact he really cares about). They all have a lot to give and to show through the movie and are constantly being put into ordinary daily-life tasks and obstacles while dealing with them in their very unique and hilarious way. Overall this movie is nothing more and nothing less than a very funny slice of life, with different and refreshing visuals, superb characters and filled with very interesting and thoughtful scenes (Being the scenes with the Father the best and most enjoyable ones for me ^^). The worst thing about entertainment is getting into it expecting a lot and being disappointed. On the other hand, the best thing about it, is getting into it expecting nothing... and ending utterly amused! For me \"My Neighbors the Yamadas\" was the best example of that, it was just that great. If you like light-hearted comedies or a good slice of life and are opened to unusual art, then by all means, watch this lesser-known Ghibli by the genius director Takahata!",
         "Takahata Isao, talented co-founder of Studio Ghibli (Spirited Away, Grave of the Fireflies, Princess Mononoke) brings us a new family comedy with a twist. You may be expecting something along the epic lines of 'Spirited Away' but what you will get is a film that invokes the same reactions of Miyazaki's 'Totoro'. The family are everyday yet excellently fleshed out, so much so you will find characteristics in each of them that will remind you of your own family. The art will shock you considering this is a Ghibli product, particularly when you look closer and realise the sketches and key animation is so fantastically rendered. Takahata, renown for his 'Grave of the Fireflies', has taken this popular Japanese comic strip and brought it to life. It's one weakness is the lack of a singular storyline. Perhaps this would have worked better as a television series, but the conclusion at the end brings the whole film together in a way that will leave you the same way 'Amelia' did: A great big smile on your face.",
         "My Neighbors the Yamadas, directed by Isahao Takahata, is a Studio Ghibli film most known for its unusual animation style, which actually distinguishes it from all the other pictures released by this renowned studio. Based on a famous Japanese cartoon Nono-chan, it presents random and miscellaneous stories from the daily lives of the Yamada family. This is a great comedy with a twist for people of every age. It's packed with a huge amount of hilarious gags and situational jokes that will certainly make you laugh lots of times. Apart from that, these are the two main arguments that should be convincing enough to make you see My Neighbors the Yamadas: the computer-generated animations and drawings made in comic strip style are excellent, giving this Ghibli movie an entirely different feel than all their other works; the whole picture is actually presented in an unconventional manner, as the familiar contiguous plot was replaced here by a series of, so-called, vignettes (short impressionistic stories that aren't necessarily connected to one another), each with its own title at the beginning and a smart philosophical proverb at the end. In the film's first few minutes we meet all the members of this seemingly typical family: Takashi � the father, Matsuko � the mother, Shige � the grandmother, Noboru � the son, and Nonoko � the daughter. Every subsequent episode covers a different theme, some being hilariously funny and heartwarming, other touching and serious. Through all of the mostly humorous, yet truly realistic, sequences the viewer is able to observe the Yamadas as they cope with every day problems, misfortunes, rivalries, or just plainly ridiculous situations (like fighting over a TV remote, or deciding who will get the tea by playing 'rock-paper-scissors'). Through all of their adventures the viewer is able to get in touch with some of the Japanese traditions and customs. Every person in the family has his or her special role, making the cartoon much more believable. For example, Shige is the word of wisdom, giving advice to others and judging their actions, and Noboru is mostly seen as a selfish and ignorant studying-addict (which in final evaluation doesn't give planned results). If I will have to pick only one vignette, which made me laugh the hardest, I would have to go with 'Ginger Morning'. I think you will see why. All in all, My Neighbors the Yamadas is a laughable, yet purposely clever, and lighthearted, yet sometimes deep, anime that will provide great entertainment for the whole family. I guess that by looking at the Yamadas' experiences we can all learn how to live in perfect harmony with our relatives, replacing minor flaws with passionate love. Note: since the dubbed version is hard to find, I advise you to watch the Japanese version with English subtitles.",
         "This is one of the less well known Studio Ghibli films which is a shame as it is delightful and rather funny. Unlike most films their is no real plot, in fact there is no story arc at all, just a series vignettes showing incidents in the lives of the eponymous Yamada family. Some of these like the one where they leave Nonoko, the young daughter, at the shopping mall go on for several minutes and others such as the very funny part where son Noboru has what his parents think is his first glass of sake are under a minute long. As with Isao Takahata's other Ghibli films this will probably appeal to adults far more than children; while it doesn't contain anything unsuitable for youngsters I suspect they might find the subject matter boring. The animation style is totally different from any other Ghibli film or indeed any other animation I can think of. The computer animation looks like a water-coloured comic strip, with fair less detail than usual; this might make it sound inferior but it actually works surprisingly well for the subject matter. While the episodes are humorous they are almost all the sort of things that could happen in any family, the only ones that aren't are fantasies such as the father imagining himself to be a masked super hero or illustrative such as the charming opening where we see the family taking a fairly fantastical journey. I certainly recommend this for any older Ghibli fans. These comments are based on watching the film in Japanese with English subtitles.",
         "This is the best film of Isao Takahata. Director of Grave of the Fireflies, Only Yesterday, and Pom Poko. Unlike his previous films this one is based off of a Famous Japanese Comic strip(Which is the Family Circus/From Better to Worse of Japan) Not only is it a well known Comic in Japan, it's also has a unique look to it. The animation is all water colored. And it looks like you're really look at a Comic. What's special about this film is it's the first ever 100% Digitally made film by Studio Ghibli. All the color and finished animation is all done on Computer. Has a lot of CGI in it as well. No Cell Art was made at all! The whole movie is about an average Japanese family facing the Ups and downs of life. Through out the movie they go through quite a bit of struggles and situations. There's quite a bit of humor and random parts in this film as well. The English version remained true to the original plot to this film. But it's more like a series of Episodes than a movie. Which is kinda cool. Jim Belushi is a perfect choice to play Takashi Yamada(the Dad). His voice is so amusing, he's perfect for doing cartoon voices. Tress MacNeille Voice of Obaba(Nausicaa), Boss's Wife(Laputa), Mrs. Orsono(Kiki), The ship's annoucer/3 old women(Porco), Oroku(Pom poko), & One of the working women(Princess Mononoke) does the voice of Shige Yamada(the Grandma). Tress has been in a lot of the Ghibli films. David Odgen Stiers get to be the Narrator(another perfect choice) Since he was great as Kamaji(Spirited away) and Piccolo(Porco). I recommend this film for Ages 6 and up. has a few inappropriate parts. The Dad smokes cigarettes, has a small part with guns but not ones gets killed, and a few adult situations as well. i like this movie so much, it's worth seeing again and again. It's Takahata's finest and last Ghibli Anime film.",
         "I think this is a pretty good animation film. Some people might not like the animation style, but i think it is refreshing in it's simplicity(i'm honestly sick of the usual \"kawaii\" very pretty anime style). The \"yamadas\" are the stars of the show, it all revolves around them and the daily routine of the family members. Its more like a slice of life thing and it doesn't really follow a plot, but there's an overarching theme that links every short bit of the film together. The message that the film is trying to convey is that family should always be united and try to tolerate their differences. The tone of the film is always bright, even when they are \"fighting\" it's comical. So you can watch this with your kids.",
         "I do not think this is Studio Ghibli's best film, but I liked it because it was different and it still maintained their charm. I do think though out of the English dubs this is one of the weaker ones. Don't get me wrong the voice acting is fine, it's just that the script as has been said before has many references that some mayn't get. That said, it is a very funny and charming film. The animation is excellent, different in a sketchy sort of style but I liked that, and the music is cool. The story is engaging while working at being simple, and the characters are sheer delights, I can never get enough of the grandma. Overall, not their best but I still really liked it. 8/10 Bethany Cox"
      ],
      "genres": [
         "Animation",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Tokuma Shoten",
         "Studio Ghibli",
         "Nippon Television Network (NTV)"
      ],
      "summaries": [
         "The Yamadas are a typical middle class Japanese family in urban Tokyo and this film shows us a variety of episodes of their lives. With tales that range from the humourous to the heartbreaking, we see this family cope with life's little conflicts, problems and joys in their own way.",
         "The life and misadventures of a family in contemporary Japan."
      ],
      "budget": 2000000000
   },
   "movielensId": 32452,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1999-07-17",
      "dvdReleaseDate": "2005-08-16",
      "directors": ["Isao Takahata"],
      "runtime": 104,
      "movieId": 32452,
      "title": "My Neighbors the Yamadas",
      "mpaa": "PG",
      "actors": [
         "Hayato Isohata",
         "Masako Araki",
         "Naomi Uno",
         "Tôru Masuoka",
         "Yukiji Asaoka",
         "Akiko Yano",
         "Kosanji Yanagiya"
      ],
      "imdbMovieId": "0206013",
      "originalTitle": "ホーホケキョとなりの山田くん",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["x9itwuJ6iMQ"],
      "plotSummary": "The Yamadas are a typical middle class Japanese family in urban Tokyo and this film shows us a variety of episodes of their lives. With tales that range from the humourous to the heartbreaking, we see this family cope with life's little conflicts, problems and joys in their own way.",
      "tmdbMovieId": 16198,
      "avgRating": 3.58898,
      "releaseYear": "1999",
      "numRatings": 118,
      "posterPath": "/tuKO2PLGDcJj5vpfAYKSQcnLEpD.jpg"
   }
}