{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "cuba",
            "id": 701
         },
         {
            "name": "propaganda",
            "id": 2903
         },
         {
            "name": "peasant",
            "id": 4402
         },
         {
            "name": "peace",
            "id": 6057
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "cuban revolution",
            "id": 7937
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "wealth",
            "id": 10329
         },
         {
            "name": "rebellion",
            "id": 11196
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "university",
            "id": 13160
         },
         {
            "name": "land",
            "id": 156378
         }
      ],
      "imdb_id": "tt0058604",
      "video": false,
      "title": "I Am Cuba",
      "recommendations": [
         146211,
         97513,
         8071,
         178535,
         43459,
         203087,
         50183,
         38360,
         83539,
         100589,
         109383,
         132364,
         44065,
         151312,
         163336,
         9797,
         15244,
         29933,
         29270,
         45694
      ],
      "backdrop_path": "/qWs0RtQrCSnYozeIpfEQ58XY6Fr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Alberto",
               "gender": 0,
               "credit_id": "52fe44b19251416c910198b3",
               "name": "Sergio Corrieri",
               "profile_path": "/7dB7rZJm0kNq5biiW11V4yIj1bj.jpg",
               "id": 108773,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Maria / Betty",
               "gender": 0,
               "credit_id": "5300a2e39251416ad52f0e84",
               "name": "Luz María Collazo",
               "profile_path": null,
               "id": 1293290,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Pedro",
               "gender": 0,
               "credit_id": "5300a2ec9251416ae72f17a6",
               "name": "José Gallardo",
               "profile_path": null,
               "id": 1293291,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Jim",
               "gender": 2,
               "credit_id": "5300a2f49251416aee31de1e",
               "name": "Jean Bouise",
               "profile_path": "/rBFl7KVzK2tax2CUbLtJBFFcBzm.jpg",
               "id": 2168,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Enrique",
               "gender": 0,
               "credit_id": "5524efa0c3a3687df3000e0f",
               "name": "Raúl García",
               "profile_path": null,
               "id": 1060325,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "5524efae9251415c7c00b2e7",
               "name": "Celia Rodriguez",
               "profile_path": "/bXIvc1eRi9URwhgR6Gnom7RZfk1.jpg",
               "id": 245449,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Teresa",
               "gender": 1,
               "credit_id": "5524efbd9251415c7c00b2eb",
               "name": "Luisa María Jiménez Rodríquez",
               "profile_path": "/oujIRpqp7mCQD2XAU7glbgefBMY.jpg",
               "id": 94913,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "5524f01f92514171cb008298",
               "name": "Salvador Wood",
               "profile_path": "/q3PaDaJdl1l1nyx7v1d77JB3ofl.jpg",
               "id": 1349308,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44b19251416c9101989d",
               "name": "Enrique Pineda Barnet",
               "profile_path": null,
               "id": 108769,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b19251416c910198a3",
               "name": "Yevgeni Yevtushenko",
               "profile_path": null,
               "id": 108770,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b19251416c910198a9",
               "name": "Sergei Urusevsky",
               "profile_path": null,
               "id": 108771,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b19251416c910198af",
               "name": "Yevgeni Svidetelev",
               "profile_path": null,
               "id": 108772,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b19251416c910198b9",
               "name": "Mikhail Kalatozov",
               "profile_path": "/ggz6i31f6ddUS8nDhj1wXDp2JvZ.jpg",
               "id": 108764,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.850455,
      "production_countries": [
         {
            "iso_3166_1": "RU",
            "name": "Russia"
         },
         {
            "iso_3166_1": "CU",
            "name": "Cuba"
         }
      ],
      "id": 32015,
      "vote_count": 48,
      "budget": 0,
      "overview": "An unabashed exercise in cinema stylistics, I Am Cuba is pro-Castro/anti-Batista rhetoric dressed up in the finest clothes. The film's four dramatic stories take place in the final days of the Batista regime; the first two illustrate the ills that led to the revolution, the third and fourth the call to arms which cut across social and economic lines.",
      "similar": [
         9777,
         101299,
         9529,
         27066,
         22302,
         14069,
         10571,
         9424,
         11004,
         8279,
         46934,
         44754,
         14055,
         4226,
         13820,
         44373,
         16703,
         880,
         26626,
         31299
      ],
      "original_title": "Soy Cuba",
      "runtime": 141,
      "poster_path": "/yHyuvOmLTRXA8wVRZjx441md2xp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
            "name": "Mosfilm",
            "id": 5120,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Instituto Cubano del Arte e Industrias Cinematográficos (ICAIC)",
            "id": 5175,
            "origin_country": ""
         }
      ],
      "release_date": "1964-09-06",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Cuba",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Mikhail Kalatozov"],
      "runtime": 141,
      "synopsis": null,
      "writers": [
         "Enrique Pineda Barnet",
         "Evgeniy Evtushenko"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0058604/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNDQ2MzQ5Nl5BMl5BanBnXkFtZTgwNDU5MjcyMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sergio Corrieri, Salvador Wood, José Gallardo | See full cast and crew »"],
      "reviews": [
         "Just about every comment posted here eulogises Soy Cuba's camera-work, which is certainly understandable as it is remarkably filmed, but this is done to the neglect of other extremely important aspects. Whether they are bigger fans of the camera-work or of the direction, however, all the commentators on these pages seem to share the caveat that arguably the main point of the film - its plot - amounts to nothing more than \"silly propaganda\" or a curiosity of totalitarian film making. Such an attitude is a terrible oversight! Soy Cuba is about people's desire for freedom and a better life, and the revolutionary potential of this desire when conditions reach a point beyond which people will no longer endure. It is about self respect, and courage, will and humanity and a human, filial patriotism; it is about the distillation of Cuba as an idea and a cause for justice and empowerment. I cannot understand how deeply postmodern and jaded, or just plain superficial, someone has to be to notice all the nuances of angle and light and completely miss the deep emotional and spiriual poetry of the content (in fact, the US government certainly paid good attention, for it banned the film until 1992)! It is like discussing Korda's portrait of Che Guevara in terms of focus and aperture alone!Did they not feel goosebumps as they watched the scene of the students on the steps, and the dead dove? I am lost for words! Indeed, if it were just a vapid propaganda piece, what explains its de facto censorship in the Soviet Union? I am quite sure that many of these commentators must have visited the Caribbean on holiday at one time or another; I know from my own experiences, and they ought to have immediately realised on seeing the film, that the portrait the it paints of Cuba remains the reality of Jamaica, Dominican Republic, Haiti today, some 65 years later. Watching this film, we should above all feel indignant, rather than heaping praise onto disembodied and decontextualised technicalities such as camera-work. To dismiss it as propaganda yet ogle at its images is akin to prostituting this beautiful, very deeply moving, and inspiring film, the same way that Cuba herself was prostituted. Shame on you.",
         "\"Don't avert your eyes. Look! I am Cuba. For you, I am the casino, the bar, hotels and brothels. But the hands of these children and old people are also me\" -- Yevgeni Yevtushenko I Am Cuba is described by film critic Elliot Wilhelm as \"a unique, insane, exhilarating spectacle\". Filmed in Spanish, dubbed in Russian, and subtitled in English, this unique collaboration between Russian director Mikhail Kalatozov (The Cranes are Flying), the poet Yevgeni Yevtushenko, and writer Enrique Pineda Barnet dramatizes the conditions that led to the 1959 Cuban revolution. Originally made in 1964 (and unpopular both in Russia and Cuba), it was released in 1995 through the combined efforts of Martin Scorsese and Francis Ford Coppola. I Am Cuba is set in the late 1950s when a ragtag bunch of students, workers, and peasants organized to overthrow the corrupt regime of dictator Fulgencio Batista. The film is divided into four sequences. The first depicts the American-run gambling casinos and prostitution in Havana. The next shows a farmer burning his sugar cane when he learns he is going to lose his land to United Fruit. Another describes the suppression of students and dissenters at Havana University, and the final sequence shows how government bombing of mountain fields induced farmers to join with the rebels in the Sierra Maestre mountains. The final scene is a triumphal march into Havana to proclaim the revolution. Marvelously photographed in black and white by Sergei Urusevsky and using acrobatic camerawork by Alexandr Kalzaty, some of the shots and distorted camera angles are so staggering as to be virtually unbelievable. In one sequence, the camera lifts off from a hotel rooftop, takes in the Havana skyline, descends several floors, winds its way through the poolside party-goers, and then takes you for a swim in the pool in one continuous shot. Reminiscent of Sergei Eisenstein, the caricatures are broad but are presented with such exuberance that it hardly seems to matter. Audacious and imaginative, I Am Cuba is a revelation, not only for its style but also for its inspiration. Filmed with true visionary poetry, I Am Cuba transcends the genre of advocacy filmmaking to reach a pinnacle of cinematic art.",
         "Every frame of this film deserves to be printed, framed and hung in a gallery. And the sound, wow. The sound... Crunchy super-intimate sounds- like the sound of machetes ringing in the cane field- are as evocative as the images. 1964. It's amazing how much can be done with so little...",
         "I am Cuba/Soy Cuba features the stories of several Cuban citizen-types: a young prostitute, a farmer, a young revolutionary and so on, up to the start of the island's Castro Revolution. If this sounds dull, then rest assured that the plot is minimal and, despite it's avowedly political purpose, hardly gets in the way of the film's main attractions today. What distinguishes the production is the cinematography. It is not an exaggeration to say that the images and technique in the film are breathtaking, and it is a tour-de-force of bravura camera work. Apparently Martin Scorcese has screened this film privately to work out how such-and-such a shot was achieved, and perhaps it's influence can be found in the famous through-the-kitchens tracking shot in 'Goodfellas'. This is a film where the camera is constantly in motion, with sweeping balletic long takes, crane and hand held shots, tracking shots, including some over and down the side of buildings, through cane fields, into swimming pools, around packed night clubs, even hovering and moving along high over a street in the middle of a packed funeral procession - all without the usual cutting. I estimate the average length of a take in this film at about 2 - 3 minutes, a figure rare and astonishing these days, even with the benefit of steadicams - but jaw dropping given the still-unwieldy equipment they were surely using in 1964. In particular one or two large scale sequences must have taken days, if not weeks, to prepare, and presumably needed government marshaling to choreograph. (Ironically, whether or not the film makers intended it, the liberated camera work on display here reflects the notion of revolutionary freedom far more than the actual story vignettes.) The film itself is shot in high contrast gleaming black and white, favouring wide angle lenses, and with a constant deep focus that reminded me of Greg Toland's work for Welles or some of James Wong Howes' work. Kalatozov's use of a handful of character 'types' throughout recalls Eisenstein's (and in fact there is a faint reference to his the Odessa Steps sequence in 'Battleship Potemkin' at one point when the revolutionary rioters march down some steps), but the effect here is far more sensual and lyrical. (Among the professional actors, Sergio Corrieri also appears in the better-known Memories of Underdevelopment). The film's 'artiness' is undeniably a distraction from the message of struggle, and to the original viewers the beautiful images must have been a long way from reality in the New Cuba. Today we don't have this problem and the viewer is left with a visual feast to enjoy over and over again..",
         "No less than thirty shots have been ripped off from this movie in the past five years, in films like Out of Sight, Boogie Nights, and Pulp Fiction. Watching \"I Am Cuba\" is an education in film technique and the beauty of the eponymous country. The picture's plot is abysmal. It is an exercise in cinematography. It is among the most influential movies, style-wise, that the American public has never seen and honestly brilliant on all terms. Imagine taking a tour of Cuba, in 1964, through the eyes of four metaphors: luxury, poverty, revolution, and vagrancy. Times are changing, the country is changing. However, no matter how much anything changes, the sun-soaked gorgeousness of the land doesn't budge. The camera glides around like a member of the tour who has gone off on his own, looking at the four principles. I Am Cuba is film that needs no hyperbole. It Is Great",
         "This is my favorite piece of propoganda filmmaking -- and I'm remembering Reifenstahl when I write that -- but I think it's better than that kind of genre comparison implies. The film takes a Marxist look at the state of Cuba in 1964; it's episodic, and while the ideas expressed are nothing new, the film presents them so cinematically and with such overt fervor that it transcends its numbskull earnestness. There's nothing naive about it: this isn't the work of a starry-eyed naif, but rather a calculated piece of agitprop in which the Americans chew gum loudly and run their hands up the skirts of the innocent Cuban girls, and the blame for Cuba's woes is laid squarely on Batista's shoulders. But it believes itself, and the film, when it connects, is as powerful as anything you've ever seen. 10/10",
         "That I've ever seen, and I watch a lot of movies. The story is propaganda, to be sure, and some of the acting is horrible, but WOW! I couldn't take my eyes off of it. Shot after stunning shot....I don't know how they did it, but I didn't mind all the rhetoric because I kept thinking, \"Look, that's so beautiful\" and \"Wow, how did they do that?\" I do recommend it also as a historical document of a time most people don't remember....I was born the year it was made and remember \"the Communist Threat\" but I think a lot of people younger than myself may not remember. Not to mention that yes, some of the music was also amazing. A must see for any serious film buff.",
         "It goes without saying that this movie includes some of the most breathtaking camera-work ever seen. Many scenes will live long in the memory of anyone who's been fortunate enough to see it. But it seems to be downgraded in many peoples minds by the notion of it being a propaganda movie. I think its misleading to think of the movie as being 'propaganda' any more than most mainstream movies can be seen as propaganda for a particular way of life or viewpoint. The portrayal of the American characters in I Am Cuba is in many ways more fair-minded than numerous Hollywood or British movies (in the case of James Bond) in the portrayal of Communists or any other perceived enemy. Even anti war movies such as Platoon or Saving Private Ryan frequently portray the 'enemy' as faceless figures who are killed without a thought. I prefer to see this movie as a love letter to Cuba by some brilliant (but undoubtedly naive) Soviet film makers. The storyline is much more sophisticated and innovative than has been given credit. Many of the characters are stereotypes, but they are still sympathetic and real. The movie is by no means perfect, but to dismiss it as beautiful propaganda is i think to underestimate the skill and thoughtfulness of the team who made it. By overemphasizing the origin of the movie has I think killed the enjoyment of it for many viewers. Just go see it and enjoy the sumptuous imagery. If you want to dismiss it as propaganda, fine, but if it to be seen as propaganda, then so is most of Hollywoods output.",
         "The four segments that give us an impression of Cuba around 1960 are all very fine. I' wouldn't call this any more propagandistic than any Michael Bay Movie, far less even. It really captures the soul of Cuba that was exploited by the USA at the time and took matters back in their own hand. I've been to Cuba last year and if the USA didn't boycott the country the Latin communism could work. But back to the movie. The cinematography is as it has been said so many times one of the best efforts ever, but it is not the only quality because the four stories are very nice and have influenced Hollywood filmmakers more than any American will like to admit.",
         "In talking about Cuba, people often forget about how things were under Fulgencio Batista. The Cuban-Soviet co-production \"I Am Cuba\" shows how things were. Throughout four vignettes, we see a Havana prostitute struggling to make ends meet, a humble farmer whose livelihood is destroyed by landowners, students fighting against the repressive police, and finally, people joining up with the revolutionary army. The whole thing is really socialist realism: the heroic peasants rising up against the oppressive bourgeoisie and getting martyred. But, we have to admit that what \"I Am Cuba\" portrays is accurate. I don't know for sure whether or not things got much better after the revolution, but most Cubans certainly prefer things as they are today over how things were under Batista. Either way, the movie can also be interpreted through its camera work, showing Cuba's landscape and employing some interesting dollies. Yes, it's propaganda, but as far as I know, conditions have improved in Cuba ever since they abolished the ladyfinger system and prosecuted Batista's thugs. This movie reminds of things in the same way that \"Schindler's List\" does."
      ],
      "genres": [
         "Drama",
         "Music",
         "War"
      ],
      "productionCompanies": [
         "Instituto Cubano del Arte e Industrias Cinematográficos (ICAIC)",
         "Mosfilm"
      ],
      "summaries": [
         "This study of Cuba--partially written by renowned poet Yevgeny Yevtushenko--captures the island just before it made the transition to a post-revolutionary society. Moving from city to country and back again, I AM CUBA examines the various problems caused by political oppression as well as by great discrepancies in wealth and power. Beginning in Havana in the pre-Castro era, we see how foreigners contributed to the city's prostitution and poverty; this sequence features dreamy, hallucinogenic camera work that creates a feeling of unease and dislocation. Then, in glorious images of palm tress and fertile land, the film looks at the sugar cane fields in the countryside, and the difficulties faced by peasants working the land. Finally, back in the city again, leftist students battle the police and a corrupt government--and pay a high price for their rebellion.",
         "Four vignettes in Batista's Cuba dramatize the need for revolution; long, mobile shots tell almost wordless stories. In Havana, Maria faces shame when a man who fancies her discovers how she earns her living. Pedro, an aging peasant, is summarily told that the land he farms has been sold to United Fruit. A university student faces down a crowd of swaggering U.S. sailors and then watches friends shot by police when they try to distribute a pro-Castro leaflet. The war arrives on the doorstep of peasants Mariano, Amelia, and their four children when Batista's forces bomb the hills. Mariano wants peace, so he seeks out the guerrillas to join the fight."
      ],
      "budget": 0
   },
   "movielensId": 3245,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1964-09-06",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Mikhail Kalatozov"],
      "runtime": 141,
      "movieId": 3245,
      "title": "I Am Cuba",
      "mpaa": "",
      "actors": [
         "Sergio Corrieri",
         "Luz María Collazo",
         "José Gallardo",
         "Jean Bouise",
         "Raúl García",
         "Celia Rodriguez",
         "Luisa María Jiménez Rodríquez",
         "Salvador Wood"
      ],
      "imdbMovieId": "0058604",
      "originalTitle": "Soy Cuba",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["N59aFLDCgLk"],
      "plotSummary": "An unabashed exercise in cinema stylistics, I Am Cuba is pro-Castro/anti-Batista rhetoric dressed up in the finest clothes. The film's four dramatic stories take place in the final days of the Batista regime; the first two illustrate the ills that led to the revolution, the third and fourth the call to arms which cut across social and economic lines.",
      "tmdbMovieId": 32015,
      "avgRating": 3.76768,
      "releaseYear": "1964",
      "numRatings": 198,
      "posterPath": "/yHyuvOmLTRXA8wVRZjx441md2xp.jpg"
   }
}