{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "rock and roll",
         "id": 578
      }],
      "imdb_id": "tt0368711",
      "video": false,
      "title": "End of the Century: The Story of The Ramones",
      "recommendations": [
         241070,
         27745,
         26336,
         171401,
         29211,
         50006,
         58607,
         13619,
         43734,
         94592,
         24647,
         13611,
         52732,
         56224,
         15030,
         267955,
         415253,
         180383,
         52017,
         51230
      ],
      "backdrop_path": "/qnlOFRm8XsPVEjhl19evkQ3tegE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe46c29251416c7508286d",
               "name": "Marky Ramone",
               "profile_path": "/apCgg2SPseD1B1rRHEmSD6elsQB.jpg",
               "id": 80487,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe46c29251416c75082871",
               "name": "Johnny Ramone",
               "profile_path": "/8oIkcaxYuolTifCgW0KrSLC75Qa.jpg",
               "id": 22465,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe46c29251416c75082875",
               "name": "Dee Dee Ramone",
               "profile_path": "/2PFZGjpJtOjzo7yTccRJNiBirVa.jpg",
               "id": 80490,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe46c29251416c75082879",
               "name": "Tommy Ramone",
               "profile_path": "/13CGIciINrAwLMZl1N0dk93aia5.jpg",
               "id": 80491,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe46c29251416c7508287d",
               "name": "Joey Ramone",
               "profile_path": "/qePG7VgJ4zo2Rh7IPCq8z4q89Le.jpg",
               "id": 80492,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe46c29251416c75082881",
               "name": "Richie Ramone",
               "profile_path": null,
               "id": 80493,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "592b381cc3a36877df06a120",
               "name": "Rick Rubin",
               "profile_path": "/mmrFwM81NvnFU4UOgJufoNqgYW2.jpg",
               "id": 22026,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "592b38309251413b8a06495f",
               "name": "Chris Stein",
               "profile_path": "/yNchvnPwkGshDgCUxxT6LbIQuc7.jpg",
               "id": 936885,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "592b383a9251413ba005f8a1",
               "name": "Deborah Harry",
               "profile_path": "/pASovJqjDaaHGs08jQs9FBOuWW6.jpg",
               "id": 102,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "592b38459251413b45068053",
               "name": "Hilly Kristal",
               "profile_path": null,
               "id": 1825400,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "592b384ec3a368787005eff2",
               "name": "Danny Fields",
               "profile_path": null,
               "id": 1069723,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "592b385c9251413b41065ab7",
               "name": "Andy Warhol",
               "profile_path": "/a88CL42sRMld1ECPuCjgfd2xA1N.jpg",
               "id": 18626,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "592b386c9251413ba005f8e0",
               "name": "Joe Strummer",
               "profile_path": "/1OnNvVlWmtyqDfjQTsQ8lQOYEo9.jpg",
               "id": 58296,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "592b3878c3a36877bc06e039",
               "name": "John Lydon",
               "profile_path": "/g5szwmtxb46NX6GBNFemRSVyUS5.jpg",
               "id": 79630,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "592b388dc3a36877bc06e04c",
               "name": "Johnny Thunders",
               "profile_path": "/2Zfqox7XegKu5rzrl5JaLtwjJpl.jpg",
               "id": 1156267,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 2,
               "credit_id": "592b38989251413ba005f8ff",
               "name": "Iggy Pop",
               "profile_path": "/orkeTSZYiHVKqeTntsD6e6VHuqc.jpg",
               "id": 13604,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 2,
               "credit_id": "592b38a69251413b5b067eb4",
               "name": "Eddie Vedder",
               "profile_path": "/ifgiSAnqb0REK7lIP1k7Xfp5EJe.jpg",
               "id": 46590,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 0,
               "credit_id": "592b38b2c3a36877bc06e073",
               "name": "Edie Sedgwick",
               "profile_path": "/2GNZ8oIgc5pZi1GKEKzM3UNp5XX.jpg",
               "id": 105056,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 2,
               "credit_id": "592b38c1c3a368787005f041",
               "name": "David Johansen",
               "profile_path": "/hQq0pmBBcmapA8YPxsgnDuZnEAa.jpg",
               "id": 57116,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46c19251416c75082863",
               "name": "Michael Gramaglia",
               "profile_path": null,
               "id": 80488,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c29251416c75082869",
               "name": "Jim Fields",
               "profile_path": null,
               "id": 80489,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.166151,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16301,
      "vote_count": 16,
      "budget": 0,
      "overview": "Filmmaker Michael Gramaglia's years-in-the-making biography of the legendary punk band the Ramones entitled End of the Century traces nearly all the various and sundry peaks and valleys which the seminal rockers experienced over the course of its 20-plus year career before disbanding in 1995. Beginning with the band's first concert performances in the mid-'70s, Gramaglia explores the eccentric and highly volatile band members -- in all the various line-ups that were presented over the years -- as the Ramones slowly gained fame for their high energy and high-tempo style of music that would later influence generations of punk rockers around the world. Mixing archival interviews with new interviews of the various surviving bandmembers, as well as interviews with a number of the Ramones' contemporaries, End of the Century encapsulates the East Coast underground music atmosphere of the 1970s and '80s that the band inadvertently shocked into existence.",
      "similar": [
         6575,
         786,
         1584,
         3902,
         10112,
         824,
         27,
         18947,
         254470,
         630,
         114150,
         339403,
         354912,
         525,
         5123,
         6477,
         5723,
         333667,
         11827,
         27586
      ],
      "original_title": "End of the Century: The Story of The Ramones",
      "runtime": 110,
      "poster_path": "/pZZR3oDnIUZff6puM9ctolafJpg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Gugat Films",
            "id": 69843,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Magnolia Pictures",
            "id": 1030,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Chinagraph",
            "id": 69844,
            "origin_country": ""
         }
      ],
      "release_date": "2003-01-19",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jim Fields",
         "Michael Gramaglia"
      ],
      "runtime": 110,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0368711/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMzAwNTc0OF5BMl5BanBnXkFtZTcwMjUxMjgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Rick Rubin, Tommy Ramone, Dee Dee Ramone | See full cast and crew »"],
      "reviews": [
         "what a laugh I had watching this film ! It's ridiculous that a band like The Ramones haven't got a proper DVD with their videos etc etc . . . and the documentary even though hasn't got any video as such has great interviews with Dee Dee (Uber Cool he is and funny as . . .) Johnny ( never though he was such an idiot), Joey ( a darling that never said anything bad about anyone), Marky and the rest of the musicians...and Areturo Vega the designer of their logo and official Ramones website and merchandising. The early footage from the CBGB (1970 ish) it's incredibly funny and endearing along with arguments on stage that will make you laugh till you die, they were really excellent. I am just a fan of this band and I will always have them close to my heart for their music, their attitude, their sense of humour and above all they cheer me up when I am down and this film just made me feel even closer to them.",
         "There are two groups of people that will go see this film, and I can recommend the film to both groups on different reasons, though one group will more than likely out-weight the other. For the punk-rock or hard rock fan, The Ramones mean a lot even before walking into the theater. In their arena they have, at last perhaps, elevated to the level of The Beatles for their style of music- they gave hope and aspirations for millions of kids all across the world who felt down in the dumps in their life, or maybe just wanted to learn how to play rock and roll without having to flip through a Led Zeppelin notebook. And unlike England's punk scene (and other facets of the NY punk scene of the 70's), as the film shows, they never restricted themselves to writing songs about politics and hardcore societal issues (though they did sometimes). A lot of their best songs were love songs (some of them ironic \"I don't wanna walk around with you\", some kinda sweet \"I wanna be your boyfriend\"), and wrote enough pop tunes for three bands. They were real, they were raw, and for the fan of the Ramones who may know a lot about them or may be more or less just a casual observer with one or two CD's, the revelations and tales about Joey, Johnny, Dee-Dee, Tommy, Marky, CJ, etc., it's life. Often very funny, as well as sad, weird, shocking, and enlightening in a way. Certainly as much of an enthralling document of rock and roll as well as the psychology. Then for the other audience, the ones who know of the Ramones strictly from their songs being played on car commercials or in the ballpark (\"Blitzkrieg Bop\" and \"I wanna Be Sedated\" have become hits like those The Beatles and The Stones had for their time). For the non-fans, the kind that just 'walk in' from off the streets of Manhattan or LA or wherever you see it (if you're seeing it in it's theatrical run) and just want to see a compelling and involving documentary, the film still delivers the goods. The filmmakers Jim Fields and Michael Gramaglia assemble their interview footage and concert footage in a fascinating, grunge style, with the digital look corresponding with the subject matter as being about the \"under-ground\" of the times. The music selections, much like clips of speeches in a political documentary, inform the fan or non-fan on what they were like musically, and feature some of their finest live and non-live tracks (\"Judy is a Punk\", \"Teenage Lobotomy\", \"Loudmouth\", \"Mama's Boy\", \"California Sun\"). Now, if you go into the theater and you already don't like the Ramones, it's hard to tell if you'll be turned on to them after two hours in the dark. But one thing is for sure, is that End of the Century bravely captures a rock and roll story without pulling punches, and like The Filth and the Fury, it gets its sprawling story across in a limited time. (strong) A",
         "\"End of the Century\" is a great rocumentary that's lots of fun to watch. Speaking of watches, I never looked at mine once during the entire 110 minute runtime. I regret now that I missed the Ramones on their many stops in L.A., I had always thought of them as cartoonish and eternal, some day I'd go and see them play (but they broke up before I had that chance). At least I can see them in this great rock documentary! This movie has it all, from footage in their early days to the very end, where the band is weary of the road and each other and just don't care anymore. It's fascinating to watch their story, how they start out as innovators, and end up as fossilized cartoon characters who always looked and dressed exactly the same as they did on their first album. The Ramones' influence on rock 'n' roll and punk rock cannot be underestimated. A case could be made that Johnny Ramone is the most influential living guitar player (he is alive at the time I write this, though I know he has been battling cancer). The interviews with Johnny Ramone are great, I got the impression that the band would have fallen apart years before it did if he hadn't been in it to make it work. The movie also shows many insightful interviews with other band members and various managers and hangers-on. The impression I got was that The Ramones were a unplanned phenomenon that invented punk as we know it, even though they never achieved commercial success in the US (at least on the level they thought they deserved). This is one of the few documentaries that I've seen on the big screen that was big-screen worthy, especially the concert footage. A stunning movie about one of the greatest bands ever (think about that!).",
         "This really well made documentary is finally out and it is great for all rock n roll / punk or just music fans. Not only it is very interesting about the Ramones and give them their \"pioneers of punk\" status, but it is also very funny. It features all the Ramones and also Clash frontman Joe Strummer in previously unseen interviews. Almost everything you'll here in this documentary comes from the mouth of the \"actors\" themselves. It shows and we can make our opinion on the band and its different members. For instance this scene where Johnny Ramones thanks god and G. Bush during the Hall of Fame ceremony is quite surprising. This movie tells us the story of the Ramones, but in fact also the story of many other bands ...",
         "I'm a fan of the Ramones, but not an hard core 'owns every LP' fan. That said - I found this doc very informative. Some of the B&W footage from CBGBs is fascinating, and the interviews with the band members were great though often conflicting. The late Dee Dee in particular is highly entertaining. The print that I saw had a fair bit of white text over sections of live footage, but my guess is that this will be removed for the final print or (hopefully) DVD. Johnny comes across as one tough-minded SOB, but I get the impression that without him the band wouldn't have functioned at all.",
         "I recently went into Red Bank, NJ for the Red Band International Film Festival, to see this film. I have seen my share of good music documentaries, and very bad music documentaries, and I have to say this this was an awesome music documentary. It told of the Ramones, the band that coined the term \"punk rock\". It had some of the best recent interviews with the Ramones, and even the last photographed interview of Clash front man Joe Strummer. It had excellent transitions, starting by showing the Ramones forming in New York and playing Stooges covers and ending with they're induction into the rock 'n' roll hall of fame and Joey and DeeDee's deaths. I learned many things I did not know, including the fact that \"the KKK took my baby away\" is said to be about Johnny stealing Joey's girlfriend. I also learned that Joey and Johnny were political opposites, Joey being a liberal and Johnny being a hardcore republican. I recall it being long, but I can't remember because it was so awesome I was paying acute attention the whole time. 9 out of 10. Minus one because I will never live to see a better music documentary.",
         "I just returned from a screening of this film and what can I say other than WOW!!! As a life long fan of The Ramones I was very happy to see that this film was going to be playing as part of a annual documentary film festival not far from where I live... To see The Ramones in all their glory and up on the big screen no less was quite a thrill... I could ramble on about the content of the film but hell The Ramones tell their story so much better than I ever could so all I will say is that if you consider yourself a music fan than you quite simply MUST see this film... As a side note Michael Gramaglia, one of the directors of the film, was present along with his brother (who helped edit the film) at the screening and participated in a Q & A after the film and I am very happy to pass on that he mentioned that he had just inked a deal with Warner Bros. that should get a DVD of the film in the stores around next February or March which will include a bunch of extras including a lot more that Dee Dee had to say as well as Joe Strummer's interview in it's entirety... Also Michael hinted that he may be returning to similar subject matter soon for his next project... Yep you heard it here first... Warner Bros has approached Michael and his brother about possibly doing a doc about CBGB's... He said nothing is definite but let's all keep our fingers and toes crossed in hope that everything comes together for another classik film!!!",
         "Joey! Man, when I think about that frail, tall, slightly off-kilter character, and how painful his life was, it almost breaks my heart. The only reason it doesn't is because Joey fronted the coolest punk band of all time, and he did so with such amazing style and panache. Way to overcome your limitations! Joey was a victim of pretty bad OCD, and had every reason to believe he would spend his life a loser. Well, Jeff, (his real name,) you were a winner, even if cancer took you way too young. I heard my first Ramones album in the late seventies. It was the newly released Rocket to Russia, and at the time I had been listening to stadium rock like Kiss and Rush and the junk on the radio with this kid named Steve Hiltner at Ridgemount Jr. High School. Luckily for us, Steve had an older brother who played guitar, and he influenced us to listen to this grinding guitar based insanity that was the Ramones. MAN! When I heard \"Teenage Lobotomy\" coming out over my stereo speakers, it probably changed me forever. There was never a punk band as good as the Ramones, and this film does a great job of showing their tragic, and yet strangely inspiring story. These guys WERE SERIOUS! They really were. That's what made them so good. They wrote really great songs with really great hooks and melodies and lyrics, and yet they did it with three or four chords and snappy 4/4 drumming that varied little from song to song. The old \"idiot savant\" label could easily apply to their lack of musical sophistication coupled with such excellent natural artistry. Everyone needs to see this movie. Everyone needs to understand the true REAL nature of rock and roll, and how it's not about being a big rock star, and a guitar god, and that corporate BS that's been shoveled down our throats for the longest time. Sure, I love to hear Led Zeppelin and Pink Floyd and the \"big names\" of big rock, but we must never forget the Stooges and the NY Dolls and Lou Reed, and those who HAD to play rock and roll, because their lives were just too bizarre not to. Long live the Ramones! I really really loved these guys. I can't believe three of them are dead.",
         "I've been a Ramones fan since the release of their first album. The first song I learned to play in 1978 when I joined my first decent punk band was \"Now I Wanna Sniff Some Glue\". But I've never been the kind of fan who felt the need to know a great deal more about the bands I loved. With most of the Ramones gone, and knowing that this documentary had been well received, I decided it was time to reacquaint myself with these old friends of my youth. Obsessive troubled shy liberal giant Joey. Laid-back easy-going drug addict Dee Dee. Angry driven tough guy neocon Johnny. Alcoholic Marky. Intelligent and over-sensitive Tommy. The core members of the Ramones could not have been more different people. To create a sense of unity, they cultivated a trademark look and gave themselves the surname Ramone. Then, in 1975, they basically invented American punk and inspired a whole generation of DIY rock and rollers. For the next 20 years, this disparate group would behave more or less as if they really were a band of brothers. All five of the core members, and even CJ and Ricky, speak very openly about the band and their frustrations with the U.S. music industry, and there is plenty of music, including some rare early live stuff, to keep the film rolling. In addition to what the Ramones say about themselves, the film offers a very strong vision of the personalities that drove the band. Johnny comes across as honest, incredibly forceful and domineering - and the sheer volume of words he presents could leave you with the impression that he dominates the film. He does not. Dee Dee, who did not even stay with the band through the 1990s, got equal time. And even Tommy, the often absent founding drummer and later producer, might have been given equal time. Joey - never a great talker - is so quiet off-stage that he will leave you wishing for more. This retrospective documentary is not an expose, but rather a respectful tribute. Framed around the band's induction into the Rock and Roll Hall of Fame, the film spends a great deal of time discussing the band's failure (in their own eyes at least) to achieve commercial success in the U.S.A. As somebody who was involved in Punk Rock from its beginnings in the U.S., I found this surprising. After all, the Ramones had more commercial success than virtually any American punk band of their generation, and, long before they broke up, achieved the status of a legend. If anything, this more-or-less constant theme is the most monotonous aspect of the film. The documentary is good and very much worth watching for Ramones fans. The directing, editing and cinematography are not particularly innovative, but they get the story across in a straight-forward way. The Ramones were never boring, but this documentary, at times, gets pretty close. Highly recommended for Ramones fans. Others may wish to avoid.",
         "A formally straightforward documentary about Da Brudders, this was really interesting, if sad - three of the band (plus interviewee Joe Strummer) are now dead after all (and the fourth appears to have morphed into an extra from \"Lord of the Rings\"). I don't know if the film managed to capture the reason the Ramones were so great - there was very little about the music, more about the interpersonal relationships in the band - but for those who are already devotees the film is unmissable. Interesting that the filmmakers, and apparently the band themselves, considered their career a failure. I always regarded the Ramones as an overwhelming success - they changed music, made great records for 21 years and were one of the best live acts in the world. I always felt that Joey was the Ramone I would have liked most as a person and that was borne out here - while Johnny was a right-wing control freak, Joey was a radical liberal and a romantic. Finding out he was Jewish puts a bit more of a spin on \"Bonzo Goes to Bitburg\" (his song about Reagan visiting an SS veterans' cemetery). And finding out Johnny 'stole' and then married the love of Joey's life puts a lot more spin on \"The KKK took my Baby Away\". I also had no idea Joey suffered from full-blown Obsessive-Compulsive Disorder. Danny Fields' description of trying to get him down the stairs and into the tour bus was one of the comic highlights in a film with plenty of laughs. Much of the humour revolved around Dee Dee it has to be said, for example his attempt to become a rap artist, the account of his relationship with his girlfriend, and just listening to him talk. It would have been good to see more concert footage - particularly a barnstorming stadium gig in Brazil and the New Year 1977/8 gig at the London Rainbow which I was at and remember very fondly. Hopefully this will become available elsewhere in some form. Perhaps the saddest part of the film was confirmation of how much the band hated each other, particularly Johnny and Joey (\"Joey could really hold a grudge\" someone said, apropos of the Linda affair). Yet they knew they had something really special together and stuck at it for 21 years. It's hard enough working in an office with people you don't like... Score - 8/10 for the film, 10/10 for the band. Shine on, guys..."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Music"
      ],
      "productionCompanies": [
         "Chinagraph",
         "Gugat Films",
         "Kessel Brothers International"
      ],
      "summaries": [
         "In 1974, the New York City music scene was shocked into consciousness by the violently new and raw sound of a band of misfits from Queens, called The Ramones. Playing in a seedy Bowery bar to a small group of fellow struggling musicians, the band struck a chord of disharmony that rocked the foundation of the mid-'70s music scene. This quartet of unlikely rock stars traveled across the country and around the world connecting with the disenfranchised everywhere, while sparking a movement that would resonate with two generations of outcasts across the globe. Although the band never reached the top of the Billboard charts, it managed to endure by maintaining a rigorous touring schedule for 22 years.",
         "The story of the punk rock band The Ramones."
      ],
      "budget": 0
   },
   "movielensId": 32493,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-01-19",
      "dvdReleaseDate": "2005-03-15",
      "directors": [
         "Michael Gramaglia",
         "Jim Fields"
      ],
      "runtime": 110,
      "movieId": 32493,
      "title": "End of the Century: The Story of The Ramones",
      "mpaa": "NR",
      "actors": [
         "Marky Ramone",
         "Johnny Ramone",
         "Dee Dee Ramone",
         "Tommy Ramone",
         "Joey Ramone",
         "Richie Ramone",
         "Rick Rubin",
         "Chris Stein",
         "Deborah Harry",
         "Hilly Kristal",
         "Danny Fields",
         "Andy Warhol",
         "Joe Strummer",
         "John Lydon",
         "Johnny Thunders",
         "Iggy Pop",
         "Eddie Vedder",
         "Edie Sedgwick",
         "David Johansen"
      ],
      "imdbMovieId": "0368711",
      "originalTitle": "End of the Century: The Story of The Ramones",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["WIE_tS6ML0w"],
      "plotSummary": "Filmmaker Michael Gramaglia's years-in-the-making biography of the legendary punk band the Ramones entitled End of the Century traces nearly all the various and sundry peaks and valleys which the seminal rockers experienced over the course of its 20-plus year career before disbanding in 1995. Beginning with the band's first concert performances in the mid-'70s, Gramaglia explores the eccentric and highly volatile band members -- in all the various line-ups that were presented over the years -- as the Ramones slowly gained fame for their high energy and high-tempo style of music that would later influence generations of punk rockers around the world. Mixing archival interviews with new interviews of the various surviving bandmembers, as well as interviews with a number of the Ramones' contemporaries, End of the Century encapsulates the East Coast underground music atmosphere of the 1970s and '80s that the band inadvertently shocked into existence.",
      "tmdbMovieId": 16301,
      "avgRating": 3.59559,
      "releaseYear": "2003",
      "numRatings": 68,
      "posterPath": "/pZZR3oDnIUZff6puM9ctolafJpg.jpg"
   }
}