{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "nudity",
            "id": 2483
         },
         {
            "name": "sacrifice",
            "id": 2858
         },
         {
            "name": "satanism",
            "id": 3099
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "devil",
            "id": 14999
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "witchcraft",
            "id": 40931
         },
         {
            "name": "occult",
            "id": 156174
         },
         {
            "name": "mutilation",
            "id": 157512
         },
         {
            "name": "beast",
            "id": 161271
         }
      ],
      "imdb_id": "tt0066849",
      "video": false,
      "title": "The Blood on Satan's Claw",
      "recommendations": [
         31965,
         169644,
         28498,
         29570,
         13549,
         28855,
         19383,
         20842,
         44932,
         28763,
         29049,
         18979,
         3104,
         40043,
         17921,
         40345,
         39916,
         90590,
         28733,
         3124
      ],
      "backdrop_path": "/3UnvmI2efghXaIRDpQxEyX8gK3N.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Judge",
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482b3",
               "name": "Patrick Wymark",
               "profile_path": "/vrXTDBBGi4UdXFt8aEupKPTee9R.jpg",
               "id": 67917,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Angel Blake",
               "gender": 1,
               "credit_id": "52fe4518c3a368484e0482b7",
               "name": "Linda Hayden",
               "profile_path": "/rZvS8CkPMSV4kRhWLxMBMKXNFeS.jpg",
               "id": 96177,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ralph Gower",
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482bb",
               "name": "Barry Andrews",
               "profile_path": "/lvzCTlrl9vMaxLgHLp1OrMXn9rV.jpg",
               "id": 96187,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Squire Middleton",
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482c3",
               "name": "James Hayter",
               "profile_path": "/b3aczw5adgqvNv6uC4NHYWGDCGL.jpg",
               "id": 30769,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Margaret",
               "gender": 1,
               "credit_id": "52fe4518c3a368484e0482bf",
               "name": "Michele Dotrice",
               "profile_path": "/l98CFqAuQVuV8r6O2t99Z6tNjCG.jpg",
               "id": 96188,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Reverend Fallowfield",
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482c7",
               "name": "Anthony Ainley",
               "profile_path": "/9jjllIXXjodmWlKrhwr3MSqmlbU.jpg",
               "id": 96189,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "The Doctor",
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482cb",
               "name": "Howard Goorney",
               "profile_path": null,
               "id": 30676,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ellen Vespers",
               "gender": 1,
               "credit_id": "52fe4518c3a368484e0482cf",
               "name": "Charlotte Mitchell",
               "profile_path": null,
               "id": 72707,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Isobel Banham",
               "gender": 0,
               "credit_id": "52fe4518c3a368484e0482d3",
               "name": "Avice Landone",
               "profile_path": null,
               "id": 96191,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Cathy Vespers",
               "gender": 1,
               "credit_id": "52fe4518c3a368484e0482d7",
               "name": "Wendy Padbury",
               "profile_path": null,
               "id": 96192,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Dancing Girl",
               "gender": 1,
               "credit_id": "574f4e15c3a36879e6000272",
               "name": "Yvonne Paul",
               "profile_path": null,
               "id": 558479,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482dd",
               "name": "Piers Haggard",
               "profile_path": null,
               "id": 32154,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482e3",
               "name": "Robert Wynne-Simmons",
               "profile_path": null,
               "id": 96233,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482e9",
               "name": "Peter L. Andrews",
               "profile_path": null,
               "id": 96234,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4518c3a368484e0482ef",
               "name": "Malcolm B. Heyworth",
               "profile_path": null,
               "id": 96235,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4518c3a368484e0482f5",
               "name": "Tony Tenser",
               "profile_path": null,
               "id": 69559,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4518c3a368484e04830d",
               "name": "Weston Drury Jr.",
               "profile_path": null,
               "id": 9904,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "538f7e4f0e0a26298c00085e",
               "name": "Richard Best",
               "profile_path": null,
               "id": 132588,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "535d7f5cc3a3682273000b17",
               "name": "Dick Bush",
               "profile_path": null,
               "id": 58660,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56a9031cc3a36872e9000404",
               "name": "Arnold Chapkis",
               "profile_path": null,
               "id": 96237,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56a90360c3a36872d80003ca",
               "name": "Marc Wilkinson",
               "profile_path": null,
               "id": 32159,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.781095,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 26774,
      "vote_count": 36,
      "budget": 140000,
      "overview": "The accidental unearthing of Satan’s earthly remains causes the children of 17th-century English village to slowly convert into a coven of devil worshipers.",
      "similar": [
         994,
         11826,
         281,
         281957,
         395834,
         9946,
         301846,
         74997,
         398175,
         341006,
         6312,
         321258,
         3134,
         434873,
         357096,
         9373,
         294963,
         4638,
         769,
         185
      ],
      "original_title": "The Blood on Satan's Claw",
      "runtime": 93,
      "poster_path": "/sJREenbTnr3Th2FGXo93D1nHCoC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tigon British Film Productions",
            "id": 4579,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Chilton Films",
            "id": 21719,
            "origin_country": ""
         }
      ],
      "release_date": "1971-01-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "A chill-filled festival of horror!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Piers Haggard"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Robert Wynne-Simmons",
         "Piers Haggard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0066849/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODkyNTAwNjc4Nl5BMl5BanBnXkFtZTcwMDM4ODQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Patrick Wymark, Linda Hayden, Barry Andrews | See full cast and crew »"],
      "reviews": [
         "See this for Linda Hayden's sexually charged performance as Satan-loving teener Angel Blake, one of British Cinema's more memorable portrayals of pure evil in a petticoat. Possessing a WITCHFINDER GENERAL-type atmosphere, helped immeasurably by Mark Wilkinson's truly beautiful score, this tale of superstition and a Satanic contagion that exhibits itself as an ugly, hairy patch on the skin (motivating alternate title SATAN'S SKIN) is evidence of solid horror-making afoot. Patrick Wymark as the pseudo-Witchfinder anchors a mostly youthful cast who become victim to the spreading \"disease\". The climax is a ballsy one for director Piers Haggard (who also helmed the taut VENOM) as he dares to portray Satan himself. It's always a risk serving up a visual absolute of a universal concept, but it works surprisingly well here because Haggard knows just how much to show. As noted earlier, Linda Hayden is dynamite as the sexually provocative Angel and makes it easy to understand how many a fool would follow her to the depths of hell just for a taste of her own brand of heaven. BLOOD ON SATAN'S CLAW, an evocative title if ever there was one, accomplishes everything it sets out to do. It comes close to being delightfully lurid at times, and that's what gives it an edge. Also worthy of applause is Dick Bush's striking, atmospheric cinematography.",
         "Set in a small English country town in the 17th Century a farmer unearths inhuman remains that are covered with fur. So he gets the judge of the town to view it, but the evidence has strangely disappeared. After the discovery about the skull and fuss about, weird and horrific occurrences start developing with the appearance of the devil's claw. Also some of the children of the village led by Angel are committing unspeakable terror and performing satanic rituals in a desecrated church in the woods to restore their master. Atmospheric brilliance on director Piers Haggard's part! Jeez, it was hard to shake off the powerfully foreboding and frantic awe that pierced the air. Mood is a very big key to this film's success in pulling you in with its pervasively chilling and subtle imprint. Visually, Haggard manages to create a beautifully staged period horror by capturing the times and making the most of it's brooding countryside and quiet rural life. What gave it such an embracing atmosphere was that it was mostly shot on location. The beautiful backdrop works rather well with the contrast to the devilishly acts occurring in the peaceful valley. Another thing that hit me and added more to building upon the feel, was the strikingly effective, fine tuned camera-work and the robust score that generates momentum with its unsteady vibe. Also the faintly placed sound effects really do scratch away and cause sudden chills! The classy performances are all strong from the British cast with some richly developed characters. But it's Linda Hayden (Taste the blood of Dracula) luminous performance as Angel Bleak the manipulative evil prowess who stands by the devil's right hand doing his work that makes the film very memorable. Also Patrick Wymark is exceptional as the Judge, the highly placed leader and hero of the town's folk. Maybe the film could have done with a star actor to give it an added boost, but those involved were more then perfect anyway. These provocative aspects took shape and simply completed the film. The immensely original plot manages to incorporate a whole lot things ranging from folklore tales of witchcraft and Satanism practice to sexuality involving temptation, seduction and lust. This is all done with a serious face. I wouldn't call the plot flawless, as there are many unexplained and meaningless events associated within the material, but it does inject many unexpected turns. It plays around with idea that some sort of curse has hit the town with the devil's presence sinisterly lurking beneath the cracks. Although, it's not terribly all about the devil, but on the innocence of the children, to how the devil has preyed upon them to do his bidding and that's what makes this rather eerie to the bone. Since this is kind of sexually charged in a semi-way, it does provide nudity, but it's not overly graphic when it came to the violence. The gore is low. Though, saying that it does provide some disturbing, raw and perverse images that have the force to stun. It's terrifyingly unpleasant and malevolent in small patches. Like the intense ferocity of the rape scene. Now onto the make-up. Well, the devil design stays mostly hidden in a black cloak, well that's up until the end were we get a clear shot. It's not so bad for the budget. Like so many have pointed out - the only real disappointment in my eyes was the under-whelming conclusion, after being squeezed real tight with tension it just fizzles out without a bang. Obviously there was profound talent involved, they put their heart into this low-budget production and it all came together perfectly to be highly regarded by those who've seen it. I for one agree. Highly recommended. By the way I love the original movie poster artwork for this flick. It's damn creepy!",
         "The British horror boom of the 60s and 70s was dominated by Hammer, but a couple of other studios, Amicus and Tigon, tried their best to make their mark. Amicus are probably the better remembered of the two, with a few well loved anthologies to their credit (e.g. 'Asylum'), but Tigon actually made the better movies, especially the now classic 'Witchfinder General', directed by doomed cult figure Michael Reeves, as well as 'The Creeping Flesh', and 'The Blood On Satan's Claw', which is what 'Satan's Skin' is best known as. This movie frequently gets compared to 'Witchfinder General', but apart from being set in a similar era, and even having one actor in common (Patrick Wymark who plays The Judge here had a small cameo as Oliver Cromwell in 'Witchfinder General') they are quite different in approach and execution. Piers Haggard is no Michael Reeves but he's had an interesting career which has included the underrated final 'Quatermass' series (which starred Sir John Mills) and the entertaining Oliver Reed/Klaus Kinski exploitation thriller 'Venom', as well as working with Dennis Potter on 'Pennies From Heaven'. I still don't think 'Blood On Satan's Claw' is as good as 'Witchfinder General', but it's an excellent chiller nevertheless, and one of the most underrated British horror movies of all time. Like Reeves Haggard knows how to make the most of a small budget, and he manages to create an unsettling and creepy atmosphere. Also like Reeves he makes brilliant use of the English countryside. Patrick Wymark sadly died shortly after completing this movie, but it's a good testament to his talent. He gives a terrific performance. Also look out for his work in 'Repulsion' and 'Journey To The Far Side Of The Sun'. Seventies sex siren Linda Hayden ('Baby Doll', 'Madhouse', 'House On Straw Hill') is also memorable as Angel Blake, the leader of a Satanic group of young villagers. She looks absolutely stunning, and has one unforgettable nude scene. The supporting cast includes a few familiar faces, most notably Michelle Dotrice ('Some Mothers Do 'Ave 'Em') who plays Margaret, and Wendy Padbury (Zoe from 'Dr Who') who plays Cathy. The only thing I can really fault with this movie is the ending, which is a bit rushed and anti-climactic, but apart from that it's one of the best British horror movies of the early 70s, and highly recommended viewing.",
         "This eerie film is set circa 1640 , when is earthed by a farmer (Barry Andrews) a weird human remains located in an British small village . Later on , a farming community is haunted by the demon himself . Children and adolescents being possessed by hairy demon and becoming them into a coven of witches practicing exorcisms and witchery . The teens led by a nasty young girl (Linda Hayden) are worshipping the devil , raping , and sacrificing other young people . Meantime , a judge (Patrick Wymark) investigates the rare events . The film packs gruesome images , grisly killings , thriller and intense horror sequences . Magnificent detail period is perfectly set in 17th century . Somewhat nudism at times in charge of Lynda Hayden and pagans ceremonies . For its US release the nudity was censored, particularly in Linda Hayden's seduction scene , by darkening the footage to avoid an X rating . Enjoyable casting by Patrick Wymark (a role ¨Witchfinder general¨-alike) who died slowly after making the film , a gorgeous and erotic Linda Hayden (Taste of Dracula blood) , Barry Andrews (Dracula has risen from grave) , Michele Dotrice(who married to Edward Woodward) and Tamara Ustinov (daughter of Peter Ustinov and niece of Angela Lansbury) . It's produced by Tigon , usual in terror movies and richly atmospheric in Pinewood studios . The movie displays a weird and creepy score musical by Marc Williamson . Evocative and imaginative cinematography by Dick Bush , Hammer films ordinary (Twins of evil , Dracula 72 , When dinosaurs ruled earth). The motion picture was well directed by Piers Haggard (Venom , Quatermass conclusion) . The flick isn't for the faint-hearted , however to be liked for horror fans.",
         "Set in 17th century Britain, this severely under-rated horror yarn fairly drips with a thick, creepy atmosphere that is hard to shake. The incredibly sexy Linda Hayden (here sporting bizarre, wicked eyebrows) stars as the sluttish leader of a group of children who discover, then worship, the remnants of what appears to be a demon in a farmer's field; they soon begin to perform sacrifices of other children to it. Patrick Wymark, in a fine, subtle performance, plays a Matthew Hopkins-type who puts a stop to the group's murderous shenanigans. The plot is presented in a somewhat disjointed, vague manner, especially during the disappointingly incoherent, anti-climactic finale. But the film's great strength is its amazingly real sense of place and time. Set during a remarkably superstitious period, the vividly presented characters (the acting is uniformly excellent) are in constant fear of an evil presence that palpably lurks everywhere; the film is so extremely well made that the viewer comes to share their constant dread. The end result is a stylish horror movie that is very uncomfortable to watch.",
         "Real English countryside locations that breath ancient history. Old stone built houses, wild forests and mysterious ruins. Folk beliefs and practice of witchcraft and mysticism of nature. Now here's an evil fairy tale that both looks and feels right. One of the best films in British horror genre with only a few others on the same line, like 'The Witchfinder General' and 'The Vicker Man'. This is no way an ordinary horror flick, but bears its claws deeply into historical core of the witchcraft in Britain and uses its influences most efficiently. Piers Haggard's direction is not overwhelming, neither is it using loads of usual heavy horror gimmicks. It simply lets the story evolve more naturally with only a few necessary effects cleverly executed. The young actors are good and mostly unknown for me, except Linda Hayden disturbing the local priest and the whole farming community with her ways of black magic. She was also appearing in 'Taste the Blood of Dracula' as the figure of innocence corrupted by evil. A certain sense of innocence is present here too in nearly all the people, even when cruelty takes place. It's like simple minded children playing with something new and dangerous and not quite understanding the real state of madness until it's too late. The young are constantly pushed and ordered by their elders, which makes the seek for rebellion and trying the forbidden more tempting. And still they end up even more possessed and ordered by Angel (Hayden), who clearly enjoys her new found form of twisted strength. Patrick Wymark's firm judge, who tries to bring back the order through his stronger set of rules and valued formulas, may show up as the only savior. But in the end, is he really just the lesser of two evils? So a certain metaphoric message can be seen here if one so wishes. In a way by this kind of surroundings and people the whole story comes out as a bit more believable tale. All this doesn't mean that the film isn't enjoyably fun to watch too.",
         "This 1970 British horror pic is just oozing with atmosphere. It takes place in England in the 1600s where life was harsh and the appearance of weird bones in a farmer's field sets off a chain of demonic activities when a group of farm children discover them. They then begin to worship a mysterious evil entity and start sacrificing other children to it. The music score is appropriate for the movie and there were some scenes that made my skin crawl (no pun intended). I would recommend this movie for connoisseurs of classic horror pictures where the characters don't act like total fools when confronted with evil. If you're squeamish, don't watch this in the dark.",
         "The Blood on Satan's Claw is a terrific film from Tigon Productions and yet, it's still pale compared to their greatest film � this being `The Witchfinder General' staring Vincent Price. Don't let the opening sequences of this film mislead you. The first 20 minutes are rather disappointing, with false scares and missed opportunities to set a satanic tone right from the start. The only real moments to enjoy during these initial 20 minutes are the atmospheric images of rural Britain around the 17th century. The photography of the little cursed village, completely isolated from the rest of England, is shown very effective. Yet, the real `horror' only kicks in when we're introduced to the absolutely astonishing Angel Drake. The young �and bewitching � Linda Hayden plays this shrew from hell. The plot can be summarized as followed: Satan (although never directly referred to as) takes over a little town by transferring his maniacal thoughts and devilish rituals over to the local adolescents and teenagers. Led by Angel Drake, these `children' perform witchcraft, mutilate and brutally kill fellow children who're marked by the growing of Satan's Skin (a bizarre fur suddenly growing on their bodies). Truly atmospheric and tense with a dazzling demonic theme, subtle undertones of eroticism (Hayden seducing the priest in the church!!) and a spirited courage of director Haggard to break all the typical taboos in horror (pedophilia! Or the Children as symbol of evil!). Peter Wymark is terrific as `the Judge' but you can't help imagining Peter Cushing to play his role. I read in the production notes that Cushing was approached to star (as well as that other British horror legend, Christopher Lee) but the budget of the film was too small. But, just because the budget is modest, it doesn't mean the film can't be shocking. On the contrary! The group-rape scene � controlled by the ghastly eyes of Hayden � is still shocking, even by today's standards. Can you imagine the impact this particular scene caused at the time it was shot? In the year 1970, mind you! Despite a few flaws, `The Blood on Satan's Claw' is an absolute highlight in the British horror field. Especially recommended to admirers of Hammer films and semi-sleaze lovers. The only letdowns (aside from the semi-tedious opening) is the rather annoying overuse of inappropriate music and the all-too-dramatic slow motion ending.",
         "Quite simply, 'Blood On Satan's Claw' is the finest horror film produced in Britain in the Seventies. Haunting, horrific and hopelessly compelling it deserves far greater recognition than it currently warrants. Linda Hayden, the most talented actress working in British exploitation films at the time, delivers her finest performance in the film, and it is one light years ahead of the standard in the genre. Patrick Wymark, in his last film role, is also excellent, and music, direction and art direction are all of an exceptionally high standard. Interestingly, the film was shot as 'The Devil's Touch', and originally released late in 1970 as 'Satan's Skin'. For some reason business wasn't too good and it was rereleased the following year on a more succesful double bill with 'The Beast In The Cellar'. Don't miss it!",
         "The Blood on Satan's Claw isn't a Hammer production--but it should be! Exhibiting many of Hammer's trademark features--the Gothic setting, a diabolic threat that lives on the border of civilization, a complex hero with touches of darkness in his character, and a beautiful temptress--The Blood on Satan's Claw was actually a Tigon effort, and one that in many ways surpassed contemporary Hammer releases. In fact, the quality of The Blood on Satan's Claw is so fine, and the thrills it induces so powerful, that one can't help wondering just why the Gothic horror picture was on its way out. Few of the slasher films that would permeate the genre in the coming years can hold a candle to this picture. The Blood on Satan's Claw is a tale of an ancient evil reborn. A farmer unwittingly plows up a strange corpse, but the alien body disappears before the local judge can investigate. Soon, terrible things begin to happen, and the local youth seem to have all gone over the edge, perhaps into witchcraft. The Judge, played to perfection by Patrick Waymark, is a flawed individual, to say the least. He is dedicated to doing the right thing, true enough, but he is also harsh, cold, haughty, and judgmental. He is also very reluctant to concede that what he considers to be superstition is at work in his village even after evil begins to manifest itself in some very conspicuous ways, and only begins to realize the truth when it is very nearly too late. The other exceptional performance in the film belongs to the lovely Linda Hayden, who the previous year had starred in Hammer's Taste the Blood of Dracula. Hayden plays the young woman who becomes the leader of the strange cult which infects most of the village youth, and it is she who orchestrates much of the terror which ensues. Her character, ironically named Angel, is a seductress of a particularly haunting power, and it's hard to conceive of any actress from that era playing the part any better. The story does move a bit slowly, but the drama unfolds with conviction and a realistic touch which many more explosive films lack. The ultimate climax, in which the villagers square off against the coven of witches and their demonic master, is perhaps a bit of a letdown in that it's over very quickly, but when the final credits roll the viewer is still left with a very satisfied feeling. Frightening and atmospheric as only a Gothic can be, The Blood on Satan's Claw is a well-acted and produced horror picture that should appeal especially to fans of Hammer productions."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Tigon British Film Productions",
         "Chilton Films"
      ],
      "summaries": ["Horror thriller set in 17th century England about the children of a village slowly converting into a coven of devil worshipers."],
      "budget": 82000
   },
   "movielensId": 32686,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-01-01",
      "dvdReleaseDate": null,
      "directors": ["Piers Haggard"],
      "runtime": 93,
      "movieId": 32686,
      "title": "The Blood on Satan's Claw",
      "mpaa": "R",
      "actors": [
         "Patrick Wymark",
         "Linda Hayden",
         "Barry Andrews",
         "James Hayter",
         "Michele Dotrice",
         "Anthony Ainley",
         "Howard Goorney",
         "Charlotte Mitchell",
         "Avice Landone",
         "Wendy Padbury",
         "Yvonne Paul"
      ],
      "imdbMovieId": "0066849",
      "originalTitle": "The Blood on Satan's Claw",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["eixq35MyibI"],
      "plotSummary": "The accidental unearthing of Satan’s earthly remains causes the children of 17th-century English village to slowly convert into a coven of devil worshipers.",
      "tmdbMovieId": 26774,
      "avgRating": 3.27027,
      "releaseYear": "1971",
      "numRatings": 37,
      "posterPath": "/sJREenbTnr3Th2FGXo93D1nHCoC.jpg"
   }
}