{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "addiction",
            "id": 6782
         },
         {
            "name": "recovering drug addict",
            "id": 155936
         },
         {
            "name": "estranged son",
            "id": 196911
         }
      ],
      "imdb_id": "tt0388838",
      "video": false,
      "title": "Clean",
      "recommendations": [
         78992,
         198537,
         202776,
         191731,
         1918,
         42029,
         18302,
         47715,
         59930,
         109394,
         41589,
         25112,
         49345,
         24488,
         18713,
         61536,
         20595,
         39310,
         47060,
         34615
      ],
      "backdrop_path": "/AaYik70IZAtkSawQPuZhQJvIiNd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Emily Wang",
               "gender": 1,
               "credit_id": "52fe47369251416c9106db91",
               "name": "Maggie Cheung",
               "profile_path": "/eT5HNJT307Zg2PyMsgKdrtIlG3u.jpg",
               "id": 1338,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Albrecht Hauser",
               "gender": 2,
               "credit_id": "52fe47369251416c9106db95",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Elena",
               "gender": 1,
               "credit_id": "52fe47369251416c9106dba5",
               "name": "Béatrice Dalle",
               "profile_path": "/vWWWIf2FBVhTwQ4wzumYuLIvXVy.jpg",
               "id": 4813,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Irene Paolini",
               "gender": 1,
               "credit_id": "52fe47369251416c9106dba9",
               "name": "Jeanne Balibar",
               "profile_path": "/LkVjqDNX857fXYvqzttiCR38i1.jpg",
               "id": 77191,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Vernon",
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbad",
               "name": "Don McKellar",
               "profile_path": "/cV1nEafG1CqIdnrce5pVw2hcaep.jpg",
               "id": 20173,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Rosemary Hauser",
               "gender": 1,
               "credit_id": "52fe47369251416c9106dbb1",
               "name": "Martha Henry",
               "profile_path": null,
               "id": 143169,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lee Hauser",
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbb5",
               "name": "James Johnston",
               "profile_path": null,
               "id": 199820,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Jay",
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbb9",
               "name": "James Dennis",
               "profile_path": null,
               "id": 123541,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jean-Pierre",
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbbd",
               "name": "Rémi Martin",
               "profile_path": null,
               "id": 144779,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Sandrine",
               "gender": 0,
               "credit_id": "52fe47369251416c9106dbc1",
               "name": "Laëtitia Spigarelli",
               "profile_path": "/msV68qW1uYUAIGSMjVh39xPTlUO.jpg",
               "id": 49279,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106db9b",
               "name": "Olivier Assayas",
               "profile_path": "/ySOOBOK7qSPlmSeLmcFsQaULcwY.jpg",
               "id": 21678,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106dba1",
               "name": "Olivier Assayas",
               "profile_path": "/ySOOBOK7qSPlmSeLmcFsQaULcwY.jpg",
               "id": 21678,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.843991,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 39851,
      "vote_count": 19,
      "budget": 0,
      "overview": "After losing her husband to a heroin overdose, Emily Wang fights to overcome her own addictions and to be reconciled with her estranged son.",
      "similar": [
         627,
         404378,
         1900,
         295964,
         10474,
         11559,
         331190,
         4771,
         6075,
         109421,
         106646,
         4995,
         122081,
         339692,
         308266,
         522,
         979,
         273481,
         390062,
         169917
      ],
      "original_title": "Clean",
      "runtime": 111,
      "poster_path": "/7dW68j9wL9zPgmChoGXyLJ8a82c.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "2004-09-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "When you don't have a choice, you change.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Olivier Assayas"],
      "runtime": 111,
      "synopsis": null,
      "writers": ["Olivier Assayas"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0388838/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2OTY4ODgwN15BMl5BanBnXkFtZTcwMDgxODgzMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Maggie Cheung, Nick Nolte, Béatrice Dalle | See full cast and crew »"],
      "reviews": [
         "Saw Clean today at the 2004 Toronto International Film Festival, starring Maggie Cheung and Nick Nolte. Cheung and director/screenwriter Olivier Assayas were present to introduce the movie and showed up afterwards for a Q&A session. Clean stars Cheung as the drug-addicted wife of a once-good rock musician who, after a tragedy, must clean herself up and set her life back on track to regain custody of her son from his grandparents (played by Nick Nolte and Martha Henry). Don McKellar also makes an appearance early in the film as a business associate of Cheung's husband. The movie moves between Hamilton (!), Vancouver, Paris, and London as Cheung struggles to redefine her life. Clean was a great movie, and it's easy to see how Maggie Cheung picked up the best actress award at Cannes this year. And Assayas even made a dingy, industrial shoreline in Hamilton appear as a beautiful backdrop to one scene of Cheung taking drugs to escape the conflict in her life. Some tidbits from the Q&A: - The script was written for Maggie Cheung by the director, Olivier Assayas. The two had worked together previously on Irma Vep, and Assayas wanted to find a story that would fit Cheung, but it took several years. - Cheung's character in the movie is much like her real-life self, in that it is a character between cultures, with roots in many countries. - Maggie Cheung likes singing, which influenced the storyline. - Nick Nolte was not the first choice to play the grandfather; another actor had been selected, but shortly before shooting, his doctor called to say that he was ill and could not participate in the movie, and in fact died not long afterwards. When recasting, Assayas told his casting director that he wanted someone like Nick Nolte for the role, and it was suggested that he just contact Nolte, who quickly accepted. - Assayas couldn't believe that Nolte was actually in the movie until he saw him in front of the camera. - When casting in Canada, the first set of tapes sent to Assayas for each of the characters were all wrong, with the exception of the one for the grandmother, which was Martha Henry. Assayas said she was the ideal choice for the role. - Many people who make appearances in the movie are real-life musicians, which lends an air of verisimilitude to the movie. Included are Tricky and David Roback. Cheung's husband in the movie is also a musician, and is currently working with Nick Cave. - When casting Cheung's son in the movie, Assayas said that he must have seen every Eurasian child in North America. :-) He eventually picked a boy with no previous acting experience, because he felt child actors are generally spoiled and lack spontaneity. - When asked about her realistic portrayal of a recovering drug addict, Cheung mentioned that it is not based on her own experiences, but both she and Assayas have had friends in various stages of recovery, some entering it, some in it, and some coming out of it. - Assayas said he didn't want to sentimentalize the problem, and that he wanted to be more balanced and not have anyone purely good or purely bad. - He was a bit nervous showing the movie in Toronto since much of it was shot here or in the area, and that the audience could easily compare it to the real-life version (in fact, one shot that is supposedly in Hamilton is actually on Bathurst Street in Toronto). - For the festival, he is staying in the same hotel in which he stayed while filming the movie, which he found weird. :-)",
         "Wonderful characters and beautiful images, on a plot that supports them well, without grabbing too much attention. Assayas shows great skill in timing and in choosing when to pursue and when to cut off a scene, delivering the smoothest storytelling and the most delicate way to bring characters to life. Balibar, Dalle and Tricky provide a rich, clever, contrasting universe where Cheung's brilliant performance and Notle's strong presence can shine. If a bit over-dramatic at times, the use of music is rather moving: no formal perfection, no bland, formatted entertainment, but the sound of real people pouring their life in their songs. Subtlety, sensitivity and humanity in filming life's meanderings make this movie a real treat. 9/10",
         "Clean marks Maggie Cheung and her ex-husband Olivier Assayas's 1st project after the divorce. As i personally unable to catch Irma Vep, the French vampire drama which both previously worked together, i am unable to say how well Maggie Cheung has acted in French, but seriously, i am really impressed by Cheung's performance in her 2nd French film. Playing the role of Emily Wang, a rock singer's husband, Maggie presented herself in fluent English, French and Cantonese, her native language. When Emily was arrested for possession of drugs after her husband died of overdose of heroin, she was imprisoned for 6 months. After her release from the prison, she promised her father-in-law (Nick Nolte) that she would start her life clean, so as to get back her son. During this period, she worked in a Chinese restaurant as a waitress, and at the same time, she wants to settled down with a proper job, which was none other but related to rock music. Clean focuses on Emily's journey to start life anew, with some scene where her father-in-law is helping her to get back to life, by convincing her son, Jay, to go back to his mum. From the film, we could see the journey Emily has been through, right from the help given by her friends, how she was treated in the restaurant, to the reunion with her son. Maggie Cheung has proved the fim critics that being an Asian female movie star, she could also acted well in this multi-nation production which gains her an Cannes. Nick Nolte, on the other hand, helps to enhance the film with his role of the forgiving father-in-law, who was there to help his daughter-in-law to get back her son, rather than blaming her for his son's death. It was quite sometime for the Asian audiences to see Maggie Cheung as the main actress in a movie after Zhang Yimou's Hero, which was seen as a failure in Asia. While Wong Kar Wai uses Maggie as Tony Leung Chiu Wai's memory in 2046, where she barely appears for less than 10 seconds in the whole film, Assayas fully enhanced Maggie's potential in Clean, which is a delight to Maggie's fans. Also, Maggie Cheung performed the theme song for Clean for the first time, which also thrills and surprises her fans. Unlike Madonna and Jennifer Lopez, who are both singer and actress, Maggie Cheung has never recorded an album before, as she's not a professional singer. But with the new try in Clean, not only we could get a chance to see her impressive performance, but also judge on her vocal in the 2 songs performed by her in Clean. By acting and singing at the same time in Clean, Maggie Cheung has not let her fans down.",
         "The film opens with a beautiful image of the perpetually burning furnace fire issuing from a steel plant in Hamilton, Ontario and ends in the idyllic scene of suburban San Francisco with the Golden Gate Bridge in the distant background. In between, we see Vancouver, Paris and London. Despite its global scope, Clean is a simple story of drug addicted rock-singer Emily's (Maggie Cheung) struggle to put her life back together after losing her husband to an overdose. While there are a lot of sub-plots and elements, the ultimate focus is Emily's attempt to reconcile with her child Jay who hardly knows her, having been left in the care of the grandparents while the parents pursue their career in rock music. Among the different threads weaving this story, the one that touches me most is Emily's relationship with her father-in-law Albrecht, played so beautifully by Nick Nolte. Father-and-daughter-in-law (or father and son's girlfriend) is a relationship that is not explored too often. However, two cases immediately come to mind. At one end, there is the classic confrontation in Verdi's La Traviata, when Giorgio Germont convinces Violetta that the best thing for his son is for her to leave him (in, incidentally, one of the most beautiful arias written for a bass). At the other end, there is Cate Blanchett's unforgettable film Heaven (2002), in which one cannot help but be moved by the father's kindness towards this woman who is taking away his son to a fugitive life. The father Albrecht in Clean goes much deeper, as best seen in his first and last scenes with Emily, strangely echoing La Traviata and Heaven respectively. Six months after his son's death and Emily serving her term for drug possession, Albrecht flies to Hamilton to meet her and settle affairs. Despite grieve over his loss, he is sensibly civil to this woman whom the world has blamed for his son's downfall and eventual death. As the wonderfully downplayed dialogue progresses, we see gradually hints of his genuine sympathy and care, as he explains that the courts have awarded the custody of the little boy Jay to the grandparents. Then, at the parting, with some struggling but absolute resolution, he asks that Emily do not try to see Jay for a few years although she is legally allowed to do so. Nolte delivers this first scene with every nuance and every gesture impeccably placed. By the time we come to the last scene, we understand a lot more about this man, his sorrow of losing his son, his love for his grandson, his stoic acceptance that his wife will not be by his side much longer and his recognition that he himself in turn will not be around long enough to care for Jay before the little boy grows up. Despite the fact that his wife still does not allow this woman's name to be mentioned in her presence, Albrecht has reconciled with himself in his forgiveness of Emily. After delivering Jay to Emily for a weekend (kept carefully from his dying wife), Albrecht catches her bringing Jay back to the hotel for his passport so that she can take him to San Francisco for a once-in-a-life-time recording opportunity. His reaction is inscrutable for a moment, and then the cinema is bathed in a warm glow as he breaks out in a smile and congratulates Emily for finding what she really wants to do with her life. In his reconciliation with Emily, he also completes his life's final crusade, of ensuring that little Jay will be properly cared for after his wife's imminent (and his eventual) death. Nolte again delivers this scene to perfection. Maggie Cheung, departing from mystic, inscrutable characters as in \"In The Mood for Love\" to the earthy rock singer talking with a mouthful of hamburger, tackles the character Emily by underplaying, which is not a bad thing. Other than in the first couple of scenes of clashes with the husband, Cheung goes for the feeling underneath rather than the emotion on the surface. Once only does she break down and cry, when the pressure become unbearable and she misses the support of her husband. This line of portrayal not only suits Cheung, but is also consistent with character of Emily, quietly enduring and struggling to become \"clean\", and obviously pays off, winning for Cheung her Cannes award. There are a lot of sub-plots and elements in this film, maybe a tad too many. Drug addiction is the underlying theme of the entire story, and yet, the treatment of this subject is disproportionately casual. We are certainly spared the anguish an addict like Emily must have gone through. Rock music is a backdrop the presence of which might have been stronger, even though this is not another \"Almost Famous\". Still, a hard-core rock fan may see this as a rock movie, at the appearance of real life personalities like Tricky and cult rock bands such as Mazzy Star, both well known within the circle. Minor sub-texts include Emily's earlier lesbian affair and current cultural dilemma. Although Clean is not meant to be the emperor's new coat, it is quite inevitable that different people will see different things that they want to see. Martha Henry plays the grandmother, a role that does not have a great deal of scope. She plays it to perfection, naturally, but those of us who have seen her during all these years on stages in Niagara-on-the-Lake, Stratford Ontario and the St. Lawrence Center and the Royal Alexandra Theatre in Toronto know that she is capable of a good deal more.",
         "To get the full, globe-trotting flavor of \"Clean,\" one need simply note that Emily Wang is a Chinese immigrant living in Paris with her British rock star boyfriend, and that their child is being raised by the young man's parents in Vancouver, Canada. All I can say is that \"Babel\" clearly has nothing on this film when it comes to international story lines spanning widely varying cultures and time zones. Though a French film, \"Clean\" actually begins in the English-speaking section of Canada where Emily and her husband, Lee Hauser, both heroin addicts, are desperately attempting to jumpstart Hauser's fading music career. The couple seems to be patterned somewhat after John Lennon and Yoko Ono, since everyone around them seems to think that Emily's undue influence on him is bringing him down both personally and professionally. When Hauser dies of a drug overdose, Emily - who earned some renown of her own as a music show hostess on an MTV-style interview show on French TV a decade or so back - is arrested for heroin possession and sentenced to six months in prison. Upon her release, she returns to Paris, agreeing not to have any contact with her son until she can kick her drug habit and make a decent life for herself. As a cautionary tale about drug addiction in the music business, \"Clean\" doesn't show us anything we haven't already seen in countless films (and VH-1 specials) on this very same subject before. Yet, although the movie is a bit too scattered in its focus at times, when it is zeroing in on the things that really matter - Emily's attempts at overcoming her addiction and her efforts at forging a meaningful relationship with her young son - it is poignant, profound and deeply touching. The movie is blessed with a pair of outstanding performances by Maggie Cheung as Emily and Nick Nolte as Hauser's father, a kindhearted soul who believes in forgiveness and who offers a helping hand to a woman whose life, despite all her best efforts, is constantly teetering on the edge of disaster. Their scenes together, as the two characters reveal their fears, insecurities and even tentative hopes to one another, are both spellbinding and breathtaking, and show us what fine movie acting is really all about.",
         "This movie is badly written and well acted, which is a shame because you're interested in the characters right away, and the movie begins as though it's going to be a different sort of drug redemption film, one that might just skate the line between glorification and demonization. Instead, the script loses it's emotional way and falls fast into a four star disappointment. Terrible follow-through. Both maggie cheung and nick nolte provide a fair- enough effort, yet their relationship never picks up any developmental speed. The other characters are quasi-interesting, but probably because we never really find out anything about them. Plus, the little boy didn't get the direction he needed, because he sounds like he's reading lines, to the point that you're embarrassed for the filmmakers that they even attempted the hook, line and cute-kid sinker. And finally, the music should be more than just set dressing in a story so critically dependent on rock credibility. Though i'd admit that there were a couple interesting sequences, i wouldn't recommend a film this weak to anyone. The script doesn't nearly get redeemed by any particular virtue of filmmaking.",
         "I could easily imagine Hollywood remaking Olivier Assayas' Clean \u0096 in fact, I would be happy to see it. The story is a sure-fire Oscar winner. Whichever big Hollywood actress wants her Oscar, step right up. But it would certainly be melodramatic, and could never match the raw power contained in this film. Maggie Cheung plays a woman, Emily, trying to stay away from heroin after her husband has overdosed. Their son lives with her father-in-law (Nick Nolte), who insists (though kindly) that she not see him for a few years, until she has proved that she can be responsible. The movie is mostly spent with Emily and her day-to-day life. She moves back to Paris, where she met her husband, and works in a Chinese restaurant, then in a department store. She desperately tries to get in contact with old friends who might help her get a decent job, but they all know her too well and don't trust her. The film is very observant of Emily as a human being. It's such an intimate portrait of a desperate person trying to get her life back together \u0096 perhaps together for the first time in her life. Assayas, who also wrote the script, understands her deeply. And Maggie Cheung even moreso. Cheung gives one of the finest performances I've ever seen. Just the expressions on her face devastated me from scene to scene. I mean, she is so subtle. It's just outstanding. Assayas' direction is likewise subtle. A Hollywood remake, I could imagine, could also be subtle, but nowhere near as quiet and observant as the original (in fact, scanning through user comments, I can see that many were simply bored by the film). While it would be easy to spend pages gushing over Cheung's performance, it must also be noted that Nick Nolte is at least at the same level. This may very well be his best performance. It helps immensely that the character is so perfectly written. It would have been easy to make him a jerk \u0096 and, again, thinking ahead to the remake, it's quite possible that that is what this character will become \u0096 but Assayas gives him a deep understanding of Emily's situation, and an ability to empathize that I don't think can exist in American cinema. Nolte hits every note exactly right. His line reading is just beautiful. My single complaint about the film is the child actor who plays the son. I suppose it must have been difficult to find a half-Chinese, half-Caucasian kid on a limited budget who could act. They certainly did not find a kid who could act, though. James Dennis is easily one of the worst child actors I've seen in years. It's a flaw I can forgive, though. The movie ends very ambiguously, and it's arguable whether Assayas made the right choice here. I could argue that it feels too hopeful. There's a quick, matter-of-fact shot in which we see a smile cross Emily's face. I think I would have cut that and perhaps directed Cheung to avoid any readable facial expression. However, I know it didn't escape the director \u0096 or the actress either \u0096 that Emily, who is clean at this point, is approaching the world in which she fell into the trap of drug addiction. It might be better for her to stay working at a department store, perhaps somewhere cheaper to live than Paris.",
         "It takes a hell of a lot to keep me up past my bedtime, and it was this outstanding performance by Maggie Cheung (Jet Li's Hero, 2046) with support by Nick Nolte (Affliction, The Prince of Tides) that did it. All you need to know about the film is in the summary. The story of a woman or man trying to battle their demons and get their life on track is as old as film itself. It is Cheung that brings the magic to the story and gives a performance that stands out from the rest. Using three languages was powerful, and certainly puts here a step above others. Writer and director, Olivier Assayas, provided the perfect vehicle to display Cheung's ability. Cinematography by Eric Gautier (A Guide to Recognizing Your Saints, The Motorcycle Diaries) was brilliant. Cheung fans will be thrilled; others will be amazed at Nolte's ability.",
         "So what does it take to win at the Cannes Film Festival? Well, Maggie Cheung pulled out all the stops for her win in 2004 in a moving film directed by her ex-husband Olivier Assayas. Emily Wang (Maggie Cheung), a junkie ex-VJ, struggles in life after her husband, a famed yet ageing rocker whose career is in decline, dies after a heroin overdose on the drugs she had bought him. After serving six months in jail for possession, she finds her son, Jay (James Dennis) is put into the care of her parents in law, Albrecht (Nick Nolte) and Rosemary (Martha Henry). Knowing that the only way to see her son again is to clean herself up, Emily moves to Paris to rebuild her life, seeking help from long forgotten contacts. Meanwhile Albrecht begins to have a change in heart when he realises that Rosemary is dying. Maggie Cheung's performance isn't easy to match with superlatives. Mastering dialogue in Cantonese, English and French, as well as singing the title track - she, unlike many HK actors, hasn't launched a singing career - it feels as much an honest, raw portrayal of Emily's character and her struggles to deal with the twists presented to her. Whilst Cheung and Assayas may have split amicably years before, I can't help but feel that their own history must have played a part in the making of this film, and if so, they used it well for the benefit of the film. Which is just as well, as I felt the overall script wasn't as impactful as it could be, particularly given Cheung's performance. Nick Nolte's role is fairly limited. It's strange seeing him now as a grandfather, but he does it well - will we see a change in direction from him? This is a good film, and we will look back on it one day in an awards ceremony and say this is the one movie that exemplifies all of Maggie Cheung's achievements in one film.",
         "Just saw this on Sundance Channel and was quietly but firmly impressed. ALL performances were top notch, yes. even the little boy's. Nick Nolte is the damned finest actor of his generation probably and Miss Cheung is terrific in her French and English speaking role. I admit to some ignorance of her career, but from my limited perspective, seeing her performances botched by inscrutable kung fu editing and bad subtitling, it was almost a revelation to see her subdued and so movingly...human. (Same to be said for her contemporary Michelle Yeoh, by the way, in her non-Hong Kong stuff.) I'm a sucker for style and this film has some. Points for incidental 70's Brian Eno music snippets. I'm not a recovery expert and thusly do not subscribe to strict 12 step voodoo dogma, so I believed this character."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Rectangle Productions",
         "Haystack Productions",
         "Rhombus Media"
      ],
      "summaries": [
         "London-based Emily Wang gained minor notoriety from her VJ-ing on cable television. She is now more renowned for being the longtime girlfriend and pseudo manager of rock musician Lee Hauser, who seems to be on the brink of stardom. Those that know the couple believe she is a bad influence on him, and is the reason why he is a junkie. After Lee dies from an accidental heroin overdose and Emily is imprisoned for six months on possession charges, she learns that the courts have awarded custody of their young adolescent son, Jay, to Lee's aging parents, Albrecht and Rosemary Hauser, who live in Vancouver. A concerned Albrecht asks that she not attempt to see Jay for at least two years while she cleans up her act so as to give Jay a fighting chance at a decent life. Emily initially agrees, knowing that she is in no position to look after Jay. To regain her life, she decides to move back to her old stomping grounds of Paris. As Emily tries mostly unsuccessfully to become clean while eking out a living doing what she wants to earn money, which is primarily still in the realm of rock music, Rosemary poisons Jay's mind about his mother. Caught in the middle is Albrecht, who, out of personal circumstance, wants Jay to eventually have a relationship with his mother if only because he knows that he and Rosemary will not be able to look after Jay until adulthood and that Emily is the only other family he has.",
         "The former successful forty-two year old rock star Lee Hauser is decadent and his friends blame his wife Emily Wang for the fall in his career due to excessive use of drugs. Their son Jay is raised by his paternal grandparents Albrecht and Rosemary Hauser in Vancouver. When Lee dies of overdose in a motel room, Emily is sentenced to six months in jail. She moves to Paris where she unsuccessfully struggles to keep clean. When she decides to retrieve the guard of her son, she is supported by her father-in-law and finds the necessary strength to rebuild her life.",
         "Emily Wang is a woman who wrestles with her dream of becoming a singer, her fitness as a mother, and daily life without her partner Lee. Her past is riddled with drugs and regrets, the result of which left Lee dead in a desolate motel room in Hamilton, Ontario, and landed Emily with a six-month jail sentence. The only thing that she desires for the future is a loving relationship with her son Jay, who is being cared for by Lee's parents, Albrecht and Rosemary. While Rosemary blames Emily for the death of Lee, Albrecht recognizes the importance of the bond between a mother and her son, and his faith sets the standard for the faith Emily must find in herself. Clean follows Emily to Hamilton, Paris, London and San Francisco and in three languages (English, French and Cantonese), as she battles for a place in a world reluctant to forget the woman she has been and unwilling to accept her as the woman she longs to be."
      ],
      "budget": 4500
   },
   "movielensId": 32988,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "Français"
      ],
      "releaseDate": "2004-09-01",
      "dvdReleaseDate": "2006-07-18",
      "directors": ["Olivier Assayas"],
      "runtime": 111,
      "movieId": 32988,
      "title": "Clean",
      "mpaa": null,
      "actors": [
         "Maggie Cheung",
         "Nick Nolte",
         "Béatrice Dalle",
         "Jeanne Balibar",
         "Don McKellar",
         "Martha Henry",
         "James Johnston",
         "James Dennis",
         "Rémi Martin",
         "Laëtitia Spigarelli"
      ],
      "imdbMovieId": "0388838",
      "originalTitle": "Clean",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["FP_4aIenueM"],
      "plotSummary": "After losing her husband to a heroin overdose, Emily Wang fights to overcome her own addictions and to be reconciled with her estranged son.",
      "tmdbMovieId": 39851,
      "avgRating": 3.37324,
      "releaseYear": "2004",
      "numRatings": 71,
      "posterPath": "/7dW68j9wL9zPgmChoGXyLJ8a82c.jpg"
   }
}