{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "con man",
            "id": 3202
         },
         {
            "name": "slave",
            "id": 14906
         }
      ],
      "imdb_id": "tt0067763",
      "video": false,
      "title": "Skin Game",
      "recommendations": [
         42261,
         70387,
         117700,
         40715,
         15807,
         102081,
         40718,
         31901,
         21024,
         42077,
         36554
      ],
      "backdrop_path": "/csfazwY1ojvgZquN39tnxEUrMI9.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "59c4e119c3a3681454024877",
         "content": "Skin Con!\r\n\r\nSkin Game is predominantly directed by Paul Bogart and written by Richard Alan Simmons and Peter Stone. It stars James Garner, Louis Gossett Jr., Susan Clark, Brenda Sykes, Edward Asner and Andrew Duggan. Music is by David Shire and cinematography by Fred J. Koenekamp.\r\n\r\nSlavery era America and two interracial con-men travel from town to town duping white folk into purchasing black Jason O'Rourke (Gossett Jr,). After Quincy Drew (Garner) strikes a deal, with money in hand, the pair meet up later to scarper and split the profits. A nice con, that is until ladies and savvy outsiders enter the fray...\r\n\r\nA lovely Panavision/Technicolor production, Skin Game is a little remembered comedy Oater, not because it's poor, but more than likely because it has been shunted to one side due to what is now perceived as political incorrectness. Which is a shame, for although it doesn't fully exploit the premise it is working with, it's a very likable pic that's propped up by strong lead performances.\r\n\r\nAs the not so intrepid duo move from town to town, places with great names like Dirty Shame and Bitter End, a number of funny scenes keep things perky, be it bath time, Jason crying or the verbal jousting rumbling on, the comedy is subtle and easy to digest. The introduction of Clark lifts the pic higher, for she's a bigger rogue than Quincy and Jason, adding more cream to an already amusing pudding.\r\n\r\nIt's all very improbable as such, so we are not surprised when things inevitably go belly up, while the intention to probe the bile of the era in question doesn't make a telling mark. But the pros of the piece far outweigh the cons to give us a film worth tracking down. 7/10",
         "url": "https://www.themoviedb.org/review/59c4e119c3a3681454024877"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Quincy Drew / Capt. Nathaniel Mountjoy",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f31",
               "name": "James Garner",
               "profile_path": "/ek70DefEq6LZZX3JyUjJ125q63f.jpg",
               "id": 16896,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jason O'Rourke",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f35",
               "name": "Louis Gossett, Jr.",
               "profile_path": "/ggWZg5ADOjhMLqfr9canl7gNTGD.jpg",
               "id": 20959,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ginger / Miss Abigail Blodgett",
               "gender": 1,
               "credit_id": "52fe43f0c3a368484e006f39",
               "name": "Susan Clark",
               "profile_path": "/tQradyDXFaFWV1ZefFpwx3kr5Jm.jpg",
               "id": 40168,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Naomi (slave)",
               "gender": 1,
               "credit_id": "52fe43f0c3a368484e006f3d",
               "name": "Brenda Sykes",
               "profile_path": "/bX86rC74Z2QSsMOPffSpcZXWxKa.jpg",
               "id": 86367,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Plunkett (runaway slave hunter)",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f41",
               "name": "Ed Asner",
               "profile_path": "/nUnDLli9zmGQu6UCEU3G4FUdYqQ.jpg",
               "id": 68812,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Howard Calloway (plantation owner)",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f45",
               "name": "Andrew Duggan",
               "profile_path": "/j5HwdVtM59iK8YbBduV1Iqsq3DG.jpg",
               "id": 86368,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Sam Cutler (slave buyer in Fair Shake)",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f49",
               "name": "Henry Jones",
               "profile_path": "/hOO3CG2qUq6wvM4BkjtJ05kIU1C.jpg",
               "id": 5732,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mrs. Claggart",
               "gender": 1,
               "credit_id": "52fe43f0c3a368484e006f4d",
               "name": "Neva Patterson",
               "profile_path": "/iqFt5B09XmCdI8tXuR3Ayg3O0je.jpg",
               "id": 54682,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mr. Claggart",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f51",
               "name": "Parley Baer",
               "profile_path": "/dvy5JSM9F2lQZVBGuJvS1L1IcQi.jpg",
               "id": 86369,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Henry P.Bonner",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f55",
               "name": "George Tyne",
               "profile_path": null,
               "id": 34421,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "John Brown",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f59",
               "name": "Royal Dano",
               "profile_path": "/5kHyvS5Xaa97Lulrxy0ZgtqHqMI.jpg",
               "id": 19968,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "William",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f5d",
               "name": "J. Pat O'Malley",
               "profile_path": "/if8jAnsuARxFUy3k7PhaFqzHd9N.jpg",
               "id": 22602,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Uncle Abram",
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f61",
               "name": "Joel Fluellen",
               "profile_path": "/r8Vno7WxBENXDzbZMCkKX290ftb.jpg",
               "id": 86370,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Ned",
               "gender": 0,
               "credit_id": "52fe43f0c3a368484e006f65",
               "name": "Napoleon Whiting",
               "profile_path": "/sdHalZV8OGs0xS5ZKaW0a8EYwIC.jpg",
               "id": 86371,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Viney",
               "gender": 1,
               "credit_id": "52fe43f0c3a368484e006f69",
               "name": "Juanita Moore",
               "profile_path": "/xJrcIDUsk3VxZzJkop3C9HNkYFe.jpg",
               "id": 35658,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f6f",
               "name": "Paul Bogart",
               "profile_path": "/bJwRt7RbOPEGqTZsUmMdFjuFSY9.jpg",
               "id": 55146,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f75",
               "name": "Gordon Douglas",
               "profile_path": "/r6UZt0lLqgXHAG8GoN3NiWrnH5d.jpg",
               "id": 51677,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f0c3a368484e006f7b",
               "name": "Peter Stone",
               "profile_path": null,
               "id": 41712,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5807d008c3a36812a9003200",
               "name": "David Shire",
               "profile_path": null,
               "id": 8422,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5807d00fc3a3680bb3002ee4",
               "name": "Fred J. Koenekamp",
               "profile_path": "/yxTbBWproHj24o8yrTLEjtzlF9u.jpg",
               "id": 19102,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 2.548028,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20628,
      "vote_count": 12,
      "budget": 0,
      "overview": "Quincy Drew (Garner) and Jason O'Rourke (Gossett) travel from town to town in the south of the United States during the slavery era. Drew claims to be a down-on-his-luck slave owner who is selling O'Rourke as a slave. Quincy gets the bidding rolling, sells Jason, and the two later meet up to split the profit. Jason was born a free man in New Jersey and is very well educated.",
      "similar": [
         967,
         76649,
         32528,
         12437,
         9277,
         147441,
         256591,
         640,
         37861,
         205601,
         8952,
         11293,
         21755,
         290098,
         42661,
         11950,
         10141,
         9093,
         10779,
         12569
      ],
      "original_title": "Skin Game",
      "runtime": 102,
      "poster_path": "/qk03UsFublZCgbu8bepe1Xmlfcz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cherokee Productions",
            "id": 2418,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1971-09-30",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Would you buy a used slave from this man ?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Paul Bogart",
         "Gordon Douglas"
      ],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Peter Stone",
         "Richard Alan Simmons"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067763/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMDYxMjAwMF5BMl5BanBnXkFtZTcwNjMwOTgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Garner, Louis Gossett Jr., Susan Clark | See full cast and crew »"],
      "reviews": [
         "James Garner ever since he made his first big hit in the television series of Maverick refined the playing of a con man who's no better than he ought to be into a fine art. Quincy Drew is a further refining of the Bret Maverick character. James Garner can be serious when he wants to be, but I've always gotten the feeling he enjoys being Maverick or Jim Rockford far better than playing it straight. He has to enjoy it more, he's so darn good at it. Here he's got a racket going with Lou Gossett, Jr. During the days just before the Civil War in the 1850s he and Gossett work this con where Garner keeps buying and selling Gossett as a slave. Of course Gossett escapes and then they move on to the next town. Trouble is with that kind of a con, your reputation is bound to catch up with you. Gossett, who was born in New Jersey and is a free black man, gets a view of slavery he didn't bargain for. Along the way he meets Brenda Sykes. Garner also meets up with Susan Clark who's also a grifter. She aids him in his search for Gossett. Gossett and Garner don't exactly redeem themselves in the end, but you know this is not a racket they will be trying any more.",
         "And Lou Gossett with hair - Wow! But this comedy has a heavy load to carry, dealing with slavery & it's human cost. It's not much of a comedy when Jason actually gets sold into slavery and Gossett conveys the desperation very well. It does have it's light moments and Susan Clark helps lighten the load. I rated it an 8.",
         "James Garner's cowboy con man character familiarized to us as Bret Maverick and Latigo Smith (\"Support Your Local Gunfighter\" was filmed the same year) is in full bloom here as Quincy Drew in this classic, modest buddy movie done to a \"T.\" Paul Bogart (who also directed Garner in \"Marlowe\" two years earlier) directs with a sure hand, with Lou Gossett is excellent as Quincy's partner and amicable rival. Realistically set, made with confidence and mastery, it is a gem that does not aspire to \"great cinema\" but still scores a bullseye. Well-written dialogue, plenty of humor, and a nice, quick pace make it sparkle. Who knew Ed Asner could make a passably good villain, too?",
         "James Garner and Lou Gossett play Easterners who head west to con the gullible country folk in a scheme where Garner is a slave owner and Gossett is his slave whom he sells only to later escape together and then find another town. It's an interesting take on the institution of slavery, done as both comedy and drama, with an interesting portrayal of John Brown (played by Royal Dano in a full beard) storming into a Kansas town during a slave auction horsewhipping and shooting various people. In a film full of \"N\" words, Garner and Gossett keep the mood fairly light. However, when the game backfires Gossett is really sold into slavery and ends up on a Texas plantation owned by a rather cruel Andrew Duggan. The film goes into just enough whippings and violence to shock the viewer while also providing James Garner a familiar role he had perfected on TV's \"Maverick\" to sustain a lighter side as well.",
         "OK finally got to watch this previously unavailable James Garner Western. It was directed by Paul Bogart who was basically a TV director and it really shows since the film doesn't quite use all of the advantages available to a cinematic endeavor. The only other film that I've seen that I know of directed by Bogart is another Garner vehicle based on Raymond Chandler's private eye character called \"Marlowe\" which I've seen and liked, but not in quite a while. This film is probably the closest Garner ever gets in a film, that I've seen, to him reprising his Maverick persona when he his still young enough to pull it off, (he does so somewhat also, in the two Support Your Local... films with his cool wisecracking deliveries) but here he is actually playing a character Quincy Drew, who is a con man in the best Maverick Brothers tradition. The story circa (1857) deals with two con men Drew and Jason O'Rourke (Lou Gossett) a native of New Jersey, who we later discover met in a jail in Pennsylvania when O'Rourke was thrown into a cell next to Drew who was doing time for telling fortunes, its hilarious seeing Garner in a turban and fortune telling garb. They hit it off, and devise various different cons that they try out as a team until they hit on what they call the \"Skin Game\". This con consists of Garner riding into various Western border state towns Kansas, Missouri, etc., feigning poverty and as a result has to sell his best slave at an impromptu auction in the saloon, hotel, etc., etc. Susan Clark, plays a shady lady/pickpocket/con woman who targets the guys taking their money who eventually becomes Garners love interest. Ed Asner here, is in his villain period and he does a pretty good job as a slave catcher operating in the border area who eventually catches on to the con game. Gossett does a great job along with Garner & Clark. The film is entertaining and plays it safe and cutesy, but it could have been a whole lot better with a more creative and daring director, its reminiscent of Eastwood's self produced Malpaso Production films in that respect, Cherokee Productions is Garner's company. The what if's: If it would have shown Gossett & Garner's other various cons and how they stumbled upon the \"Skin Game\" con and had a better ending than the contrived one it does have it would been better. I'll give it a 7-8/10 mostly for its Maverick nostalgia value. Its a shame its not on TV in rotation with other Westerns on the various movie channels but I think the frequent use of the \"n\" word probably is the cause of its not being so. Its almost as if the mainstream media has decided that that period of American History has been dealt with enough and can be swept into the closet.",
         "This is a very funny movie, dealing with a very serious subject, but it's premise is not as far-fetched as you might think. After all we have heard about man exploiting his fellow man, can we doubt that there were con men who found a way to make money off slave owners, buyers and sellers? Look at what happened after Hurricane Katrina? Anyway, my point is that this should not detract from enjoying this movie because the premise is certainly as plausible as most other westerns. One thing that stood out to me in this film was the relationship between the characters played by James Garner and Lou Gossett. Even though the setting is the 1850's, their relationship is clearly one of equals. While Gossett complains about his role as the commodity being sold in their con game, it is clear that these two are equal partners in deciding how and where they will ply their trade. They share the rewards of their loot equally and when one is endangered, the other risks his life and freedom to rescue his friend. When one discovers new responsibilities that requires a complete change in his life, the other unhesitatingly - well, with only short hesitation - joins in. Gossett and Garner are such a good pairing that I wonder why they didn't do more films together. (Although Gossett did appear on \"The Rockford Files\" as a guest star.)",
         "I hadn't seen this film in years, perhaps since its theatrical run. It's still funny as hell and makes its serious points surprisingly well, especially since it's been 40 years (!) and social norms and rules have changed. This kind of role is undoubtedly what Garner did best, and he knew it. He left quite a legacy of performances like this. The film's ending is realistic (I wondered how they were going to squirm out of the circumstances.) Gossett's brief speech to Garner about them not being brothers (\"I can be bought and sold like a horse, and you can do the buying and selling\") rang true and put a much-needed limit on the film's levity. The supporting cast was good (What ever happened to Susan Clark?) and much of the dialogue sparkles. The subplot between Gossett and his young \"bride\" felt a bit forced and stilted, but on the whole this film straddles the gap between comedy, American history lesson and social commentary with grace.",
         "Though highly rated in the Leonard Maltin Film Guide, this comic Western isn't as popular as star James Garner's two other genre spoofs � Burt Kennedy's SUPPORT YOUR LOCAL SHERIFF (1969) and SUPPORT YOUR LOCAL GUNFIGHTER (1971) � but it's very much in the same vein. For the record, Garner had earlier collaborated with Paul Bogart (even if Gordon Douglas seems to have been involved as well at some point) on MARLOWE (1969), a failed attempt at a noir revival (and on which I'm kind of lukewarm myself); incidentally, I've just taped another thriller by this director � MR. RICCO (1975), starring Dean Martin � off TCM U.K. Anyway, while I was disappointed that the version I acquired of SKIN GAME was panned-and-scanned, I was glad to have caught up with it, as the film proved ideal lightweight/entertaining fare for the Christmas season; the same is true of the film I followed it with � coincidentally another Western comedy revolving around sparring partners, Texas ACROSS THE RIVER (1966), with Dean Martin himself and Alain Delon. This, in fact, has con-men Garner and Lou Gossett Jr. cleaning up small towns by having the two posing as master and slave � with the former purporting to sell the latter to the highest bidder and then have the black man run away to rejoin his pal (who, by this time, has already left)! This ruse has been kept up for quite some time (as seen in flashback) and it's garnered {sic} the duo a fair sum of money; however, things take a different turn when they run in, first, real slaves (which causes Gossett, born a free man, to rethink his situation) and, then, another con artist in Susan Clark (who targets Garner himself). Gossett even falls for a black girl who's to be sold at auction (where he too will be present) � so he asks Garner to buy her out of his share of the money�but the whole elaborate scheme is interrupted by the arrival of notorious anti-slavery crusader John Brown (played by Royal Dano)! Furthermore, after Garner and Gossett make the mistake of returning to one of the towns they had already 'hit', the former lands in jail and the latter (along with his lady friend) is sold off as a slave for real by unscrupulous dealer Edward Asner to despotic Southerner Andrew Duggan. Surprisingly sprung from jail by Clark herself, Garner determines to save his ex-partner: they too take up disguise, this time as preacher and nurse, and start visiting Asner's clients one by one claiming a slave of theirs is actually a leper! By the time they reach Duggan's mansion, Gossett has befriended (or, rather, learned to control via his spouting of mumbo-jumbo!) a group of African slaves who subsequently go along with them when our heroes, with their respective women in tow, take off for Mexico. Incidentally, this sequence also contains the film's biggest laugh-out-loud moment as Gossett, all dressed up to wait at the family table, is fondled by one of Duggan's pubescent daughters � causing him to jump and drop the contents of his bowl! While, as I said, the quality of the film's widescreen photography is somewhat compromised by the altered aspect ratio in this presentation (culled from a TV screening), David Shire's fine score retains all of its original impact � incidentally, being remarkably somber, it effectively counterpoints the breeziness generally on display.",
         "This 1971 film, \"Skin Game,\" is a so-so comedy, Western and romance. The plot is preposterous, but that's OK in comedy. The trouble with this film is that it's not that funny. I'm not distinguishing the scenes of slavery and mistreatment of people. But these aren't handled right for a comedy. The filmmakers could have had a great film had they rewritten the script and made the plot a clear satire. But instead, we have a couple of guys conning various gullible and dumb Southerners. The cast all are fine for their acting, but again, most of the attempts at humor fall flat. So, sans any real satire, this film comes off merely as a mild farce. Given that, it sends a message that crime is OK, so long as one steals from the gullible. Hmmm. Isn't that the ploy of most scams today? Too many people, especially older, get taken advantage of in this way. I'm sure they have a quite different idea about crime with comedy. In order to make comedy work with sensitive subjects, it's got to be clear and obvious satire or very strong farce. This version of \"Skin Game\" doesn't have that. At best, it's a weak comedy of characters. And, so I suppose the film folks would just tell those sensitive to slavery, derisive stereotypes, stealing and other things in here to just not watch the movie. Better still, watch a great true satire or comedy with lines and antics to make one laugh.",
         "Well, if you're going to make a comedy about two smart guys dealing with the horrible institution that was American slavery... this is probably the gold standard (whatever that might be for a comedy about slavery). Interesting that this came out several years before Blazing Saddles, yet was actually a far edgier comedy about race relations in the old West. That is to say, edgy in premise, not in execution: it's simply a light comedy about two con artists who get into trouble. Fans of Garner's \"Support Your Local...\" movies should enjoy this one a lot. James Garner is in top form here and Louis Gossett Jr. (credited as Lou Gossett) is very appealing. The best thing the script does is show us James Garner's character being a bit of a thoughtless jerk who doesn't quite understand his white privilege straight off, rather than having that \"surprise\" us in the middle of the film as a conflict-generating plot development. In a nutshell, the premise sounds terrible for a comedy, but it's actually not a terrible movie at all, but well done for its era (late Sixties/early Seventies farce)."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Cherokee Productions"],
      "summaries": [
         "Quincy Drew and his black friend Jason O'Rourke have pulled off every dodge known for conning a well-heeled sucker, but it wasn't until they hit on the old skin game that they started to clean up. The game is simple. Jason, though born a free man in New Jersey, poses as Quincy's slave as the pair ride through Missouri and Kansas in 1857. Quincy picks a likely mark in each town, sells Jason to him for top money and rides out of town. Then Quincy and Jason get back together on the road to another town, because if Jason can't just run off after dark, Quincy finds a way to spring him loose.",
         "In 1857, con man Quincy Drew and his black friend Jason O'Rourke swindle slave owners into buying Jason, who's a free man, and later share the profits when Jason escapes captivity."
      ],
      "budget": 0
   },
   "movielensId": 33051,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-09-30",
      "dvdReleaseDate": "2009-05-05",
      "directors": [
         "Paul Bogart",
         "Gordon Douglas"
      ],
      "runtime": 102,
      "movieId": 33051,
      "title": "Skin Game",
      "mpaa": "",
      "actors": [
         "James Garner",
         "Louis Gossett",
         " Jr.",
         "Susan Clark",
         "Brenda Sykes",
         "Ed Asner",
         "Andrew Duggan",
         "Henry Jones",
         "Neva Patterson",
         "Parley Baer",
         "George Tyne",
         "Royal Dano",
         "J. Pat O'Malley",
         "Joel Fluellen",
         "Napoleon Whiting",
         "Juanita Moore"
      ],
      "imdbMovieId": "0067763",
      "originalTitle": "Skin Game",
      "genres": [
         "Action",
         "Comedy",
         "Western"
      ],
      "youtubeTrailerIds": ["OKvAze3Sosc"],
      "plotSummary": "Quincy Drew (Garner) and Jason O'Rourke (Gossett) travel from town to town in the south of the United States during the slavery era. Drew claims to be a down-on-his-luck slave owner who is selling O'Rourke as a slave. Quincy gets the bidding rolling, sells Jason, and the two later meet up to split the profit. Jason was born a free man in New Jersey and is very well educated.",
      "tmdbMovieId": 20628,
      "avgRating": 3.35,
      "releaseYear": "1971",
      "numRatings": 10,
      "posterPath": "/qk03UsFublZCgbu8bepe1Xmlfcz.jpg"
   }
}