{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "treasure",
            "id": 1454
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "theft",
            "id": 14604
         },
         {
            "name": "barber",
            "id": 189368
         },
         {
            "name": "coins",
            "id": 199217
         },
         {
            "name": "stolen",
            "id": 199221
         }
      ],
      "imdb_id": "tt0194368",
      "video": false,
      "title": "Chain of Fools",
      "recommendations": [
         83489,
         80346,
         25697,
         18495,
         27224,
         73249,
         173541,
         126405,
         38132,
         68716,
         20551,
         26710,
         20983,
         35219,
         15148,
         79008,
         150889,
         97206,
         71357,
         14530
      ],
      "backdrop_path": "/yXH51DkBfsvvpQr384UGlKPcQYK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kolko",
               "gender": 1,
               "credit_id": "52fe43f3c3a368484e007a5d",
               "name": "Salma Hayek",
               "profile_path": "/u5mg73xKVqm8oT93HoMmsgQHyoK.jpg",
               "id": 3136,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Avnet",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a61",
               "name": "Jeff Goldblum",
               "profile_path": "/t812WlNdP6F2ksRj21JF68DUiwz.jpg",
               "id": 4785,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mikey",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a65",
               "name": "Elijah Wood",
               "profile_path": "/hHzLAVspGGuPg1KW5JAEsyRvnUT.jpg",
               "id": 109,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Andy",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a69",
               "name": "David Cross",
               "profile_path": "/aHSmsfJ48W59WlGB5ZiTjK67I0D.jpg",
               "id": 212,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bollingsworth",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a6d",
               "name": "Tom Wilkinson",
               "profile_path": "/4mxZKgdem0sQ8hJd0Y7TREwq7TJ.jpg",
               "id": 207,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Miss Cocoa",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a71",
               "name": "Orlando Jones",
               "profile_path": "/7QOW3bgYjPxnjwrZDclmnJenhPH.jpg",
               "id": 18270,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Paulie",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a75",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mr. Kerner",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a79",
               "name": "David Hyde Pierce",
               "profile_path": "/96qVGJhtV6tQkXmJVmbi6BBk1Ll.jpg",
               "id": 11076,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Kresk",
               "gender": 2,
               "credit_id": "52fe43f3c3a368484e007a8f",
               "name": "Steve Zahn",
               "profile_path": "/tcRHqtdi4wM8hlZ3MjPDWgePp7L.jpg",
               "id": 18324,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Karen",
               "gender": 1,
               "credit_id": "579aaf2b9251414cd9002e11",
               "name": "Lara Flynn Boyle",
               "profile_path": "/wAVWGJefzTgXWgop58H1ttHS5H6.jpg",
               "id": 6684,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Hitman",
               "gender": 2,
               "credit_id": "579aaf3f9251414cd9002e1e",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43f3c3a368484e007a7f",
               "name": "Pontus Löwenhielm",
               "profile_path": null,
               "id": 146847,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f3c3a368484e007a85",
               "name": "Patrick von Krusenstjerna",
               "profile_path": null,
               "id": 146848,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f3c3a368484e007a8b",
               "name": "Bix Skahill",
               "profile_path": null,
               "id": 146849,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56734166c3a3680712003a25",
               "name": "James Bamford",
               "profile_path": null,
               "id": 113194,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 6.75634,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20682,
      "vote_count": 26,
      "budget": 20000000,
      "overview": "An avid detective is assigned to investigate the heist of a batch of precious coins that end up in the hands of a suicidal barber.",
      "similar": [
         226,
         320,
         521,
         4771,
         6637,
         189,
         49524,
         10528,
         85,
         87,
         89,
         75780,
         1995,
         1996,
         217,
         949,
         979,
         2059,
         392044,
         49981
      ],
      "original_title": "Chain of Fools",
      "runtime": 96,
      "poster_path": "/5hGfNu04FlL8DDjoy4XF0MCtBMq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bel Air Entertainment",
         "id": 788,
         "origin_country": ""
      }],
      "release_date": "2000-09-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Why should smart people get all the money?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Pontus Löwenhielm",
         "Patrick von Krusenstjerna"
      ],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Bix Skahill"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0194368/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMjAxNDUzNV5BMl5BanBnXkFtZTcwNjM0NDcyMQ@@._V1_SY317_CR20,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Zahn, Salma Hayek, Jeff Goldblum | See full cast and crew »"],
      "reviews": [
         "This is basically a \"laugh at the losers\" episode flick in the vein of \"Short Cuts\", without the pretension and with a healthy dose of Quentin Tarantino thrown in for good measure (sans the nastiness and macho violence.) Chain of Fools boasts the essential (for this type of movie) array of crooks and oddballs; from Jeff Goldblum's psychopathic rent-a-thief character to Elijah Wood's adolescent aspiring hitman. The film is uneven, which is probably a result of the relative inexperience of the director(s). There are several scenes that just feel pointless, and the Bollingsworth character could have used a little polishing, but on the whole the movie is thoroughly enjoyable. Steve Zahn is great as the loser protagonist, Elijah Wood shines as the hitman wannabe, Jeff Goldblum turns in a solid performance and sexy Salma Hayek once again demonstrates she can do a lot more than just look pretty and dance with snakes. Chain of Fools is no Pulp Fiction, but it has got an endearing quality all of its own. If Tarantino and the Coen brothers were to do a movie together I imagine you would get something a lot like this. I give it 7/10, where Pulp Fiction is a 10/10 and The Big Lebowski is a 9/10.",
         "The Traktor team has been around a while, creating commercial spots for the media, now moving into directing film (none forthcoming, as one of them said yesterday at a promotional screening) and music videos (Fatboy Slim being the next victim), thus being newcomers on the scene of cinema, while they really are not. The film is as fractioned as \"Magnolia\", \"Pulp Fiction\" and \"A Life Less Ordinary\", but that may also be its stronghold. The film mostly circles a barber (Steve Zahn) whose wife (Lara Flynn Boyle) has just left him, when a nervous-looking gangster (Jeff Goldblum) enters the shop, asking for a haircut. Saying more than this would be spoiling the film a bit, as the plot is not presented chronologically, and it has to do with everyone trying to get hold of three very valuable Ming-dynasty coins. Many archetypes are displayed, e.g. the gangster, the hysterical ex wife and the stiff upper-lipped englishman (Tom Wilkinson), although some quite interesting characters are in place, e.g. a 17-year-old hit-man (Elijah Wood), a Police Inspector who has graced herself in Playboy (Salma Hayek) and a very nasty Timber Scout Leader (David Cross). The film loses tempo from time to time, but recaptures it with the help of the characters and the back-and-forth switching in time and place which makes up for the general lack of story. The film does appeal with its simplicity, and Zahn does a great job with playing the loser, as do others of the cast. The soundtrack is varied and tense, not giving away \"commercial spots\" for known artists, but alternative rock and some actionesque dance tracks. Making up for the dark humor of the film, there is a lot of slapstick and also wordplay, probably a stab at Quentin Tarantino's dialogue, but here it's more earth-bound and close to heart. You won't hear any \"Royale with cheese\"-drops here. All in all, this is a decent action/romance-film, although there is not much romance. There is more action in this film than in your general Hollywood ones though, giving way to a lot of different screening locations, a very varied spectrum of characters, dialogue that feels real, an OK story and a good soundtrack. Go see it as an easy-going action flick that presumably won't change your movie-going taste, but will leave you with the desire for more \"mainstream\" films striving for what \"Chain Of Fools\" has achieved.",
         "Ok, well, this wasn't a masterpiece or a greater work of art. But it sure was a very funny movie. A movie, which, given the right release, could have been a hit. It's a good script, a very hilarious one. The premise is nothing new. Just the story of a normal guy who, agains't his own will, get thrown into a bunch of impossible situations. I'll give this movie a 7. A perfect movie to watch with a bunch of friends. The only problem is finding it.",
         "This started off a little slow, but quickly accelerated to a very quick pace. It went so fast for the last two thirds of the movie that you really had to pay attention to get everything. The twists are great, and incredibly funny. The plot is pretty good, not brilliant but allows for some very funny twists, and some unbelievably funny, but fairly unlikely, very complicated, situations that will make you laugh for several minutes without stopping for a breath, provided that you like black humor. The actors all do pretty good jobs, even Elijah Wood, who I normally hate with a passion, pulled off an entertaining performance. There weren't really any of the actors I was heavily disappointed by. All of the characters were funny, in their own, twisted sort of way, most of them are either caricatures or stereotypes, but they work really well together. The humor was great, most of the time, though some of the jokes fell flat, but most of it was a treat for fans of black comedy(like me). The sparse number of action scenes there was, were really great. The movie has a very good fast pace throughout most of the movie, there was hardly any moment where I was bored. The movie has some scenes that take place on a non-linear timeline, especially in the beginning, but the moment these are over, the film finds a better pace. This is not to say that these scenes were bad, in fact I find them to be a great start to the film. Overall, the movie was quite good, but some of the humor seemed to be more there to shock than to amuse, some of it did seem over the top. It could have been better, had the humor been more balanced and had more of the characters been believable and likable. In the end, the movie has some great laughs, but that's about it. It's easily forgettable. I recommend this to pretty much any fan of black comedy. It's not the best, but it's a pretty good one. If you're not easily offended, and you like black humor, it's worth checking out. 7/10",
         "Recap: Kresk, struggling barber, recently divorced by his wife stumbles upon a secret when a gangster comes into his barbershop. This gangster, Avnet, was involved in a high profile theft last night involving three ancient Chinese coins. He thinks Kresk must die, fortunately fro Kresk Avnet stumbles and get Kresk's scissor in his neck. Now Kresk has a body to take care of. Unfortunately for Kresk, Kresk is not the brightest boy in town. And worse, neither is his friend Andy, full time scout, who he enlists for help. But as time goes, and things get worse, more and more people get involved, but Kresk is determined that those coins will change his life. For the better, he hopes. Comments: An unusual comedy/crime movie handling a lot of different subplots that runs at the sides of each others with a lot of intersections. What makes this unusual and imaginative is that what happens in a subplot we are not currently following has an impact how the story goes at the next intersection. At the same time we get the full coverage in time with a frequent use of flashbacks and jumps in the timeline. Still, it was never any problem to follow. The movie has a really big cast, and a lot of the names on the list are known. Goldblum delivers a solid performance as usual, Zahn is a great choice for Kresk. The best impression however I think I got from Elijah Wood who portrays a teen hit-man with finesse. I think it is the best performance from him I have ever seen. The director team Traktor has done a great work in their movie debut and I hope I will see more work from them like this one. 7/10",
         "This is truly an awesome movie, never hearing anything about this movie, i bought this one day thinking it might be good because of the awesome stars in this movie. I've told & asked a lot of people about this movie but no one has heard of this movie. I don't know why this wasn't big when it came out. Elijah Wood as hitman # 1 & Michael Rapaport as hitman # 2 were both great, they both acted terrific for the role they played, both stood out very well. Then there's a smaller role by David Cross who i've never heard of but was so hilarious in this movie. Tom Wilkinson as \"Bollingsworth\" hires Jeff Goldblum as \"Avnet\" to steal the \"Shiny New Enemies\" make a odd but funny team. Steve Zahn & Salma Hayek make a good team too. This was the first movie i ever saw of Steve Zahn, he is one of the best actors ive seen, i went on the watch some of his other awesome movies such as \"JOY RIDE a.k.a. \"ROADKILL\", \"SAVING SILVERMAN\" a.k.a. \"EVIL WOMAN\" & also \"NATIONAL SECURITY\" which is also funny. But overall \"CHAIN OF FOOLS\" was surprisingly a good movie, a lot better than i thought, its certainly in my top 250 movies of all time. I Give this a 9.5 / 10",
         "I found this movie 4 years ago on Italian pay-TV, it was very less advertised and I've seen it only because that night there wasn't nothing apart it, and it was with famous actors like Steve Zahn and Salma Hayek. And when it started, I read the others actors of the cast! One name better than the previous: Jeff Goldblum, Elijah Wood, Orlando Jones, Tom Wilkinson, David Cross. This is a good point to start watching a unknown movie: discover a beautiful cast. Then, the movie, obviously. I love black comedy and generally all the movie with a lot of different characters which want the same thing(s), like Snatch, Big Trouble\u0085 And this one is absolutely the best. It's very funny, which is a very hard thing to find nowadays, few times banal, and it has a tremendous pace (in 1 hour and 35 minutes happens everything you can imagine). Moreover the plot begin almost at the end of the history, and then it's a flashback followed by another flashback, and so for all the actors, but, that is the best thing about this movie, it's never really hard to figure out and, although it is complex, it's easy to rebuild the history, which is globally believable. It's quite clean (not like the majority of black comedies), unfortunately it has a large number of dirty words (in the Italian version I've counted more of 70 of them), but they are proportionate at the characters. So, isn't a deep movie to think about something, it's the better way to relax yourself sometimes. Discover it, because isn't famous at all!",
         "The movie opens on March 9 in Sweden. The team behind the movie, Traktor, are Swedish and therefore the world premiere is in Sweden. The celebrity premiere, yes there are such in Sweden too, was tonight at 7PM, and Traktor was presenting the movie. Jeff Goldblum should have been at the gala, but had to be in NYC to shoot a new film. He said hello in a very special way, with a short recording just for the gala audience, where he was doing jokes, singing \"drinking songs\" and wishing he had some Swedish Herring. Chain of Fools is Traktor's first movie. They have done tons of commercials, but never a movie. Chain of Fools is their first stab at the silver screen - and man, what a good way to become immortal. Steve Zahn is down on his luck, well, a loser. He is doing nothing, just being a loser... but by accident he get into both this and that. The movie is smart and moves from one thing to another and back again. The way the story is described and played in the movie, is similar to \"Pulp Fiction\", \"O'Brother\", \"Numbers\" and \"True Romance\". It's a blend, but you will feel right at home if you enjoyed those flicks. A dark, whacky and sarcastic humor poors out of the film. Bottom line, I highly recommend this movie if you are into the earlier mentioned - even though the concept doesn't feel as fresh any more.",
         "Chain of fools is just funny and crazy! I've bought the dvd, cause i wasn't able to find anyone having or even knowing this little film. And i cannot understand this! This movie is sooo underrated! The story is about Kresk, a real loser, played perfect and really funny by Steve Zahn, and what happens to him after he has heard about a real good plan to get a lot of money. His wife left him, he is very bad in his job as a barber, his friends are crazy, his sisters son hates him, and everything goes wrong for him, so he has nothing to loose! And on one very bad day, the story beginns...and goes on funny, strange and, ok, sometimes a little unrealistic. The cast is brilliant. Steve Zahn looks so crazy, and plays his character very good. Salma Hayek, playing good too, is just hot in here. Orlando Jones as Drag-Queen - oh my god! And Elijah Wood in a not so typical role for him - a teenage killer - or should i say \"wanna-be-killer\"! If you like crazy and funny films with great actors, you would like to see in their maybe funniest roles ever, go and rent this little film! 8/10",
         "This is a really funny one. The story starts in a slow tempo, but through the film it gets faster and faster. The characters is mostly touching the line of becoming hysterical. I laughed at Elijah Wood when to cowardly to bring the jobs he is hired for to an end. He plays the part of a professional killer but the only thing he wants is a friend. (I've never seen him so tough as in those 'braging scenes' in the hotel room. He's a true fighter there). Salma Hayek is the serious, but sexy, cop. She is one of the highlights in the whole film. Waiting for sex she discover a gun in the hairdresser's drawer. And solve the case. Wow, she is very sharp-sighted. And not to forget: Jeff Goldblum, the arrogant and conceited gangster, which is getting a par of scissors in his throath and still manage to survive. The Swedish director group Traktor did made one of the most surprising motion pictures in 2001. Don't think it would have been better if the actors hade been from Sweden. By the way, did some of you get a chance to see it at cinema?"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Bel Air Entertainment",
         "City Block Productions",
         "Lord-Weaver"
      ],
      "summaries": [
         "\"Chain of Fools\" is a heist comedy-romance about a hapless barber whose life takes a turn for the worse when he ends up in possession of a stolen treasure of ancient coins (the \"Shiny New Enemies\") and simultaneously falls on the wrong side of the law and in love with the detective investigating the crime.",
         "Salma Hayek plays an avid detective assigned to the heist of a batch of precious coins that end up in the hands of a suicidal barber."
      ],
      "budget": 20000000
   },
   "movielensId": 3323,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-09-22",
      "dvdReleaseDate": "2005-02-15",
      "directors": [
         "Pontus Löwenhielm",
         "Patrick von Krusenstjerna"
      ],
      "runtime": 96,
      "movieId": 3323,
      "title": "Chain of Fools",
      "mpaa": "R",
      "actors": [
         "Salma Hayek",
         "Jeff Goldblum",
         "Elijah Wood",
         "David Cross",
         "Tom Wilkinson",
         "Orlando Jones",
         "Kevin Corrigan",
         "David Hyde Pierce",
         "Steve Zahn",
         "Lara Flynn Boyle",
         "Michael Rapaport"
      ],
      "imdbMovieId": "0194368",
      "originalTitle": "Chain of Fools",
      "genres": [
         "Action",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["M0XoGxvQjes"],
      "plotSummary": "An avid detective is assigned to investigate the heist of a batch of precious coins that end up in the hands of a suicidal barber.",
      "tmdbMovieId": 20682,
      "avgRating": 3.11667,
      "releaseYear": "2000",
      "numRatings": 90,
      "posterPath": "/5hGfNu04FlL8DDjoy4XF0MCtBMq.jpg"
   }
}