{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0395173",
      "video": false,
      "title": "Unconscious",
      "recommendations": [
         46902,
         36115,
         55151,
         83909,
         211879,
         46851,
         121883,
         246166,
         107288,
         214157,
         83461,
         118943,
         51145,
         71336,
         25985,
         160946,
         95380,
         183784,
         81611,
         109048
      ],
      "backdrop_path": "/jooz9CeycUCDVzicSrBygIlIsJt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alma",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f37e7",
               "name": "Leonor Watling",
               "profile_path": "/lFOK1qKWqXOnJHFrz4MmuiSzpBP.jpg",
               "id": 101,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Salvador",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f37eb",
               "name": "Luis Tosar",
               "profile_path": "/tRNvw26QeN80JwWHoamk262hjjq.jpg",
               "id": 16867,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sra. Mingarro",
               "gender": 1,
               "credit_id": "52fe463ac3a36847f80f37ef",
               "name": "Mercedes Sampietro",
               "profile_path": "/nznPYNH6DlbY3SkYNbpsofIpWOc.jpg",
               "id": 19820,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Mira, Alma's father",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f37f3",
               "name": "Juanjo Puigcorbé",
               "profile_path": "/aXY1WST4yZS8Qlfeb2PB5AWHJSS.jpg",
               "id": 87245,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dr. León Pardo",
               "gender": 2,
               "credit_id": "52fe463ac3a36847f80f37f7",
               "name": "Àlex Brendemühl",
               "profile_path": "/cJGbHVMlSkYsSfmdk1wduOJqUxL.jpg",
               "id": 28514,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Olivia",
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f37fb",
               "name": "Núria Prims",
               "profile_path": "/yWw23IjrAMwBdmU5sJAFTMQxvYX.jpg",
               "id": 143172,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Tórtola",
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f37ff",
               "name": "Ana Rayo",
               "profile_path": "/5AapQ5rt2jeZf0xktKD4GRX7fgJ.jpg",
               "id": 143173,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe463ac3a36847f80f37e3",
               "name": "Joaquín Oristrell",
               "profile_path": "/kunRcZMagGoTsZW2r3WoShD86vK.jpg",
               "id": 43317,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "563e108a9251414c7000aac8",
               "name": "Joaquín Oristrell",
               "profile_path": "/kunRcZMagGoTsZW2r3WoShD86vK.jpg",
               "id": 43317,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "563e1099c3a3681b6102c0cb",
               "name": "Teresa Pelegri",
               "profile_path": null,
               "id": 46851,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "563e10a69251413b1300c97f",
               "name": "Dominic Harari",
               "profile_path": null,
               "id": 46852,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.821237,
      "production_countries": [
         {
            "iso_3166_1": "PT",
            "name": "Portugal"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 43271,
      "vote_count": 15,
      "budget": 0,
      "overview": "A Freudian comedy set in Barcelona, 1913, that playfully questions sexual taboos through a Sherlock Holmes-style investigation.",
      "similar": [],
      "original_title": "Inconscientes",
      "runtime": 100,
      "poster_path": "/qGZbzrEWRgAdw8r5YiRiULPk63O.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "EMC Assets",
            "id": 67333,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tornasol Films",
            "id": 7680,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Messidor Films",
            "id": 14245,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Madragoa Filmes",
            "id": 11143,
            "origin_country": "PT"
         }
      ],
      "release_date": "2004-08-27",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Uncover Hidden Desires.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joaquín Oristrell"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Dominic Harari",
         "Joaquín Oristrell"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0395173/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1ODg0NTAwOV5BMl5BanBnXkFtZTcwOTg5NjA1MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leonor Watling, Luis Tosar, Àlex Brendemühl | See full cast and crew »"],
      "reviews": [
         "Joaquín Oristrell abandons his usual contemporary urban comedies to write and direct this delightful period comedy that takes place in Barcelona in the early 20th century. With the beginnings of psychoanalysis as a leit-motiv and background, brother and sister-in-law Salvador and Alma get involved in a charming quest for the truth. Leonor Watling is simply outstanding as nine-months pregnant Alma, a neurotic yet lovable character that lets Watling show her great skill as a comedienne. In his first truly comedic role, Luis Tosar passes the test and confirms himself as one of our greatest actors. The couple show a great chemistry together, almost a rarity in most films today. Joaquín Oristrell is to be praised for his directorial work, since he's been getting better with each film since his debut with the average \"De qué se ríen las mujeres\". With \"Inconscientes\" he has a achieved an entertaining, technically perfect and engaging film. Overall rating: 8/10",
         "When Freud is going to visit Spain, the most known psychiatric doctor disappears and his wife and his brother-in-law start a research in his last cases in order to discover what has happened to him. With a tendency to absurd all the cases presents us a group of crazy people obsessed with something: sex. The research will continue as they both discover things about themselves that they didn't know, all mixed with great and funny jokes and a delicious script that makes the spectator to enjoy himself during all the time of the film. In addition to being funny, actors are very good and they make great parts. This is a great comedy, ideal to laugh a lot as we think about our taboos in our lives; unluckily, this great film has passed by totally undiscovered for most of the Spanish people and it has not had the success it deserves. I highly recommend to see it in order to spend a great, funny time.",
         "Unconscious, which just had its international (outside of Spain) premiere at the Toronto Film Festival, is a very good comedy/mystery. The art direction is very convincing, the dialogue is charming and fast paced and the plot twists are satisfyingly unpredictable. The Spanish cinema is blessed with a broad selection of films that focus on early twentieth century Spain, and this is a welcome addition to that group. It also features a strong comedic performance from Leonor Watling (from Almodovar's Talk to Her) who richly deserves an increased amount of recognition on the international cinema scene. Luis Tosar also does a very fine job as Salvador, the somewhat hapless male lead.",
         "I saw this at Sundance and enjoyed it very much. It is a clever farce involving physical comedy as well as satire. The main target of the movie appears to be Freud, but there are other psychoanalysis jokes as well. For me, the performances of Luis Tosar and Leonor Watling made the movie sparkle. The two of them have chemistry that transcends language. The dialog was fast paced and the script was smart and crisp. The two leads find themselves in increasingly goofy situations until the final climax where the mystery is solved. I think that this was the best of the 12 films I saw at Sundance this year, and I am hoping that the DVD comes out soon so I can see it again! (This is not a movie for kids; perhaps older teens will enjoy it. It is in Spanish with subtitles, so those who do not like to read subtitles be warned)",
         "I normally reserve 10 out of 10 to films that really mark me. Films that make one think or learn something new. Yet I think this film deserves a 10 for being an excellent comedy, excellent script and having excellent dialogs. Rarely have I seen such a well rounded film. It lacks nothing and delivers much. I loved the main female character \"Alma\" and she sweeps us into the story with her unlikely companion, a very stiff and uptight brother in law. One also gets a feel for the time period when many new theories and thinkers were coming of age... of the new revolutions to be, conservative Spain and sexuality of the period. Even if in a comic way. I highly recommend this film. Have a good laugh at psychology, passion and self analysis.",
         "UNCONSCIOUS (Inconscientes) is a stylish little Spanish film form the minds of writers Dominic Harari and Joaquín Oristrell, a tongue in cheek look at the influence of Sigmund Freud on social behavior at the fin de siecle in Spain. Not only is the story highly entertaining as a comedy, the production values and creative direction by Joaquín Oristrell make this a must-see for lovers of European art films. The story is a bit convoluted, but then the title suggests that in the first place! If there is a line of continuity it is the effect of Freud as the one who peeped into the privacy of our lives and the strange findings he discovered. Very pregnant Alma (the always beguiling Leonor Watling) is missing her psychiatrist husband and engages the aid of her brother-in-law Salvador (Luis Tosar) to find him. Alma's sister Olivia (Núria Prims) suspects a tryst between Alma and Salvador, adding a bit more mystery to the story. The discoveries made about each of the highly assorted groups of players in the drama are made in the oddest of places - a men's steam room/gym, a transvestite ball (in which many of the characters' form the outside world are found to have very special needs!), and in places throughout the picturesque Barcelona. There is no particular resolution to this quasi-plot: the joy is in the telling of the story, and that is a total pleasure to watch. The very large cast is uniformly exceptional and the creative aspects of the shifting of the various components of this storybook tale are as fine as have been seen in recent cinema. This is comedy border but not becoming slapstick and it is served up delectably! In Spanish and German with English subtitles. Grady Harp, November 07",
         "This is the story of a woman (Alma) and a man (Salvador), who are sister&brother in law, who try to find Alma's husband (Leon) through Leon's psychiatry thesis. Firstly the movie has a real great package, it is really great fun to watch all the things to resolve, it does not bore the viewer so one can stay focused easily. the shooting is really great, there is a good consistency among the costumes, settings and other tools. the movie is really successful to create that times environment. Most importantly the package is not empty, it's full of very interesting characters, a very interesting detective story, very sharp criticism for today's world and lot's stuff about psychology and psychiatry; and also there are qualified stuff that makes you laugh sincerely. an unaware viewer about the subject learns really useful stuff about Freud, Jung and etc. Script of the movie is really successful, every minute you find something new to discover. Music is really fantastic. Actors are very successful while creating and playing the characters, it is real fun to watch them fly over the curtain. Through the whole movie you appreciate (or adore) the director (and also screenwriter), but the credits really prove that the director is a genius. The only problem maybe the some mimics and acts of the actors may look strange, but the reason is that Spanish (and also Italian) acting has some differences other than the acting that most viewers got used to. I hope you all watch and understand what i mean. You'll be grateful that such a movie exists after watching 'Inconscientes' (Unconscious). (By the way the love story in the movie is really in its dose and not that kind of cheap love story in 'Pearl Harbor', 'Titanic' or 'SW: Attack of the Clones'. I guarantee you'll be satisfied.) Have Fun!...",
         "So I got to see this movie at the Sundance Film Festival and I'll admit, I bought tickets to this film because it was in Spanish and I wanted to practice my skills in that language, but, man, was I more than pleasantly surprised by this film. It was hilarious and beautiful and did I mention hilarious and beautiful? The set decoration was amazing, as was the costuming and cinematography, they were all so Art Nouveau and muted with amazing decoration, even if you don't like the story, you'll appreciate the visual beauty of the film. The story itself is so crazy and complicated that I don't think I could explain it, other than it makes fun of Freud, Spanish society pre-WWI and all sorts of other institutions and will make you laugh out loud, even if you don't speak Spanish. I wouldn't recommend this film to younger children, some teenagers might appreciate it, it's engaging enough to hold their attention, but they might not understand all of it. Overall, I would recommend this to anyone who enjoys film and fun.",
         "This is a Freudian comedy set in Barcelona , 1913 . The picture concerns on Alma (Leonor Watling), her hubby Doctor Leon Pardo (Alex Brendemuhl) is a psychiatrist and follower of theories about sexuality and hysteria by Sigmund Freud . Her brother-in-law is Salvador (Luis Tosar) and married to Olivia (Nuria Prims), daughter of a famous psychiatrist (Juanjo Puigcorbe) . He is lustfully wishing to Alma . As Leon leaves her about to give birth and both start to investigate . The only tracks they get is a manuscript and going on a successive intrigues where are blended dangers , homosexual ball , brothels and a twisted ending . This is a fun Spanish movie that playfully questions sexual taboos through a Sherlock Holmes-style investigation . This is a hilarious film and a sexual costumer comedy . Humor is sometimes cheesy and gross-out with numerous naughty and picaresque situations such as sex jokes , adulteries , incest and adult scenes . The plot is ridiculous and embarrassment but has its sympathetic moments here and there and is formed by some humor set-pieces that divide the action in diverse episodes . The movie is well set on Barcelona 1913 , Art Deco and modernism epoch , such as is magnificently reflected into palaces , houses and rooms . The picture is starred by Leonor Watling (The bad education, Talk to her, Desire) , an Almodovar girl, she makes an enjoyable acting ; Luis Tosar (Mondays in the sun , Thirteen chimes) is miscasting but he is a serious actor no apt for comedy . Both of whom are making an American career , she with ¨My life without me¨ and Tosar with ¨Miami vice¨ . The motion picture was regularly directed by Joaquin Oristrell (No shame) but most famous as writer (Love causes seriously damage your health , Off Key , Between your legs , Extasis). The flick will appeal to Spanish cinema fonds . Rating : average but entertaining.",
         "In today's cinema it is rare to find a movie that is balanced; at the same time entertaining and intelligent. Although many will find this film a bit claustrophobic due to its topic and many references on Freud, I believe that its sparkling humor and humanistic moral will come through. Acting is superb, with two really fantastic leads. Being a fan of Art Nouveau and Barcelona it was a treat to watch it (admittedly, the thing that caught my attention about this movie was its Klimt-esquire poster). Direction is also great, since it takes loads of talent to keep a film like this from becoming an empty farce. Infectious as it is, it may cause symptoms such as immense craving for Freudian psychology, increase of interest in Spanish cinema and temporal philanthropy."
      ],
      "genres": [
         "Comedy",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Tornasol Films",
         "Messidor Films",
         "Madragoa Filmes"
      ],
      "summaries": [
         "Barcelona, 1913. Alma is perhaps one of the most modern women of her day.Her husband, Dr. Leon Pardo, is a psychiatrist. This summer, he visited Vienna and became a follower of the revolutionary Dr. Sigmund Freud and his advanced theories about hysteria and sexuality. It all starts the afternoon Alma comes home and finds her husband in tears, about to disappear from her life and everyone else's. Giving no more explanation than a few incoherent mumbles, Leon runs off, leaving Alma alone and about to give birth. Salvador is Alma's brother-in-law and a psychiatrist as well. He is much more conservative man than Leon, is deeply in love with Alma. The only clue they have is a manuscript about hysteria and female sexuality based on four patients: An actress with a persecution complex; a psychotic woman who tried to murder her husband; a woman with a serious crisis concerning her sexual identity; a stranger who has discovered a terrible secret about her past. Following those signs, Alma and Salvador start a Sherlock Holmes kind of adventure, where hypnosis, love, danger, and every imaginable taboo are all intertwined.",
         "A Freudian comedy set in Barcelona, 1913, that playfully questions sexual taboos through a Sherlock Holmes-style investigation.,"
      ],
      "budget": 0
   },
   "movielensId": 33363,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2004-08-27",
      "dvdReleaseDate": null,
      "directors": ["Joaquín Oristrell"],
      "runtime": 100,
      "movieId": 33363,
      "title": "Unconscious",
      "mpaa": null,
      "actors": [
         "Leonor Watling",
         "Luis Tosar",
         "Mercedes Sampietro",
         "Juanjo Puigcorbé",
         "Àlex Brendemühl",
         "Núria Prims",
         "Ana Rayo"
      ],
      "imdbMovieId": "0395173",
      "originalTitle": "Inconscientes",
      "genres": [
         "Comedy",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": ["MjPz3sLWMgs"],
      "plotSummary": "A Freudian comedy set in Barcelona, 1913, that playfully questions sexual taboos through a Sherlock Holmes-style investigation.",
      "tmdbMovieId": 43271,
      "avgRating": 3.52632,
      "releaseYear": "2004",
      "numRatings": 19,
      "posterPath": "/qGZbzrEWRgAdw8r5YiRiULPk63O.jpg"
   }
}