{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "underdog",
            "id": 240
         },
         {
            "name": "secret society",
            "id": 2908
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "pistol",
            "id": 13132
         },
         {
            "name": "self esteem",
            "id": 155023
         }
      ],
      "imdb_id": "tt0342272",
      "video": false,
      "title": "Dear Wendy",
      "recommendations": [
         69054,
         36090,
         70410,
         62778,
         110761,
         263112,
         26841,
         86431,
         50950,
         291964,
         110928,
         64074,
         37621,
         49340,
         64714,
         83234,
         69916,
         62616,
         214157,
         172878
      ],
      "backdrop_path": "/mhzsJrCKmznl0CLsXuqaLgCyN8L.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dick Dandelion",
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f10f",
               "name": "Jamie Bell",
               "profile_path": "/7HgepK5YE8u0xrv3lJZjaEoENwl.jpg",
               "id": 478,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Krugsby",
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f113",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Freddie",
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f117",
               "name": "Michael Angarano",
               "profile_path": "/zNoj0cJHoD8RPUDOgTpVgJ0KcXM.jpg",
               "id": 11665,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sebastian",
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f11b",
               "name": "Danso Gordon",
               "profile_path": "/rgASd05kYCFjItn9dNk9Qj99Z5F.jpg",
               "id": 67453,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Susan",
               "gender": 1,
               "credit_id": "52fe43cf9251416c7501f15b",
               "name": "Alison Pill",
               "profile_path": "/lPH5UP2bRPat7Fxd3YTUH0wAjus.jpg",
               "id": 17486,
               "order": 4
            },
            {
               "cast_id": 23,
               "character": "Huey",
               "gender": 2,
               "credit_id": "5561c3649251414a5f000c06",
               "name": "Chris Owen",
               "profile_path": "/1E23sADcIzpaRhsUHiAWMfvOPFm.jpg",
               "id": 26999,
               "order": 5
            },
            {
               "cast_id": 24,
               "character": "Stevie",
               "gender": 2,
               "credit_id": "58d9b42cc3a368126f06f12b",
               "name": "Mark Webber",
               "profile_path": "/s7QzjQ8qiaN7P2MSMa5NWkmefbd.jpg",
               "id": 4451,
               "order": 6
            },
            {
               "cast_id": 25,
               "character": "Clarabelle",
               "gender": 1,
               "credit_id": "58d9b441c3a3681289077ced",
               "name": "Novella Nelson",
               "profile_path": "/bAx0RY3x9ljh3Fwo8Xy4OlzIkVp.jpg",
               "id": 55272,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f121",
               "name": "Thomas Vinterberg",
               "profile_path": "/1lChKBPVLqbn7Kl8lHghybBVzgw.jpg",
               "id": 4453,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f127",
               "name": "Lars von Trier",
               "profile_path": "/nuPnYmzGuGwFvKF4LBakUehr4Nh.jpg",
               "id": 42,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43cf9251416c7501f12d",
               "name": "Bo Ehrhardt",
               "profile_path": null,
               "id": 67454,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43cf9251416c7501f133",
               "name": "Peter Garde",
               "profile_path": null,
               "id": 19353,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43cf9251416c7501f139",
               "name": "Birgitte Hald",
               "profile_path": null,
               "id": 1559,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f13f",
               "name": "Peter Aalbæk Jensen",
               "profile_path": "/9Zpmo9qyvyH6ZTO61VsJvQLbBx9.jpg",
               "id": 1174,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43cf9251416c7501f145",
               "name": "Sisse Graum Jørgensen",
               "profile_path": null,
               "id": 1015,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f14b",
               "name": "Benjamin Wallfisch",
               "profile_path": "/dWcshjk0OUi3stGFFrwZIsYKZfQ.jpg",
               "id": 40825,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43cf9251416c7501f151",
               "name": "Anthony Dod Mantle",
               "profile_path": "/wpdk8Wo8xGhvZ4WVee2miDSfPj8.jpg",
               "id": 1570,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43cf9251416c7501f157",
               "name": "Mikkel E.G. Nielsen",
               "profile_path": null,
               "id": 64954,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5561c239c3a36868e5008d99",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5561c24c9251414a5f000bd8",
               "name": "Joyce Nettles",
               "profile_path": null,
               "id": 3922,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5561c2849251415012000436",
               "name": "Karl Júlíusson",
               "profile_path": null,
               "id": 6795,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5561c2a59251417e51008ac8",
               "name": "Jette Lehmann",
               "profile_path": null,
               "id": 71161,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5561c2cf92514171ab001add",
               "name": "Peter Menne",
               "profile_path": null,
               "id": 40560,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5561c2e6c3a36820c6001b6f",
               "name": "Annie Périer",
               "profile_path": null,
               "id": 37636,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5561c3079251414a5f000bf3",
               "name": "Zoe Morgan",
               "profile_path": null,
               "id": 1427849,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.654139,
      "production_countries": [
         {
            "iso_3166_1": "DK",
            "name": "Denmark"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 10913,
      "vote_count": 42,
      "budget": 0,
      "overview": "In a blue-collar American town, a group of teens bands together to form the Dandies, a gang of gunslingers led by Dick Dandelion. Following a code of strict pacifism at odds with the fact that they all carry guns, the group eventually lets in Sebastian, the grandson of Dick's childhood nanny, Clarabelle, who fears the other gangs in the area. Dick and company try to protect Clarabelle, but events transpire that push the gang past posturing.",
      "similar": [
         44564,
         23168,
         40807,
         41630,
         13,
         19913,
         50544,
         277547,
         290762,
         397422,
         13523,
         226,
         62211,
         9472,
         862,
         72105,
         28178,
         489,
         68718,
         8839
      ],
      "original_title": "Dear Wendy",
      "runtime": 105,
      "poster_path": "/2IF19Tcx5D9d8iUWa0PxFhO6MYZ.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zentropa Entertainments",
            "id": 76,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lucky Punch",
            "id": 43271,
            "origin_country": ""
         },
         {
            "logo_path": "/26JWW5ooRJoQBolVjG0x8SZmFRs.png",
            "name": "Nimbus Film Productions",
            "id": 11672,
            "origin_country": ""
         }
      ],
      "release_date": "2005-01-22",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "One shot is all it takes.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "DKK ",
      "directors": ["Thomas Vinterberg"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Lars von Trier"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0342272/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkyMDIxMzY4Ml5BMl5BanBnXkFtZTcwNTE2NTgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jamie Bell, Alison Pill, Chris Owen | See full cast and crew »"],
      "reviews": [
         "\"Dear Wendy\" comes from the talents that brought us \"Festen\" and \"It's All About Love\" (both written and directed by Thomas Vinteberg), \"Dogville,\" \"Dancer in the Dark\" and \"Breaking the Waves\" (written and directed by Lars Von Trier). They have collaborated on Dear Wendy, with Vinteberg at the helm and penned by Trier. This is my favorite kind of movie; it begins with a \"what if...\" premise, which the storytellers follow with relentless commitment. In this case, the premise is \"what if some misfit kids fell in love with their guns.\" Well, they'd give them names, they'd practice shooting and have a secret clubhouse, they'd study the famous gun-toting heroes of old, and the relationship they have with their weapons would become a mirror for their relationships with the world. All of which are pursued beautifully in the film. Quite a few American movie critics read this film as a critique of American society, and they resent a European making a film about small-town America. An oft-vented complaint is that Trier has no business criticizing a country which he's never actually visited. I don't think, however, that this is ultimately a film about guns; the relationship these kids have with their guns is simply a unique window through which the filmmakers have chosen to show us the rich inner lives of the protagonists. They could have used a dysfunctional family (Festen), or movie musicals (Dancer In The Dark) or a tolling church bell (Breaking The Waves) to show us that world - but in this case it's guns. Within the limits of the film medium - 10,000 words of dialog and around 140,000 frames of film - the choices of the filmmaker often revolve about what to leave OUT rather than what to put IN. This is a film that could be used as a textbook for economists. The script is tight - not a word out of place, although the narration feels conversational and casual. A film about child misfits and their guns could easily follow thematic red herrings all over the place in pursuit of social commentary, but \"Dear Wendy\" is utterly restrained - in spite of the \"loaded\" subject matter. On the cutting room floor are social commentary, cliché, and many of the cinematic crutches which Trier and Vinterberg rejected in their Dogme 95 days. Any film lover who cares to see a film utterly committed to its premise, a film made with economy and efficiency, a film full of sweet irony, a film of deceptive simplicity, would do well to check out \"Dear Wendy.\"",
         "This flick, with its subtle views on America's obsession with weapons, is likely not going to be a crowd pleaser. One of the main reasons for this is the films use of highly symbolic mise-en-scene takes several viewings to fully appreciate. Another reason for the let down is that some might be inclined to want more action for a movie that centralizes on guns. However, this movie is brilliant. The shot composition, the editing, the acting-this movie is very well pieced together. Also, as for the meaning of the movie, it goes in a direction that is a really provocative and fresh. I would highly recommend that you give this movie a chance, and keep an open mind. I have never been a fan of the director of this film or the writer, but I was deeply pleased by this film.",
         "I went into this film extremely hesitant. I don't know Vinterberg well, but I do know there isn't much about Lars that I like at all. Top that with a subject matter that I'm rather sensitive about as well. But the film was beautifully filmed and the performances were enjoyable. I enjoyed all of it. I disagree with critics who say the film attacked America or had a heavy-hitting message in it. I think it's subtler than that. For me it was the big surprise of Sundance 05. Rich and fun. In the script, the characters were twice as old as those in the film, and I think Vinterberg made a wise choice in changing that. What is powerful in a teenager can look dorky in a 30-something.",
         "All of this recent fuss about David Cronenberg's film, \"A History of Violence.\" What rot. You want a good film about violence and the gun culture in America? Check out this little gem from the co-founders of Denmark's Dogme 95 movement: Thomas Vinterberg (\"The Celebration\"), who directed this film, and Lars von Trier, who wrote the screenplay. Von Trier drives many American film critics absolutely bonkers because he has the temerity to make films about the \"American Character,\" even though he apparently has never set either of his personal feet on U.S. soil. First came \"Dancer in the Dark,\" set in central Washington State, then \"Dogville,\" set somewhere in the Colorado Rockies. (The actual locations were European, as is the case in Dear Wendy.) These earlier films may have had their problems, but they nonetheless stung with their unflattering depictions of American hypocrisy, greed, violence and injustice. The worst thing you can say about von Trier's depictions is that they are derivative, hardly novel or unique. Think of Nathaniel Hawthorne, or Theodore Dreiser, or Ralph Ellison, or Don DeLillo , or David Foster Wallace, or any number of other authors. Pick from almost any generation of American writers and you'll find these same themes sounded. Because \u0096 like it or not - they are valid. And it should come as no surprise that some intelligent foreigner who reads deeply about America might be capable of writing a credible screenplay about our national foibles. \"Dear Wendy\" is set in an unnamed mining town sometime before the present day, probably the 1960s, judging from the musical soundtrack. The town is obviously a false set, not a natural location (odd since this violates of one of Dogme 95's central tenets, to always use natural locations). A miner's son, Dick Dandelion (Jamie Bell, who has carved out a niche, it seems, playing miner's sons, beginning with his splendid performance in Billy Elliot) is a misfit, too fragile and disinterested to spend his life down the mines. Out of sorts, aimless, Dick one day buys a toy gun as a gift for a buddy. But he learns from his fellow misfit friend Stevie (Mark Webber) that this gun is actually a small but real bullet shooting weapon. Stevie, as it happens, has an obsessive passion for guns, gun history and the workings of guns. These two hit upon a plan: why not start a little club, a cult of losers and outcast young people, the town's stray kids, and bring a little honor, pride and some decent principles of conduct into their lives. No one else is going to give them a break, so it's self-help time. The club will have a secret headquarters for meetings, indoctrination and just hanging out. The unifying themes will be the possession and adulation of firearms juxtaposed with pacifism (is this an amusingly ironic riff on our culture or what ?!) Members will learn to love their guns, to name them, to vivify imagined relationships to their guns. But they will also be honor bound never to use them to commit violent acts against others, not to mention each other. The group is named The Dandies, presumably after Dick's surname, and grows to include Susan (Alison Pill), Huey (Chris Owen), Freddie (Michael Angarano), and Sebastian (Danso Gordon). An aging black woman, Clarabelle (Novella Nelson), eventually becomes a sort of honorary member, or, more precisely, someone whom The Dandies find need to protect from harm, once the going gets rough. And the going does get rough. We know that it will only be a matter of time before the idyllic fantasy life shared by this noble little band is somehow shattered by violence. This force arrives in the form of Sheriff Krugsby (Bill Pullman) and a legion of police sharpshooters. It's the gunfight at the Not Very OK Corral. Without getting into further particulars, I will say that the final shootout between The Dandies and Pullman's legion is conducted with an awesome display of police firepower that absolutely resembles the massive use of high tech weaponry that we are accustomed to witnessing when America goes to war, whether abroad or in quelling domestic uprisings (think of Fallujah and Waco). All the actors I have named deliver good turns. I was especially impressed by Bill Pullman, Jamie Bell and Mark Webber. The sound track features several songs by the 60s British pop/rock band, The Zombies, including their great hits, \"She's Not There\" and \"Time of the Season.\" More than anything, to me this film feels a lot like a couple of Gus Van Sant's movies. The Dandies adopt period costumes as well as arcane, stylized manners like the street people in \"My Own Private Idaho,\" and the notion of outcast young people bearing weapons, of course, permeates \"Elephant,\" in a similarly lyrical manner. I think \"Dear Wendy\" is a powerful film, brimming with poetic truth about us. Yes, it is polemical, one sided, provocative. It may be only half the truth, ignoring our national virtues. And the slant may be familiar. But Vinterberg and von Trier have teamed up to make a decent movie about our seemier side. (In English). My rating: 8/10 (B+). (Seen on 12/11/05). If you'd like to read more of my reviews, send me a message for directions to my websites.",
         "I liked \"Dear Wendy\". It was well photographed, had good cast and the rocking soundtrack provided the light icing on a film that is both sad and happy from the inside. It is a bit puzzling that this film has been seen as anti-American propaganda. It does criticise the American values - but so do many American films that are hardly described as anti-American. The message is even softened by placing the film in surreal, small mining town that is so detached geographically that you can almost feel the fiction. In some sense it bears resemblance to the village set on Brechtian stage in \"Dogville\" (compare for example the \"stageness\" of main street) by Lars von Trier, whose touch can be seen in \"Dear Wendy\", too. It can be also seen as an anti-gun lecture - but that is just one perspective to it and in my opinion also possible to ignore. The only turnoff is the somewhat annoying narration by the main character, that explains too much and leaves less for the viewer to ponder. I might be also giving one star too much, because the end scene, where the film picks up the pace left such a strong impression on me, and not just because of being so well shot action.",
         "I saw this movie in France with a large group of friends, something I highly recommend. We all seemed to have a different take on the film and each of us was able to draw something unique from it. Some loved it; some hated it. One of us focused on the powerful characters, another on the coming-of-age aspect, another on the gun control issues, etc. I saw it as a commentary on the power of fear in light of current world events and about how allowing that fear to control your life can ultimately bring about the very tragedy of which you are most afraid. Dear Wendy certainly lends itself well to conversations that surpass the standard post-movie fare. I am looking forward to it coming stateside so I can see it again with other friends and see what reactions the film provokes in them ...",
         "Up for the award for weirdest film I've seen in quite a while. You don't believe me? Okay, the plot revolves around Dick, who seems to have no friends at all and who lives in a small, nameless town in America that is totally centred on working in the mine. He buys a toy gun as a present for someone he doesn't like, but doesn't give it to him. Eventually he discovers that the gun isn't a toy at all, its real. He falls pretty much in love with this gun, names it Wendy, and forms a type of gang; The Dandies, who are pacifists although they do love their weapons. Obviously, things do not work out well. The whole style of the film is strange. Virtually all of it is narration, which is then developed in a few conversations or, and for the most part, shown and illustrated through what we see occur. It is also rather on the surreal side. I don't mean melting watches or anything, just, well surreal. And I really liked it. The detached position the audience is placed in by not being able to engage with any of the characters except through the letters Dick writes/narrates. And the very fact that we're never quite sure what the film is about. Is it anti-gun, or just anti the culture that seems to love guns and violence yet wants to hide it away? Or is it a praise of their idealism? And lets not forget the humour. If you can't laugh at this film I don't think you'll enjoy it.",
         "Thomas Vinterberg has finally reemerged from the disaster that was \"It's all about love\", and with help from compatriot Lars Von Trier he has delivered a hugely original and entertaining film. The story evolves around Dick - a small town loser who feels confident by holding a gun. Seeing this, he creates a group \"the Dandies\" of fellow gun-fanatics. Violent as it may seem, the point of the group is pacifism - to obsess with guns, but NOT TO USE THEM. Yet when ex-criminal Sebastian joins the group tensions emerge, and Dicks ego and his gun-obsession becomes a deadly cocktail. The story is absolutely outrageous, but Vinterberg, realizing this, gives the film a warped, almost giddy, feel. This actually complements Von Trier's screenplay better than the latter's ultra-realistic style, and prevents the film from becoming moralizing. The only real drawback of the story is the slow start and the dialog, which at times has difficulty hiding the fact that it has, in fact, been translated from Danish into English. Nevertheless, a strong comeback for Vinterberg - let's hope he can do some more serious stuff as well.",
         "While the cinematography was very pleasing to the eyes and the young actors did a commendable job, the story itself leaves something to be desired. Though it starts out with an interesting concept, Dear Wendy winds its way into a ridiculous hole. The \"twists\" are random and unfounded, probably there for the sole reason of providing conflict. Also, the movie tends to be sluggish: watching for an hour feels like two or three. On the positive side, the young actors did a very good job (for the most part). At times dramatic pauses cause more laughter than thought, but that's difficult to avoid with the script. Eye-catching camera angles were used, along with some interesting techniques. To sum up, the director, cinematographer, and actors are probably usually amazing at their jobs; however, if they enjoy their careers they should stay away from writing like this.",
         "I went to see Dear Wendy thinking that it was some kind of statement about guns. It's not. As someone said, it's a lot more subtle than that. I tend to like Dogme films. I give high ratings to movies like Dancer In The Dark (10) and The King Is Alive (9), because they are shock-full of mind-wringing symbolism. It's \"Art\" with a capital \"A\". Such movies (as well as their counterparts in other media, like literature) really all have the same basic plot: chronicling the human condition and all the biggest and most abstract questions in life. Where they're different is in the WAY they do it. Which symbols and metaphors they use; which story they pretend to tell while really saying something else on a deeper, non-literal level. There is a long artistic tradition of turning things upside-down. Using a reverse perspective as a new twist on an old tale. That's what we have in Dear Wendy, too, where the Dandies represent artists, and the guns represent the object of artists: truth and beauty. And the guns, ultimately, are used against the established authorities to bring about a social transformation. Hence the amazing \"Glory Glory, Hallelujah\" finale, which is not ironic at all; it heralds the success of the mission of art and artists: the transformation of society. But this can be understood only by transposing the symbolism to the real world; it is symbolized in the movie's universe only by the completion of the mission to get Clarabelle through the police-infested square to have coffee in Cynthia's apartment. But that is the concentrated symbol of the Dandies' success and ability; the one great task that they needed to perform, and the completion of which made the artists themselves redundant; no longer needed. Because when the mission of art has succeeded, art in the classic sense is vindicated, and humanity will finally have stepped out of its petty squabble-filled infancy and on to bigger and better things. That's what art is for, and that's the story this movie tells, in highly stylized and metaphorical terms. Dear Wendy is a good art movie, but must be judged against other good art movies, and as such I give it an 9 out of 10. I felt that, much of the time, the entertainment value wasn't great, and the acting was not on par with the positively stunning performances Von Trier usually gets out of his casts (see The Idiots, for example, and Breaking The Waves), or that Kristian Levring got from the cast of The King Is Alive. But then, I gather Dear Wendy is not officially and technically a Dogme film, although it certainly does have the exact Dogme type of content. Director Vinterberg's contribution to the story was inspired, and demonstrated that he \"got\" the point of the script, but in its capacity as an artist's vision, I feel that the movie is much more a Von Trier movie than a Vinterberg movie."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Lucky Punch",
         "Nimbus Film Productions",
         "Zentropa Entertainments"
      ],
      "summaries": [
         "DEAR WENDY is a story about the young loner Dick who lives in the poor mining town of Estherslope. When he happens upon a small handgun one day, he finds himself strangely drawn to it, despite his fervent pacifist views. Together with his newfound partner he soon convinces the other young outcasts in the town to join him in a secret club he calls The Dandies. A club based on the principals of pacifism and guns. Despite their firm belief in the most important Dandy rule of all - never draw your weapons - they soon find themselves in a predicament where they realise that rules are made to be broken.",
         "A young boy in a nameless, timeless American town establishes a gang of youthful misfits united in their love of guns and their code of honor."
      ],
      "budget": 50000000
   },
   "movielensId": 33421,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-01-22",
      "dvdReleaseDate": "2006-03-21",
      "directors": ["Thomas Vinterberg"],
      "runtime": 105,
      "movieId": 33421,
      "title": "Dear Wendy",
      "mpaa": "NR",
      "actors": [
         "Jamie Bell",
         "Bill Pullman",
         "Michael Angarano",
         "Danso Gordon",
         "Alison Pill",
         "Chris Owen",
         "Mark Webber",
         "Novella Nelson"
      ],
      "imdbMovieId": "0342272",
      "originalTitle": "Dear Wendy",
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["D1Mh8wJOeg8"],
      "plotSummary": "In a blue-collar American town, a group of teens bands together to form the Dandies, a gang of gunslingers led by Dick Dandelion. Following a code of strict pacifism at odds with the fact that they all carry guns, the group eventually lets in Sebastian, the grandson of Dick's childhood nanny, Clarabelle, who fears the other gangs in the area. Dick and company try to protect Clarabelle, but events transpire that push the gang past posturing.",
      "tmdbMovieId": 10913,
      "avgRating": 3.32461,
      "releaseYear": "2005",
      "numRatings": 191,
      "posterPath": "/2IF19Tcx5D9d8iUWa0PxFhO6MYZ.jpg"
   }
}