{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "vietnam",
            "id": 2956
         },
         {
            "name": "jungle",
            "id": 10787
         },
         {
            "name": "african american",
            "id": 11243
         }
      ],
      "imdb_id": "tt0114888",
      "video": false,
      "title": "The Walking Dead",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cole Evans",
               "gender": 2,
               "credit_id": "52fe499a9251416c750cd5df",
               "name": "Allen Payne",
               "profile_path": "/xJtew7b2oZRZjIzocnBZgkVlWWt.jpg",
               "id": 32486,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pvt. Hoover Brache",
               "gender": 2,
               "credit_id": "52fe499a9251416c750cd5e3",
               "name": "Eddie Griffin",
               "profile_path": "/jgz5HDtC3aXYXBSULqay1PKWQOL.jpg",
               "id": 62842,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sgt. Barkley",
               "gender": 2,
               "credit_id": "52fe499a9251416c750cd5e7",
               "name": "Joe Morton",
               "profile_path": "/5adJxjbFX2GeuTTCNqc9dg4Twgx.jpg",
               "id": 3977,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Pfc. Joe Brooks",
               "gender": 2,
               "credit_id": "545903210e0a26115b001f8c",
               "name": "Vonte Sweet",
               "profile_path": null,
               "id": 95797,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Cpl. Pippins",
               "gender": 2,
               "credit_id": "54590330c3a36839a4001fae",
               "name": "Roger Floyd",
               "profile_path": null,
               "id": 182136,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Shirley Evans",
               "gender": 1,
               "credit_id": "5459033d0e0a26116a001e3c",
               "name": "Ion Overman",
               "profile_path": "/qq7COsPQaeTMDeIQWY4mc4iVyjW.jpg",
               "id": 84208,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5459030ac3a368398f001f98",
               "name": "Preston A. Whitmore II",
               "profile_path": null,
               "id": 76705,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5459030f0e0a2611550020e9",
               "name": "Preston A. Whitmore II",
               "profile_path": null,
               "id": 76705,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 0.719746,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 95963,
      "vote_count": 5,
      "budget": 0,
      "overview": "Five young marines on a suicide mission in Vietnam, struggle for survival in a jungle minefield. The mean streets of home did not prepare them for this.",
      "similar": [
         1369,
         13,
         1368,
         258489,
         11778,
         37135,
         792,
         600,
         28,
         314095,
         390062,
         278927,
         2604,
         9325,
         103,
         393457,
         301337,
         376867,
         239566,
         10590
      ],
      "original_title": "The Walking Dead",
      "runtime": 88,
      "poster_path": "/lP0YJPbtshhFHGVSgiQojuiC1im.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jackson/McHenry Company,The",
            "id": 37350,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Savoy Pictures",
            "id": 11308,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Price Entertainment",
            "id": 23808,
            "origin_country": ""
         }
      ],
      "release_date": "1995-02-24",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Surviving the streets was just a rehearsal.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Preston A. Whitmore II"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Preston A. Whitmore II"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114888/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5NTQ4MDE1OF5BMl5BanBnXkFtZTcwMjA3MzAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Allen Payne, Eddie Griffin, Joe Morton | See full cast and crew »"],
      "reviews": [
         "I have seen all the Vietnam flicks, and this was a joke. I'm glad I saw this last, because I probably wouldn't have seen the much better films like Apoc.Now and Platoon. The concept of the story isn't bad, but the REAL story is why there were a much larger portion of African-Americans getting shot at than Caucasians. This was missed in trying to find some kind of connection with these totally unlikable characters. The dialog is stilted, almost cartoonish. Apparently human beings NEVER complete a sentence without an expletive in it. The North Vietnamese soldier(one of the best in world at that time) was portrayed like Native Americans in old westerns, just standing there waiting to be shot. The lighting was bad. You could see the lights(night scenes) in the glasses of the actors. I could go on. Everyone makes a choice on what to see, but my advice is that there's better Vietnam movies to see.",
         "Give me a break. The Vietnam war was a real war where real people died. Total U.S. fatalities in the theater were over 55,000, if I recall correctly. And as wars go, this one was not managed very well, in my opinion, but this movie is disgraceful in its blatantly dishonest portrayal of the war. All of the characters are basically comic book characters. All of the behaviors displayed by all of the characters are behaviors that would never have been exhibited by anyone who actually found themselves in a war zone. The movie implicitly wants to be taken seriously, but you cannot take it seriously. The white officer leading the platoon is especially a comic book character. His enlisted men show him a level of disrespect that is so far over the top, and so far beyond what any officer in the U.S.M.C would ever tolerate of his marines, that the movie becomes a comic book within just a few minutes. And it is a bad, bad, comic book. In reality, a marine officer will put his life on the line for his marines at the drop of a hat, and his non-commissioned officers will do the same for him. No non-commissioned officer in the marines would ever speak to his superior officer in the way that these jackasses do. Anyone that did would find himself doing hard time. In the U.S.M.C., discipline is everything. Discipline is the life blood of the Marine Corps. This movie isn't just unrealistic, it is disgraceful. The people who made it are shameless, and have no knowledge of the Marine Corps.",
         "Do not listen to the racist on here, especially Jakealope. This guy goes on all the African American movies and call them racist. Any movie that deals with black issues, is a racist movie...only to racists. This is a good war movie. And if you are not a bigot with a useless internet agenda to bash all Black people. Or have racial superiority issues, then i recommend it. Otherwise, just watch white movies. There are PLENTY of them out there. No one is forcing you to watch the few Black movies that exist. JEEZ! Get a life racists. Try thinking outside of your box and believing that African Americans should only do comedy or token movies.",
         "Okay..... if Platoon or Apocolypse Now is available, you should rent those films instead. However, if you've seen those features (and enjoyed them) -- then give The Walking Dead a shot. Its nothing extraordinary, but each actor (especially Allan Payne) gives a excellent, believable performance. Its also nice to see that Central Florida was used as a location to film something besides a bad comedy (Earnest Saves Christmas) or bad Reality TV shows (Making The Band).",
         "This is an okay movie if you have an hour and a half to spare. If you like witty humor and rejoinders, then this is the movie for you. Eddie Griffin is hilarious in this movie. He has some of the best quips given to a black man in a movie. Maybe it's just me but I love funny remarks and cool characters. Eddie Girffin plays one of the coolest black characters on film in this movie. He should be given a spin off of this role. Maybe he was just playing himself. If you want to base this movie on race then if your Caucasian you might not take much affinity to it since it deals particularly with blacks and black issues. But if you just don't care and like to see people get their heads blown off and simple storytelling with cool quotes then you will love it!",
         "This is a horrible war movie by any standards. The Vietnam set is as realistic as a high school play, as well as the battle scenes. They fly around in commercial choppers at night with running lights on, as if half the NVA would be firing on it before it got 2 miles over enemy lines. The acting is sub par, to be charitably. It is like some off Broadway play more than a movie, and a bad one at that. The flashback scenes are just downright hokum. It advances a lot of black conspiracy theories, a.k.a. racist lies, like so many more blacks died than whites, which is just not true. Over 80% of the casualties were white troops, so how they cooked up that lie is beyond me. But some people think it's cool to promote lies like that, usually the same ones who deny true things if they don't like how it reflects on their race. To buttress my claim, look at the whites portrayed in the film: a psycho gung ho Marine NCO who pulls guns on people. a twisted younger guy in their squad that they kill (real Marine spirit there), a cowardly helicopter pilot, etc. All whites are dehumanized stereotypes that could have come out of the fetid mind of average rapper or Nation of Islam clone. The plot is pure dime store conspiracy trash. They send these so called soldiers out to liberate a POW camp, except it's empty. It's empty cause this is a plot by whitey to kill people of color. Compare that to the \"Great Raid\"! As you can see, there is absolutely no point to see this movie unless you believe everything Louis Farrakhan says, because this movie was made by people who think just like him.",
         "The Walking Dead is a recent Vietnam War movie that focuses on mainly 4 black soldiers and one white soldier in a couple of days of battle. The story has them being dropped off with another platoon to try and rescue some POW's. Soon they realize that it is just the four of them that are still alive. The movie gives you a flashback of each of the characters and why the joined the Army. The movie doesn't get anywhere near as powerful or good as Platoon or The Deer Hunter, but it still holds up as a solid war movie. Joe Morton (Speed, Apt Pupil) and comedian Eddie Griffin (Armageddon, TV's Malcolm and Eddie) give the only two performances of note. Morton gives a good performance as the leader of the group and Griffin surprised me with a strong performance as the loud-mouth with a heart.",
         "I was looking at the free movies on demand and saw Joe Morton was in this, so I decided to watch it. I was really glad I did. The interactions between Joe and Eddie Griffin were great. I also loved the soundtrack; it reminded me of my youth. I have to disagree with anyone who thinks Blacks weren't disproportionately represented in Vietnam. Actually, all poor Americans were; unfortunately, inner cities happened to have a lot of poor minorities and little political clout. The movie did suffer a little with the generic stereotype VC, and the fighting seemed low budget, but the acting among the main characters was great. Worth seeing if you come across it.",
         "It could have been much better, the movie is actually worth watching once just for the dialog of Eddie Griffin's character and Sgt. Barkley. The problem comes in the form of awkward acting from all the cast (except the aforementioned characters) and the very predictable nature of EVERYTHING you experience during the movie. The film feels rushed and underdeveloped and very average. As the movie moves along you become a bit more attached to the characters due to the flashbacks of life before being deployed to war and good character development but overall this is probably one of the worst war movies I've seen. I give it a 5 just for Eddie though, he is great in this flick."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Savoy Pictures",
         "Price Entertainment",
         "Jackson/McHenry Company,The"
      ],
      "summaries": ["In 1972 Vietnam, a group of United States Marines are sent in to rescue several POW officers. The Landing Zone (LZ) which should have been \"cold\" actually turns out to indeed be very \"hot\" (characterized by violent and forceful activity or movement ; very intense). Soon, after a short fight, only four of the soldiers are left alive. Later, the platoon which they were to meet the next day is entirely wipe out with the exception of one nut-case. The small group then arrives at the conclusion that they are all expendable decoys. Between all of the walking, talking, arguing and assaulting between the four soldiers, there are flashbacks to all of their contrite lives before serving in the Corps."],
      "budget": 0
   },
   "movielensId": 336,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-02-24",
      "dvdReleaseDate": null,
      "directors": ["Preston A. Whitmore II"],
      "runtime": 88,
      "movieId": 336,
      "title": "The Walking Dead",
      "mpaa": "R",
      "actors": [
         "Allen Payne",
         "Eddie Griffin",
         "Joe Morton",
         "Vonte Sweet",
         "Roger Floyd",
         "Ion Overman"
      ],
      "imdbMovieId": "0114888",
      "originalTitle": "The Walking Dead",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["UoISioGH52Y"],
      "plotSummary": "Five young marines on a suicide mission in Vietnam, struggle for survival in a jungle minefield. The mean streets of home did not prepare them for this.",
      "tmdbMovieId": 95963,
      "avgRating": 2.85783,
      "releaseYear": "1995",
      "numRatings": 313,
      "posterPath": "/lP0YJPbtshhFHGVSgiQojuiC1im.jpg"
   }
}