{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "love",
         "id": 9673
      }],
      "imdb_id": "tt0344604",
      "video": false,
      "title": "After You",
      "recommendations": [
         79213,
         60026,
         26152,
         31340,
         13733,
         13739,
         64383,
         22623
      ],
      "backdrop_path": "/dS68bGGCTxBtSboktND6RR5GFKg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Antoine Letoux",
               "gender": 2,
               "credit_id": "52fe46f89251416c75089a2d",
               "name": "Daniel Auteuil",
               "profile_path": "/lWXsmJwL4H2RyJpC8p7hLFl27pZ.jpg",
               "id": 6012,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Blanche Grimaldi",
               "gender": 1,
               "credit_id": "52fe46f89251416c75089a31",
               "name": "Sandrine Kiberlain",
               "profile_path": "/syUJ4VwJYjrfBzENf92zGebI5ti.jpg",
               "id": 81821,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Christine",
               "gender": 0,
               "credit_id": "52fe46f89251416c75089a35",
               "name": "Marilyne Canto",
               "profile_path": "/1CaxF9ObGNwaZViRHMxv7tZ5K5U.jpg",
               "id": 73828,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Martine",
               "gender": 1,
               "credit_id": "52fe46f89251416c75089a39",
               "name": "Michèle Moretti",
               "profile_path": "/8Nw5bRGpITncsuryF6oYLD8sGHs.jpg",
               "id": 19936,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Louis",
               "gender": 2,
               "credit_id": "52fe46f89251416c75089a3d",
               "name": "José Garcia",
               "profile_path": "/qhPlKvzQnBBXE6meIAK1PenR0QU.jpg",
               "id": 24895,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46f89251416c75089a43",
               "name": "Pierre Salvadori",
               "profile_path": "/8FlLCyoXV4ibDW7X4CufkLtZb0S.jpg",
               "id": 51116,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53d42be60e0a262844002982",
               "name": "Pierre Salvadori",
               "profile_path": "/8FlLCyoXV4ibDW7X4CufkLtZb0S.jpg",
               "id": 51116,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53d42bf70e0a2628380029c3",
               "name": "David Léotard",
               "profile_path": "/9UwT8Ip38vS4tJljMnHwLX1QZDV.jpg",
               "id": 1346595,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53d42c080e0a26283b0028fa",
               "name": "Benoît Graffin",
               "profile_path": null,
               "id": 51117,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.807973,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 16932,
      "vote_count": 19,
      "budget": 0,
      "overview": "Antoine is a maitre d' in a Paris brasserie, Chez Jean, and is so full of being of service to others that he can't say 'no'. Late for dinner with his girlfriend, Christine, he takes a shortcut home through the park but finds a stranger, Louis, in the act of committing suicide by hanging. Louis is distraught by the loss of his girlfriend, Blanche, and is so grateful that he attaches himself to Antoine. Antoine arranges a job for Louis - as a sommelier at Chez Jean and sets about trying to repair Louis' life...",
      "similar": [
         19913,
         13523,
         24420,
         1259,
         276,
         1024,
         862,
         38,
         50544,
         1903,
         1628,
         1643,
         316021,
         16980,
         44564,
         17612,
         38050,
         50546,
         46705,
         13
      ],
      "original_title": "Après vous...",
      "runtime": 110,
      "poster_path": "/jHvMxLALTyLeAjOKJ5SeCgfout0.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Région Ile-de-France",
            "id": 11246,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Pelléas",
            "id": 12389,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 15671,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gimages",
            "id": 148,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gimages Développement",
            "id": 20366,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Glem Production",
            "id": 28400,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tovo Films",
            "id": 28401,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "2003-12-17",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pierre Salvadori"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Danièle Dubroux",
         "Benoît Graffin"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0344604/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyMzQ2Nzg5M15BMl5BanBnXkFtZTcwMTc0NzkyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Daniel Auteuil, José Garcia, Sandrine Kiberlain | See full cast and crew »"],
      "reviews": [
         "I saw this at the Phoenix Film Festival, almost by accident. My first choice for the time slot was full, and this would end in time to see my next screening, so I grabbed a seat as the lights went down. A very pleasant surprise. I really enjoyed this movie, walking into it with out the slightest idea what it was about. While the premise may not have been 100% original (man helps man get back the girl... but falls for her himself), I thought it was very well done. We should all wish to have friends as dedicated as Antoine, and we can all relate to Louis at some point in our lives. While the movie may not have been hysterical, I found myself smiling or laughing most of the time. The end result wasn't completely unexpected, yet how they got there was a surprise to me, with the last gag being a nice touch. Definitely recommend this film. Not one you'll discus what it means for hours, but one you should enjoy while you are there.",
         "This has to be, no contest, the best restaurant-based movie since Claude Sautet persuaded Yves Montand and Jacques Villeret to don monkey suits for 'Garcon'. They get the mix just right between humor and pathos and although it's based on a dubious premise for the 21st century - maitre d' Auteuil spots Garcia trying to top himself, intervenes and then, against all the odds of cynicism, feels obliged to 'adopt' him and straighten out his life - it still works. This straightening out includes fixing up klux Garcia with a job as sommelier at Auteuil's restaurant which means in turn that Garcia must compete in an interview/audition with people who have actually worked as sommeliers. Given that Garcia knows as much about wine as Ludivine Sagnier knows about acting with her clothes on the audition is a hoot, with Auteuil, sitting in, natch, on the interview and attempting to coach Garcia surreptitiously. The main reason that Garcia was interested in running out of breath was the fact that he'd been dumped by a girl friend and nothing will do but that Auteuil must intervene once more and attempt to win back the ex-girl friend, who is now involved with someone else. Not unnaturally, Auteuil begins to fall in love with said girl friend which is not exactly hard given that she is played by Sandrine Kiberlain, a great actress with an elusive beauty which is hard to classify. She doesn't do chocolate-box like Audrey Tautou, she doesn't do chic like Catherine Deneuve, she doesn't do warmth like Isabelle Huppert and Fanny Ardant and she most certainly doesn't do slut like Ludivine Sagnier, whatever she does she does it to a fare-thee-well and if you don't believe me ask that swine Vincent Lindon, who married her before I could get there first (just kidding, Vince, you're a great actor yourself if anybody asks you but WHY did you have to take her off the market?). This complication gives the movie an extra fillip, a touch of the Cyrano de Bergeracs, with Auteuil pressing a claim for a guy who is now, to all intents and purposes, a rival, although unlike Cyrano, who has been in love with Roxanne all his life and is himself unattached, Auteuil is - or was - in a happy relationship until these life-changing events. All in all a very fine movie worth a couple of hours of anyone's time provided they are motivated by people and the Human Condition and not Matrix-type fx. 9/10",
         "\"Après vous...\" is a gentle, screwball cross between \"Cyrano\" and \"Down and Out in Beverly Hills,\" or, more accurately probably, its French progenitor \"Boudu sauvé des eaux.\" Daniel Auteuil very expressively plays a much put upon Good Samaritan, whose life and identity get more and more entangled with the object of his personal philanthropy. While the employment and romantic lengths that he goes to in helping his hapless beneficiary, who shares some foibles with TV's Monk, stretch believability, he is very amusing and certainly the viewer gets as caught up as he is in the ensuing complications, even if they do seem a bit endless. One of its charms is that all the characters have saving graces. Unlike similar American movies, characters who are in the way of the inevitable are not shrill and the screenplay, co-written by director Pierre Salvadori, is not mean or condescending to them, as there is equal poignancy and laughter. There may be additional jokes about French restaurants and cuisine that lose something in the U.S. as this is almost as much a restaurant movie as \"Dinner Rush\" or \"Big Night.\" The English subtitles, when they are not white on white, have poor grammar and spelling, including inconsistency of a character's name. The repeating amusing sounding pop tunes on the soundtrack seem to have some significance, but the lyrics are not translated.",
         "It seems when it comes to romantic comedies the French have the corner on the market and technique. APRES VOUS is a bit of pastiche with a storyline that borders on absurd, but in the hands of director Pierre Salvadori it becomes not only an enjoyable farce, but also a tender little statement about compassion. Antoine (Daniel Anteuil) is the fastidious and ultra compassionate manager of a high-class restaurant who bends over backwards for his staff, his patrons, and anybody who crosses his path who appears needy. He ends up making his girlfriend Christine (Marilyne Canto) take second place to his humanitarian concerns and this puts a strain on his relationship. One evening in a rush to meet Christine he encounters Louis (José Garcia) who is in the process of hanging himself in the park, his desired finale to a life of frustration and loss of his girlfriend Blanche (Sandrine Kiberlain). Naturally Antoine rescues him, feeds him, even brings him home, all the while putting his life on hold to help Louis heal his wounds. Louis is most concerned about the loss of Blanche and Antoine immediately commits his efforts to find her, woo her back for Louis (including revealing Blanche's current boyfriend's infidelity) - but in the process there develops a mutual attraction between Antoine and Blanche! Antoine arranges for Louis to get a job at his restaurant despite Louis' depression and lack of training. Just when everything seems to be turning out for the best, Christine leaves Antoine, and the circumstances surrounding Antoine's salvage of Louis' life change and the ending is somewhat of a French twist! The acting is fine, the pacing is fine, the only problem is with the characters themselves: we soon tire of Antoine's absurd selflessness and Louis' nerdy helplessness and that hampers the identification with these characters. Other than that the film is a brisk, sweet little French farce that leaves you humming. Grady Harp",
         "Après vous (2003), directed by Pierre Salvadori, has the same basic plot as Jean Renoir's Boudu Saved from Drowning (1932). In both films, someone saves the life of a person. This person then causes endless problems for the rescuer. Daniel Auteuil (Antoine) is the senior waiter in an elegant restaurant in Paris. He's skilled and respected at work, and has a wonderful girlfriend named Christine (Marilyne Canto). Antoine has the misfortune of saving Louis (José Garcia) from death by suicide. Louis is a loser in life and in romance. He has attempted suicide because of his rejection by the love of his life, Blanche (Sandrine Kiberlain). All this takes place within the first ten minutes of the movie. The remainder of the film follows these four characters as they go down an amusing--but fairly predictable--road. Certain things don't come together. For example, Blanche is considered the epitome of female virtues, but, other than her long, slender neck, I didn't see much that was attractive about her appearance or her personality. The best scene in the film is that between Antoine and Louis' Grandmother. The late Andrée Tainsy was 92 (!) years old when she played this role. This movie is not obnoxious, but it's far from a masterpiece. My suggestion--rent Boudu Saved from Drowning (Boudu Sauvé des Eaux) and watch how a master director handles a similar plot.",
         "Antoine, the head waiter of Chez Jean, an upscale restaurant in Paris, chances upon a man that is preparing to hang himself from a tree, one night he is trying to meet his girlfriend by cutting across a park. Well, the only thing for him to do, since he is a good guy, is to go and save the man's life. In saving the man, Antoine goes into extremes in order to give this man, a second chance in life, but at the same time he is taking on much more than what he bargained for. Pierre Salvadori's comedy could be considered a black one, or at least, in that genre. Mr. Salvadori seems to be telling us to watch out for those people that will soak up all our energy and good will as they will never be able to repay us for the kindness we extended to them in their hour of need, or so it appears to be the case with this idiotic Louis, the man that Antoine saved. In the process of trying to do good, Antoine discovers that Louis had been dejected after his girlfriend, the beautiful Blanche, has told him to pack his things up because she's had it with him! That's the reason for his trying to do himself in. Antoine, is kindness personified. He is an atypical Parisian man with a heart of gold and deep pockets to help the nebbish Louis, who obviously doesn't seem to have a clue about what to do with his life. In the process Antoine falls in love for Blanche. On the last sequence of the film we see Blanche and Antoine being reunited at the Thai restaurant they like, and a suddenly normal Louis is outside, realizes that Antoine has stolen his woman, We see Antone's car demolished by Louis. In a touch of Gallic sophistication, the head waiter presents the couple a bottle of expensive champagne sent by Louis, so they can celebrate their love. Daniel Auteuil's Antoine is perfect. One of the best things we have seen this actor lately. Sandrine Kilberlain is an elegant Blanche. Jose Garcia is the goofy Louis. Marilyne Canto and Michele Moretti, are seen in minor roles. This is a comedy that Hollywood would probably try to re interpret in the not too distant future. It has the right elements, but remains basically a delicious French comedy that one hopes is not duplicated by the American cinema.",
         "I went to the film because I had just come back from a first-time trip to Paris and I could translate what Apres Vous meant. Well, what a wonderful experience! Refreshing, surprising, beautifully underplayed humor, a lovely farce as only the French can do. Reminds me of the old Comedy of Manners from Sheridan's time. Well written, well directed and well acted. Congratulations. And that soundtrack \"Allo Papa Tango Charly\" is just stuck in my head - I found it's a Mort Schuman tune from 1977, but can't pick up the soundtrack anywhere, even on the official site! Anyone got access to it? I can more or less translate the lyrics from my school days, but would like to come across a literal translation if anyone has it. I think I might have to go again, just for the song! The food shown at Chez Jean's reminded me so much of the lovely food we had every day in Paris. A very welcome afternoon at the Cinema. Jack.",
         "Daniel Auteuil is always good value. One of France's top actors he is the master of understatement, telling us more by facial expression and body language than words ever could. However, I think he was sold short by this movie where the other characters, with one exception, were poorly drawn. Without spoiling - he rescues a man about to hang himself because his girlfriend has left him, and becomes entangled in this man's life. But there was nothing about either the guy or his girlfriend which merited someone going out of their way to help. Both totally lacked charisma, Blanche particularly was one of those women you simply want to shake in an effort to get some sort of personality into her. Louis needed a smart punch in the mouth and frankly, when Antoine finally got to the end of his tether with the guy's stupidity and weaknesses, I was looking forward to that as the high spot of the movie. Nothing could have upstaged the marvellous André Tainsy though, who died only a few months after this film was released, aged 93. She was une trésor absolue, carrying off her role with finesse, incredible humour, so understated - and total aplomb. It is a funny film (and if you know Fawlty Towers, it's in that vein) in an excruciatingly painful way where you just know everything is going to go wrong and there are a couple of laugh-aloud moments but given the mood throughout, it has the unlikeliest ending you could imagine. Brilliant music by Camille Bazbaz all the way through and if nothing else his 'Papa Tango Charlie' should have been a massive hit.",
         "Antoine (Daniel Auteuil) is a head waiter in a chic Parisian restaurant and lives with his girlfriend Christine (Marilyne Canto). His work occupies a lot of place in his life. One evening, by going through a park to be more quickly at his apartment, he saves from suicide a neurotic man Louis (José Garcia). After vainly attempted to take him back to his close relatives, he takes him under his wing and succeeds to find him a job as a waiter in his workplace. Louis wanted to kill himself because his love affair with his ex girlfriend Blanche (Sandrine Kiberlain) went unravel. Antoine found her again because he wants to reconcile them again. She's a charming florist and, you guess it he becomes enamored of her. From then onwards, his well-ordered life starts to showcase signs of poor running. I'm a little surprised but glad to discover that this little high charged, hilarious comedy enjoys a small reputation abroad. About twenty reviews have already been posted for this film and most of them gave the movie thumbs up. I will post another positive one in spite of minor flaws Pierre Salvadori's film showcases. Some will be probably surprised but the outset reminded me of Jean Renoir's classic \"Boudu Sauvé Des Eaux\" (1932), perhaps because of the quite prestigious situation the main protagonists of the films occupy and maybe also because they save from suicide ill-fated men who are cracking up. And then, the saved ones immerse themselves in their rescuers' lives and disrupt their living environment. But although both movies are comedies, they don't belong to the same sub-category. Pierre Salvadori preferred not to follow the steps of the master which bestowed his own work with a strong social satire whiff. There's no trace of it in \"Après Vous\", although there may be an inkling of it in the following sequence: when Antoine takes Louis in the cellar and shows him the names of the different wines. Louis is afraid not to recognize the right wines and I think that Antoine answers him the customers ape the connoisseurs and don't know anything about wines. The director preferred to choose the road of the sentimental comedy and to especially focus on Antoine's turbulent love life. Pierre Salvadori commands his film at arm's length and delays the most momentous moment of the movie (the meeting between Louis and Blanche) to better linger on Louis' new life and especially on Antoine's love trouble. In a way, by making Louis work in his restaurant, by undertaking to reconcile him with Blanche and unfortunately by having a crush on her, he is a victim of his generosity. And Louis doesn't really realize the situations in which he puts Antoine. There's a funny sequence around the beginning of the film during which Antoine is at Louis' grandmother's and tries to alter Louis' suicide note in a placating, comforting letter. Then, deep down inside him, he thinks of leaving his ex girlfriend to live with Blanche and has to lie to his protégé and circle not to arouse suspicion about his real motivations. The movie becomes very enjoyable when it accumulates misunderstandings and embarrassing situations linked with Louis' job as a waiter or Antoine's sentimental trouble which the latter tries to escape by hilarious means (check the sequences in the Chinese restaurant). The scenario is also interspersed with droll lines: \"how do you find the chicken? Dead\". A threesome of actors serves the film. Daniel Auteuil is able to provide enough caliber to his character to watch the film until the tail end and I would like to congratulate the user \"writer's reign\" for the tasty pun he inserted in his review: \"maitre d'Auteuil\". José Garcia who earlier showed in his career that he could hold comical as well as dramatic roles (Philippe Harel's \"Extension Du Domaine De la Lutte, 1999) shines as the neurotic, wound up Louis, indirectly responsible of Antoine's mishaps. At last, Sandrine Kiberlain, a little frail, naive but the director never ridicules her. She was ideally cast as Blanche. In French, this name is also an adjective which means white and the actress has a somewhat pallid face which suits well to both the name and the personality of her character. If the director honed his work with a palpable painstaking care for much of his work, there are little setbacks towards the end of the road. The end is thoroughly unexpected but was made in a rush and the trick of the lighter has been seen many times before. But these flaws aren't major enough to reject Salvadori's film. So, \"Après Vous\" and enjoy your film!",
         "If you have a mind that is not mush from explosion, gun and alien movies, this will assure you that great cinema is still possible. The writing is fantastic and so nimble that your mind dances a duet with the production. Twists and turns and planting/payoff of clues is done with excellent timing, always assuming that the audience has functioning brains. Humor and love mix a great cocktail in this Cyrano-esquire beauty of a film. Nice not to be insulted with the obvious or with over explanation. The acting? To watch M. Auteuil's face go through its paces in any one scene is to watch genius portraying human character with such understanding and subtlety that we cannot miss a great part of the story that would, in another actor's hands, be obscured. M. Garcia is a great and pleasurable surprise for me; I hope you have seen him in other flix; I will look for him. Ah, the directing. Such a perfect grasp of timing!! Not too fast or slow and always attentive to bringing out the best of the great writing and actors. Did I say I liked it? Yup. Even for fans of Auteuil, this is an all time great. See it!!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Les Films Pelléas",
         "France 2 Cinéma",
         "Gimages"
      ],
      "summaries": [
         "Antoine is a maitre d' in a Paris brasserie, Chez Jean, and is so full of being of service to others that he can't say 'no'. Late for dinner with his girlfriend, Christine, he takes a shortcut home through the park but finds a stranger, Louis, in the act of committing suicide by hanging. Louis is distraught by the loss of his girlfriend, Blanche, and is so grateful that he attaches himself to Antoine. Antoine arranges a job for Louis - as a sommelier at Chez Jean and sets about trying to repair Louis' life...",
         "Antoine (Auteuil) saves Louis (Garcia) from hanging himself, though in his attempt to get Louis back on his feet, Antoine gets caught in a romantic triangle."
      ],
      "budget": 0
   },
   "movielensId": 33675,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2003-12-17",
      "dvdReleaseDate": "2005-11-08",
      "directors": ["Pierre Salvadori"],
      "runtime": 110,
      "movieId": 33675,
      "title": "After You",
      "mpaa": "R",
      "actors": [
         "Daniel Auteuil",
         "Sandrine Kiberlain",
         "Marilyne Canto",
         "Michèle Moretti",
         "José Garcia"
      ],
      "imdbMovieId": "0344604",
      "originalTitle": "Après vous...",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Antoine is a maitre d' in a Paris brasserie, Chez Jean, and is so full of being of service to others that he can't say 'no'. Late for dinner with his girlfriend, Christine, he takes a shortcut home through the park but finds a stranger, Louis, in the act of committing suicide by hanging. Louis is distraught by the loss of his girlfriend, Blanche, and is so grateful that he attaches himself to Antoine. Antoine arranges a job for Louis - as a sommelier at Chez Jean and sets about trying to repair Louis' life...",
      "tmdbMovieId": 16932,
      "avgRating": 3.3835,
      "releaseYear": "2003",
      "numRatings": 103,
      "posterPath": "/jHvMxLALTyLeAjOKJ5SeCgfout0.jpg"
   }
}