{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "native american",
            "id": 10322
         },
         {
            "name": "riverboat",
            "id": 158244
         }
      ],
      "imdb_id": "tt0044419",
      "video": false,
      "title": "The Big Sky",
      "recommendations": [
         41604,
         118955,
         42286,
         26283,
         39287,
         42871,
         27644,
         15264,
         28894,
         27443,
         111043,
         44921,
         25633,
         14710,
         23108,
         15266,
         43837,
         53828
      ],
      "backdrop_path": "/bcSKo0KaoXMoBZDTMfGVX11PIv6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Jim Deakins",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50df",
               "name": "Kirk Douglas",
               "profile_path": "/vIZgu07gJtS2j460jgBlI1IvkAO.jpg",
               "id": 2090,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Boone Caudill",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50e3",
               "name": "Dewey Martin",
               "profile_path": "/pwY3u7tWZ5pQV1s4Azp59NKnkVg.jpg",
               "id": 83314,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Teal Eye (Blackfoot Princess)",
               "gender": 1,
               "credit_id": "52fe4642c3a36847f80f50e7",
               "name": "Elizabeth Threatt",
               "profile_path": "/GgNdHYZ8DDzjnySUOxuNcnxpt4.jpg",
               "id": 231228,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Zeb Calloway / Narrator",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50eb",
               "name": "Arthur Hunnicutt",
               "profile_path": "/iqpMPCj3IMycWhsDgbuOxYgTVJk.jpg",
               "id": 50971,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Romaine",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50ef",
               "name": "Buddy Baer",
               "profile_path": "/rKX4qgWWF25fMFxfOaTbI9iMUIx.jpg",
               "id": 83468,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "'Frenchy' Jourdonnais (Riverboat Captain)",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50f3",
               "name": "Steven Geray",
               "profile_path": "/bYHgnE8wv3zXhMoZAAmZjNes7in.jpg",
               "id": 30847,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "La Badie",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50f7",
               "name": "Henri Letondal",
               "profile_path": "/uSaLbsL8aujGaKNInAjfXn90tcI.jpg",
               "id": 97284,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Poordevil",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50fb",
               "name": "Hank Worden",
               "profile_path": "/r43IWN0nGj6kpgNAiK0kgzTIA95.jpg",
               "id": 30299,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Streak",
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50ff",
               "name": "Jim Davis",
               "profile_path": "/haBmMHnlucu5shtRY6SHPG9Gl4i.jpg",
               "id": 30846,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4642c3a36847f80f50ab",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4642c3a36847f80f50b1",
               "name": "A.B. Guthrie Jr.",
               "profile_path": null,
               "id": 30507,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50b7",
               "name": "Dudley Nichols",
               "profile_path": null,
               "id": 13802,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50bd",
               "name": "Ray Buffum",
               "profile_path": null,
               "id": 131048,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe4642c3a36847f80f50c3",
               "name": "DeVallon Scott",
               "profile_path": null,
               "id": 231227,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe4642c3a36847f80f50c9",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50cf",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50d5",
               "name": "Russell Harlan",
               "profile_path": "/yDYlBTYPEMARI8sKwPjnleqQvFL.jpg",
               "id": 4308,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4642c3a36847f80f50db",
               "name": "Christian Nyby",
               "profile_path": null,
               "id": 13973,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "573e2ac49251413fda0003c3",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 2.717454,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43367,
      "vote_count": 13,
      "budget": 140,
      "overview": "Kirk Douglas stars as the determined leader of a band of Tennessee fur trappers who set out to explore the uncharted Missouri river in 1830 and find them selves battling American Indians.",
      "similar": [
         581,
         11897,
         3114,
         57201,
         281957,
         196,
         9361,
         10530,
         49849,
         384680,
         8584,
         6529,
         57212,
         395834,
         10747,
         223485,
         35588,
         9023,
         264656,
         9359
      ],
      "original_title": "The Big Sky",
      "runtime": 140,
      "poster_path": "/lBa0CxZHT1q1w9MJGTzaDi85PkU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
            "name": "RKO Radio Pictures",
            "id": 6,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Winchester Pictures Corporation",
            "id": 13987,
            "origin_country": ""
         }
      ],
      "release_date": "1952-08-19",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Theirs the great adventure...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Howard Hawks"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Dudley Nichols",
         "A.B. Guthrie Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044419/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwNjAyNTQ5MV5BMl5BanBnXkFtZTcwMzU4MzEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kirk Douglas, Dewey Martin, Elizabeth Threatt | See full cast and crew »"],
      "reviews": [
         "Everything in \"The big sky\" has the brand of greatness: story, direction, acting, script, photography, locations. Yet there's something more. Along the film, director Howard Hawks keeps touching profound strings of our souls. Indeed, we grown-up viewers are, more or less consciously, brought back to the dreams of our prime, which is always a source of sweet, though melancholic, bliss. Every young boy has dreamed a totally free life like that of the guys on the screen. Action and adventure, merged into a wild, glorious, almost impossibly beautiful nature. Having fun with our mates, and, when necessary, fighting against the bad ones. Contacting the cultures of far-away, fascinating populations. And, as the main benefit, loving a gorgeous Indian girl. Follows an incomplete exposition of the other merits of \"The big sky\". The film is brilliantly made and interpreted. The actors are all outstanding. Arthur Hunnicutt dominates. Kirk Douglas' natural dynamic way is perfect for his role. Dewey Martin is excellent, as well. Special mentions to Elizabeth Threatt as Teal Eye and to Hank Worden as the funny but smart Poordevil. The black and white photography is magnificent. Indeed, only black and white seems capable to render the incredible bright of Threatt's eyes. And it fully respects and gives depth to the beauty of nature. As usual in Howard Hawks' works, the movie is based on swift-pace-action amalgamated with the human interaction of the characters. Here we have a world with no established laws, out of those of nature. People survive if they recognize who is a friend and who is an enemy, independently on being white or native. The mixture of languages, English, French, Native, and related, often funny, translations, is a fine device to give realism to the script. The love story develops at the rhythm of nature, similarly to the endless journey of the keel-boat, and it's even touching at the ending. We also see that irrational hate is not just criminal nonsense, it's even ridiculous. It seems that \"The big sky\" was considerably cut by the studios. In fact, some magnificent choral scenes appears to be too short. One instance for all: the paramount scene of the Blackfeet hauling the keel-boat on the river lasts just few seconds. To cut the film was certainly a very bad idea. Fortunately, \"The big sky\" remains a masterpiece, worth of Hawks' immense talent and genius. Well, it's enough clear that I like this movie. Indeed, I strongly believe that Howard Hawks was born to give us joy. \"The big sky\" is a major evidence in favor of my opinion.",
         "This feature is an exercise in pure filmic story-telling for Howard Hawks; and the talented veteran director appears to enjoys this unusual freedom from having to worry about indoor sets, intricate lighting setups and costume designs (although Dorthy Jeakins' costumes are wonderful). Here he gets to realize the best elements of A.B. Guthrie's tough novel of the early West, \"The Big Sky\". Bringing to life the major characters of this exciting adventure are Kirk Douglas as happy-go-lucky Jim Deakins, Dewey Martin, adequate as Boone Caudill, Arthur Hunnicut in award-winning form as Uncle Zeb, Jim Davis as Streak, Steven Geray lovable as Frenchie, owner of the riverboat, the Mandan, Hank Worden as Poor Devil, and Elizabeth Threatt as Teal Eye, the Amerind girl Geray is returning so they can open fur trade with the proud and wary Blackfleet chiefs. The film tends to be a bit leisurely in its development, but the action sequences are unusually exciting, and the characters are very believable at every moment. The cinematography by Russell Harlan and the music by Dimitri Tiomkin are very fine indeed. What propels the first portion of the film narrated Hunnicutt, is developing friendship between Jim Deakins and enigmatic runaway youth Boone; then they find Uncle Zeb in a St. Louis jail and are freed to join a dangerous very-early voyage up the Missouri River. The battle between their group and deadly agents of \"The Company\", led by Davis, are the major elements in the remainder of this often-rough, humorous and very moving story. It would be hard to credit Hawks enough for all the good things that happen in this film; he even finds a way to enliven the story by playing up the differences between Martin and Threatt one of h signature male-female disagreements. Douglas and the other two form an interesting love triangle; and the climax that requires Martin to decide whether he is going to turn down what Douglas would give anything he has to obtain is very satisfying to my way of thinking. This a film that is atmospheric, always interesting, and a first-rate look at the old West as it was before it was changed forever. The characters' comments on the ant-hill aspects of overcrowded St. Louis, the jumping-off-place to the west, population 12,000, tell us that we are in a different, simpler and cleaner era of civilization. This is one of the best films about the era of the fur trappers and their ways and trade ever produced in every way.",
         "\"The Big Sky\" is one of the most unique and entertaining adventure films ever made. Set in the American frontier of the early 1800s, it's the story of an ambitious party who pole their keel boat up the Missouri River into new territories, far beyond where other white men have ventured, to trade for furs with the Blackfeet Indians. \"The Big Sky\" was filmed on location, and this alone makes the film worth watching, for the splenor of the Snake River and Grand Tetons, where the film was actually shot, is breathtaking. But \"The Big Sky\" has other virtues which raise it far above the average \"scenic\". First, is the multi-layered plot. Besides the story of an enterprise, \"The Big Sky\" is about how men, in a time long past, interacted, when their differences were subordinated to a higher purpose. Second, is director Howard Hawks, whose trademark \"naturalistic dialogue\" technique is put to wonderful use here. Hawks works on complex relationships - male and female, \"Frenchie\" and Anglo backwoodsmen, Native Americans and whites - like a conductor a symphony. Third, and perhaps most touching, is the tale of male bonding not only among the group of men, but one-on-one between Jim Deakins, played by Kirk Douglas, and Boone, his young sidekick, played by Hawks protegé Dewey Martin. There's a nice, touching story toward the end. This is a shamefully underrated film. Superb cinematography (Oscar nominated), rich plot, flawless casting (Arthur Hunnicutt nominated for Best Supporting Oscar), masterful direction, make \"The Big Sky\" a true classic.",
         "The Big Sky is generally considered inferior and less important compared to Red River, the Western Howard Hawks directed in 1948 or four years before this one and which already has a status of a classic and Hawk's masterpiece. Howard Hawks himself wasn't pleased very much with the final result because he wanted John Wayne to play Kirk Douglas's role and mainly because the studio insisted on cutting out 20 minutes of the film to facilitate its distribution. In a conversation with Peter Bogdanovich Hawks later recalled that he had a difficulty recognizing his own film after seeing it in that `butchered' version. But in my opinion The Big Sky stands on the level of Howard Hawk's best work remarkable for its visual beauty (though filming it in colour would definitely improve it), fine performances (Kirk Douglas is magnificent here and it's hard to imagine other actor playing this role), wonderful music from Dimitri Tiomkin and interesting story of, basically, friendship, that even might be called love, between the two main characters of Jim Deakins (Kirk Douglas) and Dewey Martin (Boone Caudill) but friendship on a background of a perilous and adventurous journey up the Missouri river to the Indian territory where no white man ever set his foot before, with a group of peculiar French adventurers and an Indian princess Teal Eye (Elizabeth Threatt) who steals their hearts and threatens their friendship. A must see classic. 9/10",
         "This film is EXCELLENT and is filled with many vivid scenes of the Jackson Hole Valley country. Being shot along the Snake River and within easy sight of the Teton Mountain range it gives an amazingly accurate account of what early Keel Boat travel might have been like along the Missouri River and other Western tributaries. Kirk Douglas (Jim Deakins) is superb as he portrays one of three game hunters, along with Dewey Martin (Boone), and the comic backwoods relief of Arthur Hunicutt (Uncle Zeb). Mr. Hunicutt steals the show with his Southern drawl and folksy way cultivating a feeling for the viewer as being one of the \"crew\". The use of actual French actors & accents adds to the believable setting of the early 1800s environ and customs of the trappers and mountain men who blazed the trails into the West and survived through trade and co-operation with the Indian tribes who populated it. From using trees along the bank to catapult game down to the Keel boat, to the unforgettable scene where \"medical\" aid is rendered to Kirk. Well worth your time and any children should be shown it as well because they'll remember it throughout their lives. I certainly have!",
         "This film is a true joy, and one of Hawks's greatest works, though it's often underrated. It has all the great Hawksian themes: adventure, feisty women and cool men who, no matter how cool they are, need the feisty women. It's also a great classic Western, with beautiful outdoor photography and a terribly poetic evocation of going down the Missourri (it's vaguely based on Lewis and Clark). It's leisurely and enthralling in the way only Ford and Hawks could do. While Arthur Hunnicut in no Walter Brennan, and Dewey Martin is cute rather than great, Kirk is superb as ever. Don't miss.",
         "The Big Sky is a classic screen gem, filmed in black & white in the style of Ansel Adams. A great print with delicious contrast that is an eye-feast for photography buffs. The script is rapid paced; be sure to train your ear to catch the snappy, fluent dialogue. Tender care is given to every character development, and many scenes that are so subtle are intended to breath real-life into the story. This is one of my all-time faves.",
         "Hey, it's a Howard Hawks' movie. Simply it can´t be bad. If you put in a film one of the best directors ever, some of the better actors of all time, plus a marvelous screenplay like this, you only can get an astonishing movie. Seriously, one of the many masterpieces that western genre gave us in the golden years of Hollywood. This is cinema, real cinema; it has the feeling that only classics can own. Special mention to Hawks' direction and Douglas' performance. Also photography hits the jackpot. If you like cinema you should love western and if you like western you'll love this movie. An experience that only classic films can give you.",
         "I saw the entire film for the first time last night. It had scenes that I had never seen before with a run time much longer than any other versions I had watched. The additional scenes explained a few things, like how Zeb became so fluent in the Blackfoot language and what Deakins was hauling to Louisvulle in the first place. I was unaware that Deakins had come to a toll ferry in the river. Every other version I saw started with him on the road. Also the additional dance scene in the Blackfoot village was very interesting. I loved the movie before but this gave it much added depth. I just wish it was commercially available on DVD so I could add it to my collection.",
         "One of my favorite Kirk Douglas films is The Big Sky where he plays mountain man/trapper Jim Deakins. It's a great part for Douglas with his incredible charm and quick burn when someone does him wrong. The Big Sky was RKO Pictures big production for 1952. I'd like to say that Howard Hughes spared no expense in making this film, shooting a good deal of it in the Grand Tetons, the actual location for the adventures of many fur trappers. But for the life of me I don't understand why Hughes and RKO after doing that, didn't spring for color. Possibly because director Howard Hawks wanted black and white. His last epic film Red River had done well in black and white. Still I really think something was missed. RKO did use color on films with a lot less budget. There's a lot of similarity between The Big Sky and Red River. Both films involve a group of men on an epic journey into the unknown for business reasons. In Red River, John Wayne has to get that huge herd to market and has to use a trail few have used. In The Big Sky a group of independent trappers basically want to land a nice fur contract with the Blackfeet Indians where few whites have gone up the Missouri River. Going against them is a fur trading consortium kind of like the one John Jacob Astor put together. The trappers are mostly French Canadian Metis headed by Steven Geray, but also along is Arthur Hunnicutt who speaks the Indian language. Their ace in the hole is Elizabeth Threatt, a Blackfoot princess the trappers have rescued and are bringing back to her people in the hopes that her old man will be grateful. Hunnicutt is also the narrator of the film. Douglas and Dewey Martin join up with the group in St. Louis and the trappers have the usual adventures as they take the flatboat up into the Missouri River country. The scenes showing journey upriver are nicely photographed. Two others in the cast merit attention. Hank Worden does a nice job as a lost Blackfoot Indian who the trappers pick up. He may not be playing with a full deck, but he does come in handy. Jim Davis is one lean and mean villain as the company troubleshooter who wants to keep the independents out. Arthur Hunnicutt got an Oscar nomination for Best Supporting Actor for his role, The Big Sky proved to be his career film. Unfortunately he lost to Anthony Quinn for Viva Zapata. Still Hunnicutt's folksy charm was always something to look forward to in any film he was ever in. The Big Sky is one of the best films ever done about the mountain man era of the American frontier. If they'd only spent for color."
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "RKO Radio Pictures",
         "Winchester Pictures Corporation"
      ],
      "summaries": [
         "Jim Deakins is a frontiersman and Indian trader who is making a perilous journey with a group of other men up the Missouri River to get a large haul of furs from friendly Blackfoot Indians. The problem is that they have to get through hostile Indian territory first and they find that they have seriously underestimated the difficulties they will undergo. The large body of men who started the journey are gradually whittled down until only a hardy few, like Deakins, are left.",
         "In the early 1830's a group of men head up the Missouri river to trade with the Indians for fur pelts. Their goal is to meet the Blackfeet who have been friendly and are keen to trade. Jim Deakins is a member of the group and he is particularly interested in a Blackfoot woman, Teal Eye, who is traveling with the group. But then, so is his friend, Boone Caudill. Along the way they must face many dangers, from Mother Nature and the river itself as well as the fur trading company who want to keep their monopoly on trade. There are hostile Indians as well and slowly the men begin to wonder just how far they will make and whether they stand a chance of returning alive.",
         "Frontiersmen Boone and Jim Deakins join up with Boone's Uncle Zeb on a fur-trading expedition into the uncharted Blackfoot territory. The expedition's leader, the Frenchman Jourdonnais, has a plan for succeeding where no white man has traded before: he plans to return a kidnapped Blackfoot princess, Teal Eye, to her people and thus to win their gratitude and trade. Guided by Teal Eye and a crazy warrior named Poordevil, the trappers travel upriver, only to find their greatest obstacle is not Indians, but a ruthless pack of fur traders led by MacMasters and his henchman Streak. Along the way, Boone and Jim Deakins both fall under the spell of the beautiful Teal Eye, and their friendship begins to crack.",
         "The success of the journey focuses on keeping the Indian girl alive as well as themselves to complete trade with the Blackfeet."
      ],
      "budget": 2000000
   },
   "movielensId": 34229,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1952-08-19",
      "dvdReleaseDate": null,
      "directors": ["Howard Hawks"],
      "runtime": 140,
      "movieId": 34229,
      "title": "The Big Sky",
      "mpaa": "",
      "actors": [
         "Kirk Douglas",
         "Dewey Martin",
         "Elizabeth Threatt",
         "Arthur Hunnicutt",
         "Buddy Baer",
         "Steven Geray",
         "Henri Letondal",
         "Hank Worden",
         "Jim Davis"
      ],
      "imdbMovieId": "0044419",
      "originalTitle": "The Big Sky",
      "genres": [
         "Adventure",
         "Western"
      ],
      "youtubeTrailerIds": ["LepAacvaEO4"],
      "plotSummary": "Kirk Douglas stars as the determined leader of a band of Tennessee fur trappers who set out to explore the uncharted Missouri river in 1830 and find them selves battling American Indians.",
      "tmdbMovieId": 43367,
      "avgRating": 3.5625,
      "releaseYear": "1952",
      "numRatings": 24,
      "posterPath": "/lBa0CxZHT1q1w9MJGTzaDi85PkU.jpg"
   }
}