{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baseball",
            "id": 1480
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "little league",
            "id": 162739
         }
      ],
      "imdb_id": "tt0408524",
      "video": false,
      "title": "Bad News Bears",
      "recommendations": [
         32241,
         9981,
         9776,
         13997,
         23479,
         15045,
         14635,
         13778,
         9842,
         16232,
         31395,
         20697,
         143928,
         14805,
         21845,
         15992,
         7233,
         32162,
         10109,
         206
      ],
      "backdrop_path": "/1EIxg5120QFNzo62rlGTM4G4ZQP.jpg",
      "revenue": 34252847,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Morris Buttermaker",
               "gender": 2,
               "credit_id": "52fe455c9251416c75053e03",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Umpire",
               "gender": 2,
               "credit_id": "52fe455c9251416c75053e07",
               "name": "Ken Medlock",
               "profile_path": "/mHWHCbYkOwUPVHdAo7LvIMe1967.jpg",
               "id": 181067,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Prem Lahiri",
               "gender": 0,
               "credit_id": "52fe455d9251416c75053e0b",
               "name": "Aman Johal",
               "profile_path": "/saVZBiBHJZUzx3SJZNhLmzsEvQp.jpg",
               "id": 85616,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Roy",
               "gender": 2,
               "credit_id": "52fe455d9251416c75053e21",
               "name": "Greg Kinnear",
               "profile_path": "/agOTbOC76I6rC7TPuCTquvngXRu.jpg",
               "id": 17141,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Liz",
               "gender": 1,
               "credit_id": "52fe455d9251416c75053e25",
               "name": "Marcia Gay Harden",
               "profile_path": "/9TYI6LAu4S0vkn47RjLLgFrhtrc.jpg",
               "id": 4726,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Amanda Whurlitzer",
               "gender": 1,
               "credit_id": "52fe455d9251416c75053e29",
               "name": "Sammi Kane Kraft",
               "profile_path": "/hqtns9noaQUFU6xxE6tHtunMRK8.jpg",
               "id": 1264416,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe455d9251416c75053e2d",
               "name": "Brandon Craggs",
               "profile_path": "/sX0UMMZUy3RPJNx3VKWrvbo2cB.jpg",
               "id": 63548,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Kelly",
               "gender": 2,
               "credit_id": "52fe455d9251416c75053e31",
               "name": "Jeffrey Davies",
               "profile_path": "/iuJb3UhrcmuXyiSpsenNWGyn7yf.jpg",
               "id": 332033,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Timmy",
               "gender": 2,
               "credit_id": "52fe455d9251416c75053e39",
               "name": "Tyler Patrick Jones",
               "profile_path": "/vDNcop1ccwp1S8vm9bPwzwy4xYs.jpg",
               "id": 62821,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Chandalier",
               "gender": 0,
               "credit_id": "56a7c102c3a36828a9001af1",
               "name": "Lizz Carter",
               "profile_path": "/7qq4HMdVzuEerggXwFEzDdjZeoa.jpg",
               "id": 1023385,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Paradise",
               "gender": 1,
               "credit_id": "574b4f5392514119a50012ef",
               "name": "Nectar Rose",
               "profile_path": "/p5DyM7147ELNpuBXIUbz0LteBuQ.jpg",
               "id": 36137,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Peaches",
               "gender": 1,
               "credit_id": "574b4f8c9251410944000531",
               "name": "Lisa Arturo",
               "profile_path": "/osZvDdZKMMoLsiVaq3igLwpNhQ5.jpg",
               "id": 55619,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe455c9251416c75053dff",
               "name": "Richard Linklater",
               "profile_path": "/wNijRefhQCp0BkNqM5qhhdazDgx.jpg",
               "id": 564,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe455d9251416c75053e11",
               "name": "Bill Lancaster",
               "profile_path": null,
               "id": 15406,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe455d9251416c75053e17",
               "name": "Glenn Ficarra",
               "profile_path": "/mBBJWNAovK4EhIjfMFMIZncOssY.jpg",
               "id": 56411,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe455d9251416c75053e1d",
               "name": "John Requa",
               "profile_path": "/e6d3cXiqHFAgsroVnAd0zdGe9EF.jpg",
               "id": 56412,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.468036,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13341,
      "vote_count": 89,
      "budget": 30000000,
      "overview": "Morris Buttermaker is a burned-out minor league baseball player who loves to drink and can't keep his hands to himself. His long-suffering lawyer arranges for him to manage a local Little League team, and Buttermaker soon finds himself the head of a rag-tag group of misfit players. Through unconventional team-building exercises and his offbeat coaching style, Buttermaker helps his hapless Bears prepare to meet their rivals, the Yankees.",
      "similar": [
         10393,
         9655,
         9291,
         2300,
         86130,
         4942,
         11287,
         22881,
         8923,
         10637,
         13416,
         323677,
         37136,
         9614,
         9390,
         920,
         42888,
         9472,
         11770,
         17108
      ],
      "original_title": "Bad News Bears",
      "runtime": 113,
      "poster_path": "/25zNjE9CCnLQNnUchBAsVLFiPOL.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "2005-07-22",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "The bases are loaded... so is the coach.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Richard Linklater"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Bill Lancaster",
         "Glenn Ficarra"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0408524/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2MzEzMjI3M15BMl5BanBnXkFtZTcwNzgxNjEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Billy Bob Thornton, Greg Kinnear, Marcia Gay Harden | See full cast and crew »"],
      "reviews": [
         "Unskilled, belligerent group of young boys on a losing Little League baseball team get an alcoholic coach who eventually cleans up their act--and his own. Any film-buff well acquainted with the 1976 Michael Ritchie film \"The Bad News Bears\" will watch this remake in a perpetual state of deprivation. For every new ingredient added (a kid in a wheelchair, Hooters waitresses on the sidelines, a skateband interlude), there's a classic sequence dropped, funny lines omitted, a bracing sense of importance missing, and uncharismatic, non-plussed child actors who walk through their roles colorlessly. Of course, Billy Bob Thornton is a terrific substitute for Walter Matthau, but Matthau didn't carry the original film all by himself, and Thornton isn't fully in-character anyway (he's just breezing through). The whole early morning feel of Southern California Little League is missing, and the urgency of the original is gone, too (those kids had something riding on these games). Director Richard Linklater obviously was fond of the 1976 version, but he knows the notes without hearing the music; he supplies updated comedic touches without seeing the relevancy, and his tone and narrative are doggedly straightforward (except for the strange opening sequence, which immediately gets the picture off on the wrong foot). A sad botch. *1/2 from ****",
         "When filmmakers get the idea to remake a classic movie, often it's because he or she feels that something was missing from the original. They feel that, by placing their unique stamp on the new film, they can satisfy unanswered questions, plot points, etc, while maintaining the basic dignity and character of the original. So...based on that theory, Billy Bob Thornton's rationale for the remake of \"The Bad News Bears\" was that the original had too many letters in the title (in a bold and highly daring move reminiscent of Ed Wood at his finest, Thornton decided to drop \"The\", changing it simply to \"Bad News Bears\"), not enough swearing...and a kid in a wheelchair. Oh, and he changes enemy Yankee pitcher's last name from \"Turner\" to \"Bullok\" for reasons unbeknownst to anyone but himself. With revolutionary alterations such as these, don't be surprised if you pick up the rental box half a dozen times while watching the movie to make absolutely sure that you have indeed rented the correct film. Basically, the plot can be summed up as \"Bad Santa coaches a group of misfit kids\". Yawn. We've seen this role, this performance, from Billy Bob Thornton one too many times. Thornton wants to bowl us over with the 'shocking' vulgarity of youth, but a trip to \"Hooters\" and Tanner teaching a boy in a wheelchair to curse both turn out to be so lightweight that it is likely that only the Reverend Jerry Falwell would take offense. At best, the casting was marginal, and at worst, the audience is forced to wonder if the director actually auditioned the kids or merely closed his eyes and chanted 'Eenie, Meenie, Mynie, Mo\" while holding a stack of acting resumes. Sammi Kane Kraft (as Amanda) was a great baseball player with limited acting ability, and Timmy Deters was only modestly successful in trying to recreate the role of Tanner Boyle. Tyler Patrick Jones as Timmy Lupus was far and away the most talented of what basically amounted to a mediocre cast of child actors, but he was utterly wasted in this film and was limited to a few one-liners that must have ended up on the cutting room floor from \"Bad Santa\". Naturally, Thornton is no match for the venerable Walter Matthau as Buttermaker. Whereas Matthau was irascible and cantankerous in a lovable 'Grandpa's dipping in the cider again' kind of way, Thornton's version of Buttermaker is creepy enough to make us think of adequate background checks and the stupidity of parents who would willingly leave their children alone with him. Per his film tradition in his post \"Sling Blade\" days, Thornton goes out of his way to remove any heartfelt sentiment from the plot, and thus the friendship between Timmy Lupus and Tanner Boyle never materializes. That adds to what is perhaps the most irritating part of the film: the introduction of a new player (Tony Gentile as Matthew Hooper). It is an unnecessary plot device, possibly added only because the always classy Thornton had some good 'kid in wheelchair' jokes that he was just itching to use, and adds a touch of surrealism to a movie that should be imminently grounded in realism. In fact, Thornton changes one of the most touching moments of the original movie by handing it to Hooper (a character who, let's face it, has no redeeming qualities other than the fact that he's in a wheelchair) in one highly unrealistic scene; he thereby successfully strips even more of the heart away from the original film. Which, judging from Thornton's film-making history, was probably exactly what he intended to do. In short, there are undoubtedly worse remakes out there (\"War of the Worlds\" and \"Bewitched\" come to mind), but not many. If you're thinking of renting this film because you're desperate for some true seventies banality, allow me to suggest that you save the money and instead try catching either the rerun of \"Alice\" where Flo says \"Kiss my grits\" for the eighteenth time or the action-packed episode of \"My Three Sons\" where Fred MacMurray lights his pipe. If you choose to rent the film anyway...well, don't say I didn't give you any other viable options.",
         "I'm a fan of Billy Bob - but he ain't no Walter Matthau. Every character is just plain flat - with nothing to act off of. You don't really care about anyone in the movie. Linklater is a much better director and you are better off watching any other movie that either he or Billy Bob has made. A waste of money all around in my opinion. Just go and watch the original - you won't regret it. (They won't let me make my comment unless I have 10 lines of text - but I have nothing else to say. Guess I'll just have to keep typing until they let this go through. Opps not enough yet - how about this time. Still not enough - I think this will make it)",
         "If this had been the original, it never would have been remade. Here are my observations of where they went wrong: The original was well acted and believable. The remake was an over the top farce with some of the worst acting I've seen in a major motion picture in along time. In the original, Kelly and Amanda looked 12. In the remake, they looked 17. Watch them walking with the other Bears, they are about a foot taller. The Coach Turner character in the first was clearly defined. He was an over aggressive sports dad pushing his son and team relentlessly, eventually melting down and hitting his son in public. The audience was never given a feel for the new Turner, except that he was somewhat wimpy, but unreal as far as any person anyone has ever met. They removed the scene of Turner hitting his son, then telling his wife that it was because Joey could have killed Engelbert. In reality, Turner was p'd off because his son disobeyed him. In the remake, Turner seems genuinely concerned for Engelbert. There was almost no character development in the remake. When I saw the first, I felt like I knew the major characters. In the remake, we learned very little. For instance, Lupas in the original was a painfully shy kid who would prefer to be left completely unnoticed. In the remake, he was just a weird kid who had trouble catching. The emotion was totally gone. The scene where Joey wouldn't throw the ball to put Engelbert out to get back at his father; the scene where Lupas begs not to be put in and Buttermaker tells him he didn't come into this life to watch from the bench; the scene where Lupas finally catches the ball to get the Bears out of the inning; the scene where Kelly gets thrown out at the plate; I could go on forever. There seem to be strippers in the remake for no apparent reason. The Buttermaker character is supposed to be a sad loner type. To think that Buttermaker is dating strippers take a lot of the sympathy away from him. Ultimately, there was no magic in the second one. And quite frankly no reason to remake this movie. It occurred to me that the producers of the remake didn't quite get the point of the first one. Or they are insulting teenagers by not believing they are smart enough to get it. I thought that changing the sponsor to a strip club was funny. And having the representative who sued the league be a woman was a nice update. Other than that, I see nothing where this movie adds to what I already saw. And I didn't even list half of what was worse about it. If you honestly thought the new version was better, can I ask specifically what you thought was flawed about the original and how the remake did it better?",
         "I just want to know exactly who Mr. Linklater was trying to appeal to in this movie. Not only is the kids' sport genre tired, they are geared primarily for children most of the time. But with Billy Bob Thorton (who I thought was hilarious in \"Bad Santa\"), one would guess they are trying to bring in the older audiences. The movie feels like it has split personalities. There is a ton of swearing and adult humor that would definitely NOT appeal to parents of younger children, but many of the jokes just weren't funny to me because they were aimed at the younger children. The movie is not terrible, but its not good either. It is simply a forgettable movie, which is a shame because I think Richard Linklater is a great director and Billy Bob Thorton seems like a natural when it comes to comedic timing.",
         "Some of you may be wondering what exactly the \"Bad News\" in \"Bad News Bears\" really means. Well it is supposed to mean bad news for the other teams in their baseball league, as it did in the original movie. Howevair, with this movie it means bad news for the viewers. All kidding aside, it really eats monster butt. Sure, there are a few good one liners (3 maximum), but not nearly enough to hold the movie together or make it enjoyable for that matter. Oh, and if you are a fan of the art of acting at all, it's a good move to side-step this one. The child acting is HORRENDOUS on all accounts, nearly making it unwatchable. But definitely making it un-rewatchable. Then there are the lame updates in the script only topped in horribility by the complete changes to it. Fans of the original don't taint your memories with this god awful movie.",
         "Who bothered with this? It seems that Billy Bob Thornton got a bundle of cash thrown at him to take Bad Santa to the Disney set with horrible results. The movie doesn't even have the dignity to show the audience the movie but throws all the exposition in the first ten minutes of the movie in some of the oddest dialogue ever committed to film. The audience is left to assume this is Bad Santa 2 and honestly, it fails at that. The film then dissolves into vignettes that wouldn't be out of place in a particularly rancid '80s sitcom. Let's put it this way: there was no reason for this film to be made unless someone really wanted a pathetic sequel to Bad Santa. While that film worked on some level, that does not translate to this at all. It's not even worth a bargain bin price.",
         "I generally am a Richard Linklater fan and consider Mr. Thorton one of the finest actors and writers we have. I'd like to kick them both dead on in the nuts for this one. The original was a structurally flawless piece of work and their version was horrendous and stupid. Everything the original did with grace, skill and humor they trampled over needlessly. Every time they changed Lancaster's original script they did so without tact and screwed up the rhythm of the piece See the original. It remains a masterpiece and one of the greatest sports movies ever made. This is a cheap remake that should have never been made. So many great scripts and premises have been screwed up, why not remake those and start with JJ Abrams original screenplay of \"Regarding Henry\" another movie where a top notch director did not do his best work. Now that should be remade how Abrams envisioned it. He's never written anything better, nor have most of the rest of us.",
         "With some skepticism and fairly low expectations, I rented this film. Understand, I'm a big fan of Richard Linklater, and an admirer of Billy Bob Thornton's work, hence there were certain expectations coming into this viewing. For the most part, my expectations were met. This film is certainly worth a watch. There is no point in comparing this film to the original, so I won't bother to do so. The two were made during different eras by different actors and filmmakers, so why stack them up against each other. This film stands nicely on its own. Richard Linklater has simply become the master of the early teen film. He beautifully handled his mostly non-professional cast in 'School of Rock' (though it must be said, he did have Jack Black to help him pull it off), and the same can be said for this cast of mostly neophyte actors. Linklater is somehow able to draw a certain feeling of realism from his youthful actors. I think this is because he's not afraid to go for naturalism, and he certainly doesn't pull any punches. Linklater allows his young cast members to be just as crass, cruel and feisty as you would expect from a group of 10 to 12-year olds in this modern era. At the same time, however, he is able to instill in his characters a sense of youthful innocence and a continuing level of 'wide-eyedness' that make his characters lovable. In addition, Linklater is careful in his characterization, he makes sure to provide a distinct personality for each of the kids in this film, something that isn't easy to do with 12 kids in under two hours. The other big bonus of this film is the enjoyment of watching Billy Bob work. Billy Bob is great in these roles as the 'sexy sleazoid' who just manages to skim the surface of life. Beneath the somewhat reptilian outer skin of Billy Bob's Buttermaker is a human being who has compassion and understanding for others who are in his 'peer group', that is, the rejects and also-rans of life. He does a convincing job creating an empathy within his character for these kids who are all castoffs from the mainstream. In addition, Billy Bob delivers a lot of very funny lines that are steeped in naturalism, and thus guaranteed to create a great deal of offense to anyone concerned with propriety and/or political correctness. I'm not guaranteeing a cinematic masterpiece with this review, but I will suggest that if the film is given a chance by objective viewers, it will be guaranteed to provide nearly two hours of laughs and entertainment. Don't expect a 'Little Giants' here, with a lot of gross sentimentality...this children's sports film gives you something a bit different!",
         "Along with others who were born in the late Sixties, I felt that seeing the new *Bad News Bears* was somehow mandatory, if only to indulge in the guilty pleasure of nostalgia. We all knew it would suck, didn't we? -- but we had to see it anyway. Let it be said at once that Billy Bob Thornton as Coach Buttermaker is quite a come-down from the immortal Walter Matthau in the same role. Since the script of this new version is quite identical to the original, much of the degradation displayed here must be put at the feet of Thornton, a notorious ad-libber. None of us, young or old, need to be subjected to exclamations such as \"You guys look like the last s--t I took.\" Or to hear copious references to Greg Kinnear's family jewels. But whether through the script or through Thornton's egregious improvising, director Richard Linklater reveals a complete lack of control. Evidently, the best that he feels he can do with this material is to allow it to subside deeper into crassness than the original. The whole enterprise becomes a dreary exercise in upping the ante: Matthau's Buttermaker was a pool cleaner; Thornton's Buttermaker is a rat-exterminator . . . in the '76 version, the Bears are sponsored by Chico's Bail Bonds; in the 2005 version, they're sponsored by a strip-club. Get the idea? What had been a gritty, rather incisive look at everyday Americana has become merely an exercise in crudity. This degeneration of standards can legitimately be argued away as the eternal complaint of the old, but the feeling persists that the original *Bad News Bears* was still made for KIDS, despite the more realistic dialog, situations, and characters. (And Matthau was never a scene-stealer; Tatum O'Neal shone just as brightly as he did. And rightly so.) The Little Leaguers in this film are sadly subordinate to the leering Coach -- guess who the intended audience is? (Hint: not kids.) By the way -- speaking of come-downs -- the iconic role of bad-boy Kelly Leak as portrayed by the super-iconic Jackie Earl Haley has been utterly neutered, here. The new Kelly is played by some incipient Calvin Klein model pretending to be a skate-punk. Pee-yew, man. Hey Jackie Earl, wherever you are: your status as the preeminent prepubescent bad-ass is, like, totally safe. 1 star out of 10."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Media Talent Group",
         "Detour Filmproduction"
      ],
      "summaries": [
         "Morris Buttermaker, an alcoholic pest removal worker and former professional baseball player (for a very short time), is recruited to coach and train a failing baseball team of 12-year-olds which is about to be thrown out of the league.",
         "A grizzled little league coach tries to turn his team of misfits into champs."
      ],
      "budget": 30000000
   },
   "movielensId": 34321,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "2005-07-22",
      "dvdReleaseDate": "2005-12-13",
      "directors": ["Richard Linklater"],
      "runtime": 113,
      "movieId": 34321,
      "title": "Bad News Bears",
      "mpaa": "PG-13",
      "actors": [
         "Billy Bob Thornton",
         "Ken Medlock",
         "Aman Johal",
         "Greg Kinnear",
         "Marcia Gay Harden",
         "Sammi Kane Kraft",
         "Brandon Craggs",
         "Jeffrey Davies",
         "Tyler Patrick Jones",
         "Lizz Carter",
         "Nectar Rose",
         "Lisa Arturo"
      ],
      "imdbMovieId": "0408524",
      "originalTitle": "Bad News Bears",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["1RPfmcc5L7A"],
      "plotSummary": "Morris Buttermaker is a burned-out minor league baseball player who loves to drink and can't keep his hands to himself. His long-suffering lawyer arranges for him to manage a local Little League team, and Buttermaker soon finds himself the head of a rag-tag group of misfit players. Through unconventional team-building exercises and his offbeat coaching style, Buttermaker helps his hapless Bears prepare to meet their rivals, the Yankees.",
      "tmdbMovieId": 13341,
      "avgRating": 2.83333,
      "releaseYear": "2005",
      "numRatings": 558,
      "posterPath": "/25zNjE9CCnLQNnUchBAsVLFiPOL.jpg"
   }
}