{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "historical figure",
            "id": 6165
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "jazz artist",
            "id": 155850
         }
      ],
      "imdb_id": "tt0095515",
      "video": false,
      "title": "Let's Get Lost",
      "recommendations": [
         123648,
         215407,
         362428,
         237957,
         374728,
         76388,
         40985,
         202768,
         88302,
         203226,
         134220,
         49479,
         147306,
         269969,
         194602,
         42238,
         122683,
         42206,
         227289,
         148050
      ],
      "backdrop_path": "/fMCSsAnsesEiarVkStrTsiQN81k.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "himself",
            "gender": 0,
            "credit_id": "52fe465e9251416c9105230b",
            "name": "Chet Baker",
            "profile_path": "/tlHqCry3gcgPK4bGDpolP09egm1.jpg",
            "id": 118179,
            "order": 0
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe465e9251416c91052311",
            "name": "Bruce Weber",
            "profile_path": "/kzUQLbfwBBZKTbneFdncDooHZjk.jpg",
            "id": 118180,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 1.360957,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37640,
      "vote_count": 12,
      "budget": 0,
      "overview": "Documentary about jazz great Chet Baker that intercuts footage from the 1950s, when he was part of West Coast Cool, and from his last years. We see the young Baker, he of the beautiful face, in California and in Italy, where he appeared in at least one movie and at least one jail cell (for drug possession). And, we see the aged Baker, detached, indifferent, his face a ruin. Includes interviews with his children and ex-wife, women companions, and musicians.",
      "similar": [
         627,
         872,
         8363,
         9352,
         39939,
         313369,
         244580,
         10537,
         45272,
         31900,
         15121,
         10020,
         3933,
         252,
         254470,
         316029,
         353616,
         277216,
         2005,
         525
      ],
      "original_title": "Let's Get Lost",
      "runtime": 120,
      "poster_path": "/coS8LgPuPtMxy9mCw4shr0r5Ljg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1988-09-15",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Bruce Weber"],
      "runtime": 120,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095515/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5MDExMDEwM15BMl5BanBnXkFtZTgwMjg4ODY2MDE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Chet Baker, Carol Baker, Vera Baker | See full cast and crew »"],
      "reviews": [
         "Let's Get Lost could have so easily been done badly. Intense fandom doesn't often make for objectivity, and the tragic-artist-gone-to-seed narrative is so, so tired. But this film kicks those limitations right over. It's tough about the ugly facts of Chet Baker's life as a liar, user, and junkie. At the same time, it never allows the viewer to forget the intense beauty Baker created as a musician, and embodied as a young man of perfect allure. There are images I'll never forget: the expressions of his family as they listen to his music, his ex-wife lost in remembered pleasure; his daughter, pained; his dead-ringer son, uncomfortably smiling. The older, ravaged Baker, in the back seat of a convertible with two women, murmuring to them like he's in a dream. The stills of he and his second wife, both so stunning and so clearly in love, burning for each other. And more than that, the music, aching and romantic, and always so lonely, always about longing for some woman in some place that's beyond reach. I am grateful to Bruce Weber for creating this film. It's why I go to the movies like some people go to the mountains or the sea, to church or to some lover's arms: it got me lost.",
         "We have to be grateful to Bruce Weber for giving us this film. Monetary gain could not have figured in on it, as jazz, in spite of the great artists it produces, could never attract the amount of people to make a venture like this profitable. The big bands of the thirties and forties had jazz musicians as members, and did incorporate some jazz solos in their arrangements, but could not be considered a jazz venue. They generated millions of dollars, because the dancing public was so vast, there was no TV, and the leaders were groomed to be lionised like movie stars. (See \"The Trouble With Cinderella\", Artie Shaw's autobiography on his disenchatment with stardom. Jazz was played in small clubs seating at the most two hundred people, while dance halls could accommodate as much as fifteen hundred dancers. Any footage of an important icon like Chet is welcome, but some scenes are not what they seem. The recording session is a staged event to simulate a record date. The opening scene on the beach sans Chet is gatutitous. Maybe Weber wanted to show the local Southern California beach scene that Chet loved. The scene in an amusement park with a stoned Chet on the \"Dodgem\" cars is puzzling. \"Chet's women\" add a great deal of interest to the film. His mother describes how the toddler Chet was transfixed by the sound of the big bands on the radio. Ruth Young daughter of a wealthy Hollywood producer, smitten with Chet and jazz, describes with an unusual lack of bitterness, the insane life of loving a junky, who was really in love with her inheritance and heroin, and made short shrift of her money to finance his drug taking. She sings briefly in the film and I thought showed great promise, but she failed to seek a career in music. Diane Vavra had no money for Chet to squander, but she filled in as someone knowledgable about music to help Chet. Carol Baker, \"the long suffering wife\" (and how she suffered) gave Chet three beautiful children, who Chet barely noticed, or provided for in his chaotic race to the grave. With all that said, what about the music? Well I can tell you that in an era of great heroic trumpet superstars, like Dizzy Gillespie, Roy Eldridge, Maynard Ferguson, and many others, who could dazzle you with notes in the highest register of the trumpet, and improvise incredible melodies in the upper register, and \"scream\" above a roaring fifteen piece band, Chet was not in that mode at all. He rarely practiced, had no high register, but wove a soft filagree of delightful improvisations on standard popular songs. In my opinion he reinvented trumpet playing in the fifties. His playing said, \"Dizzy's great, but I do it this way.\" His movie star looks did not hurt his appeal one bit, and his singing which has many detracters, I think will prove to be more appreciated in years to come. I loved every note he played and sang when I first heard him in the fifties, and my appreciation and love for this man, grows every year.",
         "Bruce Weber's obscure documentary (currently on two screens at New York's Film Forum) on Chet Baker is the best possible way for those who aren't terribly familiar with his work or who he was- like myself- and I'm sure will more than please his avid fans out there. For the former, Baker is one of the \"cool\" west coast jazz pioneers, who defied some expectations while still being dismissed by many east coast (NY) jazz aficionados. Truth be told, Baker isn't entirely my cup of tea (very talented, of course, though I won't be listening to him as frequently as Coltrane or Parker or even Armstrong). This out of the way, Baker the man is an endlessly fascinating individual, one of those artistic forces who made life a hell for those around him, but also was a real intuitive musician, who when not trying to fix his dental problem, or drug problem, or problem with the law in other countries, he could play his trumpet or sing his soft melodies any time, anywhere. It's a major credit to him that the quality of his performances of the period of the film's present tense (1987-88) is not too far from that of his prime in the 50s and 60s. But Weber isn't simply out to show him performing his songs. Like a jazzman himself, Weber is into improvisation with his choice in jagged but smooth angles with the camera. Aside from the intrigue that comes in showing Weber interviewing his past friends and fellow musicians (some who have simple stories like \"he could play much faster than me, etc etc\", and others that are darkly funny, like how he could have sex with a fellow musician's girlfriend in the dark without the other musician knowing after a five second lapse), ex-wives and female counterparts (it runs the gamut- those who care deeply about him, but have been hurt, and even a singer who is a bit more than bitter, but wise, to Baker's ways), and even his kids, we see the man himself with no punches pulled. Baker, with a face as chiseled as Clint Eastwood's and with twice the number of stories to tell, and a slightly wavering way of talking where one's not sure if he might slip into sleep mid-exposition. We see him talk of his time in the army, where he disarmingly (no pun intended) got out of duty while on a close-call avoiding the nut-house. We see his tales of being busted in Europe and spending over a year in jail. He even talks in a bittersweet tone about his kids and about fallen musicians and friends of his. Most captivating, though, is the issue of his teeth, which becomes Weber's Rashomon tool of technique. It's not enough that Weber already slips so well into an aesthetic that I've rarely seen anywhere else in documentaries, where we get a plethora of images in several seconds *without* montage, and scenes of Baker with friends/kids/admirers (Flea is one of them) knocking around town at night that are real but close to feeling like it shouldn't be this real. Weber also throws in the crucial element of Baker as a multi-layered man with more than one persona to him, notably to his ex-wives. He tells the story of how he got his teeth knocked out, fighting with five black guys in a bad drug deal situation on the streets of LA. It sounds simple enough, as one of those wacky but dead-serious stories those in the jazz world, or just music in general, end up having when dependent on drugs (in this case heroin). But one girlfriend/singer says something else, that it had to do with Baker being given a specific 'lesson', to \"take away what's most important\", which was his mouth. But then even another says something completely different, at least I think so, and it's here that Weber makes Let's Get Lost such a complex peek (just a peek) into this man. To be sure, there are times questions are asked and the response is just \"lets not go into that\", which is fair. Yet one comes away with Let's Get Lost with a pure impressing on who Chet Baker was, in a sense; he's a legendary musician in some circles, but also spent years on welfare when he couldn't play; he had one wife who was half Pakistani and half-Indian, who is rarely mentioned in the film; the kids don't show up much into the film until the last section, with more time spent around the mother(s) than Chet himself. But it all adds up to a sense, which is all that Weber could really get. It's cool as a good drink, and all about a man I won't soon forget.",
         "See this film. Amazing to see how destructive genius can be. The film looks great, outstanding sound-track, great editing. I'm not really a jazz fan, but I loved watching and seeing this movie. It's going to be re-released this year.",
         "I remember seeing and loving this movie when it played at Film Forum in NYC back in the late 80's. It was recently re-released for a limited engagement so I took my wife to see it (again, at Film Forum). Almost twenty years later, it's just as beautiful and heartbreaking to watch. The brilliance of this movie is that you don't have to be jazz or Chet Baker fan to enjoy it -- my wife and I have a marginal interest in jazz and we loved it. It's a brilliant portrayal of how talent, youth and beauty are destroyed by excess, and you'll feel both awe and pity for the late Mr. Baker. DVD is supposed to come out at the end of the year -- rent it, you won't be sorry.",
         "This film is a must see for any Baker fan and even any Jazz fan. Baker really did redefine the 1950's jazz scene with his combination of mesmerising trumpet playing and angel like vocals. His instantly recognisable style has brought joy to many jazz fans over the years and even now his legend lives on some 16 years after his death in the most mysterious of circumstances. This film tells a very candid story of Chet charting his terrible affliction with drugs as well as honing in on his god given talents. It is very highly recommended and is long overdue for a release on DVD as some fellow reviewers have alluded to. I will certainly be first in the queue to buy this must see title if and when it is re released.",
         "This film is long overdue to be remastered and released on DVD. The VHS transfer seems quite lazily done. The opening title pretty much goes off the screen on my TV. Would love to see this film in all its glory once again.",
         "In the 1950's, cool was the only way to fly, and Chet Baker was what James Dean always wanted to be. Those cool cat days, where the \"cool\" kids of today would be seen as jerks, sissies, geeks, nerds or worse, had a very restrictive behavioral code...you kept your icy cool at all times in a very narrow emotional range no matter what happened, and never acted beneath your age or silly or goofy, both of which are so commonplace in today's arrested-development kids of all ages. That detached air was the very essence of cool then, along with the ducktail hair, the jeans, the smokes rolled up in a t-shirt sleeve, the coffee bars, the hot rods, and the gals.....with their angora sweaters that balled up when felt up. Those were the glory days shown in this film that were so attractive to us then. Every day a salad day, but those soon turned into grass days and then into poppy days for poor Chet. Chet was all of that cool cat essence early on, and so much more for jazz lovers, especially in his recordings with Russ Freeman arrangements and accompaniment. The Okie Adonis Baker had almost no education or sophistication and was so easy, soft and simple cool, too simple and easy.......and he became a living sucker perfectly ripe for the easy plucking by promoters, fellow musicians and fame-loving men and women alike. And was he ever plucked, but he didn't resist too much as his soft, sad personality was like a blotter....a reflection of what life happened around him but not a significant happening in itself, other than his unique musical expressions. In the film, it was plain to see that the last 20 years of his life were the killer drug years, as in 1967-68 he was seen to still look and sound good. It all went downhill from there, but the soul-sensitive voice, the soft trumpet toning that was always more an extension of his voice than a separate instrument, were still intact and probably more sensitive and sadly expressive than ever. Yes, Chet was a sad man of obvious low self esteem common to kids raised in near poverty, but shame and embarrassment for his many flaws had been well beaten out of him by life at the end. He was, as were many in his world, of the character and in the environment that made him an easy target for any addiction that allowed him the freedom to lose himself into his music and be cooler to himself and to the vices common to his world.... fast women, hard drugs, and getting by on his talent alone without having to work hard for a living. Whatever was easiest and felt best was always what Chet did and, and as with many of the most talented in any endeavor, he failed at most of these except for his music, and his resulting God-may-take-me-at-any-time-who-cares? malaise was clearly present and almost pleading for it near the end when answering interviewer questions in a drugged-out stupor. I think he fell out of that hotel window in one of his drug stupors and died from it, on purpose or not. Simple as that, knowing he was a deep-in-a-dream junkie. No embellishment to it for effect is probable, like he did so often for sympathy or for a few extra bucks he never seemed to save from working a thousand gigs all over the world in 40 years. I just hope his wife Carol and his 3 kids saw some money from the big nostalgia CD sales resulting from this film. They sure looked as though they could use it. From their share of the proceeds from my Chet CD collection alone, they should be a lot better off than they looked in the film. Roland's on Steiner in the Marina and The University Hideaway on upper Fillmore in San Francisco were my early hangouts in those days, and I can still feel Chet's mood near there on cool, foggy SF evenings that are so common there even if Chet is long gone, along with those old places. With enough time, his many failures in his personal war with life will be forgotten by all until only his great music remains to mark his legend.",
         "The re-release of Let's Get Lost is simply a gift. Bruce Weber spent six months on the road with Chet Baker in 1987 to catch a glimpse of the enigmatic and ultimately elusive musician. The film noir feel to the documentary is evoked from the beginning with a sublimely beautiful shot of Baker's old and wizened face while sitting in the back of a convertible, his hair dancing in the wind. Even though he is sitting between two beautiful women, one being his partner at the time; Baker's melancholy is evident. With every breath Baker exudes the pain and tribulations of his fifty seven years. It is no mistake he found his home in Jazz, the perfect catharsis and sanctuary for someone of his sensibility. His physical beauty as a young man is perfectly juxtaposed with the changed man we meet in the documentary. Yet even with his gaunt appearance and ambling speech, Baker still possesses a charm and charisma that is uniquely his own. It becomes clear as the documentary progresses that Baker left a lot of pain and heartbreak in his wake. Ex-wives and past girlfriends talk unkindly about him in one breath and praise him in the next. His magnetism was a godsend and a curse in the end. Whatever is said about Baker what is undeniable is his musical prowess. His flair for the trumpet coupled with his beautifully sad voice are an irresistible combination. An appearance at Cannes with Bruce Weber during the opening of one of Weber's documentaries showcases a heartbreaking rendition of 'Almost Blue' at the after party. He silences the baying party goers before beginning and proceeds to close his eyes and expose his soul in front of the audience. It is moments like these that captivate the viewer. Let's Get Lost remains one of the finest musical documentaries ever made, up there with D.A. Pennebaker's 'Don't Look Back'.",
         "\"What's the problem here?\" The voice, querulous and groggy, emerges from the darkness, aborting a smoky run-through of Elvis Costello's 'Almost Blue'. Bruce Weber's Oscar-nominated documentary concerns itself with the same question: what gnaws at Chet Baker, and just how did the feted pretty boy of the West Coast 'cool school' end up such a frail, hollow-cheeked wraith? The most obvious answer is: junk. As fellow jazz trumpeter and addict Miles Davis observed in his autobiography, \"musicians were considered hip in some circles if they shot smack\"; the logic being that heroin might bestow some of the genius of Charlie Parker or Miles upon the user. Though a fine player, Baker may have privately worried that he would never be taken as seriously as Miles (who predictably accused him of aping his licks). More than likely, he thought he needed a poppy or three to keep up: the serial seducer seduced - out of his looks and his teeth (courtesy of an unprompted assault from drug dealers, so he said), though hardly out of talent or charm. Nor intelligence: those baby blues still burn with roving, wily intensity. A combination of cheekbones and intuitive musicianship (his intimate, androgynene croon being just as potent as his way with a horn) had originally propelled the former Gerry Mulligan Quartet sideman into the pantheon of jazz greats. But arguably it was William Claxton's famous photos of him relaxing between takes in the studio (\"he looked like a Greek God\") that sealed the deal: a classic example of the fully-packaged star. A white one. A very marketable jazz Elvis. Italian B-movie roles and sell-out concerts were his for the taking. By the time Let's Get Lost first emerged in 1989, he'd accrued a new generation of admirers for whom the legend of Baker's turbulent rise and fall only added to his cult appeal. And there is a circularity here: Weber's studiedly monochromatic profile, all inky shadows and searing white-outs, replete with 'authentic' crackles on a modern soundtrack, was released during a decade in which 'cool', that most chimerical of concepts, had once again become a commodity, a negative onto which advertising execs and filmmakers etched received, homogenised visions of sleek 1950s style. Baker is being sold twice over - first by opportunists, second by grave robbers. Albeit, slightly premature ones: unlike James Dean or Neal Cassady, this 'doomed, beautiful youth', a living Kerouac creation, was still very much alive at the time Weber dug him up, and the prince-turned-skid-row denizen is not an altogether pretty picture. A portrait emerges of an arch manipulator who conned his way out the army, then into the hearts of a string of emotionally and physically abused wives, lovers and friends. Fellow trumpet player Jack Sheldon talks of how Chet screwed his girlfriend, literally under his nose, while he wasn't looking. As in life, in art: here he is again, reducing Natalie Wood to silent orgasms with his playing in 1960's All The Fine Young Cannibals, while her jealous date smoulders beside her. \"Chet cons people\" is the consensus from more than one party. \"He has the ability to elicit sympathy - and it's all a big act.\" The story of what happened to Baker's teeth is similarly dismissed as \"Typical Chet, gaining sympathy for himself. Someone kicked his ass for his manipulating ways\". It's no surprise to discover that these wounded women, rather than focus on the common enemy, an absent father to children by different mothers, reserve most of their spleen for each other. Ruth Young for instance, Baker's torch-singing girlfriend for 10 years, is \"that bitch - his downfall.\" Interviewed separately, Baker lets it all wash over him. Mainly, because the adoring, highly partisan Weber (for whom Baker's iconic, homoerotic appeal was obviously meat and potatoes) hardly ever gives him a good grilling, happy to let the former jailbird seduce him along with everybody else. \"Sometimes Chet would tell a story and we would be spellbound, but the next day we'd find out it wasn't even true,\" says Weber, who would simply prefer to be in love, and fascinated, with his quarry. \"It was about being illusioned and disillusioned and illusioned again by a hero\". The irony, of course, is that the filmmaker, whose hugely influential black-and-white fashion photography exemplifies a certain 1980s aesthetic, seems so oblivious to the fact he's being taken for a ride: the manipulator manipulated. This is a swooning postcard from one poser to another, woozily segueing as if in an opiate stupor between interviews, verite-style recreations, archive footage and new studio performances (these latter scenes all but nudge us to check out how much Chris Isaak and Red Hot Chilli Peppers bassist Flea resemble Weber's hero). The approach might well echo jazz's free-form schematics, but unkinder descriptions might also include 'rambling and shapeless'. The music, of course, is sublime, and it's as immaculately framed as you'd expect - though the best moments are those apparently caught on the fly; the unstaged and unframed: Baker in a nightclub patiently indulging young, wide-eyed jazz acolytes with warmth and humour; his appearance at a Cannes music festival. Pleads the promoter (after Baker stops playing because people aren't listening), \"So many people want to hear you, and may never get the chance again!\" Comes the deadpan reply, \"I ain't dead yet.\" That would happen a few months after filming ended, on Friday 13 May 1988. Aged 58, he had fallen out of a second-floor Amsterdam hotel window, hitting the pavement like a bum note. The local press reported that a 30-year-old man had been found with a trumpet. Even in death, he seduced them out of truth."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Little Bear Productions",
         "Nan Bush"
      ],
      "summaries": [
         "Documentary on the life of jazz trumpeter and drug addict Chet Baker. Fascinating series of interviews with friends, family, associates and lovers, interspersed with film from Baker's earlier life and some modern-day performances.",
         "This documentary about jazz trumpeter-singer Chet Baker intercuts footage from the 1950s, when he was part of West Coast Cool, and from his last years. We see the young Baker, he of the beautiful face, in California and in Italy, where he appeared in at least one movie and at least one jail cell (for drug possession). And, we see the aged Baker, detached, indifferent, his face a ruin. Includes interviews with his children and ex-wife, women companions, and musicians."
      ],
      "budget": 0
   },
   "movielensId": 34416,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-09-15",
      "dvdReleaseDate": null,
      "directors": ["Bruce Weber"],
      "runtime": 120,
      "movieId": 34416,
      "title": "Let's Get Lost",
      "mpaa": null,
      "actors": ["Chet Baker"],
      "imdbMovieId": "0095515",
      "originalTitle": "Let's Get Lost",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": ["9PfdYQzeJk0"],
      "plotSummary": "Documentary about jazz great Chet Baker that intercuts footage from the 1950s, when he was part of West Coast Cool, and from his last years. We see the young Baker, he of the beautiful face, in California and in Italy, where he appeared in at least one movie and at least one jail cell (for drug possession). And, we see the aged Baker, detached, indifferent, his face a ruin. Includes interviews with his children and ex-wife, women companions, and musicians.",
      "tmdbMovieId": 37640,
      "avgRating": 3.35,
      "releaseYear": "1988",
      "numRatings": 10,
      "posterPath": "/coS8LgPuPtMxy9mCw4shr0r5Ljg.jpg"
   }
}