{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0417182",
      "video": false,
      "title": "The Talent Given Us",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Allen",
               "gender": 0,
               "credit_id": "52fe4cd59251416c91101941",
               "name": "Allen Wagner",
               "profile_path": null,
               "id": 1174020,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Bumby",
               "gender": 0,
               "credit_id": "52fe4cd59251416c91101949",
               "name": "Judy Wagner",
               "profile_path": null,
               "id": 1174023,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Maggie",
               "gender": 0,
               "credit_id": "52fe4cd59251416c9110194d",
               "name": "Maggie Wagner",
               "profile_path": null,
               "id": 64245,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Judy",
               "gender": 0,
               "credit_id": "52fe4cd59251416c91101951",
               "name": "Judy Dixon",
               "profile_path": null,
               "id": 129598,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe4cd59251416c91101955",
               "name": "Billy Wirth",
               "profile_path": "/oyigYLUbcfdpkhC5SqAQuRyLA7p.jpg",
               "id": 39112,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Andrew",
               "gender": 2,
               "credit_id": "52fe4cd59251416c91101959",
               "name": "Andrew Wagner",
               "profile_path": null,
               "id": 129299,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Emily",
               "gender": 1,
               "credit_id": "5a314e560e0a264cbc191d89",
               "name": "Emily Wagner",
               "profile_path": "/q5bD23S8u4WkDxsAyYNs3ZNboS2.jpg",
               "id": 157434,
               "order": 7
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.149902,
      "production_countries": [],
      "id": 193661,
      "vote_count": 2,
      "budget": 0,
      "overview": "A retired New York City couple drive across country to reconnect with their reclusive son, joined by their two unmarried daughters.",
      "similar": [],
      "original_title": "The Talent Given Us",
      "runtime": 98,
      "poster_path": null,
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Noble Media",
         "id": 13442,
         "origin_country": ""
      }],
      "release_date": "2004-06-11",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "A character driven comedy",
      "adult": false,
      "homepage": "http://www.thetalentgivenus.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Wagner"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Andrew Wagner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0417182/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxMTc0Mjg4Nl5BMl5BanBnXkFtZTcwNTkzMzAzMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Allen Wagner, Judy Wagner, Emily Wagner | See full cast and crew »"],
      "reviews": [
         "Perhaps the Wagner clan found making it cathartic, but for the viewer it is merely punishment. Not rising to the truly repulsive, the infantile self-absorption of the cast would drive most any non-Wagner to claw his or her way out of the speeding van even at the risk of life and limb. The quirky annoyance factor of the cast (particulary of the straw-chewing patriarch) is not matched by an emotional pay-off. The (spoiler alert! z-z-z-z-z...) reconciliation is utterly toothless. These people SHOULD be separated. This indie movie is scary in that it shows how little money and little talent are required to get drek produced nowadays.",
         "I am more and more disappointed by the quality of 'independent films' that appear ever more often on Sundance Channel (where I saw this film), and IFC, and with the honesty of reviews found on this website. As far as Sundance and IFC go - I simply have to assume that ever since the 'independent' genre made it big, finding quality programming that draws an audience without having to pay great sums must be becoming increasingly difficult. As far as the reviews on this website go I feel that films, especially small films like this, are reviewed favorably primarily because of shills. Maybe they are friends of the filmmaker, and family members, etc. And you know, if I were a filmmaker, I would certainly enlist those I know to do the same. The truth is this film is pretty bad, and pretty unwatchable, and if I cast my mom and dad in a movie (and they are in many ways like the couple in the film), my film would undoubtedly be pretty bad too. But you see - I would never take my home movies to Sundance, and pitch them shamelessly to further my career (or lack thereof). I feel sorry for Andrew's parents - who probably just want to see their son succeed in this business - but their acting was awful - although 'realistic', to be sure. In fact the 'professional actors (there are very few people in reality who are)' in this film, oddly, seemed 'more real' than the director/writer's real parents. But somehow at some level I think that the director may have chosen his parents as his 'human shield' against criticism of this film. But it's not just bad acting, it's bad editing, and I guess, my inability to suspend disbelief at everything happening in this film that ruins this film. The bottom line - a bad film that ends up, inexplicably on Sundance, because it probably cost them little to nothing to get it, and well, the director gets the visibility. Someone needs to set this film straight for other users.",
         "Watching this collection of people both fascinated and disgusted me. The odd interchanges between the two \"adults\" were embarrassing, disjointed, truly horrible. The few scenes of kindness toward one another were almost worse than their mutual spitefulness. Watching the father with his multiple mouth fixations nearly made me gag. Usually I enjoy independent films; I can't see the reasoning behind any aspect of plot, character development (or lack thereof), or conflict. The only thing I felt was understandable was why the son had moved so far away from these self-centered, thoroughly unredeeming characters making up his creepy twisted family tree. If I really had it in for someone, I would force him to watch this inaccurately titled movie.",
         "I wish I could change my star-rating to 4. I agree: All this praise of Wagner's film seems unwarranted. I was rather disappointed with it. My husband and I had the same reaction, immediately after viewing it: It seems to need more art, more fiction. It is indeed strange that somehow the daughters (apparently professional actresses) seem more \"real\" than their parents... or is it? Yes, I can hear the filmmaker and his fans saying that's just because this post-modern culture has conditioned us to see the fake as real, and vice-versa. But no matter; I found myself rather appalled and disgusted, during much of the film, and barely engaged. There's a whole lotta pathos going on, that's for sure. I wonder about the \"comedy\" label. I suppose the ending is supposed to be some kind of zen/enlightenment thing, but in my opinion it just fell flat. (I'm not sure if that qualifies as a spoiler, but I just wanted to play it safe.)",
         "If you were born and raised in the tristate area NY/NJ/CT and you are not Jewish, you'll find this movie equivalent to a case of hives! The loud, brash, self-centered nature of each of these individuals is beyond belief. If they are a slice of America, it is no wonder we are in debt to the Chinese and Indians and have lost total identity as a nation! This family is a family of infants in a crib (car) squabbling over who's got the gum. The rabid mother has steam rolled over everyone she ever met complaining as she stomped them to death. The daughters cannot believe they are not the queens of the world yet. They would masturbate in public to get attention. The father has spent his life wed to his business and paid the price with medical problems that have left him incontinent and unable to speak without a straw in his mouth. The son is a closet case living in LA who has no cellphone in order to become unreachable to the family arm which is constantly reaching for him. They endlessly bitch about not having enough of everything. They are thankful for nothing. If you like soulessness and despair, watch it. If you think being Jewish is funny, watch it. If you have a life, skip it.",
         "Like fascination with a train wreck, this movie leaves one a bit shameful for any interest and wishing the time had been spent better elsewhere. Only a step above the Borat flick in its believability and likability of the main characters, it is just one long definition of \"The Ugly American\". There may be a good deal of fiction, but there seems to be enough reality behind and among it all to find it much more creepy than appealing. Or even amusing. I sincerely hope these people can manage to find some value in themselves and their lives, as that appears to be their primary ambition in life. Yet, it is truly painful watching so many people making themselves, and anyone else unfortunate enough to cross their path, so abjectly miserable. Particularly the mother. Eeeesssh! Not to be taken internally!",
         "This film made me care for the characters right from the start. It has a healthy dose of reality, in places perhaps too stark for some in the audience. It gives some interesting insights into aging, whether it is the parents in their 70s or the daughter and her friend (?) in their 30s. Despite each of the parents aging differently and the wife being discontented with her husband, their love for each other comes through. The ups and downs of their relationship are only too real. The daughter's insecurities about her body image (and desire to go under the knife) faithfully reflects the way many young women feel and think. For those who think that the film doesn't really amount to anything and was not worth their while don't want this kind of reality. Because the characters are playing themselves with all their flaws and somewhat fractured lives. Many viewers want to get away from it all, for them this movie likely has little to offer. As for the comments made by arassweiler on this film, I don't buy into his/her assumption (or accusation) that most of the reviews here are done by \"shills\" who are likely friends of the film maker and have padded up IMDb reviews simply because they want the film to succeed. Neither do I get the thing about using parents to deflect real criticism. That is about the most meaningless comment anyone could have made about this film. It is definitely worth seeing. But if you are into a lot of Hollywood's over-produced or even well made celebrity/star laden films then this film is certainly not for you. The film is funny at times, and at times has an underlying tragic tenor. But it is a film where characters are human enough to confront their demons and limitations, overcoming some and failing at some. And I was definitely entertained by the film. Barring my cautions for certain types of film-goers whom I described above I think this film is pretty much \"must-see\". Especially if you are not put off by too much reality depicting characters who are imperfect in every way, but are perfectly human.",
         "Most films have protagonists between the ages of 25 and 45. In childhood and adolescence, one identifies with them as grownups. As the years pass, the view becomes as contemporaries. I've only gotten as far as late middle age, but at this point, while I can be lulled into a sort of suspension of disbelief and view characters 15 years my junior at eye level, more and more, I identify with their parents. This is abetted as the boomer generation ages, and many people now long in the tooth formed their adult identities during and after the values shift of the 1960's. That said, when you look at the Wagners' relationship from the vantage point of a certain age, one can understand why two people bonded by parenthood and hard experience through the years might persist in a union where romantic love is a distant memory. Familiarity, trust, recollection of how much worse other potential mates were during one's dating years, and fear of going it alone make their presence felt. In your 50's or your 70's, one wonders \"Who would want me now?\" For most of us, this is as happy an ending as we're going to get, like it or not. There comes a time when one is too tired, too sick, and/or too set in one's ways to start over yet again. Successfully rearing a child has its rewards, and as libido wanes, sometimes that's enough. One's acrimonious relationship with one's mate can be a shelter without alternative. This film takes an unflinching look at these realities...what is, as opposed as to what \"should be,\" to borrow a distinction often made by Lenny Bruce. Acceptance is the last of the seven stages of grief. Or to quote an old Country/Western song title, \"It's not love...but it's not bad.\"",
         "Just viewed this film and I enjoyed it primarily because of the fact that Wagner did something no one had ever done before. Everybody does pieces about their families, but I don't remember anyone ever actually getting their entire family to do a semi biographical piece about themselves, where they all acted together. I really liked the Dad. I think men of that generation, that provided for their families and did absolutely everything they were supposed to do, whether they liked it or not, are very undervalued. One thing that left me chuckling; I've been having a terrible time at lately with fabulous new releases and poor sound;scores swelling over dialogue when I'm trying to watch with the volume on low in my apartment. It's been a while since I heard every word in a film without an over posh score drowning out the mumbling actors. I guess being heard has never been a problem for this family.",
         "there is some real wisdom in this movie, and the characters are real. i don't know if this is the actual story of the Wagner family, or if in fact they're just a great family who love to create works of art as a team. but i came to IMDb today to find out, because i was truly touched and impressed by this movie. i love the scene where the younger daughter is psychoanalyzing the mother as they travel cross country. The mother tells her story of betrayal: the father cheated on her, left her to whore around with a lot of different women, then finally returns months later. With just a tiny tinge of bitterness but totally cognizant of the irony, she says, \"He sits down at the table and says, 'i need 5000 dollars.' He was totally broke!\" With that comment the viewer gets a huge insight into this woman's lifelong pain. The man she loved did not love her too."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Daddy W Productions",
         "Noble Media"
      ],
      "summaries": [
         "Judy and Allen are 70 years old, retired now, and at that point in their unremarkable marriage and lives that the farthest the day calls them from the crossword puzzle is to the Fairway supermarket. On one such excursion they run into two of their son Andrew's teachers from high school who want Andrew to return to New York to teach at his alma mater. Judy promises to pass the offer along, concealing the disappointment that she rarely speaks to her son. In the day that follows she spirals into a regret which ends in her epiphany to remedy her relationship with him. Immediately. And face-to-face. But since she's terrified of flying they must drive. Across the country to Los Angeles. Along for what began as a casual drive to the beach, Judy and Allen's two unmarried, thirty-something daughters, Emily and Maggie, find themselves roped into this odyssey. Even though Allen doesn't tear up the road, all the family and marital dirt is dug up.",
         "A retired New York City couple drive across country to reconnect with their reclusive son, joined by their two unmarried daughters."
      ],
      "budget": 0
   },
   "movielensId": 34426,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-06-11",
      "dvdReleaseDate": "2006-07-11",
      "directors": [""],
      "runtime": 98,
      "movieId": 34426,
      "title": "The Talent Given Us",
      "mpaa": "",
      "actors": [
         "Allen Wagner",
         "Judy Wagner",
         "Maggie Wagner",
         "Judy Dixon",
         "Billy Wirth",
         "Andrew Wagner",
         "Emily Wagner"
      ],
      "imdbMovieId": "0417182",
      "originalTitle": "The Talent Given Us",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A retired New York City couple drive across country to reconnect with their reclusive son, joined by their two unmarried daughters.",
      "tmdbMovieId": 193661,
      "avgRating": 3.25,
      "releaseYear": "2004",
      "numRatings": 4,
      "posterPath": null
   }
}