{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "champagne",
            "id": 5165
         },
         {
            "name": "wine",
            "id": 6563
         },
         {
            "name": "swimming pool",
            "id": 8181
         },
         {
            "name": "undressing",
            "id": 14557
         },
         {
            "name": "waiter",
            "id": 40950
         },
         {
            "name": "reading",
            "id": 155410
         },
         {
            "name": "pineapple",
            "id": 180294
         },
         {
            "name": "hiccups",
            "id": 180313
         },
         {
            "name": "diamond necklace",
            "id": 180314
         },
         {
            "name": "voyeur",
            "id": 180340
         }
      ],
      "imdb_id": "tt0089839",
      "video": false,
      "title": "Private Resort",
      "recommendations": [
         24742,
         18835,
         63988,
         27088,
         26642,
         210599,
         17362,
         34379,
         107096,
         14464,
         25164,
         27244,
         85512,
         60173,
         33676,
         10179,
         482048,
         52734,
         427395,
         3592
      ],
      "backdrop_path": "/nbWQPFWelZz1KxQEdWPDgiSv5qX.jpg",
      "revenue": 331816,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe474b9251416c75094405",
               "name": "Johnny Depp",
               "profile_path": "/ctaca3ALycPP0vPhRSYK5DTBEPF.jpg",
               "id": 85,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe474b9251416c75094409",
               "name": "Rob Morrow",
               "profile_path": "/pddqfHQ7AV5I2EUIzz32GFp5m5Q.jpg",
               "id": 52602,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "The Maestro",
               "gender": 2,
               "credit_id": "52fe474b9251416c75094413",
               "name": "Héctor Elizondo",
               "profile_path": "/48UNfVFZVr0jyMIlLPhzm8IIM7f.jpg",
               "id": 1210,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Curt",
               "gender": 0,
               "credit_id": "52fe474b9251416c7509441b",
               "name": "Andrew Dice Clay",
               "profile_path": "/1KzjDfy2r0Q8HUiEYfLvrOqVWH0.jpg",
               "id": 57906,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Dana",
               "gender": 0,
               "credit_id": "534b0d09c3a3682ddf001dc3",
               "name": "Karyn O'Bryan",
               "profile_path": null,
               "id": 995965,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Patti",
               "gender": 1,
               "credit_id": "536913780e0a2647d1008183",
               "name": "Emily Longstreth",
               "profile_path": "/jVGECibuxYgom9VPGO9Mcqo4Uky.jpg",
               "id": 141046,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Scott",
               "gender": 1,
               "credit_id": "5369139f0e0a2647ce00818e",
               "name": "Leslie Easterbrook",
               "profile_path": "/22kMcKhiWhq0C5BAhoURdVIdXUn.jpg",
               "id": 22252,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Alice",
               "gender": 1,
               "credit_id": "536913aa0e0a2647c400868b",
               "name": "Lisa London",
               "profile_path": "/1ni5vic163eJQeLM7wZgzfe8VUK.jpg",
               "id": 60152,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mike",
               "gender": 2,
               "credit_id": "536913be0e0a2647c80086ca",
               "name": "Christopher Wynne",
               "profile_path": "/krcB4LZlqK4txPZeNcuvJ7qUm0g.jpg",
               "id": 2455,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "The Barber",
               "gender": 0,
               "credit_id": "536913c90e0a2647cb008495",
               "name": "Ronald E. House",
               "profile_path": null,
               "id": 92586,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Kelly",
               "gender": 0,
               "credit_id": "54dbafa69251416191002472",
               "name": "Nora Gaye",
               "profile_path": null,
               "id": 1426110,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe474b9251416c7509440f",
               "name": "George Bowers",
               "profile_path": null,
               "id": 11454,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe474b9251416c75094421",
               "name": "Gordon Mitchell",
               "profile_path": "/szzvsqfFlkHBUJEiZtRquIhxHqn.jpg",
               "id": 30898,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.938248,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17824,
      "vote_count": 65,
      "budget": 0,
      "overview": "Jack and his buddy Ben check in at a posh Florida resort, planning to spend every hour in hot pursuit of gorgeous babes. But their plans hit a major detour when they try to bed the wife of a conniving jewel thief. They'll have to outsmart him, a nasty security guard and an obnoxious jock if they're ever going to get a moment alone with the girls of their dreams!",
      "similar": [
         22705,
         979,
         1948,
         80752,
         10090,
         96,
         4247,
         106646,
         9946,
         984,
         6075,
         4771,
         4995,
         627,
         340837,
         339692,
         122081,
         263472,
         214,
         8413
      ],
      "original_title": "Private Resort",
      "runtime": 82,
      "poster_path": "/6mV9mMl0vXqr2blt4e5RvjZjbCb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1985-05-03",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Spend a weekend with no reservations!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Bowers"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Gordon Mitchell",
         "Ken Segall"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089839/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MDk4NzQxOF5BMl5BanBnXkFtZTcwMjIzODEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rob Morrow, Johnny Depp, Emily Longstreth | See full cast and crew »"],
      "reviews": [
         "I knew nothing of this film before I saw it. It was a free \"On Demand\" film from Comcast. I didn't even know Johnny Depp was in it. I thought the plot description (which was vague) sounded like every other girl-crazy sex comedy released after \"Animal House,\" and I got what I expected. To be fair this is entertaining. No, it's not a great movie. It's not very well made. It's crude. It's sexist. It's all about sex. But that's exactly what it's supposed to be. Graded by the standards of its genre, it works. It's about two kids (one of whom is played by Johnny Depp) who gain access to a private resort in the middle of the Caribbean (presumably). There's no backdrop. We don't even know how they got in to the resort. And they look about 16, so it's odd to see them going after women in their 30s and 40s (sometimes succeeding). Depp wasn't famous yet (correct me if I'm wrong but this was his first starring role in a film to speak of?) and this certainly didn't help boost his career (he took a considerably smaller role in Oliver Stone's \"Platoon\" the year after) but he displays charisma and good charm that would carry on into his later movies. The film's take-it-as-it-is attitude makes it entertaining. It's a simple sex comedy with crude laughs and running gags, a lot of which aren't very funny, a few of which are, almost all of which are at the least amusing. Worth catching if you see it on cable some time.",
         "Take a typical 80's B-comedy, and give the two male leads to two actors who would go on to awards and world fame. Believe me or not, Depp and Morrow take two stock characters and make the material seem that much better; suddenly Jack and Ben hold the film together, rather than just reacting to everything within a narrow character description. Okay, so it's not art, but it's interesting from a film education perspective, if nothing else. The script and direction aren't bad either, for a 1980's sex romp. Would have liked to see the director go on to better material. Ah, well. 7/10, for effort and sheer amusement value.",
         "Everyone has those cheesy 80's favorites that weren't as well known as the Porky's, Real Genius, Revenge of The Nerds, etc...Everyone remembers those B-level films you would see late at night on Cinemax and for some reason, you sat there and watched it, and ended up loving some of them. I'm thinking of movies like Fraternity Vacation, Hot Dog, Malibu Express, etc. Private Resort is one of those movies for me. I'm really surprised it is not more popular, and a 3.7 IMDb rating just seems insanely low to me. You've got Johnny Depp and Rob Morrow, very early in their careers, running around and getting into all this wacky hi jinx at a fancy Florida resort. Although they came just to have some fun and chase some girls, they find themselves getting into a bunch of different hilarious situations. Hector Elizondo is also really funny in this movie, as the bad guy with the bad toupee. And who can forget Andrew Dice Clay in a memorable role? Definitely not an Oscar-caliber epic, but just one of those hilarious 80's sex romps. These types of movies disappeared for about 10 years but I'm glad to see the cycle is coming back around with movies like American Pie, Old School, Eurotrip, etc. Lots of laughs, gorgeous babes, and fun in the sun. This is a pretty under-appreciated 80's comedy classic in my opinion.",
         "The 80's saw multiple films just like this one in the 80's. The first one that comes to mind is One Crazy Summer with John Cusack. But, who would have ever dreamed that a man from one of these kind of films would be nominated for an Oscar. About as surprising as one of the original Ghostbustes conquering that same foot. Johnny Depp is amazingly fun in this film. His charisma and stupidity makes this film shine. Rob Morrow is good as well but, he is just simply the lead dopey character. Depp is excellent as the crazy sidekick (one of my personal favorite types of performances in any film). For it's time, this was the perfect example of what so many other films were trying for. To sum it up, the film is on the same level as Porky's. And I mean that as a compliment.",
         "Private Resort is a wildly hilarious romp through the world of the vacation resort industry. Johnny Depp shines in one of his earlier acting roles as Jack, a horndog who is out for tail at any price. (It should be noted to any fan of the Depp that he shows his naked backside in this movie. Not that I enjoyed it or anything...) This is a must see. Watch for the Jeff Spicolli-like character Mike. He has maybe 3 lines in the movie, but they have stuck with me since I first saw this movie in the seventh grade.",
         "First of all, let's get something straight. This is in fact the best spring break comedy of the 80's. However, that means it is the best of the 4 or 5 spring break comedies that came out between 1983-1985, really the only two years of the 1980's that had spring break comedies. Therefore, I'm talking about movies like Spring Break, Where the Boys Are, Hot Resort, and Fraternity Vacation, so which also means this is pretty much just a sex comedy. Of all these, Private Resort is by far and away the best one. It follows two young guys, Depp and Morrow, who are just looking to get laid and in the meantime get in trouble with hotel security, Andrew Dice Clay, and Hector Elizondo before his Chicago Hope days. Also, not to mention the beautiful girls throughout the movie, but what else do you expect? As a result, this is a truly underrated sex comedy, but don't bother to watch it on Comedy Central, because like Casino and Goodfellas, it has to be seen uncut. **+ out of **** BA,BA,BA, BA-BA-BA-BA-BA......",
         "In \"Private Resort\" Johnny Depp and Rob Morrow star as two single guys out to meet women at a resort hotel. Actor Hector Elizondo turns in a good performance as a jewel thief and con artist assisted by his wife, played by Leslie Easterbrook. Hilary ( Shapiro ) Shepard-Turner is very convincing as a religious fanatic and heiress to a fortune. This film is filled with classic slapstick comedy, and in places is both entertaining and funny despite a somewhat weak plot. Overall, Private Resort is a good comedy film of the 1980s. Veteran actress Dody Goodman plays a wealthy heiress whose jewelry is targeted by Hector Elizondo's character. There is lots of physical comedy with several now-famous actors early in their careers. Although there is some language and nudity in this film, it is a typical comedy film of the fast-moving 80's.",
         "Obviously this isn't a movie to be taken seriously and it may even be arguably offensive to women but I would take 'Private Resort' any day over the supposed 'comedy' flicks that feature the likes of Adam Sandler and Seth Rogan. There isn't much in terms of story. It's pretty much about two young men in their early twenties who go to a private resort to get laid. Meanwhile a jewel thief looks to steal a diamond necklace from a martial arts expert grandmother. It's definitely very silly but highly amusing. There's plenty of slapstick and overall cheesiness but the humour works and it has the right energy. Johnny Depp and Rob Morrow's on-screen camaraderie is a delight to watch as they provide the funniest scenes. Both actors have come a long way since and it was fun to see them as their young selves playing horny kids. Hector Elizondo is funny too. There's plenty of nudity to keep the viewer further entertained. It also depicts the 80's fashion (with big puffy hair and funny clothes). Overall, it's a fun little flick that has some nostalgic value.",
         "Private Resort (1985) *** (out of 4) Incredibly stupid but funny teenage sex romp has two teens (Rob Morrow, Johnny Depp) staying at a rich Florida resort where there's plenty of beautiful women to try and get in bed. Also on hand is a jewel thief (Hector Elizondo), a muscle bound ladies man (Andrew Dice Clay) and various other nuts. If you want high level comedy of Billy Wilder then you best stay away from this film but if you want juvenile humor mixed in with beautiful women getting naked then this film is just for you. This is clearly a rip of Porky's and all the comedy is incredibly dumb but it's still funny. Elizondo steals the show as the wannabe Mafia guy but Morrow and Depp are also fun to watch. Leslie Easterbrook from the Police Academy films also stars (and yes, she's naked).",
         "Lame comedy notable for its casting but not much else. Johnny Depp and Rob Morrow (in his film debut) star as two teens staying at a Miami resort for the weekend. They're looking to get laid but run afoul of jewel thief Hector Elizondo (wearing a wig that makes him look like Billy Crystal). It's an '80s sex comedy so you pretty much know what to expect here. There's the horny kid trying to sneak a peak wherever he can, the uptight guy informing women in bikinis of the hotel's strict dress code, the one \"nice\" girl among all the floozies, and many other cheesy elements we've all seen before. There's also plenty of female flesh on display. The highlights of the movie are Hilary Shepard's nude scene and Leslie Easterbrook (of Police Academy fame) wearing a see-thru negligee. Unfortunately there isn't much else to recommend about this one. I didn't laugh once the whole time I was watching it. The two stars give no hint of their future successes here. Morrow is annoying and Depp is surprisingly charmless and bland. Elizondo comes off best in the comedy department. See it for the babes but nothing else."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Delphi III Productions",
         "TriStar Pictures"
      ],
      "summaries": ["The story of two adolescent boys who are guests at a Florida resort for the week-end. Their only interest is, of course, chasing girls, but fate has much more in store for them."],
      "budget": 0
   },
   "movielensId": 34800,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-05-03",
      "dvdReleaseDate": "2006-06-27",
      "directors": ["George Bowers"],
      "runtime": 82,
      "movieId": 34800,
      "title": "Private Resort",
      "mpaa": "R",
      "actors": [
         "Johnny Depp",
         "Rob Morrow",
         "Héctor Elizondo",
         "Andrew Dice Clay",
         "Karyn O'Bryan",
         "Emily Longstreth",
         "Leslie Easterbrook",
         "Lisa London",
         "Christopher Wynne",
         "Ronald E. House",
         "Nora Gaye"
      ],
      "imdbMovieId": "0089839",
      "originalTitle": "Private Resort",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["o_TSNE9MRBQ"],
      "plotSummary": "Jack and his buddy Ben check in at a posh Florida resort, planning to spend every hour in hot pursuit of gorgeous babes. But their plans hit a major detour when they try to bed the wife of a conniving jewel thief. They'll have to outsmart him, a nasty security guard and an obnoxious jock if they're ever going to get a moment alone with the girls of their dreams!",
      "tmdbMovieId": 17824,
      "avgRating": 2.2375,
      "releaseYear": "1985",
      "numRatings": 40,
      "posterPath": "/6mV9mMl0vXqr2blt4e5RvjZjbCb.jpg"
   }
}