{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "sport",
            "id": 6075
         }
      ],
      "imdb_id": "tt0079640",
      "video": false,
      "title": "North Dallas Forty",
      "recommendations": [
         41971,
         42176,
         4988,
         42597,
         27224,
         31563,
         20858,
         24558,
         48852,
         161460,
         46797,
         37345,
         30653,
         42719,
         34014,
         18495,
         38560,
         67307,
         69007,
         52770
      ],
      "backdrop_path": "/jj0METL5722MYIxFD948wnf9JSH.jpg",
      "revenue": 26079312,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Phillip Elliott",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e079969",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Seth Maxwell",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e07996d",
               "name": "Mac Davis",
               "profile_path": "/vqa7zRz3ChoBjuutHcAnFdXEdrc.jpg",
               "id": 104872,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Coach Johnson",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e079971",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Charlotte Caulder",
               "gender": 1,
               "credit_id": "52fe45f9c3a368484e079975",
               "name": "Dayle Haddon",
               "profile_path": "/8NYWB0A425Yn0ynmDJzYNaV1qQN.jpg",
               "id": 63936,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jo Bob Priddy",
               "gender": 2,
               "credit_id": "559d6b019251412518000235",
               "name": "Bo Svenson",
               "profile_path": "/xhXC4Vx1T2NwFgadIjgdISM09ia.jpg",
               "id": 30044,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Conrad Hunter",
               "gender": 2,
               "credit_id": "559d6b2fc3a368658e000239",
               "name": "Steve Forrest",
               "profile_path": "/rRuAgDKpPp2hF7sxiRyzHpenJ6K.jpg",
               "id": 44998,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "O. W. Shaddock",
               "gender": 2,
               "credit_id": "559d6b74c3a368659e0001e3",
               "name": "John Matuszak",
               "profile_path": "/AvOqytADHckPxMEFVddrD4FHTU3.jpg",
               "id": 64120,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "B. A. Strothers",
               "gender": 2,
               "credit_id": "559d6b88925141251e000239",
               "name": "G.D. Spradlin",
               "profile_path": "/As8yIxmq1dXRIiZE4uFIsbNcoS6.jpg",
               "id": 1269763,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Emmett Hunter",
               "gender": 2,
               "credit_id": "559d6ba29251412509000267",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e07995f",
               "name": "Ted Kotcheff",
               "profile_path": "/r4rMwZeClwJR2VCgvYsNjLOTXpB.jpg",
               "id": 16544,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "572106c692514142420008e9",
               "name": "Peter Gent",
               "profile_path": null,
               "id": 104871,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "572106cec3a368117e000913",
               "name": "Frank Yablans",
               "profile_path": null,
               "id": 69878,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "572106d6c3a368117e000915",
               "name": "Ted Kotcheff",
               "profile_path": "/r4rMwZeClwJR2VCgvYsNjLOTXpB.jpg",
               "id": 16544,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "572106ddc3a368119a000a2d",
               "name": "Peter Gent",
               "profile_path": null,
               "id": 104871,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "572106e592514142420008ee",
               "name": "Nancy Dowd",
               "profile_path": null,
               "id": 70244,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "572106f0925141423900089c",
               "name": "Rich Eustis",
               "profile_path": null,
               "id": 163245,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "572106fa925141423900089f",
               "name": "Frank Baur",
               "profile_path": null,
               "id": 1559470,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "57210704c3a368117a0008f2",
               "name": "Jack B. Bernstein",
               "profile_path": null,
               "id": 1464024,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5721070dc3a368118e00083d",
               "name": "Frank Yablans",
               "profile_path": null,
               "id": 69878,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "572107d2c3a368117e000953",
               "name": "John Scott",
               "profile_path": null,
               "id": 29056,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "572107dec3a368117e000955",
               "name": "Paul Lohmann",
               "profile_path": null,
               "id": 30605,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "572107e592514142300008db",
               "name": "Jay Kamen",
               "profile_path": null,
               "id": 58318,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "572107ed92514142390008b4",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "572107f692514142390008b6",
               "name": "Alfred Sweeney",
               "profile_path": null,
               "id": 936638,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "572107fec3a36879f200009b",
               "name": "Arthur Jeph Parker",
               "profile_path": null,
               "id": 14846,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5721080792514142390008b8",
               "name": "Dorothy Jeakins",
               "profile_path": null,
               "id": 29800,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.340954,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29786,
      "vote_count": 14,
      "budget": 0,
      "overview": "A semi-fictional account of life as a professional Football (American-style) player. Loosely based on the Dallas Cowboys team of the early 1970s.",
      "similar": [
         13416,
         10393,
         9655,
         10637,
         22881,
         8923,
         9291,
         2300,
         323677,
         4942,
         10474,
         11287,
         9563,
         2323,
         86130,
         9614,
         9472,
         11770,
         12163,
         15070
      ],
      "original_title": "North Dallas Forty",
      "runtime": 119,
      "poster_path": "/mFhSl76WbhNWVjwObFZRjaDalOF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Frank Yablans Presentations",
            "id": 4988,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Regina Associates",
            "id": 4989,
            "origin_country": ""
         }
      ],
      "release_date": "1979-08-03",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Wait till you see the weird part.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ted Kotcheff"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Peter Gent",
         "Frank Yablans"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NjE4NTAzOF5BMl5BanBnXkFtZTcwMDk5MjUxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Nick Nolte, Charles Durning, Mac Davis | See full cast and crew »"],
      "reviews": [
         "North Dallas Forty rates as one of the all-time best sports movies ever made and is probably the best football film ever. Peter Gent's excellent novel was essentially a roman a clef about the Dallas Cowboys --America's Team-- of the '60s and 70's. And this movie sticks very close the book only dropping the novel's bloodbath ending. Nick Nolte gives one of his best performances as a world weary receiver facing the end of his playing days and still not wanting to become a full-fledged adult. Mac Davis is wonderfully wise cracking as the quarterback and leader of the team (basically he playing the real Don Meredith). G.D. Spradlin is memorably uptight and tight-jawed as the head coach. The rest of the cast fills out this colorful world of a raucous pro football team very well. It is an antic filled movie that tells a very dark tale of rich owners and rich people treating anybody beneath them like cattle. When one of the cattle happens to be smarter then the rest of the herd and decides to quit playing dumb --Nolte's character-- then that animal is turned away from the herd and is no longer allowed to play anymore reindeer games (if I may mix metaphors). The movie is played broadly but it cynical bite elevates it to a a much higher status as a serious work. Kudos to Ted Kotcheff for his acute direction.",
         "and probably my favorite one! written by pete gent, a former dallas cowboy in the 60's, it gives a great look inside the mentality of professional football ... especially in dallas during the landry years. i enjoyed this film because i played ball at the college level in the early 70's, and i feel it's the most realistic portrayal of the emotional seesaw that a football player goes through. the film shows what happens in a society where professional athletes are idolized, and the things they can get away with ... but at a cost! it portrays how the professional athlete must constantly look for new ways to achieve a \"high\", whether on the field, with drugs, sexually, or just by \"cutting loose\". the problem is that each high gives way to when you either make a mistake on the field, or come down from the \"off-the-field\" high. if you were a football fan in the 60's-70's, you can just see the dallas cowboys in this film! mac davis does a wonderful characterization of don merideth, and g.d. spradlin's coach just reeks of tom landry. and nolte does a magnificent job in one of his earliest works. please, take some time and watch this film. the videotape version is obviously much better than the tv version ... you lose a lot of the reality otherwise. please, if the first-run shelf is empty, take the time to check out this film. you won't be disappointed.",
         "When this movie first came out (late 70's), I was still in high school and very naive as to the behind the scenes machinations of professional football. This movie was ahead of its time in its depiction since no other movie on professional football had ventured into this area exposing drug use, both off the field casual usage and to get players on the field, and indifference of ownership and coaching staff to players feelings and thoughts. Nick Nolte was exceptional as Phil Elliot, the wide receiver whose character was based on Pete Gent, a wide receiver with the Dallas Cowboys who authored the book (North Dallas Forty) the movie was based on. He is a free spirit with little regard for authority but undoubtedly cares about his performance on the field. He cannot play by the rules because he doesn't make them. Mac Davis was great as quarterback Seth Maxwell, the jaded athlete who knows how to \"bend\" the rules to remain in good standing with the team. Supporting cast, especially GD Spradlin as the coach modeled after Dallas Cowboys coaching genius Tom Landry, was excellent. If you have 2 hrs and want to catch a well-acted, well-written movie on the reality of professional football, then catch this flick. It preceded such films and Stone's Any Given Sunday, but its content is very relevant to football 30 years later.",
         "'ND40' is my favorite of all the sports movies I've seen. It's both a dark and funny look at professional football, succeeding on both levels, with special emphasis put on the way the pro machinery chews up players and spits them out. There's no doubt who the fictional North Dallas Bulls are supposed to correspond to in real life, and the Dallas Cowboys were none too happy with either the book or the movie. For the rest of us it is first-class entertainment. The movie abounds with great performances. Nick Nolte is superb as the aging wide receiver, weary in spirit and broken of body. His independence and declining skills are threatening his usefulness to the team. G.D. Spradlin gives one of his usual excellent performances playing the team's amoral head coach. It's the type of role he seems almost to have a patent on. Some actors in this movie, I suspect, are doing the best work of their careers. Mac Davis plays the fun-loving quarterback who is serious about keeping his position both with the team and the ladies, and knows all the tricks, whether it's before, during, or after the game. Steve Forrest is the millionaire owner who wants nothing in the world more than a Super Bowl championship team. And Bo Svenson and former pro player John Matuszak are a couple of linemen who play by the same rules on the field and off. It's a complex movie with so much going on in some scenes (just like a football game) that it deserves to be seen more than once. One small quibble: the big game was obviously not filmed before an audience. That doesn't detract too much from the overall picture, but a viewer is aware of it.",
         "Some have said that this is the best film about football ever made and they may be right but at the center of this film is a solid performance by the lead. Story is about a fictional football team from Dallas, Texas where we see cold hearted management and players that must endure incredible amounts of pain to be able to play. Phillip Elliott (Nick Nolte) is a veteran wide receiver who has gone through many operations and walks with a limp and must take assorted pain killers not to play football but to just be able to get through the day. His only friend is quarterback Seth Maxwell (Mac Davis) and together they smoke pot and drink beer and that's during the training for a game! Elliott has to sit on the bench and only makes rare appearances in games and this makes him angry but he puts up with the cold hearted rantings of Coach Strothers (G.D. Spradlin) while waiting to play. *****SPOILER ALERT***** Elliott meets a nice woman named Charlotte (Dayle Haddon) who doesn't like football but together he is able to talk about his dreams of building a ranch. Finally after a star player gets injured Elliott is told that he is going to start in an important game but come game time coach Strothers has changed his mind. During the game Elliott gets to play and does very good but a few days later management has decided his future with the team. This film is directed by Ted Kotcheff who was a pretty good director during the 1970's but he couldn't hold on to his success and has basically directed television ever since. The film works on two levels and the first is the way that it shows how players are used by both coaches and management. Just before the big game they trick their star player into using a pain killer which also means that the starting player that's taking his place will be screwed. But it's the performances that really make this film work from the supporting roles to Nolte's lead. Mac Davis wasn't known as a good actor when this was made but he's good here as the quarterback who knows how to play the game (Not football) and keeping his players cool. Nolte's performance I think is one of his most underrated and while he physically may not exactly look like a player he perfectly embodies an individual who has sacrificed his own body to play the game. Nolte's natural wit and sarcasm are of good use here but what really shines through is how jaded he has become of the system. The scene where his girlfriend wakes up in the middle of the night and catches him trying to crack and twist his pain ridden body back into place has become a near classic and if anyone wants to know what it's like to be a football player than they can watch that scene. Does the script go over the top? Probably, but I'm not convinced that it's by much as we have all heard stories about what goes on during and after games. Very entertaining film has only a few minutes of actual game playing because it's emphasis is on the players and their manipulation and that in itself is an achievement but none of that would matter without Nolte's rock solid performance.",
         "I hadn't seen ND40 since it first opened, but I always remembered it as my favorite football movie. Since my friends are sick of me comparing every football movie to it, I decided to make sure I was still right after 20 years. The movie holds up remarkably over the years. Sure, lots has changed--making the movie a humorous period statement. The bad hair, the bad polyester clothes, and cigarettes everywhere. The coach actually has to tell the team to put out their cigarettes five minutes before the big game! On substance, the movie is still right on the mark. The addiction to pain killers, the crippling effect of the game, and the effect the game has on the players personal lives all ring true today. Although we try to unsuccessfully bury some of those problems today, they sneak out anyway in Bret Favre's pain killers or OJ Simpson's arthritis. One problem: if Nolte really is the best receiver on the team with the best hands in the league, why isn't he playing? I can hypothesize reasons, but the writer/director could have made the reasons more obvious. 9 stars out of 10",
         "Seen this movie a few times on TV and it is a superb football film. Nick Nolte is excellent as the gruff and rough guy with lots of problems on and off the football field. Being in the 70's makes it even better and more realistic. Made in a time when men where men and sports meant more than money, a lot more. Sex, booze, knocking heads and blood & tears is what make these players happy! Good, fun all round film with great thought put into the story especially when entering Nolte's problems with team management/owners. As we all know deep rifts and problems occur between sports players and club owners but we never get to really know the truth and what goes on in the boardroom and player meetings. This film gives us a little make look at what could or should I say happens! I enjoyed this film very much,love the music, great characters and a good story. A winner all around.",
         "The opening shot of Ted Kotcheff's North Dallas Forty is a tense and memorable one. It shows the aging and exhausted Phil Elliot (Nick Nolte), passed out in his bed and awoken by a blaring alarm clock. Elliot is slow to get up, every move being a slow one that clearly causes a searing amount of pain. He lumbers to the kitchen to get a beer before stumbling to soak in a bathtub. Punctuating this scene are brief little clips from last night's football game, where Elliot was met with several rough, polarizing blows to every part of his body. Interrupting this scene's quiet, almost meditative atmosphere are Elliot's loudmouth friends, clearly intoxicated, who want to go out and cause a ruckus with their shotguns. What we see in the first few minutes of North Dallas Forty are what we never see in sports - the morning after the game. The physical pain rather than the heated press conferences or celebratory events in the locker. Because we see the lead character in such a vulnerable, often powerless light despite being a very good football player is why North Dallas Forty is so skilled on its feet as a film. It explores where other films would dim their focus. It fully embraces and boldly depicts in element where other screenwriters' knees would buckle under the weight and pressure of the story, especially for the time. Written by a trio of thoughtful and thoroughly ambitious people - Peter Gent, Kotcheff, and Frank Yablans - the film manages to be less entertaining and sensational, like a typical sports film, and more heartbreaking and an often immersing watch. We set our sights on Elliot, who is becoming greatly dissatisfied with the way the NFL operates (his team is the fictional North Dallas Bulls, which mirror the Dallas Cowboys, FYI). He loathes the way managers and coaches treat their players like cattle, constantly emphasizing their flaws and not their advantages, and justifying their ungrateful, smug comments on poor performance as methods of tough-love. Elliot knows the organization is out to make money and injuries, long-term trauma, and player wellbeing are the least of their concerns. Through Elliot's dissatisfaction, however, he becomes heavily dependent on painkillers, alcohol, and other pills of sorts to keep his mind right. Just before a big game that determines the Bulls' playoff fate, Elliot's leg, which is experiencing hellish pain, is given a shot of a mysterious substance. What was it? What are its effects? Why is it being used? Who cares, \"the whole thing's numb,\" Elliot states. The film is held together not only by the competence of its writer but by Nolte's tremendous talents as a character actor and performing. He articulates with a touch of sensitivity and years of craft the agony and despair many aging athletes likely experience. For instance, consider Super Bowl XLVIII, which took place yesterday and ended with the Seattle Seahawks winning 43 - 8 over the two-point favorite Denver Broncos, led by Quarterback Peyton Manning, who is already thirty-seven years old with years of professional experience under his belt. I wouldn't want to feel what that man has felt waking up, especially now, nearing forty with the albatross of having numerous neck surgeries conducted. Watching the Super Bowl last night, I could only imagine how he not just him but many of those players wake up with severe pain in their bodies - pain that will likely carry over to their older years and maybe even cripple them as time goes on. All for a game that will be out of the immediate mindset of even the most heartened-fans in no more than two weeks or so. On a final note, the promotional poster/home video release images for North Dallas Forty are criminally misleading ones, showing two football players, one dousing himself with water, the other hoisting his helmet while they both lounge in two cowboy boots with two woman grappling to get at them on both sides of the boots. The image at hand denotes a fun sort of rabble-rousing, Animal House-style entertainment which is completely absent from the film. This is not the film you will see, and the marketing campaign has shamefully misrepresented the film to consumers if their sole-exposure to the film is by looking at the film's promotional poster or home video cover. Starring: Nick Nolte, Mac Davis, and Charles Durning. Directed by: Ted Kotcheff.",
         "This movie is the best \"football\" film ever made. Along with \"The Natural\" - baseball, and \"One-on-One\" - basketball, these are an outstanding trilogy of the three best pictures representing our primary American sports, and all have interesting multi-dimensional stories as well. Pete Gent was a maverick in his NFL career, but it would seem his alter-ego, Phil (Nick Nolte), while possessing this same nature, is significantly more accomplished in his pro career (even if on the coach's \"secondary list\" in the film). Gent played six years, 48 games, with only 68 overall receptions and four touchdowns. These numbers and his yardage (his average per catch was pretty good) would comprise a good single season's stats. The primary \"athletes\" in the film - played by Nolte, Davis, Matuszak and Svenson are realistic, interesting, tough and bawdy. Matuzsak's distinguished career was as a defensive end, and Svenson also possesses more of the physical characteristics of a defensive lineman. The fact, though, that they played offensive linemen in the film was obviously a necessity to the drama - both off- and on-field, where all four prime leads had to be on-screen simultaneously. As I mentioned in commenting on \"One-on-One,\" where the great G. D. Spradlin was the basketball coach - coupled with this film, he wins the award of the \"all-time horse's ass coach\" hands-down. Durning was hilarious as the vacuous assistant coach. Anyone familiar with Gent and Tom Landry can see that Spradlin's coach Strothers is modeled - at least in part - from the latter. Although similar in appearance, and more \"professorial\" than most coaches, and probably often a bit distant -- Landry did not seem to possess the extremely negative traits displayed by Strothers. In the film, with the level of talent Nolte's \"Phil\" possessed, it is unlikely he'd have been as neglected by the coach as depicted, even in view of Strothers' compulsive devotion to his computerized statistics, and distaste for Nolte's persona. I suspect that this relationship has similarities to Gent's with Landry, but, again, Gent in real life was not as productive or talented as Nolte on film. Steve Forrest was excellent as the smarmy, wealthy team owner, and Dabney Coleman as his even smarmier, completely unctuous younger brother. {Has anybody, EVER, in the history of the motion picture industry (t.v., too), done \"smarmy\" or \"unctuous\" as well as Dabney???} This one's a \"10\" for both sport and drama.",
         "Listening to the Colin Cowherd Show on ESPN and Kyle Turley was on. He was getting into the drug use in the NFL and now wants the NFL to pay-up. I saw this in 1979 with two friends I worked with at a hot dog place. They were both going to USC to play football. This movie was an insight to the reality of sports...and it was 1979. Nothing has changed! Why is this movie so significant? If you listen to Turley's arguments, he acts as if this is something new. Like anything else, nothing is new. You want women, money, and a lifestyle that says, \"Live for today\" then you can't whine about the consequences. The NFL sees you as a product. That's news to you? Every professional athlete should have to watch this movie before signing any contract. You show this to any high school athlete, and like the guys I saw it with going to USC, they will say, \"So...that's not gonna happen to me.\" Great movie!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Frank Yablans Presentations",
         "Paramount Pictures",
         "Regina Associates"
      ],
      "summaries": ["A semi-fictional account of life as a professional Football (American-style) player. Loosely based on the Dallas Cowboys team of the early 1970s."],
      "budget": 0
   },
   "movielensId": 3506,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-08-03",
      "dvdReleaseDate": "2001-01-30",
      "directors": ["Ted Kotcheff"],
      "runtime": 119,
      "movieId": 3506,
      "title": "North Dallas Forty",
      "mpaa": "",
      "actors": [
         "Nick Nolte",
         "Mac Davis",
         "Charles Durning",
         "Dayle Haddon",
         "Bo Svenson",
         "Steve Forrest",
         "John Matuszak",
         "G.D. Spradlin",
         "Dabney Coleman"
      ],
      "imdbMovieId": "0079640",
      "originalTitle": "North Dallas Forty",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["BJweLdwtDLY"],
      "plotSummary": "A semi-fictional account of life as a professional Football (American-style) player. Loosely based on the Dallas Cowboys team of the early 1970s.",
      "tmdbMovieId": 29786,
      "avgRating": 3.24864,
      "releaseYear": "1979",
      "numRatings": 736,
      "posterPath": "/b6ZDWrer4Z5fnC3hT4B3brL4NzR.jpg"
   }
}