{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "beach movie",
         "id": 188583
      }],
      "imdb_id": "tt0059287",
      "video": false,
      "title": "How to Stuff a Wild Bikini",
      "recommendations": [
         39113,
         26484,
         84840,
         26483,
         32484,
         13861,
         27376,
         121716,
         61892,
         42789,
         22968,
         46498,
         64925,
         53617,
         21779,
         45840,
         26477,
         18698,
         34082,
         31804
      ],
      "backdrop_path": "/k37GFIZ1YmWvE5SgjvLe6B5nS51.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Dee Dee",
               "gender": 1,
               "credit_id": "52fe451ec3a368484e0498e5",
               "name": "Annette Funicello",
               "profile_path": "/6nqrBDFDvjpVdrZS1RjfX9rTJ7S.jpg",
               "id": 82777,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Ricky",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498e9",
               "name": "Dwayne Hickman",
               "profile_path": "/nXSwymWdiF5NoUUyGgzWCsYrXsl.jpg",
               "id": 70260,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "B.D. 'Big Deal' MacPherson",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498ed",
               "name": "Brian Donlevy",
               "profile_path": "/dJP0woESrhHQrPbTieZdE54OM2f.jpg",
               "id": 41755,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Eric Von Zipper",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498f1",
               "name": "Harvey Lembeck",
               "profile_path": "/ylpix3VG43GY9D2kkxOxcR5FvSI.jpg",
               "id": 9109,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Cassandra",
               "gender": 0,
               "credit_id": "52fe451ec3a368484e0498f5",
               "name": "Beverly Adams",
               "profile_path": "/cjUzoDi6IB1jKRZ0VMIGBmS1Mxb.jpg",
               "id": 127353,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Johnny",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498f9",
               "name": "John Ashley",
               "profile_path": "/zICZ6S10MdwPtgrhD8A2M2MZja4.jpg",
               "id": 8331,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Bonehead",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498fd",
               "name": "Jody McCrea",
               "profile_path": "/8KWkYSdbO5wAwjLOXiuW1TRIFfb.jpg",
               "id": 148602,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Animal",
               "gender": 1,
               "credit_id": "52fe451ec3a368484e049901",
               "name": "Marianne Gaba",
               "profile_path": "/zhdkykrUNuIzHh9Lg4wFslekNkq.jpg",
               "id": 148606,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Bwana",
               "gender": 2,
               "credit_id": "52fe451ec3a368484e049905",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Themselves",
               "gender": 0,
               "credit_id": "52fe451ec3a368484e049909",
               "name": "The Kingsmen",
               "profile_path": null,
               "id": 148607,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Khola Koku",
               "gender": 0,
               "credit_id": "52fe451ec3a368484e04990d",
               "name": "Bobbie Shaw Chance",
               "profile_path": "/k246iuQxGiZPiZajp7H09XgH9sA.jpg",
               "id": 1033087,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "North Dakota Pete",
               "gender": 2,
               "credit_id": "54d7c7449251416ba800600d",
               "name": "Len Lesser",
               "profile_path": "/h6mL9dHhYa4sHppv4GRJIkUTqwe.jpg",
               "id": 78087,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Native Girl",
               "gender": 1,
               "credit_id": "54d7c755c3a36854310030df",
               "name": "Irene Tsu",
               "profile_path": "/kBrXxo9iniK96wd5kU5yNOczgAe.jpg",
               "id": 83788,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Secretary (as Sheila Stephenson)",
               "gender": 1,
               "credit_id": "54d7c79a9251415f9c006253",
               "name": "Sheila MacRae",
               "profile_path": "/rzE1km6qTnwWYb9pQEFkGPctz7n.jpg",
               "id": 103682,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Peachy Keane",
               "gender": 0,
               "credit_id": "54d7c7e792514171600067f8",
               "name": "Mickey Rooney",
               "profile_path": "/bgCm55k2eo2YV5bMn3D0O4NPwU.jpg",
               "id": 1937,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Frankie",
               "gender": 2,
               "credit_id": "54d7c803c3a3683b8f0068d1",
               "name": "Frankie Avalon",
               "profile_path": "/irGdUt04yfbwCioPYXBQHgwiWck.jpg",
               "id": 22092,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Bwana's Daughter, The Witches Witch (uncredited)",
               "gender": 1,
               "credit_id": "54d7c81dc3a3683b8f0068d3",
               "name": "Elizabeth Montgomery",
               "profile_path": "/pCbOD3ftWU8wBoY8kBGQ4U8DGTh.jpg",
               "id": 43975,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498d5",
               "name": "William Asher",
               "profile_path": "/tZw2tQwUHBTgwNjR0lWpdzliRAr.jpg",
               "id": 95526,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498db",
               "name": "William Asher",
               "profile_path": "/tZw2tQwUHBTgwNjR0lWpdzliRAr.jpg",
               "id": 95526,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451ec3a368484e0498e1",
               "name": "Leo Townsend",
               "profile_path": null,
               "id": 95527,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.866855,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26879,
      "vote_count": 10,
      "budget": 0,
      "overview": "When he's stationed in Tahiti, a sailor hires a witch doctor to keep an eye on his girlfriend.",
      "similar": [
         325189,
         26484,
         26477,
         39113,
         27376,
         26483,
         43096,
         102845
      ],
      "original_title": "How to Stuff a Wild Bikini",
      "runtime": 93,
      "poster_path": "/iVbPIfGpJnUYZltZzBBsc1Ry0LP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1965-07-14",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/dIrrW4QqenLKxKDlt0AbPVjSO1E.jpg",
         "name": "Beach Party Collection",
         "id": 338327,
         "poster_path": "/kIKGCP58y67SUvIA7qOIO8zL9nT.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Asher"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "William Asher",
         "Leo Townsend"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059287/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNjY0MzU4OF5BMl5BanBnXkFtZTcwMzMzODE0NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Annette Funicello, Dwayne Hickman, Brian Donlevy | See full cast and crew »"],
      "reviews": [
         "This was the last of American-International's beach musicals that starred Frankie Avalon and Annette Funicello (although they'd try to continue for a few films without these two). Frankie and Annette are barely together even in the film--Frankie is more of a cameo than a major character in the plot. Intriguingly, this musical is filled with \"book numbers\"--where the characters sing when they should be talking. Usually, the beach party movies just had people asking Frankie or Annette to sing at a party or at a nightclub. So, that's a change. The problem is that the songs aren't anything to write home about. Further, the film betrays why the beach movies were losing their popularity: the surfing fad was being supplanted by a renewed interest in motorcycle culture. Only a year or two later, American-International would be making films like \"The Wild Angels.\" This is a problem for a series where the stock antagonist, Eric Von Zipper, is a parody of Marlon Brando's biker hood in \"The Wild One\" (1954). The film shows a renewed interest in cycles--Annette's romantic interest, Harvey Lembeck, is an avid motorcyclist. The film tries to deal with this by transforming Von Zipper from a biker into the stereotypical 60s junior executive (a la \"How to Succeed in Business\"). But, you can see the structure starting to fall apart here. There are fun moments though--particularly the opening credits (clay animation done by Art Cloakey, the creator of Gumby), and the wacky motorcycle race at the end of the film. Lastly, there's a fun cameo at the very end of the film by producer William Asher's wife...",
         "The second to last Beach Party movie. In this one Frankie Avalon is separated from Annette Funicello by being in the Naval Reserve. While on an island he gets a witch doctor (Buster Keaton!) to see if Annette is being faithful to him. Keaton sends a pelican (???) to spy on Annette. Meanwhile handsome, attractive Ricky (Dwayne Hickman) is hitting on her. Then there's Mickey Rooney looking for the boy next door and girl next door for an ad campaign. Even for a beach party movie this is pretty desperate. Funicello looks way too old to be hanging out at the beach (and her pregnancy is clearly visible); the dialogue is more inane than usual; the songs are (to be nice) terrible; the jokes are stubbornly unfunny; Hickman is as bland as they come (even worse than Chris O'Donnell); Harvey Lembeck returns as the incredibly unfunny Eric von Zipper; the \"comical\" motorcycle race at the end is incredibly stupid; and it's kind of sad seeing Keaton and Rooney reduced to this. Still, this is kind of fun in a silly sort of way. It's not even remotely good but I kept watching. The Claymation opening is fun and I did laugh out loud at the \"Bewitched\" joke at the end. Also this is perfect for young kids. So it's not good but it's harmless. It's certainly better than the next (and last) beach party movie \"Ghost in the Invisible Bikini\"!",
         "I purchased the DVD version of this movie and would like to inform other 'Beach Party' movie lovers that MGM has done a great job on the video and sound. I have in the past had to suffer through very low quality VHS copies of the Beach Party movies, where I wound up throwing away the tape and putting a VHS tape that I recorded off TV into the box. That won't be the case here! (even if I could record a DVD) As for the movie ... Well, it is my least favorite of the Frankie and Annette Beach Party movies ... And I think I'm in the majority there. But if you love the Beach Party genre of movies you have to have this one too and you don't need me to tell you about it. <standing salute to MGM>",
         "Frankie Avalon off doing his Naval Reserve training in those innocent days before Vietnam is wondering whether Annette is being true to him back at the beach with all those other hunks around. He's stationed on a tropical Pacific Isle with lots of other curvaceous cuties around. He asks one of them to bring him to the local witch doctor for help. The witch doctor sends a pelican out to spy on Annette back at the beach. So help me this is the beginning of the story. But it's not a half bad film, in fact it gets down right satirical at times. In addition to Frankie, Annette and the rest of the beach crew, some Hollywood old timers got some work in this film and they get a chance to overact outrageously. They include Brian Donlevy and Mickey Rooney as a pair of scheming advertising executives along with Dwayne Hickman who's their schemer in training, Harvey Lembeck as a Marlon Brando type motorcycle gang leader and Buster Keaton as the witch doctor. I'd try to see How to Stuff a Wild Bikini if for no other reason than to see all these players ham it up. Though in some spots the pelican gives the best performance in the film.",
         "My 12 year old watched this with me this morning (it was raining) and she was laughing at the old fashionedness of the movie. I would have rather watched a better example of the \"beach movie\" but we still had fun. At one point Mickey Rooney tells one of the bikini clad girls how cute she is and goes to chuck her on her chin, and on the way to her chin, his hand clips her right breast. My daughter said, \"Hey, did he just touch her boob?\" Well, we have TIVO and rewound the movie. Yes he did. How'd that get by the censors? But the musical scenes were hysterical for her, and we both agreed that Annette looked way too old to be hanging out with all of the bikini girls! And why wasn't she screaming when she took that motorcycle ride?",
         "Annette Funicello is always tempting and/or is a temptation when left alone, so sailor Frankie Avalon goes to Witchdoctor Buster Keaton and sends an enchanted Pelican to watch over her. That doesn't stop Dwayne Hickman as \"Ricky\". Mickey Rooney as \"Peachey Keane\" arrives on the beach to search for \"The Girl Next Door\", and he finds an eager ally in Harvey Lembeck's \"Eric Von Zipper\", naturally. Is there such a thing as a \"Cheap Beach Party\" movie? This one could not wait for Ms. Funicello to either get in shape or have the baby. Mr. Avalon is hardly present at all; strangely enough, he is missed. The film is unimaginative in recycling ideas both good and bad. Astute observers will know the \"twitch\" in the ending cameo isn't even done correctly. On the plus side, Mr. Keaton has more to do this time around, and it's good to see he and Mr. Rooney in a film. The song material sounds better at the end, and the opening credits are the highlight. Still, the \"Beach Party\" film series looks more tired with every entry\u0085 ** How to Stuff a Wild Bikini (7/14/65) William Asher ~ Annette Funicello, Dwayne Hickman, Mickey Rooney",
         "This is the final film to feature Frankie Avalon and Annette Funicello as Frankie and Dee Dee, and it is also the worst. Avalon had grown weary of playing an over-aged teen-ager and wanted to do something more with his career and at the same time Annette Funicello had recently married and was starting a family. In fact, Ms. Funicello was very pregnant at the time the film was released. Also, Avalon was in the middle of filming Sgt. Deadhead and couldn't appear in the entire film. The solution, bring in Dwayne Hickman as Rick, an advertising executive, to keep Dee Dee busy while Frankie was off on military duty. This was a big mistake. These best thing about the \"Beach Party\" films was the chemistry between Avalon and Funicello and this film falls flat on its face because the two are on screen together for only a minute (not counting the duet they sang via split screen). After this film was completed, the two retired from the genre, Avalon to attempt more serious roles and Funicello to raise her family. However, Samuel Z. Arkoff tried to keep the series rolling a couple of more years before he finally gave up the ghost, and not the one in the invisible bikini.",
         "Like Jackie19, it's nearly my least favorite of the beach movies, but luckily, that isn't much of an insult. Along with all the regular actors, there are the great guest actors. Buster Keaton's witch doctor (along with Bobbi Shaw's native girl) may not be the most enlightened image of a Polynesian, but he manages to be very funny in the part. (I'm sure plenty of people see these movies as a big, embarrassing step down for people like him, but I see no good reason why.) And of course, Irene Tsu as the girl who tries to tempt Frankie. Then, there's Len Lesser, who's just about as great a comical villain in this one as Timothy Carey is in Beach Blanket Bingo. And of course, Mickey Rooney. Someone mentioned the \"touching her boob\" bit that he gets away with, but one of his scenes also has a fairly funny gay joke. Rooney asks one of the surfers (someone in that scene alone) if he's seen the exciting girl that so much of the film is about, the one that all the boys are crazy about, and the character says in a lisping voice, \"Certainly not!\"",
         "Fairly desperate \"Beach Party\" entry (the sixth in the series!) has Annette Funicello contemplating a new boyfriend while Frankie Avalon is overseas. Enter...Dwayne Hickman? Frankie actually has a rather large cameo role for not receiving a livelier billing, and there's a cute ending, but these kids are starting to look more mature and their hijinks are starting to get musty. Annette sings two solo numbers and a duet, and she's perky and attractive despite being covered up to conceal her real-life pregnancy. The rest is mediocre, particularly leading man Hickman (eternally bland) and supporting player Mickey Rooney (game but charmless). ** from ****",
         "You know it had to end eventually, but this put the wraps on the Frankie Avalon/Annette Funicello team in the beach party series of pictures that defined the genre. Although far from the best of the series, it still had some pretty good parts. Buster Keaton had a memorable role as the witch doctor and his daughter, the witch, turns out to be Liz Montgomery, who was on hiatus from her BEWITCHED series, and put in an appearance as the nose-twitching witch she also played in her husband Bill Asher's sitcom. Besides those two actors and the always entertaining Harvey Lembeck as Von Zipper, there are some fairly good bits to recommend here. Beverly Adams stands out as the eye candy and the Kingsmen perform a couple of songs. The claymation credits in the opening was a nice touch and the climactic motorcycle race was mildly amusing. Actually, the musical numbers inserted into the plot made sense, but could have been performed better. Taken together, it wasn't half bad as a way to end what had been a pretty entertaining film series. Like most series that were cranked out by Hollywood, it has its pluses and minuses, but, generally speaking, the series as a whole rates a thumbs up from me and would be worthwhile to both see and to own. Dale Roloff"
      ],
      "genres": [
         "Comedy",
         "Musical"
      ],
      "productionCompanies": ["American International Pictures (AIP)"],
      "summaries": ["Frankie, on naval-reserve duty in Tahiti, doesn't trust Dee Dee to stay faithful, so he hires Bwana, a witch doctor, to help. Bwana conjures up a floating bikini, \"stuffs\" it with Cassandra, and sends her to distract advertising executive Ricky from Dee Dee."],
      "budget": 0
   },
   "movielensId": 3520,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-07-14",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["William Asher"],
      "runtime": 93,
      "movieId": 3520,
      "title": "How to Stuff a Wild Bikini",
      "mpaa": "",
      "actors": [
         "Annette Funicello",
         "Dwayne Hickman",
         "Brian Donlevy",
         "Harvey Lembeck",
         "Beverly Adams",
         "John Ashley",
         "Jody McCrea",
         "Marianne Gaba",
         "Buster Keaton",
         "The Kingsmen",
         "Bobbie Shaw Chance",
         "Len Lesser",
         "Irene Tsu",
         "Sheila MacRae",
         "Mickey Rooney",
         "Frankie Avalon",
         "Elizabeth Montgomery"
      ],
      "imdbMovieId": "0059287",
      "originalTitle": "How to Stuff a Wild Bikini",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["MJvlvCy79W4"],
      "plotSummary": "When he's stationed in Tahiti, a sailor hires a witch doctor to keep an eye on his girlfriend.",
      "tmdbMovieId": 26879,
      "avgRating": 2.31849,
      "releaseYear": "1965",
      "numRatings": 146,
      "posterPath": "/iVbPIfGpJnUYZltZzBBsc1Ry0LP.jpg"
   }
}