{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0149367",
      "video": false,
      "title": "Where the Money is",
      "recommendations": [
         63020,
         19415,
         163228,
         230428,
         48689,
         17035,
         31606,
         32143,
         26850,
         4918,
         32620,
         61564,
         9458
      ],
      "backdrop_path": "/zWRw7OI0oWnQMjlKM43U3xcXzvN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe449f9251416c9101717f",
               "name": "Paul Newman",
               "profile_path": "/my0Blo9IBy1WZ0QKbuxUzS0QwV5.jpg",
               "id": 3636,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Carol",
               "gender": 1,
               "credit_id": "52fe449f9251416c91017183",
               "name": "Linda Fiorentino",
               "profile_path": "/aKadq5uC9CjCKtkMYPYECNcGz3s.jpg",
               "id": 9625,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "52fe449f9251416c91017187",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mrs. Foster",
               "gender": 1,
               "credit_id": "52fe449f9251416c9101718b",
               "name": "Susan Barnes",
               "profile_path": "/zhao7DKcdfWXZEwfCkhZtgJxMSO.jpg",
               "id": 104059,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mrs. Tetlow",
               "gender": 1,
               "credit_id": "52fe449f9251416c9101718f",
               "name": "Anne Pitoniak",
               "profile_path": "/zcQf85EI3UyqDc9SKqrVCSKIOx5.jpg",
               "id": 38691,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe449f9251416c91017175",
               "name": "Marek Kanievska",
               "profile_path": null,
               "id": 78523,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe449f9251416c9101717b",
               "name": "E. Max Frye",
               "profile_path": null,
               "id": 68928,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.068512,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 31776,
      "vote_count": 21,
      "budget": 0,
      "overview": "Carol Ann MacKay is a popular nurse at a retirement home, and spends her free time with her hunky athletic husband Wayne MacKay, who would do anything for her, including cleaning up the messes her ideas get them in. When legendary bank robber Henry Manning, who had a major stroke in prison, is placed in the home and supposedly having lost all control over his body, she notices he must be in far better condition then he lets appear. Soon Carol gets his confidence and the two start planning how they three can commit another robbery on an armored money transport.",
      "similar": [],
      "original_title": "Where the Money is",
      "runtime": 89,
      "poster_path": "/pgSr9HQXKPGoCIjNCnFTnImlPiQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/6Ry6uNBaa0IbbSs1XYIgX5DkA9r.png",
            "name": "Scott Free Productions",
            "id": 1645,
            "origin_country": ""
         },
         {
            "logo_path": "/nlG4JEjJ7SAFDehgIVvHFBPW23y.png",
            "name": "Gramercy Pictures",
            "id": 37,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Intermedia Films",
            "id": 763,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "IMF Internationale Medien und Film GmbH & Co. 2. Produktions KG",
            "id": 23861,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pacifica Film",
            "id": 10926,
            "origin_country": ""
         },
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         }
      ],
      "release_date": "2000-04-14",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "They make their money the old-fashioned way. They steal it.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Marek Kanievska"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "E. Max Frye",
         "E. Max Frye"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0149367/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MzY3NTExMF5BMl5BanBnXkFtZTcwNjU2ODkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Newman, Linda Fiorentino, Dermot Mulroney | See full cast and crew »"],
      "reviews": [
         "For admirers of quality movies, one of the greatest sources of frustration has always been the inverse ration that exists between movies that are good and movies that make money. The essential rule of thumb is that, with few exceptions, the larger a film's budget happens to be, the less likely that that film will have anything new or original to say. The corollary principle is that, given the choice between patronizing a film that is original, complex and meaningful and one that is derivative, simpleminded and thematically empty, the mass audience will go with the latter type every time. Driven by the need for profits, large studios are then forced to cater to this `lowest common denominator' mentality. The result is that wonderful little films are almost invariably squeezed out of the marketplace, left to languish in obscure art houses scattered in a few major cities, while bloated, mindless multi-million dollar monstrosities fill sprawling megaplexes found in cities, suburbs and rural areas stretching literally from coast to coast. How many people, for instance, have even heard of, let alone seen, `Where the Money Is'? Yet here is a film dedicated to the spirit of pure fun, a lighthearted black comedy that is blessedly free of the hardboiled cynicism and explicit violence that plague so many such films. The film hooks the audience from the very start with the originality of its plot and setting. Set in a small Oregon town (though the film was, rather inexplicably, filmed in the environs of Montreal), the movie stars the superb Linda Fiorentino and Dermot Mulroney as long time high school sweethearts who have married right after graduation, found their comfortable little niche in the small world they inhabit and now begun to take each other for granted. (The opening scene introduces us to them as they are roadhousing around on prom night in his prize Mustang, the one symbol of a rebellious youth that he still clings to all these years later). It is at her job \u0096 as a nurse at a local convalescent hospital \u0096 that a measure of excitement reenters their humdrum lives and relights the long dormant spark of adventure that she, in particular, has been missing. This novelty comes in the form of an aging bank robber (Paul Newman) who has apparently suffered a stroke and is sent to the rest home due to overcrowding at the prison hospital. The early scenes of the film are wickedly funny as Fiorentino, suspicious that her new patient may just be faking it, plays a clever little game of cat-and-mouse to try to catch him in his impressive charade. Suddenly, having achieved her goal, she is not quite so sure who is really the cat and who the mouse. To say more about the plot would really do a disservice to this film, which manages to keep us intrigued by the unpredictability of its most unusual setup. Fiorentino and Mulroney are thoroughly believable as a couple of once-edgy youngsters grown into responsible, comfortable but slightly restless adults. She, in particular, finds herself stifled by the humdrum quality of both their life and their marriage together. Mulroney, on the other hand, seems to have pretty much lost that desire for living on the edge, yet, for her sake and, perhaps, for the sake of that tiny spark for adventure that still lives unquenched somewhere deep inside him, he is willing to meet her halfway \u0096 even if a bit reluctantly \u0096 on the field of lawlessness. Newman, as the expert bank robber who stumbles unexpectedly into their lives, provides the perfect catalyst for renewed adventure. The amazing thing about `Where the Money Is' is that, thanks to its writers, Max Frye, Topper Lilien and Carroll Cartwright, and the director, Marek Kanievska, the film never ends up taking itself too seriously. It always knows that its prime purpose is to give the audience a fun time. This it does with the help of its three dazzling stars, who seem to be having the time of their professional lives (Fiorentino is especially wonderful). It sure must be infectious, because we, in the audience, have a pretty damn good time watching them.",
         "Paul Newman shines in this implausible, but highly watchable caper flick about three unlikely armored car robbers. It is hard to believe that Newman is 75. He is fitter and more energetic than most men who are fifteen years his junior. He single-handedly elevates this film from mediocrity. The story is nothing unique. Henry (Newman) is a bank robber who is delivered to a nursing home after a debilitating stroke. His nurse (Linda Fiorentino) suspects he is not the vegetable he appears to be. After she gets him to admit his ruse, she exhorts him to knock off an armored truck with her. Director Marek Kanievska and writer Max Frye leave numerous gaps in the story. We never discover what tips off Carol that Henry is faking. They didn't do enough character development of Carol and Wayne (Dermot Mulroney) to make it believable that they would want to become criminals, no less hatch the scheme. The idea that Carol was pretending to be the dispatcher for the armored car company from a cell phone in the truck is a flimsy concoction. Even with digital technology, most cell phones in moving vehicles sound like cell phones, and you can hear road noises and the engine running. Still, despite a lackluster script, the film is enjoyable because of Paul Newman. Newman gives a fantastic rendition of a stroke victim, and his hardened and cantankerous portrayal was marvelous. Linda Fiorentino plays the scheming sex-kitten nurse in one of her better performances. The screen chemistry between Fiorentino and Newman is excellent with undercurrents of sexual desire constantly flaring up between them. Dermot Mulroney is relegated to a role that was essentially a fifth wheel and is adequate as Carol's loser of a husband. I rated this film a 7/10. It is good entertainment and an opportunity to see a master at work. Newman hasn't lost a beat in a movie career that spans almost a half a century. It is worth seeing for him alone.",
         "My girlfriend took me to an advance screening of this film so we had no idea what we were in for. I had just seen Nobody's Fool so I was well prepared for the pace of the film, and Newman's sly, charming style. Fortunately, he didn't disappoint, (he's still as reliable as ever), and the film still held plenty of surprises for me. I will admit I was less than interested for the first 20 minutes, but by the end, I was impressed. Newman plays Henry Manning, a old thief who crosses paths with Carol Ann MacKay (Fiorentino) who is a restless nurse at a rest home. As you can guess, it's a heist film with plenty of hilarity and real suspense. Keep in mind, it's a mild hilarity and suspense, with subtle exchanges and real emotional investment. The scenes play slowly and meticulously, like a heist, waiting for the exact moment to give us the payoff. They hit the mark more often than not in both arenas of comedy and suspense, The chemistry between the principles is strong, especially with Fiorentino and Newman, with intelligent dialogue that takes the plot through a natural progression that doesn't betray the two lead characters. Make no mistake, Newman's presence elevates this film, as he often does, and he does it with such ease that it's a joy to watch. If you like Newman's recent work, this film will not disappoint you. As I have indicated, it's a slow film, not too deep, not overly witty, but subtle. It works on many levels, so I have no problem recommending it to fans of Paul Newman.",
         "In playing a small town girl taken by the world wise con man, the chemistry between Fiorentino and Newman is perfect. Mulroney is basically Bud Bundy while Paul Newman is, well Paul Newman, and Fiorentino effortlessly falls for him, as does the audience. Well cast, well acted caper flick that runs on Newman's star quality.",
         "i just love this little ditty. Nothing heavy or too meaningful here...just good old fashioned entertainment. A neat little story told very nicely and believably, with good cohesion and style. Intelligently shot and scored with a good dialogue which keeps this smart little story rolling along very nicely.Very funny at times and thoroughly enjoyable. I highly recommend it as a \"feel good\" temporary diversion. Great cast and an interesting plot that will keep you looking forward to the next viewing, which is what it is all about...",
         "At the time of it's short theatrical release, \"Where the Money Is\" just didn't seem like a very appealing film. And due to it hitting video store shelves within only a matter of months, I had decided that this film just wouldn't be that great. But, I decided to check it out anyway and I am very happy I did. What we are given with \"Where the Money Is\" is a classy caper flick with some good performances. Although not a classic, WTMI is definately good wholesome entertainment. The script focuses more on intrigue and comedy, rather than the profanity and violence that most caper flicks are centered around. This one is a rare gem, and I'm glad I found it. 8.5/10",
         "This is no \"STING\" but it is an entertaining Paul Newman film. We are Paul Newman fans from way back and enjoy seeing him in virtually anything. This was an enjoyable romp and we certainly recommend it to any movie goer.",
         "Age has pared Paul Newman's fine features to a sketch - it's also honed his huge movie appeal to such basics that he can pretty much maintain our attention while in a coma. But as if to test his powers, in the shagging and intriguing caper \"Where the money is\", Newman plays Henry, a former famous bank robber and current guest of the prison system who actually is in a coma, or at least a stroke like state of suspended animation. Slumped and glazed, Henry sits for hours in his wheelchair at the nursing home to which he has been transferred tended to by Carol (Linda Fiorentino) a less than angelic nurse and onetime prom queen. Carol lives with her husband, in the same drab town where she grew up. She's bored as a former prom queen always is. And she's convinced that Henry - who had led the only interesting life around - is faking his stupor. So she bamboozles him into dropping his act, then promises to keep the secret, if he'll include her on just one more Bonnie and Clyde size heist. British director Marek Kanievska counts on the audience knowing that Newman's fame is tied to playing heist pros and hustlers, and that we're not just seeing some gravel voiced coot in a wheelchair - we're seeing what Butch Cassidy might have become had he not messed up in Bolivia. The minimalist acting the star has done in recent films like \"Message in a bottle\" and \"Nobody's fool\" serves him well, because he's confident - rightfully so- that the audience will fill in the blanks. Incorrigible Henry is fundamentally opaque, but canny Newman lets his eyes do the talking. As for Fiorentino, the star of \"The last seduction\" reprises her dangerous, restless woman persona as if to remind us (and casting agents) that if she got every role currently going to Catherine Zeta Jones, movies would be a lot more interesting. The payoff is the clash between a taciturn bandit faking feebleness and an angry Florence Nightingale, faking compassion, played by two actors who are the real thing.",
         "Henry robs banks because that's 'where the money is'. Unfortunately, he has suffered a stroke and is confined to a wheelchair rendering his stealing days over. Or does it? The film starts with a flashback to Carol and Wayne leaving the prom as newly crowned King and Queen driving recklessly and crashing. Years later their relationship and life is stale and boring - but only Carol thinks so. It could be argued that the flashback is just an extraneous piece of action to keep the audience interested - which is true - but it also shows where Carol and Wayne are coming from and contrasts with the dull life they have now. The film asks you to root for criminals and isn't the first film to do that by any means but what I find interesting is what makes the normally moral cheer amorality. Harry had to all intents and purposes retired from a life of crime but, ironically, he gets his stolen money stolen and can't go to the police - for obvious reasons. Many in the audience would identify with Carol wanting to escape to something better. The potential victims are all big businesses and one of the owners in particular is a snotty tosser. And the plan is to rob without violence or the threat of violence. Where the Money Is never drags as it reaches its conclusion. The dialogue is always excellent and there are at least a couple of classic lines in there. Being very picky about plotting I couldn't fault the screenwriters' work. What struck me most about the film was the simplicity and economy of the writing. It's a crime that the film didn't make its money back domestically in theatres. It's meant to be Paul Newman's last ever film and it's good that it's something so artistically successful if not commercially so.",
         "Yes Newman is still acting and although he is definitely starting to look elderly, still has a very strong screen presence. He plays a former bank robber who is now a stroke victim and with the help of his nurse manages one last heist. If you like bank robbing movies, or Newman, you won't be disappointed. It moves at a very quick pace with a lot of twists and excitement. Newman gives another good performance especially when he stays comatose during a lap dance by Fiorentino. However the direction is a little too compact. You almost wish it would slow up a bit and add a little more flavor or atmosphere. The idea of a nice law abiding couple suddenly doing a major crime seems a bit hard to believe. Also the color schemes within the hospital are downright ugly! Overall a good time filler, but certainly no award winner."
      ],
      "genres": [
         "Drama",
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Gramercy Pictures (I)",
         "IMF Internationale Medien und Film GmbH & Co. Produktions KG",
         "Intermedia Films"
      ],
      "summaries": [
         "Carol Ann MacKay is a fine, popular nurse at a retirement home, and spends her free time with her hunky athletic husband Wayne MacKay, who was the star of her school's football team when she was high school prom queen; he still would do anything for her, including cleaning up the messes her ideas get them in. When legendary bank robber Henry Manning, who had a major stroke in prison, is placed in the home, supposedly having lost all control over his body, she notices he must be in far better condition then he lets appear, and tries everything to find out- when she pushes his wheelchair in a canal at a picnic, Henry gives up. The McKays keep his secret and Henry doesn't actually run in Waynes car as his first impulse was; soon Carol gets his confidence and the two start planning how they three can commit another robbery on an armored money transport, which brings them together. It doesn't go quite according to plan, but they get the loot; however, before the money can be split some big surprises change everything...",
         "Legendary bank robber Henry Manning pushes his luck too far and ends up in prison, where he suffers a massive stroke. He is transferred to a nursing home, in the care of Carol Ann McKay, a high school prom queen who married her boyfriend Wayne, the star of her school's football team, and whose glamour days are well behind her. After a few of her personal effects mysteriously disappear, Carol Ann starts to suspect that Henry isn't as sick as he seems, and she and Wayne are soon working with Henry to plan his last and greatest score."
      ],
      "budget": 18000000
   },
   "movielensId": 3537,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-04-14",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Marek Kanievska"],
      "runtime": 89,
      "movieId": 3537,
      "title": "Where the Money is",
      "mpaa": "",
      "actors": [
         "Paul Newman",
         "Linda Fiorentino",
         "Dermot Mulroney",
         "Susan Barnes",
         "Anne Pitoniak"
      ],
      "imdbMovieId": "0149367",
      "originalTitle": "Where the Money is",
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["fhEoCHfkgGg"],
      "plotSummary": "Carol Ann MacKay is a popular nurse at a retirement home, and spends her free time with her hunky athletic husband Wayne MacKay, who would do anything for her, including cleaning up the messes her ideas get them in. When legendary bank robber Henry Manning, who had a major stroke in prison, is placed in the home and supposedly having lost all control over his body, she notices he must be in far better condition then he lets appear. Soon Carol gets his confidence and the two start planning how they three can commit another robbery on an armored money transport.",
      "tmdbMovieId": 31776,
      "avgRating": 3.08916,
      "releaseYear": "2000",
      "numRatings": 286,
      "posterPath": "/pgSr9HQXKPGoCIjNCnFTnImlPiQ.jpg"
   }
}