{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "blindness and impaired vision",
            "id": 1741
         },
         {
            "name": "victim",
            "id": 4399
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "falling in love",
            "id": 13072
         },
         {
            "name": "series of murders",
            "id": 14676
         },
         {
            "name": "police officer",
            "id": 15090
         },
         {
            "name": "surveillance",
            "id": 18420
         }
      ],
      "imdb_id": "tt0104549",
      "video": false,
      "title": "Jennifer Eight",
      "recommendations": [
         10859,
         12395,
         9605,
         19380,
         2990,
         1644,
         19143,
         4823,
         11060,
         1710,
         10433,
         12661,
         2124,
         14249,
         12623,
         2246,
         28902,
         2045,
         11851,
         6723
      ],
      "backdrop_path": "/uHmSupRi8iy95PqSNuZTaGw0ECA.jpg",
      "revenue": 11390479,
      "reviews": [{
         "author": "John Chard",
         "id": "537812a3c3a36855420029e2",
         "content": "The blind leading the blind.\r\n\r\nJennifer 8 is written and directed by Bruce Robinson. It stars Andy Garcia, Uma Thurman, John Malkovich, Lance Henriksen, Kathy Baker and Graham Beckel. Music is by Christopher Young and cinematography by Conrad Hall.\r\n\r\nThe small town of Eureka and John Berlin (Garcia) is the new cop in the precinct. When a severed hand is found at the local dump it leads Berlin to believe a serial killer is at work. One who has a penchant for blind girls.\r\n\r\nThe problems quickly mounted up for Jennifer 8, it flopped big in America and went straight to home format release in the UK. Problems back stage got so bad that Bruce Robinson quit Hollywood and never made another film for 19 years! In spite of these facts, it’s not the monstrosity it was originally painted as back on its “limited” release.\r\n\r\nIt’s a frustrating film in many ways because it promises so much. There’s bags of moody atmospherics wrung out by Conrad Hall’s superb photography, where he filters most things via minimal lighting. Much of the play unfolds in ominous surroundings, where dialogue exchanges are either hushed or laced with harried fervour, and the writing is actually quite smart as it blends psycho thriller staples with strong characterisations that are in turn boosted by committed acting performances. Yet these things can’t compensate for the too long run time, a rushed ending and some awkward tonal shifts that often take you out of the required mood. The rushed ending is particularly galling, after asking the audience to stay with the pic for two hours, it’s not unreasonable to expect a good long and dramatic finale, sadly that’s not the case.\r\n\r\nFans of neo-noir type visuals have some interest here, as does anyone who likes the type of serial killer movies that dominated the late 80s and early 90s before Fincher’s Seven raised the bar. 6/10",
         "url": "https://www.themoviedb.org/review/537812a3c3a36855420029e2"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sgt. John Berlin",
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd5d",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sgt. Freddy Ross",
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd61",
               "name": "Lance Henriksen",
               "profile_path": "/wf4Pr9RxsHGd0O9fLPiB3Al8IVC.jpg",
               "id": 2714,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Helena Robertson",
               "gender": 1,
               "credit_id": "52fe436c9251416c7500fd65",
               "name": "Uma Thurman",
               "profile_path": "/6SuOc2R7kXjq3Em24KTNDW9qblJ.jpg",
               "id": 139,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "John Taylor",
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd69",
               "name": "Graham Beckel",
               "profile_path": "/hv1BySh6NFhR9dz1xtqdKn3gGCF.jpg",
               "id": 6110,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Margie Ross",
               "gender": 1,
               "credit_id": "52fe436c9251416c7500fd6d",
               "name": "Kathy Baker",
               "profile_path": "/y9Sw1QsJQvcqDPvG4vYVy1lfR5P.jpg",
               "id": 1907,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Chief Citrine",
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd71",
               "name": "Kevin Conway",
               "profile_path": "/803hyktASensafHsdvDCnlzWK8k.jpg",
               "id": 27116,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Agent St. Anne",
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd75",
               "name": "John Malkovich",
               "profile_path": "/tCtiWZbKKRgHhLxFCIPfveYAsdc.jpg",
               "id": 6949,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe436c9251416c7500fd7b",
               "name": "Bruce Robinson",
               "profile_path": "/mImqLKRBNPUZz8dIAzoIvkADDwS.jpg",
               "id": 8966,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe436c9251416c7500fd81",
               "name": "Bruce Robinson",
               "profile_path": "/mImqLKRBNPUZz8dIAzoIvkADDwS.jpg",
               "id": 8966,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd87",
               "name": "Gary Lucchesi",
               "profile_path": "/zQRUANlcJXa1TFVoCYK1vjIMmEh.jpg",
               "id": 3953,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd8d",
               "name": "Scott Rudin",
               "profile_path": "/zR8sdlGblto6dneAr2mckTowwEl.jpg",
               "id": 2997,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436c9251416c7500fd93",
               "name": "David Wimbury",
               "profile_path": null,
               "id": 65106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436d9251416c7500fd99",
               "name": "Christopher Young",
               "profile_path": "/2laVovSXDVpHRS6HSpKyCspSmze.jpg",
               "id": 19155,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe436d9251416c7500fd9f",
               "name": "Conrad L. Hall",
               "profile_path": "/fGWnmu9EAYqX974sP0ddkOjgVEy.jpg",
               "id": 8217,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436d9251416c7500fda5",
               "name": "Conrad Buff IV",
               "profile_path": null,
               "id": 3987,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561a72bfc3a368630d00028c",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561a7346c3a3683ca100043f",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561a7447c3a3685ff9000326",
               "name": "Richard Macdonald",
               "profile_path": null,
               "id": 11061,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "561a74649251412c9c000ddb",
               "name": "Kacy Magedman",
               "profile_path": null,
               "id": 1446987,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 1,
               "credit_id": "561a74bfc3a3684837001cff",
               "name": "Judy L. Ruskin",
               "profile_path": null,
               "id": 7536,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "564e5420c3a3680712000b3d",
               "name": "Thomas Johnston",
               "profile_path": null,
               "id": 587969,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.636897,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10424,
      "vote_count": 103,
      "budget": 20000000,
      "overview": "A big city cop from LA moves to a small town police force and immediately finds himself investigating a murder. Using theories rejected by his colleagues, the cop, John Berlin, meets a young blind woman named Helena, who he is attracted to. Meanwhile, a serial killer is on the loose and only John knows it.",
      "similar": [
         1949,
         336843,
         274,
         10285,
         2832,
         949,
         9798,
         137094,
         156022,
         189,
         181283,
         158011,
         654,
         1939,
         8834,
         663,
         10900,
         445954,
         12150,
         681
      ],
      "original_title": "Jennifer Eight",
      "runtime": 124,
      "poster_path": "/77EFm9lmAqS1Jy2oTx1x6Wd0E2Y.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1992-11-06",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Is anyone there?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bruce Robinson"],
      "runtime": 124,
      "synopsis": null,
      "writers": ["Bruce Robinson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104549/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMTk3NTc1OV5BMl5BanBnXkFtZTcwMTc5NzMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Andy Garcia, Uma Thurman, Lance Henriksen | See full cast and crew »"],
      "reviews": [
         "This is one of those movies that I still pull out every once in a while and just pop in. It's absolutely entertaining, with great performances from pretty much everybody, but especially Andy Garcia and Lance Henrikson. It plays out like a good mystery/thriller should: Frustrating twists and turns, brooding atmosphere and music, and layer after layer of clues that you know are building to a big time climax. I really can't find anything to criticize about this film and I'm surprised it's IMDB rating isn't higher. If you haven't seen it, you'll be doing yourself a favor by bypassing the new releases for just one night at blockbuster, and picking this one up.",
         "I cannot and will not for the life of me comprehend why people do not like provoking and complex movies, (ya know, WHERE YOU HAVE TO BE ABLE TO THINK). Jennifer 8, is a great movie, it is daring, smart, witty, scary and.... a bit on the real side. There are a lot of movies which people that due to reading their reviews should not watch movies that are beyond their simple mind and well, IQ. This movie is well on the top of the list for under rated serial killer flicks. Rent, Buy, Borrow but must see this excellent movie.",
         "I like a good suspense story as much as anyone else, but this one really stands out. If it doesn't get the recognition it deserves, maybe because it's a \"quiet\" thriller, without shocking or gross-out scenes ; it relies mainly on characters and atmosphere - very moody and autumnal. For once, the killer's identity is logical and honest, but there is so much more to this, especially a graceful photography. Okay : I love this one. This is no brain candy or beer-and-popcorn, just honest, straightforward stuff, which reminded me very much of literary thriller writers like Ed Gorman or T. Jefferson",
         "This is easily one of the most underrated Hollywood films of the nineties - it's got a compelling script, beautiful performances (particularly from Andy Garcia, Uma Thurman, and John Malkovitch in a short but unforgettable cameo.), some of the best cinematography ever set on film (director of photography Conrad Hall later went on to shoot 'American Beauty'.), and one of the greatest scores ever written by underrated composer Christopher Young. As it is, this film is heaven from a filmmaker's perspective and a pretty damn good drama to boot. Highly recommended.",
         "\"Jennifer 8\" is an underrated movie of some of the greatest quality I have seen yet. Andy Garcia, Lance Henrikson, Uma Thurman, and John Malkovich all give extraordinary performances in a novel script that involves intriguing and very deep characters. The music mixes with the dark directing style perfectly to set the thriller atmosphere, and there is just enough action to make anyone happy. Behind the murders involved and the tense atmosphere, the movie also tells a romantic love story of a blind woman and a cop returning from the badlands. It is a movie that draws you in - and I'd recommend it to everyone.",
         "It's a long and complex movie. Complex not because there are too many subplots. (There are only two interwoven plots: the solution of the mystery and the mating of Andy Garcia and Uma Thurman.) It's just that we follow events in considerable detail. That's okay, in itself, but the climax itself -- the revelation and killing of a serial murderer -- isn't well adumbrated. The climax pivots on the finding of an antihistamine capsule and everything falls together in the last fifteen minutes without any previous hints. The director follows most of the rules. Nothing fancy. He does give us two outstanding scenes. In the first, Uma Thurman, who has been blind since childhood and sequestered in a bleak institution is taken to a Christmas party by Garcia, the detective investigating serial murders, in one of which cases she is a witness. A friend dresses her up and covers her with makeup for her debut. (I liked her better as a lean lanky-looking Bohemian with a cello. Dressed up she looks a little whorish.) The party begins well. But later she finds herself standing alone in the middle of a dozen drunken guests who bump into her from unexpected directions. The record player is blaring \"Louie Louie,\" and everyone ignores her. Her anxiety is manifest as she is slowly encircled by the camera, and we are as confused and frightened as she is. Thurman and the director do a polished job here. Another memorable scene is the interrogation of Garcia by John Malkovich. Malkovich hams it up as usual. He seems to be constantly sniffing and speaks as if he had a cold. \"You got mbarried but byew had a bad mbarriage, didn't byew?\" But that's okay too. It must have been a hard scene to shoot. It's full of tight close ups of the two faces, sometimes only inches apart. Sometimes Malkovich even whispers into Garcia's ear. Garcia is tense, grief stricken, and angry. Malkovich is sly and insinuating. There is no music in the scene. Aside from the dialogue everything is perfectly quiet, except for the squeaking of wheeled office chairs or the harsh breathing of the actors. One wrong move, one errant jactitation, one delinquent vocal chord, and everything goes back to Square One. Whatever troubles the scene might have given the film makers, what we see on screen is about as good as it gets. Two real professionals at work in front of a camera. I'll make the rest of the points kind of quickly. Conrad Hall is a great cinematographer, and he gets some of the scenic locations down neatly. But -- man, is this gloomy. Okay, we don't expect it to be otherwise when it's a howling blizzard and three in the morning. But the interiors are almost as dark. (Enough with the symbolism!) Why is a police laboratory so dark we can hardly make out the faces? There is no contrast between interiors and exteriors. Somebody turn on the lights! The director should get no more than a gentleman's C for the introduction of the institute's janitor. An elevator door opens. We see a man's back. The man turns around. Jump to a close up of his bald head and gargoyle face with glasses like coke-bottle bottoms. It would have been fine in a movie with a title like \"I Dismember Mamma.\" There us some gratuitous nudity too. I found it objectionable for two reasons. One is that there wasn't enough of it. Second is that a body double is used. Much better to have had a long long scene of gratuitous nudity using the lissome blond herself. Maurice Jarre evidently had his score thrown out. The replacement is pretty good. This murky and rather solemn film is unimaginable with a loud action-y score full of electronic percussion and unceasing in its torture. It's nice that Thurman plays a music teacher at the institute but I kind of wish the instrument we had seen her with had been something other than a cello. It must be played in an undignified position and is the second most preposterous instrument in an orchestra, the first being the Glockenspiel. Oh -- and by the way, Garcia tracks the murderer down by following a trail of clues to a house many hours' drive away, in Oakland. While he's riffing through the drawers, he's caught by the murderer and framed. How did the murderer know that Garcia would be there? Eureka's not a bad little town, although it's rainy all winter and foggy all summer. It keeps the riff-raff out. My ship used to dock at Field's Landing. I wonder if the Ranchotel is still open? Very friendly patrons.",
         "\"Jennifer 8\" is a solid suspense thriller that is smart, inventive, and a success overall. Cops Andy Garcia and Lance Henriksen are trying to stop a serial killer who seems to always be one step ahead of them. They are positive that the next victim will be a blind woman (Uma Thurman). She is basically the bait, but it still appears that the killer is just a little smarter than the cops. In the end, an unconventional conclusion will bring everything together. \"Jennifer 8\" has a smart screenplay, strong direction, and a great cast. John Malkovich and Kathy Baker, in particular, are strong in short supporting roles. 4 stars out of 5.",
         "\"Jennifer Eight\" is one of those movies that flies under the radar. For whatever reason, it never got the accolades I feel it deserves. It is a beautifully filmed, haunting movie that showcases some very fine performances. Uma Thurman is remarkable as the blind Helena, and one would be hard pressed to find fault with her very realistic performance as the would-be next victim for the serial killer. Likewise, Andy Garcia, is excellent as the tough, big city cop who is working through his own personal issues. One of the most compelling performances is that of John Malkovich. Arguably one of the best actors we have today, his commanding depiction of the hard-grilling FBI man is superb, and worth the watch just for his few cameos alone. But don't get me wrong. This movie is very, very good. It will leave you guessing to the end. Overall, beautiful cinematography, beautiful score, great thriller. Highly recommend this underrated gem. Very much worth the viewing.",
         "I have no idea what did Bruce Robinson in with critics of this movie. While it's so that the ending is perhaps abrupt, and that there are some small inconsistencies of plot, much of the caviling and carping about this film seems pointed in the direction that the identity of the killer was obvious. 'Jennifer 8' is not an upbeat film, nor is it a standard cop drama. It is a compelling portrait of a professional on the edge and a longstanding co-dependent relationship collapsing under fire. The acting is uniformly superb, and the script up to the task. A genuine insight into the limits of human relationships is Robinson's forte, and he doesn't disappoint here. It's important to remember that small towns protect their own. That being said, I applaud Robinson for successfully evoking the closeness and claustrophobia of small towns, thus making the protective impulse, to this viewer at least, believable. Robinson succeeds with 'Jennifer 8' in ways that Sam Raimi failed in both 'A Simple Plan' and 'The Gift': Robinson convinced me that willed blindness (get it?) hindered the search for a dangerous killer. As with his classic, 'Withnail and I,' Robinson scores with textures, tones, and very subtle attitudes. Another commenter singles out the 'junk mail' line Garcia quotes from his dream about God (God tells Garcia in his dream that God sees prayers as junk mail) as 'sophomoric'. First, that's part of the point about Garcia's character. He's a bitter, adolescent guy. Although fans of Garcia's might not want to embrace it, he's not a very nice person in this film, and remains substantially unredeemed. Perhaps this resolution explains some of the hostility to this film. John Berlin (Garcia) is not an anti-hero, but his is fundamentally weak in some critical way. His healing has made him rigid, not clear in his thinking, self-righteous, but not necessarily right. Second, the dream about God is a very telling moment in the film because Robinson keeps it so small. It's almost a throw-away scene, but it gives great insight into both the despair and the essential shallowness of Berlin's self-reflection. It is these tendencies that lead Berlin to make a terrible mistake that nearly destroys everything in his world. I rate this a strong 8/10.",
         "Jennifer 8 is a great thriller up until the last 10 or so minutes when the movie completely unravels and almost falls apart. But, the strong performances and solid writing up until that point make up for that weakness. the plot is your basic cop-(Andy Garcia)-protecting-a-beautiful-blind-woman-(an appropriately cast Uma Thurman)-who-is-being-targeted-by-a-sadistic-serial-killer. the film does manage to add some nice twists and turns but as previously mentioned the last 10 minutes or so are so overblown and ridiculous that you're left shaking your head in amazement that it was the best the filmmakers could come up with for an ending. But, on the other hand, the acting is very well done especially by the two leads and the film has quite a few genuinely suspenseful moments. SPOILER AHEAD: just thought i would correct a misconception about a scene in this film. that IS NOT Uma Thurman nude in the bathtub scene. the neck down shots are a body double. she was refusing to do any nudity at this time in fear of getting typecast as a sexpot after Dangerous Liaisons and Henry and June. so the director just used facial close ups of Uma combined with nude shots of another woman's body. a suspenseful film that almost holds up until the end and worth checking out if you're in the mood for a well done thriller. rating:8"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "A big-city cop from L.A. moves to a small-town police force and immediately finds himself investigating a murder. Using theories rejected by his colleagues, the cop, John Berlin, meets a young blind woman named Helena, who he is attracted to. Meanwhile, a serial killer is on the loose and only John knows it.",
         "John Berlin is a cop teetering toward burnout from life on the streets of L.A., and the collapse of a bad marriage. At the invitation of an old friend, fellow cop Freddy Ross, Berlin bolts from the LAPD for a supposedly quieter life in rural California with the Eureka police force. Instead, Berlin prickles his new colleagues, including John \"J.K.\" Taylor, who was passed over for promotion in order to make room for Berlin, by re-opening the case of a serial killer of blind girls which went unsolved despite a full-time six-month effort by the department. The case has already cost the lives of seven victims. Berlin is trying to connect the case to a body found at a dump, but Taylor and chief Citrine refuse to believe that the body at the dump is in any way connected to the case. Berlin becomes convinced that \"Jennifer 8\" -- or victim 8 -- will be blind student Helena Robertson, whose roommate Amber was the seventh victim. Berlin becomes obsessed with the case, despite an almost complete lack of hard evidence, and he becomes romantically involved with Helena, who resembles his ex-wife. Concerned for Berlin's physical and emotional welfare, Ross accompanies Berlin on a stakeout at the institute where Helena lives in a dorm, after leaving Helena at a party with Ross's wife Margie. When Berlin and Ross see lights in the closed school, Berlin investigates and is knocked unconscious by the killer. The killer then shoots Ross dead with Berlin's gun. After a grueling interrogation by FBI agent St. Anne, who thinks it was Berlin who killed Ross, Berlin is arrested for Ross's murder, but is bailed out by Margie, who believes the truth that Berlin is not the killer. Berlin sets out to clear his name by finding the killer."
      ],
      "budget": 20000000
   },
   "movielensId": 3557,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-11-06",
      "dvdReleaseDate": "2000-04-11",
      "directors": ["Bruce Robinson"],
      "runtime": 124,
      "movieId": 3557,
      "title": "Jennifer Eight",
      "mpaa": "R",
      "actors": [
         "Andy García",
         "Lance Henriksen",
         "Uma Thurman",
         "Graham Beckel",
         "Kathy Baker",
         "Kevin Conway",
         "John Malkovich"
      ],
      "imdbMovieId": "0104549",
      "originalTitle": "Jennifer Eight",
      "genres": [
         "Crime",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A big city cop from LA moves to a small town police force and immediately finds himself investigating a murder. Using theories rejected by his colleagues, the cop, John Berlin, meets a young blind woman named Helena, who he is attracted to. Meanwhile, a serial killer is on the loose and only John knows it.",
      "tmdbMovieId": 10424,
      "avgRating": 2.96359,
      "releaseYear": "1992",
      "numRatings": 714,
      "posterPath": "/kXYGrgE99FMAupMYHkSPHRqo5Jy.jpg"
   }
}