{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0084723",
      "video": false,
      "title": "Stacy's Knights",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stacy Lancaster",
               "gender": 0,
               "credit_id": "54e1a7e49251411956007304",
               "name": "Andra Millian",
               "profile_path": null,
               "id": 174880,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Will Bonner",
               "gender": 2,
               "credit_id": "54e1a7f3925141469f005013",
               "name": "Kevin Costner",
               "profile_path": "/ePo87kGyyY8JZ3z7Zm7Z2GYdmJ8.jpg",
               "id": 1269,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jean Dennison",
               "gender": 0,
               "credit_id": "54e1a813925141454f00492e",
               "name": "Eve Lilith",
               "profile_path": null,
               "id": 1427759,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Shecky Poole",
               "gender": 0,
               "credit_id": "54e1a828c3a36845510078b4",
               "name": "Mike Reynolds",
               "profile_path": "/aSvh9N11W8nZpki5pnhRb5sXQMG.jpg",
               "id": 1217730,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Buster",
               "gender": 2,
               "credit_id": "54e1a8569251411953006d47",
               "name": "Loyd Catlett",
               "profile_path": "/9C9HoDjuzYzPNMWOEvCTr8W8fcS.jpg",
               "id": 2277,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54e1a6e9c3a3685756005354",
               "name": "Jim Wilson",
               "profile_path": null,
               "id": 7847,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54e1a72ac3a368087b000feb",
               "name": "Michael Blake",
               "profile_path": null,
               "id": 7844,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55bb528ec3a3684af800650c",
               "name": "Ann Locktov",
               "profile_path": null,
               "id": 1492072,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55bb52a592514123e70063c9",
               "name": "Freddy Sweet",
               "profile_path": null,
               "id": 1492073,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55bb52ba92514123df0069a9",
               "name": "Norton Buffalo",
               "profile_path": null,
               "id": 1031535,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "55bb5337c3a36869b4005a96",
               "name": "João Fernandes",
               "profile_path": null,
               "id": 58818,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "55bb53bdc3a3684af5006033",
               "name": "Bonnie Koehler",
               "profile_path": null,
               "id": 68127,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "55bb53cf92514123dd006944",
               "name": "April Webster",
               "profile_path": "/kck0zX5OHJsvmI6SoLh8ZZE5XaX.jpg",
               "id": 6052,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "55bb53e792514123df0069c8",
               "name": "Jill M. Ohanneson",
               "profile_path": null,
               "id": 28162,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.054029,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 310431,
      "vote_count": 0,
      "budget": 0,
      "overview": "Everyone has a talent, and dreams do come true. Stacy Lancaster has an incredible knack for Blackjack. Once she joins up with daring Will Bonner the two young gamblers are on a non-stop roll. Soon the casino wants to even the odds. How long can their winning streak last?",
      "similar": [],
      "original_title": "Stacy's Knights",
      "runtime": 100,
      "poster_path": "/uWAM4cleKkPf6e73kislafyFTAb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "American Twist",
            "id": 46667,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Crown International Pictures",
            "id": 1009,
            "origin_country": ""
         }
      ],
      "release_date": "1983-06-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Don't let their disguise fool you...just hope it fools everyone else!",
      "adult": false,
      "homepage": "http://www.crownintlpictures.com/ostitles.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jim Wilson"],
      "runtime": 100,
      "synopsis": "Everyone has a talent, and dreams do come true. Stacy Lancaster has an incredible knack for Blackjack. Once she joins up with daring Will Bonner (Kevin Costner) the two young gamblers are on a non-stop roll. Soon the casino wants to even the odds. How long can their winning streak last?",
      "writers": ["Michael Blake"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084723/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1NDI5MTg1MF5BMl5BanBnXkFtZTcwMzU3MjcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kevin Costner, Andra Millian, Eve Lilith | See full cast and crew »"],
      "reviews": [
         "This is an absolutely delightful tale of a gifted but shy young woman who, with the help of two mentors, transforms herself into a confident and unstoppable juggernaut in one particular Reno casino. When I first saw the film, I immediately had a crush on Andra Millian (plays Stacey). She pulled off this personality transformation beautifully and was certainly noticed here. She later was a regular in two TV series - \"The Paper Chase\" in the 70s and \"thirtysomething\" in the 90s. Andra still acts occasionally - most recently in the 2007 film \"Teeth\" - but is now a full-time licensed acupuncturist in Austin, Texas. And, Kevin Costner did a good job as Stacey's first mentor, Will. His performance in this film, not to mention \"Testament\" filmed the same year, undoubtedly contributed to his rise to prominence in Hollywood. But, suspension of disbelief is needed to enjoy this film. You must be willing to believe that casino managers would do what they did to Will (no, won't tell) just because he coached Stacey. And, you must be willing to believe that Jean Dennison (played by Eve Lilith) could seduce Shecky Poole. But, if you can suspend this disbelief, you'll enjoy this film as a triumph of the ordinary person against the odds. P.S. I found it odd that the film was available in Canada on DVD but only on \"used\" VHS tapes in the U.S. Since I wanted this unique film in my collection, I ordered it from Amazon.ca.",
         "this film is fine an OK b grader that isn't trying to win a academy award i am writing to mainly comment on another review which suggested the need for suspension of disbelief, which firstly doesn't make much sense, this is a movie, that is fictional , the whole premise of fiction is not about belief or disbelief its about fantasy, secondly the reviewer suggested this disbelief was needed because casino staff acted violently towards a winner using a system, where has this person been all there life, this is a fact of the American gambling experience, to suggest this is over the top and unbelievable makes me know that reviewer is both a hermit and a moron,as are most IMDb reviewers and users",
         "I bought this DVD for five bucks. The video quality was poor but it was fascinating to watch Kevin Costner as such a young dude wearing a cowboy hat, playing the role of a young Reno native. The lead actress is a mousy easily intimidated woman with her her older ugly sidekick. The Casino management calls her the mouse. They can't figure out how she wins such a high percentage of games. \"She counts some, but she also has a lot of luck working for her\". After winning 12K from the casino, the owner invites her, her older sidekick and Kevin to take his private jet on an all-expense paid trip to his other bigger casino in Vegas. They figure there they could get their money back. But with major coaching and practicing by Will Bonner (Costner), for one week before she hit the circuit, (she won 82 out of 100 games in practice), she is unstoppable. She wins another 35k or more in Vegas. Kevin Costner steals the movie with his natural in his own skin acting. The characters in the casino are also very realistic. As they watch her play, they send a guy to bump into her to see if she has any wires or recorders. The managers are bewildered by her ability to win. They send in a cold looking woman dealer to bounce her out using a short deck. As Stacy moves from table to table to get away from her, the dealer follows her with the short deck. A scuffle ensues as she demands to see the deck. The manager says they only show the deck to the gaming commission. They leave. PLOT SPOILER: Kevin introduces set up a meeting with Stacy and this mysterious old man that is so good at winning, he has some kind of deal with the casinos where they pay him off not to ever come to one. She spends the night at the old man's house playing cards. He tells her to forget the counting, the percentages, the number. Instead, concentrate on the deck. The deck is alive. Let it speak to you. He starts out by dealing 5 hands and asking her to identify the strength of each hand without turning them over. She picks the 2nd best had. He said, close. By 4AM he has her calling the card names psychically before he flips them over. He says keep going. She starts naming every card without him even flipping them over. She can see the all the cards in the deck in order and therefore can predict the result of every hand dealt on the table. She is now unstoppable. He sees her off in the morning with the farewell message that he's waited many years for her to show up. He never thought she would.",
         "SPOILER BELOW - DON'T READ IF YOU DON'T WANT THE PLOT RUINED! The protagonist, Andra Millian, plays a girl (Stacy Lancaster) who has a natural talent for blackjack. She starts off as a reserved girl with no confidence. Kevin Costner (Who's 27 in this 1982 film and plays Will Bonner) takes a shine to her and infuses her with confidence in herself. He encourages her to take on the casinos. After a debacle at a casino, Costner gets beaten to death by some of the casino's heavies. Anda devises a plan to ruin the casino, with the aid of some guys that she hires to play blackjack, under her watchful eyes. There are large plot holes and the film starts off quite slow. It picks up a lot of momentum and towards the end, the film is quite gripping. In some ways it reminded me of a casino version of the original \"Gone in 60 seconds\". - Maybe because aspects of the film appeared a little amateurish and other parts of the film seemed \"reportage\". I'd never heard of Andra Millian before (or since). She does have some acting skills. It was interesting to see Costner in this early film. He easily shone out from all the others in terms of charisma and acting ability. Watch this film for 90 minutes of fairly good entertainment. It's not a great film but it's a good film. Ian Rivlin"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Crown International Pictures",
         "American Twist"
      ],
      "summaries": ["Everyone has a talent, and dreams do come true. Stacy Lancaster has an incredible knack for Blackjack. Once she joins up with daring Will Bonner the two young gamblers are on a non-stop roll. Soon the casino wants to even the odds. How long can their winning streak last?"],
      "budget": 0
   },
   "movielensId": 3561,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-06-01",
      "dvdReleaseDate": "2000-04-11",
      "directors": ["Jim Wilson"],
      "runtime": 100,
      "movieId": 3561,
      "title": "Stacy's Knights",
      "mpaa": "",
      "actors": [
         "Andra Millian",
         "Kevin Costner",
         "Eve Lilith",
         "Mike Reynolds",
         "Loyd Catlett"
      ],
      "imdbMovieId": "0084723",
      "originalTitle": "Stacy's Knights",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Everyone has a talent, and dreams do come true. Stacy Lancaster has an incredible knack for Blackjack. Once she joins up with daring Will Bonner the two young gamblers are on a non-stop roll. Soon the casino wants to even the odds. How long can their winning streak last?",
      "tmdbMovieId": 310431,
      "avgRating": 2,
      "releaseYear": "1983",
      "numRatings": 4,
      "posterPath": "/uWAM4cleKkPf6e73kislafyFTAb.jpg"
   }
}