{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0180837",
      "video": false,
      "title": "Bossa Nova",
      "recommendations": [
         84743,
         54378,
         253259,
         78229,
         40546,
         68247,
         39295,
         25848,
         45608,
         187922,
         43752,
         23148,
         45695,
         82968,
         22911,
         38772,
         14587,
         39519,
         44399,
         45817
      ],
      "backdrop_path": "/7M7N5jjr2AXQ4kyQttJdxEzepdM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary Ann Simpson",
               "gender": 1,
               "credit_id": "52fe47e49251416c750a8d79",
               "name": "Amy Irving",
               "profile_path": "/4SMrIcyYmJecUzIsipIrO4vGXxQ.jpg",
               "id": 27563,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Pedro Paulo",
               "gender": 2,
               "credit_id": "52fe47e49251416c750a8d83",
               "name": "Antônio Fagundes",
               "profile_path": "/nmmiuS9o6C0tonLj5I4Pktsc0Rx.jpg",
               "id": 112107,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Acácio",
               "gender": 0,
               "credit_id": "52fe47e49251416c750a8d87",
               "name": "Alexandre Borges",
               "profile_path": "/tNIqXaSYHdWehzzoQWja2PQYmLC.jpg",
               "id": 115173,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tânia",
               "gender": 1,
               "credit_id": "52fe47e49251416c750a8d8b",
               "name": "Débora Bloch",
               "profile_path": "/2JRxGV6fgVcLQFaZ6C6vzdZFMxX.jpg",
               "id": 123256,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nadine",
               "gender": 0,
               "credit_id": "52fe47e49251416c750a8d8f",
               "name": "Drica Moraes",
               "profile_path": "/8gFK6IFhZ4PnbwVrcdutEYoUGeq.jpg",
               "id": 112180,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sharon",
               "gender": 1,
               "credit_id": "52fe47e49251416c750a8d93",
               "name": "Giovanna Antonelli",
               "profile_path": "/wsyYjEfpG6MDmXis95MlnbAt2Us.jpg",
               "id": 130044,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Wan-Kim-Lau",
               "gender": 0,
               "credit_id": "52fe47e49251416c750a8d97",
               "name": "Kazuo Matsui",
               "profile_path": null,
               "id": 1061326,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "recepcionista da escola de línguas",
               "gender": 0,
               "credit_id": "52fe47e49251416c750a8d9b",
               "name": "Kate Lyra",
               "profile_path": "/v0J6mDP2FEfueKnoKXCcYzylLJT.jpg",
               "id": 1095903,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47e49251416c750a8d7f",
            "name": "Bruno Barreto",
            "profile_path": "/sFrrQ77hqzBWW40js1VevZyr3fE.jpg",
            "id": 69719,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.287732,
      "production_countries": [
         {
            "iso_3166_1": "BR",
            "name": "Brazil"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 19600,
      "vote_count": 10,
      "budget": 0,
      "overview": "Bossa Nova is a romantic comedy that enfolds many love convergences and divergences, in today’s Rio de Janeiro. It’s in the city’s “useless landscape” that the lonely hearts of nine characters will cross destinies and they’ll discover new passions. The meeting place for these journeys is a charming English teacher, Mary Ann Simpson, former airline stewardess, who’s been living in Rio for two years, since she became a widow, and the newly separated Pedro Paulo. They approach each other without a hint that their lives will be linked by many characters and incidents.",
      "similar": [],
      "original_title": "Bossa Nova",
      "runtime": 95,
      "poster_path": "/szMWQdRLlR9CtuBGyE5Ec7YpETO.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2000-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruno Barreto"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Alexandre Machado",
         "Sérgio Sant'Anna"
      ],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt0180837/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwODA2NDc3MV5BMl5BanBnXkFtZTcwMTE3NjUyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Amy Irving, Antônio Fagundes, Alexandre Borges | See full cast and crew »"],
      "reviews": [
         "I've had this video in my armoire for many months and finally got around to watching it last night. What a complete delight it was! Quirky, interesting, sweet-natured. As a middle-aged single I particularly enjoyed the romantic plot strand involving two people of my vintage. Amy Irving is incandescent as always. This movie has a wonderfully European (okay, Brazilian) feel and sensibility. Not the usual canned Hollywood fare.",
         "\"Bossa Nova\" is a fun and light hearted film about the romantic involvements of an ensemble of diverse but interconnected characters including one relationship hatched over the Internet. This charming little film features plenty of samabas, postcard panoramas of the Copacabana, and a 90 minute story which moves along quickly and will leave a smile on your face.",
         "Let's be honest. Bossa Nova is not a heavy weight film. Nor does it pretend to be. That's its core charm. A bit frothy, yes, but leaves a sweet aftertaste that happily lingers for days. I hadn't seen Amy Irving (Mary Ann) in quite a while and was glad to see her in this film. Her timid interplay with Faguendes (Pedro Paul) was sweet and touching. I enjoyed watching their love story unfold. Faguendes is obviously a well-known, beloved actor in his home country. It's the first time I've seen his work and I can see why he's so popular. But there's plenty more to take note of. Watching Faguendes' family ties nearly unravel is almost heartbreaking at times. To see three generations is almost unheard of in today's movies. I was pleased to see it. The other subplots are equally fun. The soon-to-be exported Brazilian soccer player's quest to learn how to curse in English is hilarious. And watching the girl dream of her online \"boyfriend\" is something many of us can relate to. Not to mention the soulful longing of the young man (Pedro Paul's son)who wants her but isn't brave enough to state his case. All this plays out against an almost idyllic backdrop of sand dunes, towering mountains, charming cafes and crashing surf. Sure, it may not be the entire face of Rio but would you want to see the sewers in New York City? I doubt it. I've never been to Rio but this movie had me dreamily considering it. Jobim's music, by the way, is the perfect choice. Like sunlight on water...",
         "Most Brazilians complain that Brazilian movies only show the poverty and the arid landscapes of Northeast Brazil. I particularly think that we shouldn't conceal the sad reality of so many places in Brazil, and films like \"Central Station\" and \"City of God\" are brilliant in their own right. But we can't deny that there should be more Brazilian movies out there showing all the beauty from this country, and \"Bossa Nova\" is one of those rare movies. Director Bruno Barreto (\"Dona Flor and Her Two Husbands\") doesn't try to start a socio-political speech here. He cast his own wife Amy Irving as a charming American lady who teaches English in Rio, and falls in love with one of her students, a lawyer played by mature leading man Antonio Fagundes. Barreto's intention was to make a romantic comedy in Rio de Janeiro, dedicated to/inspired by Tom Jobim and François Truffaut. Not an art-house flick, not an Oscar movie. Just an enjoyable love story with great music and beautiful landscapes. And he succeeded. Far from being a masterpiece, \"Bossa Nova\" is a lovely film that should be seen by anyone who'd like to spend some pleasant 95 minutes, watching a not so popular (at least, not as it should be) side of this unique country. 7.5/10.",
         "Don't get me wrong - \"City of God\" is a cracking film. This film is for when you want a rest from the wave of ultra violent films that have streamed out of Brasil in the last few years. This is a lovely,light romantic comedy with elements of farce and fantasy. It was the directors intention to show a picture postcard version of Rio. And he succeeds wonderfully. This film probably resonates more with me than most because I met and married a Brazilian in Rio and we shared a first kiss in front of the Copacabana Palace Hotel (were you spying on us Mister Barreto?) And I would just like to point out that I am not middle-aged and still know how to have a good time so ignore all the comments saying this film is for the oldies - since when did romance have an age limit?!",
         "For the first time, people around the world will be able to see Brazil from a different point of view on the movies: no misery, no poverty, no masked thieves... And for the first time the movies are showing some of the Brazilian bright side. There is also some kind of magic the director got on the screen which made possible for us to notice the kind of relationship established between the American and the Brazilian people and culture. Besides, it is full of sense of humor and wonderful actors. It is really worth it... And I really left the movies very proud!",
         "Rio de Janeiro's wonderful scenery and beautiful music make this film worth watching, especially with your girlfriend/wife. Unfortunately, the plot's got some holes in it and the movie as a whole doesn't flow very smoothly. However there's plenty of good acting and funny moments. But if you're heart-broken, this is not the film for you.",
         "Warning: All cynics should avoid this movie like the plague!!! Full of contrivances and cliches, ridden with all the typical plot elements of any kind of ensemble romance piece, this film on the outset seems like nothing new. But there's just something about it I couldn't let go of-maybe it was the beautiful Rio de Janeiro backdrop that this film is set against. Maybe it's the opportunity to see Amy Irving once again in all her glory. I don't know which, but the lady should definitely be in more movies, especially in ones where her husband directs her and therefore gives her the best role and makes her the most sympathetic in the film. Irving stars as Mary Ann Simpson, an English teacher in Rio who teaches classes by night and private students by day. Across the hall from her classes is the shop of an elderly tailor, whose lawyer son Pedro Paulo (Antônio Fagundes) is helping his father get out of an alimony fix that involves a much younger wife. One night Pedro Paulo runs into our heroine on the elevator, and love at first sight is born. Right away he forgets about Tania, the ex-wife (Débora Bloch) he was having trouble letting go of, and goes after this mysterious new woman in his life. Along the sidelines there are plots that involve Irving's student Nadine (Drica Moraes) and her online romance with a SoHo artist `Gary', and another regarding the lawyer's intern Sharon (Giovana Antonelli) and her romance with both her boss' brother Roberto and the famous soccer player Acacio (Alexandre Borges), who also happens to be taking private English lessons from Mary Ann. All these lines cross and meet and even out in perfect form, and yet somehow at its most typical the film manages to be at its most enjoyable, possibly because Barreto has such a good time entertaining his audience that one can't help but dive right in. Worth a good look.",
         "This film is a delightful romantic comedy and shows off the director's love for the city of Rio. A film that Brasilian Americans can be proud of instead of ashamed of like they were at the pathetic Anaconda from summer's past. I wish all NorteAmericanos could see this flick to experience the unique beauty of Rio. Yes, it's idealized and doesn't show the bad with the good, but this is true of many many movies. Gladiator made ancient Rome glamorous, which it was not. Rio, on the other hand, is a city filled with unique beauty, as anyone who has ever been to Sugarloaf or Corcavado can attest to. For those who may be curious, my imdb handle of M2b means married-2-Brasil and you can easily fugure out what that means. I loved this flick. See it and see it in wide screen, not video!",
         "I just recommended Bossa Nova to a friend. I have to agree with other user comments that there is not a deep plot, however this is a movie for all your senses. If you like Bossa Nova music, you won't be disappointed. One of my favorite albums of all time is Getz/ Gilberto. This movie satisfies the ears with Girl from Ipanema and Corcovado, both found on the Getz/Gilberto album. Other Bossa Nova favorites in this movie are Wave and One Note Samba. If you like the Portuguese language, again you won't be disappointed. I was very curious about Amy Irving and her ability to speak this foreign language. Was she dubbed or did she learn it? She sounded authentic. Bossa Nova is also a feast for the eyes. Much like Enchanted April is a virtual trip to Italy, this movie takes you to Brazil. If you have been waiting to go to Rio but won't be going any time soon, this is your chance to get a virtual Rio experience. This movie was for me about the atmosphere of the place, not the typical movie experience. Bossa Nova is definitely worth seeing from your couch or comfy chair!"
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Columbia Pictures Television",
         "Columbia TriStar Comercio Internacional (Madeira) Ltda.",
         "Filmes do Equador"
      ],
      "summaries": ["Rio lawyer Pedro Paulo is recently separated from his travel agent wife Tania. His office has taken on an energetic new intern, Sharon. Pedro Paulo is working on a divorce case - his own father's... Mary Ann is an English language teacher living in Rio. Her friend Nadine has been having an Internet romance with Gary, a SoHo artist. Nadine decides to visit Gary in New York; she books her flight through Tania... Soccer star Acacio is going to play for a team in England. He has been taking private lessons with Mary Ann. Is he reading too much into the word \"private\"? Pedro Paulo catches a glimpse of Mary Ann and decides he should study English again... Acacio needs some legal help with his new contract. He goes to Pedro Paulo's office, but the only one in is Sharon..."],
      "budget": 0
   },
   "movielensId": 3567,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Português",
         "Español"
      ],
      "releaseDate": "2000-01-01",
      "dvdReleaseDate": "2000-12-26",
      "directors": ["Bruno Barreto"],
      "runtime": 95,
      "movieId": 3567,
      "title": "Bossa Nova",
      "mpaa": "",
      "actors": [
         "Amy Irving",
         "Antônio Fagundes",
         "Alexandre Borges",
         "Débora Bloch",
         "Drica Moraes",
         "Giovanna Antonelli",
         "Kazuo Matsui",
         "Kate Lyra"
      ],
      "imdbMovieId": "0180837",
      "originalTitle": "Bossa Nova",
      "genres": [
         "Comedy",
         "Drama",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": ["ek30ynvcrIU"],
      "plotSummary": "Bossa Nova is a romantic comedy that enfolds many love convergences and divergences, in today’s Rio de Janeiro. It’s in the city’s “useless landscape” that the lonely hearts of nine characters will cross destinies and they’ll discover new passions. The meeting place for these journeys is a charming English teacher, Mary Ann Simpson, former airline stewardess, who’s been living in Rio for two years, since she became a widow, and the newly separated Pedro Paulo. They approach each other without a hint that their lives will be linked by many characters and incidents.",
      "tmdbMovieId": 19600,
      "avgRating": 3.44301,
      "releaseYear": "2000",
      "numRatings": 193,
      "posterPath": "/szMWQdRLlR9CtuBGyE5Ec7YpETO.jpg"
   }
}