{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "made for cable tv",
            "id": 8629
         },
         {
            "name": "gremlin",
            "id": 10005
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt0101550",
      "video": false,
      "title": "Cast a Deadly Spell",
      "recommendations": [
         85529,
         34151,
         1702,
         39999,
         35976,
         18979,
         70490,
         42470,
         39890,
         16231,
         46909,
         42597,
         2151,
         33175,
         31533,
         69928,
         53070,
         51260,
         16398,
         10542
      ],
      "backdrop_path": "/xi3NcFnEkt0KEgP64y5BtVDkmXM.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Matt Golden",
         "id": "51ec284119c295369c3a2aff",
         "content": "The year: 1948. Magic is everywhere, the hallmark of progress. Hardboiled gumshoe Philip Lovecraft is a PI for hire, but his latest case, a search for a missing book called “The Necronomicon,” leads him down darker alleys than he’s ever traversed before, filled with black magic and hideous creatures intent on doing him harm. Charged with protecting a virtuous dame, finding a magical tome, and unravelling a murderous mystery, Lovecraft will have only his wits, his fists, and a trusty pistol to come out alive. And in this world, coming out undead is a distinct possibility…\r\n\r\nSupernoirtural would be the perfect word for this film. Cast a Deadly Spell is a fascinating anomaly, a rare treat and a helluva fun ride. It was made for HBO in 1991, directed by Martin Campbell (GoldenEye, Casino Royale, The Mask of Zorro) and starring Fred Ward (as Lovecraft), Clancy Brown, David Warner, and Julianne Moore as Lovecraft’s ex-lover and current gun moll, Connie Stone. And since it’s inexplicably never been released on DVD, it’s never seen the audience that it deserves. This is a pitch-perfect blend of film noir, droll comedy, and Lovecraftian horror. The script (by Joseph Dougherty) is smart, funny without being silly, and filled with perfectly-placed nods to H.P. Lovecraft’s oeuvre.\r\n\r\nFred Ward is fantastic as the gruff, acerbic detective, turning in one of the best modern-day performances of a noir PI. He has great fun with the über-noir dialogue. Case in point:\r\n\r\n> Hackshaw: You don’t believe in magic?\r\n> Lovecraft: I believe it, just don’t use it.\r\n> Hackshaw: Why?\r\n> Lovecraft: Personal reasons.\r\n> Hackshaw: And they are?\r\n> Lovecraft: Personal.\r\n\r\nor\r\n\r\n> Olivia: That’s quite a tie.\r\n> Lovecraft: Oh, thanks.\r\n> Olivia: Did it put up much of a fight?\r\n> Lovecraft: No, I snuck up behind it.\r\n\r\nClancy Brown makes a magnificent gangster heavy, Julianne Moore would fit perfectly alongside Barbara Stanwyck as a classic noir dame, and David Warner is in prime form. Director Campbell fully embraces the tale’s pulpy roots and directs with the most stylish flair I’ve seen out of him; it’s almost as though he filmed it in the style of the old Roger Corman shlock films, with exaggerated shots and colors cranked up to 11. The performances ground the film and the direction gives it more class than its origins as a cheap made-for-cable movie should warrant. It’s a heady, exuberant pairing.\r\n\r\nWith the talent both behind and in front of the camera for this made-for-TV flick, it’s incredible that it’s never seen a DVD release. It managed an ugly VHS transfer (and, thanks to the internet, a rather cruddy but serviceable copy can be downloaded) but it’s high time for HBO to release this gem on home video. Two-fisted, brawny action, horror-tinged, a tad campy (in all the right ways)…this is a magnificently fun film that needs to seen. Highest recommendation.",
         "url": "https://www.themoviedb.org/review/51ec284119c295369c3a2aff"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Det. Harry Philip Lovecraft",
               "gender": 2,
               "credit_id": "52fe483bc3a36847f815d5bf",
               "name": "Fred Ward",
               "profile_path": "/ybRDXraWsQ6zyqPUIAWITwuOWug.jpg",
               "id": 10430,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Amos Hackshaw",
               "gender": 2,
               "credit_id": "52fe483bc3a36847f815d5c3",
               "name": "David Warner",
               "profile_path": "/wgp2AlWKveLBOcs8YNuLeZiLsGL.jpg",
               "id": 2076,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Connie Stone",
               "gender": 1,
               "credit_id": "52fe483bc3a36847f815d5c7",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Harry Bordon",
               "gender": 2,
               "credit_id": "52fe483bc3a36847f815d5cb",
               "name": "Clancy Brown",
               "profile_path": "/xBVifBW0riMSbedEQ27hObjPqVw.jpg",
               "id": 6574,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Larry Willis / Lilly Sirwar",
               "gender": 2,
               "credit_id": "5323fdfa9251411708000193",
               "name": "Lee Tergesen",
               "profile_path": "/eb2fKDGpVLYJGGuC4SUHRpezP8U.jpg",
               "id": 6906,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Olivia Hackshaw",
               "gender": 1,
               "credit_id": "59a9d8b49251414474001fc8",
               "name": "Alexandra Powers",
               "profile_path": "/bcZFHTddjsAR73j0rlRetktvEIE.jpg",
               "id": 131183,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Det. Morris Bradbury",
               "gender": 2,
               "credit_id": "59a9d8d9925141403b002331",
               "name": "Charles Hallahan",
               "profile_path": "/bXRE5dfHZZhovEbXgQCXDTw9ZHY.jpg",
               "id": 15414,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Hypolite Kropotkin",
               "gender": 1,
               "credit_id": "59a9d92092514145ca002045",
               "name": "Arnetia Walker",
               "profile_path": null,
               "id": 122936,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Tugwell",
               "gender": 2,
               "credit_id": "59a9d94692514147b7001ec4",
               "name": "Raymond O'Connor",
               "profile_path": "/bIC6drKtKjr4F2GXQwbBgJGh8y9.jpg",
               "id": 84606,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Det. Otto Grimaldi",
               "gender": 2,
               "credit_id": "59a9d970925141403b0023e2",
               "name": "Peter Allas",
               "profile_path": null,
               "id": 152939,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Amber Peru",
               "gender": 0,
               "credit_id": "59e0a91592514124c50bb326",
               "name": "Becky Mullen",
               "profile_path": "/sDfrMxwAJNYTaBGvZqd31DPtS4E.jpg",
               "id": 217449,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Owl Wagon Manager",
               "gender": 2,
               "credit_id": "59e0a8fec3a36862000be517",
               "name": "Ritch Brinkley",
               "profile_path": null,
               "id": 22134,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Own Wagon Cook",
               "gender": 2,
               "credit_id": "59e0a925c3a368623e0b6eae",
               "name": "George P. Wilbur",
               "profile_path": "/dwxRPdqNgdhJqLyp7e80rr899pz.jpg",
               "id": 69129,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe483bc3a36847f815d5d1",
               "name": "Martin Campbell",
               "profile_path": "/qhx0AySf8yH3kiHrinWknUJbr1y.jpg",
               "id": 10702,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe483bc3a36847f815d5d7",
               "name": "Joseph Dougherty",
               "profile_path": null,
               "id": 31539,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe483bc3a36847f815d5dd",
               "name": "Curt Sobel",
               "profile_path": null,
               "id": 63906,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe483bc3a36847f815d5e9",
               "name": "Dan Rae",
               "profile_path": null,
               "id": 1004599,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe483bc3a36847f815d5ef",
               "name": "Pam Dixon",
               "profile_path": null,
               "id": 18457,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5693e343c3a368251c00004d",
               "name": "Alexander Gruszynski",
               "profile_path": null,
               "id": 33651,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5883fec3c3a36806500127c0",
               "name": "Gale Anne Hurd",
               "profile_path": "/oRWGpXdIm2lu870aaKpgO3wy19n.jpg",
               "id": 869,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.674518,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 52660,
      "vote_count": 19,
      "budget": 0,
      "overview": "In a fantastical 1940s where magic is used by everyone, a hard-boiled detective investigates the theft of a mystical tome.",
      "similar": [
         769,
         186,
         2252,
         245891,
         241554,
         10651,
         8012,
         64689,
         9366,
         7516,
         8961,
         101,
         281,
         1422,
         23483,
         154400,
         169917,
         156022,
         193893,
         261023
      ],
      "original_title": "Cast a Deadly Spell",
      "runtime": 96,
      "poster_path": "/afJIJ9AXD2WyNmnzbiWLKZU0tQ9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pacific Western",
            "id": 1280,
            "origin_country": ""
         },
         {
            "logo_path": "/6in9uMqxXEHx5XgYgkeRBpZ4rPw.png",
            "name": "HBO Films",
            "id": 7429,
            "origin_country": "US"
         },
         {
            "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
            "name": "HBO",
            "id": 3268,
            "origin_country": "US"
         }
      ],
      "release_date": "1991-01-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Martin Campbell"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Joseph Dougherty"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101550/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4NjY2OTg0N15BMl5BanBnXkFtZTcwNzE4NjAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Fred Ward, David Warner, Julianne Moore | See full cast and crew »"],
      "reviews": [
         "I wonder why this isn't a movie that people know? After all, it is definitely unique and fun to watch, and how many films do you know that are a combination 1940s film noir and horror? Man, this is a real \"curiosity piece.\" It's Los Angeles and 1948 and everyone, except the hero (Fred Ward) is using magic, occult witchcraft-type stuff (which this reviewer hardly endorses). Ludicrous, yes, but fascinating and funny in parts. Too bad this isn't out on DVD because the colors and atmosphere just ooze 1940s. It's also simply great entertainment. Juliane Moore looks gorgeous and Ward is likable in the lead role. He has the authentic look of a private eye, and I like the idea that he has more morals than all the other characters in the movie combined. If any story can be called truly \"unique,\" this is one of them.",
         "Damn near close. The idea of a private eye going it alone in world where magic reigns supreme is probably the ultimate extension of film noir and the hero-as-outsider. This movie captures all the charm of the Bogart 40's detective flicks and 80's type supernatural/horror F/X. It also adroitly mixes humor, horror, hard-boiled detecting, and mystery, with great performances from Fred Ward, David Warner, Clancy Brown, Alexandra Powers, Raymond O'Connor, and Julianne Moore.",
         "The other reviewers are right!\"Cast a Deadly Spell\" is great!I usually don't watch made for television horror movies,because I think they are all crap.This one beats every other TV-horror I have seen.The story is very intriguing,the acting is excellent(Fred Ward steals the show as a detective Howard Phillip Lovecraft,who tries to find Necronomicon!)and there are some cool monsters featured here.Check out this very humorous and vital mix of horror,noir and comedy.Great fun!",
         "This movie was excellent! The combination of old gangster, comedy, and horror was a great idea. The acting was excellent (Fred Ward rocks, as usual), and for an 80s film, it was really good (I'm not a big fan of the mall hair, brat pack, and Modonna crap that was hashed out in the big 80s). This film, quite the opposite was very entertaining and an absolute MUST HAVE for HPL fans. The entire movie was Lovecraft inspired and not a murder of his writings, like most of them are. Most definitely, check it out. You won't regret it. it's a great tongue-in-cheeck, campy horror schlock that is actually well done. If you like it, there's a sequel called \"With Hunt\" with Dennis Hopper as the lead. Not as good, but still entertaining. This film rates 7 tentacles and a star shaped protrusion all the way up, on the elder god-o-meter",
         "Wonderfully written and acted movie of an alternate 1948 Los Angeles where ALMOST everyone uses magic. Picture if you will, our founding fathers being sorcerers and alchemists rather than scientists and engineers! Fred Ward, Clancy Brown and the rest have (pardon the pun) made magic with this movie. David Warner shows his range as Mr. Hackshaw and Ms. Moore is just plain sultry. Of particular interest for the Lovecraft fans, trying to catch all of the covert and overt references to the realm that H.P. created before passing away well before his time. Definitely worth your time and effort to find this gem. Movies this fun is difficult to find.",
         "This is such a fun movie, everyone I've shown it to has tried to swipe my rather beat up copy... If you're a fan of hardboiled detectives, the works of H.P. Lovecraft, horror mixed with comedy, Fred Ward, or watching movies in slow motion to find all sorts of cool stuff going on in the background, then this film is for you... Sadly, you CAN NOT PURCHASE this film, unless you find it used. HBO only released it to video rental stores, even though it's lesser sequel is available just about anywhere. To make matters worse, all tapes come with a Macrovision copy block. Bummer... So, if you can find it, grab it quick, before someone else does!",
         "Excellent blend of classic noir picture and supernatural tale. Story is interesting. It starts out as a Maltease Falcon kind of film, but it is clearly not the same 1940's Los Angeles that has been seen in many noir films before. Thats because everyone, except the main character) use magic. LA is awash with wizards, unicorns, zombies, and still the private investigator. The makeup and effects are wonderful. Actors are good, especially Ward and Moore.",
         "It is rare to find a film that can actually be funny and still mount very real tension (Ghostbusters and Galaxy Quest are two examples that have succeeded). This film does so in very good noir-ish style. Rife with inside jokes that should appeal to any fan of the hard-boiled detectives, horror movies, Lovecraft and film noir. Fred Ward and David Warner are perfectly suited in this film.",
         "Totally fun idea: H.P. \"Phil\" Lovecraft is a gumshoe and seemingly the only guy in post-war L.A. who doesn't use witchcraft. One of HBO's best comedy films. I love the lady who plays Lovecraft's landlady. \"The omens are bad. Me, I'm going to Florida!\"",
         "I first saw this when it premiered on HBO in '91. With a Who's Who cast of character-actors, this first-rate production by Gale Anne Hurd (of James Cameron/Terminator fame) and directed by Martin Campbell (soon to direct Goldeneye and Mask of Zorro)is a brilliant mesh tribute to the works of HP Lovecraft. With a firm tongue-in-cheek, the viewer is taken along on the latest case of H. Phil Lovecraft, private detective in a 1948 Los Angeles where \"everybody does magic\". A relatively new happening, magic is real...everyone uses it, except Lovecraft. Fred Ward turns in one of his best performances to date as the hard-boiled detective, wise-cracking his way through every situation. Julianne Moore is spot-on as Phil's ex-girl, the sultry songbird in his former partner(Clancy Brown)'s club. David Warner is perfect as Lovecraft's effete client, Amos Hackshaw. It's a sharply-written noir tale with more than a few Cthulhu references, and adds some more generalized fantasy for spice. Pay attention to the details, this is where the picture really shines- from the everyday applications of magic, to the snappy banter between Lovecraft and pretty-much everyone, it's an enjoyable escape from reality-TV. The creatures are passable, not the best by today's CGI standards, but certainly not the worst seen in some straight-to-video bombs. The writing is stylish and inventive, with some really ingenious scenes/situations. Martin Cambell's direction takes you right along with Lovecraft, with some brilliant cinematography. The casting is terrific as well. I was never bored. One of my top-20 favorite films. I can't wait for a DVD version, if it ever appears. A terribly disappointing, not-so-great sequel called \"Witch Hunt\" was done in '94 with a completely different cast & director."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror",
         "Mystery"
      ],
      "productionCompanies": [
         "Home Box Office (HBO)",
         "Pacific Western"
      ],
      "summaries": [
         "In 1948 Los Angeles, everyone uses magic- everyone except hard-boiled private detective H. Phillip Lovecraft, who refuses for \"personal reasons.\" Lovecraft is hired by a mysterious rich man to recover a stolen book, the Necronomicon. Investigating, he finds that the book holds the key to taking over the world by magical means, releasing the \"Old Ones\". (Contains several in-jokes to H.P. Lovecraft's horror fiction and also the hard-boiled detective genre.)",
         "\"The year is 1948... Everybody uses magic.\" In Los Angeles, 1948, magic is used for everything, from cocktails that mix and pour themselves, to zombie butlers, to murder. This makes things tough for Detective Philip Lovecraft. He's a private eye, and the only man left in town who doesn't use magic. It is because of this that the richest man in LA, Amos Hackshaw hires Lovecraft to recover the stolen Necronomicon, a book of immense evil, containing incantations powerful enough to revive the sleeping Outer Gods. To make matters worse, the threadbare detective isn't the only one searching for the book. He's up against a ruthless gangster... who just happens to be Lovecraft's ex-partner. Throw in a witchy landlady, a hot singer, a cross dressing thief, and a jalopy full of gremlins, and Harry's up to his necktie in trouble. He'd better act quickly though, because the full moon is on the rise, the zombies are on the prowl, and someone is about to cast a deadly spell.",
         "In a fantastical 40's where magic is used by everyone, a hard-boiled detective investigates the theft of a mystical tome."
      ],
      "budget": 6000000
   },
   "movielensId": 35721,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-01-01",
      "dvdReleaseDate": null,
      "directors": ["Martin Campbell"],
      "runtime": 96,
      "movieId": 35721,
      "title": "Cast a Deadly Spell",
      "mpaa": "R",
      "actors": [
         "Fred Ward",
         "David Warner",
         "Julianne Moore",
         "Clancy Brown",
         "Lee Tergesen",
         "Alexandra Powers",
         "Charles Hallahan",
         "Arnetia Walker",
         "Raymond O'Connor",
         "Peter Allas",
         "Becky Mullen",
         "Ritch Brinkley",
         "George P. Wilbur"
      ],
      "imdbMovieId": "0101550",
      "originalTitle": "Cast a Deadly Spell",
      "genres": [
         "Comedy",
         "Mystery",
         "TV Movie",
         "Horror",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["ka-1ekOcRcQ"],
      "plotSummary": "In a fantastical 1940s where magic is used by everyone, a hard-boiled detective investigates the theft of a mystical tome.",
      "tmdbMovieId": 52660,
      "avgRating": 2.85714,
      "releaseYear": "1991",
      "numRatings": 14,
      "posterPath": "/afJIJ9AXD2WyNmnzbiWLKZU0tQ9.jpg"
   }
}