{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0207998",
      "video": false,
      "title": "Better Living Through Circuitry",
      "recommendations": [],
      "backdrop_path": "/a8Lch5TqbqyFrPpbK8JErWoAgAI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe472ac3a36847f8126c3f",
            "name": "Jon Reiss",
            "profile_path": "/8jQO2ydMvPH1kGOhV88hvlQnhqd.jpg",
            "id": 78391,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.07679,
      "production_countries": [],
      "id": 47295,
      "vote_count": 2,
      "budget": 0,
      "overview": "A documentary about the Electronic Dance movement of the 90's. It is the first such full-length film on the topic. It was produced by Cleopatra Pictures and Entertainment Group, presided by Cleopatra Records founder Brian Perera. The film features interviews with BT, The Crystal Method, Electric Skychurch, Genesis P-Orridge, Frankie Bones, DJ Spooky, Roni Size, and DJ Keoki.",
      "similar": [],
      "original_title": "Better Living Through Circuitry",
      "runtime": 85,
      "poster_path": "/2ZAZY7w0TNFTwni9BUfGsw5O7ON.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-01-01",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "A Digital Odyssey into Electronic Dance Culture",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jon Reiss"],
      "runtime": 85,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0207998/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxODY2OTcxNV5BMl5BanBnXkFtZTcwNDY5ODIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Moby, Lord T. Byron, McGuinnes | See full cast and crew »"],
      "reviews": [
         "It's a fun, comprehensive look at rave culture. The director completely gets the subject matter. Great interviews with everyone from the top DJ's in the scene, to the graphic designers who create the fliers, to the ravers themselves. If you rave or if you want to understand what it's all about, this is the movie to watch.",
         "I loved this movie. The music was pumping in all of the right places, and the images just ruled. The rave scenes worked magic, and the documentary was interesting. I think that people who are not into the whole rave scene will enjoy watching the film because of its emphasis for fun. Unless you don't like fun. It even takes the point that not all ravers are druggies (unlike Groove). It is just an intelligent movie that should be seen with those 20/20 specials, and news specials just to get a happy medium. I recommend this movie to everybody. 10/10",
         "This is a great movie to watch. I had fun watching it, and respected the movie for everything. A great counterpiece to 20/20's specials. The movie had the visuals, and the interviews. It just felt awesome. It was a documentry, so it had lots of interesting interviews. If you have even the slightest knowledge of a rave, see this movie, and I dare you not to get sucked in to the music and the lights. A must see. My only problem was that it did not have that much about visual effects. It lightly touched on them, and they are a good part of the scene. 9/10",
         "Finally I was able to watch a documentary that expressed exactly what I felt about the scene. This little number is a must see if you are or are not a raver. I agree with the earlier poster who says that \"Better Living..\" shows these parties and music professionals in a positive light. That's something that has been virtually ignored in todays \"news\" reporting of rave parties.",
         "Social trends are often shaped by strange overlaps in market forces. You have to have a steady stream of \"artists\" who are compelled to do their thing, driven primarily by an urge to express. We have that in this music, because the barriers to entry are exceedingly low, so any untrained fellow with an ear can start and perhaps adapt to be successful in his or her own mind. You need a steady stream of consumers, in this case young people needy of the rage, of the hypnosis of shared energy. We are told that it is a \"safe\" place to do drugs, or alternatively that it is a worthy substitute for drugs. We are told that it is a place to go to be alone, and alternatively to be one with the crowd. On screen speakers tell us that the art is special while others tell us that the magic comes from being merely primitive and artless. Clearly, there is a match here between creators and consumers that works; anything that cannot be well characterized and is has power. Those two elements are well enough represented here. The structure of the film is a mess, but that is well enough given the fact that we don't want to know what is going on, and none of the people we see are sufficiently articulated to reach us as artists of insight. But there is a third element that this film misses, though its existence relies on it. There is a commerce; there is money that changes hands. There are guys that are not artists that somehow act as brokers to connect communities. They make all the money. Judge for yourself whether such a thing as a selforganizing underground can fit this mold. Regardless, that is the myth that is sold, and the business of this phenomenon is every bit as interesting as the phenomenon itself. And probably would tell us more about what it is. This film does not see itself. Ted's Evaluation -- 2 of 3: Has some interesting elements.",
         "First and foremost, this is an extremely entertaining documentary. Jon Reiss has taken a subject that lies in the background of mainstream society and exploits it for just about any viewer. The real strength of the film rests in the notion that you don't have to be interested in the subject matter to gain something from watching it. This happens to be a major problem with several documentaries, however, with Better Living, you really walk away with a strong, unbiased sense of the rave scene. The visual aesthetics and style of filming really capture the energy and feel of the electronic dance culture and the interviews are interesting to watch. Other features about the rave subculture (i.e. Groove and Go), although entertaining, seem to focus more on the elements of drug use and exploitation whereas this film allows the viewer to see the many different sides that the culture has to offer. Yes, the film does have its flaws but you should judge those for yourself. Definitely worth a Netflix rent - check it out.",
         "One has to look at this piece for the insight and information that it presents. While the documentary ideology is slanted heavily toward the pro's rather then the con's, it does justice to the overall vision of what is being accomplished. I took in this film in a Cleveland institute and was really caught up in what the filmmaker was trying to capture. With live footage from the houses to set-up, the whole philsophy was interwoven within the work. Regardless of if you take altering substances or not, go for the DJ's or just to let go and be free, raves are as positive as they were presented. Staying true to form of 1960's culture documentaries (i.e. Woodstock, Haight Ashbury work), Circuitry shows that people can come together and understand each other through something as easy to understand as music. But this could just be an illusion due to the fact that we are not suppose to enjoy life and explore each other....B+ Grade",
         "This movie along with \"Modulations\" is a very educated, and insightful look into Rave culture across the globe. Interviews with influential DJ's from all over the world, and thoughts from actual ravers, the movie covers all the bases on just what Rave Culture is all about. If you're a raver, and want to know the roots, check it out.",
         "jon reiss spent a lot of time directing music videos, including some pretty cool ones (nin happiness is slavery. if you have the stomach, check it out, b/c nothing really served to establish a visual counterpont to the whole 'industrial' music boom of the 90s quite as well or as powerfully as this one) that he wouold have the insight to make a documentary about the world of electronic music makes sense. this film is fascinating as anything you'll ever see, and really has a finger on the pulse of the electronic music scene, its past, and a style that will probably provide the soundtrack for the future",
         "I really enjoyed this documentary. The tribal roots of dance and the community spirit of \"the rave\" were, at times, eloquently explained, leaving the viewer feeling that perhaps this manifestation of the music scene is where we should all be. The passion of the DJs and musicians shines through, and especially touching is the young blonde female who has obviously enjoyed her first rave, and who is amazed at all the strangers who wanted to hug her and say hello! Enjoy the spectacle, crank up the music, wonder at the weirdos dressed in baggy pants and funny hats, but most of all, just wish that you were there. If you liked this, you might also like to watch: It's All Gone A Bit Pete Tong; Human Traffic; Go (although this is a bit trite, and not nearly as positive)"
      ],
      "genres": [
         "Documentary",
         "Music",
         "Drama"
      ],
      "productionCompanies": ["Cleopatra Pictures"],
      "summaries": ["This DVD is a documentary film about the history of the U. S. rave scene which includes a fantastic soundtrack! Both t he film and soundtrack capture the people and the music tha t shaped the underground sub-culture around electronic musi c in America. Featured soundtrack artists include: Moby, Ke oki, The Crystal Method, DJ Spooky, Roni Size, Psychic TV a nd a host of others!"],
      "budget": 0
   },
   "movielensId": 3625,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": "2000-11-21",
      "directors": ["Jon Reiss"],
      "runtime": 85,
      "movieId": 3625,
      "title": "Better Living Through Circuitry",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0207998",
      "originalTitle": "Better Living Through Circuitry",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["XUfOi0c5czM"],
      "plotSummary": "A documentary about the Electronic Dance movement of the 90's. It is the first such full-length film on the topic. It was produced by Cleopatra Pictures and Entertainment Group, presided by Cleopatra Records founder Brian Perera. The film features interviews with BT, The Crystal Method, Electric Skychurch, Genesis P-Orridge, Frankie Bones, DJ Spooky, Roni Size, and DJ Keoki.",
      "tmdbMovieId": 47295,
      "avgRating": 3.41216,
      "releaseYear": "1999",
      "numRatings": 74,
      "posterPath": "/2ZAZY7w0TNFTwni9BUfGsw5O7ON.jpg"
   }
}