{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0429177",
      "video": false,
      "title": "The Thing About My Folks",
      "recommendations": [
         13164,
         42176,
         54602,
         50812,
         31083,
         28028
      ],
      "backdrop_path": "/qdVZTiSbyBSLIZbMhTIeaCy79Qr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sam Kleinman",
               "gender": 2,
               "credit_id": "52fe4473c3a368484e023b5d",
               "name": "Peter Falk",
               "profile_path": "/mjgykviG6rY2WlF14aeDRsvVA6x.jpg",
               "id": 2314,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ben Kleinman",
               "gender": 2,
               "credit_id": "52fe4473c3a368484e023b61",
               "name": "Paul Reiser",
               "profile_path": "/fr53dQQrDGfETgbliCktwKqteRU.jpg",
               "id": 781,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Muriel Kleinman",
               "gender": 1,
               "credit_id": "52fe4473c3a368484e023b6b",
               "name": "Olympia Dukakis",
               "profile_path": "/8kYmUwC0SfnJKt39M5Xrr8Q0oIf.jpg",
               "id": 3019,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Rachel Kleinman",
               "gender": 1,
               "credit_id": "52fe4473c3a368484e023b6f",
               "name": "Elizabeth Perkins",
               "profile_path": "/bkdWnnrMADJcFpKAOitMjQH3uEQ.jpg",
               "id": 20,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lilly Kleinman",
               "gender": 0,
               "credit_id": "52fe4473c3a368484e023b73",
               "name": "Mackenzie Connolly",
               "profile_path": null,
               "id": 180391,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4473c3a368484e023b67",
            "name": "Raymond De Felitta",
            "profile_path": "/nM5EwzXwVGWgFL50c4Bj5rvvsFc.jpg",
            "id": 99496,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.552183,
      "production_countries": [],
      "id": 23703,
      "vote_count": 9,
      "budget": 0,
      "overview": "Ben's dad Sam shows up one night with a note from Ben's mother (Sam's wife of 46 years), that she has left. While Ben's wife and his three sisters try to find her, Ben takes Sam on a day trip to see a farmhouse that's for sale. The day trip turns into a road trip while dad and son explore their past, their relationship, and why Sam's wife might have left him. The road trip includes fishing, drinking, playing pool, sleeping under the stars, and frank discussion. Anger simmers close at hand, as do love and hope. Where Sam's wife is - and why she left - leads to the movie's resolution.",
      "similar": [],
      "original_title": "The Thing About My Folks",
      "runtime": 96,
      "poster_path": "/pV4IiDPZEFJdrFWsdW9DTzPeEvz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2005-01-01",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Raymond De Felitta"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Paul Reiser"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0429177/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MzY2Nzg1N15BMl5BanBnXkFtZTcwNTI2MTEzMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Reiser, Peter Falk, Olympia Dukakis | See full cast and crew »"],
      "reviews": [
         "\"The Thing About my Folks\" came in as a surprise. We had no idea about what to expect. The film directed by Raymond DeFelitta, and based on a screen play by one of its stars, Paul Reiser, proved to be a pleasant time at the movies. Although the film is predictable and we know what will be the outcome, this is a voyage of discovery where Ben gets to know his father, perhaps for the first time in his life, Ben sees his father for what he really is, and not the mythical figure he has in his mind. The film seems to be a vehicle for its star, Peter Falk, and he runs away with the movie, as it was expected. Mr. Falk, one of the most endearing actors working in movies in this era and in past years, is an actor of such stature, he must be reckoned with. As Sam Kleinman, the distant father to Ben, he is a man that clearly is misunderstood, not only by Ben, but it appears by the whole family and his wife of forty-seven years. When Muriel, the matriarch of the Kleinman clan, runs away, everyone goes into a panic because this woman, who has been the strong figure of the family, is vital to keep everyone together. Not knowing where she has gone, Sam shows up at Ben's house confused as he feels abandoned, suddenly, by the woman he married and has been faithful for all those years. Ben, the youngest son, takes his father on a trip to look for a house he wants to buy so he can get his own family out of Manhattan into the country. The trip provides the excuse for Ben to bond with his father in ways he never knew about because the old man had always projected an aloof figure to his younger son. Along the way, father and son realize how much they love one another and how misunderstood the old man has been by his children. The love of Sam for Muriel spans the many years they have known one another; they seem inseparable. Peter Falk is magnificent in the film. He makes an excellent Sam Kleinman, the man who suddenly realizes his life is about to change for the worst. Mr. Falk shines as the older man and there's never a false movement in his interpretation of the man whose whole world is crumbling under him. Not being a Paul Reiser fan, we must confess that as Ben Kleinman, he is right. Ben and his father discover how much in common they both have and their love for Muriel, the mother that has sacrificed her life in order to keep the family together. Olympia Dukakis is only seen at the end of the film. She makes a good contribution as the fleeing mother. Elizabeth Perkins plays Rachel with great style.. The film has a beautiful look thanks to the cinematography of Dan Gillham, and the excellent musical score by Steven Argila. Ultimately, the film shows a great team effort between its director, Mr. DeFelitta and Paul Reiser who wrote it for the screen. Although this film is clearly targeted for an older audience, it should please anyone.",
         "I saw the film at the Nashville Film Festival. It was beautifully done, from cinematography to the acting. It's the story of a father and son, and how they come to appreciate each other during a family crisis. Beautifully written with dialog that never rings false, the film showcases the acting talents of Paul Reiser and Peter Falk, among others in this outstanding cast. The film begins with the aging father (Peter Falk)is trying to figure out why his wife (Olympia Dukakis) has left him. The father presents himself, unannounced, on the doorstep of his son and daughter-in-law. The father and son take off the next day to look at some property and end up taking a classic road trip. They fish, play pool, watch a baseball game, get drunk, get involved in a barroom brawl, and dance with strange women. But more important, they each confront the unspoken tensions that can affect any family. It's the kind of film that touches the heart and makes one appreciate those who are closest to them.",
         "I also viewed this film at the Santa Barbara Film Festival. It was an excellent film about adult family relationships. Paul Reiser wrote the film and included some similarities to his family. It was funny, warm, poignant, and moving, as well as entertaining. A film like this would do very well with the word of mouth reviews. I would definitely tell my friends and family to see this film. Let's only hope they'll have the chance. I would rate this film as one of the best movies I've seen in a year. It contains no violence, action scenes, murders, sex, so evidently distributors question whether or not to pick it up. Believe me, there are people out there who would love to go see a movie like this that has redeeming value, instead of the many typical big box office blockbusters we are usually given.",
         "We just returned from a showing of \"The Thing About My Folks\" at the Santa Barbara Film Festival, and couldn't help pondering why this film does not have national distribution. Peter Falk's performance of the father was sheer genius. Paul Reiser's script was insightful and very tender. The cinematography was breathtaking:What could be more beautiful than autumn in upper New York State with the the changing of the leaves. (Especially as seen from the seat of a 1936 Ford). If this finally does get national distribution, I'm certain Peter Falk will be up for some kind of acting award. His depiction of the 'father who worked too hard' was brilliant. My husband and I laughed and cried. At a time when war rages abroad, it's such a relief to see a film with no car chases, explosions, and senseless gun battles. This was a lovely film. Good luck to the creators.",
         "I saw this film back at the 2005 Palm Springs International Festival and of the 14 films I saw there I would rank this #4. The 900+ theater was full and at the end it received a standing ovation. This was classic Peter Falk if you are a Falk fan and displayed a lot of chemistry between the Peter Falk and Paul Reiser characters. The film's title seemed to long and too odd sounding to me. I am surprised this didn't make it into general release. This was far better than the majority of junk that the major studios throw at you. Maybe too adult in that it was geared to the baby boomer and senior audience. A lot of people could relate to situations in this movie. This will probably enjoy a revival of sorts years from now when people look back at this film and consider it a kind of a gem. I would rate this 8.0 to 8.5 on a scale of 10 and definitely recommend it.",
         "We saw the film this evening (not my first choice) and I was very pleasantly surprised. Kudos to Paul Reiser; this is not a made for TV movie, nor is it going straight to rental. Peter Falk should get an Academy Award nomination for his wonderful performance. The scenery of upstate NY is also beautiful and fits the movie. The film covers several tracks-father- son, mother- dad, and husband- wife. The whole family relationship thing is covered. You'll laugh, you'll cry and you'll recommend it to your 40 plus friends. Not a date movie. Peter Falk needs more work; his talent has been under utilized. Bottom line, the \"Thing About My Folks\" is I loved it and so will you.",
         "So fortunate were we to see this fantastic film at the Palm Springs International Film festival. Upon entering the theater we were handed a small opinion card that would be used for our personal rating of the film. Looking at the card I turned to my wife and said, \"How many movies in your life do you think you can rate as superb? Only about 5 for me.\" But then watching the interaction between Peter Falk and Paul Reiser while viewing the spectacular scenery in the film's setting of New York state, I slowly starting bumping the movie up a category at a time. Certainly it was good but the totally natural repoire of the actors and an award winning performance by a man who will unfortunately probably be remembered for a raincoat wearing detective rather than this film, the movie jumped to the excellent level. By the end of the film there were few dry eyes in the house and my usually stoic and callous heart melted just like the Grinch's and I ended up giving this a superb. This picture is a must for anyone who has parents. No violence or nudity but some strong language.",
         "Peter Falk is a diverse and accomplished actor. The movie is well written and the acting seems like real life. For all lovers of Columbo this is a superior piece of work. Because it shows what a talent Peter Falk is. He doesn't play a detective he plays a retired carpet salesman. By the time the credits begin to role you already want to watch it again. The interesting part of the movie is that the message will apply to every person that watches it; the depth of its' pertinence will be the only thing that varies. It is a shame that the liberals in Hollywood only promote smut and skin because this is the type of movie that the people in the business should be proud of. This would be a great movie to turn into a live stage play.",
         "I was looking through the movie listings in my area on yahoo and seen a movie that had not been advertised. I looked closer and noticed that Peter Falk and Paul Reiser were in it. Having watched \"Mad about you\", once, I was not a fan of Paul Reiser. However, I am a big fan of Peter Falk. So the spouse and I took a chance. We were both swept into this story. The beautiful scenery, the heartfelt acting and the sense of family and moral values that are seldom seen in movies and the world today. Not that sappy emoted junk, but real life situations from real life-like people. I even have to say, Paul Reiser was excellent, although, I still won't watch \"Mad about you\". I don't know where this movie has gone. I heard it was put out in limited release. It should be shared with the world. It is one of the finest movies I have seen. M.",
         "Meh. This will not go down in history as a memorable movie. At least not for me it won't. The only thing memorable about it would be Peter Falk's less than masterful overdoing of the Jewish father schtick. And I generally have quite a soft spot for Peter Falk... The movie overall was OK, but just in the most general sense. The plot line started out interesting but fizzled badly in the end. No real strength to the whole story. Paul Reiser did not do his best work here either. I don't think any of the actors really meshed with each other. Instead of telling a story, they kept kind of acting \"at\" each other. There was a woodenness about the whole effect. Even the great Olympia Dukakis could not get into her character's groove. And you only saw her for about ten minutes at the very end. But it's the worst acting I've ever seen from her, ever. Which isn't saying much, I know, because she is otherwise a fabulous actress. Let's just say her acting in this probably embarrassed all her acting coaches. It was not good. Elisabeth Perkins was pretty, as usual, but completely lacked character or depth. The few witty lines she was given somehow just didn't make the cut either. They all fell kind of flat. You somehow knew they were meant to be funny, but just couldn't see the actual funny part for yourself. All in all, a pretty ho-hum little movie that I would never take the time to watch again."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Picturehouse",
         "Nuance Productions",
         "Outlaw Productions (I)"
      ],
      "summaries": ["Ben's dad Sam shows up one night with a note from Ben's mother (Sam's wife of 46 years), that she has left. While Ben's wife and his three sisters try to find her, Ben takes Sam on a day trip to see a farmhouse that's for sale. The day trip turns into a road trip while dad and son explore their past, their relationship, and why Sam's wife might have left him. The road trip includes fishing, drinking, playing pool, sleeping under the stars, and frank discussion. Anger simmers close at hand, as do love and hope. Where Sam's wife is - and why she left - leads to the movie's resolution."],
      "budget": 0
   },
   "movielensId": 36539,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-01-01",
      "dvdReleaseDate": "2006-02-14",
      "directors": ["Raymond De Felitta"],
      "runtime": 96,
      "movieId": 36539,
      "title": "The Thing About My Folks",
      "mpaa": "",
      "actors": [
         "Peter Falk",
         "Paul Reiser",
         "Olympia Dukakis",
         "Elizabeth Perkins",
         "Mackenzie Connolly"
      ],
      "imdbMovieId": "0429177",
      "originalTitle": "The Thing About My Folks",
      "genres": [
         "Family",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["wnFh6DJlabg"],
      "plotSummary": "Ben's dad Sam shows up one night with a note from Ben's mother (Sam's wife of 46 years), that she has left. While Ben's wife and his three sisters try to find her, Ben takes Sam on a day trip to see a farmhouse that's for sale. The day trip turns into a road trip while dad and son explore their past, their relationship, and why Sam's wife might have left him. The road trip includes fishing, drinking, playing pool, sleeping under the stars, and frank discussion. Anger simmers close at hand, as do love and hope. Where Sam's wife is - and why she left - leads to the movie's resolution.",
      "tmdbMovieId": 23703,
      "avgRating": 3.32075,
      "releaseYear": "2005",
      "numRatings": 53,
      "posterPath": "/pV4IiDPZEFJdrFWsdW9DTzPeEvz.jpg"
   }
}