{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "mischief",
            "id": 15075
         },
         {
            "name": "misadventure",
            "id": 161267
         }
      ],
      "imdb_id": "tt0089826",
      "video": false,
      "title": "Porky's 3: Revenge",
      "recommendations": [
         19698,
         10246,
         40252,
         33301,
         9409,
         12574,
         33374,
         27767,
         13704,
         482048,
         360697,
         50076,
         427395,
         12525,
         8491,
         10859,
         24925,
         11185,
         87710,
         27651
      ],
      "backdrop_path": "/h9dqdUNn82FWw3T4ksRWY7gZ9ex.jpg",
      "revenue": 20518905,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Pee Wee Morris",
               "gender": 0,
               "credit_id": "52fe4478c3a368484e025021",
               "name": "Dan Monahan",
               "profile_path": "/1dyNIvDWNmqYydrlstwT9tozc3a.jpg",
               "id": 64221,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tommy Turner",
               "gender": 2,
               "credit_id": "52fe4478c3a368484e025025",
               "name": "Wyatt Knight",
               "profile_path": "/dLr3dKF2RvMX9RaxcrPHYyOaqKZ.jpg",
               "id": 64223,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Meat Tuperello",
               "gender": 2,
               "credit_id": "52fe4478c3a368484e025029",
               "name": "Tony Ganios",
               "profile_path": "/zTpWUjo86uwTevyOblEozt3ae7I.jpg",
               "id": 3010,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe4478c3a368484e02502d",
               "name": "Mark Herrier",
               "profile_path": "/hZ1o465FgKXTp6OPgZVrt5ygVWx.jpg",
               "id": 64222,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Wendy Williams",
               "gender": 1,
               "credit_id": "52fe4478c3a368484e025031",
               "name": "Kaki Hunter",
               "profile_path": "/cTth4MZVSHE53k3gLIlaTbkvK30.jpg",
               "id": 86994,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Brian Schwartz",
               "gender": 2,
               "credit_id": "52fe4478c3a368484e025035",
               "name": "Scott Colomby",
               "profile_path": "/c0MjR5up8PL9QQeV7kiCCsgql8v.jpg",
               "id": 167367,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Beulah Balbricker",
               "gender": 1,
               "credit_id": "52fe4478c3a368484e025039",
               "name": "Nancy Parsons",
               "profile_path": "/pQUaImbKVF3TicftBdCpMSP29FM.jpg",
               "id": 91842,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mr. Dobish",
               "gender": 0,
               "credit_id": "52fe4478c3a368484e02503d",
               "name": "Fred Buch",
               "profile_path": "/1rpiFNTd0MCKVcb9lJnV7xUQIHA.jpg",
               "id": 564316,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mr. Carter",
               "gender": 2,
               "credit_id": "52fe4478c3a368484e025041",
               "name": "Eric Christmas",
               "profile_path": "/dCs1h8vhRjNNfmJeHuVgcVE6ZwI.jpg",
               "id": 4976,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Actor",
               "gender": 0,
               "credit_id": "5545bb40c3a3680ce8005cdc",
               "name": "Dan Hewitt Owens",
               "profile_path": "/urI989TWOf5REqeFwkU0mD8Lu8j.jpg",
               "id": 1320732,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mrs. Morris",
               "gender": 0,
               "credit_id": "59e10229c3a368365e001a1c",
               "name": "Ilse Earl",
               "profile_path": null,
               "id": 1476391,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Inga",
               "gender": 0,
               "credit_id": "59e10231c3a368364f001a3c",
               "name": "Kim Evenson",
               "profile_path": null,
               "id": 104430,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Ginger",
               "gender": 1,
               "credit_id": "59e11c14925141725d000b71",
               "name": "Nancy Valen",
               "profile_path": "/4Z8j3v767vS6R0PqqA2xMhPcZEr.jpg",
               "id": 105197,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Connie",
               "gender": 1,
               "credit_id": "59e11c24c3a3680e25000a9d",
               "name": "Heidi Helmer",
               "profile_path": null,
               "id": 114880,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Lana",
               "gender": 0,
               "credit_id": "59e11c309251417270000b5c",
               "name": "Donna Rosea",
               "profile_path": null,
               "id": 1039475,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4478c3a368484e025047",
               "name": "James Komack",
               "profile_path": null,
               "id": 16008,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4478c3a368484e02504d",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4478c3a368484e025053",
               "name": "Ziggy Steinberg",
               "profile_path": null,
               "id": 196449,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 5.98416,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 23919,
      "vote_count": 69,
      "budget": 9000000,
      "overview": "As graduation nears for the class of 1955 at Angel Beach High, the gang once again faces off against their old enemy, Porky, who wants them to throw the school's championship basketball game since he has bet on the opposing team.",
      "similar": [
         272693,
         449176,
         9880,
         10625,
         19840,
         81250,
         43923,
         308369,
         9276,
         57214,
         4951,
         9377,
         37735,
         52449,
         2108,
         8193,
         315635,
         277217,
         8363,
         13342
      ],
      "original_title": "Porky's Revenge",
      "runtime": 92,
      "poster_path": "/kK9a9VBIjmh7L2uJvR01RUfS4eT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Melvin Simon Productions",
            "id": 2124,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Astral Bellevue Pathé",
            "id": 10313,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "SLM Production Group",
            "id": 396,
            "origin_country": ""
         }
      ],
      "release_date": "1985-03-22",
      "vote_average": 4.9,
      "belongs_to_collection": {
         "backdrop_path": "/1Ra6Un73JwIjGHfEU0lM3397Q8z.jpg",
         "name": "Porky's Collection",
         "id": 109592,
         "poster_path": "/fGnfEA244AKrKgcN6uyvEFCgaR6.jpg"
      },
      "tagline": "The final conflict",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James Komack"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Bob Clark",
         "Ziggy Steinberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089826/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4NzkxMzE4MF5BMl5BanBnXkFtZTYwMzQ3OTI5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dan Monahan, Wyatt Knight, Tony Ganios | See full cast and crew »"],
      "reviews": [
         "Seeing as how Bob Clark didn't participate in this movie, it doesn't surprise me that the final movie in the Porky's trilogy lacked the energy that made the first two so funny. The events leading up to the revenge just seemed so unnecessary. Ultimately, this so-called revenge seemed more like another attempt to make Porky's life miserable. This was an inglorious way to end the series which (when it first started) was the first important teen movie of the 80s before we were subjected to the legacy of John Hughes and the Brat Pack.",
         "Porky's Revenge, is simply the best end to this trillogy hands down.! This is one smart way to finish the series, although ignoring the next day senario of Porky's 2. All the gang is back, just scheming away, with their usual tricks. With a chain of events that lead to the most outragously funny climaxs of cinema. Porkys and Porkys Revenge are the movie viewings, with stacks of goodies on a lame movie night, this will certainly provide some spark. 10/10: This and Porkys should become classics.",
         "Porky's Revenge (1985) *** (out of 4) The third and final film in the series finds the boys of Angel Beach High School having to deal with Porky once again when their basketball coach gets into some gambling trouble. Between dealing with Porky the boys find plenty of time for various sexual acts. Look, you're either a fan of the PORKY'S trilogy or you're not. I personally love the series and grew up watching these movies so they certainly are special to me no matter how silly they are. This third film in the series isn't nearly as good as the first but I thought it was a step up from the good, if flawed, second film. I think what works so well here is that it's just fun seeing the gang back and getting into more trouble. Again, if you're wanting comedy in the style of Charles Chaplin then you're not going to find it here but if you enjoy toilet humor, sex jokes and plenty of nudity then this here really delivers. I thought the story itself was mildly entertaining for a film like this but it was certainly a major plus having Porky back in action. After the events in the first film it's just obvious that he really would want some revenge so this adds another layer of fun. As with the first two, there are all sorts of dirty sex jokes and I thought the majority of them worked. This includes the foreign exchange student, a pool orgy and the highlight of the film a sequence inside a motel room. The performances are pretty much what you'd expect from a film like this but the entire cast fit their roles nicely and deliver a good job. There's no question that the film has some major flaws throughout but fans of the series should find this to be a good way to close things out.",
         "\"Porky's II: The Next Day\" was a weak and frustratingly tame movie that couldn't hold a candle to the wayward original; which I personally consider to be a classic in its own specific league. One of the \u0096 admittedly many \u0096 reasons of failure was the absence of the titular redneck character who was more or less profiled as the teen protagonists' arch enemy in the first film. Porky Wallace (glorious role of the late Chuck Mitchell) was a fat and sleazy night club owner from a neighboring county who humiliated and deceived the oversexed high school teenagers and prevented them from getting laid in his club. This led to fantastically comical and vulgar situations, but the first sequel skipped all this in favor of politically correct humor and ethically valuable morals. Well, just like the producers of \"Halloween\" found out after the disastrous third installment \u0085 every franchise also partly relies on a solid villainous character. The input of Porky's character in this third and final movie isn't exactly tremendous, but it definitely helps. The jokes and absurd situations are also a lot funnier again (albeit not nearly as funny as in the original) because they all revolve on raging hormones, bizarre sexual fetishes, embarrassing encounters and plain juvenile delinquency! Few weeks before graduating high school (about time, as they all appear to be in their mid-twenties\u0085), the cheerful posse has the chance of realizing their biggest dream: winning the state championship in basketball. They face a big \u0096 literally \u0096 obstacle when it turns out their beloved coach has unsettled debts with Porky, who now owns a luxurious casino boat. The only way out is for the team to lose the finale and have Porky cash in the betting money, but their mind is too strongly set on winning\u0085 This is good old-fashioned and textbook 80's comedy, meaning relaxing and utterly brainless. Ideal stuff to re-watch after all these years and revive the spirit of 80's trash.",
         "The final film of the Porky's trilogy is clearly the better of the two sequels. It ignores the next day plot of the second film and goes back to direct raunchiness that made the first film so successful. However, the story should have put them in a different setting such as college, since the actors portraying the high school seniors were well into the late 20's early 30's by the time the third film was made. Overall, it is good comedy compared to the other films that were made in the mid 80's ** out of ****",
         "That Porky; just when you count him out - here he comes with the whole Angel Beach High gang to strike one final blow against a series that degenerated so far down the tubes that even Bob Clark wouldn't have anything to do with it. Now, THAT is bad. \"Porky's Revenge\", directed as it is by James Komack (yes, THAT James Komack, from \"The Courtship of Eddie's Father\"), tries to ape the original as much as possible in looks but just doesn't get it right; the material never finds the right tone of raunchiness nor one single scene that has as many belly laughs as the original (if you've seen the first one, you know what I mean). And the \"kids\" in this one look just a hair shy on the ear lobe of collecting social security. Someone should have gotten a better makeup artist on the set, ya think? Jeez, guys; at least wear girdles or something! But then there's Porky himself. Ah yes, Chuck Mitchell returns and is just as mean, nasty and... well, PORKY, as we remember. And when his little girl Blossom (Wendy Feign) falls for good old Meat (Tony Gainos), it's time for Pee-Wee (Dan Monahan) and the rest of the crew to kick into high gear and save their buddy from a fate worse than death - marriage. Problem is, so much attention is paid to the plot (!!!) that there's no time for laughs, sight gags or even decent use of the foreign exchange student (Kim Evenson). What a disappointment; she even had a cute Swedish accent. All in all, a big let-down, even from part II in the series (which was no great shakes itself, but at least kept Clark at the helm). This is one \"Revenge\" that just beats out Montezuma's for general discomfort. Two stars. Hey, had to give them credit for the eventual fate of Miss Balbricker (Nancy Parsons). What do you know; those kids had a conscience after all.",
         "so the third installment of the porky's trilogy, should be the worst, but it's actually a big improvement on the second installment. the gang are back minus a couple of characters, but like i said in my review of the second movie, there were simply too many characters to write for, hence the movie not being as funny as the first. don't worry though, the movie is much funnier, and raunchier, and is much more in spirit with the original than the second one was. the set pieces are bigger, the laughs better, and even though it loses 2 of the characters from the first 2, it really doesn't matter, because it makes the movie funnier, porkys 3 is another must see movie, that delivers everything the second movie should of, i highly recommend this movie to fans of the original",
         "The last part of the epic \"Porky's\"-trilogy is undeniably the weakest, mainly because it feels so straight to video. The production often seems lazy and cheap, and the director didn't exactly work overtime ever. Basketball has never looked this lackluster. The screenwriter tries his best to copy the style of the original, but the way things are directed makes the raunch look nasty rather than funny. The scene with Tommy and Balbricker, presumably one of the most hilarious scenes in the movie, just kinda made me ashamed for watching this. Has it come to this, I wondered, as Balbricker attempted to pull down his underwear for minutes straight. The only redeeming factor left are the actors, that surprisingly still look like they want to be there. Pee Wee is always entertaining, even if he doesn't get to do much. It's still Pee Wee. I also appreciate that Porky is back for the occasion, even though his evil plan makes little sense. And why is he telling people about it? That's just asking to be stopped. Either way, this is not too bad for a second sequel, but it's just so clearly not by the original makers.",
         "i am a huge fan of the porky's movies, and this was not a let down. the greatest of the series will always be the first, but 2 & 3 are still really worth seeing. the movie is clever, funny and creative. the group devises new pranks and new consequences. somehow, the whole group manages to graduate...and go out with...style. but before all that, they manage to face expulsion, blackmail for athletic eligibility and save their coach by making a deal with their arch nemesis: porky. when they don't follow through with their agreement, they have to defeat porky once and for all or else ol' meat gonna have to marry little blossom!",
         "Like the REVENGE OF THE NERDS series, PORKY'S kind of lost its edge as other sequels emerged even though the characters remained likable enough(if too old)to spend 90 minutes with. I just felt as I was watching PORKY'S REVENGE that the laughs were few and far between although there were attempts to reestablish the raunch that appealed to audiences who loved the first film. I think it would've been more ideal to have this cast in college instead of in their senior year of high school as the stars simply look too old at this point to portray 18 year olds. That said there are some inspired moments here and there such as Pee Wee's flashing the parents attending the graduation ceremony on accident(he was tricked into getting nude underneath his robe by the gang)or when the boys have broken into the apartment of a hot biology teacher trying to find a test exam so that Meat(Tony Ganios)could cheat to pass so he could play in the State Basketball Championship, instead catching her in a bit of sexual rollplaying with another teacher. Nancy Parsons returns as Ms. Balbricker and the gang decide to find her lost love which is kind of a nice way to send her character off as she's often the butt of jokes(her hotel scene with Wyatt Knight's Tommy Turner is a laugh as both were expecting to meet other people, this arranged as a practical joke by the gang, although Pee Wee was the intended target for Balbricker). In this sequel, Porky(Chuck Mitchell)now operates an illegal casino on board a riverboat and has negotiated a deal with the boys regarding throwing the basketball championship so that their coach could be exonerated of the gambling debts he owes. Of course the boys plan to screw Porky and when fatso kidnaps Meat(he supposedly got Porky's ugly daughter pregnant after the two \"went all the way\")during prom night they will have to orchestrate a rescue. The result isn't kind to Porky's boat! Mitchell is as repugnant and bullying as ever, the perfect foil for our high school heroes who once again get the best of him. This film features \"the big game\" as Angel Beach's basketball team go on a tear when Meat suddenly \"passes the test\" and is allowed to toss around the opposition like rag dolls(the referees seemed to have gone on a lunch break, I guess). A constant gag that I didn't really find all that funny has the principal questioning when Billy(Mark Herrier)is gonna set up a period where they can watch a certain \"art film\"(it's pornography and Balbricker told on them to the principal). Kaki Hunter is Tommy's girlfriend, Wendy, but she's essentially \"one of the guys\" always hanging out with them. Surprising amount of nudity in this sequel; mostly boobs. While a far cry from the first film, which had me laughing out loud quite a bit, PORKY'S REVENGE does come from a great period in the 80s when filmmakers were willing to go anywhere to get a giggle or make the viewer blush."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Melvin Simon Productions",
         "Astral Bellevue Pathé",
         "SLM Production Group"
      ],
      "summaries": [
         "Meat, an Angel Beach high school student, picks up a shapely girl when she appears to have broken down by the side of the road; he is, however, shocked when her face doesn't match her figure. Not only that, she turns out to be the daughter of Porky, who has re-opened his nightclub in a Mississippi riverboat. Is this Porky's opportunity for revenge, or will the Angel Beach crowd outwit him once again?",
         "The Angel Beach boys are back, and crazier than ever. With the basketball championship around the corner, the boys are ready and willing, until one day Brian learns their gym coach owes money to their old enemy Porky Wallace. Fearing the old strip club is back in business, the team hurries out where Meat encounters a beautiful (ugly faced) girl who turns out to be Porky's daughter. Trying to help their couch the guys make a deal with Porky over the basketball championship. But when Porky's learns of his daughter's crush on Meat, he flips out and kidnaps Meat for an all true American Wedding. It's up to his friends to save him and ruin Porky for good.",
         "As graduation nears for the class of 1955 at Angel Beach High, the gang once again faces off against their old enemy, Porky, who wants them to throw the school's championship basketball game because he's betting on the opposing team."
      ],
      "budget": 9000000
   },
   "movielensId": 3690,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-03-22",
      "dvdReleaseDate": "2007-05-22",
      "directors": ["James Komack"],
      "runtime": 92,
      "movieId": 3690,
      "title": "Porky's 3: Revenge",
      "mpaa": "R",
      "actors": [
         "Dan Monahan",
         "Wyatt Knight",
         "Tony Ganios",
         "Mark Herrier",
         "Kaki Hunter",
         "Scott Colomby",
         "Nancy Parsons",
         "Fred Buch",
         "Eric Christmas",
         "Dan Hewitt Owens",
         "Ilse Earl",
         "Kim Evenson",
         "Nancy Valen",
         "Heidi Helmer",
         "Donna Rosea"
      ],
      "imdbMovieId": "0089826",
      "originalTitle": "Porky's Revenge",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["jqvhxCZkkRs"],
      "plotSummary": "As graduation nears for the class of 1955 at Angel Beach High, the gang once again faces off against their old enemy, Porky, who wants them to throw the school's championship basketball game since he has bet on the opposing team.",
      "tmdbMovieId": 23919,
      "avgRating": 2.07464,
      "releaseYear": "1985",
      "numRatings": 844,
      "posterPath": "/kK9a9VBIjmh7L2uJvR01RUfS4eT.jpg"
   }
}