{
   "tmdb": {
      "original_language": "da",
      "keywords": [
         {
            "name": "lover",
            "id": 4320
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "flashback sequence",
            "id": 9856
         }
      ],
      "imdb_id": "tt0058138",
      "video": false,
      "title": "Gertrud",
      "recommendations": [
         41391,
         48035,
         43878,
         26302,
         1405,
         97513,
         753,
         20530,
         20108,
         42112,
         97514,
         43118,
         126193,
         9797,
         110650,
         104378,
         42206,
         105577,
         43376,
         163230
      ],
      "backdrop_path": "/n96KWWvrDOGa3o9kMfu9dcmIKAd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Axel Nygen",
               "gender": 2,
               "credit_id": "52fe45599251416c9102f4d5",
               "name": "Axel Strøbye",
               "profile_path": "/6lEjPPLeb3eSqVIeyUPQ5V7Sy2S.jpg",
               "id": 72912,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Gertrud",
               "gender": 1,
               "credit_id": "52fe45599251416c9102f4d9",
               "name": "Nina Pens Rode",
               "profile_path": null,
               "id": 425893,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Gustav Kanning",
               "gender": 2,
               "credit_id": "52fe45599251416c9102f4dd",
               "name": "Bendt Rothe",
               "profile_path": "/9pj0Ax1X1OSyZ6ZM4RalXg6rZ3W.jpg",
               "id": 209398,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Gabriel Lidman",
               "gender": 2,
               "credit_id": "52fe45599251416c9102f4e1",
               "name": "Ebbe Rode",
               "profile_path": "/527ZX2VRPNKxWvhBLGvs13sDHOM.jpg",
               "id": 229176,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Erland Jansson",
               "gender": 2,
               "credit_id": "52fe45599251416c9102f4e5",
               "name": "Baard Owe",
               "profile_path": "/byCOJPBF6zcHJpkPaijpNxvmLwm.jpg",
               "id": 558254,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Kanning's mother",
               "gender": 0,
               "credit_id": "52fe45599251416c9102f4e9",
               "name": "Anna Malberg",
               "profile_path": null,
               "id": 1109198,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "54ece854c3a3686d66002905",
               "name": "Edouard Mielche",
               "profile_path": null,
               "id": 1096143,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 1,
               "credit_id": "54ece85e925141795f002520",
               "name": "Vera Gebuhr",
               "profile_path": null,
               "id": 202598,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "54ece86992514179740024aa",
               "name": "Karl Gustav Ahlefeldt",
               "profile_path": "/ulmyHw27jfUqUXLYbJ9g0GZ0jw.jpg",
               "id": 579200,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "54ece875925141795f00252c",
               "name": "William Knoblauch",
               "profile_path": null,
               "id": 1132669,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 2,
               "credit_id": "54ece87fc3a368402d000164",
               "name": "Lars Knutzon",
               "profile_path": "/egBCVi5HiBnpxpaAZ1QtHE49BxS.jpg",
               "id": 202582,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 0,
               "credit_id": "54ece88bc3a3686d580022f2",
               "name": "Valsø Holm",
               "profile_path": "/9a7c8cqOx6HG4NT10ZLTrbij1DB.jpg",
               "id": 579138,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 2,
               "credit_id": "54ece896c3a3686d6600290d",
               "name": "Carl Johan Hviid",
               "profile_path": null,
               "id": 579184,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45599251416c9102f4c5",
               "name": "Carl Theodor Dreyer",
               "profile_path": "/6QE1xx1ghtqLTZD06rvPaXypvy6.jpg",
               "id": 11572,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45599251416c9102f4cb",
               "name": "Hjalmar Söderberg",
               "profile_path": null,
               "id": 143368,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe45599251416c9102f4d1",
               "name": "Carl Theodor Dreyer",
               "profile_path": "/6QE1xx1ghtqLTZD06rvPaXypvy6.jpg",
               "id": 11572,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "599ee159c3a3685a3001309f",
               "name": "Knud Kristensen",
               "profile_path": null,
               "id": 1111128,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "599ee0da9251411037012c20",
               "name": "Jørgen Nielsen",
               "profile_path": null,
               "id": 1876048,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "599ee0eac3a36859ed011356",
               "name": "Jørgen Jersild",
               "profile_path": null,
               "id": 1876049,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "599ee0f89251411008011fc5",
               "name": "Arne Abrahamsen",
               "profile_path": null,
               "id": 1329402,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "599ee1069251411017011f60",
               "name": "Henning Bendtsen",
               "profile_path": null,
               "id": 56885,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "599ee1169251411071011f45",
               "name": "Edith Schlüssel",
               "profile_path": null,
               "id": 1017698,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "599ee1219251411037012c61",
               "name": "Kai Rasch",
               "profile_path": null,
               "id": 1169218,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "599ee12d925141100e012055",
               "name": "Berit Nykjær",
               "profile_path": null,
               "id": 1876050,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "599ee137925141100e012061",
               "name": "M.G. Rasmussen",
               "profile_path": null,
               "id": 1876051,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "599ee14b9251411056011fa6",
               "name": "Bodil Overbye",
               "profile_path": null,
               "id": 1876052,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.030359,
      "production_countries": [{
         "iso_3166_1": "DK",
         "name": "Denmark"
      }],
      "id": 34181,
      "vote_count": 41,
      "budget": 0,
      "overview": "Hopeless romantic Gertrud inhabits a turn-of-the-century milieu of artists and musicians, where she pursues an idealized notion of love that will always elude her. She abandons her distinguished husband and embraces an affair with a young concert pianist, who falls short of her desire for lasting affection. When an old lover returns to her life, fresh disappointments follow, and Gertrud must try to come to terms with reality.",
      "similar": [
         1024,
         24420,
         1259,
         276,
         332872,
         1643,
         13523,
         226,
         44564,
         10995,
         17612,
         4588,
         38,
         979,
         19913,
         28178,
         489,
         13,
         50546,
         86331
      ],
      "original_title": "Gertrud",
      "runtime": 119,
      "poster_path": "/jDS2ynVUcyUJzVg4ffzn9MFqVrD.jpg",
      "spoken_languages": [{
         "name": "Dansk",
         "iso_639_1": "da"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Palladium Film",
         "id": 9079,
         "origin_country": ""
      }],
      "release_date": "1964-12-19",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Carl Theodor Dreyer"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Hjalmar Söderberg",
         "Carl Theodor Dreyer"
      ],
      "originalLanguage": "Danish",
      "imdbLink": "http://www.imdb.com/title/tt0058138/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5ODI5MDY5NV5BMl5BanBnXkFtZTcwMTg4NzcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Nina Pens Rode, Bendt Rothe, Ebbe Rode | See full cast and crew »"],
      "reviews": [
         "If you were to just watch this film half-heartedly or with a mind busy thinking of other matters, it would certainly seem like a dry film about infidelity and falling out of love - the kind of stuff that's been done a thousand times before, a thousand times before this film was made, even. And why did Dreyer have to make it so static, you might ask. But if you choose to delve into the matters at hand, feel the film's tenuous but painful emotions, you'll realize that there haven't been many films with more going on beneath the surface than this one. In fact, I can't think of another film that suggests so many themes, especially one with this little physical action onscreen. Most of Gertrud consists of two people at a time sitting on couches and facing opposite directions - no character in this film can bring themselves to look at someone else. These people talk about their relationships, either what could have been, what should have been, or what might be in the future. Although Gertrud is ostensibly a heroine - with the title as it is, we're almost required to believe that she is correct in her thoughts and actions and identify with her - as the film progresses it becomes more and more obvious that she is as much or more of the problem as the men whom she tends to blame. Then we're forced to backtrack and remember what things were involved in discussions earlier in the film in order to interpret it as a whole - take Axel's speech about free will, for instance, and Gertrud's response to it. I have just seen this film once, and I am positive that subsequent viewings will reveal many more layers. For the longest time, Gertrud was unavailable in the US. Now that it is readily available on both VHS and DVD, it's about time that it was completely rediscovered by the serious film watching community. 10/10.",
         "You might be dismayed the first time you view Gertrud. Is this a masterpiece you might ask yourself? Nothing seems to happen. People sit and talk. Sometimes they get up and move about and then go and sit down again. When they do talk, it is not always facing one another. Gertrud herself often appears to be in a trance, staring towards another world, a beyond of perfection where no mortal man can exist or match up to her dreams. By the end of the film she seems to have become as bloodless and lifeless as a statue. Whiteness has overcome her and it is as lethal as the powder in the mill of Dreyer's Vampyr. This is a film that must be watched several times in order for all its qualities to be revealed. The characters movements are exactly choreographed. The decor is stripped down to its essentials. There is nothing in the frame that does not comment. It might appear on the surface to be a naturalistic film, but it is, in fact, as staged and controlled as any Fellini. Gertrud is about the martyrdom of a woman who seeks perfection in a flawed world. Its surface, is as still, and tranquil, as a lake in a park, but underneath, everything is turmoil and volcanic emotion",
         "Cinema Great Carl Dreyer's final film is said to be his masterpiece as well. The innovative b&w cinematography, featuring only a handful, drawn out scenes in confined spaces, makes use of mirrors, shadows and suggested action. The story begins ca. 1900, studying several characters in depth. Gertrud, the wife of a wealthy lawyer with political aspirations, feels unappreciated by her work-consumed husband. The viewer quickly learns that Gertrud is about to end what appeared to be years of boredom as the \"attache\" of a man who lives mainly for his secular accomplishments. Despite his protests and assurances that he couldn't live without her, she leaves to see a lover. Drawn to men of the arts, Gertrud herself was once a celebrated opera singer. A lengthy love affair with a man who later becomes a nationally honored poet, left the jilted author heart broken. Another man, a pioneer in the field of psychiatry, becomes Gertrud's friend and confidante, but never a lover. The story, via flashbacks, present action and time scan forward shows Gertrud's entire adult life. The final scene offers somewhat of an explanation for why this woman has seemingly denied herself any true happiness. The men who offered her everything, even with the greatest possible concessions on their part, were told not to bother. Gertrud's extreme sense of pride, as noticed by a young musical genius who sees her as a convenient fling, leaves no wavering of the determined mind. If this film appeared to be scandalous in 1964, how would society view this kind of real activity in the early 1900s? A strong sense of \"truth\", as a philosopher may call it, will always override any kind of compromise. \"Love is all\", the only words on Gertrud's head stone. There must be more to life than strict adherence to an ideology, especially at the high cost. A critically acclaimed film, \"Gertrud\" nonetheless lacks entertainment value due to its fatalistic story telling",
         "The Carl Dreyer's film, Gertrud, is the last masterpiece of the great director. The history treat of the woman in isolation. Adapted from a 1920s play by Hjalmar Soberberg, Gertrud plays out in long takes, with few close-ups and exterior scenes.The pace and rhythm of the actions and interactions are retarded to the point that many of the conversations take on an almost incantatory quality. A small gesture and sound effect at the very end of the coda epitomize the complexity of feeling that Dreyer creates about the worldly renunciations and imaginative substitutions in Gertrud. Though initial critical reaction to the film was largely unfavorable. The picture is deliberate and reflective but not boring. I recommend.",
         "Even by Dreyer's standards \"Gertrud\" displays a rigidity rare in cinema. When it first appeared critics hated it, (just as they hated \"The Searchers\" and \"Vertigo\"). Now, of course, all three films are considered masterpieces but while \"Vertigo\" and \"The Searchers\" were commercial films aimed at a mass audience, \"Gertrud\" was strictly art-house, the kind of film critics were expected to like. It was also Dreyer's last film and it was archetypal Dreyer but this was also the mid-sixties and movies had moved on. We had had a renaissance in France and Italy and Czechoslovakia and even in the UK while America's 'New Wave' was just about to strike. It was a time for young film-makers and Dreyer was an old man. \"Gertrud\" looked and felt like it could have been made 30 years earlier. Of course, hindsight is a great thing and today \"Gertrud\" seems more 'modern' than many of the fashionable 'flash-in-the-pan' movies that hit us in the sixties and which now seem like time-capsules from a by-gone age. \"Gertrud's\" almost somnambulist pace and Dreyer's insistence on long takes, keeping his actors mostly static while allowing his camera to move, however slowly and deliberately, instead now seems almost revolutionary at a time when movies were chiefly about movement and movement in a pell-mell style. While taken from a 1906 play the theme of the film also seems peculiarly modern for the mid-sixties. It's about a woman's liberation from the constraints that men would seek to put upon her, even if that freedom means the sacrifice of romantic love in favour of higher, more intellectual pursuits. At the beginning of the film Gertrud leaves her stuffed-shirt of a husband because he's not prepared to love her unconditionally and attaches herself to a younger man who showers with romantic affection. But his love, too, is a sham and Gertrud is just another of his many conquests, so Gertrud leaves both men, and the poet she truly loved but who put his work above her and has now returned to reclaim her, and settles instead for a solitary but more 'intellectually' satisfying existence. It is a cold movie, it moves at a snail's pace and it is a film of ideas almost devoid of emotion if not feeling, (there is so little happening on screen it often seems like it could just as easily have been done on the radio). The acting is either intensely wooden or deeply cerebral depending on your point of view and since the characters are really only paradigms it is very difficult to engage with any of them. But it is also an incredibly beautiful film, displaying all of Dreyer's visual mastery, (as a 'stylist' Dreyer has always seemed very under-valued), and it's a film that challenges our preconceptions of what a romantic melodrama should be. Even by European art-house standards this is a much more rigorous dissection of the relations between men and women than we are used to. It won't be to everyone's taste but stick with it and you will be richly rewarded with a difficult and a bold film that strives to be a serious work of art and more than succeeds in its aims.",
         "Dreyer's final film views as a testament to idealism, the desire to put love above everything else in life and the cruel reality which thwarts this. Gertrud is married to a wealthy lawyer, about to become a minister. However material wealth is all he can offer and spiritually she is starved. > With a theatrical set-piece style characterized by long takes, Dreyer creates an intense and involving atmosphere. Passions are seen as the formative experiences in life in a society stifled by convention. Gertrud prefers nothing to having second best, she refuses to compromise her ideals. She resigns herself to a single life but retains in her mind the vibrancy of her chain of lost loves. A moving portrait of a strong woman. Scandinavian sombreness has rarely been so devastatingly effective.",
         "I was completely shocked when I first saw this masterpiece, and I still get shocked every time I see it again. Dreyer's long and austere takes will not, of course, be liked by many, easy-goers, because he achieved by them to tell the unspeakable, he reached true Art. But to appreciate this means to have previously developed and refined one's taste, a tough effort which unfortunately not everybody is willing to make. And I say unfortunately because when eventually getting to understand Dreyer's idiom you'll find out that what it can tell you is much greater and soul-satisfying that anything you can get via other more readily-understandable ways.",
         "To be honest, I found the early parts of this film to be excruciatingly slow and I didn't make it through on my first attempt. Still, I persevered and I found it more rewarding the second time. The film is about an upper class woman named Gertrud who attempts to find satisfaction through her relationships with men. Unsurprisingly, this is not a very successful endeavor. I think it's useful to analyze this film based on the viewer's understanding of the titular character. In other words, whether the viewer sees Gertrud as a protagonist or an antagonist will affect the way the film is understood. Protagonist: Gertrud is a victim of the uncaring men around her, each of whom seeks to use her for his own gain. Her first romantic partner is the best of these men but even he ultimately looks at her as a distraction-without her he could enjoy great success. The second man Gertrud interacts with becomes her spouse. This man looks at her as a symbol of social standing-people of his station need pretty wives to be accepted. It is especially important for her to put up as good face as he is looking to make a transition from a career as a lawyer to one as a government official. He cares for her no more than he might a particularly nice wristwatch. The third man is her adulterous lover. This young musician looks at her as a fun sexual diversion to be enjoyed before he settles down with his current fiancée. These three romantic partners aren't the only men in Gertrud's life, however. Ironically, the only man who really seems to care about her is not interested in her romantically-he seeks to encourage her to undertake academic pursuits. Thus Gertrud is treated badly throughout her life because she is unwilling to conform to others views of her-she seeks to be an individual and this goal is only reached when she abandons her preconceived notions of romantic happiness to focus on other things. Antagonist: Gertrud is a petulant woman-child who ruins the lives of two good men through her insistence on being the center of attention. She takes up so much of their time that they are unable to do what they need to do to provide the comforts she requires. If they attempt to put other things before her she takes this as a rejection. This is unpalatable for her so she abandons the men who do this. After going through two men this way she seeks to ruin a third man by distracting him from a promising musical career and enticing him to run off with her. This man is wise to her tricks, however, and he only has a relationship with her on his own terms. His utter rejection of her is devastating. This interaction leaves her a shell of her former self and she retires to a life of academic solitude. While this film is thematically coherent and replete with visual symbolism, it ultimately fails to tell an engaging story or situate it's characters as anything more than broad archetypes. This is one of those films that I imagine must be dream come true for film scholars-it's undeniably fascinating from a formal standpoint. This doesn't mean much to casual viewers, however, so I would not recommend this for anyone who fits that category.",
         "Werner Erhard says, \"You don't have to go looking for love when it is where you are coming from\". For the chilly, statuesque wife in Carl Dreyer's last film Gertrud, love is not a living, breathing reality, but an ideal to be sought in its purest form. Reviled in its day for its being an artistic anachronism, Gertrud is now recognized for the complex masterpiece it truly is. With its long takes and static camera, it seems at odds with the French New Wave jump cuts and innovative techniques, yet it has much in common with those films of the 60s that depict the soulless fragmentation and alienation of modern life even though Gertrud takes place at the turn of the century. In Gertrud, love is something to strive for but is unattainable on Earth and each character (like perhaps Dreyer himself) is a figure living to one degree or another in loneliness. Shot with very few close-ups, the camera keeps us at a distance throughout, perhaps reminding us of the isolation of the human condition. Based on a 1906 play of the same name by Hjalmar Soderberg, Gertrud (Nina Pens Rode), a former professional singer, is an emotionally unfulfilled woman who finds something missing in the four primary relationships in her life. She is married to Gustav (Bendt Rothe), an ambitious politician, but sees him as being more interested in his career than in her. She is in love with a young concert pianist, Erland Jannson (Baard Owe), but is repelled by his consorting with other women and using her name to brag to others about his conquests. She feels that another suitor, poet Gabriel Lidman (Ebbe Rode), cares more about fulfilling his own desires than nurturing hers, and that psychologist Axel (Axel Strobye) is more interested in an intellectual liaison than a physical one. Although her emotional expression never becomes very intense, Gertrud tells Gustav that she is leaving him on the very day that he is supposed to receive a promotion to cabinet rank. Deeply hurt by her suggestion that he didn't show her enough love, he pleads with her not to leave him but his pleas are met with coldness. When she tells him that she is going to the opera that evening, he pursues her to the theater, only to discover that she did not tell him the truth about her whereabouts. In the drive to the opera, we are privy to Gustav's thoughts, the only time during the film that we are allowed entry into the character's mind. He is determined to win her back, only to discover later that she stayed at the home of Erland Jannson. In a subsequent meeting with Erland in the park, she asks him to go away with her so that they can live together by the sea but he rejects the idea, telling her that he has a relationship with Constance that he cannot break off. It is shortly thereafter that an old lover, poet Gabriel Lidman, reveals that he ran into Erland at a party, boasting of the fact that he had conquered the aloof Gertrud. Gabriel has returned to Denmark to receive an award and has his heart set on reviving his amorous relationship with Gertrud. However, in one of the film's most telling moments, shown in flashback, she recalls finding a note on Gabriel's desk that says \"A woman's love and a man's work are mortal enemies\". She uses that note to not only rebuff Gabriel but to reject all suitors and decide that she can never find happiness with a man. Refusing to compromise and stuck in the notion that spiritual fulfillment must include emotional pain, Gertrud at long last finds her destiny but only at the cost of emotional connection.",
         "When you first start watching it, the film feels like a bad SNL sketch where the host hasn't memorized his lines, constantly looking at cue cards. The actors here are often speaking unemotionally about incredibly emotional subjects -- sometimes appropriately (fearing the other person's reaction), sometimes inexplicably -- and tend to never be looking in each other's eyes at the same time. The film is set up with long, hypnotic takes as a staged play, with the actors sometimes moving into new positions just to appear more stage-like. At first, it takes you out of the story -- it seems like inept filmmaking, but because we know it's deliberate (it's not shoddily made, just different) I stuck with it. It takes a few to get into the style and familiarize ourselves with the bareness; it's not so much that it's boring as that it's largely silent. The characters exist both as mouthpieces for Carl Dreyer and as people in real situations. (Aside from Erland's naturalness and Gertrud's presence, you could say the acting is generally unpleasant.) They give lengthy speeches always, they pause, their movement and reactions are not authentic life behavior or \"normal\" film acting. Yet this film is one of the greatest examinations of marital commitment on film. But it's more than that. It's about knowing by experience, and big ideas nothing less than Womanhood and Love, the pleasure of the flesh that results in an ignoring of the soul, the path of the artist and an argument against fatalism. The film is like a dream where all your subconscious thoughts and conscious feelings are spoken openly and plainly, as if you're possessed. Everything is open; no one, not the characters or Dreyer, insults us with any unnecessary treats. I actually watched the movie with the lights on, purposely, so I wouldn't get absorbed in the story, so I could always be aware of what was really going on. So it's about marriage and love and commitment on one simple level -- there's a joke about it, too: the opera Gertrud says she's going to is \"Fidelio.\" Gertrud says she's leaving her husband; another man, Lidman, a celebrated poet, wants her; and she's having an affair with a young musician, Erland. The film is really a scrapbook for Dreyer's various theories. Gertrud tells Erland, the musician, to play a nocturne -- one of his own, though, not someone else's. Why copy or interpret someone else when you can be yourself? Sometimes you need someone like Gertrud (or Dreyer) to remind you of that simple truth. And it hits home because Dreyer is what he preaches. The characters are always talking directly to us -- a character begs Gertrud to elaborate, \"Things are easier when one understands\" (of course we don't), someone tells Gertrud, \"How beautifully you sang. As if I had never heard the song before.\" Dreyer is talking about himself -- he's the artist showing us things we never saw before that we've been looking at all along. The self-congratulatory tone that hammers us did try my patience, however. There is a musical procession for the poet, and they sing a song to his face about what a truthful artist he is, an artist who refuses false pathos, sentimentality, and derides the mediocre hidden underneath a shiny veneer. This is all fine and good, but Dreyer didn't have to make it so damn obvious he's talking about what a great artist he himself is. He could be a little more broad. He seems to be rubbing our faces in how inaccessible he knows his film will be -- the screen is constantly so bright that it whites out the actors' faces, and he has Gertrud at one point comment on the light hurting her eyes. That's my small quibble that prevents me from giving this a ten, but I wouldn't argue with those who call it a masterpiece. Myself, I rank this among my essential movies for \"life,\" movies you return to every few years that will (or at least should) stay new, because they're about human ideas and nothing else. They may not give answers, but they deepen our feeling and understanding about life's simplest issues in very profound ways. 9/10"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Palladium Film"],
      "summaries": [
         "In the elegant world of artists and musicians, Gertrud ends her marriage to Gustav and takes a lover, the composer Erland Jansson. When he also fails to live up to her idealistic standards, she leaves him and imposes on herself a kind of exile of the heart. In flashbacks and in conversations laced with memories, we also learn of her affair with Gabriel, who still wishes she would go off with him, and we learn of her adolescence, with its early expression of her isolating ideal of absolute love.",
         "In the elegant world of artists and musicians, Gertrud ends her marriage to Gustav and takes a lover, the composer Erland Jansson"
      ],
      "budget": 0
   },
   "movielensId": 37287,
   "movielens": {
      "languages": ["Dansk"],
      "releaseDate": "1964-12-19",
      "dvdReleaseDate": "2006-04-05",
      "directors": ["Carl Theodor Dreyer"],
      "runtime": 119,
      "movieId": 37287,
      "title": "Gertrud",
      "mpaa": null,
      "actors": [
         "Axel Strøbye",
         "Nina Pens Rode",
         "Bendt Rothe",
         "Ebbe Rode",
         "Baard Owe",
         "Anna Malberg",
         "Edouard Mielche",
         "Vera Gebuhr",
         "Karl Gustav Ahlefeldt",
         "William Knoblauch",
         "Lars Knutzon",
         "Valsø Holm",
         "Carl Johan Hviid"
      ],
      "imdbMovieId": "0058138",
      "originalTitle": "Gertrud",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["ofoj3YEER0A"],
      "plotSummary": "Hopeless romantic Gertrud inhabits a turn-of-the-century milieu of artists and musicians, where she pursues an idealized notion of love that will always elude her. She abandons her distinguished husband and embraces an affair with a young concert pianist, who falls short of her desire for lasting affection. When an old lover returns to her life, fresh disappointments follow, and Gertrud must try to come to terms with reality.",
      "tmdbMovieId": 34181,
      "avgRating": 3.59184,
      "releaseYear": "1964",
      "numRatings": 49,
      "posterPath": "/jDS2ynVUcyUJzVg4ffzn9MFqVrD.jpg"
   }
}