{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "kung fu",
            "id": 780
         },
         {
            "name": "showdown",
            "id": 797
         },
         {
            "name": "hero",
            "id": 1701
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "warrior woman",
            "id": 3389
         },
         {
            "name": "fistfight",
            "id": 5572
         },
         {
            "name": "waterfall",
            "id": 5739
         },
         {
            "name": "forest",
            "id": 5774
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "tough girl",
            "id": 34009
         },
         {
            "name": "monastery",
            "id": 41592
         },
         {
            "name": "heroine",
            "id": 156525
         },
         {
            "name": "inn",
            "id": 157337
         },
         {
            "name": "severed hand",
            "id": 166862
         },
         {
            "name": "wuxia",
            "id": 184656
         },
         {
            "name": "kung fu master",
            "id": 185466
         },
         {
            "name": "inner strength",
            "id": 195818
         },
         {
            "name": "beggar clan",
            "id": 195819
         },
         {
            "name": "tavern fight",
            "id": 217367
         }
      ],
      "imdb_id": "tt0059079",
      "video": false,
      "title": "Come Drink with Me",
      "recommendations": [
         76754,
         54178,
         32388,
         55835,
         68837,
         104237,
         42018,
         38155,
         58776,
         117212,
         84582,
         129863,
         109157,
         49457,
         184244,
         72490,
         18510,
         54281,
         54284,
         86262
      ],
      "backdrop_path": "/9NFCEKZpwYcznB61KMZO6PtgHaV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Golden Swallow",
               "gender": 1,
               "credit_id": "52fe44f6c3a368484e040de9",
               "name": "Cheng Pei-Pei",
               "profile_path": "/m3kfKB2jsPF6Veq2WgyMq8QGu6V.jpg",
               "id": 1624,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Fan Dapei / Drunken Knight",
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040ded",
               "name": "Elliot Ngok",
               "profile_path": "/cn4WSOQjxQVigWj4QPHiy561z3e.jpg",
               "id": 94972,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Jade Faced Tiger",
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040df1",
               "name": "Chen Hung-Lieh",
               "profile_path": "/qYIOgyzZdJ1kmzXdzWXEKCofSSd.jpg",
               "id": 936716,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Jade Faced Tiger's man",
               "gender": 0,
               "credit_id": "57e22e98c3a3681a500023e5",
               "name": "Yuen Siu-Tin",
               "profile_path": "/7HC5QhrjmIjlLzUkOhcxQUnVtRG.jpg",
               "id": 68676,
               "order": 3
            },
            {
               "cast_id": 27,
               "character": "Child [unconfirmed]",
               "gender": 2,
               "credit_id": "597a3cd7c3a3682e1a001257",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Child",
               "gender": 2,
               "credit_id": "57e22ece92514125710022f4",
               "name": "Mars",
               "profile_path": "/zGGxzvblNq4UxNIdXLsQLanvhtS.jpg",
               "id": 119454,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Smiling Tiger Tsu Kan",
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040df5",
               "name": "Lee Wan-Chung",
               "profile_path": "/ratQ7E7YpryWiVgJcKX0RzflqR3.jpg",
               "id": 1141875,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Abbot Liao Kung",
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040df9",
               "name": "Yeung Chi-Hing",
               "profile_path": "/sDI8YsvMACm40KpJSfJdGlNMugp.jpg",
               "id": 1133986,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Jade Faced Tiger's #5",
               "gender": 0,
               "credit_id": "57e22e47c3a3681aa10024f2",
               "name": "Shum Lo",
               "profile_path": "/4JWlqHmlaa96MFGlMDHug7M7Tld.jpg",
               "id": 1178707,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Jade Faced Tiger's man",
               "gender": 2,
               "credit_id": "57e22e3b92514123f50022a9",
               "name": "Ku Feng",
               "profile_path": "/zSJwvWED9pT54YUBrQhL31UzeaC.jpg",
               "id": 229302,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Jade Faced Tiger's man",
               "gender": 2,
               "credit_id": "57e22e63c3a3681a500023ce",
               "name": "Han Ying-Chieh",
               "profile_path": "/i5aAiTW4yoXtmQj9bdcKBb98Im9.jpg",
               "id": 72432,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Jade Faced Tiger's man",
               "gender": 2,
               "credit_id": "57e22e76c3a36819980022ba",
               "name": "Fung Ngai",
               "profile_path": "/ifH1FvNQVMouxF5GW15hV9AHQcr.jpg",
               "id": 1164880,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Monk",
               "gender": 0,
               "credit_id": "5875714dc3a3682b060006fb",
               "name": "Hao Li-Jen",
               "profile_path": "/7og5Q5ZP1fsNZBqAOIvfJM4I8lv.jpg",
               "id": 1180157,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Woman escort soldier",
               "gender": 1,
               "credit_id": "58757176c3a3682b22000889",
               "name": "Violet Pan Ying-Zi",
               "profile_path": "/15s4G293JDIuKD5isNvj3K1HSyk.jpg",
               "id": 1174642,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Woman escort soldier",
               "gender": 1,
               "credit_id": "5875718d92514179f5000852",
               "name": "Lily Li Li-Li",
               "profile_path": "/ZLqCeA0I8voQeAMTxBIIBoqA3q.jpg",
               "id": 240169,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Waiter",
               "gender": 0,
               "credit_id": "588d6dd39251410a3d00e54e",
               "name": "Chin Chun",
               "profile_path": null,
               "id": 1152471,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040ddf",
               "name": "King Hu",
               "profile_path": "/lIvTfhF4Mg5Uw7dZcA99bISyXk5.jpg",
               "id": 83698,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040de5",
               "name": "King Hu",
               "profile_path": "/lIvTfhF4Mg5Uw7dZcA99bISyXk5.jpg",
               "id": 83698,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f6c3a368484e040dff",
               "name": "Yi Cheung",
               "profile_path": null,
               "id": 1141876,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a368484e040e05",
               "name": "Run Run Shaw",
               "profile_path": "/e3azWtlmEQrQtJ5HxbRte935aFq.jpg",
               "id": 21918,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55d4593492514102cf001975",
               "name": "Chiang Hsing-Lung",
               "profile_path": "/4rJVpsyq1UA2JoMQDdvGSbvzxMh.jpg",
               "id": 43913,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55d45956c3a368507a001a70",
               "name": "Tadashi Nishimoto",
               "profile_path": "/80zQKz054sJWGN5yKGmX5mxLI2k.jpg",
               "id": 57726,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57e22ef0c3a3681aa1002553",
               "name": "Han Ying-Chieh",
               "profile_path": "/i5aAiTW4yoXtmQj9bdcKBb98Im9.jpg",
               "id": 72432,
               "department": "Crew",
               "job": "Choreographer"
            },
            {
               "gender": 2,
               "credit_id": "59450abf925141400d00e29b",
               "name": "Sammo Hung",
               "profile_path": "/hpqwIMmLLpn0mMmpi4EhzARK24K.jpg",
               "id": 62410,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 5.855311,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 26259,
      "vote_count": 34,
      "budget": 0,
      "overview": "Cheng Pei-pei plays Golden Swallow, a fighter-for-hire who has been contracted by the local government to retrieve the governor's kidnapped son. Holding him is a group of rebels who are demanding that their leader be released from prison in return for the captured son. After a brief encounter with the gang at a local restaurant, Golden Swallow is joined by an inebriated wanderer Drunken Cat (Yueh Hua) who aids her in her mission.",
      "similar": [
         24,
         366964,
         8456,
         281957,
         398175,
         341006,
         46957,
         141733,
         37645,
         4141,
         55292,
         562,
         156022,
         604,
         605,
         27576,
         77663,
         41474,
         381288,
         588
      ],
      "original_title": "大醉俠",
      "runtime": 91,
      "poster_path": "/zttTrq6GGGnsf3TiddlHX6SQJ9y.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": "/nPGLMS26OKdu6T7RYakXGYVXFzK.png",
         "name": "Shaw Brothers",
         "id": 5798,
         "origin_country": ""
      }],
      "release_date": "1966-04-07",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["King Hu"],
      "runtime": 91,
      "synopsis": "A bandit clan ambushes a government garrison and captures the Official of the group. The reason behind their evil plan is to get back their Clan Chief, who was arrested not so long ago, by exchanging the Official for the Chief. Golden Swallow, an Official from the government, is sent by the Governor to save the Official. Disguised as a man, she will confront the bandits group but Jade Faced Tiger, their evil leader, is not that easy to deal with. Golden Swallow will then find a new ally in Drunken Cat. Together they will team up against the bandits and try to overcome the crisis.",
      "writers": [
         "King Hu",
         "Yang Erh"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0059079/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NjAyMTUwOV5BMl5BanBnXkFtZTcwMjQzOTcxMQ@@._V1_SY317_CR27,0,214,317_AL_.jpg",
      "actors": ["Stars: Pei-pei Cheng, Hua Yueh, Hung Lieh Chen | See full cast and crew »"],
      "reviews": [
         "This is the movie that started it all, the watershed wu xia movie in Hong Kong to which pretty much all the kung fu and wire fu movies owe a debt. King Hu was the visionary director who introduced this new style of movie making to the world, and Come Drink With Me is the movie where he first did it. Such an important movie in HK history was clearly going to be one of the jewels in Celestial Pictures' remastered Shaw Brothers series, and indeed it was chosen as the flagship title - a restored print did a small tour of the world to build up interest in the catalog and secure distribution. The DVD was one of the first released, and is a very nice package with beautiful picture and sound quality, great subtitling and an interesting set of interviews. After so many years it's great to see the movie looking and sounding so good. Come Drink With Me begins with a group of bandits attacking a government party and capturing an official, who they hope to use as a hostage exchange for their leader, currently in prison. The government sends out an agent to negotiate the deal, the legendary swordsman Golden Swallow. Golden Swallow is played wonderfully by a young Cheng Pei Pei, in the \"woman dressed as a man\" character that would become a regular wuxia feature. They first meet in an inn that strongly resembles that from Dragon Inn (1992), where they engage in a battle of words and martial arts prowess that leaves the bandits in no doubt that Golden Swallow is not about to let them get away with their plans. Like seemingly all King Hu movies, the plot is layered and intricately woven, full of intrigue and politics and power plays. There's always more going on than meets the eye. It manages this without being at all difficult to follow though, unlike many of its imitators and successors. Come Drink With Me is full of colourful characters, such as the cheerful bandit Smiling Tiger or the singing drunken beggar played by Yueh Hua. Without a doubt the movie belongs to Cheng Pei Pei though, who is beautiful, graceful, fierce and proud, and a tremendous fighter. It's easy to see why audiences loved her, and her character left such a lasting influence on the wu xia movie. The production values in the movie are very high, with beautiful sets, locations and costumes and very nice cinematography. King Hu's skillful camera work is legendary, and the imagery is not as memorable as the imagery in Hu's later work such as A Touch Of Zen it is still of very high quality and way above its peers. The action scenes are probably the main legacy that Come Drink With Me left behind it though. As all the interviews on the disc agree, Hu's approach to choreographing and filming the sword fights raised the bar of Hong Kong martial arts movies to unparalleled levels, and really started the 'fight scene as art form' philosophy that would quickly come to be the defining characteristic of the colony's cinema. By todays standards there is no question that the fight scenes look slow and crude, and are a long way from the grace and beauty that the wu xia movie would eventually achieve under directors such as Tsui Hark and Ching Siu Tung (who has a small part in the movie as a child actor!). However, many of the cinematic styles and techniques were making their first appearance in this movie, so it is fascinating to see them and imagine how exciting they must have been to audiences at the time. The image of Cheng Pei Pei with her twin short swords is one that will linger in the memory for some time even now. Come Drink With Me had quite a reputation to live up to, and the difficulty a keen viewer had in seeing it until now doubtless enhanced that. Probably there will be many viewers that wonder what all the fuss was about, but I think few could dispute that it is a well crafted movie even without considering its historical importance. As is obligatory with any King Hu review though, I do have to point out that it is not as good as A Touch Of Zen",
         "Come Drink With Me is touted as arguably the greatest martial arts film, ever. In its day, this is the movie that broke a lot of grounds, thanks to meticulous direction and vision of King Hu. The story is simple though, telling of Golden Swallow's (Cheng Pei Pei) quest to rescue her brother, a government official, in a ransom case with a bunch of bandits. While her prowess is formidable, a little help is always appreciated when up against the masses, and little does she know that a beggar of sorts, called the Drunken Cat (Yueh Hua), turns out to be her guardian angel. While the Chinese title is obviously a reference to Yueh Hua's character, this movie is clearly Cheng Pei Pei's breakthrough in the martial arts genre. The martial arts here is distinctively different. For its time, it was a breakthrough, with its moving cameras, violence, splattering of blood, as well as fights done with adequate pauses and breaks, like a Western stand off at times, before lunging at each other. The movement, while fluid, is slow compared to these days, then again, having action done too fast would mean either stunt people taking over, or you can't see a thing. The style in this movie struck me as samurai styled swordplay, even though the weapon our heroine used was a pair of short swords rather than katanas. The weapons used too were real, lending a sense of realism when the combatants clash. There are still some opera influences in the movie, especially when it comes to the music, done with Chinese orchestra, and accentuates the scenes like a big opera. Playing in sync to the action on screen, it's an early base on which films like Crouching Tiger Hidden Dragon adopted to great effect. The cinematography is great too, given the many exterior shots in backlots and elaborate sets, featuring classical locales like inns and temples. The introductory scene in the inn will take your breath away, never mind that some cheesy (for today) techniques of stop motion and the reversing of film were used. Cheng Pei Pei is a star in the movie, and she has managed to infuse her background in ballet and dance to the martial arts moves for the movie, bringing forth a very beautiful poise when executing her moves. Her eyes too were luminous and have a life of their own, and can stare daggers at her enemies. Yueh Hua though felt more carefree, given his role as a wandering beggar. And while there are hints of romance between their characters, don't hold your breaths on counting them developing it any further. A to-the-point story, and excellent martial arts. This is a definite must watch for all martial arts genre fans. IVL Code 3 DVD Extras: A departure from the other IVL releases I've watched so far, this DVD had a valuable commentary by Cheng Pei Pei herself, and daughter Marsha Yuen, presented by film producer Bey Logan, in English. It's quite hilarious listening to Logan try and identify some of the actors, but always getting them wrong and had to be corrected by Pei Pei, until he knew not to embarrass himself further and allowed Pei Pei to introduce them instead. Marsha however, had little to contribute, except to laugh loudly into the microphone. There are two Come Drink With Me trailers included, one the original which had its written script which you have to read running from right to left, and the quality is pretty degraded. The new remastered one is definitely clearer, and so were the trailers for other movies, some starring Pei Pei herself. You have the usual extras as well, like the few movie stills, one original poster, a one page one paragraph worth of production notes, as well as a short cast and crew biography and filmography. A pity thought that you can note some typos in the DVD menus and subtitles. The real gems of the extras, are the interview clips. The longest interview on the disc is with Cheng Pei Pei (18 mins 30s) done in English, where she compares martial arts movies then and now, shared some production nuggets such as the duration of shooting the fight scenes, on sexuality of those days, her working relationship with King Hu, provided insights into working under Shaw Bros. explained her ease with learning martial arts, and shared on her working experiences with Yueh Hua. Yueh Hua too has an interview included, though it was quite short, clocking at 4 mins 45s. He shares his thoughts on working with King Hu and Cheng Pei Pei, as well as revealing that he had real wine in that wine bottle prop to assist him in getting into character. However, the interview is conducted in Mandarin, with no subtitles provided. I'm surprised at the inclusion of an interview with Marsha Yuan (daughter of Cheng Pei Pei) in English, for 6 mins and 40s, as she shares her thoughts on the movie, her realization when growing up that her mom was famous, and the big revelation is that there is going to be a sequel she's gonna star in. Is there? The last two interviews are with film critic Paul Fonoroff and film producer Bey Logan, as both talk about Cheng Pei Pei and King Hu, clocking at 9 mins 50s, and 4 mins 40s respectively. The former interview is more insightful though, as he shares a little on the history of the rivalry between Shaw and Cathay in their heydays. The restored version in the DVD is pristine, save for one or two scenes in soft focus which seemed a little blur. Audio transfer is great too. The only pity is that it's not in Anamorphic Widescreen.",
         "This movie has it all -- meaning that it's directed by King Hu, and stars Cheng Peipei. The wire work is flawless, the use slow motion breathless, and the butt kicking is epic. The mistaken identity plot RE: Cheng is the same as a lot of pictures from this time -- but King Hu does it with real flair in this one. I was put on to this movie and King Hu in general by a guy I spar with every week at Fu. Cheng's moves are fluid and inspiring. Pay particular attention to how it is that she's able to take on multiple opponents -- I can't say exactly what style she's using, but it's surprsingly believable considering many actors of the time did more ballet/Peking opera acrobatrics, than actual ancient forms. This is a must see for anyone into martial arts.",
         "Having just seen a new print of this at the 2002 Vancouver international film festival, I must say that it has been hidden away for far too long. A splendid cast delivers a great action flick that simply does not seem 37 years old. If films of this quality had been circulating in recent years, \"Crouching Tiger, Hidden Dragon\" may not have been such a revelation. I am looking forward to many more restored classics from the Shaw brothers archive. A great night at the movies!",
         "Da zui xia was a relief. I watched many kung fu movies as a child that were slightly reminescent of this one, and have stopped watching recent ones since the scope of their theme had narrowed down so much. Now, for the first time in many years, I am able to recover some of what I saw back then but did not fully understand. A recent tour throughout China and more familiarity with Chinese philosophy and culture gave me sudden insights in the director's message. This is very refreshing.",
         "If you want to see the inspiration for Crouching Tiger, Hidden Dragon this is it. I saw this after being opened up to wuxia (Chinese sword fight pics) by CTHD. Ang Lee was obviously inspired by Come Drink With Me. Remember the rooftop scene in CTHD?, the big bar brawl?, catching those little darts?, and the actress who played the Jade Fox (Cheng Pei Pei)? All are in Come Drink With Me. The story behind the movie is that Run Run Shaw of the legendary Shaw Brothers Studio wanted to make a Chinese version of a Japanese Samurai (Chanbara) movies. He hired a young, inexperienced, director now known to us as King Hu. The result was a movie that, for its time, was groundbreaking and it is still a lot of fun to watch today. Somebody PLEASE release a high quality DVD version though, because the only one I have found is AWFUL!",
         "If this film had been released in America in the year of its production, 1966, or the year afterward, I guarantee that the rave for Hong Kong action films would have surfaced then, and not 1972 (and on) with \"5 fingers of death\" and \"fist of fury\". And it would not just have happened among young men (the principle audience for the 'fu film in the '70s), but among Hollywood veterans as well, which would have begun a trend to introduce Hong Kong methods - and professionals - into Hollywood itself. because this film is dam' well made. The film looks as though King Hu spent hours watching and analyzing George Steven's accomplishment in \"Shane\", and then figuring out how to do Stevens 'one better' so to speak, and yet maintain his film's appeal to his base audience in Hong Kong and other Chinese communities. So what we have here is part 'adult western', part 'chinese opera' and all adventure movie from start to finish. And this is not for kids - and I'm not referring to the violence. The subtle humor of the dialog, the maturity of the acting, the wisdom of the ethical problems raised and of their resolutions, these are for adults to enjoy, and then later to ponder. When the hero stabs a villain, and the villain's blood gushes over the hero's face, this is a brutal reminder of just how serious a violent choice - i.e., the choice to engage in violence, however noble the cause - really is. - A question the film takes seriously, as any good film would. Very well made, cleverly written, with strong performances from all. A real gem.",
         "This film is an outstanding example of the quality of pictures Shaw Brothers were capable of producing. The picture easily transcends the genre to be a period drama with martial arts (and not just a martial arts flick!) Shot in 1966, easily Cheng Pei-Pei's best film. She returned to the genre with a bang in CROUCHING TIGER, HIDDEN DRAGON playing the villainous Silver Fox. Despite popular myth, a very young Jackie Chan does NOT appear in the film. Though martial arts movie fans will notice a very young Mars (longtime friend of Jackie, actor and former member of the Jackie Chan stunt team). A sequel had been on the cards recently, featuring Marsha Yuen, Cheng Pei Pei's daughter, but doesn't seem to have got off the ground.",
         "Cheng Pei-Pei was the Michelle Yeoh of the Sixties. A stunning action star who was as cold as ice in a fight. In this film she takes on around 40 or 50 guys and still manages to keep her cool. Seeing her two-fisted sword technique as the Golden Swallow is well worth the price of admission.",
         "Outstanding martial arts masterpiece, with Ms. Cheng (as Golden Swallow) doing some fancy footwork under the expert direction of King Hu (whose classic A TOUCH OF ZEN is another masterpiece). The incredibly fluid tracking shots of Cheng, as she nimbly battles her way spinning and lunging down stone temple steps and across courtyards, are must-see. There's also a rooftop chase that clearly inspired a similar scene in CROUCHING TIGER, HIDDEN DRAGON (itself another masterpiece). The action in COME DRINK WITH ME is infinitely superior to the speeded-up camera-work, wirework and cgi all too common in today's martial arts movies (which should rightly be called \"mechanical martial arts movies\"). Even the magical elements (the use of chi) are handled in an interesting way. If you want to impress a non-fan, show them COME DRINK WITH ME: it'll make a believer out of them."
      ],
      "genres": ["Crime"],
      "productionCompanies": ["Shaw Brothers"],
      "summaries": [
         "A ruthless band of thugs kidnaps a young official to exchange for their leader who has been captured. Golden Swallow is sent to take on the thugs and free the prisoner (who is also her brother). Though she is able to handle the overwhelming odds, she is hit by a poison dart and gets help from a beggar who is really a kung-fu master in disguise. With his help, she forms a plan to get her brother back.",
         "A group of bandits kidnaps the governor's son and demands their imprisoned leader to be set free in exchange."
      ],
      "budget": 0
   },
   "movielensId": 37335,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1966-04-07",
      "dvdReleaseDate": "2008-05-27",
      "directors": ["King Hu"],
      "runtime": 91,
      "movieId": 37335,
      "title": "Come Drink with Me",
      "mpaa": null,
      "actors": [
         "Cheng Pei-Pei",
         "Elliot Ngok",
         "Chen Hung-Lieh",
         "Yuen Siu-Tin",
         "Jackie Chan",
         "Mars",
         "Lee Wan-Chung",
         "Yeung Chi-Hing",
         "Shum Lo",
         "Ku Feng",
         "Han Ying-Chieh",
         "Fung Ngai",
         "Hao Li-Jen",
         "Violet Pan Ying-Zi",
         "Lily Li Li-Li",
         "Chin Chun"
      ],
      "imdbMovieId": "0059079",
      "originalTitle": "大醉俠",
      "genres": [
         "Adventure",
         "Action"
      ],
      "youtubeTrailerIds": ["C4SMPQyiLy4"],
      "plotSummary": "Cheng Pei-pei plays Golden Swallow, a fighter-for-hire who has been contracted by the local government to retrieve the governor's kidnapped son. Holding him is a group of rebels who are demanding that their leader be released from prison in return for the captured son. After a brief encounter with the gang at a local restaurant, Golden Swallow is joined by an inebriated wanderer Drunken Cat (Yueh Hua) who aids her in her mission.",
      "tmdbMovieId": 26259,
      "avgRating": 3.43137,
      "releaseYear": "1966",
      "numRatings": 51,
      "posterPath": "/zttTrq6GGGnsf3TiddlHX6SQJ9y.jpg"
   }
}