{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0212292",
      "video": false,
      "title": "Kwik Stop",
      "recommendations": [],
      "backdrop_path": "/fHyQ9BgSMUWAbzU29djt7ok5kjE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe49ef9251416c910bda95",
               "name": "Michael Gilio",
               "profile_path": null,
               "id": 186654,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Didi",
               "gender": 0,
               "credit_id": "52fe49ef9251416c910bda99",
               "name": "Lara Phillips",
               "profile_path": "/s9wfzCq5ZfLxUzxMrquxWWGJjtW.jpg",
               "id": 56563,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49ef9251416c910bda91",
            "name": "Michael Gilio",
            "profile_path": null,
            "id": 186654,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.256375,
      "production_countries": [],
      "id": 88286,
      "vote_count": 4,
      "budget": 0,
      "overview": "Two strangers discover you really can find anything at a convenience store -- even love. An aspiring actor stuck in a small town who has big plans of moving to Hollywood so he can strike it rich. One night, while on his way into a corner store, he meets Didi, a pretty but aimless girl hanging out in the parking lot. Mike and Didi strike up a conversation, and she discovers there's a big dose of self-doubt lurking beneath his confident exterior. Mike, on the other hand, finds that the longer he talks to Didi, the more he finds himself thinking she might be a good reason to stick around.",
      "similar": [],
      "original_title": "Kwik Stop",
      "runtime": 110,
      "poster_path": "/bQbTOSukJOvDobe3VOkn7tT7SZl.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2001-04-21",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Gilio"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Michael Gilio"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0212292/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4MDg3Mjc2NF5BMl5BanBnXkFtZTcwMjk5NzkyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Gilio, Lara Phillips, Rich Komenich | See full cast and crew »"],
      "reviews": [
         "A wonderful little independent film. I had the chance to see this at SXSW in 2002. Kwik Stop starts out like your normal Boy Meets Girl, boy and girl go on road trip, boy and girl get into trouble type film. It quickly leaves that genre however and ends up in some completely other place. It bounces from comedy to melodrama about half way through. All of the performances are wonderful and the writing is good (if not at all times believable). Some of the dialogue was a bit too over the top for my tastes and the ending had me asking \"why\". I think had this film stayed more light-hearted I would have liked it more. But for the Writer/Director's first effort it was well worth seeing!",
         "Easy, breezy indy 'road' flick taking place in small town, USA. The title being metaphorical. Well written with actors giving dead on performances. After first viewing and feeling full 'n satisfied I made a second run through Kwik Stop and worshiped the dialog. Tightly written and delivered invoking awe, in each scene, of the direction. Yet the film does not hem itself in as the very last scene invokes a theme from earlier that blows open the possibilities of the final three characters. With rumination, I like the ending more and more; realizing the screenwriter's almost dare to the viewer. Yes it is, yet another youth 'learning and growing' distopian tale that have been coming so frequently of late, and seem to be the 'fast ticket' to Sundance/Hollywood (thank god for p2p). In this style, the lyrics of each song fills in the natural voids of communication between the proto-typical teens, and does this well. There is little to no violence or nudity, shocking or otherwise, to stir up inflated buzz. This results in Kwik Stop having to be judged on more quaint qualities where it smacks the 'brown bunny' with 'love and a 45'. (The bunny 45 thing is a reference to the film's peers and are not in Kwik Stop.)",
         "I just saw this film at the St. Louis Int'l Film Festival, and it may be my favorite film of the year. Kwik Stop has some of the smartest dialogue I've ever heard, in the service of an unusually honest love-on-the-run story. The perfomances are outstanding too. This is a major, major find.",
         "I really liked this movie. Seemed like a regular indie movie about self-centered young adults, but really became something else. The movie quickly runs away with itself. I just read the Ebert review. He said Kwikstop \"follows its characters where they insist on going\". I agree with him that this is what makes the movie surprising and fun. It is curious too how the characters \"grow up\" during the movie. In a way the film-making and acting also mature as the film continues. It goes from quick and self-conscious in the acting and camera-work to long static jim-jarmusch (stranger than paradise) like shots and virtuoso performances. It is really strange. By the end you feel like you are in a different film altogether. I had that feeling of inevitability watching the characters struggle that all good fiction gives me. Also there is a monologue in this by the character Emil (Rich Komenich) that I have just watched a hundred times. Totally gives me chills every time. Just brilliant. I would totally see more movies by these people.",
         "The usual summer line-up isn't complete without the mandatory \"Boy Meets Girl\" comedy. These films are not to be taken seriously for the intended reason that they are a mere subterfuge for other activities within the theater. This film begins with some of the light hearted comedic sense of the \"BMG\" films but with fluidity that captures the viewer into the fantasy. Fantasies never last long and fluidity turns to turbulence and a sense of chaos. Soon enough, the viewer is awoken from paradise and thrown into what could be described as a David Lynch type directive with the unknown striking at any moment as if one is driven down a road in complete darkness, with twists and turns imminent. This film is not sugar coated and you will not be spoon fed. It is not meant to be \"Chicken Soup for the Soul\", however, may leave you searching for what comfort remains.",
         "I checked the spoiler box because I certainly don't want to run afoul of the spoiler rules here. I'm not going to review the movie to that depth anyway. There are others who have already done enough in that regard. I just wanted to add this comment: The movie would have been loads better if the ending were altered so that the girl stayed with the last guy. This was the consensus of those who watched it at my house the other day. Sure it would have made it a tad more commercial and a little less avant guard, but sometimes less is more. Besides, even if she stayed with the last guy, the movie would still have been an off the scale in terms of movie freshness. Enjoy.",
         "I saw this film at the 2001 LA film festival. Loved it. Direction is flawless, performances outstanding, cinematography excellent. Could be cut down by a few minutes, but otherwise, a brilliant film. Looking forward to more output by all involved.",
         "I don't care what anyone says, this movie was crap. The only thing it had going for it was camera work which was very well done. As for the dialogue I have heard so many people talk about...it sucked too. Yes it was honest and true to life, but so what, I can hear anyone talk like that on the street, or in a fast food joint. What made the dialogue good in movies like Pulp Fiction, and Gosford Park was the fact that it is WRITTEN dialogue, that takes time to think through. Another thing was that the director should not have put himself in the picture. I believe that the male character could have been a lot stronger, but instead it seemed weak. In fact the movie seemed to revolve around the male character, and then he completely disappears in the last twenty minutes. The girl in the film I found completely repulsive, not in appearance, but in her needy needy ways. Saying she is in love with a guy, and actually getting jealous of him the next day, what a crock of crap. Final thing: the sound was terrible, and I hope it was only something that plagued my theater instead of actually being on the final cut of the film. There was a constant buzzing sound during several scenes and it was actually taking away from the talking going on. The one good thing again was Blood's job as the DP, but the actress that played the main guy's ex girlfriend did a very good job as well. These two things couldn't save an ultimately terrible movie, which I refuse to call a film. 2/10"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Kwik Stop LLC"],
      "summaries": ["The tale of a Hollywood-bound actor called Lucky whose shoplifting is discovered by a local girl in a small, Midwestern town."],
      "budget": 0
   },
   "movielensId": 37949,
   "movielens": {
      "languages": [""],
      "releaseDate": "2001-04-21",
      "dvdReleaseDate": "2005-06-18",
      "directors": ["Michael Gilio"],
      "runtime": 110,
      "movieId": 37949,
      "title": "Kwik Stop",
      "mpaa": "",
      "actors": [
         "Michael Gilio",
         "Lara Phillips"
      ],
      "imdbMovieId": "0212292",
      "originalTitle": "Kwik Stop",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["6B7N8LKlJWw"],
      "plotSummary": "Two strangers discover you really can find anything at a convenience store -- even love. An aspiring actor stuck in a small town who has big plans of moving to Hollywood so he can strike it rich. One night, while on his way into a corner store, he meets Didi, a pretty but aimless girl hanging out in the parking lot. Mike and Didi strike up a conversation, and she discovers there's a big dose of self-doubt lurking beneath his confident exterior. Mike, on the other hand, finds that the longer he talks to Didi, the more he finds himself thinking she might be a good reason to stick around.",
      "tmdbMovieId": 88286,
      "avgRating": 3.83333,
      "releaseYear": "2001",
      "numRatings": 3,
      "posterPath": "/bQbTOSukJOvDobe3VOkn7tT7SZl.jpg"
   }
}