{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0168794",
      "video": false,
      "title": "The Five Senses",
      "recommendations": [],
      "backdrop_path": "/i133Ol8Ow3rgxF7PRWEte7w3CQn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rona",
               "gender": 1,
               "credit_id": "52fe473ac3a36847f812a3f1",
               "name": "Mary-Louise Parker",
               "profile_path": "/3e72qs1QuqMlpieIm2JZtX1WNg2.jpg",
               "id": 18248,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Anna Miller",
               "gender": 1,
               "credit_id": "52fe473ac3a36847f812a401",
               "name": "Molly Parker",
               "profile_path": "/iCG1XrXkg09R9eK52PYUEA3HVX5.jpg",
               "id": 27125,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ruth Seraph",
               "gender": 1,
               "credit_id": "52fe473ac3a36847f812a405",
               "name": "Gabrielle Rose",
               "profile_path": "/7mUaad0a3iaAw33VrNmKQuHPlmb.jpg",
               "id": 58804,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Amy Lee Miller",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a409",
               "name": "Elize Francis Stolk",
               "profile_path": null,
               "id": 560315,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rachel Seraph",
               "gender": 1,
               "credit_id": "52fe473ac3a36847f812a40d",
               "name": "Nadia Litz",
               "profile_path": "/bFdjrpY0YjwnEdbChpz4NrMYIoW.jpg",
               "id": 560316,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a411",
               "name": "Daniel MacIvor",
               "profile_path": null,
               "id": 76627,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Dr. Richard Jacob",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a415",
               "name": "Philippe Volter",
               "profile_path": "/v5s5uo82mkTGkgkwfguCjmokLzg.jpg",
               "id": 1142,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Carl",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a419",
               "name": "Clinton Walker",
               "profile_path": null,
               "id": 560317,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Richard's Patient",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a41d",
               "name": "Astrid Van Wieren",
               "profile_path": null,
               "id": 560318,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Rupert",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a421",
               "name": "Brendan Fletcher",
               "profile_path": "/pt6kjBmnhamO1nvc1YqX3AczYpS.jpg",
               "id": 32205,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Richard's Doctor",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a425",
               "name": "Paul Bettis",
               "profile_path": null,
               "id": 560319,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Justin",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a429",
               "name": "James Allodi",
               "profile_path": "/2CWfhSnCCfmzunTxZZAOpllkrCJ.jpg",
               "id": 4572,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Airport Clerk",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a42d",
               "name": "Gavin Crawford",
               "profile_path": null,
               "id": 193042,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "TV Reporter #1",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a431",
               "name": "Sandi Stahlbrand",
               "profile_path": "/1JKsfF6aDwni2ge5JJt2xq6ds2v.jpg",
               "id": 181018,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Sylvie",
               "gender": 1,
               "credit_id": "52fe473ac3a36847f812a435",
               "name": "Amanda Soha",
               "profile_path": null,
               "id": 215033,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a3f7",
               "name": "Jeremy Podeswa",
               "profile_path": "/fdzF8YFdXRh4iwwlO0kpsFn6QIY.jpg",
               "id": 88391,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a3fd",
               "name": "Jeremy Podeswa",
               "profile_path": "/fdzF8YFdXRh4iwwlO0kpsFn6QIY.jpg",
               "id": 88391,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.150666,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 47585,
      "vote_count": 9,
      "budget": 0,
      "overview": "Three sets of tenants in a live/work building have daily lives and/or current stories acutely involving one or more of the five senses.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         101,
         205,
         141,
         339692,
         281957,
         241
      ],
      "original_title": "The Five Senses",
      "runtime": 106,
      "poster_path": "/nayrAf0D4uVV4RUGM57ZI9aFf59.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [],
      "release_date": "1999-05-18",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeremy Podeswa"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Jeremy Podeswa"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0168794/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2NjAzODM5Ml5BMl5BanBnXkFtZTcwNjk5MDUyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Molly Parker, Gabrielle Rose, Elize Frances Stolk | See full cast and crew »"],
      "reviews": [
         "\"The Sixth Sense\" bedazzled us last year with its supernatural trickery. This year, \"The Five Senses\" deserves equal success by being merely natural -being able to tell a human story intelligently. The film is a collection of love vignettes with each character cleverly highlighting one of the human senses. Writer and director Jeremy Podeswa has intertwined a human drama of finding a missing little girl with each player contributing an intriguing and equal share of the story, crisscrossing each other's lives in near perfect structure and execution. \"The Five Senses\" is what \"Timecode\" wishes it could have become. Mary Louise Parker heads a powerful cast, each member with an absorbing tangent that you merrily want to follow: Robert (Daniel MacIvor) the gay house cleaner who pursues true love by trying to find that distinct scent, Rona (Parker) the hopelessly unlucky lover who only sees what she wants to see in a relationship, Roberto (Mario Leonardi) her amorous counterpart too wrapped up in Italian cuisine to understand American courtship, Richard (Philippe Volter) the French doctor so consumed with his ominous deafness until he is rescued by an unexpected consort, Ruth (Gabrielle Rose) the massage therapist who tries to consummate her love for her deceased husband every time she touches a client, and finally Rachel (Nadia Litz), a composite of all the senses, a young woman blinded by guilt both past and present and yet using her senses to strive for forgiveness. \"The Five Senses\" is intelligent enough to show us how each individual uses their senses to try to escape their human quandary - some succeed and some don't.",
         "In movies, as in most other art forms, the greatest of works often come in the smallest of packages. Such is the case with `The Five Senses,' an independent Canadian production that chooses for its subject nothing less profound than a meditation on what it means to be human. Writer/director Jeremy Podeswa has fashioned a work of great poetic form and insight centered around a group of people who share the universal need to find true love and acceptance in a world where wounded and shattered relationships all too often result in magnified loneliness and despair. Like all of us, each of these characters gropes towards the dual goals of intimacy with others and acceptance of oneself that are essential for human happiness. Some succeed, while others fail \u0096 just as in life \u0096 but none of the characters is left unchanged by the experience. `The Five Senses,' though it has a plot, is more of an emotional mood piece than a narrative-driven drama. Blessed with an outstanding ensemble cast, Podeswa is able to draw us in to the center of his world through the use of sensory imagery and deliberate, methodical pacing. In fact, one of the strongest themes running through the film is its examination of the part our senses play in defining our world and character. Podeswa understands that we have become desensitized to our senses. As a result, he uses this film to reconnect us to that crucial element of our beings. The quiet, hushed tone, the muted autumnal colors, the slowly moving camera, the haunting musical score all combine to create an atmosphere in which the audience can become conscious of every sight and sound that comes our way. In our effort to establish meaningful intimacy with other human beings, we most typically rely on the sense of touch \u0096 yet, this can serve, Podeswa shows us, as much to trap us into a false intimacy as to lead us into one that is genuine and lasting. A number of his characters use sex as a substitute for true closeness, while others make a physical connection on a much deeper level. One of the most moving moments in the film occurs when a gay man \u0096 most probably an AIDS patient \u0096 breaks down in tears during a massage session, his heart broken because no one has dared to touch him in so long a time. This film acknowledges the vital part that tender physical contact plays in the totality of a person's humanity. In a similar way, the film explores the beauty of sound, as one of the characters \u0096 ironically, an eye doctor, a man dedicated to preserving the organ of one sense \u0096 faces the prospect of impending deafness and yearns to create a mental catalogue of all the exquisite sounds of everyday life that he will soon no longer be able to hear and that we so routinely take for granted. Yet, like all the other characters, it is his spiritual emptiness and inability to make a meaningful connection with another human being that bring him his greatest obstacles to happiness. Podeswa also examines the part smell plays in making that vital human connection, as one of the characters \u0096 a lonely gay man \u0096 revisits his former lovers to take a whiff of their scent in an effort to discover if he can smell `true love.' Yet `The Five Senses' is not merely a movie built on a clever `gimmick.' On the contrary, it breathes with the fullness of humanity because each of its many characters emerges as a fully developed, instantly recognizable human being. There are teenagers alienated by their own inability to fit into the accepted norm of society and made to feel guilty by their acts of careless irresponsibility. There are mothers terrified of losing their children, in one case, literally, as her young girl wanders off and disappears and, in another case, figuratively, as her adolescent daughter seems to be slipping away into inexplicable `strangeness.' There are adults unable to comprehend a life filled with failed relationships who strike out in desperation for that one last opportunity for happiness, often with the result that they end up further away from that universally desired goal than ever. One of the most daring aspects of `The Five Senses' is that it does not succumb to the temptation to provide either a `happy' ending or even a conclusive one for all of its characters. The film acknowledges that life is a messy, never ending process of changing fortunes and personal growth and it stays true to that theme all the way to the end. This brave, haunting and mesmerizing film definitely stands as one of the true movie finds of recent years \u0096 a true work of art!",
         "Chosen as the film to start the Perspective Canada series for the 1999 Toronto Film Festival, \"The Five Senses\" explores numerous lives in turmoil that are also intertwined in many ways. Shot in Toronto, the story revolves around the disappearance of a little girl and how it affects the lives of those who knew her and those who feel responsible. More predominantly though, I believe it is about the bonds that are forged from one person to another in a variety of relationships and the strains that can test them. From friends old and new, parent to child, employer to employee, client to vendor, lovers past and present. All of these associations undergo a transformation of some kind in this film. The film is beautifully shot with interesting set-ups but is not edited evenly throughout the feature. Scenes with Molly Parker and Mary Louise Parker are tightly edited and executed nicely, while some other scenes just seem to be drawn out a bit too much, the pace is a slow one, with numerous subplots that attempt to liven the drama. But for art's sake and support of Canadian filmmaking, I would prefer not to draw negative attention to this film. There are some very moving scenes and excellent performances, but at the same time, I'm not sure I can recommend this one to just anyone.",
         "The promise Jeremy Podeswa gave with his first film \"Eclipse\" is really fulfilled now in his second \"Five Senses\". Authentic atmosphere and the various aspects of a little bit neurotic life-feeling of metropolitain people is again in his new film. Podeswa has an astonishing hand for showing the daily tragedies with credibility and he really cares about his protagonists. Intelligent dialogues and good actors complete the very good first impression. A director with a great future !",
         "The five senses is a truly lovely film. It takes a look into the lives of several people, most of whom are somehow the embodiment of a sense. Yet the fact that they are so involved in a particular sense prevents them from experiencing life fully. Sight is embodied in a young woman who bakes designer cakes. The cakes are visually stunning, but she has very little regard to how they taste. Sight is also the sense of a young man who voyeuristically watches men hook up in a park, but doesn't himself experience physical fulfilment. Hearing is embodied in the bittersweet story of a doctor who is losing his hearing, and is concerned with hearing this favorite sounds one last time. Smell is personified by a young man who is convinced that love has a smell, and seeks out his former lovers in order to sniff them and see if they still love him. Touch is a massage therapist who seems to use her practice to regain the intimacy she once had with her now deceased husband. And finally, taste is embodied by the Italian lover of the cake baker who is constantly cooking, because it is his only real way of communicating with her. These people's lives occasionally intersect because they all live work, or otherwise have ties to the same building. Their stories are woven around a larger story of a missing little girl. We get to know these people through short chronological glimpses into their lives that string together into a non-linear narrative. The device is similar to that used by Atom Egoyan, but the element of time is not distorted. In the end, not all of the stories are resolved, which is actually good because it keeps us thinking and allows us to revisit the characters and imagine a number of plausible endings. The film has a beautifully austere formality about it. It meanders through its stories at a very thoughtful pace, and looks at them from a bit of a distance. We see very profound emotions before us, but experience them intellectually. I can see that this film is not for everyone, but is great for those interested in a well crafted, thought-provoking experience.",
         "The sense of sensing identity unifies these people by means of there (organic) five senses. They smell, see, hear, taste and touch each other by means of their sixth sense:they discover it by theirselves and by each other by means of the same senses. There are many more senses... But it is beautiful to see a film which show so many senses only by showing five of them.",
         "An enjoyable quiet movie that examines people's perceptions of the world and themselves. Worthy of a watch. I enjoyed Gabrielle Rose's performance. She was good in \"The Sweet Hereafter\" and very engaging in this movie. The rest of the cast was equally good. I do have a problem with the title. I kept thinking this character is this sense and this one is that sense which distracted me from the unfolding stories. I think a more generic title like \"Sense\" would have been better. The ending was unexpected.",
         "Every once in a while a movie comes along that takes hold and never lets go. The Five Senses does that, from the beginning to the end, in a way where you know leaving your seat will cause you to miss a vital part of the movie. Knowing this, you can't help but remain on the sofa, recliner or your favorite movie chair until the final credits begin scrolling the screen. There is no need for me to detail the movie because I could not do it justice. The only way to get this movie, is to simply watch it for yourself. It's as simple as that and by not watching The Five Senses, you are missing out on a touching film.",
         "I liked this movie and, interestingly, my much younger companion did not. Too meandering and so little happening, she said. And that is the quality that I found most appealing and more like real life. There are gentle stories here woven around the central premise of a young child's disappearance and the reaction to this event is seen as background in many of the scenes which is a technique very cleverly done. There is also the haunting singing of someone in an apartment in the building where all the interaction and often non-interaction of the other characters takes place. We only see this mystery singer at the end of the movie. Mary Louise Parker was the only harsh note. I find her performances always stilted, cold and full of a hidden tension not usually necessary to the role she is playing and again she did not disappoint. I did not know what the earthy Roberto saw in her. I liked very much the character of Raymond searching for the scent of love in all his ex lovers. I have a bias towards movies like these, of the Run Lola Run type. I feel they are more reflective of reality, no Hollywood quick fix endings just a slice of life beautifully acted and photographed that just stays with you a little longer than the A-B plot lines of most movies. 8 out of 10.",
         "Roger Ebert made a point once that you can always tell when you're watching a film made in Canada because they take their time telling the story. No different here as a bunch of fascinating plots all revolve at the same time. Some quiet surprises are sprinkled throughout that make complete sense to the characters but perhaps not as well by the viewer. Whenever you see Mary Louise Parker in any movie, you know you're in for something interesting. She plays a chef whose visual masterpieces never taste as good as they look. A highly original work of delicate screenwriting with some of the most potent quiet moments of any recent film."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Alliance Atlantis Communications",
         "Canadian Broadcasting Corporation (CBC)",
         "Canadian Film or Video Production Tax Credit (CPTC)"
      ],
      "summaries": [
         "Interconnected stories examine situations involving the five senses. Touch is represented by a massage therapist who is treating a woman, while her daughter accidentally loses the woman's pre-school daughter in the park. The older daughter meets a voyeur (vision), a professional house-cleaner has an acute sense of smell, a cake maker has lost her sense of taste, and an older man is losing his hearing.",
         "Three sets of tenants in a live/work building have daily lives and/or current stories acutely involving one or more of the five senses. Rona, a specialty cake decorator, makes the worst tasting cakes in the world. She has mixed feelings about a visit from Roberto, a holiday fling she had. Roberto speaks little English, and Rona speaks little Italian, so they communicate primarily through sex. But Roberto also tries to make a connection through his passion, food. Rona's best friend and ex-lover is bisexual Robert, a house cleaner with a keen sense of smell. Robert is meeting with old boyfriends and girlfriends in search of the smell of love, all the while hoping to find that smell on the one he probably can't have, the husband half of married couple clients, the wife of whom is a fragrance specialist. Dr. Richard Jacob, an ophthalmologist, is quickly making mental memories of sound as he learns he is going deaf. One of the sounds he will miss the most is that of the contralto opera singer next door, who he has never seen. And widowed Ruth Seraph is a massage therapist who has a troubled relationship with her quietly rebellious teen-aged daughter, Rachel. A crisis occurs when Anna Miller comes for a massage appointment with her three-year old daughter, Amy Lee: while Rachel babysits Amy Lee, Amy Lee goes missing. Through this crisis, Ruth learns not only the technical importance of touch, but also its emotional resonance."
      ],
      "budget": 0
   },
   "movielensId": 3795,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Italiano"
      ],
      "releaseDate": "1999-05-18",
      "dvdReleaseDate": "2001-01-23",
      "directors": ["Jeremy Podeswa"],
      "runtime": 106,
      "movieId": 3795,
      "title": "The Five Senses",
      "mpaa": "R",
      "actors": [
         "Mary-Louise Parker",
         "Molly Parker",
         "Gabrielle Rose",
         "Elize Francis Stolk",
         "Nadia Litz",
         "Daniel MacIvor",
         "Philippe Volter",
         "Clinton Walker",
         "Astrid Van Wieren",
         "Brendan Fletcher",
         "Paul Bettis",
         "James Allodi",
         "Gavin Crawford",
         "Sandi Stahlbrand",
         "Amanda Soha"
      ],
      "imdbMovieId": "0168794",
      "originalTitle": "The Five Senses",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Three sets of tenants in a live/work building have daily lives and/or current stories acutely involving one or more of the five senses.",
      "tmdbMovieId": 47585,
      "avgRating": 3.49278,
      "releaseYear": "1999",
      "numRatings": 277,
      "posterPath": "/nayrAf0D4uVV4RUGM57ZI9aFf59.jpg"
   }
}