{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "harmonica",
            "id": 2089
         },
         {
            "name": "music store",
            "id": 156825
         },
         {
            "name": "big band",
            "id": 188649
         }
      ],
      "imdb_id": "tt0034055",
      "video": false,
      "title": "Pot o' Gold",
      "recommendations": [],
      "backdrop_path": "/gUeT3mZI1AnvIsAPbgSIxlPSvW1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "James Hamilton 'Jimmy' Haskell",
               "gender": 2,
               "credit_id": "52fe47929251416c7509e4c5",
               "name": "James Stewart",
               "profile_path": "/aBLtt0Sl4AZVNclzFrXzbndRzux.jpg",
               "id": 854,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Molly McCorkle",
               "gender": 1,
               "credit_id": "52fe47929251416c7509e4c9",
               "name": "Paulette Goddard",
               "profile_path": "/8MuOzgtsI1PQUIlj2e2Y1UFLpTc.jpg",
               "id": 14027,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Horace Heidt",
               "gender": 2,
               "credit_id": "52fe47929251416c7509e4cd",
               "name": "Horace Heidt",
               "profile_path": null,
               "id": 83473,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Charles 'C.J.' Haskell",
               "gender": 2,
               "credit_id": "52fe47929251416c7509e4d1",
               "name": "Charles Winninger",
               "profile_path": "/fmbfytXqjpM1RNieEPAIGNFnydC.jpg",
               "id": 83474,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mom McCorkle",
               "gender": 1,
               "credit_id": "52fe47929251416c7509e4d5",
               "name": "Mary Gordon",
               "profile_path": "/u4QD0zsgBgXTi3At0e0ow8VdiEi.jpg",
               "id": 2934,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jasper Backus",
               "gender": 2,
               "credit_id": "52fe47929251416c7509e4df",
               "name": "Frank Melton",
               "profile_path": null,
               "id": 1046806,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "J.K. Louderman",
               "gender": 2,
               "credit_id": "52fe47929251416c7509e4e3",
               "name": "Jed Prouty",
               "profile_path": "/hK1xwv3xOmWBvdxQxmqiwHmtbPY.jpg",
               "id": 117783,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Parks (butler)",
               "gender": 2,
               "credit_id": "52fe47929251416c7509e4e7",
               "name": "Charles Arnt",
               "profile_path": "/tOvsmMKqnkKHk5El289Pm1bhW27.jpg",
               "id": 34416,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47929251416c7509e4db",
               "name": "George Marshall",
               "profile_path": "/i1FThWBJ62u2biOcrprrqRjAB9n.jpg",
               "id": 19093,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47929251416c7509e4ed",
               "name": "Walter DeLeon",
               "profile_path": null,
               "id": 233111,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.711196,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18702,
      "vote_count": 5,
      "budget": 0,
      "overview": "Jimmy, the owner of a failed music shop, goes to work with his uncle, the owner of a food factory. Before he gets there, he befriends an Irish family who happens to be his uncle's worst enemy because of their love for music and in-house band who constantly practices. Soon, Jimmy finds himself trying to help the band by getting them gigs and trying to reconcile the family with his uncle.",
      "similar": [
         335,
         10110,
         15392,
         13950,
         25698,
         43795,
         48392,
         21767,
         35452,
         271280,
         218097,
         391835,
         200951,
         178935,
         254670,
         209024,
         151854,
         515051,
         178870,
         276263
      ],
      "original_title": "Pot o' Gold",
      "runtime": 86,
      "poster_path": "/Mi5KGNflQjEwLmGfl2HuCanYhA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "James Roosevelt Productions",
            "id": 14807,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         }
      ],
      "release_date": "1941-04-03",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "It's the prize romantic laugh of the year... more fun than winning the POT O' GOLD!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["George Marshall"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Walter DeLeon",
         "Andrew Bennison"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0034055/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTg0MzgwNjk0Ml5BMl5BanBnXkFtZTcwNDAzMzU1MQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: James Stewart, Paulette Goddard, Horace Heidt | See full cast and crew »"],
      "reviews": [
         "James Hamilton Haskel (James Stewart) is a small-town kind of guy who'd much rather run his dad's music store and let kids practise the piano and trumpet in his shop than work for the Haskel health food business run by his Uncle Charley (Charles Winninger). Unfortunately, he's also got to eat, so he finally accepts Uncle Charley's offer of a chance to get to know the business better... only to turn up in town and immediately befriend the very musical McCorkle family, including Ma (Mary Gordon), who cooks for everyone in the band and takes care of them like a big mother hen; and Molly (Paulette Goddard). The McCorkles and Horace Heidt's band play swing music on the roof just next to the Haskel factory, which drives poor music-hating Uncle Charley completely batty. Ma McCorkle and Uncle Charley are bitter rivals, but the oblivious younger generation (well, Molly at least doesn't know that Jimmy is the Haskel Health Food heir) quickly become friends and (of course!) fall in love, thanks to a tomato misthrown, a doughnut shared and a harmonica rendition of 'Pete The Piper'. Jimmy decides to use his uncle's radio show, the Haskel Happiness Hour, to promote Molly and Horace Heidt's band, and hopefully heal the Haskel-McCorkle rift. This results in a hilarious sequence in which Jimmy has to convince Uncle Charley that the latter has gone crazy and hears all kinds of music through the vents and floors, on the phone and sees girls dancing in the garden... all to get him out of town. When Molly finally *does* find out that Jimmy is a Haskel though, she angrily announces on the air that the Haskel Happiness Hour would be giving away a thousand dollars every week--which infuriates Uncle Charley (listening in from Canada) and gets Jimmy in trouble... how to give the money away without making it a lottery? And how are the now bickering twosome going to get back together again? A musical is really the last type of movie you'd figure James Stewart to be in, but that's exactly what POT O'GOLD is... and oddly enough, it doesn't really suffer for it. All the songs, including the opening 'Hi Cy, What's Cookin'?', 'Pete The Piper' and 'Broadway Caballero' (with great vocals by Goddard), are toe-tappingly catchy and cute, and actually function quite successfully as an extension of the plot. I also really like the cutlery-banging number performed to initiate Jimmy into the McCorkle Clan, but am especially partial towards the rousing jailhouse singsong 'Johnny Toots His Horn'... which not only features Jimmy Haskel playing the harmonica, but also Jimmy Stewart singing! And he doesn't sound bad at all--it was probably a good choice to limit his singing voice to the one song, and use a song that fit his limited range well. Instead of appearing a fool, he comes off well, and one can actually believe that Jimmy Haskel's a music-loving, musical guy. My *favourite* number, however, is Molly's dream sequence to the sweet ballad, 'Do You Believe In Fairy Tales?'. As Molly drifts off to sleep and awakens to find herself dressed as a princess, she cranes her neck eagerly to look for her knight in shining armour, riding a white steed... and there he is! Or is he? In a self-consciously anti-climactic (and therefore truly hilarious) moment, Jimmy Haskel saunters in as... Jimmy Haskel. Same suit, same hat, same harmonica. He serenades her in Horace Heidt's borrowed voice, then twitches noticeably when she 'romantically' empties a bucket of flowers over his head. The scene is written and executed with tongue planted very firmly in cheek, satirising the romantic dreams of a young girl, while making a sweet but very subtle point that Molly loves Jimmy exactly as he already is. He doesn't need to be a knight in shining armour; he's just Jimmy. It's a point she forgets later (and finally learns again) when she discovers his last name is Haskel. It's a great song, a great scene, and Stewart is incredibly... well, the only word for him is 'cute'. That goes for pretty much the entire film--his character has, of course, the typical Stewart soft side, this time manifested in his love of music and his ability to connect with and touch others through its language. But there's a harder edge in Jimmy Haskel too, manifested by his willingness to pull the wool over his poor uncle's eyes, or when he's sniping rudely at Molly after they've 'broken up' (before ever really getting together!). Stewart ultimately creates a very real character, a sweet guy who isn't perfect, who isn't averse to a lie now and then, and more than willing to give as good as he gets. (It's Molly who starts the bickering: thumping him on the head and pulling him down the stairs to wake him up, spraying him with seltzer water--he only returns the final favour.) James Hamilton Haskel is no patsy, and no paragon of virtue... and Stewart gives him the charm and the aw-shucks demeanour Haskel needs to be plausibly taken into the bosom of the McCorkle family as he so quickly is. The rest of the cast is excellent as well, considering how much this really is Stewart's film (from screen time to performance)--Winninger is fantastic as CJ Haskel, the unreasonable tycoon whose hatred of music sets him up as the villain of the piece... it's a shame that he suddenly seems to be transformed into a new man at the end, though that could be explained by the lucrative prospects in the revamped radio show. Gordon makes a great Ma McCorkle, bustling, cheery, and most importantly, not annoying--however saintly and Irish she gets. Her raucous laughter is probably the key to remaining likable! Goddard also puts up a fine show: she's great when she's onscreen, and has a really good singing voice as well. POT O'GOLD really is an excellent film--not a classic, but excellent. It may not be everyone's cup of tea... but I personally don't think the film is uneven. It's meant to be funny, to be a little madcap, to be sweet. It's a romantic comedy told in musical form, just like SINGIN' IN THE RAIN, though certainly not on its level. In the end, it's just a film that makes you smile (from beginning to end), that stars James Stewart in his prime (which is very prime indeed), and that even sings to you--a language everyone can understand. In fact, its musical sequences are inventive, charming, and even genius in one case. If you're a fan of Stewart, this is definitely a film you'll want to watch--you'll be as pleasantly surprised as I was on discovering the charm of POT O'GOLD!",
         "If you are a fan of Jimmy Stewert, then this is a movie you will enjoy. James plays the person he does best, namely himself. A small town man trying to make it in a big business world. Throw in the gorgeous Paulette Goddard, and the chemistry is dynamic. If you don't enjoy musicals, this movie might not be for you. But the old time music is something that most will enjoy. Especially those of us who have an affinity for classic Hollywood.",
         "A really fun movie. The music was performed live in front of a camera, no overdubing. I was amazed at how well arranged, choregraphed and performed the pieces were. I only wish that the DVD master had cleaned up the sound more and brought out better frequency response. Jimmy Stewart was his usual charming self. Its hard to hate a movie with Jimmy in it. Even better, Jimmy actually sang and did quite well with the song. The first half of the movie had me laughing out loud!",
         "This movie was found in the dollar bin at Wal-Mart, and it couldn't be resisted, simply because Jimmy Stewart movies are worth watching, even oldies like Pot of Gold. Clear back in 1941 his trademark common man persona was much in evidence with this quirky little madcap comedy/musical. Considering this movie came just five years prior to It's a Wonderful Life, it's surprising it hasn't received more notice. The plot in a nutshell is that Stewart has to close up his music shop due to poor business, and goes to the city to go work for his cranky rich uncle. Along the way Stewart becomes involved with a band, a pretty Irish girl, thrown in jail, and could be arrested for running a illegal lottery. While there are plenty of madcap moments, honest understated humor, and delightful performances, it's the music that is absolutely incredible! Jimmy Stewart bluffs his way fairly incredibly on the harmonica and even sings a song. It may not have been his favorite movie, but it is still a Jimmy Stewart gem. Even if you have to pay more than a dollar to watch the movie, it's still a movie, especially for Jimmy Stewart fans, to find and enjoy. The dining room musical number is worth the rental fee alone (but dig through the Wal-Mart dollar bins anyway).",
         "POT O' GOLD is my wife's favorite Jimmy Stewart movie. Why? It was a love story in which the two man characters are transformed from what they had been in the beginning. I'm not giving away the ending by saying that Jimmy Haskell (Stewart) started as a music store owner and Molly McCorkle (Paulette Goddard) began as singer with a neighborhood band and they ended as\u0085 perhaps radio entrepreneurs would be one way of putting it. Family feud. The Haskells, represented by Jimmy's factory-owning uncle, vs. the McCorkles, represented by the lot of them. Uncle Haskell wants to purchase and destroy Ma McCorkle's boarding house to expand his factory. Ma McCorkle has her band playing on the rooftop, which drives Haskell batty. Jimmy has received a standing invitation to move in with his uncle in the city, keep the family name alive in the business, and he takes him up on it. He is sidetracked by Molly and the band, and he joins as the harmonica player. Stewart makes this movie. His expression, his mannerisms, his voice \u0096 without him, I think this film would have been ordinary. With him, it's a very good movie. My favorite Stewart? I prefer such as HARVEY (1950) and THE PHILADELPHIA STORY (1940), but there's nothing about which to argue with my wife.",
         "As a concert organist/pianist always interested in musicals I just discovered this movie five days ago (5-1-05). I was stunned by the musicality of the performers. These guys and gals could really sing and play...what a joy to hear fantastic intonation and real \"in tune\" singing. The boarding house number is easily one of the most beautifully done and also the most complicated. The guys really played the water glasses and I can tell you that trying to get crystal to play as a \"glass harmonica\" (invented by Ben Franklin) is no easy job. From start to finish a truly heartwarming film. From a more innocent era and one without guile. I laughed my self silly during the \"drive uncle Charlie crazy\" sequence. How anyone could not like this as pure clean fun is beyond me. Perhaps you are hearing \"Bugles on the phone\"...hahaha,",
         "Jimmy Stewart is Jimmy Stewart, in this film as much as in any. The hoofers, musicians, dancers and others are very typical and very good. Because of our impressions and biases, we expect something very different in a Jimmy Stewart film. This one is way beyond 'Philadelphia Story', on a scale that runs from that to, say, 'Rear Window'. This, however, is a very lightweight musical, to be considered closer to the 'Follies' films and shorts like the one about Catalina Island than such heavyweights as 'Carousel', 'L'il Abner' or 'Showboat'. It actually reads more like a cartoon script than any coherent, literary film such as 'Golden Caddillac', 'Animal Crackers' or 'Bringing Up Baby'. Speaking of the last, it is a pity that JS and KH did not work together more. The pace is frenetic ala Marx Brothers, the dance and musical numbers done very well and the emphasis is on having the minimum story necessary to string together the music. There is a subtle but very special scene, near the end, when Paulette Goddard goes to Jimmy's place to rouse him out and get him to the studio for the climactic radio show. It is not a musical number though there is a great deal of physical comedy in the scene. What makes it special special part is, without rhythm or music, that it is very clear that Paulette Goddard is dancing. The blocking, direction and her own talent shine. This one scene is worth the price of admission. With a story in the best tradition of American Musical Tradition, more talent per actor than many better known and better thought-of films, this is a very enjoyable diversion. I was constantly impressed with the tight writing and talent. Did I mention that the folks are good? It ain't 'Grapes of Wrath' but 'Pot 'O Gold' is well worth the watching.",
         "I have a Super 8 Sound print of this gem, and it has been an audience favorite for years at my \"Movie Nights\"-- no figuring out an involved, complicated plot-- Jimmy is a nice guy, Paulette is gorgeous, and the movie mesmerizes the audience with the corny comedy, predictable outcomes and more than memorable music (who can forget \"With a Knife, A Fork, and A Spoon\"?) This is Hollywood escapism to the Nth degree-- songs that work, sets that satisfy and a story line as simple as a Hallmark card, all of it embellished with two young and energetic stars surrounded by the musical genius of Horace Heidt and his crew. I haven't screened this one in years, but I plan to show it soon enough--a perfect example of why movies always beat reality.",
         "Pot o' Gold (1941) This is a rousing, fun, slightly goofy movie that has a couple important aspects if you actually watch it through. First, there is the persona of James Stewart in a pre-Wonderful Life role that must have influenced Capra in that 1946 film. Second, the war is winding up and here is a Big Band inspired kind of cheerleading about community and keeping a good face on things as the world falls apart. Director George Marshall clearly had a mandate from somewhere not to take this too seriously. Even as a musical, it's got some creaky story elements and a number of forced scenes. But it's the 1940s, and Hollywood has really learned how to crank out a good movie, so this one is fast, has some great musical numbers, and is tightly if conventionally filmed. Besides Stewart is Paulette Godard, who is an underrated natural, once upon a time Charlie Chaplin's wife (she had the starring role in \"Modern Times\"). It's also fun to see Stewart pretending to play harmonica--he's right on the with it, so he probably played pretty well. So, no great shakes here, unless you like that period music a lot.",
         "This is a nice little part for Stewart, he's the reason to watch it. Stewart's demeanor and delivery are a joy to watch and he delivers some great classic comic moments. The story has that Shakespearean comedy feeling: comedy driven by mistaken identity which ends in marriage. Some good color added by journeyman studio character actors. There's some nicely blended musical numbers which mesh naturally with the story ... then there's the big production number during the radio program which feels like it dropped in from another planet and during the boarding house initiation number, I kept worrying about the stew getting cold. Aside from the musical interludes, the story is tight and never loses its way, delivering comic payoffs all along."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["James Roosevelt Productions"],
      "summaries": ["Jimmy, the owner of a failed music shop, goes to work with his uncle, the owner of a food factory. Before he gets there, he befriends an Irish family who happens to be his uncle's worst enemy because of their love for music and in-house band who constantly practices. Soon, Jimmy finds himself trying to help the band by getting them gigs and trying to reconcile the family with his uncle, an avid music-hater, all while winning the heart of the beautiful Molly!"],
      "budget": 0
   },
   "movielensId": 3818,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1941-04-03",
      "dvdReleaseDate": "1998-01-01",
      "directors": ["George Marshall"],
      "runtime": 86,
      "movieId": 3818,
      "title": "Pot o' Gold",
      "mpaa": "",
      "actors": [
         "James Stewart",
         "Paulette Goddard",
         "Horace Heidt",
         "Charles Winninger",
         "Mary Gordon",
         "Frank Melton",
         "Jed Prouty",
         "Charles Arnt"
      ],
      "imdbMovieId": "0034055",
      "originalTitle": "Pot o' Gold",
      "genres": [
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Jimmy, the owner of a failed music shop, goes to work with his uncle, the owner of a food factory. Before he gets there, he befriends an Irish family who happens to be his uncle's worst enemy because of their love for music and in-house band who constantly practices. Soon, Jimmy finds himself trying to help the band by getting them gigs and trying to reconcile the family with his uncle.",
      "tmdbMovieId": 18702,
      "avgRating": 2.55952,
      "releaseYear": "1941",
      "numRatings": 42,
      "posterPath": "/Mi5KGNflQjEwLmGfl2HuCanYhA.jpg"
   }
}