{
   "imdb": {
      "country": "Austria",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hubert Sauper"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Hubert Sauper"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0424024/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0NjY4NTI4MF5BMl5BanBnXkFtZTcwOTA0ODU0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Elizabeth 'Eliza' Maganga Nsese, Raphael Tukiko Wagara, Dimond Remtulia | See full cast and crew »"],
      "reviews": [
         "Slavery, colonization, genocide and civil war have marked the history of Africa. In Hubert Sauper's powerful documentary Darwin's Nightmare, we witness the latest humiliation -- globalization, euphemistically called the New World Order. Darwin's Nightmare is about fish, specifically the Nile Perch in Tanzania's Lake Victoria, but the theme is the exploitation of the natural resources of one country for the benefit of others. In this case, 500 tons of white fillets are caught each day, then exported to Europe to feed two million people each day while the villagers who cannot afford the perch are forced to live on the heads and carcasses that the factories have discarded. While the film is about fish, Sauper explains that he \"could make the same kind of movie in Sierra Leone, only the fish would be diamonds, in Honduras, bananas, and in Libya, Nigeria or Angola, crude oil\". Because of over fishing, the Nile Perch was artificially introduced into Lake Victoria in the late 1950s but it was an experiment gone wrong. The Nile Perch became the lake's predator, destroying the existing species of fish, even devouring its young, and devastating the natural ecology of the lake. With the collapse of a stable economy, local fisherman and farmers became dependent on the export business and the result was famine, poverty, HIV, prostitution, and drug addiction. The director says, \"It is so incredible that wherever prime raw material is discovered, systematically the locals die in misery, their sons become soldiers and their daughters are turned into servants and whores\". The film does not rely on narration to tell its story. It is told by the Russian pilots who bring in munitions to feed wars in Angola and the Congo, then return to Europe with tons of fillets destined for European markets. The story is told by a prostitute who sings lovingly of Tanzania and dreams of an education, by a guard at a processing plant who earns $1 a day and hopes for his son to become a pilot. Armed only with a bow and poison-tipped arrows, he welcomes the thought of a war. We also hear from a Christian minister who buries local residents who died of AIDS but still refuses to recommend condoms because it is a \"sin\". All seem powerless in a system that worships the wrong values. One Russian pilot, hoping that one day all the world's children will be happy says: \"Children in Angola receive weapons on Christmas Day, European children receive grapes. That's business but I wish all children could receive grapes\". While some claim that the fish-packing operation raises the standard of living, the evidence is otherwise. Some may benefit but the workers earn starvation wages and the country is reported to be in the midst of a famine. Darwin's Nightmare takes a strong stand but does not preach even though its images are often painfully direct. One of the most memorable scenes is of an African woman standing in the sun among the rotting fish carcasses and maggots claiming that her life is better than others, even though one eye has been clearly destroyed by ammoniac gases. This isn't Darwin's nightmare, it's our own.",
         "There are no spoilers on this one, not even a hint about what you'll find in this movie. If you ask me, I would tell you to read on to the end of this text. You'll know how I felt, but not what the movie is about: you should see it unknowingly. Let it take you by surprise. For a very long time, no movie made me feel like leaving the theatre. But, having this policy of always giving the director a chance to either create a last-minute surprise effect or to prove himself ridiculous to an unspoken degree, I usually stay - even if I would vote zero for some. \"Darwin's Nightmare\" had me moving in my seat, sweating, swallowing nonexistent saliva, squeezing my hands into each other, thinking about all and nothing. Two times I simply had to close my eyes, many times I thought I had to get up and go - not that the documentary film was bad. Quite the opposite. Formally, it was too good. That's why it was so bothering. Maybe an overly emotional reaction, but we will all have different ones. Personally, this is the type of story I cannot dissociate of, and view as a spectator. This is the world, and this is tragic. Now: we all know it. We just didn't see it like this before. Not with this cutting-edge cruelty. I could feel the tension around me, the tension inside the theatre, the discomfort that it rose. Yet, the laughter that a few purpose-made cynical scenes originated hurt like knives. I couldn't believe people laughed in such a movie (and then again, I heard people laughing during \"Schindler's List\"!!). There is no reason to laugh. A few times, actually, there are plentiful reasons to cry. This movie hurts. It's poignant to the point of being unbearable. Sad. Tragic. Violent - the story is cruel, and Hubert is cruel as well. Or realistic. He does not make it one bit easier for the viewer. Rather is the viewer allowed to suffer, to sink in shame, to open his/her mouth in awe, to see reality, the dark reality of many places exactly as it is. Besides all, presented in a very intelligent format, and with a cunning sense of fairness and discipline. It was painful. It worked on me, and I only wished it would be over. Personally, this was no film, this was a severe blow in my stomach. I wonder how will it feel to those who actually have no idea about life... 10 out of 10. How could I give it less...?",
         "Darwin's Nightmare is a shocking look at how globalization has caused a country to condemn the majority of its starving population to slavery, prostitution and drug addiction while every day over-fed Europeans dine off of its vast stocks of Nile Perch. The setting is Lake Victoria, Tanzania, the world's biggest tropical lake, and the Nile Perch (artificially introduced by man) has voraciously destroyed every other species of fish unfortunate to cross its path. Most of those lucky enough to have jobs, fish on the lake and sell their catch to be exported far away to Western Europe. None of the locals can afford to eat the meat of the Perch themselves. They're reduced to scraping together some kind of nightmarish sustenance from the left over rotten fish heads (crawling with maggots) that wouldn't even make it into pet food tins for the west. Of course, prostitution, drug addiction and HIV are all rife. Everyone knows someone who has died from the 'virus'. Large groups of orphaned homeless children sleep rough on the streets at night. And just to ensure that this convenient state of affairs remains in place (and, of course, to make a nice tidy profit), the vast 'empty' cargo planes arriving from Europe actually seem to be (illegally) laden with weaponry to be sold onto the genocidal wars in Africa. The planes are then packed full of huge amounts of Tanzania's abundant supplies of fish (at times to the point that they're too heavy to take off), and flown back out of the country while the majority of its population face the bleak prospect of famine. This film is a real eye opener and is genuinely shocking. It should be compulsory viewing for anyone enjoying the privileges of the Western lifestyle.",
         "I find the earlier criticism laughable...and sad, in that we're so used to Michael Moore esquire films now that shove their meanings down our throats that when something comes along that makes you actually have to think...and draw your own conclusions, everyone is up in arms. Darwin's Nightmare is a look at the economic and social impact of one small decision made fifty years ago-the release of a bucket full of Nile Perch into Lake Victoria. Over time, these fish have eaten everything else in the lake, yet have also spawned a huge export business of whitefish fillets to Europe. The film records the huge cost this business has exacted on the Tanzanian community. They share in none of the profits and all of the consequences from a corrupt state, exploitation from overseas business interests and the collision of modern technology with a social infrastructure left in shambles by decades of war and poverty. Without commentary from the filmmakers, or the popular \"cut and paste\" bombast of so many current documentarians, we are forced to draw our own conclusions. There are no villains among the people we meet on screen, yet everyone plays their role in a desperate human tragedy. A real eye opener, maybe the closest many of us will ever get to the appalling conditions many endure the world over through no fault of their own save the place of their birth.",
         "This is a film that must be seen by anybody who is concerned about world issues. It is a real eye-opener that presents the situation in Tanzania exactly as it is. It doesn't make it easy for the viewer - the conclusion you come to is a painful one, after witnessing experiences that end up making you feel as though you are there with the characters. The full details of each issue are not explored, but this is not a problem as you come away with a thorough overview of the whole scenario, the visions of people from all perspectives having been represented. I especially liked the raw reality of the film; nowadays we are constantly presented with images of third world suffering that distance 'us' from 'them' - this film does not allow that sort of comfort thinking, but more highlights this issue as part of a colossal world injustice.",
         "It seems that a common critique of this film is that it lacks focus and asks questions but does not provide answers. Far from agreeing that this proves lack of skill in film making, I think this demonstrates the director's analysis and knowledge of the documentary form. I felt that the filmmaker was conveying Western complicity in this by leaving us to try to put the pieces together ourselves. We thereby actually have to THINK about what he is getting at and the role we have to play in this situation. There is no voice-over in this film, which we are so used to explaining the meaning of a story to us. I think a lesson is better learned when we draw the conclusions ourselves, rather than being blatantly told how to interpret information in a documentary.",
         "A documentary about poverty, globalization, the Nile Perch fish, Africa...and far more. I resoundingly agree with everything this documentary is ABOUT, but I wasn't altogether enthused about THIS documentary. Beginning with the case of the Nile Perch fish (which was introduced into Tanzania's Lake Victoria and subsequently eradicated all other species in the Lake), the film branches out into every direction imaginable. The film is essentially presented as an introduction to the ideas of capitalism and globalization, but doesn't introduce the viewer to anything beyond the surface, nor does it draw overt links between any of its ideas. Darwin's Nightmare attempts to use the existence of the Nile Perch as a case study exemplifying the ails of globalization, but doesn't do so very effectively. Granted, the film is emotionally raw and moving, and our theatre, too, sat in still silence as the credits rolled, however, a similar reaction could be gained if the World Vision television spot was played in the theatre. Powerful? Yes. A great documentary? No.",
         "How can we accept that people have to live in such conditions. I was shocked after seeing this documentary. And...this business is supported by the European Union. Unbelievable. The local people doesn't benefit at all. The planes are used to bring weapons into Africa ant to export fish. How immoral. Local people are starving from aids and hunger but no help is provides. Every day dozens of planes are landing but no help for the local population. It a real scandal. Why is there no reaction. The documentary is really useful to let us see the true about what is going on out there in Tansania. Everybody should see this movie and react.",
         "When the doc-movie was over people stayed in their seats for minutes in total silence. It's a hard movie that will shake your mind and heart in a terrible way. poverty, diseases, abuse, and a hopeless future. African people just don't deserve this present and future .....a story that happens now in too many places in the world were social structures are falling apart because of the international globalization of economics, were the rich get richer and the poor get poorer if that is even possible..... sad sad movie but anyone that want to keep his eyes open what is happening in the world should see.",
         "I saw this movie on the first Austrian public premiere. The director Hubert Sauper was present for a Q&A afterward. The general quality of this film is quite good. The documentary was filmed digital. Special care was taken with sound-design which is quite good. The film starts directly in Tanzania. The Nile Perch, a fish introduced into the lake Viktoria is slowly \"destroying\" everything. Not only on an ecological level but also economically. Interesting is the way the director understands his own movie. It's not so much the fiddling with nature (introducing a foreign fish was a big risk) but the way that wealth changes everything. Since the fish is quite expensive, local people cannot afford it. Expensive goods need to be protected, so weapons need to be bought. Don't get me (or the director) wrong. As he explained in the Q&A he doesn't want everyone to stop eating fish, but we should look at it more globally. Every time something expensive is found (oil, gold, diamonds, fish, ...) the whole region around it is changed. Some people get rich, but most get poorer than they already are. Before the Nile Perch people could live a life. Now everything revolves around fish. Prostitution often is the only way for a woman to make money. Aids is everywhere, and eats away the work-force. Education is nearly non-existing. The most perverted thing, according to director Hubert Sauper, is, that the EU found out in study, that people in Tanzania are missing protein in their diets. So we sent shipments of protein pills down. But the protein-rich fish gets taken away, because we can pay high prices, and destroy the local market. After the Nile Perch destroys the lake (canibalism), there will be a blue desert left. And humanity will move on to destroy something else."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Mille et Une Productions",
         "Coop 99",
         "Saga Film (I)"
      ],
      "summaries": [
         "The larger scope of the story explores the gun trade to Africa that takes place under the covers -- Russian pilots fly guns into Africa, then fly fish back out to Europe. The hazards and consequences of this trade are explored, including the pan-African violence propagated by constant flow of weapons into the continent. If it is a \"survival of the fittest\" world, as Darwin concluded, then the capitalist interests that fund the gun runners are climbing the evolutionary ladder on the backs of the Africans in this stark Darwinian example. Much like the foreseeable extinction of the Lake Victoria perch, and death of Lake Victoria itself, the Africans are in grave jeopardy, even as they survive in the only ways they know how.",
         "In the 1950s or 1960s, the Nile perch was released into the Lake Victoria. In just a few decades, the large, voracious predator has all but eliminated the other species of fish, turning the lake into an ecological wasteland. \"But economically, it's good\" -- and indeed, perch fillet is Tanzania's best selling export to Europe. Fishermen, factory workers, civil servants, pilots of cargo aircrafts, delegates of the European Commission, communities living around Lake Victoria: plenty of people are involved in some way in this new industry. But if Africa exports hundreds of tons of premium-priced fish each day, what exactly do Africans get in return?",
         "A documentary on the effect of fishing the Nile perch in Tanzania's Lake Victoria. The predatory fish, which has wiped out the native species, is sold in European supermarkets, while starving Tanzanian families have to make do with the leftovers."
      ],
      "budget": 0
   },
   "movielensId": 38198,
   "movielens": {
      "languages": [
         "English",
         "Pусский",
         "Kiswahili"
      ],
      "releaseDate": "2005-01-20",
      "dvdReleaseDate": "2006-07-26",
      "directors": ["Hubert Sauper"],
      "runtime": 107,
      "movieId": 38198,
      "title": "Darwin's Nightmare",
      "mpaa": null,
      "actors": [
         "Elizabeth 'Eliza' Maganga Nsese",
         "Raphael Tukiko Wagara",
         "Dimond Remtulia",
         "Marcus Nyoni",
         "Sergey Samarets",
         "Jonathan Nathanael",
         "Msafiri 'Safiri' Habat",
         "Dima Rogonov",
         "Vladimir Tarasenko",
         "Jura Biriuchev",
         "Stanislav Ivanchenko",
         "Jakob Maiseli",
         "Lalit Malhotra",
         "Shadard Mkono",
         "Cleopa Kaijage"
      ],
      "imdbMovieId": "0424024",
      "originalTitle": "Darwin's Nightmare",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Darwin's Nightmare is a 2004 Austrian-French-Belgian documentary film written and directed by Hubert Sauper, dealing with the environmental and social effects of the fishing industry around Lake Victoria in Tanzania. Some time in the 1960's, in the heart of Africa, a new animal was introduced into Lake Victoria as a little scientific experiment. The Nile Perch, a voracious predator, extinguished almost the entire stock of the native fish species. However, the new fish multiplied so fast, that its white fillets are today exported all around the world. This booming multinational industry of fish and weapons has created an ungodly globalized alliance on the shores of the world’s biggest tropical lake: an army of local fishermen, World bank agents, homeless children, African ministers, EU-commissioners, Tanzanian prostitutes and Russian pilots.",
      "tmdbMovieId": 10700,
      "avgRating": 3.58738,
      "releaseYear": "2005",
      "numRatings": 103,
      "posterPath": "/1kEbQOvBqw52ssUEC2eazOKo9Np.jpg"
   }
}