{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0165986",
      "video": false,
      "title": "The Tic Code",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Miles",
               "gender": 2,
               "credit_id": "5397182d0e0a266dce0095ee",
               "name": "Chris Marquette",
               "profile_path": "/kKunkk6VksTnXGj0iK5MNqbYhBt.jpg",
               "id": 59238,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Laura",
               "gender": 1,
               "credit_id": "539718430e0a266dbb00973c",
               "name": "Polly Draper",
               "profile_path": "/1zViE8Kn2i6Idg2uOMJOnptRwnj.jpg",
               "id": 114470,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Miss Gimpole",
               "gender": 1,
               "credit_id": "539718540e0a266dbf009617",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Todd",
               "gender": 0,
               "credit_id": "539718640e0a266dce0095f6",
               "name": "Desmond Robertson",
               "profile_path": null,
               "id": 1329538,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "539717ee0e0a266dbf009608",
               "name": "Gary Winick",
               "profile_path": "/9gzk1OptV4rlvEgPFQo9pC0TUYV.jpg",
               "id": 17046,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "539718010e0a266dbf00960a",
               "name": "Polly Draper",
               "profile_path": "/1zViE8Kn2i6Idg2uOMJOnptRwnj.jpg",
               "id": 114470,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [],
      "popularity": 0.421855,
      "production_countries": [],
      "id": 274868,
      "vote_count": 1,
      "budget": 0,
      "overview": "A 10 year old gifted boy wants to be a jazz pianist much to the chagrin of his more classical oriented piano instructor. With his mother's help, he is an underage regular at a local nightspot, where he is teamed up with a sax superstar. Both come to learn that each suffers from Tourette's Syndrome (thus the film title). The older man has developed mannerisms to cover up his own fallibilities and resents the boy and his mother's acceptance of the disease.",
      "similar": [],
      "original_title": "The Tic Code",
      "runtime": 91,
      "poster_path": "/8R03pVm4ECjvITfZ7JKyvFIM49r.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-06-01",
      "vote_average": 1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gary Winick"],
      "runtime": 91,
      "synopsis": "The difficulty with providing a synopsis for THE TIC CODE is in describing the frustration and anger that always seem to run hand-in-hand with Tourette's Syndrome, one of the most misunderstood neurological conditions known to modern man -- all of which, in itself, is the problem behind this great story. I say great story, because every 'come-back-from-being-deep-in-despair' story is usually so remarkable, so unimaginable, that no one who is totally unfamiliar with the condition honestly has little to no chance of relating to what the characters are experiencing and going through. This incredible 10-year-old being portrayed here, not only demonstrates that one can come back, despite the ridicule, embarrassment, and absolute minute-to-minute suffering he endures, but that he can excel in something as complex and seemingly impossible as focusing on playing piano well. Not only does he play well, but he demonstrates playing jazz piano superbly -- which requires total concentration and focus -- and imagination to be able to conceal the loss of control of his hands and eyes once the syndrome begins to take over -- always under times of stress. No one can do that, yet he knows he must, and has every reason to want to. Watch this performance with your eyes open to the difficulty, as well as your heart bursting with his great accomplishment, and you'll see how great life can be-- regardless what medical condition you have.",
      "writers": ["Polly Draper"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165986/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNzEwNjMzM15BMl5BanBnXkFtZTcwMzk2NTkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Marquette, Polly Draper, Carol Kane | See full cast and crew »"],
      "reviews": [
         "This movie meant a great deal to me. I have Tourrette Syndrome -- no two cases are alike and the way it impacts each life is different -- but the two Tourretters in the story humanized the funny movements and grimaces that have been with me all my life. I didn't get a correct diagnosis until I was 30 and then chose to not take medication so I can keep my personality. It would be great if the filmmakers come across this. I'd like them to know how much this meant to me (and I'm sure lots of other people with Tourrettes and their families). Plus, it was nice that Gregory Hines got this multifaceted role to play -- I will miss him, he was a performer with class. And BTW isn't it nice that there are still a few movies about human beings without things blowing up or bimbos taking off their clothes?",
         "Polly Draper (who wrote this and co-stars) can be truly proud of this effort, a beautiful and deeply felt labor of love. Brilliant performances from the always-sublime Gregory Hines and Chris Marquette, who portrays the young Miles with breathtaking believability; he does not hit a false note in the entire movie, and his scenes are not easy, which is an understatement. Never wallowing in sentimentality, the film maintains a gritty, soulful tone throughout. Highly recommended.",
         "\"The Tic Code\" tells of a boy (Marquette) with Tourette's syndrome who plays jazz piano and makes friends with a professional sax player (Hines) who also has the affliction. A well crafted, earnest, and honest effort, the film would appear to be a labor of love as, according to IMDB.com info, Draper, who wrote the screenplay and played the boy's mother, is married to a jazz musician with Tourette's (who has a bit part in the movie). The film features solid performances by all with an exceptional job by Marquette, some good jazz music, and insights into the tic fraught life. Unfortunately, The Tic Code is not likely to be as commercially successful as it should because Tourette's pales in comparison with terminal cancer, for example, and will likely seem little more than a mildly troublesome disorder to a jaded public. Kudos to all who supported this worthy project.",
         "You've got to admire a director who can take real life and keep it real on the big screen, and at the same time produce a wonderful, funny and touching film. With The Tic Code, Gary Winick has done just that. This will be the most realistic movie about Tourette's Syndrome you will ever see. It totally hit home as I was constantly reminded of my childhood. Other kids laughing and making fun, and me feeling alienated because of my supposed abnormality. This movie does a great job in displaying people's ignorance about the subject. Those who have simply seen the episode of L.A. Law which featured a witness with severe Tourette's, don't know the story. If you see this movie, you'll be all the wiser, and you'll be treated to a great film at the same time. This movie gets 4 stars.",
         "I was late to this movie and only caught the last half, so I stayed at the theater and watched it again. On the surface, it is a well-acted, poignant story of a single mom, her son with TS, and her romance with a man with TS. Both guys are brilliant jazz musicians. Much of the film is about the pains of coping with TS (with occasional bright spots), and the tics and emotions are very realistic. However, anybody could easily substitute TS with an affliction that constantly causes ridicule, isolation, anger, and bitterness, and embarrassment; an affliction that prevents a person from living a so-called \"normal\" life. As a 24-year-old Touretter, the movie just struck me right to the heart, because I was watching myself on film. (The part when the kid faces his father hit me the most.) I could see myself in all three characters: a mother who is frustrated and helpless at helping her son cope with TS (my fears of having kids w/TS), a talented young boy and his self-hatred and despair from having this uncontrollable condition, and the older man and his refusal to confront decades of being thought of as a \"weirdo.\" I admit that I was crying for most of both showings. TS is by no means the worst medical problem in the world, but its internal conflicts can be very destructive, and they are usually invisible to the outside world, which is quite an ironic juxtaposition to its obvious visible traits (the tics, and the excess and often humorous/gifted energy). This movie does a good job of showing what Touretter's face every single day. On the 45-mile drive home afterwards, I was just numb. Maybe I was all cried out. Or maybe it was a brief catharsis. Or, maybe, I just wanted some... peace, before the next storm of tics. -d.",
         "I saw this movie last night, missed the beginning, but came into it about 1/2 hour into it. I absolutely loved it. I thought Gregory Hines and Polly Draper had such on screen charisma. The story was really touching too. It made me want to read more about the effects of Tourette's Syndrome. I can't wait to see it again. I also loved the music from it and will look for a soundtrack.",
         "Which would you rather: Titanic or The Tic Code? They were both on at the same time, and I chose the latter, a made for premium cable movie, which means it will be available for rental sooner or later. If you like good acting and good jazz, this one's for you. The kid is amazing in his portrayal of a kid (go figure) with Tourette's. It's your typical 'freaks are people too' movie, but that doesn't mean it's not good. It's very well done. It intrigues me that maybe Thelonious Monk had Tourette's too. He's probably my favorite pianist. OK, take out the probably. But I saw that this is listed under the \"children's\" genre. Not that I'm saying it isn't good for kids, but it's also good for adults. By the way, watch all the way to the end of the credits. It's worth it.",
         "Polly Draper deserves accolades for this incredible movie! She manages to give viewers a look at what life is like for those of us with TS (Tourettes' Syndrome) without getting maudlin. I discovered as an adult that I had TS when I took my sons to the neurologist because of their tics. It was almost a relief to know that there was a medical reason for the odd movements and noises I made growing up. Watching what this family goes through because of TS brought me to tears many times during the movie. I saw Miles go through the same physical and emotional traumas that I've seen my own sons go through daily in public. Well meaning but uninformed people have made some very hurtful comments about my childrens' tics. Fortunately for my sons TS is better understood than when I was a child. This movie gives a true portrayel of the ramifications TS has on a family. The increased stress, the friction between the parents, parents and school personnel, not to mention the heartbreak of having a loved one picked on or made fun of because they are different. She touched on a lot of the problems TS can cause but managed to show that TS can also have good consequences. Increased creativity, more energy, compassion for others who are different - these are the highlights. I recommend this movie to anyone with a family member with TS. Not only does it shed some light on the Syndrome, but it is full of great jazz music. Last but not least, Gregory Hines and Christopher George Marquette gave stunning physical performances.",
         "Set against a jazz background in New York City, this is one of those wonderful little films that make chasing films in the video store or on cable worth the effort. The principles are all excellent and the supporting cast is superb. And it has it all; humour, pathos, love, drama, even belly laughs. There is a feeling for music, jazz and individuals that is reminiscent of some 80's films out of Canada.",
         "Chris Marquette's portrayal as Miles, a 12 year old musically gifted boy with tourette's syndrome, is nothing short of an academy award. A genuinely superb performance in his remarkably unique skills and poise as he masters each scene with precise brilliance and realism. The natural acting talent by this young actor is something to absolutely admire and his grainy and full dimensional performance is so captivating that you actually feel his emotions (pain, despair, sadness, rejection, anger and happiness) as you watch this film. The film should click with family audience since its about overcoming personal obstacles, enjoying life, and helping each other. Director Gary Winick provides a frothy mix of lifelike tones and never allows the story to desolve into schmaltz or wallow in atonal sap by making it far more lively and less schematic than the standard disease-o-the-week scenario. Great plot and development through the film."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Gun for Hire Films",
         "Jazz Films Inc."
      ],
      "summaries": ["A 10 year old gifted boy wants to be a jazz pianist much to the chagrin of his more classical oriented piano instructor. With his mother's help, he is an underage regular at a local nightspot, where he is teamed up with a sax superstar. Both come to learn that each suffers from Tourette's Syndrome (thus the film title). The older man has developed mannerisms to cover up his own fallibilities and resents the boy and his mother's acceptance of the disease."],
      "budget": 0
   },
   "movielensId": 3853,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-06-01",
      "dvdReleaseDate": "2001-02-27",
      "directors": ["Gary Winick"],
      "runtime": 91,
      "movieId": 3853,
      "title": "The Tic Code",
      "mpaa": null,
      "actors": [
         "Chris Marquette",
         "Polly Draper",
         "Carol Kane",
         "Desmond Robertson"
      ],
      "imdbMovieId": "0165986",
      "originalTitle": "The Tic Code",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A 10 year old gifted boy wants to be a jazz pianist much to the chagrin of his more classical oriented piano instructor. With his mother's help, he is an underage regular at a local nightspot, where he is teamed up with a sax superstar. Both come to learn that each suffers from Tourette's Syndrome (thus the film title). The older man has developed mannerisms to cover up his own fallibilities and resents the boy and his mother's acceptance of the disease.",
      "tmdbMovieId": 274868,
      "avgRating": 3.15385,
      "releaseYear": "2000",
      "numRatings": 52,
      "posterPath": "/8R03pVm4ECjvITfZ7JKyvFIM49r.jpg"
   }
}