{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0233687",
      "video": false,
      "title": "The Eyes of Tammy Faye",
      "recommendations": [],
      "backdrop_path": "/yjOidC4C4XktvIAWKQwrDuA2Okw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "5a92c4af0e0a2616c601f97a",
               "name": "RuPaul",
               "profile_path": "/gNwa8c7XmYWXxa0i9fGF3OXazL4.jpg",
               "id": 78589,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 0,
               "credit_id": "5a935bc70e0a265c4e01439f",
               "name": "Tammy Faye",
               "profile_path": null,
               "id": 1213096,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5a935bfb9251414171026b62",
               "name": "Jim Bakker",
               "profile_path": null,
               "id": 1244152,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46709251416c750785c5",
               "name": "Fenton Bailey",
               "profile_path": null,
               "id": 16957,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46709251416c750785cb",
               "name": "Randy Barbato",
               "profile_path": null,
               "id": 16958,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a935c7ec3a36824f6027849",
               "name": "Sandra Chandler",
               "profile_path": null,
               "id": 1375596,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5a935ca20e0a2616cc02b006",
               "name": "James Harry",
               "profile_path": null,
               "id": 32601,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.166753,
      "production_countries": [],
      "id": 15665,
      "vote_count": 3,
      "budget": 0,
      "overview": "A documentary look, mostly through the eyes of Tammy Faye Bakker Messner, at her rise and fall as a popular televangelist with husband Jim Bakker.",
      "similar": [],
      "original_title": "The Eyes of Tammy Faye",
      "runtime": 79,
      "poster_path": "/A5DsZWRJZxZTswlFKX7Ix6X04wq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-01-25",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Fenton Bailey",
         "Randy Barbato"
      ],
      "runtime": 79,
      "synopsis": "This was very fair and balanced portrayal of Tammy Faye and Jim Baker. They come across as decent but misguided people, who made some terrible mistakes in life. As their own Holy Jesus would say- \"Let those amongst us without sin, cast the first stone.\" In retrospect, Jim and Tammy seem more worthy of respect than their con-man contemporaries from the 1970s/1980s and also the current crop of born-again crazies. They pulled off some outrageous stuff, and were over the edge in many respects, but I don't believe they actually willfully tried to swindle people and such. This documentary also provided some insight into how they themselves were conned, duped, burned, and swindled, by such \"honest and respectable\" Christians as Pat Robertson, Paul Crouch, and His Holiness, Jerry Falwell.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0233687/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NTU0Mjc0M15BMl5BanBnXkFtZTcwMTI2NTc0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: RuPaul, Tammy Faye Bakker, Virginia Fairchild | See full cast and crew »"],
      "reviews": [
         "We rented this mainly because we like documentaries and this was supposed to be a good one. I was very impressed, and also moved. I remember not being able to stand the sight of this woman back in the 80's, and being extremely satisfied when the Bakker's empire crumbled very publicly. Maybe I just got sick of hearing about them, and the media did not exactly paint a flattering portrait. I started out this movie feeling pity for Tammy Faye, but began to admire her as it went on. I had no idea she was gay-friendly way before it was fashionable to do so(and even now, I don't think there are too many gay-friendly televangelists), and had no idea she had a TV talk show with an openly gay co-host. Not to make media headlines for being 'daring', either. With many other celebrities, you get the feeling they figured out, \"Hmmm, gay men seem to really love me, I think I'll use this and cash in on it\". With Tammy it's clear that she is not calculating at all but just a very friendly person with no prejudice. The movie, narrated by RuPaul, chronicles her life, and gives her side of the story of the scandals. There are interviews with her current and ex-husband, and many of her friends, people she worked with, and biographers. The film includes great archival footage of her early television shows (if you think she has big hair *now*, just wait) to her later ones. The movie is divided up into chapters that are introduced with sock-puppets (this is not as ridiculous as it sounds, though the movie has plenty of humor). In one scene Tammy confronts a reporter who wrote a very unflattering, and Tammy says untrue, book about the PTL Empire. This and several other scenes are hard to watch (though it's fun to see the reporter stammer when Tammy asks him point blank why he printed lies about her). In another scene I felt like watching through my hands over my eyes, during a point in her life when she was addicted to prescription drugs, we see Tammy sort of wandering off in the middle of a broadcast to remark on the backdrop, pretty whacked out. When I found out the circumstances that led to her doctor prescribing something to calm her down, I wasn't disgusted but more surprised that she wasn't taking every narcotic she could get her hands on at the time. I remember thinking back in the 80's that anyone who walked around looking like Tammy and carrying herself confidently was out of their mind, or at best, delusional. At some point during the movie- probably a scene where she cheerfully pitches ideas for TV shows to someone probably 20 years younger than her at the USA Network (you get the feeling maybe he won't make fun of her as soon as she's out the door, but it's easy to imagine him having a good laugh with someone he knows later as he tells them about his encounter)- I realized she is just, well, being herself. She knows that her heavy eye makeup is \"her trademark\", and is proud of it. Let's face it, it takes real guts for this woman just to walk down the street when most people consider her a punchline, a cartoon, a freak, or all three. She is not a stupid woman and knows this, but holds her head up high anyway, and carries herself proudly. How many people would be brave enough to do that? I never thought I'd say this, but after seeing this, I have a newfound respect for Tammy Faye. If the film-makers intentions were to have people view the subject of their documentary in a different light, then they did an excellent job, and I don't have any complaints about it at all. I would recommend it to anyone who wants to know more about Tammy (even if only out of morbid curiousity, like I did at first) and loves a fascinating, touching documentary. Be sure to wear waterproof mascara when watching it, though.",
         "First, I'm not religious and I always thought Jim and Tammy Faye were pathetic scam artists. I knew, of course, about the scandals involving them and their ministry. What I did not know, and what this film chronicles, is how the Bakkers invented televangelism with not one but three different networks, each of which was stolen from them by other televangelists. Jerry Falwell comes across exactly as the kind of person I have always suspected him to be: a schemer, a traitor, and a con man. Jim Bakker may not fare much better in the film's view (though Tammy still defends him). It is Tammy Faye herself who is the revelation, though. I did not know of her true compassion for groups that Christian ministries still vilify today (AIDS victims, gays, the poor, etc.). I never expected to find myself actually sympathizing with, and even liking, the fun-loving, vulnerable Tammy Faye. This is not some propaganda film, but a warts and all profile by respected filmmakers. The narrator is famed drag queen RuPaul Charles, which underscores just how surprising this film is. I'm not saying I'd like to hear Tammy Faye sing, but after watching this engaging film, I wouldn't mind living next door to her.",
         "In a year where its easier to form a ten worst list than a ten best list, \"The Eyes of Tammy Faye\" is a breath of fresh air in an otherwise stale landscape of formulaic, uninteresting, and generally BAD productions made by the Hollywood machine. But, \"Eyes\" is more than simply the recent Biography of Tammy Faye on the big screen. No no no! \"The Eyes of Tammy Faye\" tells a solid story about a family's reversal of fortune, and one woman's really hard struggle through a life which is far from being complete. And the best (or worst, depending on who you are) part is, its a true story. There aren't any plots to \"buy in to\" or any storylines that make you go \"huh?\". For the most part, the story is very first-person, although Drag Queen Ru Paul Charles helps us along in times when the story needs that next advance. Its a documentary which reads more like a movie... and, as one IMDB reviewer has already said, you laugh, you cry, you NEED the waterproof mascara. The filmmakers, whilst it appears at time are getting their kicks out of putting Tammy Faye on the big screen, are (for the most part) sincere in their telling of the tale. They treat Tammy Faye with dignity, but also acknowledge a certain \"kitsch\" there is to the whole PTL saga. Whether you love her, hate her, or are totally uninterested in her, \"The Eyes of Tammy Faye\" will bring you closer to Tammy Faye, and provide golden nuggets of insight in to who she really is as a person. In the end, you leave feeling ashamed... she's no different than anyone else, trying to carve out their mark in the world. And if you feel that, if you can immerse yourself in split-seconds of guilt throughout the film, the filmmakers have accomplished their goal. She is no longer an enigma... she is human. She is, Tammy Faye. 10/10",
         "The recent and untimely death of Tammy Faye was both unfortunate and sad. Whatever faults and foibles she may have had, she was an inspiration to millions of down-home folks, a person who seemed genuinely loving, someone who wanted to reach out and hug everyone she met. There are very few religious fundamentalist leaders whom I would describe in those favorable terms. \"The Eyes Of Tammy Faye\", a documentary about the little lady with the big eyelashes, the running mascara, and the child like voice, likewise presents a woman who was sincere, surprisingly intelligent, energetic, persevering, and of course ... emotional. It's a worthwhile film to watch. In the film she describes herself as \"a small town girl, at heart\", ironic, given the opulent lifestyle she led with former hubby Jim Bakker, during the heyday of their electronic church empire in the 1980s. Much of the film covers her view of that era; and she has words that are none too flattering about the oily Jerry Falwell, a view that is almost certainly justified. One of the traits about Tammy Faye that I liked was her genuine compassion for unpopular people and causes, especially gays. In the film she makes it clear that she does not morally judge others. \"I don't label people ... We're all just people, made out of the same old dirt; and God didn't make any junk\". How many other fundamentalist leaders have that kind of heart and soul? Through all the heartache and suffering in her life, she maintained a good outlook. \"You cannot go forward looking in the rearview mirror of your life; just drop it all, and move on; it's the only way in life that you'll ever find peace, joy, and victory\". Wise words indeed. She was a one-of-a kind person, someone unique in popular culture. She will be remembered for that reason. Yet, underneath all the gobs of makeup, and quite aside from her flair for showmanship, she was a person of humanity, love, and compassion, and as such, a credit to the human race.",
         "..and Tammy Faye through ours. Saw this tonight and it was so deliciously campy and downright funny ! TF is an accidental hoot most of the time as she takes herself so seriously and it is impossible for the audience to do so. I mean anyone who looks at the camera with 2 inches of industrial strength make-up on and says in all seriousness that she likes things real and natural is an unintentional standup comic. Did not like the gimmicky hand-puppets intro to each segment of the Jim and TF sorry saga. Liked how this gutsy, never say fail woman comes across, there's a naivete and sadness to her tackiness coupled with her real devotion to the lord. You just have to like her by movie's end.",
         "This film opens with RuPaul Charles asking, `Whatever happened to Tammy Faye?' Over the next hour and nineteen minutes you find out her past and present but the future is left a blank. Almost the first words out of her mouth is her reciting some bad poetry \u0096 her own. You also learn she buys her makeup at swap meets! As she says, `Puppets started it all.' And the theme is carried out through the entire film with puppets introducing each segment. She married Jim Bakker, appropriately enough, on April Fool's Day. This becomes eerily omniscient as this incredible documentary unfolds. You will learn a lot about the life and times of Tammy Faye's existence in the `Electric Church' a term she uses herself to describe the televised evangelical preaching of her and her husband and how they were squeezed out of every project they started together; that April Fool's curse again. I believe this film really tries to give a balanced perspective on her trials and tribulations \u0096 but you walk out of the theater with a certain amount of sympathy for all she has gone through and her ability to survive if not exactly flourish. Her very \u0091un-Christian' views about gay people show an amazing amount of personal integrity and strength. While it may seem that she is shallow and lives on the surface it becomes obvious that she has an inner core of faith and belief in what is right that runs deep through the center of her being. It is obvious towards the end of the film she must have a great deal of personal magnetism that, in spite of her ever-tearful visage, must carry most strongly when you meet her in person. The interviews with her multi-pierced son and the daughter who ran away from home when the scandals erupted are particularly poignant. This documentary has Oscar nomination written all over it and it is well worth both your time and money to see it.",
         "I had no idea what to expect from this documentary about the life of the recently deceased Tammy Faye Bakker/Messner. Back in the '80's my wife was a fan of the Bakker's; I never was. I never cared for their glitzy, showy style of ministry and I never cared for the constant appeals for money, money and more money or the theology that seemed to say that if you didn't have a lot there was something wrong with you. Having said that, I can't deny that their ministry had a positive effect on many people even though I was largely revolted by it. So, I watched this out of curiosity. Tammy Faye is, after all, a fascinating person; one who has stepped out of what would normally be thought of as the traditional \"fundamentalist\" circles to embrace a variety of people as personal friends, from homosexuals to porn stars while still identifying herself very much as an evangelical Christian. For that, she deserves applause. Narrated by drag queen RuPaul Charles (which says something about the esteem in which Tammy Faye is held in circles not normally friendly with evangelical Christianity), the documentary is very friendly to Tammy Faye, and it certainly exposes the sordid side of the ultra-wealthy and ultra-powerful Christian broadcasting community. (I don't like to speak ill of the dead, but Jerry Falwell - who I also never liked a bit - comes across here as a mean-spirited, power-hungry hypocrite, and that's being kind as well as probably true!) The first half of the documentary deals with the rise of Jim & Tammy's PTL Ministry and the problems that caused for them even while it was becoming a huge success. Speaking as a pastor, I must confess to a certain amount of sympathy for the televangelists. No one goes into ministry expecting to become rich and powerful, and when that happens to a very few, those very few probably get more easily overwhelmed by it and caught up in it than those who've planned for wealth and power all their lives, simply because it's so unexpected and they're so unprepared for it. The documentary certainly shows that trap overcoming Jim Bakker (and, to a lesser degree - perhaps because it's filmed from her perspective - Tammy Faye.) I found the PTL story both fascinating and tragic. The second half of the movie documents Tammy Faye's life post-PTL. It's an impressive story of a woman learning to stand on her own and overcoming some pretty big odds to do it. The story only goes as far as her second husband Roe Messner's release from prison after serving two years for bankruptcy fraud, so there's nothing about her spin on \"The Surreal Life\" or her final days before her cancer finally took her life. Tammy Faye was a fascinating person. Even those who weren't fans of hers can enjoy and appreciate this film. I know that because I wasn't a fan and I did enjoy this. The only truly irritating part was the puppets who introduced each segment! Losing a mark also for being obviously biased, I still give this an 8/10.",
         "This documentary made me sad...sad in a supportive way. I am neither a religious person nor a heathen so I am commenting on this from an entirely neutral position. Tammy is darling...naive, perhaps, I tend to think so. Her sincerity reeks from every eyelash...this gal has no holds barred. From puppets to the pulpit I truly believe she was the epitome of sincerity. Seems I keep using the word SINCERITY. This documentary was made in 1999 and the small batting-eyelash-gal was alive. Before I previewed this great documentary I had seen her on TV reckoning with her cancer treatments....she even threw-up on camera...quite a feat for a vain woman. Ya know, I bet if this gal were touting GOD on her own show whether with or without puppets, her message would have been delivered and received completely with, here's that word again, sincerity.",
         "I was familiar with Jim and Tammy Faye before their downfall. Heck, I might have even sent a contribution to the 700 Club. I seem to remember having a 700 Club pin. But, that was another life, so this film was a trip down memory lane for me. What was interesting was the insight into the machinations of Jerry Falwell and Pat Robertson. It is clear from the film that they have more love for themselves than they do for the god they profess to believe in. That is not surprising to me, but it will be revealing to others. Despite, her outrageous makeup, Tammy Faye comes off here as a genuinely warm and loving person. I was especially touched by her acceptance of gays and her comment that \"God doesn't make junk.\"I wish other so-called \"christians\" would take note. A good documentary.",
         "There's not a lot to say about The Eyes of Tammy Faye other than it is pretty entertaining in the way that People Magazine can be entertaining once in awhile. Watching her rise as the wife of an evangelist (their `hook' as it were, was to create a puppet show to spread the word of god, if it can be believed) and turning into a pervasive public icon was interesting, and the research was pretty decent. Unfortunately, I expected to watch this film and just shake my head and laugh, but this was hard to do since she seems to be just so damn `nice'. I found myself actually feeling sorry for her because behind this gruesome mask of cosmetics, she seems to actually be a pretty down to earth and nice person. The whole documentary has a camp feel to it, however, from the dog hand puppets announcing each `act' to the narration by RuPaul. I wouldn't say that this is a hard-hitting piece of investigative filmmaking in the slightest, but it is definitely a step above the standard celebrity profiles and biographies on television, and above all, fairly entertaining. --Shelly"
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": [
         "Cinemax",
         "FilmFour",
         "World of Wonder"
      ],
      "summaries": ["A documentary look, mostly through the eyes of Tammy Faye Bakker Messner, at her rise and fall as a popular televangelist with husband Jim Bakker. Traces their rise: her teen marriage to Jim; their children's TV show (she was a puppeteer and singer), success founding the 700 Club, co-founding the Trinity Broadcast Network, and starting PTL Network; her nondenominational version of Christianity reaching out to all; and, their building of Heritage USA, a theme park. Things fall apart as money woes mount for Heritage and for Jim, as Tammy takes pills, and as Jerry Falwell takes PTL. Jim goes to prison; she remarries, finds herself alone again, yet remains unsinkable."],
      "budget": 0
   },
   "movielensId": 3859,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-25",
      "dvdReleaseDate": "2001-01-30",
      "directors": [
         "Fenton Bailey",
         "Randy Barbato"
      ],
      "runtime": 79,
      "movieId": 3859,
      "title": "The Eyes of Tammy Faye",
      "mpaa": "PG-13",
      "actors": [""],
      "imdbMovieId": "0233687",
      "originalTitle": "The Eyes of Tammy Faye",
      "genres": [
         "Documentary",
         "Drama"
      ],
      "youtubeTrailerIds": ["3o0eL4ymO04"],
      "plotSummary": "A documentary look, mostly through the eyes of Tammy Faye Bakker Messner, at her rise and fall as a popular televangelist with husband Jim Bakker.",
      "tmdbMovieId": 15665,
      "avgRating": 3.63606,
      "releaseYear": "2000",
      "numRatings": 452,
      "posterPath": "/A5DsZWRJZxZTswlFKX7Ix6X04wq.jpg"
   }
}