{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "chinese woman",
            "id": 3292
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "conspiracy of murder",
            "id": 5514
         },
         {
            "name": "united nations",
            "id": 15053
         }
      ],
      "imdb_id": "tt0160009",
      "video": false,
      "title": "The Art of War",
      "recommendations": [
         4954,
         9415,
         13988,
         10538,
         7007,
         6623,
         10550,
         10877,
         11517,
         11702,
         10461,
         178,
         11808,
         9691,
         3512,
         11074,
         9884,
         9625,
         4911,
         10685
      ],
      "backdrop_path": "/ksboR1WDSRXjEDjcuKifPI9QSGz.jpg",
      "revenue": 30199105,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Neil Shaw",
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfef",
               "name": "Wesley Snipes",
               "profile_path": "/hQ6EBa6vgu7HoZpzms8Y10VL5Iw.jpg",
               "id": 10814,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Douglas Thomas",
               "gender": 2,
               "credit_id": "52fe44389251416c7502cff3",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Frank Capella",
               "gender": 2,
               "credit_id": "52fe44389251416c7502cff7",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Eleanor Hooks",
               "gender": 1,
               "credit_id": "52fe44389251416c7502cffb",
               "name": "Anne Archer",
               "profile_path": "/1dEu7fqOSogHivUjnXRFnnaOJNR.jpg",
               "id": 10427,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Robert Bly",
               "gender": 2,
               "credit_id": "578c2e6fc3a3685a980046c2",
               "name": "Michael Biehn",
               "profile_path": "/uZvJIfVirbv32OK4nba5bMZ6t9G.jpg",
               "id": 2712,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "David Chan",
               "gender": 2,
               "credit_id": "578c2e7c9251410848000bd1",
               "name": "Cary-Hiroyuki Tagawa",
               "profile_path": "/6KLAW9vcrI1FLLLrTAm0obL4qxc.jpg",
               "id": 11398,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Julia Fang",
               "gender": 1,
               "credit_id": "578c2e8ec3a3686224000c7b",
               "name": "Marie Matiko",
               "profile_path": "/7fs4xGdyV0kDMKoSc7An8vI0FON.jpg",
               "id": 61696,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfc1",
               "name": "Christian Duguay",
               "profile_path": "/dz0da6lHPAzAFTZMR0LvsGUr8cd.jpg",
               "id": 25735,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfc7",
               "name": "Wayne Beach",
               "profile_path": null,
               "id": 58667,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfcd",
               "name": "Simon Barry",
               "profile_path": "/hCC16GntHppyBRSdQTh6aijCIxQ.jpg",
               "id": 69211,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfd3",
               "name": "Nicolas Clermont",
               "profile_path": null,
               "id": 52089,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfd9",
               "name": "Ron Yuan",
               "profile_path": "/7mmuII6M3JGDg5hC9Bl4nORPwEV.jpg",
               "id": 61703,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfdf",
               "name": "Normand Corbeil",
               "profile_path": null,
               "id": 17212,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44389251416c7502cfe5",
               "name": "Pierre Gill",
               "profile_path": null,
               "id": 25744,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44389251416c7502cfeb",
               "name": "Michel Arcand",
               "profile_path": null,
               "id": 10751,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 9.360829,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11398,
      "vote_count": 169,
      "budget": 40000000,
      "overview": "When ruthless terrorists threaten to bring down the United Nations, they frame the one man they believe can stop them: an international security expert named Shaw. Now he must run from his own allies and become a solitary force for good, as he tries to stop what could become World War III.",
      "similar": [
         954,
         714,
         37834,
         37724,
         36955,
         206647,
         646,
         681,
         956,
         311324,
         47971,
         207703,
         9486,
         1494,
         56288,
         9342,
         9255,
         1735,
         253,
         818
      ],
      "original_title": "The Art of War",
      "runtime": 117,
      "poster_path": "/oKj3DNThu3525pox53lxT9RG0F5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Amen Ra Films",
            "id": 421,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Franchise Pictures",
            "id": 1403,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-08-23",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/9G3CBEg7QlQ9MQcNgA5IwcghNYO.jpg",
         "name": "The Art of War Collection",
         "id": 25410,
         "poster_path": "/8VJpn8DZwZvKnyA3HBfQfjGKupG.jpg"
      },
      "tagline": "Who is your foe?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christian Duguay"],
      "runtime": 117,
      "synopsis": "Neil Shaw (Snipes)is an operative for the United Nations's covert dirty-tricks squad, using espionage and quasi-ethical tactics to secure peace and cooperation. In Hong Kong, Shaw infiltrates a Chinese New Year party held by Chinese business mogul David Chan (Tagawa) and covertly hacks an office laptop of a North Korean Defense Minister, and blackmails him with the misappropriation of U.N. aid money, in exchange for continuing negotiations with South Korea. Shortly after being discovered, Shaw fights his way out of the party, and suffers a gunshot wound to his shoulder during extraction. Six months later, a shipping container full of dead Vietnamese refugees from Hong Kong turns up on the New York docks on the week as the China's trade agreement with the U.S. Shaw's boss, Eleanor Hooks (Archer) suspects Chinese ambassador Wu's (Hong) connection with the Chinese Triad, and assigns Shaw to plant a bug on Wu during a banquet held by Chan. During the trade agreement banquet, Wu is gunned down, Chan is shot in the arm, and Shaw pursues a masked gunman. During the pursuit, Shaw's teammate Robert Bly (Biehn) supposedly corners the gunman, but perishes, and Shaw is arrested by the NYPD. In the middle of a prison transfer, FBI agent Frank Capella's (Chaykin) van is disabled by a roadside bomb, and an unconscious Shaw is captured by Triad members to be framed of the murder and disposed of. Shaw regains consciousness and frees himself from captivity, only to find his last remaining team member, Jenna Novak (Liliana Komorowska) murdered by a Chinese hitman. Shaw kills the hitman, recovers the audio file, and secures weapons and equipment from Novak's hidden armory. Shaw seeks out Julia Fang's (Matiko) help after reading a news article stating Shaw's innocence. Shaw manages to save Fang from an ambush by a Chinese hitwoman at a hospital. With Fang's aid, Shaw finds a Triad-owned bakery serving as a front for a Gentleman's club, setting up an unlikely alliance with Capella, as well as retrieving video footage of Chan's role in derailing the trade agreement. Fang delivers the evidence to Hooks while Shaw confronts Chan at the same hotel serving as the banquet. Chan is shot dead by a masked gunman while being interrogated by Shaw. The pursuit ends when Shaw finds a scanner that is tuned to a tracking device embedded in Shaw's gunshot wound before being ambushed by Bly. Bly reveals himself as the assassin at the banquet, and also engineered the tracking device implant from an earlier basketball game injury. Hooks reviews the evidence, and reveals that she and Chan were the masterminds behind the conspiracy. A disgusted Fang tries to leave, but attempts to hide from Bly only to be locked in a bathroom. Shaw eventually figures out Hooks's role behind the conspiracy and approaches Capella with his findings. Shaw uses Capella's business card to surgically remove his tracking device, and gives the Triads a business proposition. Shaw breaks into the U.N. building, and enters into a shootout and hand-to-hand fight with Bly, where the latter dies after falling on a glass shard from a broken glass pane. The following day, Shaw calls Hooks in her limousine and lectures her on a lesson in karma, revealing that Shaw's business proposition to the Triads was to assassinate Hooks for her betrayal. Shaw later has his death faked before reuniting with Fang in France, but is monitored by an unknown spy.",
      "writers": [
         "Wayne Beach",
         "Wayne Beach"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0160009/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzAyMjE2MDI3M15BMl5BanBnXkFtZTYwNTIwMzg2._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Wesley Snipes, Anne Archer, Maury Chaykin | See full cast and crew »"],
      "reviews": [
         "Wesley Snipes has always been trusty in the action genre. He has great charisma and looks totally cool when kicking the crap out of the bad guys. Ever since his breakthrough role in \"Passenger 57.\" There are many great moments of action in \"The Art of War.\" Sure, the plot is far from compelling, but the energy and fast pace keeps it fueled. \"The Art of War\" is not a work of art, but it's a great popcorn flick and one that won't put you to sleep! I just wish they could've done something about the cliches. I'm not going to give anything away, so I'll just say, \"Why is it in these movies the characters never seem to know who their limo driver is?\" It's an overused cliche and a cheap surprise. My score: 7 (out of 10)",
         "Most people can't differentiate between a bad film and a film they don't like. Many people didn't like this motion picture because of its liberal subtext. That doesn't make it a bad film. Most people don't realize that this was a Canadian production and that probably explains the political slant. However, as action films go, it was intelligent, high tech, stimulating, bordering on believable (seldom are action flicks actually believable), with plenty of violence. I didn't particularly agree with its `New World Order' message, but it was still a solid film. The main criticism I have of the film is the editing. In an attempt to make the story more intriguing, it is pasted together in a convoluted way that makes it very difficult to follow. All the factions and motivations are eventually explained, but one has to pay very close attention or see the movie a few times to catch them all. The screenplay suffers from an excess of subplots, which makes following the story that much more difficult. The biggest sin committed by the producers and director was that they did not understanding their audience. This film targets action lovers, who are a visceral lot. They want to be stimulated, not confused and intrigued. They also tend to be more conservative politically (God, Guns, Guts). So naturally, the film bombed. Wesley Snipes delivers a strong performance in the intelligent action hero role. Snipes seems to be locked in the action genre when he is really too bright for the roles he plays. He should take a lesson from Samuel L. Jackson and look for scripts that are more dramatic. Jackson still does action films (Shaft), but he picks parts portraying complex characters and scripts with strong character development, instead of straight macho testosterone parts. Snipes would have done well in some of the roles Jackson has had. Anne Archer does a fine job as the manipulative career diplomat, pulling everyone's strings behind the scenes. Donald Sutherland is a bit flaccid in this film, but his character really didn't have a lot of bite. Overall, this film is a strong entry into a genre dominated by mindless body count. I rated it an 8/10. Those who like their action flicks to be completely believable subtract two points. Subtract another two points for those who don't like confounding story lines. For those who abhor screen violence, don't even bother.",
         "Snipes puts in a fine performance as Neil Shaw, a united nations defence agent who is wanted for the assassination of the Chinese U.N. ambassador at a time where U.S. and Chinese relations are already strained. Snipes teams up with a beautiful U.N. translator (Marie Matiko) in a search for the truth behind the conspiracy that is engulfing the duo. The Art of War delivers action, thrills and good plot twists and overall is a satisfying thriller. However it is not without some minor flaws, the story although complex and interesting is somewhat dis-jointed in its delivery and the ending lacks impact, even if it does ring true to the plot line. All in all 'The Art of War' is a good, yet less than perfect action thriller, that will certainly satisfy Snipes fans. 7/10",
         "In \"The Art of War\", Snipes plays a UN deep-cover operative whose cover is compromised. Though the film features plenty of stunts, chases, crashes, shootouts, fights, and pyrotechnics mixed with a typically convoluted spy-type plot, we've seen better of all in other films. The flick does have a female protagonist but there's little romance or sexiness in this flick which lacks the spit and polish of Bond films and seems to be begging for something more than just a lot of busy heroics and magical futuristic microelectronic snoop stuff. Ok but far from Snipes better films.",
         "I've read some seriously negative reviews of The Art of War. There are IMDb users out there who hated this movie to no end, which leads me to wonder why I rented it in the first place, having read many of these reviews already, and why it was seen as so much worse than anything Wesley Snipes has done up to this point. Snipes has made some good movies, and some bad ones, just like almost every actor out there (although there are certainly some that only make good ones and some that only make bad ones, but Snipes seems to have about an equal amount of each, maybe leaning slightly in favor of the bad), and I don't really think The Art of War is any different. It's a typical action film in which he plays virtually the exact same character that he played in Rising Sun, except here he's been framed as an assassin and, as is always the case with movies in which the good guy has been framed for some crime, he has to set out to prove his innocence with no help from the police and without knowing who he can trust. (spoilers) Michael Biehn stars as Robert Bly, Neil Shaw's (Snipes) ill-fated partner. Biehn has been largely missing in action (pun intended) for several years, his only notable appearances since the spectacular Terminator (and since being deleted from Terminator 2) being an excellent role in The Rock and his thoroughly enjoyable performances in movies like The Abyss, Aliens, and Navy SEALS. Given this iconology, it's strange to consider the role that he was given in The Art of War. Naturally, actors are given roles that go against their iconography all the time (a recent example would be Tom Hanks in The Road to Perdition), but there is generally a reason for that or at least something about that actor's personality or charisma that fits with the role that they are given. In The Art of War, there is little reason to have Biehn play the role that he plays other than to cover up the plot twist near the end of the film. That's just weak writing. Like I said above, I enjoyed The Art of War more than many other reviewers seemed to. The introduction of the conflict is particularly impressive. The chase through the building early in the film is not only exciting, but thoroughly convincing so that you really don't guess what's really happening. Regardless of how the mystery is created (whether or not it be because of the strange role given to Michael Biehn), consider how well the frame was set up. Shaw is running through this building chasing the bad guy, he hears his partner shot twice on the radio, so just as he bursts into the street which is crowded with police, his adrenaline is pumping and his face is contorted with the grief of knowing that his partner has just been killed. It's easy to understand that the police could have mistaken his expression for grief at having been caught trying to escape the scene of the crime that they think he has just committed. I might like to take this opportunity to point out that while I certainly found The Art of War to be at least a mildly entertaining action film, I did not find it to be any more than that. It is most certainly a vehicle for some good Wesley Snipes action, but is there really anything wrong with that? I personally enjoy watching Steven Seagal movies and Van Damme movies, just because they're entertaining and, quite often, more amusing than anything else. Given that, I would not be being fair if I condemned The Art of War for not having much intellectual content to speak of. I am normally not one to forgive stupidity in the movies, but the thing that allows me to forgive the cheesy action in The Art of War (as an example of how seriously the movie takes itself, consider the extensive kung-fu fighting scene that takes place during the New Year celebration early in the film, to the grand enjoyment of everyone in attendance, who are all lucky enough to see it close up on the big screen) is that it doesn't pretend to be anything else. Unlike a Bruckheimer film, it does not throw in all of the necessary ingredients to attract every kind of audience that can be attracted to an audience, which is an unfortunately prevalent tactic that results in a lot of movies that could have been great but instead come out as muddy messes. The Art of War is a straight up action film, and whether you loved it or hated it or anything in between, you have to respect it for allowing itself to be seen as such in a society that more and more seems to condemn purity in the movies.",
         "The last decent film Wesley Snipes has made to date, THE ART OF WAR has him playing a dirty-tricks agent who is on the run, framed for the murder of a high Chinese official and connected to a container full of dead Asian refugees. The movie has two things going for it: A great title and some action sequences right out of the John Woo stylebook, especially the final showdown in an office building between Snipes and Michael Biehn. The way the glass shatters and falls in slo-mo as the two struggle and crash through a second floor barrier adds to the film's arresting visuals. Chalk one up for Snipes, who seems to churn out as much crap these days as Van Damme, Stallone and Seagall combined.",
         "First off the technical aspects of this movie were superior in every sense. The sound, the editing, the camera work, all of it was fantastic and made this an enjoyable treat. You have to enjoy all that because, with the exception of Donald Sutherland who is always on, the acting isn't there. Wesley Snipes is one of my favorite actions heroes, but we all know that action heroes can't act. Well, maybe Bruce Willis is the exception. But for an action hero, Wesley is great and does a great job here - for an action hero. And, hey, Marie Matiko was easy on the eyes. If you liked Enemy of the State, you will like this movie.",
         "Wesley Snipes is back better than ever in \"The Art Of War,\" a movie that is so good it deserves to be among the top ten of the summer. There are many reasons why I enjoyed \"The Art Of War.\" The first reason was the supporting cast. When I first saw Donald Sutherland in this movie, I knew it would be a thing of beauty. He brought great credibility as he made a good movie, that much better. Anne Archer is one actress you can always count on to give a good performance. \"The Art Of War\" turned out to be a montage of \"The Fugitive\" series and \"Enemy Of The State.\" While this is the only negative thing about this film, it didn't deter me from enjoying it to my heart's content. There are many other things about \"The Art Of War\" such as the high-tech wizadry and action-filled sequences that were very enjoyable. However, the best thing about this film was the storyline. \"The Art Of War\" had beautiful twists toward the end of the film. In addition, there are scenes in this movie that are so good they must be seen to believe they are that good.",
         "this political thriller isn't too bad.it's not really fast paced paced,and there is some predictability to it.but it should have enough twists and turns to keep you guessing.it's also a fairly intelligent movie.it's also compelling enough to maintain interest.at least i thought so.i also found it more stylish than many movies of the genre.Wesley Snipes is the main star,but there are some other well known actors here.these include Anne Archer,Maury Chakin,Donald Sutherland,Michael Bien,Cary-Hiroyuki Tagawa and James Hong.for this type of movie,this one is not as over the top with ridiculous action scenes.though it does have a few scenes with strain believability a bit.for me,The Art of War is a 6/10",
         "Disclaimer first: This is not Citizen Kane, obviously. But THE ART OF WAR is about as fun as an action movie can get. Yes, Snipes is a runaway agent wrongly accused, we have seen this in US Marshals and Murder at 1600 (by the same Writer.). But this movie has two things that those movies lacked, STYLE and an enjoyable supporting cast. ART, with all its chase scenes and fight sequences (and there are a truck load), is beautifully shot. The sets and camera work are great, and most importantly (partially because I live there) you buy that you are in NYC. Few signs of the Canadian stand in, Montreal. Everything is slick and well shot. Behind Snipes are a great cast of action cronies, Maury Chaykin as Capella the FBI agent who doesn't know whether to arrest or help Snipes, Marie Matiko, Julia the VERY attractive hostage/eyecandy (Hollywood should learn from the TASTEFUL handling of her strip scene) and a bunch of good character actors who could be of course our villain(s). Yes, ART OF WAR has too many twists, it tries hard, too hard at times. But it is better than the other action flops that have stopped trying all together. Bottom line this is The Fugitive meets James Bond (with a little Jackie Chan). Its a fast paced, slick, action flick, that has half a brain in it. Snipes is awesome in it and should look to move forward from roles like this. Ignore the cynical critics who are obviously trying to suck the fun out of action movies and see it."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Morgan Creek Productions",
         "Franchise Pictures",
         "Amen Ra Films"
      ],
      "summaries": ["Shaw is an operative for the United Nations' covert dirty-tricks squad, using espionage and quasi-ethical tactics to secure peace and cooperation. When a shipping container full of dead Vietnamese refugees turns up on the docks and China's ambassador is gunned down at a dinner celebrating a new trade agreement with China and the US, Shaw is framed for the murder and must evade the FBI and Triad gangsters to find out what is really going on."],
      "budget": 40000000
   },
   "movielensId": 3879,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-08-23",
      "dvdReleaseDate": "2000-12-26",
      "directors": ["Christian Duguay"],
      "runtime": 117,
      "movieId": 3879,
      "title": "The Art of War",
      "mpaa": "R",
      "actors": [
         "Wesley Snipes",
         "Donald Sutherland",
         "Maury Chaykin",
         "Anne Archer",
         "Michael Biehn",
         "Cary-Hiroyuki Tagawa",
         "Marie Matiko"
      ],
      "imdbMovieId": "0160009",
      "originalTitle": "The Art of War",
      "genres": [
         "Crime",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["q8xEQdWQCho"],
      "plotSummary": "When ruthless terrorists threaten to bring down the United Nations, they frame the one man they believe can stop them: an international security expert named Shaw. Now he must run from his own allies and become a solitary force for good, as he tries to stop what could become World War III.",
      "tmdbMovieId": 11398,
      "avgRating": 2.91631,
      "releaseYear": "2000",
      "numRatings": 1631,
      "posterPath": "/oKj3DNThu3525pox53lxT9RG0F5.jpg"
   }
}