{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "falsely accused",
            "id": 769
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "trial",
            "id": 11038
         },
         {
            "name": "guilt",
            "id": 33720
         },
         {
            "name": "incest",
            "id": 33841
         }
      ],
      "imdb_id": "tt0197384",
      "video": false,
      "title": "Crime + Punishment in Suburbia",
      "recommendations": [
         54003,
         17906,
         140149,
         29649,
         41478,
         25112,
         47944,
         27765,
         24050,
         39310,
         56441,
         31004,
         92190,
         50071,
         20321,
         55015,
         27451,
         13064,
         41185
      ],
      "backdrop_path": "/lwsDVnWCF7NRg5iD7wmXE4R8ckE.jpg",
      "revenue": 26394,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Roseanne Skolnick",
               "gender": 1,
               "credit_id": "52fe46e5c3a36847f81185c9",
               "name": "Monica Keena",
               "profile_path": "/f4dD2ohtjJZweo6nbvu38OpSsCO.jpg",
               "id": 18315,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maggie Skolnick",
               "gender": 1,
               "credit_id": "52fe46e5c3a36847f81185cd",
               "name": "Ellen Barkin",
               "profile_path": "/i4WSy0da6KaA3xvETtXqZtUMoRP.jpg",
               "id": 6913,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Fred Skolnick",
               "gender": 2,
               "credit_id": "52fe46e5c3a36847f81185d1",
               "name": "Michael Ironside",
               "profile_path": "/i3HkCGEnQGJeD0U8WDumO4VH5fU.jpg",
               "id": 11086,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vincent",
               "gender": 2,
               "credit_id": "52fe46e5c3a36847f81185d5",
               "name": "Vincent Kartheiser",
               "profile_path": "/y2i2epgCOwfMyC5FclcF3IU8Iy3.jpg",
               "id": 52646,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "59235c92c3a36804a3001c1d",
               "name": "James DeBello",
               "profile_path": "/xhDScFpgfM9gfIyNQm8KOr0qEU5.jpg",
               "id": 35768,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Chris",
               "gender": 2,
               "credit_id": "59235c9f92514104ca003549",
               "name": "Jeffrey Wright",
               "profile_path": "/wBh9rwK3aRr1hCrSRLxxPHKzGeU.jpg",
               "id": 2954,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Bella",
               "gender": 1,
               "credit_id": "59235cad9251410546003255",
               "name": "Conchata Ferrell",
               "profile_path": "/p7KiBF2blE5KOXKrXMrVpMgCYZX.jpg",
               "id": 1909,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Coach",
               "gender": 2,
               "credit_id": "59235cbcc3a3680474001b3e",
               "name": "Marshall R. Teague",
               "profile_path": "/qRDCvSWg76O071pggoGeru30SGk.jpg",
               "id": 63941,
               "order": 7
            },
            {
               "cast_id": 5,
               "character": "Cecil",
               "gender": 1,
               "credit_id": "52fe46e5c3a36847f81185d9",
               "name": "Nicki Aycox",
               "profile_path": "/nuq3ChJ6arKPgpM3MTnaE4bgavn.jpg",
               "id": 42374,
               "order": 8
            },
            {
               "cast_id": 6,
               "character": "Stuck Up Girl",
               "gender": 1,
               "credit_id": "52fe46e5c3a36847f81185dd",
               "name": "Bonnie Somerville",
               "profile_path": "/3IDO2h8etG7dlsGRdvsTWW5EFm3.jpg",
               "id": 66579,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e5c3a36847f81185e9",
               "name": "Larry Gross",
               "profile_path": null,
               "id": 1725,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5647d191c3a368262000533d",
               "name": "Michael Brook",
               "profile_path": null,
               "id": 19016,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5647d19ac3a368262000533f",
               "name": "Bobby Bukowski",
               "profile_path": null,
               "id": 1209263,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5647d1a19251413acc005097",
               "name": "Gabriel Wrye",
               "profile_path": null,
               "id": 35977,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5647d1a9c3a368261a00505e",
               "name": "Matthew Barry",
               "profile_path": "/6nQnIW8yzsOHLCJy9JHwYfGIA4o.jpg",
               "id": 545,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5647d1b0c3a368262000534b",
               "name": "Susan Shopmaker",
               "profile_path": null,
               "id": 32604,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5647d1b7c3a368260c005284",
               "name": "Ruth Ammon",
               "profile_path": null,
               "id": 34222,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5647d1bec3a3682605004ec8",
               "name": "Amy Vuckovich",
               "profile_path": null,
               "id": 1536263,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5647d1c6c3a36826080051ec",
               "name": "Sophie de Rakoff",
               "profile_path": null,
               "id": 960323,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59235d4fc3a36804a3001cb0",
               "name": "Rebecca A. Battle",
               "profile_path": null,
               "id": 1821821,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5abcbb749251411e970224cd",
               "name": "Rob Schmidt",
               "profile_path": null,
               "id": 60243,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.050906,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46119,
      "vote_count": 17,
      "budget": 0,
      "overview": "This is a contemporary fable loosely based on Fyodor Dostoyevsky's \"Crime and Punishment\". Roseanne is outwardly a perfect and popular teen. However, her image is hiding the abuse at her stepfather's hands, and she decides to take revenge. The events that follow are a mix of dark humor and an exploration of modern morality as Roseanne faces not only a fellow suburbanite who knows, but her own conscience as well.",
      "similar": [
         3134,
         281957,
         527,
         26390,
         979,
         281,
         395834,
         10692,
         445954,
         133805,
         2142,
         400,
         1645,
         44945,
         994,
         49950,
         10285,
         948,
         238636,
         298312
      ],
      "original_title": "Crime + Punishment in Suburbia",
      "runtime": 100,
      "poster_path": "/eJ71YFS6FkwNmz4yGZE7zpHLfHo.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Killer Films",
            "id": 1422,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "G2 Films",
            "id": 67882,
            "origin_country": ""
         }
      ],
      "release_date": "2000-01-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "No one stays innocent forever",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rob Schmidt"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Larry Gross"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0197384/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDA3NTgwOTEyN15BMl5BanBnXkFtZTcwNDQyOTQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Monica Keena, Ellen Barkin, Michael Ironside | See full cast and crew »"],
      "reviews": [
         "When I first heard about this being based on Dostoyevsky's Crime and Punishment I was fearful that it was going to be another half-hearted teen version of a classic. I am so glad I was wrong. While Dostoyevsky made his point with words, Rob Schmidt did the same with the films imagery which truly was both narcotic and haunting. He would make you feel as if you were in some drug induced dream/nightmare. You felt as if you were trapped between Heaven and Hell, happiness and sorrow, love and loss. As the story progresses you watch the ghosts of Roseanne (Monica Keena) slowly absorb her. She goes from this glowing image of beauty to a shadow of a human being. It's stark and disturbing. While Vincent (Vincent Kartheiser) the seemingly gloomy one, who loves her from the beginning of the film is the sole voice of reason, hope, and beauty in her slowly cascading world of tragedies. The film epitomizes the continuous hopelessness that many today feel but refuse to acknowledge. Although, I think what the film does best is that it shows us these sadnesses while reinforcing us with the concepts that we can make anything happen if we want to badly enough. Good or bad, we are the only ones responsible for our fates.",
         "I'll admit, I was not in the most jovial of moods when I sat down to view Crime and Punishment in Suburbia, so the plot had a far greater impact than it would have had I been in an upbeat mood. But, at the same time I was expecting yet another glossy teen flick where a mess of pretty people prance around on the screen for ninety minutes, after which the credits roll to the tune of a popular radio hit. However, I found quite the opposite. I was genuinely moved by this film. Though it is not the most original movie I've seen, it touched me in a very unique way. Ultimately, do not judge this movie by it's generic, mainstream movie cover. It is actually a high quality piece of cinema. And fellow teenagers, drop your Cruel Intentions and Bring It Ons and give this a try. It might not be oscar award material, but it is far more engaging than any of the pg-13 tripe they try and pawn off on you at blockbuster. Give it a shot. If you like it, good. If you don't, oh well.",
         "The 3 best aspects to this film are the acting, cinematography and soundtrack. This film just made me a big fan of Monica Keena and Vincent Kartheiser. Both delivered dynamic and intriguing performances. Monica Keena's character is transformed throughout the film and she's able to convey that arc with great subtlety. Vincent Kartheiser's character was also conveyed very well, not overdone like so many other goth/nerd characters are portrayed. The cinematography was great - visually compelling imagery and an unsteadiness throughout that lends to the feel of uneasiness with what is happening to the characters. It lends itself to the feelings, moods of not only the characters in the film but to the viewer as well. A great film engages the viewer and makes them feel as though they have been drawn into the world of the film. Finally I'm a big fan of music and soundtracks that aren't cliché and don't dominate a scene. I'd love to get my hands on a list of all the songs used in the film. The writing was decent, and many of the supporting actors played their parts very well - this easily could have devolved into overblown and overacted performances but nobody in the cast fell prey to that trap. There's a strange morality to the story - one not easily discerned after one viewing. Of course there can be comparisons to the film \"American Beauty\" and while that one garnered all the praise and awards I believe this film is much more challenging yet far more fulfilling. It's more subtle and the answers aren't so easy to ascertain. I'll be watching this movie many times and I have a feeling I'll discover something new each time. Great movie!",
         "A powerful film that deserves much more attenion and credit than what it's getting. It barely played in theathers here, it was only in for about a week! The movie has wonderful acting by the entire cast. The standouts to me are Monica Keena who is the star of the film. I'm not sure on exactly how old she is, but, I honestly feel, that she does have a future in films. I think an Oscar nomination would be in order for her. But the chances of that happening are slim to none. And Ellen Barkin was wonderful in this movie as Monica's mother. It would also be wonderful to see her up for an Oscar also. But, again, the Academy would never nominate this film for anything. It's not mainstream enough. This is suppose to be a mordern retelling of Dostoevsky's \"Crime and Punishment\", while I fail to see any real comparisons other than the moral dilemma of murder, the film does a bad job retelling the story. But even so, I don't think the screenplay was bad. I think it was a very well written film, that makes sense, and is enjoyable to watch. I have nothing but great things to say about this films, but, I don't think it's for everyone. I think that has become obvious due to the very unwarm comments made by not only critics but also viewers. This is a movie I really hope people would watch and give it a try.",
         "Roseanne Skolnick (Monica Keena) is a popular cheerleader and girlfriend of the football player Jimmy (James DeBello), and she has a very dysfunctional family: her mother Maggie Skolnick (Ellen Barkin) is having an affair with a bartender and her stepfather Fred Skolnick (Michael Ironside) is a drunken and aggressive man. Vincent (Vincent Kartheiser) is a sweet and weird teenager, who studies in the same class and has a crush on Roseanne. He follows her everywhere with his camera, taking lots of pictures of her in the most different places or situations. When Roseanne is abused by her stepfather, she decides to kill him, with the support of Jimmy. However, her mother Maggie takes the blame and goes to the court for trial, being accused of murder. During the trial of her mother, Roseanne has to live with her guilt, being supported by Vincent. In the end, she has to decide: leave her mother be convicted and live with the feeling of guilt for the rest of her life, or assume the responsibility for the crime. \"Crime and Punishment in Suburbia\" is a surprisingly great teen free adaptation of Fyodor Dostoyevsky's \"Crime and Punishment\". The screenplay is very well developed and the young cast has excellent performance. Although having a great moral in the end, with the redemption of Roseanne, the direction is so good that is able to conclude the plot without being corny. I like good contemporaries free adaptations of famous romances, and this one has not disappointed me. My vote is eight. Title (Brazil): \"Crime + Castigo\" (\"Crime + Punishment\")",
         "I hated this film, it was one of the cheesiest things I have ever seen. I rented it because it looked different from the usual teenage thriller types. Boy, was I wrong. I don't know what I hated more; the obvious trying to be emotionally intense or the obvious attempts to be cinematic. In both cases, they fail horrifically. I can honestly say that this is one of the worst films I have ever seen. From the poor acting to the cheese-fest killing scenes to annoying, hate-able protagonist I don't know which bit made me laugh most. This is one of those teenage films that tries to be American Beauty when really it's Confessions Of A Teenage Drama Queen. I enjoyed The Covenant more, at least The Covenant KNEW it was dumb, whereas this film is just in denial. I know a lot of teenagers my age think this is \"arty\" and \"shocking!\" but most teenagers are dumb as hell anyway. If you appreciate good cinema don't rent it, it sucks. If you have no idea what the words \"good cinema\" and \"Gus Van Sant\" mean, watch Donnie Darko, a film that is effortlessly cool and moving, unlike this lumbering piece of trash. \"Best soundtrack of the year\"? What movie were THEY watching?",
         "Watching this movie, I thought \"Gosh, a parody of American Beauty, terrific!\". But, in the long run, I realized I was watching a strange, disturbing, involving movie. A movie about self-punishment, violence, beauty, love, crime... all mixed up, just in our life. Michael Ironside is a glorious b-movie star: it was the first time I saw him playing in such a character, obscene and suffered at the same time. A movie about how to get a new life, passing through tears and blood. A religious movie, worthy of Martin Scorsese or Sam Mendes (I wish Mendes could equal Scorse",
         "I would be more perplexed by the low rating and the many vituperous reviews if I didn't understand as much as I do about family dysfunction, alcoholism, irresponsible behavior and all that. Some people don't like this much truth in their faces. Oddly, it's not just the perps; it's often the victims, as well. For me, this is just an artfully rendered case study of the stuff I deal with four days a week. But I see more Victor Hugo (and \"Les Miserables\") here than I do Dostoyevsky. Yeah; I agree the execution is uneven. At times to the point of being almost senseless. But that may be part of the charm. Life in the world described here -is- uneven. At times to the point of being almost senseless. (How many adolescent females with alcoholic parents have I known who think life is senseless? A hundred? -Two- hundred?) Can't say I \"enjoyed\" this movie. The \"Jimmy Stewart\" character (from \"Rear Window\") is just a little too obsessed to work in the world of a young victim / victimizer who seems, at least, to be trying to make sense of it all. The trial scenes may well be meant to have a dreamlike quality, but they just seem disconnected. And the whole trip is plain ugly. But the fact that the whole trip -is- so ugly is a major reason why this film demands to be seen. Alcohol; frustrated, narcissistic fathers; cougar moms and hottie daughters are a recipe for disaster that's being cooked daily in suburban America. This is reality in modern America. It'd be nice to put a stop to it before our whole culture becomes dysfunctional. Nice little wake-up call here.",
         "Roseanne(Monica Keena) is a popular and beautiful student that is admired by a lot of people, especially by a lonely outcast Vincent(Vincent Kartheiser) who is obsessed with her and follows her around everywhere, hoping to get noticed . But Roseanne isn't so perfect like everybody thinks, she has a horrible life with her stepfather who one night, after her mother leaves, rapes her. The next day, Roseanne is totally devastated and she decides that she wants to kill him along with her boyfriend Jimmy(James DeBello). This movie started out good, it seemed like it was going to be a dark teenage drama but near the end, it turned into this cheesy bad love story with no plot. That was the problem with this story, it didn't really fit in anywhere. The only character i really liked was Vincent, he was so interesting and he had so much soul, not to mention that he was gorgeous. Anyways, I would give Crime and Punishment in Suburbia 7/10",
         "This movie is like the world's longest synopsis. You get the general sense of what the story is about but none of the content or depth to make it worth watching. The characters get almost no time to do anything but be pounded down by the Almighty Plot Hammer. The dialog is never better than a bad daytime soap opera. And yes, there are good daytime soaps. When Days of Our Lives was about Doug and Julie and the guy who played LeBeau on Hogan's Heroes, that was some quality television. This film doesn't come close to being that engrossing. It just introduces us to people who are, more or less, arbitrarily unhappy and expects that to be enough to hold our interest. It's not. Roseanne (Monica Keena) is a high school girl with a dumb jock boyfriend (James DeBello) and a gothy teen stalker (Vincent Cartheister) who turns out to be a Jesus freak. She also has some bitterly dysfunctional parents (Michael Ironside and Ellen Barkin). Roseanne's mom runs off with this random bartender (Jeffrey Wright). Roseanne's step-dad gets drunk and rapes her. The step-dad gets killed, someone who didn't do it winds up on trial and none of it has any impact. It just goes on and on and on and then on some more. I've got no complaint with how Crime and Punishment in Suburbia was shot. The music is fine and scenes are well edited. I can find no fault with the cast's performances. And it's not like it doesn't make sense or is without a definable purpose. But there's no meat on these bones. It takes about an hour and a half for this movie to get to its first substantive conversation and that's mostly a monologue about teen age angst. Voice over narration is used as an obvious crutch when these filmmakers didn't have any better idea how to convey something to the audience. When the film wraps up by telling you what happened to each character, you can't avoid the realization that they could have all been eaten alive by meth-fueled fire ants for as much as you care about them. Crime and Punishment in Suburbia is clearly one of those motion pictures that is supposed to connect with the viewer on a gut level and it's that investment which then provides the meaning and context for everything on the screen. My gut didn't connect with anything, reducing the movie to a tedious chore. If your gut is more sensitive than mine, you might get something out it. If you're bored after the first 15 minutes, though, take my advice and move on because it won't get any better."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "G2 Films",
         "Killer Films"
      ],
      "summaries": ["This is a contemporary fable loosely based on Fyodor Dostoyevsky's \"Crime and Punishment\". Roseanne is outwardly a perfect and popular teen. However, her image is hiding the abuse at her stepfather's hands, and she decides to take revenge. The events that follow are a mix of dark humor and an exploration of modern morality as Roseanne faces not only a fellow suburbanite who knows, but her own conscience as well."],
      "budget": 0
   },
   "movielensId": 3900,
   "movielens": {
      "languages": [
         "Český",
         "English"
      ],
      "releaseDate": "2000-01-01",
      "dvdReleaseDate": "2001-01-02",
      "directors": ["Robert Schmidt"],
      "runtime": 100,
      "movieId": 3900,
      "title": "Crime + Punishment in Suburbia",
      "mpaa": "R",
      "actors": [
         "Monica Keena",
         "Ellen Barkin",
         "Michael Ironside",
         "Vincent Kartheiser",
         "James DeBello",
         "Jeffrey Wright",
         "Conchata Ferrell",
         "Marshall R. Teague",
         "Nicki Aycox",
         "Bonnie Somerville"
      ],
      "imdbMovieId": "0197384",
      "originalTitle": "Crime + Punishment in Suburbia",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ML5-MByu98o"],
      "plotSummary": "This is a contemporary fable loosely based on Fyodor Dostoyevsky's \"Crime and Punishment\". Roseanne is outwardly a perfect and popular teen. However, her image is hiding the abuse at her stepfather's hands, and she decides to take revenge. The events that follow are a mix of dark humor and an exploration of modern morality as Roseanne faces not only a fellow suburbanite who knows, but her own conscience as well.",
      "tmdbMovieId": 46119,
      "avgRating": 2.88509,
      "releaseYear": "2000",
      "numRatings": 161,
      "posterPath": "/eJ71YFS6FkwNmz4yGZE7zpHLfHo.jpg"
   }
}