{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0303307",
      "video": false,
      "title": "Blue Vinyl",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4912c3a36847f8187c5f",
               "name": "Judith Helfand",
               "profile_path": null,
               "id": 1062364,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4912c3a36847f8187c65",
               "name": "Daniel B. Gold",
               "profile_path": null,
               "id": 944538,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.149894,
      "production_countries": [],
      "id": 56778,
      "vote_count": 3,
      "budget": 0,
      "overview": "The hazards of bio-accumulation, pollution, and the makeup of what we commonly hope are benign plastics are tackled in this documentary.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         858,
         141,
         634,
         3981,
         112160,
         394117,
         376867,
         437557,
         297762,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Blue Vinyl",
      "runtime": 98,
      "poster_path": "/clVHG01NVjgcnzhgdsdWnLXBo1F.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2002-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Daniel B. Gold",
         "Judith Helfand"
      ],
      "runtime": 98,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0303307/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3NDM4MjY5OV5BMl5BanBnXkFtZTcwMDM4MzgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: William Baggett, Charlie Cray, Daniel B. Gold | See full cast and crew »"],
      "reviews": [
         "Interesting that the two previous 'comments' for this film are from 'film fans' who have opinions about no other films! The complaints mentioned--that the film is based on 'biased' science, and that the spokesperson for the Vinyl Institute was extremely convincing--don't outweigh the considerable evidence on display here. To set the record straight: Judith Helfand DID interview two scientists associated with Greenpeace. She also interviewed a scientist, previously employed by the vinyl industry, who agreed with the contention that, yes, PVC is a potential toxin. There are also interviews with an Italian scientist, other American scientists, and a plethora of PVC victims who became seriously ill after exposure in the workplace to PVC. On a less contentious note, this is one of the most enjoyable 'doomsday' docs out there, and Ms. Helfand is a delightful and entertaining host, even as she points out the obvious: big money will always trump public health and environmental safety.",
         "I enjoyed the style of this documentary. It wasn't slick like a lot of docs you tend to see out there. But I don't agree that it was just BS like a lot of the reviews I just read here. I think that it is pretty well known information that PVC is toxic to the people who live around the factories, & who make the stuff. When it is in your home it is fairly safe, but if it catches fire then it sends up a lot of toxic fumes. Ever open a new PVC shower curtain and it stinks up your house for weeks after? That is called out-gassing. A lot of new chemical laden household products out-gas. Like cabinets, furniture, carpets, etc. Google it. Read up.",
         "Although made on a lower budget than some of the more popular documentaries of late, \"Blue Vinyl\" is an excellent film. This investigative work of environmental journalism does a great job of telling the story in an informative, accessible way. It is difficult to appropriately incorporate humor into a documentary about toxic chemicals. It is equally difficult to make a documentary about plastic interesting to watch. But, Helfand and Gold achieve both of these feats. While the story is told from Judith Helfand's perspective, she is not the focus of the film. As a result, the viewer has a character to latch onto without distracting from the story. If you enjoy documentaries, or you're just curious about the topic, this is a great film to watch.",
         "Here be spoilers to some degree. In an informative piece such as this movie I don't think it matters too much, but you've been warned. I know most of you out there don't have PVC on your big list of killers, and that's OK. It's a pretty obscure and boring subject. When I was flipping around and saw this title on HBO the first thing I thought was \"ohh... blue vinyl\" and thought I might see some skin. Instead, after a few seconds, I realized this was a documentary. Me, being the glutton for boring subject matter, decided to watch it. While it is a little one sided, it gives an overall impression of the positives of convenience and the negatives of PVC and gives both opposing arguments from the industry and activists- ranging from the \"end user\" (her parents) to the ultra-hippie to the corporate exec. While the narrator does give an impression of her own view, it isn't to the point that disallows the viewer to still disagree easily; and that's a nice thing to have. I loved the shots of people concerned with this issue going out and testing the air themselves, I liked how all involved were calm and overall respectful, and I most liked the opposition between the narrator and her parents. It really brings it down to home- the cost issues and unavailability of other materials was slightly anti-climatic, but gave a good feeling of what really goes on. Good documentary. 7/10- Maybe not ready for mainstream, but demonstrates excellent promise. A more famous \"documentary\" maker could learn a thing or two from this girl.",
         "Judith Helfand and Daniel Gold have created a wonderful documentary in Blue Vinyl. Judith's parents have put light blue vinyl siding on her house... but Judith suspects there are serious dangers from vinyl to humans... during its manufacture, if it burns, when its disposed of. Having lost her uterus from DES poisoning, she shares a bond with the cancer victims who work in and live in the shadow of the vinyl and PVC factories. Judith has this gravelly high voice, a quirky sense of humor, and a vulnerability in the face of corporate America that makes her irresistible. Blue Vinyl is also beautifully and imaginatively shot... I saw this at Sundance (2002) and Daniel Gold won the prize for documentary cinematography. There is also wonderful use of music and animation. Highly recommended.",
         "I think one of the best things about this movie is her depiction of the people, and their variety. Also, I could seriously identify with her frustrations dealing with industry PR and I think she did an excellent job of portraying this in an entertaining and non-venomous way. The PR people, without actually lying, tried to convince her that vinyl was safe *because* it was about half chlorine...\"you know...like sodium chloride\". Judith was biased, which isn't always a bad thing, but she did show the other side of the story at least somewhat. This documentary illustrates several controversies surrounding vinyl without going into exhaustive detail. The audience with whom I viewed this film remained involved through the entire things, and literally broke out cheering when...well, I guess that would be a spoiler :)",
         "Blue Vinyl is lefty scare-mongering propaganda, but nevertheless worth a viewing. Helfand gives enough names and references to provide the viewer with opportunity for deeper research if desired. Chemical-phobic true believers will love the film, and skeptics will find plenty of examples of bad science and misleading presentation to debunk and debate. JH's crusade against vinyl chloride is so intense that she seems unaware of her daily use of hundreds of other synthetics, such as the toxic-spawned semiconductors in her cameras, phones, and transportation. She inflicts this intensity upon her parents, who seem to bear fairly well a level of hectoring that would surely shorten my lifespan if I had to endure it like they did. (I would have had a stroke sometime during the days-long sales presentation by the California mud architect.) She concludes that wood is a dandy safe building material, and recommends old planking recovered from demolished picturesque mills in New Hampshire, at premium cost. Since the supply of quaint old mills and barns is limited, sooner or later she's going to have to start cutting down forests, and that will probably upset some of her allies. It's not as if there are any work-related injuries or deaths in the lumber industry! (And if your house catches fire, be sure to breathe in that harmless innocent wood smoke; it's so much better for you than PVC combustion products.) Let me mention just two specific problems with the film: 1) She depicts the Bucket Brigade, a grass-roots air-sampling project in a Louisiana community. But she fails to show whether any _control_ samples were taken, which would establish whether the samples were perhaps contaminated by the _plastic_ bags in which they were collected. 2) She interviews a spokesperson for the vinyl industry (a PhD organic chemist.) She goes out of her way to demonstrate her frustration that the interview is limited to 30 minutes. Well, guess what? She doesn't even show you the full 30 minute interview; she edits it down to about two minutes, most of which is taken up by her canned questions. The least she could have done was to include the full, unedited interview in the DVD extras, but I have a feeling that would have been too fair to her nemesis.",
         "This was potentially the worst documentary I have ever scene. Although the point of this video was to make people aware of the dangers of Vinyl, I feel as though I want to use Vinyl more just to spite the main character. Ha, Im surprised the Genre was labeled \"Documentary\", if you are interested in viewing a good comedy watch this movie! I will never retrieve that hour and a half in my life. She literally gets owned at every step of the way and eventually achieves a grand total of nothing. I was forced to watch this for my environmental science class and came out as a changed person (but not in a good way). Save your self some time, life, sanity, and go watch Casino Royale.",
         "Besides a great subtitle--\"the world's first toxic comedy\"--Dan Gold and Judith Helfand's documentary combines a family drama (persuading Helfand's parents not to use PVC or polyvinyl chloride siding on their home) with a scathing expose of an industry that has been incredibly successful in literally wrapping a toxic product around millions of people. Toting a sheet of blue vinyl siding from episode to episode, Helfand and Gold provide us with a deft touch of what a great documentary can do- -inform, entertain, and warn. Fans of Michael Moore's documentaries will find this film a welcome addition to the canon of documentaries by committed filmmakers who can tell an important story with verve and analytical skill.",
         "Interesting and engaging as far as documentaries go, but maybe that's because I'm interested in the topic. Overall, I thought the message was overly dramatized. Trying to link vinyl chloride monomer, the stuff that's reacted to form PVC, and allegedly poor manufacturing processes from 30 yrs ago to DES, a pharmaceutical that was created specifically to interact with and was prescribed to people was a bit of a stretch. And to try and say that burning PVC is the most dangerous thing about a fire is completely ridiculous. This inability to rank risk is why we spend soooo much time and money focusing on small issues while completely ignoring the big picture. Don't get me wrong, the manufacturing industry, and the chemical industry in particular, had and has issues. But to continue to think that they operate with a 1970s mentality and technology is wrong. We need to recognize the progress that's been made and continue to partner with industry to drive further improvements in safety while acknowledging that the products of chemistry have had a vast influence on making our everyday lives better. And that includes PVC, a versatile, affordable product that's had a positive impact for a whole lot of people."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": ["The hazards of bio-accumulation, pollution, and the makeup of what we commonly hope are benign plastics are tackled in this documentary."],
      "budget": 0
   },
   "movielensId": 39191,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-01-01",
      "dvdReleaseDate": "2005-03-29",
      "directors": [
         "Judith Helfand",
         "Daniel B. Gold"
      ],
      "runtime": 98,
      "movieId": 39191,
      "title": "Blue Vinyl",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0303307",
      "originalTitle": "Blue Vinyl",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The hazards of bio-accumulation, pollution, and the makeup of what we commonly hope are benign plastics are tackled in this documentary.",
      "tmdbMovieId": 56778,
      "avgRating": 3,
      "releaseYear": "2002",
      "numRatings": 5,
      "posterPath": "/clVHG01NVjgcnzhgdsdWnLXBo1F.jpg"
   }
}