{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "giant lizard",
            "id": 5704
         },
         {
            "name": "desert",
            "id": 18034
         },
         {
            "name": "gila monster",
            "id": 219388
         }
      ],
      "imdb_id": "tt0052846",
      "video": false,
      "title": "The Giant Gila Monster",
      "recommendations": [
         43109,
         100661,
         26923,
         28159,
         22718,
         38269,
         43312,
         85682,
         112481,
         31393,
         31275,
         52745,
         22727,
         27717,
         23293,
         29389,
         43715,
         34078,
         93754,
         56364
      ],
      "backdrop_path": "/wo8P3gUEDhhEjW7CaGwHMTBrmlM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chase Winstead",
               "gender": 2,
               "credit_id": "52fe45509251416c9102e2b7",
               "name": "Don Sullivan",
               "profile_path": "/3R5yDAtj9009zZiphRpzPsm4y0x.jpg",
               "id": 111826,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sheriff Jeff",
               "gender": 2,
               "credit_id": "52fe45509251416c9102e2bb",
               "name": "Fred Graham",
               "profile_path": "/dTkrp1Y0ijc5hvc4J3vmRRUD0ti.jpg",
               "id": 111827,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe45509251416c9102e2bf",
               "name": "Lisa Simone",
               "profile_path": null,
               "id": 111828,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Old Man Harris",
               "gender": 2,
               "credit_id": "52fe45509251416c9102e2cf",
               "name": "Shug Fisher",
               "profile_path": "/u0jE5vOI5PID7JBkuupKdBEkaA2.jpg",
               "id": 114564,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mr. Wheeler",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2d3",
               "name": "Bob Thompson",
               "profile_path": null,
               "id": 114565,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Missy Winstead",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2d7",
               "name": "Janice Stone",
               "profile_path": null,
               "id": 114566,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Horatio Alger 'Steamroller' Smith",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2db",
               "name": "Ken Knox",
               "profile_path": null,
               "id": 114567,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mom Winstead",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2df",
               "name": "Gay McLendon",
               "profile_path": null,
               "id": 114568,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Gordy",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2e3",
               "name": "Don Flournoy",
               "profile_path": null,
               "id": 114569,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mr. Compton",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2e7",
               "name": "Cecil Hunt",
               "profile_path": null,
               "id": 114570,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Agatha Humphries",
               "gender": 1,
               "credit_id": "52fe45509251416c9102e2eb",
               "name": "Stormy Meadows",
               "profile_path": null,
               "id": 114571,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Ed Humphries",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2ef",
               "name": "Howard Ware",
               "profile_path": null,
               "id": 114572,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Rick",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2f3",
               "name": "Pat Reeves",
               "profile_path": null,
               "id": 114573,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Jennie",
               "gender": 0,
               "credit_id": "52fe45509251416c9102e2f7",
               "name": "Jan McLendon",
               "profile_path": null,
               "id": 114574,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Bob",
               "gender": 2,
               "credit_id": "52fe45509251416c9102e2fb",
               "name": "Jerry Cortwright",
               "profile_path": null,
               "id": 114575,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45509251416c9102e2c5",
               "name": "Ray Kellogg",
               "profile_path": null,
               "id": 114562,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45509251416c9102e2cb",
               "name": "Jay Simms",
               "profile_path": null,
               "id": 98248,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45509251416c9102e301",
               "name": "Ray Kellogg",
               "profile_path": null,
               "id": 114562,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "575ae38dc3a3682d1600013c",
               "name": "Ken Curtis",
               "profile_path": "/kHEdY7rK6nNkWj278e65iqCrXjO.jpg",
               "id": 30554,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "575ae3a69251410b9d00012d",
               "name": "B.R. McLendon",
               "profile_path": null,
               "id": 1633474,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "575ae3b29251410b9200013c",
               "name": "Gordon McLendon",
               "profile_path": null,
               "id": 999981,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "575ae3bc9251410b9400011c",
               "name": "Jack Marshall",
               "profile_path": null,
               "id": 117020,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "575aefcbc3a3682d240002df",
               "name": "Wilfred M. Cline",
               "profile_path": null,
               "id": 544755,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "575aefd6c3a3682d0b00032e",
               "name": "Aaron Stell",
               "profile_path": null,
               "id": 8484,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "575aefe6c3a3682d06000301",
               "name": "Louise Caldwell",
               "profile_path": null,
               "id": 1633498,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "575aeff19251412704000002",
               "name": "Corinne Daniel",
               "profile_path": null,
               "id": 1633499,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "575af026c3a36851de00000d",
               "name": "Ben Chapman",
               "profile_path": null,
               "id": 1633500,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.167614,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34077,
      "vote_count": 14,
      "budget": 0,
      "overview": "A small town in Texas finds itself under attack from a hungry, fifty-foot-long gila monster. No longer content to forage in the desert, the giant lizard begins chopming on motorists and train passengers before descending upon the town itself. Only Chase Winstead, a quick-thinking mechanic, can save the town from being wiped out.",
      "similar": [
         7191,
         124905,
         5876,
         588,
         339967,
         1927,
         39256,
         339530,
         46261,
         293167,
         408220,
         40761,
         9355,
         262543,
         55341,
         927,
         928,
         841,
         68726,
         387426
      ],
      "original_title": "The Giant Gila Monster",
      "runtime": 74,
      "poster_path": "/9QuykI21rdNQdahJr22hzpzHxJI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Hollywood Pictures Corporation (II)",
         "id": 77943,
         "origin_country": ""
      }],
      "release_date": "1959-06-25",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Ray Kellogg"],
      "runtime": 74,
      "synopsis": "We open with a narration and a sweeping view of a river wash. A couple, Pat Wheeler (Grady Vaughn) and his girlfriend, Liz Humphries (Yolanda Salas) are sitting in his car when something pushes the car over and down a ravine and into the wash. A giant claw fills the screen and credits roll. A group of teens are dancing at a soda shop. Gordy (Don Flournoy) and his girlfriend, Jennie (Jan McLendon) pull up outside in Gordy's roadster. Chase Winstead (Don Sullivan) and his girlfriend Lisa (Lisa Simone) arrive in Chase's roadster. Chase inquires about Pat and Liz, and when told their car may have broken down, Chase immediately challenges that by saying, \"not in his heap, I worked on it myself.\" Lisa works for the Wheeler family. She is an exchange student from France and Mr. Wheeler is her sponsor. She tells everyone Pat didn't come home for dinner and his father was very upset. Old Man Harris (Shug Fisher) arrives in his 1932 Ford. Chase wants to buy his car but Harris is not interested in selling. The gang of kids leaves for the drive in. The Sheriff (Fred Graham) pulls up to the large Wheeler home. He meets with Mr. Wheeler (Bob Thompson) regarding his missing son, Pat. Wheeler tells the sheriff that both his son and Pat's girlfriend didn't come home last night. The sheriff infers they may have eloped. Wheeler blames Chase; he thinks Chase has too much influence over his son and the rest of the kids in town. The Sheriff reminds Wheeler that Chase is a good kid and works hard after his Dad died \"on one of your drill rigs.\" The Sheriff stops at Compton's Garage to talk to Chase. He thinks Chase may know where Pat and Liz have gone. Chase tells him he doesn't know, but dismisses the elopement theory. The final stop by the Sheriff is the Humphries' farm. He meets with Ed Humphries (Howard Ware) and his wife Agatha (Stormy Meadows) about their missing daughter, Liz. They have no idea where she is, but are more gracious and understanding of the Sheriff's challenge than Mr. Wheeler. On his way out he bumps into Harris. He knows Harris is a drinker and asks to smell his breath. Satisfied, he sends him on his way. No sooner has the Sheriff walked away than Harris pulls out a bottle and takes a swig. He drives off. Mr. Compton (Cecil Hunt), the owner of the garage where Chase works, returns with a load of four quarts of nitroglycerin. Wheeler ordered it in case there was a blowout and oil fire. Compton tells Chase he took the nitro out of the safety cases. Chase is horrified and immediately puts them in the shed in safety cases. His Dad taught him how to handle this dangerous liquid. When the phone rings, Compton reminds Chase that it is not for them, \"It's not our ring.\" But Chase recognizes it as the Sheriff's ring code and eavesdrops--if it is an accident, Chase figures to get a tow job out of it. His hunch pays off, and Chase heads off in his roadster to the scene, with Compton following a short time later with the tow truck. When the Sheriff arrives at the accident scene, Chase is already there. They examine the wrecked vehicle and notice the engine is still warm. Chase directs the Sheriff's attention to the skid marks on the road. They go at a direct right angle to the direction of travel. They also notice blood on the upholstery. While waiting for the tow truck, Chase tells the Sheriff about his little sister's need for leg braces. While Compton is driving down the road in the tow truck he passes a man on the highway with a suitcase. Lurking in the underbrush is the Giant Gila Monster, hereinafter GGM. The man (Desmond Doogh) pulls out a pack of cigarettes and lights one. He hears something, but can't see source of the noise. The GGM approaches and the man falls back into the brush. His suitcase sits untouched. As Compton hooks up the wreck with Chase assisting, the Sheriff tells them the car was reported stolen. On his way home Chase notices the suitcase on the side of the road and stops. The Sheriff pulls up almost immediately. He speculates that it might belong to the person who stole and wrecked the car. They look around and see a loose cigarette and half a pack. They put the case in the Sheriff's car and both depart. Chase stops at the Wheeler home to see Lisa. She is upset. Mr. Wheeler has demanded she stop seeing Chase. He blames Chase for Pat's disappearance. Chase is driving the tow truck when a brand new Cadillac passes him at great speed. The driver notices the GGM on the road ahead and veers to avoid it crashing into a fence and disabling his car. Chase stops to render assistance and notices the driver is unhurt but very drunk. At the wheel is Horatio Alger \"Steamroller\" Smith (Ken Knox). He is dressed in a tux and introduces himself and explains that a large pink and black thing blocked the road. Chase hooks up his car and tows it back to the garage. The next morning Chase is hammering out the fender of Smith's car and singing. It wakes Smith, who is sporting a hangover, but he likes what hes hearing. He gives Chase his card and tells him to \"look me up.\" He tips Chase $40 then departs. The Sheriff pulls up to the garage and notices Chase working on the wrecked car. It seems Chase has helped himself to a couple of new tires off the wreck for his roadster. Chase tells the Sheriff he will help with the search for Pat and Liz. The Sheriff notices the switch of tires, but doesn't object. Gordy and Chase and their girlfriends search the wash. The GGM watches them. Chase and Lisa walk down the ravine and along the wash. Chase notices marks that look like something large was dragged. Chase tastes some water in the stream, but spits it out and remarks that it tastes bitter, and strongly of minerals. Gordy honks his car horn, and Chase and Lisa run back. Gordy tells Chase he found Pat's car at the bottom of the wash about two or three miles back by the old reservoir. Gordy and Chase pull it out with the tow truck. They bring the wrecked car back to the garage. The Sheriff arrives and asks where they found the car. He notices the same kind of damage as other vehicles sustained. When the Sheriff asks about Compton, the garage owner, Chase tells him he made a fuel oil delivery. On the road, Compton is driving a fuel oil truck. The GGM knocks it off the road and the wreck explodes into flames. Chase closes up the garage and heads home. His mother, (Gay McLendon) meets him on the porch. She blocks his path into the house, so he picks her up. She makes him close his eyes as he enters the house--she has a surprise for him. His little sister, Missy (Janice Stone) is wearing leg braces. Missy exclaims, \"Look what Lisa got me.\" She makes an attempt to cross the room, but falls, gets up and walks a few more steps. Chase then sings her a song. Chase thanks Lisa for the braces. He intended to buy them the next day, but Lisa beat him to it. The phone rings. The Sheriff is inquiring about Compton as there was an accident involving a fuel truck reported. Chase meets him at the garage. Harris reported the accident. Chase, Harris and the Sheriff leave in Chase's car, as the Sheriff's car has a flat tire. They arrive at the accident scene and the truck is still burning, but no trace of Compton. The Sheriff tells Chase that livestock have been reported missing. At the garage, Gordy and his friend hear a radio report about Steamroller Smith agreeing to DJ at their upcoming barn dance. They are waiting for Chase, who drives up with a new paint job on his roadster. Harris is driving down the road, singing and drinking. He sees a train and decides to race it to the crossing. The train misses. Further down the line a trestle is damaged as the GGM slides under it. The train derails and many of the passengers are killed and eaten. After witnessing the derailment, he turns around and drives back to the Sheriff station and makes a report. The Sheriff interviews Harris. Dissatisfied with the story and suspecting drunk driving, he locks him up. Chase's mom arrives home in Chase's roadster. Missy is inside with Chase; shes carrying a suitcase and informs Chase shes spending the night at the Blackwells. The phone rings; its the Sheriff again. He asks for a book on reptiles. At the Sheriff's office he and Chase discuss the possibility of some animal developing gigantism. Harris claims to have seen the GGM, as have some of the survivors of the train wreck. Chase recounts his story of Steamroller Smith's encounter with what he described as a large pink and black creature. At the barn dance people are arriving. Inside there is music and dancing. Chase introduces Steamroller Smith. Smith plays a record. Mr. Wheeler and the Sheriff meet at the garage. Wheeler is mad because his son Pat's car was moved without a proper investigation. He accuses him of protecting Chase. Wheeler concludes his son is dead; he also notices the stolen tires and demands the Sheriff arrest Chase. They drive over to the dance to make the arrest. Smith plays a record and asks the audience to identify the singer. Lisa guesses that it is Chase. Chase picks up a banjo and sings. The Sheriff and Wheeler arrive in separate vehicles, and the GGM simultaneously makes its way to the barn. The GGM crashes through the wall. Panic ensues. The Sheriff retrieves his shotgun from the car and fires with little effect, but does manage to chase it off. The Sheriff deputizes Wheeler and orders him to keep everyone there. Chase and Lisa drive off. Chase has a plan. Chase races back to the garage to retrieve the nitroglycerin, all four quarts. He races along the road and notices a break in the fence and the damaged Blackwell residence, where his little sister was visiting. They drive across a field and spot the Blackwell family and Missy fleeing. Missy falls and is covered by Lisa while Chase races towards the GGM. He jumps clear of his roadster just before it hits the creature. It explodes on impact killing the GGM. The Sheriff arrives and asks, \"What did you hit him with?\" Chase responds, \"my brand new, 100% completed hot rod.\" Wheeler tells the Sheriff with Compton gone, Chase is unemployed. He tells the Sheriff he has a job for Chase.",
      "writers": [
         "Ray Kellogg",
         "Jay Simms"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052846/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMDY5ODEyMF5BMl5BanBnXkFtZTcwMDI0NjMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Don Sullivan, Fred Graham, Lisa Simone | See full cast and crew »"],
      "reviews": [
         "I had a pretty positive reaction to this movie, although my opinion is surely biased because I saw it a couple days after watching the 2003 film Coronado and I was still reeling at how staggeringly bad that movie was. Unbelievable, seriously. I'm not going to get over that shock for quite a while, actually. The Giant Gila Monster is an example of a classic b-monster movie with ridiculous dialogue and dismal special effects that still manages to be entertaining. A lot of reviewers have had a lot of really negative things to say about it, which I'm trying to avoid because it's really easy to badmouth a movie like this. I bought a collection of 50 classic horror films and this one was included and, on the inside flap of the box is the following line, presumably meant to generate excitement in seeing the movie, \"Marvel at the primitive special effects in Giant Gila Monster!\" This is partly why I try to avoid bashing the movie too much, because it came in a collection of movies called \"50 Horror Classics,\" which also includes such gems as Attack of the Giant Leeches, The Killer Shrews (which was originally released as a double feature with The Giant Gila Monster), Swamp Women, and The Amazing Mr. X. Surely I was not expecting a milestone film when I watched this movie, although it should be noted that the collection also features films like Nosferatu, Night of the Living Dead, House on Haunted Hill, Metropolis, The Phantom of the Opera, The Hunchback of Notre Dame, and White Zombie (which I have yet to watch, but with a title like that it HAS to be good). The premise of the movie is that there is so much uncharted land around some suburban town that a monstrous lizard has been living there unnoticed for years. The movie starts out showing normal daily life of a lot of teenagers acting like I assume teenagers really acted back then (if someone tried it these days, however, they would have to have their wedgies surgically removed), until strange things start happening in the form of lots of car crashes that involve skidmarks perpendicular to the direction of travel, resulting in the big question, \"What batters a car around like it was a toy?\" For most of the movie the cast dances around the possibility of any unusual life forms until the father of a boy who went missing early in the film insists that there could be a huge lizard out there, giving reasoning which makes absolutely no sense at all. He insists that a giant lizard could easily live out there for years unnoticed, get this, in the \"underbrush.\" Well, maybe he just didn't understand the scale he was talking about, because given the size of the car that crashes into it at the end of the film, this lizard living in \"underbrush\" was probably a good 60 feet long. But even without having seen the thing, is \"underbrush\" the kind place where something big enough to push cars sideways could hide? The size of the lizard, first of all, is blamed on out of control pituitary growth, then soon afterwards there's something about some river delta country where salts washed into the valley and got absorbed by the plants and then transferred to the animal, causing them to be giant. I don't know if the intention was to throw in some scientific processes and quickly confuse the audience, but I really can't say that I've heard of any salts that cause gigantism. But I'm no scientist, so what do I know. At any rate, yes the special effects are primitive, but so is the movie. This is a special effects film that was made on a tiny budget more than four decades ago, so I'm willing to cut a little slack. The gila monster is never convincing even for a second, but at least there was some genuine thought put into the characters and the script. One of the biggest signposts of low budget science fiction and horror is when you can't tell how big the monster is, but remember that that is a sign of low budget, not low quality. I like to think that The Gian Gila Monster has at least some quality. The movie, for example, contains at least one clever line of dialogue (\"I ask you what time it is and you tell me how to build a clock, just answer the question!\") and the singing that one of the main characters is always doing (as well as his disabled daughter) were genuine, and successful, in my opinion, efforts at creating three-dimensional characters, which is not something that you see often in these old monster movies. Or new monster movies, as it were. Again, I may be being overly tolerant of this movie because I watched Coronado recently and I remain blown away at how god-awful it was, but while The Giant Gila Monster will never become a classic of any kind (no matter what kind of movie collection it is included with), it is certainly not as bad as so many people would have",
         "I know this film is bad. I know the gila monster is nothing more than a live one put on the ground with some miniature trucks, cars, buildings, and even a train. I know the acting is overall very poor. The script is full of holes, and the special effects are not special. But I really like this film overall. What this film DOES have is a whole lot of heart. The story deals with people missing in a very small town. The sheriff(played very nicely by Fred Graham) is pressured by the local industrialist to find his son that has been missing. Where does the lawmen go for help? Well, he goes to a teenager that happens to work at a local garage, drive a souped up hot-rod, sing rock and roll in his spare time, and is a swell guy in general. Don Sullivan plays the young man, and I think he is actually pretty good. Sure, the film is hokey. What film wouldn't be with a title like The Giant Gila Monster? But this film is more than your typical B science fiction film of the 50's. It really tries hard to create characters rather than just stereotypes. There are scenes that you just would not find in your average teen science fiction flick. The scene where Chase sings to his crippled sister is just one example. This film was produced by Festus..I mean Ken Curtis who also had his hand in that other fun, campy science fiction film of the same year The Killer Shrews.",
         "As a monster movie, this is far from the best, but as a look at life in 50's rural Texas, it's top notch. The settings are authentic and realistic and the people talk like real people. Especially good is Fred Graham as the kind-hearted Sheriff...the opposite of the way most cops were portrayed in teen movies. Don Sullivan is not bad at all as hero Chase, a decent kid who just happens to love racing fast cars. With the exception of the rich Dad, everybody in the movie seems decent. As for our title monster, he's pretty sleepy looking, but I always thought Gila Monsters were pretty cool. The somber, eerie background music helps this one a lot. Speaking of which, some of Sullivan's singing is OK, but \"Laugh, Little Children\" should be taken out and shot. If the effects had matched the rest of the movie, it would have been a minor classic. As it is, it's a fun \"time capsule\" type movie.",
         "Enjoyed viewing this old time classic film with the old Hot Rod cars of the 1930's with rumble seats and the 1959 Dodge car which the Sheriff (Fred Graham),\"Mom & Boy\",'72 was able to acquire from his town. Don Sullivan(Chase Winstead),\"The Rebel Set\",'59 helped the Sheriff try to solve all the strange happens with people and their cars, especially their Hot Rod leader. Lisa Simone(Lisa),\"Missile to the Moon\",'58 added some romance to this black and white film. This is one of the films that were made during the period when Monsters were animated and then magnified because of the low budget the film producers had to work with. A few of these pictures that followed this same procedure were: \"Attack of the Crab Monsters\",'57 and \"The Black Scorpion\",'57. If you like old classic films from the late 1950's this is a film to view and enjoy!",
         "The acting is embarrassing, the special effects are terrible, the photography is okay except for consistently bad lighting, the dialog is awkward, and the locations of the shots are difficult to mentally resolve. I love this movie. It's like a movie I would have tried to make, and wish I had made. I would be proud of it today if I had. I bought it, it's that good/bad. It's not as bad as \"Plan 9 From Outer Space\", in fact it's Academy Award material compared to Plan 9. It's one of those 50's low budget movies that I can't get enough of. I would love to have a collection of movies like this one. One thing I never quite understood was how a Gila Monster survived in Texas or possibly a Midwestern locale. It obviously wasn't Arizona... Forgot to mention the singing, makes the acting look good.",
         "Well... maybe I'm in strong like. The Giant Gila Monster is undeniably idiotic, but it is also a thoroughly enjoyable fusion of stereotypes - the '50s sci-fi craptacular, the 1950s teen rebel film complete with really sexy hot rods and a modern day Tex-western - all genres well overdue for retro movements. The film features some of the most inept special effects of all time, vast continuity chasms, and shockingly good characterization. Regardless of how sub-cretinous the script sometimes becomes, the characters are actually well developed human beings with interesting relationships to one another - united by their existence in a town where nothing interesting ever happens, until a giant gila monster starts terrorizing a long, lonely stretch of highway on the outskirts of town. Don Sullivan is likable but sickeningly sweet as the bad-boy Texas drag racer turned responsible budding good-boy rock-a-billy star. His acting is not too bad, and some of the rest of cast act as well, but generally, the performances are a bit ridiculous. Nevertheless, the film really does develop its characters and its plot in somewhat unique and original ways. And besides, when you're not being entertained by the virtual variety show which passes by between the action scenes, you can laugh at the tonka toys getting walked on, the flaming toy train, and the giant sand grains (almost as large as the grain of salt you should take this film with) that appear near the camera in most of the scenes featuring the gila monster. If films are supposed to entertain, this will certainly satisfy fans of pulpy sci-fi like me. I can't honestly recommend it for those who do not enjoy camp and kitsch. Enjoy!",
         "Hot rods and gila monsters! - now there's a mix that absolutely demands attention. \"The Giant Gila Monster\" opens ominously enough with sinister music but quickly turns into \"At the Hop\", at a pace that is repeated enough times in the movie to keep you off balance. It's difficult to get a fix on just how monstrous our title monster is in the early going, as frequent close ups of the creature merely reveal a rather normal lizard. As the film progresses, the creature seems to grow in stature, as when he's sized up against oncoming vehicles or when he manages to destroy a railroad trestle causing a train wreck. Presumably this beast was responsible for the disappearance of two teenagers and an oil rig driver in the early going, as crack detective work by the local sheriff fails to uncover their whereabouts. The movie actually has a lot going on, the film's hero Chase Winstead (Don Sullivan) befriends a local disc jockey by getting his car out of a jam; the DJ repays the favor by cutting a demo record for the would be singer. Chase's little sister needs a pair of braces in order to walk and they're provided by Chase's girlfriend Lisa (Lisa Simone). Comic relief is provided by the town drunk Harris (Shug Fisher), who happens to witness the creature up close and personal a couple of times, but who's buying his story? I remember as a kid watching any number of TV shows and movies of the 1950's in which nitroglycerin was a major factor in the outcome of a story. With four quarts of nitro just hanging around, young Chase manages to steer his souped up hot rod into the path of the looming monster to insure a successful and fiery finale. Even back in 1959, it seemed that corporate sponsors were a factor in movie production, you'll need more than one hand to count the number of times Mobil Oil gets it's message across. With all said and done, \"The Giant Gila Monster\" is one of those campy 1950's gems that requires at least one viewing so you could say you've been there and done that. Try to get your hands on the DVD box set of fifty sci-fi and horror films neatly packaged with a mix of downright terrible offerings like \"The Beast of Yucca Flats\" along with screen classics like \"Nosferatu\". You'll enjoy yourself for weeks and increase your knowledge of \"B\" and \"Z\" grade films to the delight of your friends and neighbors.",
         "As an offering on AMC's Friday Fright Night, this film hardly qualified, other than being frightfully nostalgic and silly...but after ample quantities of Labatts and Yukon Jack, I thought this flick was big fun. Okay, so that ukelele should've been broken over the dude's head the minute he started strumming it; so his crippled yet perky little sister was badly in need of an upper-lip wax; and I won't even reference the titular monster, as it's been commented on ad infinitum... This is classic \"ancient\" cinema, the stuff your parents were supposed to be watching while they steamed up the windows in the back seat of your daddy's Plymouth; and I still think it beats the CGI \"blockbusters\" being pooped out of Hollywood every year. To paraphrase Geena Davis in that remake of another cheesy sci-fi flick: \"Be drunk...Be VERY drunk!\" Highly recommended at 4 in the morning...",
         "OK, I know I'm in the minority here, but I have to say I love this movie. Most people may think the acting is corny and special effects are lousy, but there is a certain kind of charm this movie has that stays with you. It's the kind of movie, if you saw it as a kid, you would never forget it. I even think the Gila Monster is kind of cool .. Hey, he's cooler than some of those stupid Japanese monster movies (ever seen those Gamera flicks?) The characters all have personality and charm (even the drunk is great!). The eerie music is great (it defines 1950s sci-fi), the hot-rods are cool and the low-lit scenes are great too. It just adds to the charm of the movie. It's hard to describe, but the movie is like one of those scratchy old record albums you've loved since you bought it as a kid. I surfed the internet after seeing the movie and found a site dedicated to the movie and its fans (the guest book is loaded with praise from the many fans who signed it). In short, this movie is FUN, bad acting and all ... it's just a good time. Enjoy it!",
         "The Giant Gila Monster is another creature feature from Ray Kellogg (The Killer Shrews) that usually gets passed over with bad reviews. The story is about a giant, people-eating gila monster, which usually lurks in the thick brush near an isolated community. The main character, Chase Winston, (Don Sullivan) is a teen leader, car mechanic, and rockabilly/folk singer who sort of reminds me of singer Jimmie Rodgers. The acting is fine to passable for this type of low-budget movie, and the film is well shot. The Giant Gila Monster may be too slow for younger audiences used to today's action-packed fare, but for older audiences it might be a fun reminder of the era in which it was made. The music is creepy and nicely captures the mood of the isolated areas. The special effects (like the gila monster attacking a wrecked train) may bring on some good laughs. Throw in some rock & roll, teen lingo, a French exchange student (Lisa Simone, who was also in Missile To The Moon), a big city disc jockey, and some hot rods, and you've got a late 50's, drive-in flick which can be easily enjoyed for the type of movie it is."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Hollywood Pictures Corporation (II)"],
      "summaries": [
         "A couple of teenagers are reported missing in a small Texas town, and it is thought they eloped. Sheriff Jeff turns to his friend, Clarence Winstead, a garage mechanic and leader of a hot-rod gang for help. A series of tragic motor accidents occur and it becomes apparent that a giant gila monster is roaming the area and depleting the town of its citizens and passer-throughs, including two hot-rodding teen-agers. And might have plans on attending the BIG record-hop party.",
         "A small town in Texas finds itself under attack from a hungry, fifty-foot-long gila monster. No longer content to forage in the desert, the giant lizard begins chopming on motorists and train passengers before descending upon the town itself. Only Chase Winstead, a quick-thinking mechanic, can save the town from being wiped out.",
         "A giant lizard terrorizes a rural Texas community with a heroic teenager attempting to destroy the creature."
      ],
      "budget": 138000
   },
   "movielensId": 3931,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-06-25",
      "dvdReleaseDate": "2002-08-13",
      "directors": ["Ray Kellogg"],
      "runtime": 74,
      "movieId": 3931,
      "title": "The Giant Gila Monster",
      "mpaa": "",
      "actors": [
         "Don Sullivan",
         "Fred Graham",
         "Lisa Simone",
         "Shug Fisher",
         "Bob Thompson",
         "Janice Stone",
         "Ken Knox",
         "Gay McLendon",
         "Don Flournoy",
         "Cecil Hunt",
         "Stormy Meadows",
         "Howard Ware",
         "Pat Reeves",
         "Jan McLendon",
         "Jerry Cortwright"
      ],
      "imdbMovieId": "0052846",
      "originalTitle": "The Giant Gila Monster",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "JJgcIwfyToY",
         "3SK1G80a6Hk"
      ],
      "plotSummary": "A small town in Texas finds itself under attack from a hungry, fifty-foot-long gila monster. No longer content to forage in the desert, the giant lizard begins chopming on motorists and train passengers before descending upon the town itself. Only Chase Winstead, a quick-thinking mechanic, can save the town from being wiped out.",
      "tmdbMovieId": 34077,
      "avgRating": 1.9337,
      "releaseYear": "1959",
      "numRatings": 181,
      "posterPath": "/9QuykI21rdNQdahJr22hzpzHxJI.jpg"
   }
}