{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "technology",
            "id": 1576
         },
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "chase",
            "id": 3713
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "conspiracy",
            "id": 10410
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "explosion",
            "id": 14601
         },
         {
            "name": "violence",
            "id": 14819
         }
      ],
      "imdb_id": "tt0088024",
      "video": false,
      "title": "Runaway",
      "recommendations": [
         86971,
         16248,
         44932,
         75454,
         19384,
         12278,
         82756,
         58411,
         10640,
         28380,
         9838,
         94540,
         81179,
         11037,
         10372,
         80201,
         35432,
         80583,
         94874,
         52855
      ],
      "backdrop_path": "/nsoiUnb0696kbVImxlFSZEQfVdt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack R. Ramsay",
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6e65",
               "name": "Tom Selleck",
               "profile_path": "/jCnmP0qYpCwWdVlZM4j9VNugmTj.jpg",
               "id": 15112,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Officer Karen Thompson",
               "gender": 1,
               "credit_id": "52fe4501c3a36847f80b6e69",
               "name": "Cynthia Rhodes",
               "profile_path": "/zt0z8Mj1aQC8SHeYAo6vph9Hd6.jpg",
               "id": 724,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dr. Charles Luther",
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6e6d",
               "name": "Gene Simmons",
               "profile_path": "/otJ1GRErxC0mZsLRB1ZS41dMeq9.jpg",
               "id": 57756,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jackie Rogers",
               "gender": 1,
               "credit_id": "52fe4501c3a36847f80b6e71",
               "name": "Kirstie Alley",
               "profile_path": "/fQ1EOV3dazf05uhrEVqMN2S3T0U.jpg",
               "id": 1796,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Marvin",
               "gender": 2,
               "credit_id": "5374f5000e0a267c6a004242",
               "name": "Stan Shaw",
               "profile_path": "/2KUPUQQFmc8Zyzf16uaiYmVrNvX.jpg",
               "id": 16936,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Chief",
               "gender": 2,
               "credit_id": "55f301e59251414a5600030a",
               "name": "G. W. Bailey",
               "profile_path": "/oHwJ8QTvYPLGqc6Kwgp5Lb6nOo.jpg",
               "id": 27237,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Bobby",
               "gender": 2,
               "credit_id": "5374f5470e0a267c6a004249",
               "name": "Joey Cramer",
               "profile_path": "/tqTPKuXwcP4s0dgON4m8vp2McU2.jpg",
               "id": 63871,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Johnson",
               "gender": 2,
               "credit_id": "5374f5760e0a267c59004408",
               "name": "Chris Mulkey",
               "profile_path": "/ibXN9Ho0nCF4jbGHeQYRHI8AMjH.jpg",
               "id": 15824,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Hooker at Bar",
               "gender": 1,
               "credit_id": "5374f5960e0a267c550041d2",
               "name": "Anne-Marie Martin",
               "profile_path": "/pFOlDkjiAt4re31G57i8h7Ai7FO.jpg",
               "id": 9986,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Wilson",
               "gender": 2,
               "credit_id": "5374f5c50e0a267c5f0042dc",
               "name": "Michael Paul Chan",
               "profile_path": "/c9HqJlG7nuutKW5aYq8ODctCT1w.jpg",
               "id": 17355,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Miss Shields",
               "gender": 1,
               "credit_id": "55f3021cc3a36871ec0002b3",
               "name": "Elizabeth Norment",
               "profile_path": "/vlTZoMfb7iHNjEtCm0ZKkTE0Ffn.jpg",
               "id": 1224257,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Hooker",
               "gender": 1,
               "credit_id": "58dffa1ac3a3683d1e00cc3a",
               "name": "Cec Verrell",
               "profile_path": null,
               "id": 100460,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6e77",
               "name": "Michael Crichton",
               "profile_path": "/lAQ6LYkhdVxa2tDSCOGxQZ3t0wO.jpg",
               "id": 4782,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6e7d",
               "name": "Michael Crichton",
               "profile_path": "/lAQ6LYkhdVxa2tDSCOGxQZ3t0wO.jpg",
               "id": 4782,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4501c3a36847f80b6e83",
               "name": "John A. Alonzo",
               "profile_path": "/7HN8Ifyp5hNBhBurx0q3rlsQX8r.jpg",
               "id": 1153,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "565232b1c3a3686afd000048",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "571fb92f925141534d0001cd",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.122454,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9507,
      "vote_count": 64,
      "budget": 0,
      "overview": "In the near future, a police officer specializes in malfunctioning robots. When a robot turns out to have been programmed to kill, he begins to uncover a homicidal plot to create killer robots... and his son becomes a target.",
      "similar": [
         9654,
         281,
         14869,
         281957,
         101299,
         3134,
         357096,
         37645,
         2048,
         4771,
         979,
         19,
         562,
         19959,
         72559,
         274855,
         395834,
         59967,
         238636,
         8834
      ],
      "original_title": "Runaway",
      "runtime": 100,
      "poster_path": "/PqQCNaw2FfOgDQGruvBwjAx5wD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1984-12-14",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "IT IS THE FUTURE. Machines are being programmed to turn against us. Someone must stop the madman who started it all.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Crichton"],
      "runtime": 100,
      "synopsis": "In an unnamed city a few years in the future (from the film's release date, 1984), John Ramsey works as a cop in a special division of the police department called the Runaway Squad. In this future society, people have become dependent on robots to do many daily tasks for them. Ramsey's work involves responding to calls where robots have gone out of control. Ramsey is assigned a new partner, Karen Thompson, who has just transferred into the Runaway Squad. On their first call, they are taken by helicopter to a farm outside the city where an agricultural robot has been toppling crops. The two cops are able to find and deactivate the robot; Karen gets a facefull of dirt for her trouble. While in the chopper heading to the scene, Ramsey confides in Karen that he's afraid of heights. The two next respond to a call from a construction site. A \"stacker\" droid is dropping heavy bags of material from many stories up. Ramsey refuses to take the job himself due to his acrophobia. Karen takes the job and is able to easily deactivate the droid.",
      "writers": ["Michael Crichton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0088024/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMDE3Mjc2MF5BMl5BanBnXkFtZTcwNDQwMzcxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Selleck, Cynthia Rhodes, Gene Simmons | See full cast and crew »"],
      "reviews": [
         "This was a decent suspense film with a different twist for its day, dealing with robots. The idea has since been copied in a few films. Here, cops go after runaway robots and after a villain who is trying to steal deadly weapons (gosh, that's original). The special effects are pretty good - especially since this was made over 20 years ago - and I particularly enjoyed watching the heat-seeking bullets fired from the villain's gun. Rock star Gene Simmons, by the way, does a nice job as the bad guy. As entertaining as this Tom Selleck movie was, it had a B-quality to it with some stupid and predictable dialog. The climactic scenes were very predictable. You just knew certain things were going to happen...and they did. Yet, it was fun to watch and worth one look.",
         "One of the biggest misconceptions about this classic scifi flic is that it is set in \"the future\" where robots are prevalent. Quite the contrary. The premise of the movie is a world in which the development of robots evolved at the same rate as that of the home computer, becoming every bit as common-place and mundane. This is revealed in the opening scene where some small renegade field bots are described as using an \"8088 microprocessor\", the most common Intel CPU used in all IBM desktop PC's that year (1984). If this were the future, the writers would likely of made up some fictional processor of the future rather than date the film with currently available technology. The cars in the film are no more futuristic than cars of the same year as the film, nor is the construction of any homes (no pools in the living room or places to plug in your nuclear toaster). Only items relating to computer technology are any different, and even that was no more advanced that was was currently available at the time (though of course what was DONE with that technology is pure fiction). I think knowing this fact adds to the enjoyment of the film. Too many people seem disappointed that the movie doesn't seem \"futuristic enough\".",
         "A lot of critics complain about this movie but it was very well made for it's time. Not only does the movie show robots going out of control but it also shows a society of complete distrust and characters that are very cold. Gene Simmons from Kiss is perfect in the role with his looks and his voice as a sadistic villain that keeps managing to circumvent authorities. Chris Mulkey a bit actor is also good as an idiot that gets involved with Simmons. The script and soundtrack are excellent. Tom selleck also goes well as a frustrated cop who is fiercely determined to stop the bad guy and is humorously sarcastic to the people he deals with.",
         "Like quite a few of these 'forgotten' films of the 80s and 90s, I read about this before actually seeing it. Having an interest in Kiss, I wanted to see if Gene Simmons could act. As bad guy Luther, he does pretty well, but there's nothing particularly remarkable about his performance. The other performances are okay. Tom Selleck and Kirstie Alley are rather good in their roles. POLICE ACADEMY's G.W. Bailey has a straight role as the Chief of Police (the typical by-the-book type who always chews the hero out). The storyline is very good. As it's written by Michael Crichton, it's another tale of technology gone bad, although this time, it was a deliberate human act which caused the mayhem. The film book I read about RUNAWAY in said basically that between WESTWORLD and JURASSIC PARK, two of the best known sci-fi films ever, Crichton made this film. This is true, but while WW and JP are remebered, this film is largely forgotten. Granted, this film is hardly a classic, but in my opinion, there are times when you go 'who cares' and just sit down to a good, entertaining picture. I recommend RUNAWAY for a viewing. Although, this movie, and some episodes of STARGATE SG-1 seem to confirm that some people find tacky-looking mechanical spiders scary. Which I don't.",
         "From the master of technophobic paranoiac pseudoscience fiction, Michael Crichton, comes this tense, well-made suspense thriller. Anybody interested in AI, robotics and cybernetics will have a difficult time suspending disbelief as Selleck is forced to fight off a few battalions of homicidal gadgets under the influence of a mod chip programmed to identify specific human targets, with all of the cyber-evil ultimately under the control none other than Kiss lead singer Gene Simmons. If this sounds ridiculous, please understand that this film is not above a little self-deprecating geek humor - for example after the first action sequence, where Selleck has chased down a runaway farm implement, he refers to the CPU of the unit as an old 8088. OK, if you got this joke, you might appreciate the rest of the film's comic relief. If not, you should enjoy it for its solidly entertaining suspense. The soundtrack (Jerry Goldsmith) often hurts, but has a few good moments. Some of Gary Numan's darker and weirder stuff from around the time this film was released might have been a better choice, or perhaps even Jean Michel Jarre. Tom Selleck does well in his physically and emotionally demanding role, playing a police officer with vertigo who is assigned to disable runaway robots. To his credit, none of Crichton's robots are the standard ludicrous anthropomorphisms we see in schlock-fests like I Robot and The Clown Wars, but rather mechanical hardware things as innocuous as boxy agricultural drones which pick bugs from cornstalks and turn them into fertilizer and housekeeping automatons which look only slightly more advanced than today's robotic vacuums. Cynthia Rhodes steals this show. Her performance is so spot-on that I was compelled to look her up here immediately after seeing this movie for the second time. See for yourself: http://www.imdb.com/name/nm0722407/ I am astonished and intrigued by her extremely low profile. Please e-mail me if you have an explanation for this! Gene Simmons is about what you would expect, he delivers his lines with little tangible feeling, overacts frequently, and does well with looking weird and menacing, but has little sense of pace or complex facial expression. Kirstie Allie gives a fairly standard performance, and Chris Mulkey, not unusually, puts in a very nice effort for his relatively minor role. The rest of the cast is quite good. I'm not a big fan of more recent Crichton films, but I really enjoy his earlier works, especially Andromeda Strain and this film. I remembered seeing this about twenty years ago and being pleasantly surprised. My second viewing, just an hour ago, was just as entertaining. Sure the soundtrack, hairstyles and some of the dialog are outdated, but the themes, characters, and even the plot are not.",
         "Okay this movie is far from perfect. However, on a rainy day, or lazy weekend afternoon the movie is highly enjoyable. Like a lot of movies it starts out great but gets a little silly towards the end. What makes this movie is Tom Selleck. He is a very under-appreciated actor, who always seems to breathe life into the dullest of movies. Here he takes what could of been a much sillier movie and brings a lot of believability to his role and to the story. Even if it is about robots going nuts. Michael Crichton directed this one, strange that he didn't write it as a book first, cause it is a great story. A little ahead of it's time which might explain it's poor performance with the critics and at the box office. Definitely worth checking out. Great Jerry Goldsmith score.",
         "OK, for some reason, in the future we have larger than necessary robots doing the jobs that humans are tired of doing. When they screw up, Tom Selleck is here to use the awesome authority he has in the police force to shut down (usually destroys) these robots before more harm is done. There are field bots for corn crops, house bots which do the dishes and the like, constructo-bots that stack things where you need them to stack things, and office bots and all different types of them. Now, Tom Selleck has another job of fending off spider bots, which were designed to sadistically kill people at the will of Gene Simmons' character. But Selleck better fend off Simmons' crazy magic bullets which contains an explosive in each one, but only goes after exact people who are programmed in it to kill. Sound crazy...yeah, it was. A stretched-thin story made good use out of its imagination. The special effects were OK (the magic bullet-cam, the laser-gun Selleck uses, the \"fast\" RC-cars packed with explosives), but most were pretty rudimentary compared with others at the time. The music was done by Jerry Goldsmith (a plus) who's worked on Legend, Alien, The Omen, Chinatown, Basic Instinct, Gremlins, and a slew of others. Gene Simmons was an interesting choice as the bad guy (who apparently was only chosen after seeing him mug an evil-looking face for a while), but he was entirely too evil for his brainiac ways that he was supposed to be. Kirstie Alley was probably cast after saying yes to her strip-down scene (in which you don't see any nudity). It was cool to see Joey Cramer (from Flight of the Navigator fame) and GW Bailey (from Police Acamdemt fame) as extra characters. Tom Selleck was always on as the hero with a fear of heights. It was an interesting and weird tale of the future with robotic bullets and robots running amuck, but the fun was very average during the whole film, with little more than corny little jumping and exploding robots to remember. And what is up with all the sparks at the end credits? Are there welders above them repairing an important job or what? Whatever...interesting to see.",
         "An under-appreciated vision of the future, unique for it's time, and now another example of how wrong we were in the 80's about what the future would be like. We don't have the robot servants in our homes, or the radars in our cars, but this is still the sort of movie you can watch again every few years. It's just a good movie by any definition, and I recommend it to anyone. Gene Simmons obviously had fun playing the role of the main villain, and like Mick Jagger and Deborah Harry(Blondie) he performs even better as an actor than he did as a musician, and that says alot. But on to the review: Tom Selleck is some sort of cyber cop specializing in rowdy robots that have gone out of control, and finds an adversary in Gene Simmons, who is making robots evil by substituting evil microchips for their regular ones. This movie is just plain good. Might even be the first instance of Kirstie Allie playing a part that would normally have been assigned to Meg Foster. Whatever happened to her?",
         "I had been vaguely interested in seeing this film for a while before I got down to it, for the prospect of a film directed by Michael Crighton (RIP), starring Tom Selleck and Gene Simmons and featuring evil spider robots was very inviting to me. It is pretty fun, but never reaches the heights it could do. Selleck plays a cop who suffers from vertigo and has the job of diffusing robots that have gone astray. His job mostly involves stopping runaway farming robots or misfiring security drones, but unfortunately someone has got a hold of micro chips that can make robots turn evil. So, Selleck and his partner, ably played by Cynthia Rhodes get on the case and find themselves up against a malign Gene Simmons. Selleck can do this sort of thing in his sleep and is effortlessly convincing, whilst Simmons plays a bad guy pretty well. Sadly the film is underwritten and has a few plot holes as well as lacking any real sense of emergency. The effects are pretty nice mid 80's stuff and the robots are well made, especially the spider robots that are a tad underused, apart from the cool finale. There are some good action sequences and the film has a swell pace, but somehow its just never that impressive. It sorely needed more violence, more intensity, or at the very least better writing, with the scenes dealing with Selleck's home life absolutely horrible. There isn't much in the way of characterisation, but Crighton does at least handle the action well and there are at least two decent set pieces. Altogether, this is worth a look for robot movie buffs or 80's nostalgia fans and its easygoing good fun, but definitely no classic.",
         "Whilst not expertly handled by director Crichton (yes, Michael Crichton), Runaway at least succeeds in being reasonably interesting and very watchable. It's one of those movies that succeeds in being very enjoyable without actually being that good. There is something very comfortable about the tone of the whole film. Whilst most of the set-pieces could have been more tightly edited and paced, there is an undeniable consistency in the visuals throughout. Coupled with this is an impressive electronic score by the legendary Jerry Goldsmith, done in the same year as his beautiful work on Ridley Scott's Legend, at which time Goldsmith was in the process of moving over to synthesizers. Not great, not bad, just fine. Memorably throwaway. PS Gene Simmons (from Kiss) makes a nasty-looking villain."
      ],
      "genres": [
         "Action",
         "Crime",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Delphi III Productions"
      ],
      "summaries": [
         "In the near future, a police officer specializes in malfunctioning robots. When a robot turns out to have been programmed to kill, he begins to uncover a homicidal plot to create killer robots... and his son becomes a target.",
         "In the near future, a police officer specializes in malfunctioning robots. When a robot turns out to have been programmed to kill, he begins to uncover a homicidal plot to create killer robots... and his son becomes a target."
      ],
      "budget": 0
   },
   "movielensId": 3937,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-12-14",
      "dvdReleaseDate": "2000-08-29",
      "directors": ["Michael Crichton"],
      "runtime": 100,
      "movieId": 3937,
      "title": "Runaway",
      "mpaa": "PG-13",
      "actors": [
         "Tom Selleck",
         "Cynthia Rhodes",
         "Gene Simmons",
         "Kirstie Alley",
         "Stan Shaw",
         "G. W. Bailey",
         "Joey Cramer",
         "Chris Mulkey",
         "Anne-Marie Martin",
         "Michael Paul Chan",
         "Elizabeth Norment",
         "Cec Verrell"
      ],
      "imdbMovieId": "0088024",
      "originalTitle": "Runaway",
      "genres": [
         "Thriller",
         "Crime",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["lA6ybohAVq8"],
      "plotSummary": "In the near future, a police officer specializes in malfunctioning robots. When a robot turns out to have been programmed to kill, he begins to uncover a homicidal plot to create killer robots... and his son becomes a target.",
      "tmdbMovieId": 9507,
      "avgRating": 2.9029,
      "releaseYear": "1984",
      "numRatings": 690,
      "posterPath": "/PqQCNaw2FfOgDQGruvBwjAx5wD.jpg"
   }
}