{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0338133",
      "video": false,
      "title": "Dandelion",
      "recommendations": [
         19796,
         20548,
         89280,
         202960,
         114172
      ],
      "backdrop_path": "/90S5hiJNmOPf09EbFwLTuEvKXE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Mason Mullich",
               "gender": 2,
               "credit_id": "52fe46d39251416c75084c7b",
               "name": "Vincent Kartheiser",
               "profile_path": "/y2i2epgCOwfMyC5FclcF3IU8Iy3.jpg",
               "id": 52646,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Danny Voss",
               "gender": 1,
               "credit_id": "52fe46d39251416c75084c7f",
               "name": "Taryn Manning",
               "profile_path": "/ujPqJgRvOVaTgVI5qTWHBSM6BB3.jpg",
               "id": 343,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Luke Mullich",
               "gender": 2,
               "credit_id": "52fe46d39251416c75084c83",
               "name": "Arliss Howard",
               "profile_path": "/zDBEVA7Skrje3A8bmR2VOJRwkZc.jpg",
               "id": 3229,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Layla Mullich",
               "gender": 1,
               "credit_id": "52fe46d39251416c75084c87",
               "name": "Mare Winningham",
               "profile_path": "/hDaZAbMo9fLranbNDei5e0t8VjL.jpg",
               "id": 51544,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Mrs. Voss",
               "gender": 1,
               "credit_id": "52fe46d39251416c75084c8b",
               "name": "Michelle Forbes",
               "profile_path": "/6xjsXKZs23a1Vzdw4uSUiV64BFS.jpg",
               "id": 41820,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe46d39251416c75084c77",
            "name": "Mark Milgard",
            "profile_path": null,
            "id": 234859,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.717415,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16430,
      "vote_count": 5,
      "budget": 0,
      "overview": "In a small town of rolling fields and endless skies, isolated 16 year old Mason lives in a world where families exist in fragmented silence and love seems to have gone missing. Then Mason meets Danny, a sensitive and troubled girl, and their tender bond is soon tested after a fatal accident and a series of complications takes Mason away for something he didn't do.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769,
         793
      ],
      "original_title": "Dandelion",
      "runtime": 93,
      "poster_path": "/32hnycB3Z0qCegmjXwyMFW0OKoj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2004-01-01",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Milgard"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Mark Milgard",
         "Robb Williamson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0338133/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5NTIyNTEwNF5BMl5BanBnXkFtZTcwOTkwNzIzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent Kartheiser, Taryn Manning, Arliss Howard | See full cast and crew »"],
      "reviews": [
         "I was at a film festival securing my seat for the movie that followed Dandelion, and so in turn had to watch it. When I read the write-up for it in the program all I could think was, \"Jeez, I have to sit through this really bad and boring movie to watch the movie I want to see\" *sigh*. Boy was I wrong. The opening scene alone had me hooked. For all of those who have yet to see this, the movie opens with a very teary Vincent Kartheiser placing a .357 in his mouth and pulling the trigger. I was so amazed that I sat completely still waiting to see what would happen next. I'm not typically a drama-movie guy. I like action, explosions, nudity, horror and just plain disgusting things in movies. This movie has very little if any of the afore mentioned things. What this movie does have though is amazing sense of compassion and real life circumstances that draw the viewer (this viewer at least) into this hypnotic trance where you just can't take your eyes off of the screen. It makes me think of other movies that I was blown away by, American History X, The War Zone (Tim Roth's) and Niagara Niagara. Dandelion included, I am amazed by how films can touch a part of you and make you realize certain things about yourself that relate so well to the characters in the film. Let me also say that every character in this film is played fully and believably by the actors portraying them. The scenery from upper Washington and Idaho where it was shot adds so much to the film itself that I find it impossible to imagine this film being as believable and prolific if it were set anywhere else. We had a Q&A session after the film with producer, Molly and actor, Vincent. Two of the coolest people whom I have heard from in quite a while. They were both very candid and very happy about how well the film was received. As they both should be. If you have any time or any ability to see this film either at a festival or in a theater or at home on DVD, please do yourself a favor and watch it. This is coming from a guy who have never seen it except by accident who is now a devoted fan.",
         "There isn't much to say about Dandelion that the film doesn't say for itself. Form the beautiful shots of Idaho fields to the perfectly understated acting, Dandelion is its own greatest compliment. The editing, although only using very few techniques succeeds in making the most powerful transistions possible. As well, for a movie of its length and bare bones story it is amazing that the film never feels boring. Most directors would have felt like making Dandelion a short, but in its full length one can see its true colors. Anyone who watches independent film will not be surprised by the plot, but the beauty with which Dandelion executes the simple story is a testament to artistic film making.",
         "\"Dandelion\" is a hauntingly beautiful contemporary spin on \"Splendor in the Grass,\" with pervasive forebodings of how the endless horizons of the American Western prairie can lead to claustrophobic traps. Debut director/co-writer Mark Milgard masterfully makes the long hot summer of the lovely Idaho and Washington landscapes redolent with both the magic of young love and the dread of violence in a very \"Days of Heaven\" fashion. The perceptive camera fills in the silent gaps of the inarticulate characters, between parents and their teens, between parents and between teens. The sins of the parents are literally visited on the children. The action is moved along not by theatrically explosive explication but by the existential choice that each character makes, even as one gently points out that his passivity at a key point was a choice. Using cinema as a storytelling technique, the director unveils these choices visually. Key to the success of this approach is Vincent Kartheiser. We certainly had no trouble thinking he was from another dimension in TV's \"Angel,\" and here his emotive face and saucer eyes are Garbo-like to the camera. His \"Mason\" almost non-verbally goes from sullen son huddling under his hair to opaque Billy Budd-like martyr to an achingly enraptured Romeo. His sudden bright smile lights up the screen and forecasts the potential for hope and love as much as his tear-filled eyes drown our hearts. Every feeling felt or shut down is reflected in that face and eyes. Kudos to Kartheiser for not choosing to be another of the WB TV Boyz -- was he in college in between?-- and instead taking an offbeat role. No wonder Taryn Manning's \"Danny\" finds the scrawny sensitive kid irresistible even when a more conventionally hunky bad boy Shawn Reaves (of TV's \"Tru Calling\") is a rival (though the triangle plays out in an atypical fashion). She sensitively exudes toughness and vulnerability, in a different way than she did in \"Hustle & Flow,\" as she blossoms into what \"Mason\" sees in her. The parents are also atypically not inconsequential and the excellent acting by the adults ratchets up tensions (though a post traumatic stressed syndrome Viet vet uncle and a grief-stricken mime out of Springsteen's \"Reason to Believe\" are a bit too much). Arliss Howard well captures a nice guy who nevertheless commits terrible emotional abuse on his wife and son. Mare Winningham starts out as the usual tippling oblivious homemaker, but brings real feeling to the last part of the film, in both an explosion of frustration and of an almost pieta scene of sympathetically stroking her inconsolable son's hair. Michelle Forbes is commendably almost unrecognizable in a very atypical role for her as a troubled single mom who destroys her daughter's self-esteem. The film well shows how the adults start to perceive their kids' feelings and how that powerful life-affirmation affects them. Even though what was obviously a minuscule budget necessitated no changes in hair styles or aging make-up etc. to back-up the interstitial \"two years later,\" the weather beaten buildings and exquisite settings of meadows, creek, endless road and railroad tracks and big sky of bright clouds and overpowering rain are an essential component of the story, though I'm pretty sure the title image only appears once. While co-writer Robb Williamson's score captures the ominous mood and the indie rock song selections are illustrative, especially Sparklehorse ironically singing of a \"wonderful life\" and Cat Power covering Lou Reed, the visuals reminded me of a country song: \"You know the world must be flat/'Cos when people leave town, they never come back.\" (from \"Small Town Saturday Night\" by Alger and DeVito, popularized by Hal Ketchum). There have been some other films lately dealing seriously with teens and parents amidst death and first love, including the suburban \"Winter Solstice\" and \"Imaginary Heroes,\" but I was the most moved by \"Dandelion.\" This is the most poignant, mature portrait of young people in rural America since \"Tully\" and \"All the Real Girls.\"",
         "In my opinion, everything in this film is superior. The acting was incredible, storyline, plot and screen writing were very realistic. Some might say that the writing had too many curse words in it, but I think that it really showed realism. I actually cried a little during this film, and that's saying something, because I never cry during movies. I always look at them like a critic and manage not to cry during sad dramas. This one was very well casted, makeup was well done...and everything else. The Mullich parents, I think, had the best acting, especially Arliss Howard (Luke), since his character was very deep and complex. I think he pulled it off quite nicely. Taryn Manning and Vincent Kartheiser acted their characters incredibly well, the realism of it all just blew me away. I thought that everything seemed real and was all very well done. I applaud everyone involved and I would recommend this film to a great number of people.",
         "\"Dandelion\" is one of those films that seems like a good idea, mostly because of other films it reminds you of. In this case, the films it brings to mind are \"Donnie Darko\", \"American Beauty\", and particularly David Gordon Green's brilliant \"All the Real Girls\". While director Mark Milgard, along with his two (!) other screenwriters, obviously had their hearts in the right place, the end results leave a lot to be desired. Cinematographer Tim Orr (who works on all of David Gordon Green's films), does a typically great job at capturing beautiful, Malick-like landscapes, but Milgard blatantly lacks the poetic touch needed to find an emotionally resonant story within the picturesque environment. Instead, all he manages to come up with is an almost embarrassingly by-the-numbers coming-of-age story. The plot itself would not be such a problem if he had infused it with convincing characters or memorable dialogue, but alas he does not. The characters are wince-inducingly one-dimensional (the angry dad, the repressed alcoholic mom, the \"troubled\" girl next door, and of course the introverted, gloomy protagonist). I found myself all but begging the filmmakers to allow for some nuance to creep in, to allow the characters some kind of depth, but no. None of the characters are allowed to escape their stereotype for even a minute. This is particularly sad in the case of the lead Vincent Kartheiser, who did good work in Larry Clark's \"Another Day in Paradise\", and seemed able to deliver here too if he had been allowed to not play up to his morose stereotype of a character. Taryn Manning, on the other hand, left a lot to be desired. Although of course the filmmakers didn't help, her performance was still notably lacking. At times the film showed promise. In it's best moments, it recalled the great classic coming-of-age film \"Over the Edge\", as well as David Gordon Green's work. But it is actually that last comparison which ultimately proves what a flawed film \"Dandelion\" truly is. Where David Gordon Green's films always seem to unfold naturally, with no forced plot, \"Dandelion\" was full of contrived, obvious events. The biggest problem is that Milgard seems so obviously emotionally manipulative. Whereas David Gordon Green's films hit brilliant, unforced, emotional moments, \"Dandelion\" seemed intent on forcing you what to feel in the most obvious, unsubtle way. This contrivance ultimately amounted to the film more closely resembling achingly self-aware trendfests like \"Garden State\" rather than the Green or Terrence Malick it seemed to be attempting. In this respect, the dialogue was often particularly problematic as well. All and all, \"Dandelion\" is the kind of film I desperately want to root for, that I want to see succeed, yet it stubbornly insists on shooting itself in the foot at every opportunity it gets.",
         "I really can't understand why people keep making films that have basically been done before. Here's a common formula these days: Precocious loner teenager who doesn't fit in, hangs out with the wrong crowd, has a dysfunctional family, yet has a unique, intelligent and thoughtful nature that sets him apart from others. His eccentricities cause clashes with others. He generally meets a girl who likes him because he's different. Throw in a few tragic events and some bizarre twists and you've got yourself a quirky young art drama. Dandelion is textbook. About a half an hour into the film I realized how really similar it was to another film of this type, Donnie Darko, and this opinion was only strengthened as the film went on. I'm not saying that this kind of cookie-cutter quality is enough to entirely ruin a film all by itself, but Dandelion's problem is that it has little to make it interesting. At least Donnie Darko had a bizarre science fiction plot and occasionally good humor. Dandelion is for the most part unremarkable. The writing is almost pure cornball- characters wax about love and life in short, uninteresting conversations. The plot has its unique twist, but decides to give it little attention and move on to the boring heartwarming business at hand. The kid is pretty good. The girl is awful. The performances given by the parents are by far the best parts of them film, in particular the stressful father with regrets, the only character in the film with much ambiguity about him. By far the best aspect of the film is its cinematography. Tim Orr, who you may also know from his work on the similarly rural (the unsimilarly fantastic) films of David Gordan Green, is good at shooting grass, air, and water and making it look great, though the nature shots appear too often for my tastes, seemingly between every scene. And I swear I heard almost nothing in the film that I hadn't heard before. At one point early on, on his first real meeting with the love interest, the main character says \"I think love is something people make up to make themselves feel better.\" This is just about the most poignant or deep thing the kid, or any character, can think to say. If you think this observation is the pinnacle of brilliance, you'll probably love the film. It will also help if you really really like to watch wheat fields blow in the wind. Want a good 'troubled precocious loner' movie? Watch The Adventures of Sebastian Cole.",
         "This was an absolutely, as someone else before said, textbook angsty coming of age movie. The thing is I usually really like a good independent coming of age movie. But this was terrible. I struggled through this movie every step of the way. In fact, half-way through the movie, I had to stop, go to scene selections, and pick the last chapter of the movie to browse it to see if the movie got interesting. It looked like it did although was pretty sure they were going to find a way to make it underwhelming anyway, which they did. I have a lot of problems with this movie. The beginning is one. After watching the whole thing, I can say with confidence that they threw in that gun-in-the-mouth scene just to shock us into watching the whole thing to see how the events lead up to that. But it turns out that he never actually does it anyway. Another problem is that the person playing the girl looked too old for the character. She is playing a 16/18 year old girl but her face looks like late 20's perhaps even early 30's. It completely drew me out of the movie. Then there is the fact that after only the second time of even seeing each other the girl kisses Mason. There wasn't even any good build up to it. It just made her seem slutty. I also found her suicide highly aggravating. I am sorry but she was not mentally strong enough to kill herself by simply throwing herself in the slow-moving stream. She could not have resisted bringing herself back up for air. Even Virginia Woolf had to weigh herself down with rocks so she could drown herself. Another bothersome event in the film was the fact that they just skipped the kid's 2 years in jail. I mean they just completely ignored a great opportunity to build on the depth of his character, his relationship with his parents, and development of anything with Danny. There is also the fact that no one in this town goes to high school or college or talks about it when they are out of it or not going to it. At least Mason should have been talking about it because he's supposed to be the angsty teen whose too smart for his dive of a town. But he is not smart because to him apparently the only way to escape his town is suicide or in the end to hop on a train and in probability become a bum. So in the end he is stupid and depressed which makes for a very uncompelling character. I thought the Father did a good job but they didn't do enough with him. We don't even learn if he won the election or not after he ends up accidentally killing one person and sending his son to jail for. The only thing I find no fault with in this movie is the setting. It is gorgeous and I doubt anyone can argue against that.",
         "I knew I was in trouble when the picture comes up and there's Vincent Kartheiser (better known as Connor from the Angel TV show); I knew I was in more trouble when, as he lay against an unending field of amber grain, he puts a revolver into his mouth and blows his head off. Dandelion is a long, boring, depressing film about boring, depressed kids stuck in the middle of the heartland somewhere (though blessed with the ability to walk for miles and miles in seemingly no time at all). Kartheiser plays the mopey lead Mason, whose father (Arliss Howard) is perpetually angry and whose mother (Mare Winningham) drinks to cope. The first forty-five minutes or so concerns itself with Mason covering for an accidental hit-and-run his dad commits (and no reason is ever given for the sullen boy's unspoken act of heroism. There's no displayed love between father and son. He just does it, for no reason); and the second half of the film covers Mason's relationship with Danny (Taryn Manning), a girl almost as depressed as he because her mom (a bloated, blonde Michelle Forbes) moves around so much she has no roots and no sense of self. Naturally these two bring some spark of happiness to one another; his parents almost seem glad, but her mother decides to move again, sparking, gasp, a conflict. I was surprised to see that this film ran only 93 minutes. It felt well over two hours, like one of those butt-numbing Peter Jackson epics. The pacing is so slow and the characters so lethargic and apathetic that it's hard to feel anything during the course of the film. There's some gorgeous Midwestern scenery, but I think the filmmakers were going for bleak isolation rather than bountiful plenty. Not that most of you have even heard of this film (no accident there), but now that you have, avoid it. You must by default have some better way to kill 90 minutes than to watch this film. Should you happen upon it at a rental place, or even online, do yourself a favor I failed to and pass on this clunker.",
         "a very delicate movie illustrating how close freedom and sacrifice may match in human relationships. dialogues often strip the character's inner self to their respective bare essence, and everyone is respected here, not judged. to me, there's few films that expose the emotional impact of words as detailed as this movie. and the director took great care to recognize nature's tranquilly (and enormity in some case) as a safe haven to retreat if you have problems. some may actively choose it as a last haven, some may decide to seek freedom in other ways. to complete the movie's religious feel, the music's one with a lot of what's happening you should see the movie being seated in a quiet corner",
         "I saw this movie at the Rotterdam-FilmFestival in Februari. It was a stormy dark day, a kind of weather which is also predominant in Dandelion. The Director was present and after the movie he told us a little bit about why he made the movie. He wanted to show in what circumstances the teenagers in the Midwest grow-up, how sad there existence can be. I didn't fully agree with him, because I think you can also extract positive things from Dandelion, for instance that teenagers can be happy with each other, even when there parents are very unhappy. But the final conclusion is indeed that the unhappiness of parents rests heavily on their children and passes inevitably on to them. I was pleasantly surprised by the actors' wonderful playing and I hope I will see more of them. It's a pity that so few 'alternative' American movies reach Europe. So, to encourage Directors of these kinds of movies to go on like this, I gave a 9, instead of an 8."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Ballistic Media Group",
         "Ruth Pictures LLC"
      ],
      "summaries": ["In a small town of rolling fields and endless skies, isolated 16 year old Mason lives in a world where families exist in fragmented silence and love seems to have gone missing. Then Mason meets Danny, a sensitive and troubled girl, and their tender bond is soon tested after a fatal accident and a series of complications takes Mason away for something he didn't do. Upon his return, the two find what they're looking for - but with tragic consequences."],
      "budget": 0
   },
   "movielensId": 39394,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-01-01",
      "dvdReleaseDate": "2006-01-03",
      "directors": ["Mark Milgard"],
      "runtime": 93,
      "movieId": 39394,
      "title": "Dandelion",
      "mpaa": "",
      "actors": [
         "Vincent Kartheiser",
         "Taryn Manning",
         "Arliss Howard",
         "Mare Winningham",
         "Michelle Forbes"
      ],
      "imdbMovieId": "0338133",
      "originalTitle": "Dandelion",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In a small town of rolling fields and endless skies, isolated 16 year old Mason lives in a world where families exist in fragmented silence and love seems to have gone missing. Then Mason meets Danny, a sensitive and troubled girl, and their tender bond is soon tested after a fatal accident and a series of complications takes Mason away for something he didn't do.",
      "tmdbMovieId": 16430,
      "avgRating": 3.27273,
      "releaseYear": "2004",
      "numRatings": 33,
      "posterPath": "/32hnycB3Z0qCegmjXwyMFW0OKoj.jpg"
   }
}