{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0202641",
      "video": false,
      "title": "Two Family House",
      "recommendations": [
         110624,
         71825
      ],
      "backdrop_path": "/Atj3YhSZDnmtaFP4GnsZwDCeBep.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Buddy Visalo",
               "gender": 2,
               "credit_id": "52fe46c2c3a368484e0a245f",
               "name": "Michael Rispoli",
               "profile_path": "/mRS7DAXhuLu8Z7PAlicm6kP0EZz.jpg",
               "id": 18313,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mary O'Neary",
               "gender": 1,
               "credit_id": "52fe46c2c3a368484e0a2463",
               "name": "Kelly Macdonald",
               "profile_path": "/ncpSRbNH44itdir2FLJHsD0nGVV.jpg",
               "id": 9015,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Estelle Visalo",
               "gender": 1,
               "credit_id": "55f8a5a8925141080f00066a",
               "name": "Kathrine Narducci",
               "profile_path": "/96Ni5pAILMiSAARvej9IKd5w8R8.jpg",
               "id": 17920,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jim O'Neary",
               "gender": 2,
               "credit_id": "52fe46c2c3a368484e0a246b",
               "name": "Kevin Conway",
               "profile_path": "/803hyktASensafHsdvDCnlzWK8k.jpg",
               "id": 27116,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c2c3a368484e0a2471",
               "name": "Raymond De Felitta",
               "profile_path": "/nM5EwzXwVGWgFL50c4Bj5rvvsFc.jpg",
               "id": 99496,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c2c3a368484e0a2477",
               "name": "Raymond De Felitta",
               "profile_path": "/nM5EwzXwVGWgFL50c4Bj5rvvsFc.jpg",
               "id": 99496,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe46c2c3a368484e0a247d",
               "name": "Anne Harrison",
               "profile_path": null,
               "id": 238443,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c2c3a368484e0a2483",
               "name": "Alan Klingenstein",
               "profile_path": null,
               "id": 238444,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c2c3a368484e0a2489",
               "name": "Jim Kohlberg",
               "profile_path": null,
               "id": 238445,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c3c3a368484e0a248f",
               "name": "Adam Brightman",
               "profile_path": null,
               "id": 238446,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c3c3a368484e0a2495",
               "name": "Michael Mayers",
               "profile_path": null,
               "id": 238447,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54bb89949251416e6000129d",
               "name": "David Leonard",
               "profile_path": null,
               "id": 112576,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.308652,
      "production_countries": [],
      "id": 63956,
      "vote_count": 6,
      "budget": 0,
      "overview": "Buddy Visalo (Michael Rispoli) is a factory worker, a frustrated crooner who once had a shot at the big time. Buddy's dreams of greatness have been reduced to an endless series of failed moneymaking schemes. His latest is buying a two-family house for him and his wife, Estelle (Katherine Narducci) and converting the ground floor into a neighborhood bar where he can perform. The wrench in the works is that he also inherits the upstairs tenants, Mary,a pregnant Irish girl fresh off the boat (Kelly Macdonald) and her abusive, alcoholic husband, Jim (Kevin Conway). As Buddy's gang of Italians tries to handle the situation, the girl goes into labor, and a baby is born, forcing them all to confront the limits of their tolerance and compassion.",
      "similar": [],
      "original_title": "Two Family House",
      "runtime": 104,
      "poster_path": "/bTtPrdB25Tidhl7Z04Xi3qLj2co.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-01-21",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The only way to find out what you love is to risk everything you have.",
      "adult": false,
      "homepage": "http://www.twofamilyhouse.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Raymond De Felitta"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Raymond De Felitta"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0202641/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3MTUzODAxOF5BMl5BanBnXkFtZTcwMjYyNjEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Rispoli, Kelly Macdonald, Kathrine Narducci | See full cast and crew »"],
      "reviews": [
         "Raymond DeFelitta, the director of the current release, \"The Thing About my Folks\", working with his own material, created this wonderful film, which should be seen more often. Unfortunately, when this film first came out, it had wonderful notices, but alas, it disappeared too soon for us to catch up with it. Thanks to HBO, the film was shown recently and it proved to be worthy of the praise we had heard about. The story takes place in the fifties. The characters at the center of the film, are basically Italian-Americans living in Staten Island. Buddy and Estelle Visalo, are the owners of a two family house in need of repairs. The upstairs apartment has been rented to an Irish couple, Mary and Jim, who are going through a rough moment in their lives. Buddy, with the help of his friends from the tavern that is the social meeting point of the neighborhood, is trying to evict the couple upstairs, after it's clear they are up to no good and can't pay the rent. It proves to be too late because Mary begins her labor pains and Estelle, who doesn't like the woman, helps in the delivery. But horror of horrors, the little baby proves to be much more than what Mary was expecting, and Jim abandons her. The Italian landlord develops a friendship toward Mary, who he succeeds in evicting, but feels terribly about it. He rescues her from the flea bag hotel where she is staying since her own sister doesn't want her. Buddy finds, and pays, for an apartment for Mary and her son. It's clear that Buddy and Mary go from a friendship into a relationship that will change their lives forever. The film works because the charismatic work of Michael Rispoli, who as Buddy, is a man with a heart of gold. Mr. Rispoli is an actor that is always good, no matter what character he plays. Also the movie has an inspired performance by Kelly MacDonald. Ms. MacDonald does good work as Mary. The supporting cast, Kartherine Narducci, Kevin Conway, Matt Servitto, Vincent Pastore, and the rest, are perfect. We look forward future endeavors by Raymond DeFelitta, who proves with this film he can tell a story that involves the viewer in more ways than some others. \"Two Family House\" is a small movie, with a big heart!",
         "It seemed strange to see the decidedly outer-borough \"Two Family House\" at an expensive Manhattan movie theater, until during the opening credits two old ladies sat in front of me, put their coats on the two seats between them, and proceeded to loudly comment on the proceedings to each other throughout the whole movie. Much like the friends of the protagonists do in this very sweet yet honest depiction of post-WWII life on Staten Island when an off-islander disrupts the quotidian. While it drags a bit here and there, and the voice-over narration sometimes re-states the already visually obvious, the very New York characters (including one played by \"Pussy\" of \"The Sopranos\") are real people in real situations and realistic traps. This is less schmaltzy than Barry Levinson's Baltimore nostalgia-fests. Filmed in Staten Island, Jersey City and Bayonne, the settings are accompanied by lovely period music by the John Pizzarelli Trio (who also does a cameo appearance as Julius LaRosa). This is one of those small, charming indie movies that seems to be a labor of love, like a jewel of a short story. (originally written 10/14/2000)",
         "Buddy's repressed. A young Italian-American man living in Staten Island in 1956, he sees opportunity all around him. It's laying there waiting for him to pick it up and run with. Except for one major obstacle, his wife Estelle. She wants only for Buddy to find his narrow niche in the local community, with its dead-end job and familiar surroundings, and exist quietly in her idea of the American dream. But it's not Buddy's vision. So Buddy perseveres, undercut at every turn by Estelle. He finally manages to buy a two-family house to turn into his dream; a bar on the first floor, his home on the second. The current occupants are a foul-mouthed white trash Irish immigrant family, the very young wife in a very pregnant way. When she gives birth to a child whose father is obviously black, the older husband abandons her. And from this point Buddy's life journey takes a remarkable turn. Two Family House is a prototypical Indie film in all its positive aspects. It does very well with little budget, maximizing the contributions of cast and crew. The uplifting story is told without pandering or exploitation. The movie's not great, but it is effective, and most importantly, very enjoyable.",
         "I just saw this movie on IFC and I loved it!! It has a great story line and the character were well developed and I could really relate to them. I'm glad I came across this, I hope to see it again soon. The story is well developed and I like how the ending turned out. I feel like it is another classic love story, and I'm not one to really like \"mushy\" films, but this is one is really a classic. I could just feel the main character and his dreams and wanting to 'break out'. I hope I can find the film on DVD or VHS. I like how the story touched on racial issues in the 1950's. I wonder if this is based on a book, because it has alot of focus on characters.",
         "People who talk about love and not act on it or show what it can do in this world of war and ignorance should watch this movie and learn from it. It takes a lot of inner strength to change the world for good and love is the fuel power that drives us to that change. I wish all of us can find that great power to love one another and change the path of hate to the path of love. Great movie and BIG thanks to all who made this movie possible. I wish we can have more great love stories happening in this world. Buddy is the main character who makes everything come together and I want to say that he was great man and people like that are bigger then life. Watch THE MOVIE.",
         "This film produces laughs and sighs by presenting the very believable antagonism of two working class ethnic groups in what then was New York City's rural borough, Staten Island. As in life generally there isn't a happy ending for all involved in relationships that are jarred by the real bigotry directed against an Irish immigrant who bore a black child while married to a drunkard of the first water (or whiskey). While Mary is clearly victimized, physically and psychologically, by her boorish Lushington of a husband the symbolic violence is the attitude of the Italian men and women who accept without thinking stereotypes of blacks and Irish. Their comfort in the supposed security of their shared little world was then and is now the hallmark of daily bias in America. The acting is superb. So what if Mary is gorgeous and Buddy average (a safe euphemism). Gregory Peck in a working class Staten Island neighborhood you're not going to find (hmm, is THAT a stereotypical remark?). Rent this film! It's terrific!!",
         "***POSSIBLE SPOLIER** I remember reading good reviews for this little film but never got a chance to see it in the theatre. But we rented it recently and enjoyed it very much. Full of real characters with real emotions and real conflicts, the movie moves along at a nice pace with some real twists and surprises along the way. Terrific performances (especially from the lead - Michael Rispoli - who can be over the top at times in other films or just give wonderfully layered performances - like on the Sopranos or his work as a priest in The Third Miracle). I also really enjoyed how a fake Hollywood ending wasn't tacked on. If a BIG star had been in this or a HUGE studio had been behind it, they would have insisted that he become a BIG star at the end and sells millions of records. Nope, all that happens is he follows his heart and ends up happy and content. Pretty darned cool.",
         "This is a wonderful film, that deals with the challenges of ethnic stereotypes and the cultural biases that go with them. Stereotypes are a definite by-product of culture, yet for the most part, usually the worst expressions of a particular culture. In adhering to our birth culture we invariably absorb certain stereotypes, and biases, without even realizing it. People therefore become stereotypical to a greater or lesser degree, depending upon their independence of thought, and self-awareness. The less independent minded, or self aware we are, the more stereotypical we may become. Two Family House is a very well-crafted drama, involving interactions between, an Italian couple, an Irish couple, and an anonymous African American man. The chain of events triggered by their interaction, gives birth to a beautiful love story involving the Italian husband of one couple, and the Irish wife and her child, of the other. Challenged by events that pushes them to the limits of their respective cultural sensibilities, the film portrays how these individuals for various reasons, either succumb to, or transcend, the biases, they were born into. The beauty of the movie is that it shows that through tremendous effort and resolve, it's quite possible to break free of cultural stereotypes, and the irrational hate, that invariably goes with them.",
         "I found this film by accident while programming my TIVO. The official description of the film didn't really relate with the story was all about. This is fine however, as we don't want to spoil the wonderfully conceived character-based plot. The growth of the characters, and the realizations that they make in the third act, is stellar. Overall, this film is a wonderful character piece that gives a glimpse of racial attitudes in the 1950's in New York (that don't seem so different from the attitudes in the 2000's). The acting was superb and the pace of the plot was crisp. I highly recommend adding this to your TIVO play list. As closing credits rolled, I thought that this is what an award-winning screenplay feels like -- and sadly that doesn't always translate into commercial success.",
         "Late afternoon on a monday, flipping through my 8 chanels of HBO, I found this little number and feel all the richer for it. Good acting and genuine make a shoestring budget feel and slightly implausible plot fade into the recesses of your disbelief. A warm, poignant story about the kind of guy that we can all relate to."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Filbert Steps Productions"],
      "summaries": [
         "An unseen narrator looks back to 1956, on Staten Island, when Buddy, an Italian guy with big dreams, buys a house planning to live upstairs with his wife Estelle and run a bar downstairs. The first problem is Estelle's lack of confidence in Buddy. Then, Irish tenants upstairs refuse to move and won't pay rent; plus, the woman upstairs is about to have a baby. The next problem is the baby: once he's born, it's clear his father was Black. The Irish guy splits; Buddy evicts mother and child, then feels guilt and sets her up in a flat while she sorts out an adoption. Estelle's lack of faith, the Irish lass's spirit, Buddy's dream, racial prejudice, and the baby's fate play out.",
         "A dreamer finds that his wife and friends are binding him to his mediocre existence."
      ],
      "budget": 0
   },
   "movielensId": 3951,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-01-21",
      "dvdReleaseDate": "2001-05-29",
      "directors": ["Raymond De Felitta"],
      "runtime": 104,
      "movieId": 3951,
      "title": "Two Family House",
      "mpaa": "",
      "actors": [
         "Michael Rispoli",
         "Kelly Macdonald",
         "Kathrine Narducci",
         "Kevin Conway"
      ],
      "imdbMovieId": "0202641",
      "originalTitle": "Two Family House",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["qthfxaN4EFo"],
      "plotSummary": "Buddy Visalo (Michael Rispoli) is a factory worker, a frustrated crooner who once had a shot at the big time. Buddy's dreams of greatness have been reduced to an endless series of failed moneymaking schemes. His latest is buying a two-family house for him and his wife, Estelle (Katherine Narducci) and converting the ground floor into a neighborhood bar where he can perform. The wrench in the works is that he also inherits the upstairs tenants, Mary,a pregnant Irish girl fresh off the boat (Kelly Macdonald) and her abusive, alcoholic husband, Jim (Kevin Conway). As Buddy's gang of Italians tries to handle the situation, the girl goes into labor, and a baby is born, forcing them all to confront the limits of their tolerance and compassion.",
      "tmdbMovieId": 63956,
      "avgRating": 3.69198,
      "releaseYear": "2000",
      "numRatings": 237,
      "posterPath": "/bTtPrdB25Tidhl7Z04Xi3qLj2co.jpg"
   }
}