{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "bookshop",
            "id": 817
         },
         {
            "name": "print shop",
            "id": 1225
         },
         {
            "name": "printer",
            "id": 1226
         },
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "1970s",
            "id": 1228
         },
         {
            "name": "becoming an adult",
            "id": 1412
         }
      ],
      "imdb_id": "tt0078771",
      "video": false,
      "title": "Love on the Run",
      "recommendations": [
         258,
         256,
         255,
         138093,
         49650,
         80799,
         60315,
         220949,
         146521,
         277866,
         160004,
         4962,
         216729,
         85924,
         163890,
         139169,
         339675,
         42237,
         46994,
         212596
      ],
      "backdrop_path": "/zbVMnmkkJGBt8cjmbLbt3WMjNOH.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "alexbakshaev",
         "id": "58b550699251410a80008bc1",
         "content": "Godawful opening and closing credits song apart, this final entry into the Antoine Doinel Saga is an enjoyable experience. Fairly briskly paced during the first twenty minutes or so, the film later sinks into a series of unnecessarily lengthy flashbacks, filmed in various aspect ratios.\r\nJean-Pierre Leaud is his usual charming self and the main reason to watch 'Love on the Run'. One only wishes Truffaut hadn't cannibalized his earlier works to beef up the film's running time.",
         "url": "https://www.themoviedb.org/review/58b550699251410a80008bc1"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Antoine Doinel",
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a577",
               "name": "Jean-Pierre Léaud",
               "profile_path": "/dzkPODapVe4CSubEqI9ytTCqnZ7.jpg",
               "id": 1653,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Colette Tazzi",
               "gender": 1,
               "credit_id": "52fe422fc3a36847f800a57b",
               "name": "Marie-France Pisier",
               "profile_path": "/ev1Z86iGonOJ8v3yGR7alaak0gg.jpg",
               "id": 3536,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Christine Doinel",
               "gender": 1,
               "credit_id": "52fe422fc3a36847f800a57f",
               "name": "Claude Jade",
               "profile_path": "/k4xPizzH9iiNezQRdsispRCw7uV.jpg",
               "id": 3507,
               "order": 2
            },
            {
               "cast_id": 18,
               "character": "Liliane",
               "gender": 1,
               "credit_id": "52fe422fc3a36847f800a583",
               "name": "Dani",
               "profile_path": "/1dyNd5JEvKYkgTKCT3Tn3RneiV1.jpg",
               "id": 3591,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Sabine Barnerias",
               "gender": 1,
               "credit_id": "52fe422fc3a36847f800a587",
               "name": "Dorothée",
               "profile_path": "/kPlltbEX0V7LXKDtcQ1EYYB1A3C.jpg",
               "id": 3592,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Xavier Barnerias",
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a58b",
               "name": "Daniel Mesguich",
               "profile_path": "/3Fbb5IlCgTqtX3d6kzjhtTeU94F.jpg",
               "id": 3593,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Monsieur Lucien",
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a58f",
               "name": "Julien Bertheau",
               "profile_path": "/gseBQvpph6ZYwBEsADw6G9f4nK7.jpg",
               "id": 3594,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Divorce Lawyer Dardignat",
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a597",
               "name": "Marie Henriau",
               "profile_path": null,
               "id": 3596,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Alphonse Doinel",
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a59b",
               "name": "Julien Dubois",
               "profile_path": null,
               "id": 3597,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Raoul Lecorps",
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a59f",
               "name": "Jean-Pierre Ducos",
               "profile_path": null,
               "id": 3595,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe422ec3a36847f800a525",
               "name": "François Truffaut",
               "profile_path": "/apCCV99N3FqB5NsEPqOzetlkprL.jpg",
               "id": 1650,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe422ec3a36847f800a52b",
               "name": "François Truffaut",
               "profile_path": "/apCCV99N3FqB5NsEPqOzetlkprL.jpg",
               "id": 1650,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 1,
               "credit_id": "52fe422ec3a36847f800a531",
               "name": "Marie-France Pisier",
               "profile_path": "/ev1Z86iGonOJ8v3yGR7alaak0gg.jpg",
               "id": 3536,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe422ec3a36847f800a537",
               "name": "Jean Aurel",
               "profile_path": null,
               "id": 3582,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 1,
               "credit_id": "52fe422ec3a36847f800a53d",
               "name": "Suzanne Schiffman",
               "profile_path": null,
               "id": 3583,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe422ec3a36847f800a543",
               "name": "François Truffaut",
               "profile_path": "/apCCV99N3FqB5NsEPqOzetlkprL.jpg",
               "id": 1650,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe422ec3a36847f800a549",
               "name": "Georges Delerue",
               "profile_path": "/yAlgcnY7fXUQLrxfknp0Jv4dUTv.jpg",
               "id": 3535,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe422ec3a36847f800a54f",
               "name": "Laurent Voulzy",
               "profile_path": "/cam7P5AgjOdx9mSfWPS0i43H9TF.jpg",
               "id": 3584,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe422ec3a36847f800a555",
               "name": "Néstor Almendros",
               "profile_path": "/3O9fLu6Mc1AYHHOh3DFwSO9vveY.jpg",
               "id": 3569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe422ec3a36847f800a55b",
               "name": "Martine Barraqué",
               "profile_path": null,
               "id": 3585,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe422ec3a36847f800a561",
               "name": "Jean-Pierre Kohut-Svelko",
               "profile_path": null,
               "id": 3586,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe422ec3a36847f800a567",
               "name": "Monique Dury",
               "profile_path": null,
               "id": 3589,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe422fc3a36847f800a56d",
               "name": "Michel Laurent",
               "profile_path": null,
               "id": 3590,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "52fe422fc3a36847f800a573",
               "name": "Jacques Maumont",
               "profile_path": null,
               "id": 3571,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.711071,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 259,
      "vote_count": 22,
      "budget": 0,
      "overview": "Beginning with \"The 400 Blows,\" director Francois Truffaut made a series of films about the impetuous Antoine Doinel, in which this is the last. Antoine is now 30, working as a proofreader and getting divorced from his his wife. It being the first \"no-fault\" divorce in France, a media circus erupts, dredging up Antoine's past. Indecisive about his new love with a store clerk, he impulsively takes off with an old flame.",
      "similar": [
         283227,
         27066,
         612,
         80,
         86331,
         255,
         1643,
         843,
         2926,
         707,
         258,
         24016,
         21484,
         37265,
         8195,
         269,
         3989,
         451945,
         166,
         314385
      ],
      "original_title": "L'amour en fuite",
      "runtime": 93,
      "poster_path": "/hEtuFlpeb5ZU5fa5klkKA5Q3G36.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Les Films du Carrosse",
         "id": 53,
         "origin_country": ""
      }],
      "release_date": "1979-01-24",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/hT6f042PKqsMjt0t8vPEE7yocKj.jpg",
         "name": "The Adventures of Antoine Doinel",
         "id": 185682,
         "poster_path": "/66hyq0YtgBjrfT2kB1YJu33UDcy.jpg"
      },
      "tagline": "Antoine Doinel. He's got four ladies ... Nine lives ... and Plenty of alibis!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["François Truffaut"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "François Truffaut",
         "Marie-France Pisier"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0078771/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzODM5NTA3Ml5BMl5BanBnXkFtZTcwNzY0NDYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jean-Pierre Léaud, Claude Jade, Marie-France Pisier | See full cast and crew »"],
      "reviews": [
         "Antoine Doinel (Jean-Pierre Léaud) is having a love affair with the vinyl seller Colette Tazzi (Marie-France Pisier). After five years of a troubled marriage with separations, Antoine and Christine Doinel (Claude Jade) have a private audience with the judge (Marie Henriau) and conclude an amicable divorce process. His former sweetheart and presently lawyer Colette Tazzi (Marie-France Pisier) sees Antoine leaving the court and she goes to a bookstore to buy his autobiographical novel that was published a couple of years ago. When Antoine goes with Alphonse (Julien Dubois) to the train station for the travel vacation of his son, he sees Colette in another train and he jumps from the platform to the train and travels with her. They recall their adolescent love and disclose their sentimental relationships; but when Colette tells how she raises money for her self-support, Antoine is disappointed and seeks out Sabine. \"L'Amour en Fuite\" is the conclusion of the sentimental saga of the character Antoine Doinel, the insecure alter ego of François Truffaut that began in \"Les Quatre Cents Coups\" and followed through \"L'Amour à Vingt Ans\", \"Baisers Volés\" and \"Domicile Conjugal\", inclusive with the use of scenes in the many flashbacks of these movies with his recollections and troubled love affairs. This character has an evolution from the needy fourteen years old boy rejected by his mother and his stepfather in the first movie. The lack of affection at home makes him a rebel, bad student, liar, reckless and a thief stealing objects and money at home in his adolescence. In the next movies, he grows-up, but with a fragile emotional structure and the viewer sees an unstable man incapable of having a steady relationship or commitment with the many beautiful women that he meets along his futile life. My vote is seven. Title (Brazil): \"O Amor em Fuga\" (\"The Love on the Run\")",
         "True, there are a bit too much flash back in the film (with some lengthy ones,too), but after the previous four Antoine Doinel films, this last installment brings so much sentiment and feeling that is quite unique and unmatched in any other films. Whether Antoine's life will change or not, nobody can tell. The important thing is, he has to face the reality this time. He's no longer young, plus he's a divorced father and struggling writer (what a combination!). Yet as all the people around him changed, Antoine still has the child-like energy and belief in love. That's what makes him so attractive as a protagonist in FIVE films. Truffaut really gave us film lovers a great gift. Too bad that he died in 1984, or we might have a 6th or 7th film on Antoine Doinel!",
         "The problem with sequels is that they usually don't have the same impact as the original (can anybody tell me that ANY of the \"Indiana Jones\" movies after \"Raiders\" was worth a darn?). Truffaut took a big chance with the Antoine Doniel character and made 5 movies with Leaud playing him in all of them....instead of losing my interest, I found each installment compelling and wonderful in their own little ways....\"Love On The Run\", the final installment of the series, shows us a much older Antoine who's still confused as to what exactly love is....unlike \"The 400 Blows\", the impact can't be likened to a punch to the jaw, but is more subtle and infectious. Truffaut's ode to love, to Jean-Pierre Leaud, and to Antoine Doniel, does this cinematic sleight of hand with flashbacks to the other 4 movies, with re-introducing a lot of the characters (his ex-wife, Collette, and even the man he caught kissing his mom in the first movie), and paints a more complete picture of a man who finally stops running (no pun intended) from his wretched childhood, and who finally learns that love requires trust and sacrifice....a magnificent last chapter to one of cinema's most beloved characters. You might not realize it while watching it, but you'll still be seeing scenes from the movie running in your head for days afterwards.....",
         "Love on the Run (1979), the closing chapter in François Truffaut's celebrated series of films focusing on the character of Antoine Doinel; a near-iconic figure in French cinema brought vividly to life by the always great Jean-Pierre Léaud. Here, the actors injects the part with his usual nervous charm and cocky likability, though it is clear that character of Antoine is , still as uncertain about life, love and fidelity as ever before. On a Structural level, the film is built around Antoine's divorce from his wife Christine - with the reappearance of Claude Jade from Stolen Kisses (1968) and Bed and Board (1970) - inter-cut with flashbacks to early escapades from Antoine's presented in the style of a clip show. This particular stylistic device does set up a sense of familiarity for new viewers, however; with such a slight plot, the flashbacks end up becoming the most interesting part of the movie, with what little new footage there is so repetitive that it feels like you're watching the same scene over and over again. In fact, the film is so hastily put together that it looks like Truffaut is desperate to get the series finished and out of the way, so that he can finally move on with the more progressive work that he was attempting with films like The Green Room (1979) and The Last Metro (1980). Still, the film can sometimes be charming and the actors are all on fine form, but the whole thing seems lacking somewhat; with the use of repeated imagery and scenes cut and pasted from the previous films making this feel too much like a retread rather than a radical re-interpretation. For me, the film just seems empty, deflated and somehow lacking the allure, beauty and sophistication that was always synonymous with Truffaut's work or at least the films of his that I am familiar with. For me, Love on the Run was something of a slight, disappointing and unimaginative film that failed to inspire me in the way I had initially hoped.",
         "This is Antoine Doinel's goodbye to all of us who followed his life and experiences through 20 years, from \"The 400 Blows\", \"Antoine &t Colette\", \"Stolen Kisses\" to \"Bed & Board\" and finally here in \"Love on the Run\"; from his problems at school to his life as a working man, married man, later divorced, reader, writer, lover, soldier, florist, private detective and more; in short a full life. Truffaut's alter ego (always played by the amazing Jean-Pierre Léaud) takes us through many moments of his life in the previous films while trying to correct few things in the present with his latest girl, Sabine (Dorothée). Here, all the women of Doinel's life appears together and now he has a chance to figure out why his relationships simply doesn't work. Recently divorced of Christine (Claude Jade), and involved with no good terms with Sabine, Doinel meets again Colette (Marie-France Pisier), his first love and they share some secrets, remember some moments when they two met for the first time, and both characters discover more things about each other, about life and about love. At the trivia section is mentioned that Truffaut thought about making a huge mistake while filming this sequel, and I think he shouldn't be ashamed of it. It isn't much of a film since half of it it's flashbacks taken from all of Doinel's films plus a few moments of \"Le Nuit Americaine\" included as an interesting subplot of Doinel's romantic affairs (even though he plays a different character in that film). Compared to the other movies of the series this is less comical, a little bit too serious and it's more focused on how the kid that seems to never grow finally realizes what love really is than his amusing and funny life experiences as a working man. But seeing all the flashbacks, those memorable moments covering 20 years of a person is breathtaking, refreshing, unique in all motion picture history. We can look back and see how much Antoine/Léaud changed through these years and some of us practically saw him growing up and I bet Truffaut must have loved this experience, seeing someone he could relate with and share some of his own experiences and see them portrayed on screen. One of the most touching moments of \"Love on the Run\" is the reunion between Doinel and the lover of his mother, whom he haven't seen in years, and the way they talk about the past, we see scenes from \"The 400 Blows\" when Doinel was a kid and saw him with his mother, and he hated the guy for it, then few years later they are happy to see each other, a bond between Doinel's troubled life and his life while a grown up man. Most of the reviews on this classic are very superficial here. \"Love on the Run\" is a memorable, delightful and magic experience through great moments of one of the most interesting, inspiring and charming characters of all time, and this is his goodbye to us, always striving, always fighting, always believing in something and always managing to get what he wants even though we as audience might think he'll be lost forever. Doinel echoes a part of us that never should die: our youth. 10/10",
         "By finding an opportunity to firmly end his cycle of films about Antoine Doinel, Francois Truffaut gave himself a great advantage by permitting this film to go to any lengths necessary as long as it concludes the series, which has essentially been represented as a number of chapters portraying the lives of one unusual Parisian man. In The 400 Blows, Antoine struggled with finding his place in the world as an adolescent and the relationship with his parents. In Antoine and Colette he found the pitfalls associated with love, a trend that would continue in Stolen Kisses and Bed and Board. Love on the Run is brilliantly done in the way that it incorporates all of these details via flashbacks and sequences designed to remind the audience of characters seen in previous films. Truffaut carefully edits these scenes in such a way as to appear as nostalgic memories as well as to aid along the audience in understanding the reasons and consequences of these characters' actions. Once again, this story focuses mainly on Antoine's ability (or inability) to have a relationship with a woman only for nearly everything to go wrong. Truffaut wisely brought back the two most important women to Antoine, his wife of 5 years Christine and his first great love from his teen years Colette. Scenes between the two women are particularly well-done as we get a glimpse into some real soul-searching for this complex character. Antoine also has a new woman in his life, the charming and bubbly Sabine who plays a most important role in this story that also manages to include subplots involving Antoine's relationship to his parents and a bit of detective work reminiscent of that beautiful film, Stolen Kisses. Clearly, this entire series is one of the best in cinema history. By focusing on one man and all the adventures and problems he must face, Truffaut has created some of the most realistic and indelible fictional characters in all of art. In some ways, these people are more real than the ones we know for they combine knowledge, understanding and wisdom learned in the past as well as hope and courage for the future. All great things must come to an end and this ending is as perfect as films get: funny, poignant and so warm and tender. To understand why Truffaut was such a special artist, look no further than these five chapters depicting the life of Antoine Doinel.",
         "This is the final film about the character, Antoine Doinel. He first appeared in The 400 Blows and you see him in 5 Truffaut films over the years. You see him grow from an emotionally neglected little punk in the first film and by the fifth, he is a Woody Allen-like little guy who has had a long series of troubled relationships that he ultimately sabotaged due to his discomfort with emotional commitment. He has a great time falling in love but soon strays or otherwise causes the relationships to sour. The plot and emotional growth of the character is excellent. So why only a 7 for this film? Well, much of the film is simply cut and pasted from the previous Antoine Doinel films. This gave it a certain cheap look. Plus, what I really found inexplicable was that Truffaut used clips from Jean-Pierre Léaud films that were NOT about Doinel but pretended the clips were about him. In addition, clips from some Doinel films were shown but the entire scene is re-dubbed or explained in a way in which the scene did NOT appear in the original film. A good example is a clip from Stolen Kisses. The narrator says he (Doinel) was unlucky in love and followed attractive women because he'd become infatuated with them. However, this scene was actually of Doinel following a lady because he was a private detective in this film--this was NOT someone he was infatuated with. Those who remember this movie well will be shocked at how easy it is to spot this obvious change. Finally, for some odd reason, one of the clips from Stolen Kisses is shown in black and white, while all the others from the movie are in color. It just didn't make sense why this occurred. These inconsistencies are not great film-making. Decent film-making, maybe. For a better Truffaut film, try watching The Bride Wore Black (my personal favorite) or Wild Child or The Story of Adele H.",
         "Antoine Doinel ends his marital existence by divorcing his wife Christine.By chance,he meets all the significant people who helped him to shape his destiny.These encounters guide him to revive a number of bygone events.He is able to find happiness again by falling in love with Sabine.Although dubbed maudlin by certain inconsiderate critics,L'Amour en fuite remains a light romantic work filled with hilarity and empathy. This last film in the Antoine Doinel series is a fantastic trip down memory lane for Truffaut and Antoine Doinel fans.Truffaut's alter ego Antoine Doinel is a veritable emotional wreck as he needs all kinds of women for support.Antoine's past is inextricably linked to his present.All these women have positively been a part of Truffaut's life too.They know each other well and plot Antoine's downfall.Truffaut has made competent use of flashbacks to evoke memories of the past. Scenes of the past make one feel like watching two different films at the same time.Everyone feels that Antoine did not try his best to save his marriage.Viewers' sympathies will always be with Antoine as despite his faults,he is a charming guy.Truffaut has ably shown how important it is to love and be loved.",
         "This is the fifth and last part of Francois Truffauts Antoine Doinel cycle, a biographical movie series about the growing up of a romantic Parisian, played by Jean Pierre Leaud all the time, and all his struggles with love and life which was produced over a period of 20 years. This last part from 1978 shows us Doinel doing what he's also doing in the previous four parts - falling in love with numerous women, trying to keep up relationships, looking for love, flirting etc. While the first part from 1959 showed us Doinel's childhood in a poor family with a hard and beating father and his longing for respect and love, the following parts are less interesting in my opinion. The final chapter is rather superfluous, with jokes falling flat, no real script, no suspense or a really interesting story line, and the actors are just running around most of the time. If you have watched the previous Doinel films it might be interesting to see this sequel (which is not really an end), but I suggest you to watch the first Doinel movie \"Les 400 coups\" (\"The 400 Blows\") instead, or Truffauts \"L'homme qui l'amait les femmes\" (\"The Man Who Loved Women\"), a far more interesting study on love, obsession and fetishism.",
         "I always find it hard to watch a french movie from the eighties -I am french though, and a real patriot, be sure of that- because it feels like I'm trapped in my childhood or something and I will have to go to school or..whatever. It is always painful. For instance, the girl playing 'SAbine' in L'Amour en fuite is 'Dorothée', a T.V. figure from when I was seven or so. She was awful, supposedly very mean to children -but her show was devoted to them, weird, uh?- and a lesbian. But let's go back to Truffaut's movie: I am a big fan of Jean-Pierre Léaud, and in this movie his character Antoine Doisnel is still the same selfish, ridiculously precious little dandy. But I still love him ! It is very funny that in the end he goes back to something that looked a lot -to me- like a sub- La Maman et la Putain (from Eustache). Torn apart between several lost loves and one that is young and not tragic... What will Antoine do? Flee, as usual? You will have to see the movie I guess ! At least for Souchon's cool interpretation of the song he composed for the movie. What a smart guy ! Now he can sell tons of records."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Les Films du Carrosse"],
      "summaries": [
         "Antoine Doinel is now more than thirty. He divorces from Christine. He is a proofreader, and is in love with Sabine, a record seller. Colette, his teenager love, is now a lawyer. She buys Antoine's first published autobiographical novel. They meet again in a station...",
         "Antoine Doinel is having a love affair with the vinyl seller Colette Tazzi. After five years of troubled marriage (with several separations), Antoine and Christine Doinel have a private audience with the judge and conclude an amicable divorce process. His former sweetheart and presently lawyer, Colette Tazzi, sees Antoine leaving the court. She goes to a bookstore to buy his autobiographical novel that was published a couple of years ago. When Antoine goes with Alphonse to the train station he sees Colette on another train, and he jumps from the platform to the train and travels with her. They recall their adolescent love and disclose their sentimental relationships; but when Colette tells how she raises money for her self-support, Antoine is disappointed and seeks out Sabine."
      ],
      "budget": 0
   },
   "movielensId": 39941,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1979-01-24",
      "dvdReleaseDate": "1999-04-27",
      "directors": ["François Truffaut"],
      "runtime": 93,
      "movieId": 39941,
      "title": "Love on the Run",
      "mpaa": null,
      "actors": [
         "Jean-Pierre Léaud",
         "Marie-France Pisier",
         "Claude Jade",
         "Dani",
         "Dorothée",
         "Daniel Mesguich",
         "Julien Bertheau",
         "Marie Henriau",
         "Julien Dubois",
         "Jean-Pierre Ducos"
      ],
      "imdbMovieId": "0078771",
      "originalTitle": "L'amour en fuite",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["-PNKgCsQsUc"],
      "plotSummary": "Beginning with \"The 400 Blows,\" director Francois Truffaut made a series of films about the impetuous Antoine Doinel, in which this is the last. Antoine is now 30, working as a proofreader and getting divorced from his his wife. It being the first \"no-fault\" divorce in France, a media circus erupts, dredging up Antoine's past. Indecisive about his new love with a store clerk, he impulsively takes off with an old flame.",
      "tmdbMovieId": 259,
      "avgRating": 3.51515,
      "releaseYear": "1979",
      "numRatings": 33,
      "posterPath": "/hEtuFlpeb5ZU5fa5klkKA5Q3G36.jpg"
   }
}