{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "agent",
            "id": 33705
         }
      ],
      "imdb_id": "tt0228750",
      "video": false,
      "title": "Proof of Life",
      "recommendations": [
         178,
         10731,
         12103,
         11808,
         3595,
         1965,
         10782,
         11074,
         2749,
         10684,
         11866,
         3172,
         10479,
         9882,
         9869,
         9331,
         2275,
         12123,
         11371,
         8838
      ],
      "backdrop_path": "/xJsn2nVpcR0bw4svqOFzK0rP7yt.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "55850046c3a368502e00224e",
         "content": "We're out of miracles.\r\n\r\nRussell Crowe would of course come to be better known elsewhere (filmicly) in this year, but what of his other release in 2000? Proof of Life is a blender, a picture that is in part thriller, part romance, part drama and part observation on a very real life problem - that of kidnapping for ransom. So many genres to tackle means that invariably Taylor Hackford's film feels over stuffed, pushing the running time to two hours and fifteen minutes, it is this that hurts it. A shame because if trimmed of the pointless filler and drawn out sequences then there is a very efficient (ok, maybe routine is a better word here) and well acted piece on show. The drama and tension (sexual and perilous threat) is all building towards the action packed finale, which, while well mounted, doesn't seem an adequate pay off for the number of extended chatty scenes we have had to tolerate to get there. Nice tip of the hat to a classic at the end, though. 6/10",
         "url": "https://www.themoviedb.org/review/55850046c3a368502e00224e"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Alice Bowman",
               "gender": 1,
               "credit_id": "52fe44af9251416c7503d725",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Terry Thorne",
               "gender": 2,
               "credit_id": "52fe44af9251416c7503d729",
               "name": "Russell Crowe",
               "profile_path": "/ktuOAyUHM2u2YPPChH8gAArxJ7b.jpg",
               "id": 934,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Peter Bowman",
               "gender": 2,
               "credit_id": "52fe44af9251416c7503d72d",
               "name": "David Morse",
               "profile_path": "/5PuSGfBw3Hsdo5jkhZ59NDFCZUm.jpg",
               "id": 52,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Janis Goodman",
               "gender": 1,
               "credit_id": "52fe44af9251416c7503d731",
               "name": "Pamela Reed",
               "profile_path": "/lJgMi6Y4OvB8ZTpopFmJ3Efe5Sq.jpg",
               "id": 14699,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Dino",
               "gender": 2,
               "credit_id": "56b7e53ac3a36806ee00e663",
               "name": "David Caruso",
               "profile_path": "/i251LGpMkOeOqRmqlCpKkNoGdni.jpg",
               "id": 16560,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe44af9251416c7503d73b",
               "name": "Flora Martínez",
               "profile_path": "/fBDUW1WgRfXG6446NW7weWbnwaq.jpg",
               "id": 66913,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Ted Fellner",
               "gender": 2,
               "credit_id": "56b7e5689251416615008194",
               "name": "Anthony Heald",
               "profile_path": "/nRXLwMuuv5nUbEz2sFLtEU4zUYg.jpg",
               "id": 16293,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Eric Kessler",
               "gender": 2,
               "credit_id": "56b7e57692514116b4000d2d",
               "name": "Gottfried John",
               "profile_path": "/hOVrTlQwZX4THosi9usXISC7mNS.jpg",
               "id": 3757,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Fred / Marco",
               "gender": 0,
               "credit_id": "5864ef779251412b7b01c11a",
               "name": "Tony Vázquez",
               "profile_path": null,
               "id": 1454453,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44af9251416c7503d703",
               "name": "Taylor Hackford",
               "profile_path": "/heZfdghufTV3t3ayrWvIuiP1jvb.jpg",
               "id": 18596,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44af9251416c7503d709",
               "name": "Thomas Hargrove",
               "profile_path": null,
               "id": 71168,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe44af9251416c7503d70f",
               "name": "William Prochnau",
               "profile_path": null,
               "id": 71169,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe44af9251416c7503d715",
               "name": "Taylor Hackford",
               "profile_path": "/heZfdghufTV3t3ayrWvIuiP1jvb.jpg",
               "id": 18596,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44af9251416c7503d71b",
               "name": "Charles Mulvehill",
               "profile_path": null,
               "id": 3222,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44af9251416c7503d721",
               "name": "Steven Reuther",
               "profile_path": null,
               "id": 1202,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44af9251416c7503d737",
               "name": "Tony Gilroy",
               "profile_path": "/9HOtDgcO6F4Fa4BaIjt0t3Vbxrj.jpg",
               "id": 19242,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58267142c3a3683604012050",
               "name": "Danny Elfman",
               "profile_path": "/pWacZpYPos8io22nEiim7d3wp2j.jpg",
               "id": 531,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "582671489251417b18011c86",
               "name": "Slawomir Idziak",
               "profile_path": "/vA9WrEK35MyUx6Sb4NtZiouotsg.jpg",
               "id": 1129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a48388192514103110094e9",
               "name": "Bruno Rubeo",
               "profile_path": null,
               "id": 5709,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5a48388b0e0a264892009376",
               "name": "Ruth Myers",
               "profile_path": null,
               "id": 19310,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5a4838910e0a26489500966d",
               "name": "Anna Pinnock",
               "profile_path": null,
               "id": 8384,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5a483898925141032000920c",
               "name": "Steve Shewchuk",
               "profile_path": null,
               "id": 15223,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5a4838a99251410317008c29",
               "name": "Sheldon Kahn",
               "profile_path": null,
               "id": 7068,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.631553,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11983,
      "vote_count": 271,
      "budget": 65000000,
      "overview": "Alice hires a professional negotiator to obtain the release of her engineer husband, who has been kidnapped by anti-government guerrillas in South America.",
      "similar": [
         2163,
         1571,
         562,
         275,
         9039,
         8067,
         9631,
         274,
         14869,
         156022,
         137094,
         949,
         336843,
         1073,
         8834,
         4771,
         189,
         10285,
         193893,
         984
      ],
      "original_title": "Proof of Life",
      "runtime": 135,
      "poster_path": "/ole3u0jx0AuNxrtHRIQOTzBgDBl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2000-12-08",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Taylor Hackford"],
      "runtime": 135,
      "synopsis": null,
      "writers": [
         "Tony Gilroy",
         "William Prochnau"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0228750/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyODkwNzM3OV5BMl5BanBnXkFtZTYwMTc5Nzc5._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Meg Ryan, Russell Crowe, David Morse | See full cast and crew »"],
      "reviews": [
         "Peter and Alice Bowman are working on a dam in South America in the employment of a large oil company. When Peter is kidnapped the company bring in expert negotiator Terry Thorne. However when the oil company runs out of money due to no insurance, they take Terry off the case and he leaves for another job. However a pang of conscience brings him back to help Alice and he replaces the corrupt locals. As he tries to help get her husband back he also falls for Alice. As a fan of David Caruso, I was annoyed that I missed this film at the cinema (I blinked and I missed it!) and by the time the video came out it had slipped my mind. Shown of tv last night was the perfect time for me to see it and, despite negative reviews, I actually quite enjoyed it. I think the problem is that the critics struggled to get past the handful of problems (more later) to find that the film was an effective, if talky, drama with a thriller edge. The premise is good and it allows tense scenes where Terry tough talks as well as scenes with Peter with his captors. It's not perfect in this regard as it is a bit talky but for me it was engaging - I got the impression from other comments that people had expected raging gun battles all the way through the film. However what does damage the film is Alice Bowman. I can see the potential behind Terry and Alice's romance - it could have been another layer of drama. In reality it doesn't work a bit and only serves to take away from the main thrust of the film - their relationship never convinces and nothing of interest is actually done with it. Likewise the character of Alice doesn't really work either - I never believed she was emotionally going through the wringers to the degree the script suggested she would be. A big part of the blame for this must lie with Meg Ryan herself. She is miscast in the first place, but on top of that she is too pristine throughout the film - hair and makeup perfect no matter what and a stupid little hippie-girl personality that stops her being a real person. It is a bad performance and the film would have benefited from a shorter running time which lost the romance subplot and scaled back on Ryan's time. However she is carried by a real star turn from Crowe. It may not be that clever a role but he does `tough' really well and he helps improve the tension of several scenes. Morse is a good actor and he does well here. The only downside of his performance is that he seemed fit and well outside of his makeup; I was looking for him to look thinner and mentally battered as the film progressed but he didn't - it's not his fault, I guess the film had no time to do this. Caruso gives the same tough performance he does in every thing he ever does so if you like that then you'll like him here - I do! Overall this is an enjoyable film if you can get past it's major problems surrounding Alice and Terry's relationship. Script-wise this aspect was weak on paper, but a comparatively rubbish turn from the miscast Meg Ryan just makes it all the weaker. Thank god that the basic premise is tense and the male leads' tough talking is good fun.",
         "What happens in real life will inevitably have an effect on the reel one. Tom Cruise learnt that with his strange antics in real life - his screen one suffered with a less than expected stellar box office for M:I:3 despite positive critical reviews. Way back in 2000, Russell Crowe and Meg Ryan learnt that too, with their rumoured romance while shooting this movie, one of the many reasons resulting in this becoming a box office bomb. I felt that it was not a bad movie actually, given the story which I found interesting in the first place, for its extremely distant relation to what I'm doing, and being an action adventure movie, it works with its fair share of big action sequences. Russell Crowe plays Terry Thorne, a consultant in the Security and Crisis Response Unit of Luthan Risk International. His job is to negotiate the safe return of Kidnap and Ransom (K&R) victims around the world, and of course, this brings him frequently to where the action is, during the payment of ransoms and the extraction of hostages. He yearns for a management role, but as always, if you're an excellent field operative, you're played to your strengths out there. Which brings him to his latest client, Meg Ryan's Alice Bowman, whose husband Peter Bowman (David Morse), an employee with the biggest international oil firmed, gets kidnapped by chance during a raid in Ecuador. There are numerous scenes in the movie to perk your interest in this much behind-the-scenes industry of K&R, the terrorist(?) groups' motivation, and how the entire business is conducted, with the engagement of peers as well as the involvement of shady government personnel. There are many fine touches that might go unnoticed, like how network of contacts and peers are milked, cooperation extended, the wheelings and dealings of large multinational corporations, and politics in general. But the focus moves quickly towards a micro one, that between Thorne and Alice Bowman, as he accomplishes to build her trust in him that he's the best in the business and knows what he's doing. Perhaps this is one of the rare movies that allowed Crowe to be an Australian (and keep the accent) in a Hollywood production. His Thorne is oozes enough machismo to carry the action through and is credible enough to be believed as a veteran in the business. Meg Ryan this time round has a more serious character to play, albeit at times a weepie one, steering well clear of the pretty ditzy blonde comedic roles she has become accustomed to. They had probably shot some love scenes for this movie, but I suppose the bad press resulted in those scenes ending up on the cutting room floor. The romance between the character was also almost squashed out, save for the out of place suggestion of a strong physical attraction which rears its ugly head in the second half of the movie, slowing the pace down a little without much mature development. I thought that should it had been removed entirely, it'll probably end up a stronger movie, with Thorne more in character as a mission driven individual. The first David, David Caruso, is finding a new lease of life back in television with CSI, since branching off to movies after NYPD Blue didn't augur too well for him. I thought his performance here was nothing much to shout about though. However David Morse, who usually plays supporting roles, put up an adequately engaging Peter Bowman as an executive caught in the wrong place at the wrong time, and examines the fear and desperation of a man kidnapped and constantly at the wrong end of a gun barrel. The theme song by Danny Elfman is addictive (time to hunt it down), and the end credits was played over a helicopter view of the entire Ecuadorian landscape, just beautiful to look at. Clocking at just over 2 hours, it provided some good entertainment for a lazy Sunday afternoon. Code 3 DVD contains the behind the scenes making-of documentary (13\" 40'), the theatrical trailer, and the feature length audio commentary by director Taylor Hackford.",
         "\"Globalization\" is one of those catchy buzzwords that shares the stage with the likes of \"abortion\", and \"capital punishment\"- while one group of people thinks it is a good thing that just might save the world, another thinks it is on par with the plague. There is however no dispute that with advancements in technology and the search for new capital markets, businesses are expanding abroad at a phenomenal rate into countries with little infrastructure or wealth and the ever-present danger of war. This expansion has also been the catalyst for a lucrative sideline business - kidnapping. Peter Bowman is a man trying to do the right thing. In order to build a dam to stop the killer floods in the South American country of Teclac he must work under the auspices of a large oil concern. As with any overseas project, Peter has to deal with many problems: lack of supplies, red tape, feelings of isolation, a crumbling marriage and living with the threat of terrorist activity. While on his way to work Terry is stopped at a roadblock and taken hostage by a band of guerrillas who demand a huge ransom for his release. Enter Terry Thorne, an insurance investigator whose specialty is \"K and R\" - kidnapping and ransom. Terry's job is to negotiate the release of kidnapped foreign nationals. And he is a very busy man. This movie really piqued my interest and not because of the off-screen romance between Meg Ryan and Russell Crowe: the father of a good friend of mine is an international financial consultant, and he was almost kidnapped while working in SouthEast Asia. The attempt was foiled by the quick actions of the special security detail that intercepted details of the plan and whisked him out of the country. I spoke with him after seeing the trailers for the movie and he said that in country he is currently working in you do not anywhere without heavily armed escorts. The possibility of being kidnapped is viewed as the cost of doing business. I forgot to ask him if they had the appropriate insurance. \"Proof of Life\" grew out of a story in Vanity Fair and is loosely based on the kidnapping of an American businessman by Colombian guerillas. Taylor Hackford is a director who eschews the safety of studios, and opts for that extra touch of realism. In keeping with this goal, he took the cast and crew down to Ecuador, where he was met with erupting volcanoes, blizzards, a cast beset with altitude sickness, a coup in Quito, muggings, heart attacks on the set and the death of a stand-in. The final cut is an apt homage to those involved. Typically cast as the funny, quirky, girlfriend afflicted with endless mini-crises, Meg Ryan has been afforded few opportunities to demonstrate acting abilities. As Alice Bowman, she has the chance to flesh out a multidimensional character that doesn't spend her onscreen time whining, crying or laughing insipidly. And she does so admirably. Russell Crowe, riding high after the success of \"Gladiator\", once again delivers a solid performance. Crowe draws heavily on his own quiet, severe introspection to create a character conflicted between loyalties, expectations and realities and the feelings he tries to suppress for Ryan's character. Their real life tryst helped to establish the tone for the powerful, yet subtle scenes they share onscreen. David Morse is excellent as Terry, a man trying to hang onto his sanity in an insane situation. As he is marched across country, and endures humiliation, and beatings, he never loses sight of his goal to stay alive and escape. His transformation from clean cut businessman (I've never seen him with such a close shave) to disheveled captive is done slowly and deliberately, and the viewer appreciates what he's experiencing. Finally, it was interesting to see David Caruso - who has floated in the acting netherworld since he left \"NYPD Blue\" almost six years ago - as a rival K&R specialist who assists Terry with his mission. Caruso reminds us why he has not graced many marquees - he's not very funny, action is not his forte, and he is an average actor at best. The other star of the film is the location. With most of the film having been shot in the mountains of Ecuador, (the guerrillas camp was literally carved out of the jungle) it is not surprising that the film looks gorgeous: tumbling waterfalls, plunging ravines and flourishing jungles are stock backdrops for the story and you begin to take them for granted. One of my favorite scenes was when the infinite expanse of greenery is broken by a band of camouflaged rebels who were totally invisible only moments earlier. I was surprised how tight the cinematography was given the expansive vistas, but nothing is sacrificed in the process. In addition to a well-written script that avoids most cliches, and contains palpable suspense, I was impressed with the way the relationship between Alice and Terry was handled. Rather than have the characters jumping into bed for a sweatfest the writers opted for an undercurrent of subtle tension with the characters exchanging occasional confused glances and moments of awkward silence when their hands brush. The first entertaining intelligent film to come out of Tinseltown in a long while - maybe it bodes well for the Christmas rush.",
         "Proof of Life might well satisfy those more knowledgeable in real-life military matters. When Terry (Crowe) explains to Alice (Ryan) how he started out in the Australian Army, but left for the British Army because there wasn't enough action...he was stating a very plausible possibility. The British Army does indeed accept recruits from Commonwealth nations. Terry also says he is veteran of the elite British Special Air Service, and again, it is true that a huge proportion of ex-SAS members end up in private security efforts of various kinds. When the big raid is carried off, the costumers took enough care to dress Terry in British DPM fatigues, while the American Dino (Caruso) wears American BDU fatigues. Again, this is plausible as these are the sorts of fatigues both men took with them when they left military service. I've seen a lot of reviewers here criticize the end raid sequence. I found the actions scenes very good and a welcome change from most movies. Terry and Dino actually plan for covering fire from higher ground, fields of fire, etc. So many military raids in movies (The Dogs of War is a good example) just have the characters march out in the open and fire from the hip, with no seeming plan of movement other than to run around, destroy stuff, and look dramatic. Terry and his team never stuck around any longer, nor killed any more of the guerrillas, then necessary to rescue the hostages and escape. I can see where these details failed to find appreciation with the general viewing public, but I only hope others doing such movies continue to try to be authentic and realistic.",
         "I like this film. I must admit that a part of me was hoping for the typical chick flic ending, but if I'd actually gotten it I'm sure I wouldn't have liked the movie as much. The movie was more believable than I've come to expect from action films, with the possible exception of the bravado of the captive husband. I find it hard to believe that someone in that situation would be so constantly antagonistic to their captors. Sure, you might have a moment or two where you'd just had enough and had to push back, but I find it hard to believe that you'd be that way ALL the time. But the negotiations were believable for the most part, and the growing attraction between the leads was done nicely.",
         "I was impressed by Proof of Life and would only make one comment. In most movies, the plot is tightened up to be fast-paced, convincing, make you identify with and care about the characters, and even contain a little moral or have something to say about the human condition. When a film like Proof of Life is based on a true story, there are limits to this. The worst example I can think of being A Civil Action, which I'm sure is true to the story but the ending was not satisfying and deflated the entire film. So it's definitely worth seeing, but it's a little slow, and like real life the there is no consistent \"tone\" to the plot twists. (The film does not fit neatly into one genre throughout.) Who should see this film: -- Action buffs who won't mind that only some stuff blows up and the film is a little arty -- Drama fans who are curious about the topic, but who are not expecting a romance and won't mind a little violence -- People who'd like some gritty realism concerning Latin American civil uprisings I give \"Proof of Life\" a 7 out of 10.",
         "While I would probably reccomend seeing the epic Gladiator (one of the best films of the year as I now see it) if you want a case of Russell Crowe as a perfectionist actor, if you want to see a movie with him in good form (and in the cinema now), this is good too. With him in the lead, plus 2 other really good performances, it almost (and almost) seems like there are no flaws. The plot follows an expert K & R consultant (Crowe in great acting shape), who goes in assistance for a wife (Meg Ryan in one of her better roles) who's husband (David Morse who follows up and tops his Dancer in the Dark performance) has been kidnapped. Then the thrilling tension ensues, as they try and get him back. With the few flaws possibly being not enough tension and not the greatest delivery I expected, it definately hits the mark on It's acting and delivery (and what an ending). By the way, if you are looking for Crowe's famous Australian accent, then this is surely for you. B+",
         "Maureen O'Hara stars in a movie where her husband gets kidnapped those damn commies in South East Asia so she hires tough and dashing soldier of fortune Clark Gable to save the day That's not the cast or the location of PROOF OF LIFE but it does have a very similar plot . Did someone mention this was a 1940s matinée blockbuster ? Just curious because while I was watching the movie I was struck by how old fashioned everything felt . Russell Crowe plays an Aussie who served in the SAS and saves a Frenchman from the Chechens in the opening sequence , but you could have had Gable playing an American paratrooper saving someone from the Red Army on the River Elbe in May 1945 . Different actor , different period of history , different enemy but still the same basic story with the action switching from Europe to say South East Asia in 1950 That's not to say PROOF OF LIFE is a bad film . It's not and I found it mainly entertaining though perhaps a little too long . It's just that it is so old fashioned that you can see where the predictable story threads are going to begin and end . You can't deny that both the cast and action scenes are good , it's just that you also can't stop thinking it would have been better if it'd been filmed in monochrome and directed by Michael Curtiz with no bad language or sexual references",
         "According to the director's commentary on the DVD, Meg Ryan demanded (and got) significant rewrites to her character. Maybe Meg should stick to acting because her character is pretty unappealing. When her husband's humanitarian engineering project is unraveling and he's terribly upset, what does she do? She complains about their life traveling around the globe (a very curious scene because one of Meg's rewrites required her character to be rewritten from a country-club wife into a social activist), dredges up her miscarriage which she blames on her husband (apparently because it happened while they were both voluntarily in Africa working on aid projects), and essentially tells him to take her back to America. When he offers to do so, she reverses course and rejects the offer. After the husband is kidnapped, Meg (almost immediately) starts to fall for Russell Crowe though somewhat later she slaps HIM in the face when he's only trying to get her husband back. Finally, when the husband is rescued and returned to Meg, she looks about as thrilled as someone presented with a stinking fish. Yikes! We should be happy at movie's end but I couldn't stop from thinking that the rescued kidnapee had gone from the frying pan into the fire.",
         "Despite the obvious ending being reminiscent of \"Casablanca,\" which is a great film, \"Proof of Life\" held up for the most part with A LOT of action--guns, muscle, and physical cruelty. Crowe is mostly always good, but Ryan surprised me in this. I found her multi-dimensional, able to shake the cutesy business that she usually plays, and really good as a quite desperate wife who has some issues with her world-hopping engineer husband. Morse was believably chauvinistic early on (before the kidnapping), and quite remarkably believable as a desperate hostage. Crowe was solidly heroic, not a Humphrey Bogart, to be sure, but certainly someone whom Ryan as Alice would remember for a long time. Certainly Terry and Alice never had \"Paris\" to remember, but there were good vibrations between them as Crowe plotted to save her husband."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Bel Air Entertainment",
         "Anvil Films"
      ],
      "summaries": [
         "Americans Alice and Peter Bowman have traveled from third world country to third world country working on humanitarian projects. They are currently in Tecala, a country nestled in the Andes, as Peter, an engineer, has been hired by QUAD Carbon, an oil company - the moral \"enemy\" - to lead a project to construct a dam to prevent what is the constant flooding in the country. Alice and Peter eventually learn that QUAD Carbon cares nothing about the dam, which is just a smoke-screen to get an oil pipeline approved and built. Despite loving each other, they have had problems in the marriage of late because of being in Tecala, where Alice has not been able to find her place, and needing to deal with the aftermath of Alice's recent miscarriage. On his way to work one day, Peter, along with a group of others, are random kidnap victims of left wing guerrillas, the Liberation Army of Tecala (ELT), whose reason for being has changed from a political agenda to a monetary one, primarily getting said money through kidnapping and the drug trade in cocaine. The ELT may believe they can get good money for Peter being an oil company executive, despite he not being wealthy as he is not on the oil side of the business. Luthan Risk International, who is the contracted agency for QUAD Carbon's kidnap and ransom (K&R) requirements, dispatches Australian-British Terry Thorne to negotiate Peter's release, Terry an ex-special ops soldier who is known as the best in the business within his own circles. But QUAD Carbon's financial troubles may prevent Terry or anyone else from Luthan Risk helping to get Peter back. Regardless, Alice has to decide whether to trust Terry, the global expert, or locals assigned by QUAD Carbon whose actions are on the surface more promising despite Terry's assertions to the contrary. All, however, need constant proof that Peter is indeed still alive to continue with their work to get him back. But what Alice and Terry begin to feel for each other ultimately factors into what they decide to do in relation to Peter.",
         "In a mountainous South American country, drug-dealing rebels kidnap Peter Bowman, a US engineer who works for an oil company's subsidiary. The company calls in a negotiator, Terry Thorne, an Aussie ex-soldier based in London. When the subsidiary goes bankrupt, the oil company washes its hands of the matter and pulls Thorne. Bowman's wife Alice begs him to stay. She and Peter's sister cobble together some money, Thorne talks ransom terms with the cash-strapped rebels, and Peter, chained high in the mountains, is sustained by a photo of Alice. When the politics of the situation change, so must Thorne's strategy. And what can Alice and he do about the attraction growing between them?",
         "Alice hires a professional negotiator to obtain the release of her engineer husband, who has been kidnapped by anti-government guerrillas in South America."
      ],
      "budget": 65000000
   },
   "movielensId": 3998,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-12-08",
      "dvdReleaseDate": "2001-06-19",
      "directors": ["Taylor Hackford"],
      "runtime": 135,
      "movieId": 3998,
      "title": "Proof of Life",
      "mpaa": "R",
      "actors": [
         "Meg Ryan",
         "Russell Crowe",
         "David Morse",
         "Pamela Reed",
         "David Caruso",
         "Flora Martínez",
         "Anthony Heald",
         "Gottfried John",
         "Tony Vázquez"
      ],
      "imdbMovieId": "0228750",
      "originalTitle": "Proof of Life",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["BLH0JjhBe8g"],
      "plotSummary": "Alice hires a professional negotiator to obtain the release of her engineer husband, who has been kidnapped by anti-government guerrillas in South America.",
      "tmdbMovieId": 11983,
      "avgRating": 3.16242,
      "releaseYear": "2000",
      "numRatings": 2709,
      "posterPath": "/ole3u0jx0AuNxrtHRIQOTzBgDBl.jpg"
   }
}