{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0102388",
      "video": false,
      "title": "The Man in the Moon",
      "recommendations": [
         117553,
         24736,
         40562,
         31083,
         63437,
         9715,
         35645,
         33657,
         118430,
         47841,
         32221,
         12257,
         13346,
         38981,
         32284,
         48287,
         14684,
         42580,
         30500,
         15503
      ],
      "backdrop_path": "/dAkQlCnGqOmqPcpkZW7fk7P0oKj.jpg",
      "revenue": 2853801,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Danielle \"Dani\" Trant",
               "gender": 1,
               "credit_id": "52fe47299251416c7508fb5d",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Matthew Trant",
               "gender": 2,
               "credit_id": "52fe47299251416c7508fb67",
               "name": "Sam Waterston",
               "profile_path": "/fKmtS6OdDWPiAdxZflbJGz1eWml.jpg",
               "id": 8975,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Abigail Trant",
               "gender": 1,
               "credit_id": "52fe47299251416c7508fb6b",
               "name": "Tess Harper",
               "profile_path": "/gJT9fBX04LjmbOzOzYcNbA2ZLF1.jpg",
               "id": 41249,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Marie Foster",
               "gender": 1,
               "credit_id": "52fe47299251416c7508fb6f",
               "name": "Gail Strickland",
               "profile_path": "/pT9Tb2f07joxd7KYPLucak7X8J0.jpg",
               "id": 42003,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Court Foster",
               "gender": 2,
               "credit_id": "52fe47299251416c7508fb73",
               "name": "Jason London",
               "profile_path": "/z4eSvvH51WsZppswHVHcqFJJm6L.jpg",
               "id": 52474,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Maureen Trant",
               "gender": 1,
               "credit_id": "5a3b4633925141547e0941bf",
               "name": "Emily Warfield",
               "profile_path": null,
               "id": 1226824,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Billy Sanders",
               "gender": 2,
               "credit_id": "5a3b464ac3a36814ae099f6a",
               "name": "Bentley Mitchum",
               "profile_path": null,
               "id": 127544,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47299251416c7508fb63",
               "name": "Robert Mulligan",
               "profile_path": "/uqh0IKRmazRkxi9F2g7fnpJhZBa.jpg",
               "id": 8482,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55820aca9251410b4700025a",
               "name": "Jenny Wingfield",
               "profile_path": null,
               "id": 1454112,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.684427,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17474,
      "vote_count": 72,
      "budget": 0,
      "overview": "Maureen Trant and her younger sibling Dani share a strong connection, but local boy Court Foster threatens to throw their bond off balance. Dani and Court meet first and have a flirtatious rapport -- but when he meets Maureen, he falls hard and they begin a passionate affair. The new couple try to keep their love hidden from Dani, but she soon learns the truth, disavowing her sister. But a heartbreaking accident later reunites the girls.",
      "similar": [],
      "original_title": "The Man in the Moon",
      "runtime": 99,
      "poster_path": "/6joNFlFTW7uKr7JZYJCoLyUx3B2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1991-09-30",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Remember when you couldn't wait for your life to begin... and then, one day, it did?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Mulligan"],
      "runtime": 99,
      "synopsis": "Few memories are more fond than those of our youth and the first times that our heart strings were pulled on by young love; but how many of us remember? There is little more endearing and tender to each of us than the way we were in our youth. Those first pangs of love. That first kiss. Those first disappointments. Those are the highlights of this film which pull out feelings, long dormant, that each of has experienced before in our youth.",
      "writers": ["Jenny Wingfield"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102388/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4MDU0NDY0MF5BMl5BanBnXkFtZTcwMzg1ODE1NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sam Waterston, Tess Harper, Gail Strickland | See full cast and crew »"],
      "reviews": [
         "\"The Man in the Moon\" is a beautifully realistic look at life through the eyes of an adolescent. Director Robert Mulligan magically re-creates screenwriter Jenny Wingfield's autobiography of her childhood with gorgeous cinematography and a haunting, lyrical musical score. This film hits home as one of the most powerful and emotionally affecting films in recent times. This film is incredible, all the acting first rate, especially Sam Waterston and an astonishing performance by Reese Witherspoon in her film debut. You will feel every emotion as this life changing summer in 1957 on the Trant family farm comes to a conclusion. \"The Man in the Moon\" was a limited release in 1991, and you will love the fact that most of you're family and friends will probably have never heard of it. Buy this dvd and enjoy 100 minutes of pure poetic art. This film is truely the essence of filmaking at its finest.",
         "Perfect movies are rare. Even my favorite films tend to have flaws - Rear Window looks a little stagey at times, Chris Elliot's character in Groundhog Day doesn't work, the music score in Best Years of Our Lives is too cheesy, the beginning of Nights of Cabiria is a little too slow - but this film is perfectly executed from start to finish. The script is brilliant, the acting is superb all around (although Reese Witherspoon and Sam Waterston are amazing, the whole cast shines), the directing and the photography are inspired, and the music score is touching without being intrusive (like some Miramax scores that are too manipulative). Every sad moment is truly moving, every light moment makes me smile. This truly is one of the best films I have ever seen and I wish there were more films like it. I am glad that Reese Witherspoon has gone on to stardom after this film, but I am sorry to see that her recent movies are so much more escapist and silly than this serious film which is about real people, real feelings and real problems. Brilliant! A must-see.",
         "I doubt I would have ever rented the film, it looked too much like just a teenage love story. However, a friend who's taste I respect, recommended it. I thought the film was excellent. \"The Man in The Moon\" is one of those rare movies that gets it right. A warm and tender story of a family, and growing up, without being maudlin. It was the first time I'd seen Reese Witherspoon, and she was indeed impressive. You knew she had something special about her, like seeing a very young Elizabeth Taylor, in an old MGM movie. This film is idealized, yet honest. Many of us grow up with both joys and some pain, and there is an unexpected twist, that when it hits -- it hits hard.",
         "A 14 year old girl develops her first serious crush on the 17 year old boy that lives near by, while simultaneously trying to overcome her feelings of inadequacy in comparison to her older sister. That is the simple premise of this beautiful, poetic coming of age film from Director Robert Mulligan. Mulligan is famous for previously directing Summer of '42 in 1971 and To Kill A Mockingbird in 1962, two giants of the coming of age genre. Here he directs newcomers in the principal roles: Reese Witherspoon, in her film debut, as the 14 year old girl; Emily Warfield, as the older sister; Jason London, as Court, the 17 year old boy. Reese Witherspoon is astonishingly good in her film debut, displaying every emotion that a 14 year old girl feels in experiencing young love and hurt, never striking a false note. Warfield and London are both equally good as well. The film accurately depicts each adolescent's thoughts or feelings in regard to love with heartfelt sensitivity, never crossing over into maudlin excess even once. Kudos to the autobiographical screenplay from Jenny Wingfield; this is one of the very few films about young love that is honest and consistent in tone without being emotionally dishonest or sensationalist. The music is wonderfully simple, accentuating the tone and mood from scene to scene, but never becoming intrusive. The beautiful cinematography is by famed horror director Freddie Francis, who was in his 70's when this was shot. Tess Harper and Sam Waterston play the girls' parents with dead aim accuracy for 1957, caring, strict, and emotionally simple. Gail Strickland is good also as the boy's mother. There are feelings to sort out, lessons to learn, and truths to face in this sweet-natured film that packs an emotional wallop. To date, this is Robert Mulligan's last film. This is one of the very best films of 1991. **** of 4 stars.",
         "Reese Witherspoon plays Dani, a young country girl that falls madly in love with the new 17 year old neighbor, Court, played by Jason London. Court tries his best to make Dani realize that the difference in their ages would make a love relationship improbable. Soon the nubile charm of Dani starts winning over Court's will. Next enters the meeting of Dani's older sister, played by Emily Warfield, and the beginning of a short lived love/jealousy problem. Tess Harper and Sam Waterston round out the cast. This is a fresh, free spirited; but heartbreaking drama that touches down deep. Feel free to cry.",
         "Dani(Reese Witherspoon) has always been very close with her older sister Maureen(Emily Warfield) until they both start falling in love with their neighbor Court(Jason London). But it is not after a terrible tragedy strikes that the two sisters realize that nothing can keep them apart and that their love for each other will never fade away. This was truly a heartbreaking story about first love. Probably the most painful story about young love that I have ever seen. All the acting is amazing and Reese Witherspoon gives a great performance in her first movie. I would give The Man in the Moon 8.5/10",
         "As I watched this movie I began to feel very nostalgic. As a child growing up in a rural area I felt as if I was a kid again! The swimming pond (it's called a \"tank\" in Central Texas), the running through the countryside like a wild free spirit! The story was very believable and I totally lost it and cried toward the end. Through the pain we go through in life...life goes on and there can be forgiveness.",
         "\"The Man In The Moon\" is a pretty good movie. It is very touching at times and is very well done in all respects. I wouldn't say the film was terribly original, but what is these days? The cast members all did a great job with their respective roles. I really enjoyed seeing Reese Witherspoon at such a young age, and does quite a good job. Jason London does a fine job as well. And the only other person I recognized was Sam Waterston, who did a fantastic job with his role. I really liked Sam's character (Matthew Trant) a lot. At times he seemed to be the kind of father you dread, but in the end you really like his character. The rest of the cast was very good as well. If you're into touching movies about growing up and dealing with what life throws at you, then you ought to watch this film. I'd suggest reading the plot synopsis and if that sounds like something you'd be interested in, then go for it. Anyhow, hope you enjoy the film, thanks for reading, -Chris",
         "Here's the kind of love story that I do enjoy watching. And mostly, it's for two reasons. One, it concentrates of young people, VERY young people. People who are still in their teens and are experiencing love for the first time, or at least think they are. All of us have been there in our lives and \"The Man in the Moon\" is a magnificent reflection upon our memories, maybe adding on a few more details and enhancing it further than any of us have experienced. The second reason is that is a love triangle. And I do believe that as teens, it's the most dramatic. And the story is so well developed that you believe the characters could really be in love, or are just so new to love that they just strongly believe they are and after a tragedy or so occurs, will believe it for the rest of their lives. The cast of \"The Man in the Moon\" is full of great talented names. It stars Sam Waterston, who is truly a versatile actor, well capable of playing tough district attorneys as well as strict, yet caring and wise fathers as in this film. Also there is Tess Harper, Jason London, and a young, young Reese Witherspoon. You look at the young, talented actress as she is at age fourteen and you think that about ten years down the road, she's going to win the Academy Award. All members of the cast pull off great performances and with the dialogue of the compelling screenplay, they are enhanced into looking like real people in real situations. As if it all really happened. This the kind of movie that I would like to see come out more often. Love story or not. I would love to see films that make everything look real and is not phony or disbelievable in any way.",
         "It's a generic coming-of-age story -- think \"The Member of the Wedding,\" \"Summer of '42,\" \"A Summer Place,\" even \"Little Women\" -- and there are moments where Mulligan might have omitted the soupy music, not used slow-motion, or played down the golden-lit prettiness of the setting. Otherwise, it's done with rare emotional perfect-pitch. Nothing's forced, every line has feeling, and the pacing is just right. Even the below-A-list casting helps: Bigger movie stars with more recognizable personalities might have overwhelmed the material. In particular, Witherspoon is excellent: Her line readings are fresh and original, and her body language is just right for a gawky, hoydenish 14-year-old on the eve of womanhood. Waterston is also very fine, even if he has to spend much of the movie climbing in and out of the family truck. One senses that the film's makers were aware of its unpromising commercial prospects -- no big stars, no big car crashes, no special effects -- and consciously decided to make the best possible movie, box office be damned. It's intimate and honest, and it sticks to the ribs. If you find yourself misting up at the end, you don't have to feel you've been duped."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Rural Louisiana, summer of 1957, Elvis is King. At 14, Dani is coming of age. Her older sister is beautiful, smart, and off to Duke in the fall; her mom's pregnant with number four (Dad wants a son), and Dad's pretty strict. Life gets sweeter when 17-year-old Court Foster, his widowed mom, and two little brothers move into the vacant farm next door. Court likes Dani's high spirits and direct way, and though he has a man's responsibilities on the farm, they go off swimming sometimes. The waters of adolescence are deeper than Dani realizes as hers and Court's feelings get jumbled. Then Mother Nature throws wrenching surprises at Dani, and she must come to terms with new emotions.",
         "It's 1957 in rural Louisiana. The Trants are a loving family. Fourteen year old tomboy Dani Trant is the middle of three siblings. She is at the age where she has few responsibilities - although her father, Matthew Trant, believes it's time she did more around the house, especially as Dani's mother, Abby Trant, is pregnant again - and loves more than anything to go swimming in the pond in the empty neighboring Foster property, the Fosters who moved away fifteen years ago. She looks up to her sister, Maureen Trant, who she sees as the perfect, beautiful sibling, although Maureen, who will soon be heading off to college, readily admits that she has her doubts in life. As an example, she tells Dani that she may be dating Billy Sanders, but she is not going with him. When the now fatherless Fosters move back, Dani's life changes. Although their first few encounters are antagonistic, Dani eventually falls in love with the oldest Foster son, seventeen year old Court Foster, who now acts as the male head of the household following his father's death. Although there is some sexual tension between himself and Dani, he sees her more as a special friend. Regardless, Dani, who wants more than anything for Court to be the person who provides her with her first kiss, may get her wish. Their relationship may forever change when Court and Maureen eventually meet, they who are immediately attracted to each other. Both Court and Maureen are aware of Dani's feelings for him, so they have to decide what to do about their own romantic wants for each other.",
         "After handsome 17-year-old Court Foster moves back into the long-vacant Foster ranch, 14-year-old Dani Trant falls in love for the first time, while her older sister Maureen discovers true love.",
         "In the Louisiana countryside Danielle 'Dani' Trant grows up the spoiled second child of three, at 14 still practically free of chores, leaving her lazy time to go skinny-dipping in the waterhole. There, swimming in the buff, she meets her neighbor, boy Court Foster, diving in his boxers, at 17 already the fatherless head of a taxing farm household with two kid brothers, mature beyond his years, who wisely resists her shameless attempts to kiss and probably more. Yet she imagines their innocent friendship to herald much more, until Ma's late-term hospitalization brings older sister Maureen, a Duke student, back home. Maureen naturally appeals more to Court's courting instincts. Dani will sadly have to deal with her jealousy after fate strikes a cruel blow at the boy both sisters desire."
      ],
      "budget": 0
   },
   "movielensId": 4061,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-09-30",
      "dvdReleaseDate": "2001-01-09",
      "directors": ["Robert Mulligan"],
      "runtime": 99,
      "movieId": 4061,
      "title": "The Man in the Moon",
      "mpaa": "PG-13",
      "actors": [
         "Reese Witherspoon",
         "Sam Waterston",
         "Tess Harper",
         "Gail Strickland",
         "Jason London",
         "Emily Warfield",
         "Bentley Mitchum"
      ],
      "imdbMovieId": "0102388",
      "originalTitle": "The Man in the Moon",
      "genres": [
         "Drama",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": ["IdU3nAl0n3c"],
      "plotSummary": "Maureen Trant and her younger sibling Dani share a strong connection, but local boy Court Foster threatens to throw their bond off balance. Dani and Court meet first and have a flirtatious rapport -- but when he meets Maureen, he falls hard and they begin a passionate affair. The new couple try to keep their love hidden from Dani, but she soon learns the truth, disavowing her sister. But a heartbreaking accident later reunites the girls.",
      "tmdbMovieId": 17474,
      "avgRating": 3.52222,
      "releaseYear": "1991",
      "numRatings": 1305,
      "posterPath": "/6joNFlFTW7uKr7JZYJCoLyUx3B2.jpg"
   }
}