{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "tragedy",
            "id": 10614
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "baboon",
            "id": 18161
         }
      ],
      "imdb_id": "tt0108451",
      "video": false,
      "title": "Untamed Heart",
      "recommendations": [
         14603,
         8428,
         38554,
         45225,
         24073,
         19033,
         12723,
         47045,
         83489,
         31923,
         17207,
         19727,
         22792,
         51321,
         46283,
         46925,
         41659,
         15582,
         13891,
         31633
      ],
      "backdrop_path": "/puV2n3MGnRoizpnOin2L0cd1H6P.jpg",
      "revenue": 18899204,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe44fbc3a368484e041f99",
               "name": "Christian Slater",
               "profile_path": "/3ElLWjnvchMS6Q4cIQOK8QNAoMG.jpg",
               "id": 2224,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Caroline",
               "gender": 1,
               "credit_id": "52fe44fbc3a368484e041f9d",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cindy",
               "gender": 1,
               "credit_id": "52fe44fbc3a368484e041fa7",
               "name": "Rosie Perez",
               "profile_path": "/zz7D8Wnxw91bddp481fYxYKMeuO.jpg",
               "id": 4810,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Howard",
               "gender": 2,
               "credit_id": "544bdcef0e0a2608cd00040a",
               "name": "Kyle Secor",
               "profile_path": "/h2J7pWO5sPZmcnAM9JWj1mvuTb9.jpg",
               "id": 40258,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Patsy",
               "gender": 2,
               "credit_id": "544bdd040e0a2608cd00040e",
               "name": "Willie Garson",
               "profile_path": "/xZ09uKkIMIRWDNqmyhb1AeEOo71.jpg",
               "id": 1542,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jim",
               "gender": 2,
               "credit_id": "59680c16c3a3686f6000b9ed",
               "name": "Joe Minjares",
               "profile_path": "/dr75CZaDH3hyg1jUREBkyqtXMRx.jpg",
               "id": 1357694,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44fbc3a368484e041fa3",
               "name": "Tony Bill",
               "profile_path": "/u2bReGWYZYurA6OXIdF2VOdCX1z.jpg",
               "id": 57138,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "544bdcde0e0a2608c8000473",
               "name": "Tom Sierchio",
               "profile_path": null,
               "id": 1377536,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.437774,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26333,
      "vote_count": 66,
      "budget": 0,
      "overview": "Caroline, a young waitress who seems to have bad taste in men, is on her way home one night when thugs attempt to rape her. Adam, the mysterious busboy who works at the same diner, helps fight off the assailants, and she begins a relationship with him -- but not all their fellow Minnesotans are happy for them. Meanwhile, the couple face their own difficulties when Caroline finds about Adam's past, including his unique health condition.",
      "similar": [
         1643,
         24420,
         11224,
         50546,
         46705,
         86331,
         249397,
         979,
         226,
         288036,
         72207,
         17609,
         22971,
         1417,
         1903,
         2770,
         3933,
         6075,
         10719,
         10545
      ],
      "original_title": "Untamed Heart",
      "runtime": 102,
      "poster_path": "/nqwjTYu6Zt1kCG2B1PuDSK782AS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1993-02-12",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "He doesn't make sense. She doesn't make sense. Together they make sense.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tony Bill"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Tom Sierchio"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108451/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5MjU4OTYzNV5BMl5BanBnXkFtZTcwMjU0MjAwMQ@@._V1_SY313_CR1,0,214,313_AL_.jpg",
      "actors": ["Stars: Christian Slater, Marisa Tomei, Rosie Perez | See full cast and crew »"],
      "reviews": [
         "\"Untamed Heart\" is an absolutely touching tear-jerker romance. Every once in a while, I just want to find a movie that allows me to let go and just cry. This is definitely one for the records. The chemistry between Christian Slater and Marisa Tomei is so strong that you just can't help but believe these two people actually care about one-another. Marisa Tomei as Caroline, a waitress that seems to work all hours of the night and Christian Slater as Adam, her quiet, secret admirer dishwasher with a heart problem. Throw in Rosie Perez as Caroline's smart-ass best friend and what more could you ask for? These characters have such depth that, even though the plot is a bit predictable, you feel so much for them and by the end, you will be reduced to tears. I still tear up every time I see this movie. The perfect film for any sap with a taste for sentiment. It will always have a special place in my heart. A romance to go down in movie history. 9/10!",
         "Young, outgoing waitress Caroline (Marisa Tomei) still lives at home with her parents and younger brother. Although she has had her heart broken numerous times, she has not become cynical about love. Adam (Christian Slater) is a busboy at the same restaurant as Caroline; he is, however, a shy recluse who doesn't relate to people very well. Yet, when a crisis occurs, it is Adam who comes to Caroline's rescue. For the first time, she sees him in a different light and they begin a loving relationship. Caroline is finally experiencing the happiness she deserves and Adam is opening his life to someone else. Still, something from Adam's past comes forward to haunt them. Will they find a happy ending? This is an extremely touching and humorous love story about working-class people. The movie has many candid scenes about restaurant life and the people who work there. Also, Tomei gives a sweet, irresistible performance that warms the heart. Although one may need a kleenex or two before the film is over, its loving atmosphere will remain with the viewer for a long time. Recommended for everyone searching for a film to provide a feel-good-about-life day at the movies.",
         "When I was married, my then wife dragged me to see this movie on Valentines' Day weekend, when it first released. I agreed to go based on the fact that one of my favorite actresses appeared in it, Marisa Tomei. The most I'd seen of Christian Slater was in 'Robin Hood', and didn't care much for him in that. What a change one movie can make for opinions on an actor. I was engaged with this movie from frame one. Cliff Eidelman's score is captivating and very moving in this movie, flowing along effortlessly with the film. Marisa Tomei is pure magic, and Rosie Perez is just right as the screechy best friend. What surprised me most was Slater's performance. Here, he gives a very introspective and introverted performance, that, in my opinion, was worthy of an Oscar nod. The mannerisms with which he portrays Adam as the shy orphan who seems unsure of himself are dealt with great detail and care. He hasn't had a better performance before or since. That doesn't overshadow Tomei's performance in this film. She is simply beautiful, no matter what part she is portraying. She has the Minnesotan accent down pat, and you believe you are in the Twin Cities while watching the film. I feel her performance in this movie was a step above \"My Cousin Vinny\". Too bad the Academy didn't agree. And when Slater and Tomei occupy the frame together, it is, for a lack of a better term, absolute glory. The chemistry between these two actors on screen is so thick you couldn't cut it with a chainsaw. The cinematography, by Jost Vacano, who also did movies like \"Das Boot\" and \"Robocop\", while not visually stunning, is very technical, with the use of pull-pans/push-pans and ground perspective shots. A very well-done film all the way around, from Bill's directing to Mia Goldman's seamless editing. Too bad some wiseacre reviewer gave the ending away in a review of the film before release and literally killed it's box office. I own the DVD now, and I can offer one warning: Gentlemen, if you watch this movie with your wife/significant other, be prepared to offer up excuses like 'there is something in my eye', or 'it must be my allergies', if you're not comfortable admitting letting the waterworks go. The proclamations of affection between these two are so charming, yet not heavy handed. It's the kind of things you would have wish you'd said to that 'one that got away'. My rating: 9 (no movie has ever gotten a 10 from me, but this one almost had me reconsidering)",
         "I absolutely loved this movie, and stumbled upon it quite accidentally. I am a fan of Marisa Tomei and Christian Slater so I decided to give it a shoot as a rental. I now own it on Laser Disc (remember those) I found this movie both touching and heart-warming. I consider it a must see.",
         "UNTAMED HEART tells the story of the romance between a lovelorn diner waitress (Tomei) and shy busboy (Slater). It is a sad, sweet movie without the usual gloss and pretension that ruin so many filmed love stories. These are working class people living working class lives. Tomei is touching as a woman who has been hurt once too often but who still holds out hope. Slater gives one of his best performances as the virtually mute busboy with both social and health problems. A heart-tugging vignette at the very beginning, involving the busboy as child in a Catholic orphanage, foreshadows later events in the film. Slater underplays beautifully, and thankfully so as this is Tomei's film all the way. She never looked more beautiful than she does here. Watch for the Christmas morning scene. Tomei wakes up to a special magic thanks to her busboy pal, and magnificently conveys her sense of wonder. Beware, however: UNTAMED HEART (BOY WITH A BABOON HEART would have been a better title) is a two-box of Kleenex.",
         "In my opinion, UNTAMED HEART is one of the sweetest, tear-jerking, and romantic love stories of all time! When Caroline (Marisa Tomei) got raped, I got scared to death. This was because I thought she was going to die. Lucky for her, when Adam (Christian Slater) saved her, I thought it was absolutely romantic. This was because a romance quietly developed between them. Also, they started dating each other. Oh, that was so sweet! Before I wrap this up, I'd like to say that I liked it when Adam and Caroline went ice-skating, to the hockey game, and to the New Year's Eve party. Now, in conclusion, this movie filled my heart with lots of love.",
         "As an audience we all grow more cynical and demanding, the more films that we see. Our expectations are constantly being upgraded and shifted to new levels of anticipation. I really did not expect 'Untamed Heart' to have quite the same impact today, as it did when I first saw it. I was wrong. I still cried. It's still the most heart warming, feel good, romantic comedy I've ever seen. For those who are not familiar with the story, Christian Slater plays the part of the mysterious Adam who works as a busboy in a diner. All his life he's never physically come into contact with people, and he never speaks. You could say he lives in his own magic kingdom, hermetically sealed from the outside world-so much so that at the age of 26, he still believes in a fairy tale the nuns told him when he was growing up in an orphanage, involving magic rubies trickling down from a magic mountain, and being given a 'baboon heart.' Later, he even admits to possessing 'magic' records that he plays 'whenever the world doesn't agree with him.' In real life it would be hard not to raise a smile at such an account, or at the very least be convinced the person was in need of some serious medication, but it's a testament to the power of the story that like Caroline(portrayed by the Marisa Tomei) rather then dismiss him, we start accepting his childlike understanding of the world. We overlook it when at the start of the film, Caroline asks him questions and he doesn't even respond. Anybody else would consider that plain rude. We forgive him when he creeps into Caroline's bedroom to watch her sleeping. We understand when he follows her home repeatedly, keeping at a safe distance to remain undetected. The reason we're able to make such adjustments, is that normal rules here do not apply, because in the world that he lives in, it's not inhabited by mere humans. He still occupies that fantastic world that we so readily discarded as children, because we had to embrace the darker reality of adulthood in order to cope with our new responsibilities. So Adam's character, while undoubtedly naive, offers no real threat. As an audience, we know where he's coming from. He's simply trying to make sense of the world around him, and does not understand how to behave any different. Gradually, over the course of the film Caroline brings out more and more from Adam, and because of his unique perspective and vantage point, some of the things he says and does to convince Caroline of his love for her remain long after the credits roll. If we've ever had our heart broken and as a result we try to 'tame' our heart so we don't get hurt again, this is the film we should watch, because it reminds us what love is, and what love can be. Any hurt that we may have felt is nothing compared to the joy we feel when we do get it right.",
         "I watched this film for the first time and I was upset by the way the film started at the beginning because it wasn't what I expected at all. I didn't know what kind of film it was not having seen or heard of it before and I thought it to be all about a woman taming a man and finding love. As the film progressed it was so full of love and romance, fun, laughter, two people enjoying each others friendship and growing into more, just wonderful. I was devastated at the happenings within the film the brutality as well as the goodness within it but the originality of almost real life was what made the film believable. I expected a very happy ending and it took me ages to stop crying because I have a friend who had a similar experience. It is a beautiful film and quite comparable in a way to love story. A love for another human being that was unsurpassable. I would recommend anyone who has even a hard heart to watch this film. I absolutely loved the film and the actors were just superb.",
         "This film is one of the warmest and truly from the heart pictures I have seen in recent years and from the out set in the orphanage to the warmth you could feel in the could at Christmas this film shines through. The leads are perfect and the direction all but flawless. You could never say that Tony Bill missed his chance in the film business with a carrier spanning more than 40 years with countless acting roles in films such as Ice Station Zebra, as a director he shorly has more great stories to tell and would love to see him at the helm of a non made for TV film once again, where he should be!.",
         "A childhood illness leaves a young man with a serious health problem and a somewhat odd outlook on life. Being rather retiring, he was considered strange by his fellow employees; causing them to shy away from him. Despite all this, he gets to know one of the girls better after he helps her out of a sticky situation. They manage to have a brief yet fulfilling relationship. Very romantic, I loved it."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Caroline has not had much luck in love. Boyfriends seem to either leave her or cheat on her. Then she meets a shy, introverted man at work named Adam. When leaving work one day, two men attack her. Adam comes to her rescue. Unfortunately, retaliation by the attackers sends Adam to the hospital where he finds out he has a diseased heart. Adam is an orphan and was told he had a baboon's heart. He refuses a transplant, as he believes his love for Caroline is contained in his damaged heart. Before tragedy can strike, they have a passionate but brief romance. Adam opens up to Caroline and he, in turn, heals her broken heart.",
         "Girl meets boy. They fall in love. Tragedy strikes."
      ],
      "budget": 0
   },
   "movielensId": 4067,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-02-12",
      "dvdReleaseDate": "2001-01-09",
      "directors": ["Tony Bill"],
      "runtime": 102,
      "movieId": 4067,
      "title": "Untamed Heart",
      "mpaa": "PG-13",
      "actors": [
         "Christian Slater",
         "Marisa Tomei",
         "Rosie Perez",
         "Kyle Secor",
         "Willie Garson",
         "Joe Minjares"
      ],
      "imdbMovieId": "0108451",
      "originalTitle": "Untamed Heart",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["OrHKg87fUCc"],
      "plotSummary": "Caroline, a young waitress who seems to have bad taste in men, is on her way home one night when thugs attempt to rape her. Adam, the mysterious busboy who works at the same diner, helps fight off the assailants, and she begins a relationship with him -- but not all their fellow Minnesotans are happy for them. Meanwhile, the couple face their own difficulties when Caroline finds about Adam's past, including his unique health condition.",
      "tmdbMovieId": 26333,
      "avgRating": 3.22367,
      "releaseYear": "1993",
      "numRatings": 921,
      "posterPath": "/nqwjTYu6Zt1kCG2B1PuDSK782AS.jpg"
   }
}