{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116119",
      "video": false,
      "title": "Dog Run",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [],
      "popularity": 0.00118,
      "production_countries": [],
      "id": 287991,
      "vote_count": 0,
      "budget": 0,
      "overview": "Eddie (Marc) and Miles (DuPlessis) are teen runaways who meet and become friends in New Orleans. They hook up with a local drug dealer who sends them to New York City for a drug deal with the promise of easy money and a place to live. When the deal falls through, they find themselves penniless on the Lower East Side. They discover a vast underworld of abandoned buildings where kids live and are drawn into a world of sex, drugs, and survival.",
      "similar": [],
      "original_title": "Dog Run",
      "runtime": null,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2001-04-04",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["D. Ze'ev Gilad"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "D. Ze'ev Gilad",
         "Brian Marc"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116119/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5OTYyODczNl5BMl5BanBnXkFtZTcwMDYwNTUxMQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Brian Marc, Craig DuPlessis, Lisa Ristorucci | See full cast and crew »"],
      "reviews": [
         "Only the executive producer from what I can see was involved in Kids, but this film is in the same vein as Kids and Gummo, exploring a part of the unseen underworld, in this case the young homeless of New York. This world is introduced to us through two guys from Kentucky who get cut off by their drug dealer boss, and have a go at staying in New York with little money and nowhere to stay. The format is more conventional than Kids or Gummo in that it has a more of a storyline, it's less fly-on-the-wall but still has a documentary aspect to it. If you liked Kids or Gummo I'd recommend this film.",
         "I remember when i first watched this gritty cinematic portrayal of life on the streets and i remember thinking 'wow' this is a good one. from the mise en scene to the soundtrack this film is an incredible journey through the streets of swindon in the 90's. The performances of it's cast are second to none, most notably from the drug dealer played by jeff twiss. The way Twiss works against the camera rather then with it allows the viewer insight into what is clearly a very troubled man. His on screen presence is something that reminds me of a young marlin brando but with larger thumbs. Roberta, played by Lisa Cork is another fine performance to be credited. From the movements of her mouth and tongue when speaks to the gestures of her feet and elbows when she jumps we know that we are dealing with a performer that is rewriting the acting rule book once again. this is most evident in the penultimate song where she sings the romantic classic 'oh un qué gallo grande', a scene i will never forget",
         "The cover of 'Dog Run' pronounced it came from the maker of 'Kids', the NY real life drama about a bunch of truly screwed young kids (naturally, I enjoyed it). Seriously though, Kids had good acting, and an alternative angle to story telling than most other movies. So when I saw 'Dog Run' I was intrigued. Once again the story is set in NY. It revolves around the friendship of two guys, who have come to the big city to deal drugs. They are quickly screwed over by their dealer and find themselves with no money in a strange city. The theme of friendship runs deep in the movie, not only that of Eddie and Miles, but the betrayal of their dealer friend, and the youths they join in with in the city. Through the movie Eddie and Miles separate further and further. Eddie, with his girlfriend Tara, goes deeper into a world of heroin addiction while Miles moves on from homelessness with his new girlfriend and gets a job. Through this separation you see the trials of friendship when drugs and adolescence are involved. Both of these characters develop really well throughout the movie, Miles especially. He goes through a transition concerning Eddie, drugs and his father. Craig DePlessis is hopefully an actor with a good career in front of him. The ties to \"Kids\" are immediately apparent in the cinematography. The low - budget doco - style of the film is very similar. In this way it is similar to Blair Witch in that the camera is very shaky and nothing at all like regular movie production footage. More like a home video. The style is fantastically suited to this type of movie though because it shows the grit and realism that the movie is trying to get across. Like \"Kids\" and \"Gummo\" (that was one nasty, nasty movie - America is one f**ked up place) \"Dog Run\" will quite brazenly shock but it does portray a better story than both of these previous movies and definitely worth watching if you can stomach a bit of harsh viewing material.",
         "I was lucky enough to see this film 2x once at the Toronto Film Festival. And again recently in Miami. I thought it was interesting that the first time I saw it was in 1996 then it was in a theatre in 2002- In 1996- this was a cutting edge film. I liked kids and I thought Dog Run does a better job at a similar genre. The camera movement is subtle and the performances are truthful. As where in Kids we did not get to know the leads, In Dog Run the character development was enthralling. Especially after the sex scene where these two diifferent individuals show a completely opposite way of handling a situation. I've had friend who was hooked on H. And the actors playing Eddie and Tara gave a ghostly portrayal of addiction. It was a hard film to watch because it was such intense subject matter. It seems that the actors blended well with the real runnaways. Anyhow- it seems that its release in mist of reality TV hell is poor timming- everyone and grandma is doing the real feel shooting style. I remember at Toronto in 1996 how everyone was raving about this athentic work. I looked up recent reviews and mixed they were. TO me if you liked KIDS or Trainspotting you'll groove to this film. Ultimately id say this is a film about friendship and the chioces we make in life- like do we stay as we are or do we adapt. Overall- the gritty feel, rave music and intense performances made this film a top notch view in this genre. Sex, drugs, and the runnaway dilema of living on the streets- seems that these punked out kids have more to them then just the need for money. The film sits with you if you care about social issues and ponder the world we live in.",
         "I don't want to spend too much time on this one. It's full of things that are supposed to shock you...they don't. Terribly written story, no believable characters, no motivation for how or why the characters interact, bad dialogue...it runs the gamut of badness. I would have left the theater 30 minutes into this masterpiece of poop, but a friend of mine wanted to stay because, apparently, the director was in the theater and he didn't want to offend him. I didn't realize the director himself was watching along with me(aside from the 10 or 15 minutes I used my hat to cover my face...no joke) but if I had I would've stood, said something about being able to take no more, and run from the theater as if Jason Vorhees had been hot on my trail. Instead, I thought about all of the other things I could've done with my time...it made me sad. I finally decided to sleep until the credits, but sleep wanted nothing to do with me. The worst thing about Dog Run is that all people involved with its production believed they were making an impacting, profound film. Absolute torture to sit through this one and perhaps one of the worst films I've seen in the last ten years. I discovered that I hated it about 20 minutes in. From that point on it just got worse."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "C&P Entertainment",
         "Zampion Productions"
      ],
      "summaries": ["Two runaways struggle for survival on the gritty streets of New York."],
      "budget": 0
   },
   "movielensId": 4071,
   "movielens": {
      "languages": [""],
      "releaseDate": "2001-04-04",
      "dvdReleaseDate": "2003-05-20",
      "directors": [""],
      "runtime": 0,
      "movieId": 4071,
      "title": "Dog Run",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0116119",
      "originalTitle": "Dog Run",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Eddie (Marc) and Miles (DuPlessis) are teen runaways who meet and become friends in New Orleans. They hook up with a local drug dealer who sends them to New York City for a drug deal with the promise of easy money and a place to live. When the deal falls through, they find themselves penniless on the Lower East Side. They discover a vast underworld of abandoned buildings where kids live and are drawn into a world of sex, drugs, and survival.",
      "tmdbMovieId": 287991,
      "avgRating": 2.16667,
      "releaseYear": "2001",
      "numRatings": 3,
      "posterPath": null
   }
}