{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0271461",
      "video": false,
      "title": "Dinner with Friends",
      "recommendations": [
         2703,
         78051,
         71465,
         46228,
         23134,
         27353,
         49928,
         60662,
         109614,
         62984,
         106968,
         70214,
         52221,
         36730,
         53314,
         330206,
         244776,
         70180,
         62670
      ],
      "backdrop_path": "/tUt8qfXeqD9bz6UOiWgHjUZslZr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gabe",
               "gender": 2,
               "credit_id": "52fe44a1c3a368484e02dd7d",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Karen",
               "gender": 1,
               "credit_id": "52fe44a1c3a368484e02dd81",
               "name": "Andie MacDowell",
               "profile_path": "/znSR45ZcNNlb1sNP1gYmVACYI2a.jpg",
               "id": 1533,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tom",
               "gender": 1,
               "credit_id": "52fe44a1c3a368484e02dd85",
               "name": "Toni Collette",
               "profile_path": "/oMps1ZPH3dHmqZmrpZcRiyUBgA.jpg",
               "id": 3051,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Beth",
               "gender": 2,
               "credit_id": "52fe44a1c3a368484e02dd89",
               "name": "Greg Kinnear",
               "profile_path": "/agOTbOC76I6rC7TPuCTquvngXRu.jpg",
               "id": 17141,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Danny",
               "gender": 2,
               "credit_id": "5349ababc3a3682e07000599",
               "name": "Taylor Emerson",
               "profile_path": "/XtfQeOvj8DODXgsSSm3cWt8GOU.jpg",
               "id": 145106,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Issac",
               "gender": 0,
               "credit_id": "5349abb5c3a3682dfe000539",
               "name": "Jake Fritz",
               "profile_path": null,
               "id": 1236034,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Laurie",
               "gender": 1,
               "credit_id": "5349abbcc3a3682ded000537",
               "name": "Holliston Coleman",
               "profile_path": "/o73iIGHrp6QBbwuasg5be8q3Egp.jpg",
               "id": 65362,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Sammy",
               "gender": 2,
               "credit_id": "5349abc3c3a3682ded000539",
               "name": "Angus T. Jones",
               "profile_path": "/eaUg2KQXTfOKLFZIsfAGANiIQWa.jpg",
               "id": 77117,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Al",
               "gender": 2,
               "credit_id": "5349abcac3a3682de4000573",
               "name": "Beau Holden",
               "profile_path": "/23jEbLPudu9dzoxzWkUa1nM8nCS.jpg",
               "id": 1005339,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Hostess",
               "gender": 1,
               "credit_id": "5349abd2c3a3682dd800055b",
               "name": "Dina Morrone",
               "profile_path": "/1CnfEvkCTp47ghKQfNQktqWv0Rw.jpg",
               "id": 41129,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Herself",
               "gender": 1,
               "credit_id": "5349abd9c3a3682dd800055d",
               "name": "Ruth Reichl",
               "profile_path": "/l7sc4IK2rg2ht1F6FihDCrqpkBn.jpg",
               "id": 404347,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Photographer",
               "gender": 0,
               "credit_id": "5349abe2c3a3682df60005d3",
               "name": "Romulo Yanes",
               "profile_path": null,
               "id": 1309423,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Nancy",
               "gender": 0,
               "credit_id": "5349abeac3a3682ded00053e",
               "name": "Caroline Neville",
               "profile_path": null,
               "id": 1309424,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a1c3a368484e02dd79",
               "name": "Norman Jewison",
               "profile_path": "/umNoz1FsJtvoWKlCsgNOqWlfrgh.jpg",
               "id": 13563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a1c3a368484e02dd8f",
               "name": "Roger Deakins",
               "profile_path": "/pSCN7CfILlfQrxX43Kgqrx5mBYQ.jpg",
               "id": 151,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5349ac06c3a3682de4000579",
               "name": "Donald Margulies",
               "profile_path": null,
               "id": 166776,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5349ac1ac3a3682ddf000520",
               "name": "Laura Ziskin",
               "profile_path": null,
               "id": 7627,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5349ac35c3a3682ded000545",
               "name": "Daryl Roth",
               "profile_path": null,
               "id": 954668,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "555db0129251413b290005dc",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "555db0379251413b290005e2",
               "name": "Ronald Sanders",
               "profile_path": null,
               "id": 310,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "555db04892514175710011a3",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "555db06a9251416b57003729",
               "name": "Jane Goldsmith",
               "profile_path": null,
               "id": 1427384,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "555db08e925141760b001194",
               "name": "Peter S. Larkin",
               "profile_path": null,
               "id": 16466,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "555db0a2925141757e0011d6",
               "name": "Kevin Constant",
               "profile_path": null,
               "id": 16467,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "555db0b4c3a3686a100010c0",
               "name": "Nancy Nye",
               "profile_path": null,
               "id": 53182,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "555db0c79251417703000882",
               "name": "Shay Cunliffe",
               "profile_path": null,
               "id": 19971,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.432075,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24625,
      "vote_count": 17,
      "budget": 0,
      "overview": "A husband and wife reevaluate their marriage after their closest friends, another couple decide to split up after twelve years.",
      "similar": [],
      "original_title": "Dinner with Friends",
      "runtime": 94,
      "poster_path": "/we2NpwHC8LsQcIF8fZbb28Owpal.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nina Saxon Film Design",
            "id": 1693,
            "origin_country": ""
         },
         {
            "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
            "name": "HBO",
            "id": 3268,
            "origin_country": "US"
         }
      ],
      "release_date": "2001-01-01",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Four Friends. Two Marriages. One Divorce.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Jewison"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Donald Margulies",
         "Donald Margulies"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0271461/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2MjAzNDk2N15BMl5BanBnXkFtZTcwNjkxMTQyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Dennis Quaid, Andie MacDowell, Greg Kinnear | See full cast and crew »"],
      "reviews": [
         "Two couples, upper middle class and no financial problems: four friends. They marry at about the same time, each have two kids, they spend a lot of time together, *best* friends... And then, one of them split up. The movie, by the way of dialogs, shows how each of the four's world is shaken up, as their unspoken contract, namely, to raise their kids together, to grow old together, is broken. Questions: Whose fault is the breakup, husband's or wife's? Which couple has it right: those, who stick to marriage or those who break out of the rut? Who has the right to judge: those who keep to their marriage vows, or those who acknowledge that their relationship has been a lie? Can we demand that our friends always tell us the truth? How do we react when our closest friends question the unspoken foundations of our lives? The movie follows the actions and reactions of our characters in this situation. Nobody is right, nobody is wrong. In a way, everybody is right. That is what makes the movie interesting. The men act the way men act, and the women act the way women act. The questions are not really answered, they are debated, and the movie shows that completely grown-up people are really unable to answer them. I liked the performances of the actors. Andie McDowell was as beautiful as she always is. I also liked the two guys. The environment, the camera, etc. seemed just right. But the most interesting were the dialogs. So, if you like movies in which people investigate themselves, their lives, and their relationships, without giving you a definite answer what to do, you may enjoy this movie.",
         "This movie is really about Gabe and Karen (Quaid and MacDowell) - how they tackle life as a couple. The movie begins with the collapse of Tom and Beth's (Kinnear and Collette) marriage, and proceeds to show the reason. Tom and Beth are no different from any other couple who eventually drift apart after years of marriage, but the real focus here is Gabe and Karen's hand in their inevitable parting. We learn from a flashback that Tom and Beth were initially best friends of Gabe and Karen's respectively. They were set up to fall for each other. The setting was perfect - a beach house, a sunset, and both were in the thirties and ripe for marriage. Later however, we gather the truth about each person, and why the marriage was foredoomed to failure. What is impressive though, is that despite the unravelling of each person's flaws, we don't despise the characters. The flaws are realistic and it's easy for us to find them in our friends and perhaps in ourselves. Tom and Beth are full of resentment, towards each other and towards Gabe and Karen. They have recently realized that they were not meant for each other, and they were just products of Gabe and Karen's subconscious manipulations. They had fallen into Gabe and Karen's perfect setting - having their best friends fall in love with each other and living out the rest of their lives together as a foursome. Tom and Beth even have two daughters as a foil to Gabe and Karen's two sons! The movie reveals something I've noticed in many friendships. There is a dominant personality and there is a submissive one. The dominant friend has a dream of how his life should be and his submissive friend falls agreeably into the role created for him in that dream. It is like a script the dominant friend has written. He naturally writes himself into the Lead Actor role and he proceeds to create the role of Supporting Actor for his submissive friend. Gabe and Karen's script involved growing old together as a foursome. The plot of their story had been written for four actors. Unfortunately they hadn't counted on Tom and Beth's withdrawal from their roles as supporting actors. Deprived of their backboard, Gabe and Karen are suddenly alone, and they realize that they have no idea how to handle their encroaching middle-age years without their four-way script beneath them. More importantly, they realize that they haven't had the need to communicate solely with each other until now and they have no idea how to do it. The ending of the movie doesn't tell you if they wind up solving their problem. It just shows you how they tackle it - they begin to rewrite the script. However this time, there are no supporting actor roles as fallbacks. They have to learn to just rely upon each other as they grow old together. My rating: 10/10",
         "TV may be mostly a wasteland these days, but every once in a while, a fine original film shows up on the tube. `Dinner With Friends' is certainly in that category. It takes the viewer deeply into the relationship between two couples and within each. They were best friends until one of the marriages hits the rocks. We see each side of that split and how it affects the other couple. Initially, sides seem to be taken along gender lines, but that reverses as each member of the separating couple finds new relationships. Is it fatal to the other marriage? Watch and see.",
         "Having seen Donald Margulies' play when it opened in New York, I was interested in what Norman Jewison, the director, had done with it for the screen version. It helps that Mr. Margulies did his own adaptation, although, it appears to this viewer, the stage version was more satisfying. Not that there's anything wrong with the film, it's just that the cast in the play was far superior than these well intentioned actors we see in the movie. Mr. Margulies has tried to open his play, but it just doesn't go anywhere. The basic premise, and a caveat to good friends, is to stay away from \"fixing up\" prospective marriage partners, as things in life are a bit more complicated than a good ending in a book, a play, a movie, or human relations. Karen and Gabe are happily married. They conjure to arrange a meeting with Beth, a painter, and Tom, a lawyer. Basically, the idea of having mutual friends meet one another, might not be bad, but in reality things should be let alone and let nature takes its course. The bright idea back fires on Karen, who, upon hearing at the beginning of the film that her best friend, Beth, is divorcing Tom, is visibly upset. She feels betrayed by these two people she was instrumental in bringing together. It's hard for both, Gabe and Karen, to think where they went wrong in their match making roles. They never take into consideration that Beth is totally wrong for Tom, and vice versa. The problem is that this couple don't think that Beth and Tom have found new partners in what appears to be a much solid relationships than what they had together. Karen and Gabe are crushed, but in reality, not everything is perfect in their own marriage. We get hints that yes, they are not completely happy, but they have decided to stay in the marriage out of decency and out of duty to their two boys, which is what Beth and Tom have failed to do. Call them old fashioned, but one has to give Karen and Gabe a lot of credit for at least trying to stay together as a family. Andie MacDowell is Karen; she is a beautiful woman. In the movie, Ms. MacDowell appears a bit distant. She loved to bring people together and resents their friends separation. Ms. MacDowell's Karen comes across as a hard and judgmental person. Dennis Quaid tries hard to give Gabe warmth. Perhaps he comes across as the best of the four principals. Toni Collette's Beth is an enigma until her confrontation with Karen at the restaurant, then, we see a woman that is not shy in telling her best friend off as she embarks in a new relationship. Greg Kinnear is Tom. He is perhaps the weakest link in the quartet, as he is perhaps, not treated fairly by Karen, or Gabe. The movie remains a bit theatrical, but Norman Jewison has done wonders with the material.",
         "In a long series of original HBO movies, the predecessor being \"WIT\". \"Dinner With Friends\" turned out to be one of the best dramatic shows HBO has produced. First of all to get a top-notch director such as Norman Jewison and Pulitzer Prize winning play to work with, they were ahead before they began. All four major stars, Quaid, Kinnear, MacDowell, and Collette more than succeeded with their tasks, but it was the two long scenes between Greg and Dennis that raised this show to greater heights. Greg Kinnear has come so far in such a short time as an actor and he can hold his own with anybody now. I think I've seen every film Dennis Quaid has made and \"DWF\" is his finest work to date. If you've ever worked as a professional actor or director, you know that the easiest scene to play is \"anger\" and the most difficult is maintaining an audience's interest while you're playing low-key drama. The low-key counterplay and interaction between these two men was superb! It was often said of the late Geraldine Page that she could act in a whole movie or a three act play and know everything she was thinking if she had NO dialogue. Quaid and Kinnear were excellent listeners and responded to each other in the same way as Page. Besides the rich and powerful screenplay, the icing on the piece was placed with Dave Grusin's melodic score, a-la \"The Fabulous Baker Boys\". The 90+ minute movie ran the gamut of emotion for its audience. I was moved from tears to laughing out loud and anger to surprise. I only hope when next years Emmy nominations are announced, people will still remember this film in August 2001. Dennis Quaid and Greg Kinnear should be at the top of the list. Thumbs UP and four solid stars!",
         "Dinner with Friends is somewhat unusual. Perhaps I''m just not as well-versed as I thought, but I haven't seen other movies about two couples that are friends, one splits up and its effect on the other couple. This movie obviously originates as a stage play as it consists of four people sitting around and talking. As such, you can only make it so interesting, visually. Because of this, the movie relies pretty much exclusively on the dialog and actors to make things interesting, and they mostly deliver. There were a few moments where the acting seemed very stage-style, for lack of a better term, but still decent overall. I would caution you that you won't like this movie, if you can't connect with the source material. It's a study of marriages and why some work and others don't as well as the effects of a divorce on friends. I would recommend it mostly to people who have had long-term relationships and/or are interested in them.",
         "Dinner With Friends is perhaps one of the best written plays about marriage & the reaction of one couple when there best friends split up. Dennis Quaid & Andie Mc Dowell are a happily (even tho they squabble a lot) married couple. Dave Kineer & Toni Collete are there best friends who are going to get a divorce. We find out all about why this is occuring & the reactions of each couple as they go there separate ways, The acting is near flawless. Norman Jewison directed, & he always gets the best out of him performers. Since this is an adult comedy drama, it is not recommended for youngsters, it has no action & is too mature for them. The only others in the cast are the couples children & they are nicely portrayed. a **** rating from me. This is on HBO only, at the present time, & is another winner from them as always Jay Harris",
         "After having seen this movie about four times I have to say that this movie is a biting look into the life of 4 friends that may make you uncomfortable, or hit you right where it hurts. Quaid and MacDowell and Kinnear and Collette are two married couples who have been friends, shared lives, stories and the raising of their families for 12 years. Collette drops the bomb, alone, on Quaid and MacDowell, that Kinnear is leaving her. The movie unravels the friendships by exposing that neither Quaid or MacDowell like Kinnear and Collette very much,individually, after their secrets and lies are exposed. I think true friends overcome, and real friends fall by the wayside, as in this movie. Great acting, dialog, direction, etc..But a intense, deeply emotional film that may cause you to look at your friends and your spouse differently. And ask the question: Could it all fall apart?",
         "I happen to be someone who does like to watch the credits roll in when a movie ends. I know it's one of those silliest things a person can do after watching a movie but then when I saw the final credit, it's a made-for-TV movie from HBO. I was pretty impressed. Gabe and Karen (Dennis Quaid and Andie MacDowell respectively) are food critics. They had been happily married for 12 years and have two sons as well. When one day their friend Beth (Toni Collette) was being invited over for dinner with her two sons in tow, Beth broke the news that she and her husband Tom are being separated because he was having an affair outside of the family. Given Tom is Gabe's friend and Beth is Karen's friend, married couple Gabe and Karen started to defend over what each of their best friend had did. The way Tom questioned his wife over whatever happened at Gabe and Karen's house when she was there with the kids was a little, kind of scary. But maybe given he is a lawyer, it's just like that. The movie even had scenes of flashback, showing the happier times between the four friends themselves. It was definitely really sweet to see those scenes. Sometimes, the lines are not always being drawn clearly when it come to the marriage of someone you know or maybe your own's when something starts to happen. The grey area is there. Now maybe I am not of marriageable age yet, but then standing up to whatever your friend had did is one thing I am clearly aware about. My final say? Like what I had mentioned on the title for this review.",
         "Dinner With Friends is the perfect movie for those who felt that Notting Hill was a little too action-packed. The story involves two post-yuppie couples, one of whom split up, and how it affects all of their lives. The film mainly consists of the four of them discussing relationships with each other - and I'm talking about ninety percent conversation here, so be warned - while occasionally interrupted with people looking emotional. This would be a great film for those interested in the psychology behind modern relationships. For the rest of us, it's a potential cure for insomnia."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "HBO Films",
         "Home Box Office (HBO)",
         "Nina Saxon Film Design"
      ],
      "summaries": [
         "This candid, often-funny drama explores the bittersweet side of friendship through the eyes of two best-friend married couples. Invited to dinner at the suburban home of husband-and-wife food critics Gabe and Karen, Beth reveals she's breaking up with her husband Tom after 12 years of marriage and two children. This unexpected revelation forces Gabe and Karen to reevaluate their seemingly perfect relationship, as well as their friendship with two people who seem to be refusing the life they all once worked so hard to preserve. The drama is set in present-day Connecticut and New York City, with flashbacks to Martha's Vineyard twelve-and-a-half years earlier.",
         "A character driven story told through the present and the past. Gabe and Karen are happily married as food critics with a nice house, two sons, and great jobs. But their lives change for quite possibly the worst when their best friends, Tom and Beth have announced their separation after twelve years. Such an incident causes Gabe and Karen to look back at their marriage and wonder if they're on the same road as Tom and Beth were.",
         "A husband and wife reevaluate their marriage after their closest friends, another couple decide to split up after twelve years."
      ],
      "budget": 0
   },
   "movielensId": 40817,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-01-01",
      "dvdReleaseDate": "2002-01-22",
      "directors": ["Norman Jewison"],
      "runtime": 94,
      "movieId": 40817,
      "title": "Dinner with Friends",
      "mpaa": "",
      "actors": [
         "Dennis Quaid",
         "Andie MacDowell",
         "Toni Collette",
         "Greg Kinnear",
         "Taylor Emerson",
         "Jake Fritz",
         "Holliston Coleman",
         "Angus T. Jones",
         "Beau Holden",
         "Dina Morrone",
         "Ruth Reichl",
         "Romulo Yanes",
         "Caroline Neville"
      ],
      "imdbMovieId": "0271461",
      "originalTitle": "Dinner with Friends",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A husband and wife reevaluate their marriage after their closest friends, another couple decide to split up after twelve years.",
      "tmdbMovieId": 24625,
      "avgRating": 2.91429,
      "releaseYear": "2001",
      "numRatings": 70,
      "posterPath": "/we2NpwHC8LsQcIF8fZbb28Owpal.jpg"
   }
}