{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witness protection",
            "id": 4009
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "youth",
            "id": 14751
         },
         {
            "name": "disguise",
            "id": 18118
         },
         {
            "name": "delaware",
            "id": 230544
         }
      ],
      "imdb_id": "tt0093186",
      "video": false,
      "title": "Hiding Out",
      "recommendations": [
         14708,
         62327,
         24081,
         32060,
         47070,
         38966,
         24073,
         91101,
         44895,
         34322,
         68430,
         77246,
         33506,
         69828,
         2166,
         25212,
         17464,
         55950,
         14464,
         191094
      ],
      "backdrop_path": "/fZLYwPvee0FzKuKEDmgCgfhXNhv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Andrew Morenski / Max Hauser",
               "gender": 2,
               "credit_id": "52fe44f0c3a368484e03f83d",
               "name": "Jon Cryer",
               "profile_path": "/lUbtFIFdzGXktaFPgrznBDteI5y.jpg",
               "id": 69718,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Patrick Morenski",
               "gender": 2,
               "credit_id": "52fe44f0c3a368484e03f841",
               "name": "Keith Coogan",
               "profile_path": "/uAMrErJNb1IW78RkgpMq9id2ec8.jpg",
               "id": 56145,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ryan Campbell",
               "gender": 1,
               "credit_id": "52fe44f0c3a368484e03f845",
               "name": "Аnnabeth Gish",
               "profile_path": "/tA2iInfNHuqWvAec0wtnrji0nGw.jpg",
               "id": 49425,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kevin O'Roarke",
               "gender": 2,
               "credit_id": "52fe44f0c3a368484e03f84f",
               "name": "Tim Quill",
               "profile_path": null,
               "id": 155921,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bakey",
               "gender": 2,
               "credit_id": "52fe44f0c3a368484e03f853",
               "name": "John Spencer",
               "profile_path": "/9sU5FEzlf921n6NxHmXgJB3994T.jpg",
               "id": 34691,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gertrude",
               "gender": 1,
               "credit_id": "52fe44f0c3a368484e03f857",
               "name": "Joy Behar",
               "profile_path": "/uiST4ZJPBDFb19fcsNaNovhTDrS.jpg",
               "id": 166772,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a368484e03f84b",
               "name": "Jeff Rothberg",
               "profile_path": null,
               "id": 33611,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a368484e03f85d",
               "name": "Bob Giraldi",
               "profile_path": null,
               "id": 89467,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.558695,
      "production_countries": [],
      "id": 26156,
      "vote_count": 16,
      "budget": 0,
      "overview": "A very successful stock broker is called to court to testify against a mob boss who was into some inside trading. Andrew Morenski must become Max Hauser and go back to high school for protection from the mob.",
      "similar": [
         449176,
         9880,
         272693,
         10625,
         89185,
         2105,
         4951,
         2108,
         9655,
         277217,
         315635,
         26123,
         17130,
         241848,
         11355,
         43923,
         325189,
         308369,
         37725,
         133805
      ],
      "original_title": "Hiding Out",
      "runtime": 98,
      "poster_path": "/n1INpdK4goM1XFQKDv9bsA9Bmd6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1987-11-06",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "There's only one thing more frightening than murder.. High School",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bob Giraldi"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Joe Menosky",
         "Jeff Rothberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093186/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNjAwNTczNV5BMl5BanBnXkFtZTcwMTgwODcxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jon Cryer, Keith Coogan, Annabeth Gish | See full cast and crew »"],
      "reviews": [
         "This movie falls into the \"high school comedy\" genre (like Better Off Dead and others). If you're not looking for a serious movie and are willing to suspend your disbelief, it is a lighthearted comedy and one of my personal favorites. Possibly not for the \"serious critic\" movie watcher, but for those looking for fun, check this one out.",
         "In spite of its faults, this movie was just fun to watch. I love the scene where Max gets in an argument with the history teacher and she sends him off to the principal's office...in high school, I had a teacher threaten to do that to me during a class discussion, so that scene really hit home! One thing that does bother me whenever I watch this movie is how bad the makeup is in the beginning when Jon Cryer was \"bearded\". The beard prevented him from doing much in the way of facial expressions, and it even hindered his speaking...kinda came off like a ventriloquist because he could hardly move his lips. Fun movie though, just don't take it too seriously.",
         "Big shock this didn't strike when the teen iron was hot in the 80s, cuz it turned out to be a big favorite of mine. Others have pointed out its implausibility, but aren't all films? This just moves swiftly from start to finish, and I dare compare it to my all time fave, \"Back to the Future\", in terms of its pacing. It all begins when stockbroker Cryer goes on the run. He's due to testify against some pre-requisite mob guys who were dealing with bogus bonds (or something). So he looks up his cousin and aunt in Jersey for help. But for reasons only known to himself, decides not to tell his aunt who he is after altering his appearance. He elects to hold up in his cousin's loft for a bit and then finds refuge underneath the school in some sort of abandoned basement. All the while, dealing with an annoying teacher, an unwanted popularity that prompts the kids to nominate him for student council and falling for the sweet Gish. Coogan is good as the dorky cohort to all of Cryer's happenings, which there are plenty of that keep the film rolling. But all this talk about near 30 Cryer and teenage Gish dating in the film is blown way out. Though her age is never mentioned, she's obviously 18, just having been accepted to college. And at the end of film, graduating high school. So, Roger Ebert's comment about her being 15 is waaaaayyy off. Sure it would be an odd romance, but not stat. rape. Anywho, the whole thing is a lot of fun, exploring perfectly what could happen if...",
         "I know there are some people who did not like this show. I have to say I loved it and thought the ending to be perfectly suited! It ended in a romantic note and find it to be better than most other movies or shows today! You know, the movies that end in violence and no hope for happy a ending! I love his acting! I think he is adorable in most anything he has acted in! To see he is still acting warms my heart. I hope he continues on with his career for many more years to come! As a note to Jon keep up the excellent work! I would love to see this movie again! I wish for others to see and appreciate an all around lovely movie with a wonderful ending!",
         "If you enjoy watching how Jon Cryer acts in his movies then you will enjoy this movie. Jon is his irresistible self here. He looks hot in his grown up clothes and sweet in his teen gear too. There is a little action, some comedy, and a little romance for the girls. This is a must see for you if you liked him as Duckie in Pretty In Pink. Annabelle Gish plays a great role as well. For me the interaction of Jon with his family and the comedy that happens there is great. The cinematography is easy on the eyes. Loved the fact that Roy Orbison's song \"Crying\" was used in just the right scene. And the ending...I loved it. Don't want to spoil it for you so I won't say much more about the end. Watch it! It's good!",
         "if it's far-fetched and totally unbelievable??? so what that his own cousin doesn't recognise him! so what if andrew/maxwell would have set himself up for arrest in 37 states because of his relationship with a high school senior!!!! GO WITH IT!!!! IT'S CUTE!!! max lives every adults' secret dream (or is it a nightmare?), even if it is to hide out from the mob! he goes back to high school, spouts the announcements we all wanted to be able to say via the principal's loudspeaker at night, dates the cutest girl in town (and saves her dad a bunch of money with some solid tax advice, to boot), runs for class president ... he even has a classic \"discussion\" with a right-wing biddie-of-a-teacher (come on, you know you had one just like her) over her assertion that richard nixon was \"a great man who was betrayed by his countrymen.\" if there's nothing good on the first-run shelf at the video store, rent this one for some good entertainment. i mean, does every movie have to be totally believable to be good? if so. jeff",
         "Being a child of the 80's, I enjoyed Hiding Out on several levels. I think that Annabeth Gish is a beautiful woman and love the way she smiles during this movie. She is lucky in the characters she played while a younger actress. She was a good actress then and she is a great one now. Jon Cryer is a good actor but he doesn't seem totally comfortable in this role. Perhaps that is a good thing, since he is a fish out of water character here. The high school kids were pretty believable, especially Keith Coogan. His is pretty much the same character from Adventures in Babysitting, just grown up now. This is pretty amazing since both movies came out in 1987. The ending is bit contrived but entertaining just the same. Hiding Out is a really good movie and worth the rental fee if you want some 80's nostalgia or too see something safe for the whole family. I have watched it numerous times and still look forward to seeing it again.",
         "Sure, it was not meant to be an oscar winner, but this is the kind of film all the family can enjoy. It has elements of a teen comedy, drama and action. This film is the kind that you can watch over, without getting bored. It is not crude like most teen comedies, and relies on structure and characterisation to push the plot along, which is a nice touch. This movie is a nice film, one for all to enjoy!",
         "a great film a bit drematic for the most part but worth seeing all together. Done very well and in most cases very believable for the most part. However it seems that it was hard to beleive he was as old as he claimed to be but a great film",
         "The likable Cryer stars as a young stockbroker set to testify against the mob who runs for his life when an assasin is hot on his trail. He assumes the guise of a high school student and encounters clashes between his \"establishment\" nature and his new \"high school\" facade. Entertaining, but far-fetched comedy!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "De Laurentiis Entertainment Group (DEG)",
         "Evenmore/Locomotion"
      ],
      "summaries": ["A very successful stock broker is called to court to testify against a mob boss who was into some inside trading. They hide him because of death threats. He gets caught in a gun battle and has to flee. He ends up hiding out as a student in a high school. He has to adjust to how things have changed as a teenager. The bad guys find him and he has fight it out in the high school gym."],
      "budget": 7000000
   },
   "movielensId": 4115,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-11-06",
      "dvdReleaseDate": "2001-10-09",
      "directors": ["Bob Giraldi"],
      "runtime": 98,
      "movieId": 4115,
      "title": "Hiding Out",
      "mpaa": "PG-13",
      "actors": [
         "Jon Cryer",
         "Keith Coogan",
         "Аnnabeth Gish",
         "Tim Quill",
         "John Spencer",
         "Joy Behar"
      ],
      "imdbMovieId": "0093186",
      "originalTitle": "Hiding Out",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Family",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Upu8Ag6JYQc"],
      "plotSummary": "A very successful stock broker is called to court to testify against a mob boss who was into some inside trading. Andrew Morenski must become Max Hauser and go back to high school for protection from the mob.",
      "tmdbMovieId": 26156,
      "avgRating": 2.9375,
      "releaseYear": "1987",
      "numRatings": 176,
      "posterPath": "/n1INpdK4goM1XFQKDv9bsA9Bmd6.jpg"
   }
}