{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "spy",
         "id": 470
      }],
      "imdb_id": "tt0093405",
      "video": false,
      "title": "Leonard Part 6",
      "recommendations": [
         31120,
         31387,
         3592,
         64342,
         48291,
         15420,
         28159,
         10696,
         13698,
         23943,
         31258,
         52837,
         59051,
         48193,
         31254,
         31260,
         24558,
         30194,
         15698,
         5086
      ],
      "backdrop_path": "/2OoykhydUHRQlmqdQ3tqX53LwKs.jpg",
      "revenue": 4916871,
      "reviews": [{
         "author": "reverenddr",
         "id": "51cfbb8f760ee32038039770",
         "content": "Leonard Part 6 is without a doubt bizarre and stupid.\r\n\r\nBill Cosby plays a former spy turned millionaire turned vigilante who must save the world from an insane vegetarian who controls the minds of animals with murderous intent. Cosby drives a Porsche 928 with a tank turrent mounted on top and fights vegetarian henchmen with magical sparkling hot dogs.\r\n\r\nCosby himself said the movie was a mistake. Nevertheless it's a crazy spectacle of a film, and everyone who calls themselves a movie buff should see it once.\r\n\r\nI saw this movie upon its release (when I was 7 years old) and loved it. Because of the fond memories and pure insanity I rate it a 6/10.",
         "url": "https://www.themoviedb.org/review/51cfbb8f760ee32038039770"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Leonard Parker",
               "gender": 2,
               "credit_id": "52fe44acc3a368484e030569",
               "name": "Bill Cosby",
               "profile_path": "/74QfZIdzeCziphi251ueaCVXbW7.jpg",
               "id": 51962,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Frayn",
               "gender": 2,
               "credit_id": "52fe44acc3a368484e03056d",
               "name": "Tom Courtenay",
               "profile_path": "/9uA5gEniRw7ohYPPqX3iV6pSvxj.jpg",
               "id": 14011,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nick Snyderburn",
               "gender": 2,
               "credit_id": "52fe44acc3a368484e030571",
               "name": "Joe Don Baker",
               "profile_path": "/7WQq2nmSXXIC4vR3MhHLYRZD2wE.jpg",
               "id": 10671,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Giorgio Francozzi",
               "gender": 2,
               "credit_id": "52fe44acc3a368484e030575",
               "name": "Moses Gunn",
               "profile_path": "/lpFU9TYL9X2uz2RE9zKWL59CkNF.jpg",
               "id": 6561,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Allison Parker",
               "gender": 0,
               "credit_id": "52fe44acc3a368484e030579",
               "name": "Pat Colbert",
               "profile_path": null,
               "id": 92685,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Medusa Johnson",
               "gender": 1,
               "credit_id": "52fe44acc3a368484e03057d",
               "name": "Gloria Foster",
               "profile_path": "/8peApNX6ms84dK07Xguf84CNFJK.jpg",
               "id": 9364,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Joan Parker",
               "gender": 1,
               "credit_id": "52fe44acc3a368484e030581",
               "name": "Victoria Rowell",
               "profile_path": "/3vGWTtqtqHzVTUXGqtq2dl3tbx9.jpg",
               "id": 65020,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jefferson",
               "gender": 1,
               "credit_id": "52fe44acc3a368484e030585",
               "name": "Grace Zabriskie",
               "profile_path": "/ibBabuSM1UyPYFFo0wBXhGbqElk.jpg",
               "id": 6465,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Nurse Carvalho",
               "gender": 1,
               "credit_id": "52fe44acc3a368484e030589",
               "name": "Anna Levine",
               "profile_path": "/A3oxT1n8ecpl0uYomHaMUWGBivu.jpg",
               "id": 3711,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44acc3a368484e030565",
               "name": "Paul Weiland",
               "profile_path": "/eTTmELMGFXFybc3Gl65jk6G71gn.jpg",
               "id": 66548,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "538bc9d7c3a3687143001abe",
               "name": "Bill Cosby",
               "profile_path": "/74QfZIdzeCziphi251ueaCVXbW7.jpg",
               "id": 51962,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "54ebc3fac3a3686d6d0001e5",
               "name": "Bill Cosby",
               "profile_path": "/74QfZIdzeCziphi251ueaCVXbW7.jpg",
               "id": 51962,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59ebd827c3a3680b5a003c7a",
               "name": "Jonathan Reynolds",
               "profile_path": null,
               "id": 1475421,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.475834,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24828,
      "vote_count": 28,
      "budget": 0,
      "overview": "After separating from his wife, Leonard Parker (Cosby) quit the spy business and became a restaurateur. His wife refuses to speak with him, and his daughter, who changes her career more often than her clothes, has begun dating a man old enough to be Leonard's father! On top of it all, the government has asked him to come back and save the world again.",
      "similar": [
         27576,
         87364,
         954,
         37724,
         206647,
         646,
         341013,
         36669,
         691,
         56288,
         49517,
         253,
         818,
         714,
         36670,
         37834,
         36955,
         10764,
         203801,
         238713
      ],
      "original_title": "Leonard Part 6",
      "runtime": 85,
      "poster_path": "/aauZlMqKIDxTlgRZgZlRrJJ9JU2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1987-12-18",
      "vote_average": 2.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Paul Weiland"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Bill Cosby",
         "Jonathan Reynolds"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093405/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzMDg1NTk2NF5BMl5BanBnXkFtZTcwNDQwNDgyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Cosby, Tom Courtenay, Joe Don Baker | See full cast and crew »"],
      "reviews": [
         "I saw this pus-filled boil on Cosby's rump while on vacation in Florida as a kid. I asked to see it - How was I to know? - I was only 6 years old. I think it was being shown at a theater at Universal Studios, and it had been a long, hot day of walking. Hell, I was glad just to be off my feet and out of the sun...that is, until the movie began. I was confused from the start, thinking I must have missed a lot in the first 5 parts. But I thought it's gotta get better, Bill Cosby wouldn't allow this garbage to be shown to millions of kids like me as \"entertainment\" unless there was something funny in it. Then the meat patties - I don't remember much about the movie, I've left the nightmares in my past, but I can still remember how I nearly wretched at this grisly mess of a scene. It was no longer worth being in a comfy theater with AC, it was more like being in agony, trapped by a 6-yr. old kid's optimism that \"Mr. Huxable\" would be funny! Never happened. An utter horror of a movie! It ruined a little kid's day, and I'm sure it ruined many others'. When I found out from my folks soon after that Bill Cosby himself had told people not to see it, I was hurt and betrayed. I have since gotten over it, so LP6 is purged from my nightmares, and I applauded Cos for removing this celluloid pollution from our airwaves. Redemption at last.",
         "Bill Cosby must have lost some kind of bet with Satan to end up making a film as mind-meltingly dreadful as \"Leonard Part 6\". A stupefyingly unfunny, self-indulgent mess of a film that will have you wanting to tare your skin off with your fingernails just so you'll have something else to do.",
         "There are bad movies like the ones Ed wood used to make and there are bad movies like \"Leonard part 6\". Now the difference between these two groups is, that when you watch Ed Wood movies you can laugh at the fact how serious he was. But with this supposed to be comedy you are just dazed at the fact how shamelessly this movie has been made relying only on the 80's comedy icon Bill Cosby. I can see how the script of this agent parody might have looked funny, with all the James Bond jokes it has, but somewhere in the making everyone just forgot to do their jobs properly, thus ending up with this pile of totally unfunny crap. As stated nothing works, special effects are bad and they probably looked outdated the year this movie came out. Actors are bored and they don't even try and same can be said of director Paul Weiland. Avoid if you can.",
         "This film was made nearby where I lived in 1986. Many residents had to put up with trailers on the street and generators running into all hours of the evening. We did however, get to see Cosby shoot a scene, so that was fun. When it came time to see his creation, the disappointment was even greater having expected at least something of fair value. The film is disjointed, as if the writer quit in the middle. The relationship between Cosby - a master spy living in an enormous house - and his unhappy wife (who lives in the enormous house next door, which is supposed to be a funny circumstance) took time to develop. Then it was immediately lost in some mad-cap chase scenes in a warehouse. There is nothing interesting about this film. There must be a story behind how it got made. Cosby is a man of talent, but this film showed none.",
         "You can't help but cry. This film is awful. I found NOTHING redeeming about it, not on a camp level, not even on a comatose level. You'd just expect more from the talented Bill Cosby, and wonder with all the projects out there, why he chose this crap to be a part of. He should have just collected all the money and donated it to a charity -- or the R & D Department over at JELLO. The money would have went to a better cause.",
         "Three words sum up what's wrong with this movie, Joe Don Baker. Serously, what the hell was that? It's like a bad version of Dr Dolittle made by acid heads. I actually saw this movie in the theater as a child and even at the tender age of 6 asked my Mom if we could leave and began crying when we didn't. This movie sucks!",
         "A complete dud. Stuck with a stupid script and in the middle of moronic proceedings, Bill Cosby looks utterly bored and desperate. This is the type of film that has NOTHING redeeming about it, and even thinking about it for a minute longer than its running time is a real waste of effort. Worthless. (*)",
         "Back in 1987, Bill Cosby was the king of comedy on television. His '80s sitcom \"The Cosby Show\" was the #1 TV show in America. So one question still puzzles me today. During his time away from the show, why did he produce, wrote the original story to, and star in \"Leonard Part 6\"? This movie is totally inept from beginning to end. No laughs. No excitement. No fun. Just 85 minutes of 100% ineptitude. Forget about it! No stars (out of four)",
         "Might contain some spoilers Whoa, where did this curiosity come from? Bill Cosby and co-star fending off killer lobsters with butter? Bill Cosby's daughter doing a topless recital? Dr. Cosby warned people not to see this when it came out, but he spoke too late. Why didn't Mystery Science Theater pick this one up? Mr. Cosby looks uncomfortable, if not downright constipated throughout this film, which is exactly what you'll feel like should you choose to rent it. This film is still smelling up my living room like stale dog urine. There is a good spy flick out for kids, and it's called \"Spy Kids\". Or watch Bill Cosby's Little Bill series to reassure yourself that he didn't go mad after making this film.",
         "I love the IMDb but I've noticed a very sad trend... seems like users here feel they have to defend truly terrible movies. Just look at the user reviews for \"Hudson Hawk\" or \"Ishtar\" and you'll see titles like \"Not As Bad As They Say,\" \"Under-Rated Classic,\" and the offensive \"I LOVE This Movie.\" Grow up! It's not a good idea to rescue trash cinema from the dumpster. Let's be adults and let films like \"Leonard, Part 6\" get the treatment they deserve. And oh how this film deserves a lot of treatment... \"Leonard\" is a movie with no redeeming value. Bill Cosby stars as a secret agent who has to save the world from an evil woman who blah blah blah... why bother? The movie tries to be an action film while simultaneously spoofing action films. (Schwarzenegger would later fail at this with the nauseating \"Last Action Hero\") What we're left with is a mess of a movie and Cosby- one of the all-time great comedians- can't even get one genuine laugh out of the deal. I have a passion for bad movies- B-Movies, exploitation flicks, horror films, you name it- but this movie lacks the impact to even be bad. It's just stupid. How stupid? At the time of the film's release Cosby himself went on TV and asked people NOT to see the movie because it was so bad. I cannot think of a single instance in the history of Hollywood where an actor- or anyone- has done ANTI-publicity for a movie. Bill said this because he cares and he wanted to save you time and money. So do I. While it might be tempting to listen to the revisionist reviewers who want to impress you with their outrageous opinion and 10-star ratings sometimes its better to just turn the page. Now let's all go someplace else and do something different and forget we were ever here. GRADE: D-"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": ["SAH Productions"],
      "summaries": [
         "The CIA asks for ex-spy Leonard's help in stopping an evil force that is brainwashing small animals into killing people. Leonard, however, has his own problems to deal with: winning back his ex-wife.",
         "After separating from his wife, Leonard Parker (Cosby) quit the spy business and became a restaurateur. His wife refuses to speak with him, and his daughter, who changes her career more often than her clothes, has begun dating a man old enough to be Leonard's father! On top of it all, the government has asked him to come back and save the world again. The evil Medusa Johnson (Foster) has hypnotized animals into doing her bidding, and plans to use them to take over the world! It's up to Leonard to save the world, as only he can battle her Vegetarians and man-eating rabbits!",
         "A secret agent is called out of retirement to save the world from an evil genius."
      ],
      "budget": 24000000
   },
   "movielensId": 4125,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-12-18",
      "dvdReleaseDate": "2005-04-26",
      "directors": ["Paul Weiland"],
      "runtime": 85,
      "movieId": 4125,
      "title": "Leonard Part 6",
      "mpaa": "",
      "actors": [
         "Bill Cosby",
         "Tom Courtenay",
         "Joe Don Baker",
         "Moses Gunn",
         "Pat Colbert",
         "Gloria Foster",
         "Victoria Rowell",
         "Grace Zabriskie",
         "Anna Levine"
      ],
      "imdbMovieId": "0093405",
      "originalTitle": "Leonard Part 6",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After separating from his wife, Leonard Parker (Cosby) quit the spy business and became a restaurateur. His wife refuses to speak with him, and his daughter, who changes her career more often than her clothes, has begun dating a man old enough to be Leonard's father! On top of it all, the government has asked him to come back and save the world again.",
      "tmdbMovieId": 24828,
      "avgRating": 1.52004,
      "releaseYear": "1987",
      "numRatings": 474,
      "posterPath": "/aauZlMqKIDxTlgRZgZlRrJJ9JU2.jpg"
   }
}