{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "wheelchair",
            "id": 2564
         },
         {
            "name": "wheelchair user   ",
            "id": 6634
         },
         {
            "name": "orphanage",
            "id": 6783
         },
         {
            "name": "district attorney",
            "id": 33518
         },
         {
            "name": "film noir",
            "id": 195402
         },
         {
            "name": "stolen jewelry",
            "id": 205598
         },
         {
            "name": "small time crook",
            "id": 207921
         }
      ],
      "imdb_id": "tt0039536",
      "video": false,
      "title": "Kiss of Death",
      "recommendations": [
         22112,
         21296,
         44190,
         16933,
         14638,
         17221,
         28297,
         22342,
         25955,
         20942,
         28007,
         20025,
         41462,
         36521,
         20367,
         22733,
         28120,
         31152,
         20362,
         36814
      ],
      "backdrop_path": "/zrBoGwkHh2uzyfjbcgANdABIjc6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nick Bianco",
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f7f1",
               "name": "Victor Mature",
               "profile_path": "/pH8HaqCRhhWcP2VkaHli6eZllxy.jpg",
               "id": 30290,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Asst. Dist. Atty. Louis D'Angelo",
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f7f5",
               "name": "Brian Donlevy",
               "profile_path": "/dJP0woESrhHQrPbTieZdE54OM2f.jpg",
               "id": 41755,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nettie, and Voice of Narrator",
               "gender": 0,
               "credit_id": "52fe441ac3a368484e00f7f9",
               "name": "Coleen Gray",
               "profile_path": "/oQhVm1YUKaAAAT9TcBJ8RtrUuZS.jpg",
               "id": 3336,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tommy Udo",
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f7fd",
               "name": "Richard Widmark",
               "profile_path": "/whrZ2aEg3FghVaDJf0JRrEhFLWl.jpg",
               "id": 12149,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Earl Howser, Attorney",
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f801",
               "name": "Taylor Holmes",
               "profile_path": "/dmdGm5SHP6gJDbbANZMHTrYM4Kn.jpg",
               "id": 11172,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sgt. William Cullen",
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f805",
               "name": "Karl Malden",
               "profile_path": "/mszc66eJmCKzOD2vwl8qJrVSz1W.jpg",
               "id": 9857,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "'Big Ed' Williams",
               "gender": 0,
               "credit_id": "52fe441ac3a368484e00f809",
               "name": "Anthony Ross",
               "profile_path": "/hDA4UKVIjsZzbUB8n1GrPALBtpC.jpg",
               "id": 24938,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Bull Weed (uncredited)",
               "gender": 2,
               "credit_id": "567a41cac3a3685bb900137f",
               "name": "Harry Bellaver",
               "profile_path": "/w5XJVOBvcnpsKQjHU7anvBLbsoz.jpg",
               "id": 69026,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Man in Car (uncredited)",
               "gender": 0,
               "credit_id": "567a420ec3a3685bc30013f4",
               "name": "Dort Clark",
               "profile_path": "/aHD6EK0Ec3KheLLmtyqdFuSB2mm.jpg",
               "id": 217394,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Mrs. Rizzo (uncredited)",
               "gender": 1,
               "credit_id": "567a425592514106f50013d4",
               "name": "Mildred Dunnock",
               "profile_path": "/6Ef4IC63JHLMvWsapxdykbFvF0h.jpg",
               "id": 68642,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Detective (uncredited)",
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f81f",
               "name": "Millard Mitchell",
               "profile_path": "/sYqhWsTBHtAJWqr6vhbIx65zUMc.jpg",
               "id": 13297,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Taxi Driver (uncredited)",
               "gender": 2,
               "credit_id": "567a42e892514106eb0013c1",
               "name": "Jesse White",
               "profile_path": "/5q5wzKTgFEzjYHYQybm1OHi6ivk.jpg",
               "id": 93664,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe441ac3a368484e00f80f",
               "name": "Henry Hathaway",
               "profile_path": "/aHXD9EFWbtftnaBzPYfO2dkLLKd.jpg",
               "id": 37360,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f815",
               "name": "Ben Hecht",
               "profile_path": "/is5faYjaFObagG3b8xgwocMkUcX.jpg",
               "id": 4341,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe441ac3a368484e00f81b",
               "name": "Charles Lederer",
               "profile_path": null,
               "id": 4358,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "567a43fcc3a3685bb90013c8",
               "name": "Eleazar Lipsky",
               "profile_path": null,
               "id": 49823,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.518497,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21454,
      "vote_count": 34,
      "budget": 0,
      "overview": "Small-time crook Nick Bianco gets caught in a jewel heist and despite urgings from well-meaning district attorney D'Angelo, refuses to rat on his partners and goes to jail, assured that his wife and children will be taken care of. Learning that his depressed wife has killed herself, Nick informs on his ex-pals and is paroled. Nick remarries, gets a job and begins leading a happy life when he learns one of the men he informed on, psychopathic killer Tommy Udo, has been released from custody and is out for revenge against Nick and his family.",
      "similar": [
         29381,
         278,
         996,
         3112,
         5924,
         429200,
         46738,
         10734,
         10398,
         17136,
         2014,
         14638,
         910,
         9303,
         10471,
         15794,
         3766,
         10994,
         1672,
         11568
      ],
      "original_title": "Kiss of Death",
      "runtime": 98,
      "poster_path": "/iE9deUMZTEzhclYC5amH0kdz3Fl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1947-08-27",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "From her lips there is no escape!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Henry Hathaway"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Ben Hecht",
         "Charles Lederer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039536/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4NzY3MzkyMF5BMl5BanBnXkFtZTgwMDQxNjc0MjE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Victor Mature, Brian Donlevy, Coleen Gray | See full cast and crew »"],
      "reviews": [
         "Richard Widmark belongs to a select few players who from their screen debut became instant stars. No bit parts, no walk-ons, Widmark's first feature role netted him an Academy Award nomination for Best Supporting Actor and stardom. Widmark's portrayal of Tommy Udo in Kiss of Death shocked audiences nationwide. When Widmark tied up Mildred Dunnock and threw her down a flight of stairs, gasps aplenty came from audiences. That maniacal giggle became his trademark and fodder for impressionists from then on in. Widmark in fact had to really convince his bosses at 20th Century Fox that he was capable of more than being a psychopathic killer. Widmark was fourth billed in this film and so dominates it that it's forgotten that Victor Mature is the lead and contributes a good performance in his own right. Mature is a career criminal who was left holding the bag for his associates during a jewel heist. He refuses to rat them out and gets a stretch in prison for it. By his refusal to be a stoolie, Mature gains the friendship of Widmark who has a special hatred for the breed. Things then go bad for Mature when his wife commits suicide and his two little daughters wind up in an orphanage. At that point he rethinks becoming a stoolie for District Attorney Brian Donlevy and the main action of the film begins. Mature gives a very good performance of a man running out of options. He's caught between concern for his family and living up to the honor system that criminals have among themselves. Brian Donlevy, usually a villain, does a good job as the District Attorney. One other performance is worthy of note. Though he only has a few scenes, criminal defense attorney Taylor Holmes is also a real stand out. His Earle Houser is definitely one of the sleaziest lawyers ever portrayed on the screen. For all the many good performances Richard Widmark has given in his 91 years, his debut film turned out to be the only time he was ever nominated for an Oscar. That's a shame because I could think of a couple of other films like Night and the City, Pickup on South Street and Panic in the Streets that would have been worthy of consideration. Hopefully the American Film Institute will give Widmark a Lifetime Achievement Award and soon.",
         "This was a 1940s film noir with a little bit different slant: the main character \"Nick Bianco\" (Victor Mature) being a caring father. Here's a guy torn between being a crook most of his life and the damage it did to him mentally, but at heart a real softie who is desperate to go straight and just be a regular family guy with everyone leaving him alone. In the story, he turns \"stoolie\" so he can earn that freedom and be that family man. Among film noir buffs, however, this film is noted more for Richard Widmark's debut as the sadistic \"Tommy Udo.\" One of the most famous noir scenes of all time is \"Udo\" throwing an old lady in a wheelchair down a flight of stairs! Widmark puts on a fake pair of choppers giving him an exaggerated overbite to go along with his insane little giggle. He also calls everyone a \"squirt.\" His over- the-top performance puts a lot a spark into this film which, otherwise would have wound up more as a melodrama. Two other actors have key roles in here: Brian Donlevy and Colleen Gray (making her credited film debut, too1). Donlevey plays a character who never see in modern-day films: a compassionate district attorney who goes out of his way to help \"Nick.\" It's refreshing to see, for a change. Gray becomes Nick's love interest and is a very appealing wholesome type, as are the two sweet little girls Nick had with his former wife who killed herself while Nick was in prison. Gray becomes the step-mother. Although not spectacular, the film is entertaining, especially the suspenseful last 20 minutes. It's quite dated in spots but Widmark's character alone is worth investigating this film if you've never seen it. I'm surprised there aren't more reviews of this.",
         "Kiss of Death was an engaging and suspenseful film noir thriller. Standout performances were delivered from Victor Mature and Richard Widmark among others. Widmark as the sadistic Udo had a particularly memorable turn. This film actually reminded me quite a bit of the Humphrey Bogart film, The Enforcer, at least the first twenty minutes of that equally good crime drama. In both movies, the turning of evidence by witnesses for the state and their protection figure prominently. Unfortunately, the witness in The Enforcer isn't as lucky as Nick Bianco. One other note: the great Karl Malden has a small role in this film as a junior detective. Both Kiss of Death and The Enforcer get a solid 8/10.",
         "Henry Hathaway does a bang-up job directing this taut, realistic gangster noir. With the exception of a couple of domestic scenes with Mature and his family, this film never lets up. In one of the most unique film debuts, Richard Widmark steals the show with his portrayal of the giggling, psychopathic killer Tommy Udo. There is no doubt about who is the star of this movie. Victor Mature gives a fine performance as the basically decent guy who turns \"stoolie\" and for whom you have sympathy and the rest of the cast is strong in support.....but it is Widmark who mesmerizes you with his performance. The oft cited senseless violence of the \"wheelchair pushed down the stair\" scene is still one that makes you turn away. The real life New York City setting adds more realism and the black and white cinematography is excellent, capturing shadows which foretell the violence that is coming. Look for Karl Malden in a small part, early in his career. This is a classic of the noir genre and should be added to your film library.",
         "This film is \"required reading\" in the study of gangster films, mostly because of Richard Widmark's exceptional and truly frightening performance as Tommy Udo. Interestingly enough, 43 years later, actor Joe Pesci would also terrify movie audiences with his portrayal of another psychopathic gangster, who also had the rather benign name of 'Tommy'. However, unlike Pesci, Widmark never had another particularly memorable gangster role after this one. While a lot of the story is realistic, some of it is far-fetched - mainly, the end. Only a complete lunatic would even think of walking into the headquarters of a gangster that he had just testified against and expect to come out alive. However, the tension in that restaurant confrontation scene is effective, and I suppose for the era in which this film was made, it was necessary to have the 'good hero' face down the 'bad bully' and put him in his place. In reality, of course, it just doesn't happen that way in the world of crime. But what makes this film is Widmark, and to give an idea of just how effective he was, when this film first came out, a real-life NYC mobster(Joey Gallo) would watch it and earnestly try to imitate Widmark's style and mannerisms, thereby enhancing his own skill in intimidating others. As they say, imitation is the sincerest form of flattery.",
         "This is one of the better remembered crime films of the forties, and boasts excellent direction by Henry Hathaway, a good script by Ben Hecht and Charles Lederer, and fine New York location photography by Norbert Brodine. Victor Mature plays a small-time crook who's enlisted by an assistant D.A. to infiltrate a gang of criminals whose leader, played by Richard Widmark, in his movie debut, is a psychopath with a very bent sense of humor. Psycho killers were relatively new to movies in the forties, and Widmark's may be the most famous of the lot. One can see his influence in films for years to come, as any number of actors made their debuts playing similar roles. No one surpassed Widmark for sheer sadism, however, as when he ties up an old lady in a wheelchair and sends her tumbling down a flight of stairs. This remains his most famous role, and when his obituary is written, the author, if he knows his movies at all, will mention it in the first sentence. Kiss Of Death is a decent crime story, at times very tense, but not otherwise exceptional. Surprisingly, Victor Mature gives a warm, emotional performance in the leading role, and Widmark's villainy would not have been so nearly as effective without this. How dull this picture might have been had Dana Andrews or Mark Stevens played this part.",
         "Richard Widmark as a giggling, heartless hoodlum pushing a wheelchair bound old lady down the stairs, that's what everyone remembers of this superb classic. The film follows luckless Nick Bianco (Victor Mature's best role), a NYC holdup man who is caught during an Xmas season hit. Sent to prison, he needs to be near his now parentless children (His wife committed suicide). He becomes an informant, and is released. Widmark, as hoodlum Tommy Udo (All film fans have no trouble remembering that name) targets stoolie Mature for death. The film begins (with the failed robbery) and ends (the showdown between Widmark, Mature and DA Brian Donlevy) with superb suspense sequenses played almost silent.",
         "Widmark will ALWAYS be remembered for his role as Tommy Udo in this film! The skinny kid with the stupid laugh & no conscience, pushing a wheel-chaired lady down a flight of stairs! He switches emotions in a heartbeat! EERIE! Victure Mature is really the star of this movie & he looks GREAT in every scene! Those crisp suits & those hats! When he has to turn informant so his now-motherless kids can have him back at home instead of in \"the big house\", Udo goes after him with a vengeance. The tension between these two is combustible! I LOVE this film! Brian Donlevy is very good as the D.A. \"Nick Bianco\" (Mature) must do business with in order to be free. It works!",
         "Rating * * * 1/2 Victor Mature gives one of his best performances here in this taut thriller. He plays a thief who informs on his own gang and is hunted by psycho Richard Widmark. The film is famous for the scene in which Widmark as giggling killer Tommy Udo pushes a wheelchair bound old lady down the stairs.",
         "In the New York Christmas, the family man Nick Bianco (Victor Mature) has bad luck and criminal record, and can not find a honest job. He is caught in a jewelry heist, but he does not accept the proposal of the Assistant District Attorney Louis D'Angelo (Brian Donlevy) to be a squealer and denounce his accomplices and he goes to prison. Three years later, his depressed woman commits suicide and his two daughters are sent to an orphanage. Nick makes a deal with Mr. D'Ángelo and rats his former partners; then he marries Nettie (Collen Gray), moves to another to town with a new identity, where he finds a honest job. However, when the psychopathic killer Tommy Udo (Richard Widmark) is sentenced not-guilty in a trial where Nick was forced to testimony against the criminal, the desperate Nick uses one last attempt to save his family from the psychotic killer. \"Kiss of Death\" is a powerful film-noir, with an engaging and credible plot, fantastic direction of Henry Hathaway and great performances of Victor Mature and Richard Widmark. Among the movies that I have watched of the great actor Richard Widmark, this is his best performance and he really deserved his nomination to the Oscar. His sadistic character is really a scary cold-blood killer. The black and white cinematography is amazing, with great use of shadows valorized by the image of the DVD. Karl Malden in the beginning of his successful career has a minor participation. My vote is eight. Title (Brazil): \"Beijo da Morte\" (\"Kiss of the Death\")"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Small-time crook Nick Bianco gets caught in a jewel heist and despite urgings from well-meaning district attorney D'Angelo, refuses to rat on his partners and goes to jail, assured that his wife and children will be taken care of. Learning that his depressed wife has killed herself, Nick informs on his ex-pals and is paroled. Nick remarries, gets a job and begins leading a happy life when he learns one of the men he informed on, psychopathic killer Tommy Udo, has been released from custody and is out for revenge against Nick and his family.",
         "Nick Bianco is a small-time hoodlum and thief who is shot and arrested after he and three others hold up an exclusive jewelry store. The District Attorney, Louis D'Angelo offers to go easy on him if he'll implicate his fellow thieves but Bianco wont cooperate. After spending about three years in prison, he learns that his wife has committed suicide and that his two little girls are in an orphanage. He seeks out the DA and makes an arrangement to get evidence on a vicious killer, Tommy Udo. When Udo is found not guilty at his trial, Bianco, who has re-married and is now an upstanding citizen, is sure he will come after him.",
         "With his law-breaking lifestyle in the past, an ex-con, along with his family, attempt to start a new life, knowing a betrayed someone from the past is bound to see otherwise."
      ],
      "budget": 0
   },
   "movielensId": 41585,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-08-27",
      "dvdReleaseDate": "2005-12-06",
      "directors": ["Henry Hathaway"],
      "runtime": 98,
      "movieId": 41585,
      "title": "Kiss of Death",
      "mpaa": "",
      "actors": [
         "Victor Mature",
         "Brian Donlevy",
         "Coleen Gray",
         "Richard Widmark",
         "Taylor Holmes",
         "Karl Malden",
         "Anthony Ross",
         "Harry Bellaver",
         "Dort Clark",
         "Mildred Dunnock",
         "Millard Mitchell",
         "Jesse White"
      ],
      "imdbMovieId": "0039536",
      "originalTitle": "Kiss of Death",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["dwupnjCojfM"],
      "plotSummary": "Small-time crook Nick Bianco gets caught in a jewel heist and despite urgings from well-meaning district attorney D'Angelo, refuses to rat on his partners and goes to jail, assured that his wife and children will be taken care of. Learning that his depressed wife has killed herself, Nick informs on his ex-pals and is paroled. Nick remarries, gets a job and begins leading a happy life when he learns one of the men he informed on, psychopathic killer Tommy Udo, has been released from custody and is out for revenge against Nick and his family.",
      "tmdbMovieId": 21454,
      "avgRating": 3.42202,
      "releaseYear": "1947",
      "numRatings": 109,
      "posterPath": "/iE9deUMZTEzhclYC5amH0kdz3Fl.jpg"
   }
}