{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0107474",
      "video": false,
      "title": "Madadayo",
      "recommendations": [
         37513,
         45965,
         43027,
         137119,
         98927,
         49317,
         80556,
         174023,
         138030,
         32690,
         133929,
         42561,
         20645,
         26036,
         8897,
         247556,
         92349
      ],
      "backdrop_path": "/6KCkvz2xVO6I6GG2jhLLxCdXfma.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Professor Hyakken Uchida",
               "gender": 2,
               "credit_id": "52fe45b09251416c7505f059",
               "name": "Tatsuo Matsumura",
               "profile_path": null,
               "id": 110310,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Professor's Wife",
               "gender": 0,
               "credit_id": "52fe45b09251416c7505f05d",
               "name": "Kyôko Kagawa",
               "profile_path": "/q47wPwySJvhj6HQoYb7ON1TjbcV.jpg",
               "id": 34374,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Takayama",
               "gender": 2,
               "credit_id": "52fe45b09251416c7505f061",
               "name": "Hisashi Igawa",
               "profile_path": "/ua7RA1qr9LD9k0vOGgNwwhYhkIr.jpg",
               "id": 96637,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Amaki",
               "gender": 0,
               "credit_id": "52fe45b09251416c7505f065",
               "name": "George Tokoro",
               "profile_path": "/d4yvbvV5JFnqbj6aibnc5BWJOns.jpg",
               "id": 78348,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kiriyama",
               "gender": 0,
               "credit_id": "52fe45b09251416c7505f069",
               "name": "Masayuki Yui",
               "profile_path": null,
               "id": 19049,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sawamura",
               "gender": 2,
               "credit_id": "52fe45b09251416c7505f06d",
               "name": "Akira Terao",
               "profile_path": "/pwDc5dwNWbuxWK09vFlUtosDdXe.jpg",
               "id": 70132,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dr. Kobayashi",
               "gender": 0,
               "credit_id": "52fe45b09251416c7505f071",
               "name": "Takeshi Kusaka",
               "profile_path": null,
               "id": 82969,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Rev. Kameyama",
               "gender": 2,
               "credit_id": "55972349c3a36855e60003f4",
               "name": "Asei Kobayashi",
               "profile_path": null,
               "id": 1484347,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Takayama's son",
               "gender": 2,
               "credit_id": "5597235dc3a36855e30003d3",
               "name": "Hidetaka Yoshioka",
               "profile_path": "/AhCASMZy5Rz6YjHaFccHfKkDxsg.jpg",
               "id": 111691,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Neighbor",
               "gender": 0,
               "credit_id": "55972369c3a36855d60004b9",
               "name": "Yoshitaka Zushi",
               "profile_path": null,
               "id": 110299,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Tada",
               "gender": 0,
               "credit_id": "55972386c3a36855e6000405",
               "name": "Mitsuru Hirata",
               "profile_path": "/wsSoQ56jfCAvN1phqfZ75vsqxec.jpg",
               "id": 135377,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Old lady holding a cat",
               "gender": 0,
               "credit_id": "559723e6c3a36855e80003ec",
               "name": "Noriko Honma",
               "profile_path": "/fewS99hj0xT2l4TgYvBfKOvhXZ5.jpg",
               "id": 7456,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Stationmaster",
               "gender": 0,
               "credit_id": "559723f3c3a36855e30003e2",
               "name": "Shigeo Katô",
               "profile_path": null,
               "id": 1117087,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Man who bought the land",
               "gender": 0,
               "credit_id": "55972402c3a36855d60004e3",
               "name": "Kôjirô Kusanagi",
               "profile_path": "/wVAjgreb6GWGwsi4g3kkzGEhbCY.jpg",
               "id": 233693,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Packhorse driver",
               "gender": 0,
               "credit_id": "559724599251413d9c0003f3",
               "name": "Utaroku Miyakoya",
               "profile_path": null,
               "id": 1484348,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Murayama",
               "gender": 0,
               "credit_id": "55972468c3a36855e6000428",
               "name": "Kimihiro Reizei",
               "profile_path": null,
               "id": 1270596,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Police",
               "gender": 0,
               "credit_id": "559724739251413da2000445",
               "name": "Kinzoh Sakura",
               "profile_path": null,
               "id": 552542,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Fishmonger's daughter",
               "gender": 0,
               "credit_id": "559724839251413d9c0003fc",
               "name": "Mie Suzuki",
               "profile_path": null,
               "id": 1484349,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "Landlord",
               "gender": 0,
               "credit_id": "55972494c3a36855e00003e6",
               "name": "Tetsuo Yamashita",
               "profile_path": null,
               "id": 143901,
               "order": 19
            },
            {
               "cast_id": 22,
               "character": "Kitamura",
               "gender": 0,
               "credit_id": "559724a0c3a36855e3000400",
               "name": "Takao Zushi",
               "profile_path": null,
               "id": 1200399,
               "order": 20
            },
            {
               "cast_id": 27,
               "character": "Ota",
               "gender": 0,
               "credit_id": "5aadeb7c92514116ba01e206",
               "name": "Nobuto Okamoto",
               "profile_path": null,
               "id": 1080632,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b09251416c7505f055",
               "name": "Akira Kurosawa",
               "profile_path": "/svZ0HBsRMVgN65EemiP3Fo5f5MC.jpg",
               "id": 5026,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58326496c3a3685bad02e858",
               "name": "Akira Kurosawa",
               "profile_path": "/svZ0HBsRMVgN65EemiP3Fo5f5MC.jpg",
               "id": 5026,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "583264a092514162d20312fe",
               "name": "Shinichirô Ikebe",
               "profile_path": null,
               "id": 71029,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "583264a6c3a3685b9d033212",
               "name": "Takao Saitô",
               "profile_path": null,
               "id": 70129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "583264adc3a3685b9602b40e",
               "name": "Shôji Ueda",
               "profile_path": null,
               "id": 70130,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.027593,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 13889,
      "vote_count": 24,
      "budget": 0,
      "overview": "This film tells the story of professor Uehida Hyakken-sama (1889-1971), in Gotemba, around the forties. He was a university professor until an air raid, when he left to become a writer and has to live in a hut. His mood has hardly changed, not by the change nor by time.",
      "similar": [],
      "original_title": "まあだだよ",
      "runtime": 134,
      "poster_path": "/ny10xbrU8liWX9o1POn2klUSHXp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tokuma Shoten",
            "id": 1779,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "DENTSU Music And Entertainment",
            "id": 2752,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Daiei Motion Picture Company",
            "id": 3214,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kurosawa Production Co.",
            "id": 2680,
            "origin_country": ""
         }
      ],
      "release_date": "1993-04-17",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Akira Kurosawa"],
      "runtime": 134,
      "synopsis": null,
      "writers": [
         "Akira Kurosawa",
         "Hyakken Uchida"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0107474/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDM3OTIyNDIwMV5BMl5BanBnXkFtZTcwODg2NjEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tatsuo Matsumura, Kyôko Kagawa, Hisashi Igawa | See full cast and crew »"],
      "reviews": [
         "I have to disagree with the individual who suggests that viewers who liked Ran or Seven Samurai will like this. I think the individual who compared this to some of Ingmar Bergman's work is much nearer the mark. If you're not ready to observe rather mundane happenings in the interest of understanding universal life experiences, you probably won't appreciate this film. It takes some serenity and patience on the part of the viewer, which however are rewarded. The English subtitles are competent, but cannot explain everything. The word for \"fool\" in Japanese is written using the characters for horse and for deer; hence the stew of horse meat and venison becomes a \"fool's stew.\" And more importantly, the title Madadayo, though correctly translated as Not Yet, is very often associated with a game of hide-and-seek, with the children who are hiding crying \"madadayo!\" until they've found a good spot to hide. This will serve to explain the final scene, and make it more poignant perhaps...for the Japanese too speak of returning to one's childhood in extreme old age.",
         "Kurosawa's last film was released in the US at his death, five years after it was made. It's the story of a retired schoolteacher and it's unabashedly sentimental and heartwarming, but unlike the lonely old man of the famous English schoolteacher tale Goodbye, Mr. Chips who has to be humanized and refuses to retire, Hyakken Uchida (Tatsuo Matsumura) is different from other men in his oddball attitude and intellectual accomplishments but neither lonely nor sad, and the story begins with his very willing retirement. He's both a mischievous joker and a happily married man who likes to stay up all night drinking and singing with his ex-students in all the years that follow that retirement depicted in the film. Uchida's quirky individuality is celebrated by his admirers, and the film depicts him solely in his relationship with them. They give him lavish presents (including after WWII a nice house with a liquid garden) and an annual birthday party, and they cherish his spirit, his personality, and his funny, thought-provoking remarks. Madadayo is based on a series of books in turn drawn from the life of an actual military school teacher. Teacher -- sensei -- of course has a special sense in Japanese. It's a role one takes on for life, and one's \"sensei\" is a permanent attachment based on admiration and respect. Corny and sentimentalized as this \"sensei\" is, he's a richly charming character and the way his former students carouse with him and cherish him before, during, and after the War is expressive of some of the best aspects of Japanese culture. At the annual parties, the ritual is that the sensei's students chant, Mahda kai?\" (are ready?) and he sings out, \"ma-da-da-yo!\" (not yet!). But though he may not go gentle into that good night, he does accept old age with good humor. Madadayo is about growing old, about growing old frankly, growing old gracefully, about being useful as one grows old through dignity and humor, about the mutual benefits that accrue when the old receive the respect of younger generations. It's about old-fashioned loyalty to one's school, and about respecting and honoring eccentricity and respecting and honoring the intellectual type. The former students, who are doctors, lawyers, business men, and so on, recognize that in his oddball impracticality, his \"absent-minded professor\" style, their sensei possesses wisdom and creative individuality they lack and they always say he's \"pure gold.\" One might imagine them proposing him for designation as a \"national treasure.\" Sensei is absurdly weak and vulnerable at times, witness his emotional collapse when his wife's male cat Nora disappears and he goes to pieces with grief. But importantly he articulates this grief eloquently and with a certain detachment for his ex-students. And they respect his peculiarities so much that they send out an all points bulletin for Nora and are gravely concerned for his return. (It never comes, but the sensei's wife finds another cat and eventually both are memorialized by handsome gravestones in the garden.) However silly he is, his behavior is simply more enthusiastic and emotional than others', and finally this sensei simply represents what is wisest and most human. And sensei's wife represents a perfect, idealized traditional Japanese woman (without the function in her case of mother, however), always deferential, formal, polite, sweet, but elegant and noble, the repository of hospitality, the hearth, loyalty, goodness, patience, steadfastness: you can't help being impressed by the actress Kyôko Kagawa's supple, unflaggingly consistent, energetic but restrained performance, comparable to Tatsuo Matsumura's. As the sensei, Matsumura is an initially off-putting but ultimately irresistible and splendidly rich character -- pitiful, cute, wise, silly, tough, stridently singing his old songs and making his imperishable jokes which his many admirers never fail to laugh at loudly and delightedly. They need him tremendously -- this is the film's chief message, to value special people as they age -- and so they take wonderful care of him. When the film begins, his book sales have enabled him to retire and focus on writing in a small house. When the War comes it's completely destroyed by Allied bombs and he and his wife live in a tiny hut. At the end of the war the students build a lovely spacious house with a garden made up entirely of a \"donut\" shaped pool in which carp the sensei fancifully describes as \"giant\" can swim around endlessly. Many of the scenes are Ozu-like in their quietude and use of a stationary camera as the sensei sits with his chief admirers and drinks and talks, usually with his wife sitting by to supply food and drink. But there is a large cast of characters and in the final annual birthday dinner women and children and grandchildren are now present. The drinking of a large stein of beer by the sensei before he performs the \"Mahda kai?\"\"Ma-da-da-yo!\" ritual and gives his amusing speech is probably based on Germanic practices: Uchida taught German and must have studied in Germany. The sensei's unflagging spirit and humor and his former students' equally unflagging devotion make for an inspiring and beautiful fantasy. It is a wise and pleasant dream, and Kurosawa's charming evocation of it speaks well of his final years. The film was made in 1993, released in the US in 1998 when Kurosawa died, re-released in 2000. It is timeless, and any year is a good year to get to know it and chew over its many, many endearing passages.",
         "I just finished watching \"Madadayo\" and can still feel tears welling up. I was moved at the beautiful movie and its message of kindness and living well. It took me a while to get into the film as it is rather slow and not much does happen, but Kurosawa is a master of mood, characterization and setting the scene and gradually, the movie takes its hold on you. The movie starts with the Professor's retirement from teaching. We learn he taught German, and he must have been a good teacher as well as quite a character, because large numbers of his students stay in touch with him through the decades. Kurosawa shows us that the students love and respect him dearly, as well as finding him eccentric. They refer to him as \"solid gold\". However, I kept asking \"Why? Why would these people with busy lives, following their own paths, continue to hold birthday parties for their eccentric old professor?\" And as the movie continued, I found myself answering my own question. Why not? It's a win-win situation for all involved. The students value the professor's company and despite joking protests to the contrary, the professor enjoys the visits and increasingly comes to depend on them. In post-WWII Japan, there must have been little to celebrate, so having an annual excuse to get together with people you enjoy would be reason enough. Kurosawa also expounds on one of his main themes from \"Red Beard\"; kindness begets kindness and that is what we continually shown in \"Madadayo\". The students help build the professor a new house after his home is destroyed in the fire-bombing of Tokyo. The professor loses his cat and the students and the community band together to try to find it, celebrating and congratulating one another when they think they find it, and commiserating and empathizing when they don't. The annual birthday parties continue and evolve from just the male students drinking with their professor to banquets involving their wives and children. I began to fall under the spell of how wonderful it would be to be part of this community, to know these people, to know there were others looking out for me, willing to help if I needed it, relishing my company, and knowing that once a year I could get together with all my friends from school (the ones we all lose touch with because our busy lives follow diverging paths), celebrate the life of a great man (a favourite teacher's lessons stay with you forever) and be part of something bigger and gentler and kinder. I can understand why someone expecting the excitement of \"Seven Samurai\", the suspense of \"High and Low\", or the innovation of \"Rashomon\" would be disappointed in \"Madadayo\", but if you enjoyed the lessons of \"Red Beard\", the gentle pull of \"Madadayo\" will delight and soothe you. You'll be left with a serene feeling of well-being, wishing you could be one of the Professor's students.",
         "i'd put off watching Madadayo because i'd had apprehensions about a \"modern day\" kurosawa piece (even though it spans from 1943 to 1960), and i wish i hadn't. it was a beautiful, -beautiful- film and one definitely worth seeing. the premise is simple -- it follows the life and relationship between a professor and his former students -- but the film itself is anything but. it's especially touching, knowing that it was kurosawa's ultimate work. despite the epic period masterpieces that were his hallmark, i can think of no better film to serve as kurosawa's last than this simple, elegant, sublime piece. don't make the same mistake i did. don't put off seeing this movie. whether you're a fan of his work or not, you're guaranteed to enjoy it. it's the kind of films that transcend genres and leaves you touched, whether you were looking for it or not.",
         "In a pre-WWII Tokyo, the professor of German Hyakken Uchida (Tatsuo Matsumura) decides to retire after thirty years of professorship, and dedicate to the career of writer. His students, some of them from different generations, love him and keep a close touch with the professor and his wife (Kyôko Kagawa) along his life. In 1943, the house of the professor is bombed, he loses all his possessions and moves to a simple gardener cottage. After the war, his former students build a new small house with a lake around, and every year along seventeen years, in the professor's birthday, they have a reunion with a funny ceremony, based on children's hide and seek and referring if the professor is ready to die. They ask the professor: \"-Mahda-kai?\" (\"Are you ready?\"), and the professor responds \"-Madadayo!\" (\"Not yet?\") and drinks a large glass of beer. \"Madadayo\" is the last direction of Master Akira Kurosawa, and is a sensitive low-paced worship of knowledge, friendship and life. I found this movie very beautiful, and I would like to highlight some points. First of all, the character of the professor Hyakken Uchida, capable of be adored by his students of different generations, very connected to a cat, living with his beloved wife but without kids. There is no explanation, but it seems quite contradictory a man of such profile not having son or daughter. Another interesting point is the changing of behavior of Japanese society with women (and family) along time. In the sixty-first anniversary of the professor (First Madadayo), there are only men in the meeting room, in spite of war finished a few years ago. Seventeen years later, the room is crowded of men, women and children. The conclusion of the story, showing that life goes on, is awesome! Last but not the least, the music score is magnificent. My vote is nine. Title (Brazil): \"Madadayo\"",
         "Spoilers herein. Well, filmmaking doesn't get more personal than this. Conceptually, it fits between `Ran' and `Red Beard,' but the central character is clearly reflective of the esteemed filmmaker. This Prospero is a writer. (Though he was also a German teacher, it is his writing that makes him special.) We have the requisite three worlds: the `real' world of Kurosawa, (who creates) the world of Uchida, (who creates) the world of Nora, the cat. Uchida appreciates another culture's literature as Kurosawa does (in American film). Kurosawa often uses a narrative device where stillness in the narrative increases the energy of the target. It is a definitive Japanese concept, but one that we who have lived with him know. So here, as we watch the slow aging and housing and visiting of the man, as we settle into the ordinariness of what we see, our attention is focused on the fulcrum of the whole thing: the fate of Nora. Kurosawa's point here is that his students love him of course. But once he is gone, they'll find another. He knows we venerate his films, and also knows that he is merely a small hut in which we stay while under duress, but that we will move on as the opportunity avails. There's a particularly wonderful episode at his first party. There amidst all the worshiping speeches, a man gets up and recites all the train stops on a very long line, a reference to his self-reference in `Dodesukaden.' There are many such references to his other films, possibly every one of them. I caught many and warmly remembered them and him. Here is the last tapestry of metaphor from the master of film metaphor. Check out the very last: hiding. It was his style to himself hide and to hide things in his work, including the truth of his own concealment. I wish we could all exit with such graceful selfawareness. Ted's Evaluation -- 3 of 4: Worth watching.",
         "Madadayo chronicles the life of a retired professor who lives vicariously through all the students he has taught. The students admire him greatly, he is visited often and many stay to listen to his whimsy and foolish stories. The professor is a child at heart, and not much really happens. The film doesn't have a plot really, and only 2 things start to focus around the story one being the loss of the professors house after the allied bombing, and the loss of a stray cat he adopts years later. To the viewer though there is much in between stories and people to digest such as a great celebratory dinner that is held every year, and so on. To some degree I will admit I liked the camradare that I witnessed, the great dialogue, the professors childish personality, but I wanted the film to move forward and to at least give me something to focus on. The lost cat scene was a good distraction but it did go a little more longer than neccesary. I find this often sometimes in Kurosawa's work (The lost gun in Stray Dogs, following the suspect in High and Low reminded me of this). However, the hallmarks of his great filmmaking are apparent in the dinner scenes, cinematography, and conversations. He also provides scenes that the viewer could take as obligatory (such as a death, or the possible return of the cat), but Kurosawa changes this so the outcome is not what you expect but refreshing. However, the best is saved for last... litteraly. As I was waiting for the film to end, the hallmark of greatness arrives without question in the span of what must have been only 5 minutes. The ending just wraps up everything so perfectly, and it made me from just liking the film to instantly loving it. It gives a real insight into the professors mind who is greatly admired and respected. Rating 8 out of 10",
         "Madadayo appears to be a light comedy on the surface, but, as in all Kurosawa films, he draws you deeper and deeper into the characters and takes his time to tell the story the way he wants to. Also, Madadayo is quite charming. I loved it. I felt I was transported to post war Japan and given more than just a glimpse into the Japanese personality, and that is a gift in my book. What a brilliant director Kurosawa was. I will miss him dearly.",
         "A fitting conclusion to Mr Kurosawa's career. Full of quiet melancholy and contemplation this film is, in my opinion, quite aware that it is the director's last. It deals solemnly with death, love, admiration and loyalty. Madadayo meaning not yet, tells the story of a retired German grammar teacher whose small group of devoted students grows exponentially every year along with the parties and gatherings in honour of him. The silence in the film allows the relationships between the characters to become gripping and though there is little action the audience begins to care about the teacher as much as the students. The film also contains just the correct amount of humour to counteract the more melancholic, contemplative elements of the story. My only main criticism is that the segment dealing with the lost cat is perhaps just slightly too long. While contributing greatly to the pathos in the film I believe if this part of the film were shortened by a little balance would be restored between pathos and merriment.",
         "I've watched this movie more often then any other Kurosawa movie. I think most of his movies I've watched only once were movies whose impact on me will last a lifetime, thats why I don't need to watch 'Stray Dog' or 'Red Beard' too often, though they are my favorite. But this one is a movie I can watch on the evening, an easy-watchable and yet very touching and intensive movie, with moments to laugh and touching moments too. I realy like this movie for its sympathic characters - though it plays partly in fascism war-torn Japan. Maybe its the point of why I like these character especially - it shows that despite their fascistic affiliation the characters didn't have to be evil - or at least not all. It has also a few good jokes which you can only understand when you understand japanese - the main character is a distinguished author and german-teacher. He delivers a brilliant character-study. Recommendable for everybody interested in japanese culture, especially postwar - and all Kurosawa-fans of course."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "DENTSU Music And Entertainment",
         "Daiei Motion Picture Company",
         "Kurosawa Production Co."
      ],
      "summaries": [
         "This film tells the story of professor Uehida Hyakken-sama (1889-1971), in Gotemba, around the forties. He was a university professor until an air raid, when he left to become a writer and has to live in a hut. His mood has hardly changed, not by the change nor by time. Every year his students celebrate his birthday, issuing the question \"Mahda kai?\" (not yet?), just to hear Uehida-san's answer \"Madada yo!\" (No, not yet!), in a ritual of self affirmation, and desires of lasting forever. It's a very \"japanese\" film who portrays everyday life and customs in Japan.",
         "In a pre-WWII Tokyo, the professor of German Hyakken Uchida (Tatsuo Matsumura) decides to retire after thirty years of professorship, and dedicate to the career of writer. His students, some of them from different generations, love him and keep a close touch with the professor and his wife (Kyôko Kagawa) along his life. In 1943, the house of the professor is bombed, he loses all his possessions and moves to a simple gardener cottage. After the war, his former students build a new small house with a lake around, and every year along seventeen years, in the professor's birthday, they have a reunion with a funny ceremony, based on children's hide and seek and referring if the professor is ready to die. They ask the professor: \"-Mahda-kai?\" (\"Are you ready?\"), and the professor responds \"-Madadayo!\" (\"Not yet?\") and drinks a large glass of beer.",
         "Following World War II, a retired professor approaching his autumn years finds his quality of life drastically reduced in war-torn Tokyo. Denying despair, he pursues writing and celebrates his birthday with his adoring students."
      ],
      "budget": 11900000
   },
   "movielensId": 4176,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "1993-04-17",
      "dvdReleaseDate": "2001-03-13",
      "directors": ["Akira Kurosawa"],
      "runtime": 134,
      "movieId": 4176,
      "title": "Madadayo",
      "mpaa": null,
      "actors": [
         "Tatsuo Matsumura",
         "Kyôko Kagawa",
         "Hisashi Igawa",
         "George Tokoro",
         "Masayuki Yui",
         "Akira Terao",
         "Takeshi Kusaka",
         "Asei Kobayashi",
         "Hidetaka Yoshioka",
         "Yoshitaka Zushi",
         "Mitsuru Hirata",
         "Nobuto Okamoto",
         "Noriko Honma",
         "Shigeo Katô",
         "Kôjirô Kusanagi",
         "Utaroku Miyakoya",
         "Kimihiro Reizei",
         "Kinzoh Sakura",
         "Mie Suzuki",
         "Tetsuo Yamashita",
         "Takao Zushi"
      ],
      "imdbMovieId": "0107474",
      "originalTitle": "まあだだよ",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["-bObIlquRNk"],
      "plotSummary": "This film tells the story of professor Uehida Hyakken-sama (1889-1971), in Gotemba, around the forties. He was a university professor until an air raid, when he left to become a writer and has to live in a hut. His mood has hardly changed, not by the change nor by time.",
      "tmdbMovieId": 13889,
      "avgRating": 3.43868,
      "releaseYear": "1993",
      "numRatings": 106,
      "posterPath": "/ny10xbrU8liWX9o1POn2klUSHXp.jpg"
   }
}