{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "campy",
            "id": 155493
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0041172",
      "video": false,
      "title": "Beyond the Forest",
      "recommendations": [
         45975,
         32849,
         79363,
         43525,
         128679,
         134757,
         112882,
         114626,
         128956,
         48277,
         84782,
         168179,
         115596,
         147282,
         40985,
         47717,
         79240,
         111163,
         130052,
         27509
      ],
      "backdrop_path": "/eKYGMrhb554z9ccQLCkSYAQCPb0.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "CONVERT94",
         "id": "5a032fddc3a368639101be30",
         "content": "Who better than Ms. Davis to impersonate herself?  This is her last film for Warner Brothers so old Harry gave her the screws with this melodramatic pot-boiler which, as it turn out, is an absolute hoot. A plethora of zingers, one-liners and one of the most famous lines in American cinema (\"What a dump\"), Bette chews up the scenery in her long hair wig and heaving breasts like never before. She's just plain nasty and as Elizabeth Taylor would later describe her to Richard Burton in \"WAOVA\", she's \"discontent\" or she's a housewife...\"She buys things\". Well, the only thing BD buys here is a one way ticket to the platform of the local Chicago bound train depot, before applying a slathering of make-up which surely was a try-out for Baby Jane. You must watch this if you love campy, over-the-top emoting by an iconic actress hell-bend on career self-destruction.",
         "url": "https://www.themoviedb.org/review/5a032fddc3a368639101be30"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Rosa Moline",
               "gender": 1,
               "credit_id": "52fe45bc9251416c9103cb17",
               "name": "Bette Davis",
               "profile_path": "/oWGPnjrIxmGHklOGimoPwvIxBgQ.jpg",
               "id": 3380,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Doctor Louis Moline",
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cb1b",
               "name": "Joseph Cotten",
               "profile_path": "/bTUTrTnzacCQV4F0rs1xH4QaETf.jpg",
               "id": 7664,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Neil Latimer",
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cb1f",
               "name": "David Brian",
               "profile_path": "/e0BICAGCXRtTksyOm8Np0TZfMST.jpg",
               "id": 16016,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Carol",
               "gender": 1,
               "credit_id": "52fe45bc9251416c9103cb23",
               "name": "Ruth Roman",
               "profile_path": "/lwfbybPwYRR3wy0jdnhS5jH5c4V.jpg",
               "id": 12498,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Moose",
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cb27",
               "name": "Minor Watson",
               "profile_path": "/1t0VRIa8oykSFS3WXcMfCCOCakH.jpg",
               "id": 30279,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Jenny",
               "gender": 0,
               "credit_id": "52fe45bd9251416c9103cb2b",
               "name": "Dona Drake",
               "profile_path": "/zRfvsjXVaAZ49mhs6JEhON25rUg.jpg",
               "id": 87368,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Sorren",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cb2f",
               "name": "Regis Toomey",
               "profile_path": "/wdcVhuLj0OzaEsgumhRcrMtbfq8.jpg",
               "id": 22093,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Mildred",
               "gender": 1,
               "credit_id": "52fe45bd9251416c9103cb33",
               "name": "Sarah Selby",
               "profile_path": "/cWgN5c99rSnKHuMxMG9r3ZfzIl3.jpg",
               "id": 114955,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Edith Williams",
               "gender": 1,
               "credit_id": "5791f8c1c3a3685961000afb",
               "name": "Ann Doran",
               "profile_path": "/liEnlp1myN4WL6MmJKsOfsGjd73.jpg",
               "id": 2772,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Secretary",
               "gender": 1,
               "credit_id": "5791f8f3c3a36858890008f3",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Townsman with Glasses",
               "gender": 2,
               "credit_id": "5791f90d9251411f7100095e",
               "name": "Creighton Hale",
               "profile_path": "/uqovtbUG2EYskIQjkLO95j6KdiK.jpg",
               "id": 97981,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Townswoman",
               "gender": 1,
               "credit_id": "5791f96ec3a3685961000b60",
               "name": "Dorothy Vernon",
               "profile_path": "/6P1TPGLYj3X2vt94EbCCCBWlLsM.jpg",
               "id": 927616,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "5791f9a9c3a368584c000a2f",
               "name": "Judith Wood",
               "profile_path": "/wT4pXeMi07YAiNH375Fy0LrQrIT.jpg",
               "id": 1047396,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cae9",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe45bc9251416c9103caef",
               "name": "Lenore J. Coffee",
               "profile_path": "/4izZTE5jXntDj7BX3HFVpNr1sRu.jpg",
               "id": 84237,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45bc9251416c9103caf5",
               "name": "Stuart Engstrand",
               "profile_path": null,
               "id": 114954,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cafb",
               "name": "Henry Blanke",
               "profile_path": null,
               "id": 14446,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cb01",
               "name": "Jack Warner",
               "profile_path": "/I8UijyhvGPOaeiPTmxgcYCa8td.jpg",
               "id": 2663,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cb07",
               "name": "Max Steiner",
               "profile_path": null,
               "id": 3249,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cb0d",
               "name": "Robert Burks",
               "profile_path": "/2FnhbhSQzCnMYsXzFptozlTlnFK.jpg",
               "id": 2654,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bc9251416c9103cb13",
               "name": "Rudi Fehr",
               "profile_path": null,
               "id": 7126,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "565fde03c3a36875f4001cf9",
               "name": "Robert M. Haas",
               "profile_path": null,
               "id": 14448,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "565fde0c925141790c001d60",
               "name": "William L. Kuehl",
               "profile_path": null,
               "id": 1198731,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "565fde14925141790a001e09",
               "name": "Edith Head",
               "profile_path": "/63ZeXQOh26sGa8nTbYWntieyWrz.jpg",
               "id": 4350,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "565fde27c3a36875f9002178",
               "name": "Al Alleborn",
               "profile_path": null,
               "id": 1417676,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "565fde33c3a36875e2001dd4",
               "name": "Charles Lang",
               "profile_path": null,
               "id": 1543599,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.426634,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35896,
      "vote_count": 13,
      "budget": 0,
      "overview": "The wife (Bette Davis) of a Wisconsin doctor (Joseph Cotten) kills a witness to her affair with an influential man (David Brian) from Chicago.",
      "similar": [
         14638,
         996,
         10160,
         1427,
         59,
         1585,
         599,
         793,
         162,
         426,
         289,
         1092,
         296096,
         339967,
         381283,
         76640,
         206487,
         359940,
         472805,
         513285
      ],
      "original_title": "Beyond the Forest",
      "runtime": 97,
      "poster_path": "/piHAjW9UX7WIBuNBTQPcyN69kjc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1949-10-21",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Nobody's as good as Bette when she's bad!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["King Vidor"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Lenore J. Coffee",
         "Stuart Engstrand"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041172/",
      "coverLink": null,
      "actors": ["Stars: Bette Davis, Joseph Cotten, David Brian | See full cast and crew »"],
      "reviews": [
         "While there ARE overdone and exaggerated moments in this film, it is also a near masterpiece! Bette Davis plays Rosa Moline, a small town strumpet who wants more than her hick doctor hubby can provide. Bette's explosive performance is among the best of her career(and that's saying something!). Her character has to be among the most evil in motion picture history. What is remarkable is that Bette compels us to care about and, even root for this greedy and self centered woman. That is part of what makes Bette Davis the most versatile and most accomplished actress in motion picture history. A particularly wonderful scene takes place later in the film. Rosa gives her husband a surprising bit of news at a picnic. Watch the sadness and mixed emotions that emanate from her eyes. What an amazing and bittersweet scene. The problem with the film is that there are scenes that don't fully detail what happens to Rosa near the end of the film. Also, there were changes imposed on the film by the production code that weakened its narrative logic. Despite a few flaws, this is a fabulous film. The highs and lows of Rosa Moline are compelling and complex. Like the sinister character Bette Davis portrays, the film is far deeper than it seems. Those who think of it only as camp should take a closer look.",
         "\"Beyond the Forest\" is finally getting the respect it's always deserved. A number of film historians are finally appraising this masterpiece as the work of art it is. Thanks to its phenomenal star, Bette Davis, this King Vidor production has had to struggle with a bad reputation since it was first seen back in l949. Davis was going through a breakdown: she hated her studio, her marriage was dead, and Jack Warner finally kicked her ass off the Warner lot. Forever after, Davis always slammed everything about \"Beyond the Forest\" and people who never even saw it, joked about it and tore it to pieces. Especially, the gay crowds. When I saw \"Beyond the Forest\" at the old Regency Theater here in Manhattan back in the 80s, no one could enjoy it, since the gaggle of screeching queens ruined it for everyone by camping it up. Davis' inner turmoil and fury is what makes Rosa Moline literally seethe with fury, bristling with electricity in her greatest role. No other major star would have taken the risks that Davis does. As to the many comments about her black wig, make-up, clevage. This is how small-town women tried to look during that era. The Maria Montez look. I remember this from my small Southern town. All women dyed their hair black, grew long tresses, etc. Max Steiner's musical score is among his greatest (next to another masterpiece that Bette always put down, the l942 \"In This Our life.\")Davis' role is among the greatest ever put on screen. She displays her genius here like never before. To those who like to be clever and cute and view this gem as \"camp\", get a life. Davis is at her most brilliant. She nearly matches her brilliant portrayal of a psychopathic Southern Belle, Stanley Timberlake, in the great \"In This Our Life.\" Bravo to Bette! To new viewers, watch it alone without the wisecracks, giggles and smart inside jokes. Warner Brothers did itself and its great star proud.",
         "Beyond The Forest drags around a reputation as one of the all-time stinkers, a reputation that's far from deserved but not hard to understand. This is the movie whose name Martha, in Edward Albee's play Who's Afraid of Virginia Woolf, can't remember after she quotes the emblematic line `What a dump.' (Thrown away by Bette Davis, the line got parodied as high camp by Elizabeth Taylor in the play's screen version.) It also fell at a time when Davis' best work was thought to be well behind her, and when she was labeled `difficult,' a year before All About Eve gave her career a booster shot. And, to be fair, there are aspects of the movie itself, a lurid and overwrought drama, that account for some of the scorn that's been heaped upon it. Married to impoverished physician Joseph Cotton in a grim Wisconsin factory town, Davis (as Rosa Moline) chafes against the boredom of her life and craves romance, adventure, big-city life as exemplified by Chicago, just a short train-ride away. That's where big-shot David Brian lives the high life but now and then visits a hunting lodge in the woods where he caught Davis' eye. She's just another notch on his bedpost but she's convinced herself he'll hand her the life of her fantasies. The plot cooks up a witch's brew of adultery, abortion and murder. But director King Vidor does well with the overripe material, which smacks of midcentury `regional' literature. Though Davis' long black wig is a sight for sore eyes, it's entirely in character for the slutty Rosa with longings above her breeding. When she finally travels to the Big Town, Vidor turns it into a tense yet poignant cinematic vignette. Admittedly, there are weaknesses: the big murder trial seems irrelevant even in this far-fetched plot, and both Cotton and Brian get elbowed offscreen by the volcanic Davis. [SPOILER HERE:] But Beyond the Forest's operatic ending more than compensates for the movie's faults. Greasy-faced and straggle-haired, guzzling pitchers of water and sweating like a stuck pig, Davis, dying and delirious from peritonitis (that botched operation), rouses herself for one last trip to Chicago. Kicking away her native American maid, she slaps on her makeup and finery and staggers down to the railroad tracks where the approaching train whistles its siren song of `Chicago, Chicago.' Alas, poor Rosa Moline dies like a dog, face down in the mud, as it passes her by. It's an eye-popping, go-for-broke performance, and maybe only Davis at this desperate juncture in her stardom could have brought off this Liebestod.",
         "It was interesting seeing this soon after seeing The Man Who Wasn't There, the Coen brothers would-be 40s film-noir. Both movies are set in small towns, have way-out plots involving violent crime and illicit love, and feature main protagonists trying to get out of a rut. But whereas the Coens' nouveau-noir plays it deadpan, philosophical and slow, and thereby risks boring the audience stiff; the genuine article with King Vidor at the helm, races along, goes way over the top, and glues the viewer to the screen. Melodramatic and flawed though it may be, I don't go along with those who regard the movie merely as a camp vehicle for some arch Bette Davis overacting as the \"evil\" Rosa Moline. This film has genuine substance and potency, and Hedda Gabler-like Rosa's near-hysterical exasperation with the suffocating small town atmosphere - symbolised by the ever-present smoke and dust from the local sawmill - and with her dull, worthy, medico husband (Joseph Cotton), must have rung a bell with many American and other women in the stifling post-war years. Her \"What a dump!\" quite probably echoed their inner thoughts, as may her reluctance to have a baby (contrasted in the film with another woman's eighth, delivered by the good doctor). Moreover, despite Davis playing a woman at least 10 years younger than her actual age, her scenes with David Brian as her wealthy lover are truly erotic, and some of the lines may raise eyebrows even today. Those who dismiss this film should perhaps give it another chance, try to place it in the context of its era, and possibly ponder on how some of the \"cool\" masterpieces of today will be viewed by their grandchildren in 50 years time.",
         "Many have blasted this film as pure camp, some without having even seen it, I'm sure. While this is no masterpiece, it really isn't that bad--it plays for the most part like a standard noirish \"woman's film\" from the forties. Since this sort of thing was Davis' specialty, she isn't particularly out of place here. Some of the dialog is dated and over the top, but not nearly so much as this film's detractors would have one believe. What truly stays in the mind is Bette's awful appearance--she's obviously too old to play the part of the small town sexpot, Rosa Moline. Beyond that, she's made to wear some awful black fright wig that makes her prematurely saggy face look positively witch like! As a romantic interest, she stretches our sense of credibility (however, I will allow for the fact that black Maria Montez type hair was probably thought sexy in those days-and she does grasp a sense of how a faded small town belle might try to put herself across, as she swaggers around with false bravado in her tight dresses and sexy ---- me shoes. All in all, not as bad as they say--the whole project probably shocked Davis herself (as well as quite a few critics who generally not kind to it) into realizing that her leading lady days were numbered. A strange career move in the lengthly career of a great, if misunderstood star.",
         "I would not do heaven's work well, I pray the devil comes and takes me, To stand in the fiery furnaces of hell. (Bruce Springsteen) \"Madame Bovary\" meets evil.Actually,the central character is so evil,that King Vidor felt compelled (or the producers suggested he did) to \"warn\" the audience : in a nutshell,knowing where evil lays helps us to fight against it. A long-haired prodigious Bette Davis plays a modern Madame Bovary:like Flaubert's heroine ,she is married to a poor country doctor (Joseph Cotten)who treats his patients for free;like her,she dreams of luxury (the scene when she puts on Roman's fur coat is revealing),of leaving her little provincial town (a voice-over at the beginning tells us that the train seems to whisper:\" Chi-Cago Chi-Cago\");like her ,she has a flighty lover . There the comparison ends:Rosa Molines epitomizes evil.She was born to be a queen and she won't be satisfied till she owns everything.With the exception of the short scene in the woods where she tells her husband she's pregnant by him -look at her hair !- ,Rosa never stops,she pushes people out of her way;even when she is humiliated -the scenes \"beyond the forest\" in Chicago-,she knows she will not lose,cause she is completely unscrupulous. Unlike Pearl (Jennifer Jones) in \"Duel in the sun\"(1946) or Ruby Gentry (Jones again) in the eponymous movie(1952),Rosa's only motives are money,luxury and being a socialite in Chicago.Pearl and Ruby led the men they loved to ruin,but they did love them.Rosa only loves herself. The \"abortion\" scene -which strongly recalls Gene Tierney's in Stahl's \"Leave her to heaven\" (1946)- was probably the main reason for the \"warning\" lines\" during the cast and credits. You should see these three Vidor works one after the others:\"Duel in the Sun\" \"Beyond the Forest\" and \"Ruby Gentry\" .These are superior melodramas.",
         "Only Bette Davis (along with Joan Crawford) could take a trashy film and make it absolutely compelling. No, this isn't a good movie, probably not even a fair movie but oh, Bette, you make it all worthwhile. Bette wears the worst wig of her career, some really surrealistic make-up and was years too old for the part......so what?? When she delivers those famous lines \"What a dump\", you could jump for joy. This is Davis at her campiest and you can bet she knew it. The story line is fairly simple. A small town bitch wants to be a big city bitch and takes a lover to attain that goal. She couldn't care less that she has a husband, played by Joseph Cotton, when she sets her sights for the boyfriend played by that perpetually bland actor David Brian. All hell breaks loose as Davis chews up the scenery and her fellow actors. The final scene as Davis drags herself to the train station is the raison d'etre for the cult following that has developed around this film. It is a film lovers delight. She was some dame!!!",
         "Just about everyone in 'Beyond the Forest' seems to have graduated with honors from The School of Bad Acting. First and foremost, Bette Davis, in her most wildly overdone, overbaked role sporting a Dracula-like black wig and pounds of lipstick, quivering with impatience at being stuck in a coal-mining town as the wife of a dull doctor. She's Madame Bovary in a major key, spitting out her lines with gusto as everyone else cowers around her. Neither Joseph Cotten nor Ruth Roman nor David Brian can do much but stand and stare at her antics. Of course, she's so camp that it's hard to turn away--like being at the scene of an accident. The only other cast member who outdoes her is Dona Drake as her dim-witted maid...talk about bad acting! Amid all the mayhem, we at least have Max Steiner's score to remind us that this is a Warner Bros. melodrama, a steamy concotion giving Davis a tailor-made role in which to be the ultimate bitch. Poor Ruth Roman stands by, wasted in a small role--a pity, because she can be a strong actress when given the right material. Only ardent Bette Davis admirers can possibly like this one--relieved occasionally by some typical Davis remarks. \"What a dump!\" Yeah, right. And what a film!!",
         "What I love about Bette Davis is that the more normal she seems at the beginning of the movie, the more of a psycho witch she's going to be by the end (with the notable exception of \"Now, Voyager\", in which the pattern was reversed). And this one delivers on that Bette expectation. In the first five minutes of the story itself, you see her fake a sprained ankle. You wonder why. Duh - she's preparing for major psycho witchiness of exponentially increasing proportions! And I have to say that this one beats most of her other great roles in at least that category - and in the category of making the psycho-ness tragically necessary right from the first minute. Yes, many parts of this movie are over the top melodrama. But HERE COMES THE SPOILER: Despite my status as a vehement pro-lifer and Catholic, I was so taken into Bette's performance that when it looked like her dream of minks and diamonds was going to be thwarted by her secret pregnancy, I found myself thinking \"Noooo, Bette, you HAVE to find some way to get an abortion!\" And then I found myself smacking myself on the head. But really, by that point, when I had already forgiven her for (Nother Spoiler:) totally murdering another person already, it was like, what's one more life sacrificed to her dreams? So when an actress can make an evil character compelling enough to make the audience root for her to kill people, I would hesitate before calling her a bad actress. Bette is the best!",
         "Notorious Bette Davis...acting against her will in an unsuitable part, although it's a performance many of her fans relish. Davis is about 5-to-10 years too old for role of Rosa Moline, wife of a well-meaning-but-penniless doctor, residing in a small Wisconsin town with starry-eyed dreams of living in Chicago; Rosa's secret lover, a corporate businessman from the Windy City, keeps reeling her in and throwing her back, while the good doctor takes her antics in stride. Screenwriter Lenore Coffee, working from a book by Stuart Engstrand, can't seem to iron out the character eccentricities or dramatic indignities inherent to the plot (she can't even use the novel's title to her advantage), leaving director King Vidor and his cast pretty much on their own. When Rosa gets sick at the finale, we have no idea why; when the lazy, foul-tempered maid sasses her, we have no clue why Rosa even puts up with her (or how the doctor affords her). Vidor directs Davis gently, casually--and of course she brings everything else from home: poison-coated coyness, lewd lips, flip talk, ridiculously playing with her long brunette wig as if she owned it. So, is this respectable work from Bette Davis, in her last film under contract for Warner Bros.? It is a stunning performance for both right and wrong reasons. True, Bette's Rosa is too heavy and shapeless to actually believe she's a grande dame in her horse-and-buggy town (maybe a blonde wig would've helped?); however, Davis is very good in her scenes with Joseph Cotten, and she doesn't go maniacal with the material. The film has been called camp, unintentionally hilarious--and at times it does strike a wild chord--but I think King Vidor was in on the dirty humor. His outlandishness doesn't qualify the film as a success necessarily, but it is certainly enjoyable. **1/2 from ****"
      ],
      "genres": [
         "Drama",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": ["Rosa Moline is bored with life in a small town. She loves Chicago industrialist Neil Latimer who has a hunting lodge nearby. Rosa squeezes her husband's patients to pay their bills so she can visit Chicago; her husband's patience is also tried: he tells her to go and never come back. Once there, Neil tells her he doesn't want her. Back home and pregnant, Neil shows up and now wants her. The caretaker at Neil's lodge threatens to reveal her pregnancy..."],
      "budget": 0
   },
   "movielensId": 41762,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-10-21",
      "dvdReleaseDate": null,
      "directors": ["King Vidor"],
      "runtime": 97,
      "movieId": 41762,
      "title": "Beyond the Forest",
      "mpaa": "",
      "actors": [
         "Bette Davis",
         "Joseph Cotten",
         "David Brian",
         "Ruth Roman",
         "Minor Watson",
         "Dona Drake",
         "Regis Toomey",
         "Sarah Selby",
         "Ann Doran",
         "Bess Flowers",
         "Creighton Hale",
         "Dorothy Vernon",
         "Judith Wood"
      ],
      "imdbMovieId": "0041172",
      "originalTitle": "Beyond the Forest",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["P2Z_dCEBCww"],
      "plotSummary": "The wife (Bette Davis) of a Wisconsin doctor (Joseph Cotten) kills a witness to her affair with an influential man (David Brian) from Chicago.",
      "tmdbMovieId": 35896,
      "avgRating": 3.5,
      "releaseYear": "1949",
      "numRatings": 6,
      "posterPath": "/piHAjW9UX7WIBuNBTQPcyN69kjc.jpg"
   }
}