{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "sailor",
            "id": 41599
         }
      ],
      "imdb_id": "tt0069883",
      "video": false,
      "title": "Cinderella Liberty",
      "recommendations": [27224],
      "backdrop_path": "/jdd0GyyLRzY3gtNatlhhxdf6uqB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Baggs Jr.",
               "gender": 2,
               "credit_id": "52fe49139251416c910a1dc1",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maggie Paul",
               "gender": 1,
               "credit_id": "52fe49139251416c910a1dc5",
               "name": "Marsha Mason",
               "profile_path": "/1iTPM9ciKMFb5RzePlcKhfWO0Fb.jpg",
               "id": 19131,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Doug",
               "gender": 2,
               "credit_id": "52fe49139251416c910a1dc9",
               "name": "Kirk Calloway",
               "profile_path": null,
               "id": 931356,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lynn Forshay",
               "gender": 2,
               "credit_id": "52fe49139251416c910a1dcd",
               "name": "Eli Wallach",
               "profile_path": "/nRoyZzUjzY7iGdnp2V2kOgrMMFi.jpg",
               "id": 3265,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Master at Arms",
               "gender": 2,
               "credit_id": "52fe49139251416c910a1dd1",
               "name": "Burt Young",
               "profile_path": "/rbSsSkQ72FoGcvwIHUxQWJ92I3W.jpg",
               "id": 4521,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Alcott",
               "gender": 2,
               "credit_id": "52fe49139251416c910a1dd5",
               "name": "Bruno Kirby",
               "profile_path": "/jGRVym5zAQZix5N4ZRabuE3XKHm.jpg",
               "id": 9257,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Miss Watkins",
               "gender": 1,
               "credit_id": "52fe49139251416c910a1dd9",
               "name": "Allyn Ann McLerie",
               "profile_path": "/tVkJUSsKrPlAullwRfpit2RHfW4.jpg",
               "id": 76382,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Executive Officer",
               "gender": 2,
               "credit_id": "52fe49139251416c910a1ddd",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Fleet Chick",
               "gender": 1,
               "credit_id": "59c162cdc3a368067a001858",
               "name": "Sally Kirkland",
               "profile_path": "/bAjUA08z6k8FZ3bu5QWcMWWVdMQ.jpg",
               "id": 12134,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Dance Hall Girl",
               "gender": 0,
               "credit_id": "59c162f4925141731700199b",
               "name": "Katherine Wilson",
               "profile_path": null,
               "id": 128626,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Go-Go Club Owner",
               "gender": 0,
               "credit_id": "59c16322c3a36806c60016e6",
               "name": "Jon Locke",
               "profile_path": null,
               "id": 178766,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49139251416c910a1de3",
               "name": "Mark Rydell",
               "profile_path": "/j7JuFKjL3iKeXdYVJILd6MFlVJA.jpg",
               "id": 21958,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "568bea7e9251417c06006e52",
               "name": "Darryl Ponicsan",
               "profile_path": null,
               "id": 66113,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "568bea8b9251411334024cc5",
               "name": "Darryl Ponicsan",
               "profile_path": null,
               "id": 66113,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "568beabcc3a3684bcc030a1d",
               "name": "Vilmos Zsigmond",
               "profile_path": "/zItpdF2B0mohQSFs40E7eUg3nkL.jpg",
               "id": 12235,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59c1615ac3a36806fd00185a",
               "name": "Mark Rydell",
               "profile_path": "/j7JuFKjL3iKeXdYVJILd6MFlVJA.jpg",
               "id": 21958,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59c16166c3a36806fd00186a",
               "name": "John Williams",
               "profile_path": "/2Ats98PB1SH2yfEPikiLdhRuXZm.jpg",
               "id": 491,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "59c1618392514173170017dc",
               "name": "Patrick Kennedy",
               "profile_path": null,
               "id": 1118130,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59c16190c3a36806fd0018a9",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59c1619b9251417375001674",
               "name": "Leon Ericksen",
               "profile_path": null,
               "id": 32772,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "59c16236c3a368070e001685",
               "name": "Rita Riggs",
               "profile_path": null,
               "id": 7308,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "59c16251925141734d0017b5",
               "name": "Betty A. Griffin",
               "profile_path": null,
               "id": 1455417,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.309648,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84847,
      "vote_count": 5,
      "budget": 0,
      "overview": "A lonely Navy sailor falls in love with a hooker and becomes a surrogate father figure for her son during an extended liberty due to his service records being lost.",
      "similar": [
         50270,
         1279,
         979,
         1904,
         1427,
         281,
         86331,
         25482,
         157847,
         504,
         50124,
         226,
         2832,
         1690,
         261023,
         1923,
         26973,
         12093,
         12662,
         507
      ],
      "original_title": "Cinderella Liberty",
      "runtime": 117,
      "poster_path": "/xjRlKLNVxhbARITazWV7P8fWz2u.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Sanford",
         "id": 95146,
         "origin_country": ""
      }],
      "release_date": "1973-12-18",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "She's 32. She drinks too much. She hustles pool. She's got a 10-year old mulatto son. She's got a different boyfriend every night. She's in trouble. And he's in love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Rydell"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "Darryl Ponicsan",
         "Darryl Ponicsan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069883/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyNDQxMjk3NV5BMl5BanBnXkFtZTcwNjcyNDYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Caan, Marsha Mason, Kirk Calloway | See full cast and crew »"],
      "reviews": [
         "When Cinderella Liberty was released I'd only been out of the Navy about a year, so I was automatically biased in favor of it. I happened across the film on AMC this morning, and was pleased to see that it holds up well. James Caan is perfect as the lifer-by-default, a guy apparently motivated by inertia and the need for a job rather than any driving patriotic force. Marsha Mason is likewise great as the whore-with-a-heart (not necessarily a heart of gold), and the boy who plays her son is superb. Eli Wallach is flawless as the lifer left over from the old \"Rocks and Shoals\" Navy, a genuinely tough era much more closely-related to life in the 19th century than the 21st. If you want a look at enlisted life in the Navy, especially in the early 70's (yes, they did allow mustaches and a bit of hair in those days), I would recommend this film wholeheartedly.",
         "nothing surprised me more than flicking over the channel and catching this film late last night. it promised to be just the kind of dull fare I needed to watch and cure my insomnia: a sailor up to no good in a sleezy bar with a giggling hooker. but this film did the opposite it woke me up and i will admit made me cry - a lot. It is a small story, a sailor falls for a 'barroom whore' and assumes responsibility for her, her son and her unborn child and that's it really. He is stuck in Seattle waiting for his papers, broke and lost and these two unlikely characters, the whore and her son, hook up with him and somehow they muddle together to make what looks like almost a family. each of them is tentative, protective of the tiny space that makes up their world, yet all three show that despite harsh realities they can express tenderness to each other. what was remarkable was that there was nothing patronising or dismissive in the portrayal of any of the characters, all three of which are the stereotypical stock of cinema, a philandering sailor, a whore, and a illegitimate kid. i was totally convinced by the story and moved by the way that despite the needs expressed for each other, they were pushed apart. i cannot recommend this film highly enough, and hope that anyone reading this will try and watch it.",
         "You can't necessarily tell by the cinematography, but this fantastic movie is the best film ever shot in Seattle - the pre-Microsoft, real Seattle. The acting is understated to the point where the camera and the actors almost playing a game of who holds the shot the longest. It is not a story about losers at all - that is Sleepless in Seattle - Cinderella Liberty is a beautiful love story in the real world. Cinderella Liberty is a story about the possibilities that can exist between humans in even the most low-life of worlds. I love it because it is the Seattle I knew and offers its characters many of the choices I had offered to me at a certain point in my own life. And that's what heart-gripping cinema is all about, to me.",
         "This is a fine sweet-natured character study about big-hearted losers groping their way. The flavor of pre-grunge and pre-latte downtown Seattle drenches the film, evoked by the many authentic locations unearthed by director Rydell. Caan and Mason, as many have pointed out, are just terrific, and it is fun to see the younger Burt Young, Bruno Kirby (credited as Bruce Kirby Jr.), and especially Dabney Coleman, before their careers blossomed. A word of warning though: the abysmal Paul Williams score and singing are rivaled only by Richard Baskin's infamous turn in \"Welcome to L.A.\" for sheer auditory torture.",
         "Actress Marsha Mason had only two film credits to her name when after much television work and an unforgettable Roxanne in the tv CYRANO DE BERGERAC, she gave an intense dramatic performance in CINDERELLA LIBERTY and won both audiences and stardom, as well as a Golden Globe Best Actress Award and an Oscar nomination. Her Maggie is all emotion, both tender and explosive. She runs the gamut and gives an exceptional performance. James Caan works well with her and balances Maggie's raw yet vital persona with his characterization of John Baggs, understated and calm. The twist in the story gives him not what he wants but what he needs and in that sense is true to life. An enjoyable adult drama that still holds up.",
         "This movie was made in 1973, and I thought it was a great movie for several reasons. It depicts the gritty, boring life of a career enlisted serviceman. Military heroics are replaced with human heroics at a time when civilians had a dim view of anyone who spent time in the service. The movie turns all the trite plots about saintly prostitutes and sailors on its head. Caan plays a real sailor, and Marsha Mason, a funny but can't help herself hooker. Her young son by an unknown black father is slowly drawn into a friendship with her mother's \"honky\" john. This unlikely threesome is what makes this movie worth watching. In my opinion, it is a better movie than \"From Here to Eternity\", which has too much of the recruiting version of the military. Cinderlla Liberty is stripped raw of the poster Navy. This movie shows life in the real Navy about a real human being, who happens to be a sailor.",
         "Cinderella Liberty presents a world of lonely people looking for a little love in their lives. James Caan does a complete turnaround from his Godfather persona playing John Baggs, Jr. -- a sensitive, lovesick and positive sailor who backs into (or does it back into him?) the life of Maggie Paul (Marsha Mason), a pool playing barroom hustler with a biracial son, Doug (Kirk Calloway) whose tough exterior reveals a very sad and lonely boy. This comedy-drama creeps up on you like the love the characters feel for each is slowly realized. Excellent work by everyone here -- but this one bears a repeat watch for the work of Kirk Calloway, who is amazing as the boy and Eli Wallach, Baggs' alter-ego of a what lonely Navy life could hold for him. Look for this gem and go back to a time in film acting when real emotions were all the special effects needed to entertain and touch you.",
         "This film is a mini-classic. It addresses the lives of the ordinary people who have to struggle to make a living. It shows how enlisted people are really no better off than the rest of us when is comes to coping with bureaucracy and officialdom. Ignore the extreme prejudice in the comment from the Oklahoma poster. The acting is excellent and the characters never descend in to the sentimental clichés that right wing critics accuse social commentary of. It's a shame that the gap between the rich and poor has grown since this film was made. A remake of this film would be timely but probably could not catch the moment like the original does.",
         "Granted there are some literary devices which are a tad far-fetched that simply have to be accepted to allow this story to work - for one, the cavalier way in which Baggs is treated while his papers are 'lost', and for so long. None the less, this is, in the end an affecting and inspiring tale. Perhaps one of the reasons for its dubious reception here is that in this extremely cynical and selfish age people have difficulty accepting a tale about someone who assumes so much grief in order to help people (\"It makes me feel good,\" says Baggs, simply and disarmingly.) Perhaps the world would be a better place if we could all be more like the guileless Boatswain, played by James Caan in a good-guy departure from his usual tough guy parts. Of particular note is the fine job Eli Wallach does with the minor part of Baggs' nemesis Forshay. It's a memorable moment when Baggs, asking Forshay, as he is drummed out of the service without benefits or pension, \"Where are you going? Home?\", hears Forshay reply \"THIS was home.\" The combination of sadness, bitterness, and fear of the future that Wallach puts into these three words is testimony to his power as an actor. A bit of judicious editing might have been called for, as the movie was a tad long (cutting Paul Williams' execrable songs would have been a good place to start), but none the less it's a feel-good movie that rises above its gritty setting.",
         "I find this the best movie I have ever seen...the emotion, the acting, the content, the story......all excellent and moving beyond words. James Caan is just the best ever in this, his acting is perfect, as is all the actors in this movie...truly, it is a joy to watch over and over and you have to watch it a few times to get the real benefit of all that if offered beneath the words. Truly an act of unconditional love as never seen before. The person who wrote this has a soul of gold. If you ever want to know what true love is all about and what it entails...see this film, because you will be in no doubt afterwards."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Sanford"],
      "summaries": ["A lonely Navy sailor falls in love with a hooker and becomes a surrogate father figure for her son during an extended liberty due to his service records being lost."],
      "budget": 0
   },
   "movielensId": 41810,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-12-18",
      "dvdReleaseDate": "2007-03-06",
      "directors": ["Mark Rydell"],
      "runtime": 117,
      "movieId": 41810,
      "title": "Cinderella Liberty",
      "mpaa": "",
      "actors": [
         "James Caan",
         "Marsha Mason",
         "Kirk Calloway",
         "Eli Wallach",
         "Burt Young",
         "Bruno Kirby",
         "Allyn Ann McLerie",
         "Dabney Coleman",
         "Sally Kirkland",
         "Katherine Wilson",
         "Jon Locke"
      ],
      "imdbMovieId": "0069883",
      "originalTitle": "Cinderella Liberty",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A lonely Navy sailor falls in love with a hooker and becomes a surrogate father figure for her son during an extended liberty due to his service records being lost.",
      "tmdbMovieId": 84847,
      "avgRating": 3.4,
      "releaseYear": "1973",
      "numRatings": 15,
      "posterPath": "/xjRlKLNVxhbARITazWV7P8fWz2u.jpg"
   }
}