{
   "tmdb": {
      "original_language": "ko",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "seoul",
            "id": 5318
         }
      ],
      "imdb_id": "tt0190268",
      "video": false,
      "title": "Birdcage Inn",
      "recommendations": [
         25652,
         159185,
         94653,
         25653,
         44502,
         36867,
         25651,
         11553,
         25649,
         9698,
         45098,
         8653,
         23996,
         245597,
         26525,
         226208,
         25650,
         46761,
         107235
      ],
      "backdrop_path": "/rhHZ4sRCBsI6c0ZDXZ5954zeSMQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Jin-a",
               "gender": 0,
               "credit_id": "52fe436cc3a36847f8053279",
               "name": " Lee Ji-eun",
               "profile_path": null,
               "id": 231505,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Hye-mi",
               "gender": 0,
               "credit_id": "52fe436cc3a36847f805327d",
               "name": "Hae-eun Lee",
               "profile_path": null,
               "id": 231506,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Hyun-woo",
               "gender": 0,
               "credit_id": "52fe436cc3a36847f8053281",
               "name": "Ahn Jae-mo",
               "profile_path": "/zMnK3pMJiZsCUAG6M41XOPCX9Rt.jpg",
               "id": 87784,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Gecko",
               "gender": 0,
               "credit_id": "52fe436cc3a36847f8053285",
               "name": "Hyeong-gi Jeong",
               "profile_path": null,
               "id": 231507,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jin-ho",
               "gender": 0,
               "credit_id": "52fe436cc3a36847f8053289",
               "name": "Son Min-seok",
               "profile_path": null,
               "id": 231508,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436cc3a36847f8053263",
               "name": "Kim Ki-duk",
               "profile_path": "/mQnlRxDEEwwMeqn9vBT1HcQ8Ztx.jpg",
               "id": 1188,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe436cc3a36847f8053269",
               "name": "Kim Ki-duk",
               "profile_path": "/mQnlRxDEEwwMeqn9vBT1HcQ8Ztx.jpg",
               "id": 1188,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436cc3a36847f805326f",
               "name": "Seo Jeong-min",
               "profile_path": null,
               "id": 28000,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe436cc3a36847f8053275",
               "name": "Seung-jae Lee",
               "profile_path": null,
               "id": 1191,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.140116,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 2777,
      "vote_count": 18,
      "budget": 0,
      "overview": "With a red-light district in Seoul being demolished, the residents there find they have to relocate. Jin-a opts to leave Seoul and heads to the eastern city of Pohang. There she takes up residence in a boarding house run by a small family. Besides the parents, there is a daughter attending university and a son in high school. At first Jin-a is very happy there, however she continues to sell her body driving her into confrontation with the repressed daughter, Hye-mi. Things go from bad to worse when Jin-a meets Hye-mi's boyfriend.",
      "similar": [
         50270,
         1279,
         979,
         1904,
         1427,
         281,
         86331,
         25482,
         157847,
         504,
         226,
         2832,
         1690,
         261023,
         1923,
         26973,
         12093,
         12662,
         507,
         4995
      ],
      "original_title": "파란대문",
      "runtime": 100,
      "poster_path": "/AudXaWqKI4Bb9xIsyjTeQCTxJId.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Boogui Cinema",
         "id": 1215,
         "origin_country": ""
      }],
      "release_date": "1998-10-31",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ki-duk Kim"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Ki-duk Kim",
         "Jeong-min Seo"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt0190268/",
      "coverLink": null,
      "actors": ["Stars: Ji-eun Lee, Hae-eun Lee, Jae-mo Ahn | See full cast and crew »"],
      "reviews": [
         "One of Kim Ki-duk's earlier, lesser-seen films, \"Birdcage Inn\" portrays the hard times of a young Korean prostitute and the family that makes money off her in a Korean coastal city. As with all Kim's films, the plot is pretty ludicrous, but this one lacks much of the sensationalistic depravity that makes most of his films conversation pieces. Kim's really attracted to prostitutes and the business of prostitution - as, it seems, are many of his heroines (one character's transition at the end of the film foreshadows a similar character's change of heart in Kim's recent \"Samaria\"). He also seems to have a Mizoguchian love/hate feeling towards women. His girls may be whores but they have good hearts, and even though they may be smacked around repeatedly they persevere. The main girl, Jin-a, has to be the prettiest whore in all of Korea working a seedy dive like the one depicted in \"Birdcage Inn.\" She's down on her luck and is the sole income provider for this impoverished family and their little inn by the sea. The family, though, aren't really all that bad, they just have to put the kimchee on the table and the kids through school somehow. The high schooler son's obsessed with sad, muppet-faced Jin-a and installs a microphone in her room so he can listen in on her frequent trysts with customers. The father, well, aside from the time when he pretty much rapes Jin-a, he's an otherwise great guy. The mother takes it all stoically, which is more than can be said for the daughter, trying to get through university and court a potential fiancé amidst all the dirty business. She can't stand that her family resorts to such activities and she blames poor Jin-a for all of it. Still, \"Birdcage Inn\" eventually becomes the female-bonding film you figure it was intended to be from the get-go. Like Lars von Trier, Kim tends to have his adorable lead actresses go through a good deal of pummeling and degradation in his films, and he continues to incur the wrath of feminists. But as I mentioned, despite its subject matter \"Birdcage Inn\" is probably the tamest of Kim's films until \"Spring, Summer, Fall, Winter and Spring,\" and actually manages to finish on a relatively upbeat note. At the end of \"Birdcage Inn\" the whore's still a whore and everyone's still stuck in a dead-end existence, but they're all oddly content and accepting, with a smiling, Ozu-like resolve.",
         "Kim Ki-duk continues his exploration of primal human behavior in BIRDCAGE INN. A master at depicting specific, \"closed\" environments, here he sets his story in a one-girl brothel in a seaside town. A man falls in love with the brothel's prostitute and this presents a dilemma for those who depend on her for survival. This is a more restrained, quieter film than the Korean director's BAD GUY, THE ISLE, CROCODILE or ADDRESS UNKNOWN. The violence is less overt, the sex off-screen more than on-screen. For some, it will be a more accessible film. Personally, I would place it just below the four titles above, but that is in no way a slight on the movie. Recommended.",
         "For one reason or another a young woman named \"Jin-a\" (Ji-eun Lee) is forced to relocate from her previous domicile and accepts employment as a prostitute at a small family-owned hotel. Although most of the family members accept her (to one extent or the other) the college-age daughter, \"Hye-mi\" (Hae-eun Lee) treats her with unveiled contempt and ridicules her at every opportunity. Likewise, some of her customers along with her former pimp also make life miserable for her as well. Even so she endures the best that she can. Now rather than reveal any more of this movie and risk spoiling it for those who haven't seen it I will just say that the director (Ki-duk Kim) used just about every scenario related to the \"world's old profession\" he could find. Unfortunately, some of these scenes didn't translate well due to the cultural anomalies inherent in Korean society and in addition there were a few scenes which seemed to be a bit too slow. In any case, all things considered I rate this movie as about average.",
         "Subject matter is a small brothel where a family struggling to support their kids education rents out a prostitute which get shelter, food and some percentages in return. The women of the family largely ignores her, the father sees her as a means for money and sex, the one that respects her is the son who adores her for the beautiful woman she is. This is a very simple movie, script and execution was so different from the other Kims that I thought it to be from the early 90s not 1998. Music turns even to genuine porn variety. I was surprised to learn that the cinematographer Seo Jeong-min has made almost 130 movies as it seems a bit amateurish, at least he did better in 'Suchwiin Bulmyeong'. The basic storyline was good. Its about values turned bad and living poor. Men are captives of their desire and the women are in difficult positions. But the script is not so good, some characters are not believable and the finale was confusing. Go see 'Suchwiin Bulmyeong' and 'Seom' instead for similar, but much more elaborate film art. You cant help feel sorry for Jin-a though. She is very fragile and even though she is misused quite a few times she is always positive.",
         "I must start by saying that I'm not the biggest fan of Kim Ki-Duk, I've seen a number of his films and while he hits the mark more often than not, his films tend to have some pretentious elements. The story has been told a million times, and with much more flair. There are two girls, one of them despises the other, one of them longs for the other's friendship. Eventually, the first one realizes what a jerk she's been and so they become the best of friends. The end. The whole prostitution angle doesn't really give the story much depth: wow, there's a pimp involved. Wow, everyone thinks they can exploit a prostitute. And the father's comment to the prostitute in the jail cell? Prostitutes aren't the only ones who whore themselves, huh? DEEP. The worst part is when the \"decent girl\" steps in for the hooker. What does this prove? That she indeed considers the other girl her equal? Hardly the best way to prove a point. The rape scene(s) and some other parts might be viewed as disturbing. What I don't see is what they add to the film in this magnitude-- it's pretty much accomplished by this point that prostitutes don't lead the easiest lives. Some nice subtle touches, decent acting and a couple of pretty pictures. Otherwise utterly forgettable and full of clichés."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Boogui Cinema"],
      "summaries": [
         "With a red-light district in Seoul being demolished, the residents there find they have to relocate. Jin-a opts to leave Seoul and heads to the eastern city of Pohang. There she takes up residence in a boarding house run by a small family. Besides the parents, there is a daughter attending university and a son in high school. At first Jin-a is very happy there, however she continues to sell her body driving her into confrontation with the repressed daughter, Hye-mi. Things go from bad to worse when Jin-a meets Hye-mi's boyfriend...",
         "Streetwise Jin-a moves into a boarding house run by a small, close-knit family. But her unacceptable behavior threatens to destroy them all."
      ],
      "budget": 0
   },
   "movielensId": 41820,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "1998-10-31",
      "dvdReleaseDate": null,
      "directors": ["Kim Ki-duk"],
      "runtime": 100,
      "movieId": 41820,
      "title": "Birdcage Inn",
      "mpaa": null,
      "actors": [
         " Lee Ji-eun",
         "Hae-eun Lee",
         "Ahn Jae-mo",
         "Hyeong-gi Jeong",
         "Son Min-seok"
      ],
      "imdbMovieId": "0190268",
      "originalTitle": "파란대문",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "With a red-light district in Seoul being demolished, the residents there find they have to relocate. Jin-a opts to leave Seoul and heads to the eastern city of Pohang. There she takes up residence in a boarding house run by a small family. Besides the parents, there is a daughter attending university and a son in high school. At first Jin-a is very happy there, however she continues to sell her body driving her into confrontation with the repressed daughter, Hye-mi. Things go from bad to worse when Jin-a meets Hye-mi's boyfriend.",
      "tmdbMovieId": 2777,
      "avgRating": 3.22727,
      "releaseYear": "1998",
      "numRatings": 11,
      "posterPath": "/AudXaWqKI4Bb9xIsyjTeQCTxJId.jpg"
   }
}