{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "usa",
            "id": 279
         },
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "brother-in-law",
            "id": 2102
         },
         {
            "name": "wheelchair",
            "id": 2564
         },
         {
            "name": "honesty",
            "id": 4427
         },
         {
            "name": "cinematographer",
            "id": 4606
         },
         {
            "name": "insurance fraud",
            "id": 4617
         },
         {
            "name": "shadowing",
            "id": 4918
         },
         {
            "name": "fortune cookie",
            "id": 5875
         },
         {
            "name": "ex-wife",
            "id": 155816
         }
      ],
      "imdb_id": "tt0060424",
      "video": false,
      "title": "The Fortune Cookie",
      "recommendations": [
         987,
         32030,
         18727,
         1859,
         32255,
         24481,
         12530,
         53021,
         14554,
         61650,
         24807,
         13562,
         16274,
         5185,
         31507,
         11356,
         42719,
         16410,
         38724,
         43136
      ],
      "backdrop_path": "/eIs4vei9lKrtJvjbf2uxt1Q8hFK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Harry Hinkle",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba07",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Willie Gingrich",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba0b",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Boom Boom Jackson",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba0f",
               "name": "Ron Rich",
               "profile_path": null,
               "id": 19779,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Sandy Hinkle",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803ba13",
               "name": "Judi West",
               "profile_path": "/98w57d28QVs88j9rsWI6PqL52VB.jpg",
               "id": 19780,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Purkey",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba17",
               "name": "Cliff Osmond",
               "profile_path": "/tTxv0TKz8SDgKAhayx6LJsQOXU4.jpg",
               "id": 14834,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Mother Hinkle",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803ba1b",
               "name": "Lurene Tuttle",
               "profile_path": "/bkaxEJFGflsSVnPqJZSWjI4knUN.jpg",
               "id": 19781,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "O'Brien",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba1f",
               "name": "Harry Holcombe",
               "profile_path": null,
               "id": 19782,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Thompson",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba23",
               "name": "Les Tremayne",
               "profile_path": "/mWXxR42D22b4vRLCUOqC4zyIPs.jpg",
               "id": 2648,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Charlotte Gingrich",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803ba27",
               "name": "Marge Redmond",
               "profile_path": "/pyYtZ89LflU4JVI4FeouN96Yuo8.jpg",
               "id": 19783,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Sister Veronica",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803ba2b",
               "name": "Ann Shoemaker",
               "profile_path": "/rArHJgboSzPc6l1cGkVUXzBT9rp.jpg",
               "id": 19784,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Doc Schindler",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba2f",
               "name": "Ned Glass",
               "profile_path": "/3H3OFQohDcX2TQ9bKhwWpfL6HxI.jpg",
               "id": 18870,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Mr. Jackson",
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803ba33",
               "name": "Archie Moore",
               "profile_path": "/AhVhT7BSPXxfMJAiXDEW9k80LNI.jpg",
               "id": 19785,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Mr. Cimoli",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803ba37",
               "name": "Howard McNear",
               "profile_path": "/pqe7uwiUrPXruIuYefjO5MOtEFI.jpg",
               "id": 19786,
               "order": 12
            },
            {
               "cast_id": 27,
               "character": "Dr. Krugman",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803ba3b",
               "name": "Harry Davis",
               "profile_path": null,
               "id": 19787,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Kincaid",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803ba3f",
               "name": "Lauren Gilbert",
               "profile_path": null,
               "id": 19788,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803b9bb",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803b9c1",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9c7",
               "name": "I. A. L. Diamond",
               "profile_path": "/lii36e0Ntvq7sL1rA0tVs4FePYT.jpg",
               "id": 3147,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803b9cd",
               "name": "Billy Wilder",
               "profile_path": "/nWV9BDDCbRegP7etiPjl3vYnJEq.jpg",
               "id": 3146,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9d3",
               "name": "Doane Harrison",
               "profile_path": null,
               "id": 3159,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9d9",
               "name": "I. A. L. Diamond",
               "profile_path": "/lii36e0Ntvq7sL1rA0tVs4FePYT.jpg",
               "id": 3147,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9df",
               "name": "André Previn",
               "profile_path": "/39fVW2HbF3p4Io1PprezmAsqLkq.jpg",
               "id": 5805,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9e5",
               "name": "Joseph LaShelle",
               "profile_path": "/3j8m5eDzhinBJeUscfNZWhJn9ch.jpg",
               "id": 4101,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9eb",
               "name": "Daniel Mandell",
               "profile_path": null,
               "id": 4102,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9f1",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9f7",
               "name": "Robert Luthardt",
               "profile_path": null,
               "id": 19778,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803b9fd",
               "name": "Edward G. Boyle",
               "profile_path": null,
               "id": 4104,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803ba03",
               "name": "Robert Martin",
               "profile_path": null,
               "id": 14828,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.092331,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1888,
      "vote_count": 64,
      "budget": 0,
      "overview": "A cameraman is knocked over during a football game. His brother in law as the king of the ambulance chasing lawyers starts a suit while he's still knocked out. The cameraman is against it until he hears that his ex-wife will be coming to see him. He pretends to be injured to get her back, but also sees what the strain is doing to the football player who injured him.",
      "similar": [
         891,
         321741,
         7007,
         430472,
         334763,
         430364,
         390070,
         348376,
         151231,
         322479,
         314286,
         354437,
         371508,
         423545
      ],
      "original_title": "The Fortune Cookie",
      "runtime": 125,
      "poster_path": "/3b9BcraWgj6gWkMCOag0lEEAd0O.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Phalanx-Jaelem",
         "id": 776,
         "origin_country": ""
      }],
      "release_date": "1966-10-19",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Is he a spy? A security risk? Is he unfaithful? Or is he a nice, normal shnook - out to make a million bucks by sheer accident!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Billy Wilder"],
      "runtime": 125,
      "synopsis": null,
      "writers": [
         "Billy Wilder",
         "I.A.L. Diamond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0060424/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwODI0MTI4OV5BMl5BanBnXkFtZTgwNzQzNjIzMTE@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Walter Matthau, Ron Rich | See full cast and crew »"],
      "reviews": [
         "Amazingly original and intelligent comedy by Billy Wilder that has CBS cameraman Jack Lemmon injured one day by a football player while covering a Cleveland Browns game. Lemmon is rushed off the field and to the hospital but other than a few bruises he is just fine. Enter brother-in-law lawyer Walter Matthau (in a very well-deserved Oscar-winning role) who convinces Lemmon to fake various injuries so the duo can sue CBS, the NFL and the Cleveland Browns all for negligence. Lemmon is not too sure but when he realizes that he can get back with his ex-wife, he finally agrees to the charade. The biggest problem is that all-around-great-guy Ron Rich (the Cleveland Brown who collided with Lemmon on the sideline) feels lousy about the situation and starts to develop a bad drinking problem when he sees how poorly Lemmon is supposedly doing. The title refers to a strange message that Lemmon receives after eating some Chinese food. A great film that has lots of upside. 4.5 out of 5 stars.",
         "When THE FORTUNE COOKIE came out in 1965 it proved a remarkably successful comedy. Of course it was directed by Billy Wilder, still at or near the height of his film career with a string of great successes from THE MAJOR AND THE MINOR, THE LOST WEEKEND, and SUNSET BOULDVARD through SOME LIKE IT HOT and THE APARTMENT. Of course there had been less successful films for Wilder, most notably THE EMPEROR WALTZ and THE BIG CARNIVAL, but most of his films were widely respected by critics and the public. And when he made it in 1965 it was to star Jack Lemmon, who had demonstrated his comic qualities in three other Wilder films: SOME LIKE IT HOT, THE APARTMENT, and IRMA LA DOUCE. So the public was quite interested in this film, which was to tear into the American habit of suing for injuries, and into shyster lawyers. In fact, the screenplay was originally supposed to be MEET WHIPLASH WILLY, the final name of the film when shown in England. What surprised many people was the casting of Walter Matthau as \"Whiplash Willie\" Gingrich, the shyster brother-in-law to Lemmon's Harry Hinkle. Matthau was a widely respected actor, with great stage experience, but his performances in movies had been mostly as villains. From the whip happy tavern keeper in THE KENTUCKIAN, to the Machiavellian government adviser in FAIL SAFE Matthau usually played unlikeable sorts. There were some exceptions. In A FACE IN THE CROWD he is one of the television people who assist Lonesome Rhodes (Andy Griffith) on his way up, but who are appalled at the monster they create. When, at the end of the film, Griffith is starting to think of how to overcome the huge gaffe he created over the airwaves that have sent his career into the dumpster, it is Matthau (a terrific figure of decency here) who tells Griffith that he won't be coming back, but will be lucky to be remembered in a few years as a has-been. But A FACE IN THE CROWD was a rarity for Matthau. If he played comedy it was as a villain, most chillingly in CHARADES as Mr. Bartholemew. In his scenes as an embassy official he had some good comic bits, like when he offers a cigarette to Audrey Hepburn, and she takes two puffs and puts it out - Matthau is put out by this waste of one of his pricey cigarettes! It is Matthau's appearance in THE FORTUNE COOKIE that changed his public persona and his career. He went to town as Whiplash Willy, threatening to sue the United Fruit Company for failing to put a printed warning on their bananas after Howard McNear fell and broke his pelvis tripping on one. His careful manipulation of brother-in-law Lemmon/Hinkle, his calculating in how to force a major law firm to surrender unconditionally in his demands, his snide comments about great lawyers of the past (Lincoln, Darrow), all build up a to a great introductory performance. It really showed the Matthau that the public would grow to know - a cynical type who could make others (especially the more decent Lemmon) do what he wanted them to. He would also be quick to get into deeply pseudo-intellectual speeches, voicing his opinions and points of views. It was the Matthau who would entertain movie audiences for the next three decades. As a sign of his success in finding his persona, Matthau won the Best Supporting Oscar for THE FORTUNE COOKIE. Lemmon recommended Matthau to Wilder, who was pushing either Frank Sinatra or Jackie Gleason. It is quite hard to imagine either the Chairman of the Board or the Great One as effective as Matthau. But I have long wondered if Wilder and Lemmon had had someone else in mind, someone who was no longer available. The Hinkle - Gingrich relationship was a close one due to their family relationship, and Wilder certainly had discussed the issue of the casting with Lemmon. Up to 1961, Lemmon had appeared, most often, with one actor in the movies - in comedies. He appeared in BELL, BOOK, and CANDLE, IT STARTED WITH JANE, and OPERATION MAD BALL with his close friend Ernie Kovacs. Lemmon had been so close to Kovacs that he appeared (in the disguise of a monkey suit) as one of the Nairobi Trio. There are some lines in THE FORTUNE COOKIE that sound ready made for Kovacs - for example, when he writes a figure down as a settlement figure, and when the other lawyers make their counter-offers Matthau repeats it each time, looks at the paper, and says, very quietly, \"That isn't it!\" One can easily see Kovacs saying the same thing the same way. If, as I suspect, THE FORTUNE COOKIE was an idea of Wilder's and Diamond's for a few years, it is just possible that Lemmon suggested Kovacs for the role of Gingrich. But after Kovacs died in a car accident in 1962, Lemmon had to find another actor of similar type. And then he noticed Matthau, who in 1965 was well received for his performance in THE ODD COUPLE on Broadway. Kovacs' bad luck may very well have been Matthau's good luck. Today we think of the Lemmon-Matthau partnership as really based on their films with Wilder. They did four films with Wilder, but after THE FORTUNE COOKIE it was their joint appearance in the film version of THE ODD COUPLE directed by Gene Saks that made the partnership viable. Otherwise it might have seemed a flash in the pan. THE ODD COUPLE was to prove that the chemistry between the actors did not solely defend on the artistry of Wilder.",
         "Finally caught it on TCM yesterday, and was able to watch it \"fresh,\" compared to \"The Odd Couple\" or \"The Front Page,\" which one might already know all about. A fine study in contrasts at work here; Matthau, as the shyster lawyer has something resembling a family life, while Lemmon, ostensibly the nice guy, is shown to be very lonely, still stuck in the apartment his wife left him in (and aren't those exteriors filmed in Cleveland? I don't think those buildings on his street were seen in any other Hollywood backlot, and they looked a touch more shabby than ordinary). So we have \"Boom Boom\" as the real moral center of the movie. He's racked with guilt over having injured Hinkle (Lemmon), so much so that he sees to Hinkle's recovery, even carrying him around like a wounded puppy, letting his game suffer, and he's the one who's most hurt by the scam. The movie also shows a hopeful light on race relations in the mid-60's: Ron Rich gets to play a character with some feelings and some ambition beyond the NFL, and it's he and Lemmon's characters who become buddies at the end.",
         "I absolutely love Walter Matthau. He is one of the greatest comic actors ever to grace the screen. His ability to turn a Jewish complaint into a laugh has a life of its own (like Woody Allen) and Lemmon of course is the perfect foil. This is why they were \"The Odd Couple.\" In fact, this movie includes three of the greatest film makers to ever work/play in Hollywood: Bill Wilder, Jack Lemmon and Matthau. See this movie to have fun with the perfect comedic chemistry of Lemmon and Matthau and also to enjoy the intelligent humor of Wilder's writing. As those of us who have ever created a film or written a story or music know, such endeavors are always an experiment; there's always the (big) chance that what you're busting your butt on will just lay there in the end. Well, when they came up with this story formula, with Matthau as scheister and Lemmon as border line skeptic/fool for love, it just hit, you know? As in, it's a classic winner! Hollywood comedy literally doesn't get any better. The proof? Study up on your dark comedy history: It started with Wilde (The Importance of Being Earnest), was carried on with Wilder (this film) and every single piece of satire that has been written since these masterpieces of comedy owes itself to them.",
         "One of these days I am going to watch a bad Billy Wilder movie...so far I have not even come close. Each year we observe the passing of great talents (this year, 2003 has seen an extrordinary number of death), I begin to realize we will never again see the likes of Lemmon and Matthau who passed away in 2000 and 1999 respectively. These two are great actors in comedic or serious roles. Matthau's sleazy lawyer is played just right, not too over the top and Lemmon plays the victim in this movie who is basically going along for the ride. As the movie progresses Lemmon gets further disenchanted with the pending cash settlement for his fake injuries and in his own inimitable way blows the whistle on his brother-in-law, Whiplash Willie (Matthau.) I found Wilder's use of Cliff Ormond and Noam Pitlik as the bumbling private eye surveillance team to be reminiscent of Jackie Gleason and Art Carney on the Honeymooners, or even a latter day type of slapstick in the style of Abbot and Costello. Also, the supporting role of Boom Boom the Cleveland Browns running back who accidentally injures Lemmon on the sideline at a game was played with depth. All in all another wonderful treat this movie is to watch.",
         "In The Fortune Cookie, Billy Wilder took on the great American legal system and twisted a lot of laughs out of it. It's the underside of the great American dream, sue someone with deep pockets and you can be a millionaire. It's why we have too many lawyers in our society, it's what creates Willie Gingrich. In three previous Wilder pictures folks like Fred MacMurray in Double Indemnity, William Holden in Sunset Boulevard, and Kirk Douglas in Ace in the Hole all had some similar notions about a get rich and/or famous quick scheme and they all ended in tragedy. Interesting that protagonist Jack Lemmon as TV cameraman Harry Hinkle has more strength of character than those three before him. Not at first though. Jack Lemmon is a TV cameraman who is covering a Cleveland Browns football game in Municipal Stadium when running back Ron Rich takes him out when Rich goes out of bounds. That's where attorney and brother-in-law of Lemmon, Walter Matthau hears about a previous spinal injury Lemmon sustained and he hatches a scheme involving Lemmon who is supposed to now act paralyzed so he can sue CBS, Municipal Stadium, and the Cleveland Browns for as much as he can wring out of them. Matthau won his Oscar for Best Supporting Actor playing bottom feeding lawyer, Whiplash Willie Gingrich. With that kind of nickname in the profession it's no wonder that the white shoe firm representing the defending parties goes all out to trip him up. They get private detective Cliff Osmond to shadow Lemmon night and day. The results he gets from his surveillance are not unexpected, but a lot of laughs come along with them. Matthau is so good as Gingrich that you can literally see his mind at work as he hears about Lemmon's childhood fractured vertebrae from his wife who is Lemmon's sister. Watching his kids skateboarding in the hospital waiting room you kind of wonder what kind of ethics he's been teaching them at home. Note that when you last see Willie Gingrich in the film, he's down, but not yet out. There's a couple of other good performances here. Ron Rich as the Brown halfback who really is concerned that he permanently paralyzed Jack Lemmon. Also Judi West as Lemmon's ex-wife who when she hears about Lemmon's possible windfall, she's ready to reconcile with him. Matthau is ready to use her of course, but even he gets kind of put off with her ethics. This is also the farewell performance of Sig Ruman, who Billy Wilder liked to use when he could, both of them being refugees from Hitler. Ruman is one of the specialists brought in and the only one who's not fooled by Lemmon's performance. The Fortune Cookie even after 40 years still has plenty of laughs for this generation. That is sadly because this is part of the American legal system that if anything has increased exponentially since 1966.",
         "If I had to buy a single movie showing Walter Matthau's genius as an actor, this may be the one, for as good as Jack Lemmon always is in a movie, Walter shines here as the shyster brother-in-law lawyer, and the Best Supporting Oscar was awarded to him rightly for this role. Matthau, always the man who acted through sicknesses went through a heart attack during this one. The scene that he runs up the stairs after receiving the settlement check, a keen eye could notice that he is thinner at the top of the stairs. That was because he shot that scene after his attack. This movie begins the long association with Lemmon/Matthau. The next movie was to be \"The Odd Couple\". What a great bunch of entertaining movies they were. And this was the first one.",
         "Little-known, but has fine performances by Jack Lemmon and Walter Matthau. Lemmon is a not-too-bright sports cameraman who gets knocked over by a football player (Ron Rich) and is persuaded by his crooked, ambulance-chasing brother-in-law lawyer (Matthau) to fake an injury for the insurance money. Lemmon tries to go along with the scam, but is consumed by guilt because the guilt Rich feels for the \"injury\" is quickly wrecking his life. Added to this is the return of Lemmon's ex-wife (Judi West), with whom he is still obviously in love. He is completely oblivious to the fact she is a gold-digger--in his case, love truly is blind. Everything resolves itself as it should, but not as you might think. It's a funny, dramatic, and touching film.",
         "\"The Fortune Cookie\" is a light, lovable con/slapstick film about Harry Hinkle (Jack Lemmon), a sports cameraman who is accidentally knocked down by NFL star Boom Boom Jackson (Ron Rich) at a football game. Hinkle suffers a minor concussion but his lawyer brother-in-law, Willie Gingrich (Walter Matthau) is immediately on the seen. Willie thinks that they can sue for millions of dollars if Harry plays that he's got a \"compressed vertebrae\", and Harry reluctantly agrees. Meanwhile Boom Boom is feeling desperately guilty and is taking care of Harry to make himself feel better. This movie is labeled as a comedy but most of the humor is dry and subtle. I'd go as far as to call it out-dated, it was probably considered a lot funnier when it first came out. Though I guess the only character that is supposed to be actually funny is Matthau's, and he is. Hilarious, in fact. He never misses a beat, every movement and line is delivered in perfect accordance to his character. And considering the guy had a heart attack while working on the film, his drive and proffesionalism is admirable. Aside from Matthau the movie is a little bland, but not bad. The other performances, from Lemmon, Rich and Judi West as Hinkle's gold-digging ex-wife, are all well-played, Rich gives the most notable performance as the guilt-ridden Boom Boom. The style, direction and other componets of the film are well too...but in the end Matthau's performance is the only real benefit of this film, but it's a big benefit, and gets a 7.5/10 from me.",
         "There are some lagging gaps in the film, but overall this is a delightfully written comedy, with clever ideas, good jokes and colourful supporting characters. Walter Matthau won an Oscar for his flamboyant role in the film, and he has a number of good moments, although Jack Lemmon also shines, bringing in his usual charm to every scene. The film is divided into a number of different chapters, and set to some wonderful music, giving it a vibrant feel. And, above all its other virtues, the film manages to say some things about greed and the consequences of lying. It is not a large flashy production, and it may not be a perfect film, but I found it quite charming and it comes recommended, especially to fans of Wilder's comedies."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Mirisch Corporation, The",
         "Phalanx-Jalem"
      ],
      "summaries": [
         "A cameraman is knocked over during a football game. His brother in law as the king of the ambulance chasing lawyers starts a suit while he's still knocked out. The cameraman is against it until he hears that his ex-wife will be coming to see him. He pretends to be injured to get her back, but also sees what the strain is doing to the football player who injured him.",
         "A cameraman gets injured by a football player during a game and goes to the hospital. There, his cunning brother in law (who happens to be a lawyer) convinces him to pretend that his legs have been paralyzed. This way, they can receive a huge indemnity from the insurance company. Of course, the insurance company's men suspect that the paralysis is a fake one, and so a big \"game\" begins. The first collaboration of the successful team of Walter Matthau and Jack Lemmon.",
         "A crooked lawyer persuades his brother-in-law to feign a serious injury."
      ],
      "budget": 3705000
   },
   "movielensId": 4186,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1966-10-19",
      "dvdReleaseDate": "2001-03-06",
      "directors": ["Billy Wilder"],
      "runtime": 125,
      "movieId": 4186,
      "title": "The Fortune Cookie",
      "mpaa": "",
      "actors": [
         "Jack Lemmon",
         "Walter Matthau",
         "Ron Rich",
         "Judi West",
         "Cliff Osmond",
         "Lurene Tuttle",
         "Harry Holcombe",
         "Les Tremayne",
         "Marge Redmond",
         "Ann Shoemaker",
         "Ned Glass",
         "Archie Moore",
         "Howard McNear",
         "Harry Davis",
         "Lauren Gilbert"
      ],
      "imdbMovieId": "0060424",
      "originalTitle": "The Fortune Cookie",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "nTHf36jLuV0",
         "LNVMW2cb_g8"
      ],
      "plotSummary": "A cameraman is knocked over during a football game. His brother in law as the king of the ambulance chasing lawyers starts a suit while he's still knocked out. The cameraman is against it until he hears that his ex-wife will be coming to see him. He pretends to be injured to get her back, but also sees what the strain is doing to the football player who injured him.",
      "tmdbMovieId": 1888,
      "avgRating": 3.60377,
      "releaseYear": "1966",
      "numRatings": 424,
      "posterPath": "/3b9BcraWgj6gWkMCOag0lEEAd0O.jpg"
   }
}