{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mutant",
            "id": 1852
         },
         {
            "name": "greenhouse",
            "id": 4168
         },
         {
            "name": "carnivorous plant",
            "id": 8183
         },
         {
            "name": "radioactive",
            "id": 9741
         },
         {
            "name": "h.p. lovecraft",
            "id": 10308
         }
      ],
      "imdb_id": "tt0059465",
      "video": false,
      "title": "Die, Monster, Die!",
      "recommendations": [
         3164,
         42794,
         38260,
         52196,
         29121,
         40474,
         31393,
         34593,
         61716,
         38120,
         44545,
         41516,
         29394,
         66918,
         3125,
         52840,
         83519,
         40060,
         3574,
         27831
      ],
      "backdrop_path": "/4pKfw27AOxPGkKBMpAbl8MF71TI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nahum Witley",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06df19",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Stephen Reinhart",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06df1d",
               "name": "Nick Adams",
               "profile_path": "/wtA4pLwHxAROYry4MPq0eLWZ9Cd.jpg",
               "id": 2787,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Letitia Witley",
               "gender": 1,
               "credit_id": "52fe45c5c3a368484e06df21",
               "name": "Freda Jackson",
               "profile_path": "/gG8SceSfYUiq3j4WIiJhsn6p6UL.jpg",
               "id": 39002,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Susan Witley",
               "gender": 1,
               "credit_id": "52fe45c5c3a368484e06df25",
               "name": "Suzan Farmer",
               "profile_path": "/qq0jLhJWYWkbBVhRbI61nrE4tWt.jpg",
               "id": 81246,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Merwyn",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06df2f",
               "name": "Terence de Marney",
               "profile_path": "/9SyHhcDhcUBDdfnCA2yteea8UtE.jpg",
               "id": 100790,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dr. Henderson",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06df33",
               "name": "Patrick Magee",
               "profile_path": "/32ReETRLWtjg4eQO1SRhJsn8aSE.jpg",
               "id": 2264,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jason",
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06df37",
               "name": "Paul Farrell",
               "profile_path": "/tOSOdVUQSNtnhzqVLgh5TcMA1Bf.jpg",
               "id": 2273,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Potter",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06df3b",
               "name": "Leslie Dwyer",
               "profile_path": "/rdZ6i7t1OxY9VAUnUAmmmUCA8Sr.jpg",
               "id": 123900,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Pierce",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06df3f",
               "name": "Sydney Bromley",
               "profile_path": "/3uUJyYHgedK6K7BLz5RtZ4xpCjg.jpg",
               "id": 12693,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Henry",
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06df43",
               "name": "Billy Milton",
               "profile_path": null,
               "id": 248772,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Taxi Driver",
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06df4b",
               "name": "Harold Goodwin",
               "profile_path": "/gLhjtadSsrzrdpYrBhV9mZ4uAs5.jpg",
               "id": 1208202,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Miss Bailey",
               "gender": 1,
               "credit_id": "52fe45c5c3a368484e06df47",
               "name": "Sheila Raynor",
               "profile_path": "/b4EXxbf8djBOGycwHjXtPijrx2K.jpg",
               "id": 2276,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06df2b",
               "name": "Daniel Haller",
               "profile_path": null,
               "id": 28236,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "536003990e0a266274000042",
               "name": "H.P. Lovecraft",
               "profile_path": "/yV6ZvyxMaghmmeaf97ZlLCLCpSt.jpg",
               "id": 67054,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 2.697979,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 29067,
      "vote_count": 20,
      "budget": 0,
      "overview": "A young man visits his fiancé's estate to discover that her wheelchair-bound scientist father has discovered a meteorite that emits mutating radiation rays that have turned the plants in his greenhouse to giants. When his own wife falls victim to this mysterious power, the old man takes it upon himself to destroy the glowing object with disastrous results.",
      "similar": [
         127585,
         246655,
         928,
         1562,
         841,
         12244,
         1576,
         9659,
         110415,
         51876,
         49017,
         49049,
         49521,
         198663,
         119450,
         861,
         5876,
         7191,
         6479,
         9426
      ],
      "original_title": "Die, Monster, Die!",
      "runtime": 80,
      "poster_path": "/aAYlioTJ5RpxfihDhwjBubLYqlf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1965-10-26",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "No one can stop this killing machine....It's Already Dead!!!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Daniel Haller"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Jerry Sohl",
         "H.P. Lovecraft"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059465/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNzUyNzMyN15BMl5BanBnXkFtZTcwNDc0MTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Boris Karloff, Nick Adams, Freda Jackson | See full cast and crew »"],
      "reviews": [
         "AIP decided to try cashing in on Lovecraft rather than Poe this time around.What we get is an above average movie that is hampered by its budget. Nick Adams plays Stephen Reinhart who arrives in the small english town of Arkham.When he tries various means to travel to the Witley estate he is rebuffed by the townsfolk and has to walk.We're treated to some decent matte shots of a desolate countryside. Arriving at the estate the young man is met by Nahum Witley (Boris Karloff).He is pointedly told to leave.Sticking to his guns Steve informs the man that he was invited by Mrs Witley.Of course Susan (Witley's daughter) rushes down to clear up some confusion. Here we learn that there are some weird goings on involving everyone at the house. A maid has disappeared,weird screams are heard at night and Mrs Witley hides behind curtains.A real miasma lurks in this house. Nahum has a strange secret in the basement that seems to be killing everyone who comes in contact with it. Rather than go further into the plot which is really basic there are a few things that lift this above your standard haunted (for lack of a better word) house story.This movie just reeks with atmosphere.It is very opressive and claustrophobic.The sets are wonderful and nicely done on the cheap.Boris Karloff gives his usual wonderful performance. Nick Adams actually holds his own here. On the downside the special effects are very limited due to the budget. A minor quibble.Patrick Magee shows up for a role that will leave you scratching your head wondering what that was all about. Definitely worth a look if you catch it on AMC or find the dvd cheaply.",
         "Daniel Haller's \"Die, Monster, Die!\" is a solid gothic horror film, about ten times better than what you would expect from American International Pictures. It has a confusing story, but two exceptional performances save this from being grade z schlock. The two lead performances are by Boris Karloff, as the scientist who has bad things happen to him and Nick Adams, as an American visiting his girlfriends' home. Despite his arthritis confining him to a wheelchair, Karloff manages to give a strong performance as the scientist who stumbles onto something big and lives to regret it. Adams' role could have been thankless, but he adds an aura of mystery and intrigue a lesser actor wouldn't have. This is a great-looking film. Haller was art director for Roger Corman and he has inherited Corman's gift for making the most of the small budget. This looks as if it could have cost a million dollars or more instead of a few hundred thousand. The widescreen Colorscope photography is among the best I've seen and deserved an Oscar nod. As for the story, it is confusing, but it all becomes clear if you pay attention and watch it more than once. I'm not sure people would want to do that, but this is the kind of film that deserves it. Its' odd and poetic feel make it spellbinding. Worth more than one look. ***1/2 out of 4 stars",
         "A creakily atmospheric chiller from the American International stable, 1965's Die, Monster, Die! is a loose adaptation of HP Lovecraft's The Colours Out Of Space and boasts a great exploitation title and Boris Karloff, although it's now more likely to offer fun than frights. A young heroic type arrives in a remote village looking for his fiancé but finds her family shunned by the hostile locals, and with good reason \u0096 her mad scientist father Nahum Witley (Karloff) has recovered a strange meteorite which turns plants into giants and several members of his household into grotesquely scarred mutants. Clunky acting and a faintly ludicrous script aside, there's a lot to enjoy, from the gloomy sets and portentous dialogue to one of wheelchair-bound Karloff's last meaty roles and a delicious mood of corruption well sustained by director Daniel Haller (formerly art director on some of AI's finest Vincent Price vehicles).",
         "Nick Adams arrives in a town in rural England to visit a young lady he met in college. However, when he tries to get a ride or rent a vehicle to take him to her manor home, the villagers are downright nasty--refusing to help him as well as inexplicably saying nothing about why they are so angry. Eventually, he just walks to her home. However, once there, the welcome is just as chilled and her father (Boris Karloff) treats him like a leper--telling him to go. However, it soon becomes apparent that the girl and her mother want Nick to stay and finally Boris reluctantly agrees to let him stay one night. This is a movie in search of a decent ending. During the first half of the film, the audience is highly entertained in a tale of possible madness or Satanism and the mood is terrific--eerie and with a strong sense of foreboding. However, despite a wonderful buildup, the ending is a major disappointment and can't help but sink this movie to the \"barely watchable\" level. The deep and dark secret just seemed rather dull and uninteresting. It's worth seeing if you are a Boris Karloff fan, but otherwise it's pretty skipable.",
         "The American Stephen Reinhart (Nick Adams) arrives by train in Arkham, a small town in the countryside of England. He tries to travel to the real estate of a man called Witley by taxi or bicycle, but the locals are frightened by the name and refuse to help him. Stephen has to walk to the property and he is badly received by Nahum Witley (Boris Karloff), who is on the wheelchair. Stephen informs that he had been invited by his fiancée, Susan Witley (Suzan Farmer), who welcomes him when she sees Stephen. The young man is summoned by Susan's mother, Letitia Witley (Freda Jackson), who is very ill, to have a private conversation with her, and she asks Stephen to leave the real estate as soon as possible with Susan. Further he learns that the maid Helga has disappeared and the butler Merwyn (Terence de Marney) is also very ill. Stephen notes that there are weird things happening in the house, with a woman in black wandering in the garden and screams during the night. He snoops around and finds the Nahum is using the radiation of a meteorite in the greenhouse to turn the wasteland into a place of beauty with giant plants. However the side effect of the radiation has killed Merwyn and affected the health and turned Helga and Letitia into monsters. Now Nahum wants to destroy the stone with tragic consequences. \"Die, Monster, Die!\" is a good sci-fi horror movie with Boris Karloff. The creepy story has a promising beginning but when the mystery is disclosed, it is a little disappointing. I was expecting that Corbin Witley was behind the dark events but the plots changes to science fiction and becomes silly. My vote is seven. Title (Brazil): \"Morte Para Um Monstro\" (\"Death for a Monster\")",
         "American scientist Stephen Reinhart (Nick Adams) travels to England for a visit with his fiancée (Suzan Farmer). Arriving in the small village of Arkham he is met with jeers from the local villagers who refuse to direct him to her home at the Witley Estate. Unable even to rent a bicycle from a superstitious shop keeper, Reinhart has no choice but to tackle the long journey on foot. Once at the Witley mansion, he takes note of dead trees which turn to ashes at the slightest touch, and the dreary wasteland which surrounds the area. When nobody answers the door, Stephen takes the liberty of entering on his own and runs into the wheelchair-bound Nahum Witley (Boris Karloff). The old man orders his unwanted visitor to leave, but Reinhart explains that he is there at the request of Mrs. Witley (Freda Jackson). When Reinhart greets Mrs. Witley he is concerned to find her hidden in bed behind a gauze veil, avoiding the light. She has contracted some type of strange illness, yet her husband refuses to take her to the town doctor. The Witleys' butler subsequently collapses and dies from sickness himself, and Reinhart witnesses the aged Mr. Witley burying him on the grounds in secret. Gaining entry into a locked greenhouse, our hero is alarmed to find giant mutated vegetables and even abnormal creatures thriving on small chunks of what appears to have come from some larger glowing rock. Stephen ultimately confronts Mr. Witley and learns that a green meteorite crashed to these grounds many years before, and that the old man has been nurturing it in the basement, believing that it was actually enhancing their lives when in reality, its radiation has been grossly mutating all living things in the vicinity. Adapted from the H.P. Lovecraft tale \"The Colour Out of Space,\" this movie (also known as MONSTER OF TERROR and THE HOUSE AT THE END OF THE WORLD) winds up missing the mark on many levels. Directed by Roger Corman's former production designer, the film's Gothic look is very attractive and some sequences are imaginatively shot; unfortunately much of the time we feel ourselves waiting for more things to happen with a tedious script that seems to be lacking something. It's got potential, yet there seems to be far too much loitering about, with many scenes of snooping around and investigating strange occurrences. Still, it's always fun to watch the arrogant-sounding Nick Adams and its a treat to see Boris Karloff still acting in his later years. **1/2 out of ****",
         "H.P. Lovecraft's stories are almost impossible to film. The way he describes places and things just can't be done. This movie and \"The Dunwich Horror\" have come closest to getting him on the screen. American Stephen Reinhart (Nick Adams) goes to England to visit his fiancée Susan Wiley (Suzan Farmer). He finds her living in a huge mansion with her angry wheelchair bound father (Boris Karloff) and a mother (Freda Jackson) who is mysteriously ill. And then there are strange cries in the night... It's well-made, has a suitably creepy setting and a pretty good script but it just doesn't completely work. A low budget really hurts especially when we see the supposedly horrific creatures in the greenhouse (they look like what they are--plastic puppets). The makeup on the \"infected\" people is sub par too. And Adams (a good actor) always appears drugged or annoyed. But the other actors are all great--especially Karloff who is just fantastic. It's worth watching just for him. I was honestly never bored and there were a few times that I actually jumped. It doesn't succeed but it's not a bad attempt. I give it a 7--mostly for Karloff.",
         "Everything you could possibly look for in a campy 60's horror movie: \"Die, Monster, Die\" delivers it! The film opens with an American student arriving in an isolated British village and, when asking to get to the Witley mansion, all the friendly villagers suddenly turn pale with fear. Call me old-fashioned, but a story that starts like this can't be bad. \"Die, Monster, Die\" is an the adaptation of an H.P. Lovecraft story with quite an ambitious premise and a terrific (as usual) acting performance given by Boris Karloff. This is the directorial debut of the obviously talented Daniel Haller who previously served under Roger Corman as an art director in his legendary Edgar Allan Poe cycle. Haller clearly loved what he learned there, as he now also stuffs his own film with mysterious fogs, dark vaults, bats on strings and a constant use of ominous sound effects. the story continues with Karloff as the slightly insane landlord who desperately attempts to clear the foul name of his ancestors. In a nearby meadow he found a radioactive stone that causes vegetables to grow enormous sizes and living organisms to mutate! Although our father Witley keeps on denying it, his family descends further into misery due to this stone. The scenery is great, Karloff is at his most deranged and the make up effects are quite gore for the time. Convincing too, as the \"melting face\" sequence is a bit unsettling. \"Die, Monster, Die\" is highly recommended entertainment, particularly meant for admirers of the almighty Boris Karloff. I'm more and more discovering his last cinema-achievements and - so far - every single one I encountered is worthy to be called \"a classic\". Some absolute favorites include \"The Sorcerers\",\"Curse of the Crimson Altar\",\"The Raven\" and \"Corridors of Blood\". This \"Die, Monster, Die\" surely is a worthy addition to this list. PS: keep an eye open for Patrick Magee! This great but shamefully underrated actor makes a small but neat appearance as the town's doctor.",
         "Originally filmed under the more atmospheric title 'The House At The End Of The World', sadly both the American ('Die, Monster, Die!') and British ('Monster Of Terror') titles reflect the quality of the movie. An adaptation of H P Lovecraft's 'The Colour Out Of Space' it feels more like a Poe adaptation, with its old dark mansion, subterranean corridors and air of family secrets. Unsurprisingly first-time director Haller was Corman's production designer/art director on the Poe series and the end result is a good-looking movie ruined by a poor script. Karloff is wasted as is the cast, which is a shame as it is a fine one. Freda Jackson, Suzan Farmer and Patrick Magee are genre veterans who have given (or would go on to give) fine horror performances in other movies, here they are just thrown away in small cameo roles or, in Farmer's case, a stiff, disconnected leading role. Haller would go on to make the far better Lovecraft adaptation, 'The Dunwich Horror', which, while flawed, is well worth checking out.",
         "This production has everything an old chiller ought to have: an American in England, a spooky old mansion, locals frightened of the spooky old mansion, a pretty girl who knows not the evil which surrounds her, creepy old people with a creepier family history, monsters, pseudoscience, the occult, and more. It all ends up being both too much and not enough, altho Boris Karloff is certainly acting his heart out. The scripting is clumsy: the elements are too traditional and elementary, everyone knows something they refuse to tell for no particular reason, the heavies are homicidal for no logical reason, the hero is afraid of nothing yet makes no effort to pursue attackers.... Worse, the directing is flat and the leads have little charisma or chemistry. It's occasionally effective, but mostly boring, which is death to the chiller genre. I want to say \"Die, movie, die!\" but it's just not that offensive."
      ],
      "genres": [
         "Mystery",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Alta Vista Productions",
         "American International Pictures (AIP)"
      ],
      "summaries": [
         "A young man visits his fiancée's estate to discover that her wheelchair-bound scientist father has discovered a meteorite that emits mutating radiation rays that have turned the plants in his greenhouse to giants. When his own wife falls victim to this mysterious power, the old man takes it upon himself to destroy the glowing object with disastrous results.",
         "Stephen Reinhart travels to a remote English village to visit his girlfriend Susan Whitley. From the moment he arrives in the village, it's clear that no one will speak of the Whitleys or even give him directions to the Whitley estate. Susan is happy to see him when he finally makes it there but her father Nahum tells him he must leave immediately. Susan and her bedridden mother Letitia are happy to have him stay but it's clear that Nahum Whitley has a secret, one that Susan isn't aware of, but is kept in the cellar of the house.",
         "The American Stephen Reinhart arrives by train in Arkham, a small town in the countryside of England. He tries to travel to the real estate of a man called Witley by taxi or bicycle, but the locals are frightened by the name and refuse to help him. Stephen has to walk to the property and he is badly received by Nahum Witley, who is on the wheelchair. Stephen informs that he had been invited by his fiancée, Susan Witley, who welcomes him when she sees Stephen. The young man is summoned by Susan's mother, Letitia Witley, who is very ill, to have a private conversation with her, and she asks Stephen to leave the real estate as soon as possible with Susan. Further he learns that the maid Helga has disappeared and the butler Merwyn is also very ill. Stephen notes that there are weird things happening in the house, with a woman in black wandering in the garden and screams during the night. He snoops around and finds the Nahum is using the radiation of a meteorite in the greenhouse to turn the wasteland into a place of beauty with giant plants. However the side effect of the radiation has killed Merwyn and affected the health and turned Helga and Letitia into monsters. Now Nahum wants to destroy the stone with tragic consequences."
      ],
      "budget": 0
   },
   "movielensId": 4196,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-10-26",
      "dvdReleaseDate": "2001-02-20",
      "directors": ["Daniel Haller"],
      "runtime": 80,
      "movieId": 4196,
      "title": "Die, Monster, Die!",
      "mpaa": "",
      "actors": [
         "Boris Karloff",
         "Nick Adams",
         "Freda Jackson",
         "Suzan Farmer",
         "Terence De Marney",
         "Patrick Magee",
         "Paul Farrell",
         "Leslie Dwyer",
         "Sydney Bromley",
         "Billy Milton",
         "Harold Goodwin",
         "Sheila Raynor"
      ],
      "imdbMovieId": "0059465",
      "originalTitle": "Die, Monster, Die!",
      "genres": [
         "Science Fiction",
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": ["577jhop1htU"],
      "plotSummary": "A young man visits his fiancé's estate to discover that her wheelchair-bound scientist father has discovered a meteorite that emits mutating radiation rays that have turned the plants in his greenhouse to giants. When his own wife falls victim to this mysterious power, the old man takes it upon himself to destroy the glowing object with disastrous results.",
      "tmdbMovieId": 29067,
      "avgRating": 2.75,
      "releaseYear": "1965",
      "numRatings": 74,
      "posterPath": "/aAYlioTJ5RpxfihDhwjBubLYqlf.jpg"
   }
}