{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0329162",
      "video": false,
      "title": "Devil's Pond",
      "recommendations": [
         34681,
         55336,
         34601,
         85495,
         219674,
         121822,
         9925,
         150065,
         15398,
         44862,
         273610,
         18856,
         224950,
         50590,
         72790,
         25451,
         9908,
         13442,
         272602,
         72031
      ],
      "backdrop_path": "/8TvytVUzEkysBHJdXRSbG2aet0R.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mitch",
               "gender": 2,
               "credit_id": "52fe44309251416c91007e93",
               "name": "Kip Pardue",
               "profile_path": "/zWLkC7AodrsZ2jooVMwwBWkAQsB.jpg",
               "id": 65561,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Julianne",
               "gender": 1,
               "credit_id": "52fe44309251416c91007e97",
               "name": "Tara Reid",
               "profile_path": "/9nI9GsV1HZS3YKvMqrGuuEYWr8v.jpg",
               "id": 1234,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe44309251416c91007e9b",
               "name": "Meredith Baxter",
               "profile_path": "/tkX4o5lfV5kS70S5Sy3zOsgKOpx.jpg",
               "id": 13725,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "586576729251412b84022170",
               "name": "Joel Viertel",
               "profile_path": null,
               "id": 1004171,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "586577dc9251412b7d02091f",
               "name": "David Ellis",
               "profile_path": null,
               "id": 1729674,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59435daec3a3686c4001ab92",
               "name": "Matthew Jensen",
               "profile_path": "/o2tgfO4iRxP7L6ApoZpFFVegaZV.jpg",
               "id": 94545,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59435db8c3a3686c590199b3",
               "name": "Louis Febre",
               "profile_path": null,
               "id": 68358,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.375069,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30669,
      "vote_count": 10,
      "budget": 0,
      "overview": "What starts out as a romantic honeymoon on a deserted island turns into a horrible nightmare as Julianne discovers that her new husband is psychotic...",
      "similar": [],
      "original_title": "Devil's Pond",
      "runtime": 92,
      "poster_path": "/5blFqbEKqnC0RAKFzvgTSEozJ6e.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Splendid Pictures",
            "id": 368,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Davis Entertainment Filmworks",
            "id": 37844,
            "origin_country": ""
         }
      ],
      "release_date": "2003-12-16",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joel Viertel"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Alek Lev",
         "Mora Stephens"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0329162/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2OTQyMTQzN15BMl5BanBnXkFtZTcwNTAxNDQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Kip Pardue, Tara Reid, Meredith Baxter | See full cast and crew »"],
      "reviews": [
         "Not bad for the genre, if only because the filmmakers stayed away from the usual cliches. I was thoroughly entertained for ninety minutes without having to stop and think too hard, either about bad plot or bad script and that's all I wanted.",
         "A pretty straightforward basic idea fleshed out with good writing, excellent direction and effective cinematography. Fine performances from Tara Reid and Kip Pardue (truth to tell, I have only seen them in supporting roles until now and never actually noticed either of them before, but this tight story really shows them off). I watch all the thrillers/horror films I can get my eyes on. And I've seen some duds the last couple of years. This one, however, is brilliant (though not as good as What Lies Beneath). Suspense, character development, a script that actually holds water(!)... Come to think of it, a review this positive from me has to be a mistake. Maybe I'd better watch it again in a couple of months to see if it was really that good. In the meantime, I think you should do the same.",
         "I had a difficult time trying to decide whether to watch or not the movie. I mean, it stared Tara Reid! Soon after the plot develops, I found myself paying attention to the events but only because of Tara Reid's intention to act decently. Let's face it, she's not a good actress but at least in this movie she tries to to do it fine. Kudos for her; she tried it at least. After convincing myself that she did a nice effort, the movie delivered a fine surprise for me when it became a thriller about a psychopath husband trying to convince his new hot bride that he really loves her although he stalked her before and well, more twisted situations. True, the acting is not that good (Kip Pardue delivers a fine performance though) and you need proved, talented actors to carry on 90 minutes of an intense dialog; I mean, there are only two characters in the whole movie. The settings are really good and somber, plus the situations ask for a sad atmosphere. Well done for the cinematography and art direction. Overall this is a movie to just watch once and when it airs on cable. It's not a keeper or memorable, but it still deserves a slight chance.",
         "Devil's Pond (2004) I was very surprised when I read all of the terrible remarks on this film. I thought this movie was great. I saw comments remarking that the film must have had a cheap budget because there was a small cast, but that's because the story was about two people all alone in the woods on an island. Who else would be there? I mean come on! Tara Reid gives a great performance. This film is about Julianne (Tara Reid) and her husband Mitch (Kip Pardue). The two are newlyweds and are on their honeymoon on a small island in a cabin. Mitch begins to go insane, and sinks their boat. Since Julianne can't swim, she cannot get off the small island, and as Mitch becomes more and more insane, she realizes that she may not make it off the island ever- and if she does, only one of them are going to be alive. This film reminded me of Misery, and it was very suspenseful and entertaining. 10/10.",
         "A young couple gets married, and goes to honeymoon trip to the woods. Or a small cabin on a lake, whatever - in the middle of nowhere. The new husband turns out to have serious issues with social life, communication and his visions of life are just twisted. Julianne's honeymoon will turn into a true nightmare. She will find herself marooned and chained, the only way out is by swimming after wiping off the obstacles, Mitch being the biggest one. The plot carries on nicely, it's not boring at all, just full of 'goofs', but if that doesn't matter, it's okay entertainment for evening. The biggest goof being how could she not know his boyfriend is a boy fiend indeed? They dated over one year before getting married, and this honeymoon brings out the true husband? The scary thing is, there actually exist people like this, both female and male.. Mitch's behavior is exactly like one from Criminal Minds. In my mind I created a small profile about him, heh.",
         "It's more of a lake than a pond, and if you expect quality you'll have a devil of a time trying to convince yourself that its worth the rental price, but for me its just the type of bad movie that's a real guilty pleasure. Imagine what might happen if a former A&F model playing a redneck psycho stalker manages to get the local hick Britney Spears lookalike, played by an alumnus from \"American Pie,\" to marry him and go on their honeymoon for two weeks to a log cabin on an island out in the middle of a VERY isolated lake within a day's drive of the podunk town they live in. It can be reached only after miles of travel over dusty logging roads. And the cell phone doesn't work out there either. You know there's gonna be trouble. When Britney, still in her wedding dress, climbs into the truck immediately after the ceremony and tells her new cutie to \"get me the f*ck outta here,\" you also know you're in for some wonderfully bad dialog, hammy overacting, bad direction and writing, and lots of lowbrow by the numbers fun. And this flick does not let you down. After a few days when Britney runs out of birth control pills and A&F starts to get weird about wanting to make babies, she might want to end the marriage as quickly as the real Britney did hers, but boy does she have her work cut out for her to do it. This movie is something a community college drama student from say, northern Minnesota, who had seen a lot of Hitchcock movies and decided he could make one just like them might turn out. Cary Grant, James Mason, or Paul Newman our leading man ain't, but the disconnect between his obviously angelic mallrat looks and the manly deer hunting, wife beating, obsessive character he is asked to portray is most of the fun. The rest is laughing at how dense the chick is for winding up out there in the first place, and how once her brain cells start sparking a little she manages to get herself \"the f*ck\" out of the mess she is in. Enjoy. I did. :-)",
         "The plot of this film seemed rehashed from a couple of other thrillers like Misery, The Collector, Single White Female and Sleeping with the Enemy. I give this film a fair rating because I'm an avid thriller fan, otherwise this would be harshly rated. The film has a very standard, unoriginal plot, nearly just like other thriller; A girl is in danger from a guy, and she must try to escape from his clutches, except the location is wholly different, an isolated island. The dialogue comes across as corny at parts. The acting by Tara Reid is pretty awkward at times, but she did a good job. The husband's acting was dull, and I thought him smoking in nearly every scene was annoying and distracting. Although this film is less than 85 minutes, I thought it went for too long. There were some slow scenes throughout. I didn't like how every time she tries to escape and he taunts her, yet she still loves him - though at the end though she fakes it. I mean, from the first fight, she shouldn't even have forgave him. She should've tried to escape from the beginning, really, as there was nothing nice about him. Besides those flaws, the film was pretty suspenseful at parts, which that was helped by the tense and adrenaline pumping score. For a TV film, it did have good scenes of high tension and suspense. It's a fun thriller to watch, although it shouldn't be taken seriously. The whole exotic, yet isolated, setting made it stand out from its predictabilities, clichés and slow scenes. And let's not forget the good direction and suspenseful moments - though it did needed more of those suspenseful scenes.",
         "\"Devil's Pond\" is a simple, straight-forward thriller movie that was a big surprise to me. The story itself is quite simple. Julianne (Tara Reid) is a young woman who marries a man named Mitch (Kip Pardue). The newlyweds take off into the Montana wilderness for a nature-filled honeymoon on a small, secluded island in the middle of a lake. After spending some time on the island, Julianne gets tired and wants to head home, away from the tiny cabin on the island. But Mitch begins to slowly go mad, showing his true colors. Of course, Julianne is terrified of the water and never learned to swim, so she's trapped. After failed attempts at escaping, Mitch's behavior becomes more and more violent, to the point where he has Julianne chained up by her foot. She realizes that she needs to get off the island before one of them loses their lives. Reminiscent of Stephen King's \"Misery\", I found \"Devil's Pond\" to be a well-done thriller. The story was simplistic, but the stylish direction and isolated setting really benefited the film and made it interesting. The acting was decent, Pardue and Reid did a good job, although a few moments came off as a little corny, but it was nothing too major. They are (for the majority) the only characters in the film, and they pull it off pretty well. The audience has sympathy for Julianne, and you're rooting for her through most of the movie as Mitch gets more and more insane. There were some great action sequences, and I thought the final showdown between Mitch and Julianne was very well executed and pretty creatively done. The atmosphere was great, and the whole setting was beautiful. I'm quite familiar with Montana, where the movie was filmed, so I found the imagery and the setting to be rather interesting. I really don't know why everyone has so many problems with this movie, I thought it was an entertaining and all around good thriller. Overall, \"Devil's Pond\" isn't as bad as a lot of people on here are saying that it is. The acting was good (for the most part), the story was well written and interesting, and my attention was held the whole way. If you liked \"Misery\", chances are you'll enjoy this too. This film goes to show you that you don't need a bundle of characters and a complicated story to make a good movie. 8/10.",
         "The name of this flick is so misleading. There's nothing devilish, evil or occult about Devil's Pond, which is why I was disappointed to discover that this was another dime a dozen \"escape!\" thriller film after picking it up at random. But hell, it's nothing too bad at all, which surprised me. This flick has some balls I did not expect it to have at all. However, the viewers of this movie seem to be divided into two factions: those who claim it's quite good, and those who say it sucks donkey testicles. I'll have to say that most of you are wrong, as this is not a great movie, nor is it poor - it's just another average thriller. This is pretty much adequate in all areas, and the plot isn't the best, but it's better than other movies of its ilk by far (The Keeper, blah). The acting is pretty well done, and the script isn't lacking much. The way the plot plays out could've been better, as its execution is not the best, but it works, and it did keep me watching for a solid hour and a half. There are a few obvious plot holes, but they don't detract from the film enough to make it unwatchable. There's nothing here that will bug you too much, so if you're bored, pop it in. That's about all it's good for, but I've certainly seen worse.",
         "There is nothing like a good suspense thriller, and this is nothing like one. Kip Pardue's talent is limited to a few different facial expressions, taking his shirt off once in a while, and having tantrums. Tara Reid has one basic facial expression - like someone has asked her to figure out her bank balance using an abacus with warped beads. She slowly realizes the man she married is a loon, and conveys through acting skills alone that she wonders if she left the porch light on when she left. The opening scene is of Tara smoking a cigarette, which she handles quite convincingly, looking mussed, with a scratch on her jaw. THEN the story starts, from her flashback point of view - the wedding, bride's mom reminding them to be careful on the island, mom's birthday is in a few weeks so be sure to be careful and come back in one piece, preferably with a great gift in hand. I don't know what other pictures, if any, Joel Viertel may have directed, but here's a free tip, Joel -- when you show the main character/victim at the beginning of the movie and the rest is told in flashback, we pretty much KNOW that no matter what happens, she escapes, and in this case with nothing worse than a few bruises, a scratch on her jaw, and a hankering for Marlboros. The isolated island setting is a good plot device until you see in the long shots that the cabin is in FULL VIEW of anyone who may be ambling around the pond. Tara's character also displays the ability to think quickly, a talent she must have developed from taking 16 items into the 10 items or less check out counter. She wants Kip to leave the island so she can plan her escape, so she burns up the WHOLE BOX of matches, clever girl - and Kip has to leave the island to drive to the nearest Piggly-Wiggly for smokes and lights. Tara swings into MacGyver mode and takes action. Then stays there and waits for hubby to come back so they can act some more, I guess. There's not much more to say other than this is a movie about two characters and the incredible match of wits (half-wit vs. dim-wit) between them."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Davis Entertainment Filmworks",
         "Splendid Pictures"
      ],
      "summaries": ["What starts out as a romantic honeymoon on a deserted island turns into a horrible nightmare as Julianne discovers that her new husband is psychotic. Trapped on the island, he has no plans of ever returning to civilization, or even of letting her go. She slowly realizes that only one of them may ever leave the island."],
      "budget": 5000000
   },
   "movielensId": 42659,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-12-16",
      "dvdReleaseDate": "2003-12-16",
      "directors": ["Joel Viertel"],
      "runtime": 92,
      "movieId": 42659,
      "title": "Devil's Pond",
      "mpaa": "",
      "actors": [
         "Kip Pardue",
         "Tara Reid",
         "Meredith Baxter"
      ],
      "imdbMovieId": "0329162",
      "originalTitle": "Devil's Pond",
      "genres": [
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "What starts out as a romantic honeymoon on a deserted island turns into a horrible nightmare as Julianne discovers that her new husband is psychotic...",
      "tmdbMovieId": 30669,
      "avgRating": 2.38889,
      "releaseYear": "2003",
      "numRatings": 9,
      "posterPath": "/5blFqbEKqnC0RAKFzvgTSEozJ6e.jpg"
   }
}