{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "spy",
         "id": 470
      }],
      "imdb_id": "tt0060880",
      "video": false,
      "title": "The Quiller Memorandum",
      "recommendations": [
         55150,
         390253,
         70259,
         79864,
         26038,
         4889,
         35201,
         32050,
         38680,
         43356,
         43260,
         31943,
         16912,
         184129,
         104974,
         210673,
         197605,
         21489,
         45817,
         36191
      ],
      "backdrop_path": "/iyk4lyNGBZmfytrJyFmkkNRk1XJ.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "56f775c692514176210021dc",
         "content": "Oktober, and the trees are stripped bare.\r\n\r\nThe Quiller Memorandum is directed by Michael Anderson and adapted to screenplay by Harold Pinter from the novel \"The Berlin Memorandum\" written by Elleston Trevor. It stars George Segal, Alec Guinness, Max von Sydow and Senta Berger. Music is by John Barry and cinematography by Erwin Hillier.\r\n\r\nThere's no frills and graces about The Quiller Memorandum, it follows a straight spy drama narrative that pitches Segal (excellently cool) into Berlin to unearth the location of some Neo-Nazis. He gets involved with the sensual Berger whilst battling his wits with an insidious Sydow. Location photography is pleasing, as is the swirly score, but even though there's a nice ambiguity to the finale, there's a feeling of disappointment that actually not a great deal has happened in over an hour and half of film. Not dull exactly, and in fact there's enough interest to, well, hold the interest, but for every leanly written passage of play there also comes a yearning to have some espionage pizazz to thrill the senses. 6/10",
         "url": "https://www.themoviedb.org/review/56f775c692514176210021dc"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Quiller",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176d7",
               "name": "George Segal",
               "profile_path": "/oUUcGtlQYC0HMI3yMmO713kDdGT.jpg",
               "id": 18364,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Pol",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176db",
               "name": "Alec Guinness",
               "profile_path": "/nv3ppxgUQJytFGXZNde4f9ZlshB.jpg",
               "id": 12248,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Oktober",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176df",
               "name": "Max von Sydow",
               "profile_path": "/nwRB1DDylWFC4120kfbtPq2pZzA.jpg",
               "id": 2201,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Inge Lindt",
               "gender": 1,
               "credit_id": "52fe46e1c3a36847f81176e3",
               "name": "Senta Berger",
               "profile_path": "/4mTjTsFbPVVXxURqDE2oIQaxW72.jpg",
               "id": 12776,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Gibbs",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176e7",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Weng",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176eb",
               "name": "Robert Helpmann",
               "profile_path": "/sUkwvIhPCL8UeCLoP60ARq3DJ9p.jpg",
               "id": 81463,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Rushington",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176ef",
               "name": "Robert Flemyng",
               "profile_path": "/op5oO4MHBO56aDozThTlbo4dLvG.jpg",
               "id": 41958,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Hengel",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176f3",
               "name": "Peter Carsten",
               "profile_path": "/2jD6MyHdOx0KnXMxf1vDrVlgF9D.jpg",
               "id": 39854,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Grauber",
               "gender": 0,
               "credit_id": "52fe46e1c3a36847f81176f7",
               "name": "Ernst Walder",
               "profile_path": null,
               "id": 134603,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Headmistress",
               "gender": 0,
               "credit_id": "52fe46e1c3a36847f81176fb",
               "name": "Edith Schneider",
               "profile_path": null,
               "id": 47407,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Oktober's Man",
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176ff",
               "name": "Philip Madoc",
               "profile_path": "/xyCIAhCW1986jOD5SxpgaI6x5TZ.jpg",
               "id": 80499,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Oktobers Gefolgsmann",
               "gender": 2,
               "credit_id": "5491fb59c3a36846540023c3",
               "name": "Herbert Fux",
               "profile_path": "/eDIlDlMJ5n438aOPwmO1aTVGoNG.jpg",
               "id": 22531,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Kenneth Lindsay Jones",
               "gender": 2,
               "credit_id": "5491fb6a925141472c002374",
               "name": "Herbert Stass",
               "profile_path": null,
               "id": 38126,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Hassler",
               "gender": 2,
               "credit_id": "583f0c2a925141152100d576",
               "name": "Günter Meisner",
               "profile_path": "/ratLVv6yrmsyViUECpBGWKaY78r.jpg",
               "id": 3617,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176c7",
               "name": "Michael Anderson",
               "profile_path": null,
               "id": 20412,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e1c3a36847f81176cd",
               "name": "Trevor Dudley Smith",
               "profile_path": "/bZm2EYjKjoRDxyr2iUEqLgMjPn2.jpg",
               "id": 67777,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "577b35199251414b6f00073c",
               "name": "Harold Pinter",
               "profile_path": "/zmnvgAEdRzgH1aQ3TwrfqHzy8Hb.jpg",
               "id": 26157,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57b9b140c3a368501500168a",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.45291,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 46041,
      "vote_count": 24,
      "budget": 0,
      "overview": "Two British agents are murdered by a mysterious Neonazi organization in West Berlin. The British Secret Service sends agent Quiller to investigate. Soon Quiller is confronted with Neonazi chief \"Oktober\" and involved in a dangerous game where each side tries to find out the enemy's headquarters at any price.",
      "similar": [
         27576,
         87364,
         954,
         37724,
         646,
         341013,
         36669,
         49517,
         206647,
         691,
         56288,
         253,
         714,
         36670,
         37834,
         36955,
         10764,
         203801,
         238713,
         302699
      ],
      "original_title": "The Quiller Memorandum",
      "runtime": 104,
      "poster_path": "/spMsYKX6WKn5e7wunLURHzwwpuB.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Rank Organisation",
            "id": 364,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ivan Foxwell Productions",
            "id": 20826,
            "origin_country": ""
         }
      ],
      "release_date": "1966-11-10",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Anderson"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Trevor Dudley Smith",
         "Harold Pinter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0060880/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzODk5OTgxMl5BMl5BanBnXkFtZTcwMjEwNzkzMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: George Segal, Alec Guinness, Max von Sydow | See full cast and crew »"],
      "reviews": [
         "This isn't your average James Bond knockoff spy thriller; the fact that the screenplay is by playwright Harold Pinter is the first clue. It's a bit strange to see such exquisitely Pinter-esque dialogue (the laconic, seemingly innocuous sentences; the profound silences; the syntax that isn't quite how real people actually talk) in a spy movie, but it really works. Quiller isn't your average spy. He's played by George Segal with a cool superficiality that works very nicely; he doesn't go charging in with guns blazing -- he doesn't even carry a gun -- and the one time he does try to fight his way out of a sticky spot, he gets pounded. The other standouts in the cast are Alec Guinness as Quiller's controller, and Max von Sydow as the leader of the neo-Nazi cell that Quiller is attempting to crack. At first glance, the movie is deeply frustrating, and the script appears full of holes, but in fact, it's so smart that it assumes the audience is bright enough to pick up on the breadcrumb trail of clues that it's actually leaving. All in all, I recommend it, but with reservations. If you like tidy conclusions and have limited patience with extreme subtlety, this may not be to your taste.",
         "THE QUILLER MEMORANDUM (3 outta 5 stars) The 1960s saw a plethora of two kinds of spy movies: the outrageous semi-serious James Bond ripoffs (like the Flint and Matt Helm movies) and the very dry, methodical ones that were more talk than action (mostly John Le Carre and Alistair MacLean adaptations). This is one of the better examples of the talky thrillers. Not that the movie is boring... there is lots of good, cat-and-mouse dialogue courtesy of playwright Harold Pinter. George Segal plays the hero, an undercover spy who goes to West Berlin to find out who killed his predecessor... who was on the trail of modern-day Nazis. Segal has surprisingly little difficulty in finding himself right in the thick of things... being captured and drugged by the baddies... and even having time for a romance with a German schoolteacher who may know more than she lets on. Parts of the movie reminded me a lot of the classic \"The Third Man\"... which I think the director was trying to emulate at times. Well, this is not quite a classic of that caliber but it is a very well-written and smoothly-paced \"old school\" thriller. Segal makes a very cool lead... witty and sarcastic, yet with a vulnerable side, too.",
         "An almost unrecognizable George Segal stars in \"The Quiller Memorandum,\" set in Berlin and made 40 years ago. Segal is a very young man in this, with that flippant, relaxed quality that made him so popular. This time he's a spy trying to get the location of a neo-Nazi organization. The cast is full of familiar faces: Alec Guinness, who doesn't have much of a role, George Sanders, who has even less of one, Max von Sydow in what was to become a very familiar part for him, Robert Helpmann, Robert Flemyng, and the beautiful, enigmatic Senta Berger. This is a very good spy movie. Spy movies were the \"in\" thing in the '60s. This one doesn't have gadgets and goes more for subtlety. The last 30 minutes are tense and exciting, and the last scene, loaded with subtext, is just great.",
         "How did I miss this film until just recently? What a difference to the ludicrous James Helm/Matt Bond (or is it the other way round?) movies. The Cold War atmosphere in Germany at the time was perfectly captured. I was there with the British Armed Forces from Jan 1961 until Sept 1964, and remember it well, and old memories came flooding back. Not that I was a spy, but the first thing we were told on our arrival in Germany was that we were only there to give the Yanks an extra six minutes to prepare for, and retaliate to, a nuclear attack. Just how we were supposed to do that no one knew. Then we were told (as people tell their kids today) not to talk to strange men. Presumably they meant Communists. In the British Section of West Germany, everything appeared normal, but the claustrophobic atmosphere of Berlin with the Wall and checkpoints ever present, was different. There was always the feeling of paranoia, of someone watching you. This movie brought it all back. I'm well aware that \"The Quiller Memorandum\" was not a perfect representation of reality, but it's a damn sight closer to it than \"Goldfinger\" and all other similar types of pap. Spying is mostly a secretive, lonely occupation in which James Bond and Matt Helm wouldn't last a minute.",
         "This film has special meaning for me as I was living in Berlin during the filming and, subsequent screening in the city. Mind you, in 1966-67 the Wall was there, East German border guards and a definite (cold war) cloud hanging over the city. I loved seeing and feeling the night shots in this film and, as it was shot on location, the sense of reality was heightened for me. Very eerie film score, I believe John Barry did it but, I'm not sure. George Segal was good at digging for information without gadgets. A bit too sardonic at times, I think his character wanted to be elsewhere, clashing with KGB agents instead of ferreting out neo-nazis. I feel this film much more typified real counter espionage in the 60's as opposed to the early Bond flicks (which I love, by the way). Senta Berger was gorgeous! And, the final scene (with her and Segal) is done extremely well (won't spoil it for those who still wish to see it...it fully sums up the film, the tension filled times and cold war-era Germany). Also contains one of the final appearences of George Sanders in a brief role, a classic in his own right!",
         "This isn't your standard spy film with lots of gunplay, outrageous villains, and explosions. It's a more realistic or credible portrayal of how a single character copes with trying to get information in a dangerous environment. The characters and dialog are well-written and most roles are nicely acted. I found it an interesting and pleasant change of pace from the usual spy film, sort of in the realm of The Spy Who Came in From the Cold (but not quite as good).",
         "Released at a time when the larger-than-life type of spy movie (the James Bond series) was in full swing and splashy, satirical ones (such as \"Our Man Flynt\" and \"The Silencers\") were about to take off, this is a quieter, more down-to-earth and realistic effort. Segal plays a secret agent assigned to ferret out the headquarters of a Neo-Nazi movement in Berlin. His two predecessors were killed off in their attempts, but he nevertheless proceeds with headstrong (perhaps even bullheaded) confidence without the aid of cover or even a firearm! His investigations (and baiting) lead him to a pretty schoolteacher (Berger) who he immediately takes a liking to and who may be of assistance to him in his quest. Before long, his purposefully clumsy nosing around leads to his capture and interrogation by a very elegantly menacing von Sydow, who wants to know where Segal's own headquarters is! When drug-induced questioning fails to produce results, Segal is booted to the river, but he isn't quite ready to give in yet. He recruits Berger to help him infiltrate the Neo-Nazis and discover their base of operations, but, once again, is thwarted. Finally, he is placed in the no-win position of either choosing to aid von Sydow or allowing Berger to be murdered. The film illustrates the never-ending game of spying and the futility that results as each mission is only accomplished in its own realm, but the big picture goes on and on with little or no resolution. Segal is an unusual actor to be cast as a spy, but his quirky approach and his talent for repartee do assist him in retaining interest (even if its at the expense of the character as originally conceived in the source novels.) Guinness appears as Segal's superior and offers a great deal of presence and class. Von Sydow (one of the few actors to have recovered from playing Jesus Christ and gone on to a varied and lengthy career) is excellent. He brings graceful authority and steely determination to his role. His virtual army of nearly silent, oddball henchmen add to the flavor of paranoia and nervousness. Berger is luminous and exceedingly solid in a complicated role. Always under-appreciated by U.S. audiences, it's a relief to know that she's had a major impact on the German film community in later years. Special guests Sanders and Helpmann bring their special brand of haughty authority to their roles as members of British Intelligence. The film magnificently utilizes West German locations to bring the story to life. Widescreen viewing is a must, if possible, if for no other reason than to fully glimpse the extraordinary stadium built by Hitler for the 1936 Olympic games. The film has that beautiful, pristine look that seems to only come about in mid-60's cinema, made even more so by the clean appearance and tailored lines of the clothing on the supporting cast and the extras. By day, the city is presented so beautifully, it's hard to imagine that such ugly things are going on amidst it. Composer Barry provides an atmospheric score (though one that is somewhat of a departure from the notes and instruments used in his more famous pieces), but silence is put to good use as well. Is there another film with as many sequences of extended, audible footsteps? Fans of \"Willy Wonka and the Chocolate Factory\" will notice that film's Mr. Slugworth (Meisner) in a small role as the operator of a swim club (which features some memorably husky, \"master race\" swimmers emerging from the pool.) The film's screenplay (by noted playwright Pinter) reuses to spoon feed the audience, rather requiring that they rely on their instinct and attention span to pick up the threads of the plot.",
         "Other viewers have said it all: it is a good movie and more interestingly it is a different kind of spy movie. It is credible. The shooting on location in Berlin makes it that much more thrilling. Good acting. Fantastic last 30 minutes where I have rarely felt so tense so the suspense was intense: great chase in the streets of Berlin but in a different way from James Bond... Definitely worth seeing. You won't be disappointed. Final note: there is no stupid romance to spoil the film. The ending in itself contributes to the film's value (you will see). My vote: 8 / 10.",
         "Very satisfying spy flick which, if it grabs you, may haunt you for a long time. Perfect and slightly ironic ending. Excellent musical score too.",
         "Having just read the novel, it's impossible to watch this without its influence and I found the screen version incredibly disappointing. I'm generally pretty forgiving of film adaptations of novels, but the changes that were made just do not make sense. George Segal's Quiller isn't intense, smart, calculating--qualities Quiller is known for--instead he comes across as a doofus by comparison, better suited to sports-writing or boxing, completely lacking in cunning. The original, primary mission has been completely omitted. Inga is unrecognizable and has been changed to the point of uselessness. Visually, the film was rather stunning, but the magical soft focus that appears every time Inga is in the frame is silly. It's not my intention to be obnoxious and list every point in the movie that strays from the book, but it's truly a shame that such well-crafted material--intriguing back stories, superior spy tactics--is wasted here. Really sad. A much better example of a spy novel-to-film adaptation would be Our Man in Havana, also starring Alec Guinness."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Rank Organisation, The",
         "Ivan Foxwell Productions"
      ],
      "summaries": [
         "Two British agents are murdered by a mysterious Neonazi organization in West Berlin. The British Secret Service sends agent Quiller to investigate. Soon Quiller is confronted with Neonazi chief \"Oktober\" and involved in a dangerous game where each side tries to find out the enemy's headquarters at any price...",
         "After two British agents are assassinated in Berlin by a group of neo-Nazis, the British Secret Service assign Quiller to locate and identify the culprits. He accepts the assignment and almost immediately finds that he is being followed. He begins openly asking question about neo-Nazis and is soon kidnapped by a man known only as Oktober. The neo-Nazis want to know the location of British operations and similarly, the British want to know the location of the Nazis' headquarters. Quiller befriends a teacher, Inge Lindt, whose predecessor at the school had been arrested for being a neo-Nazi. For Quiller, it's a question of staying alive when he's not in possession of all of the facts.",
         "In the 60's, in Berlin, two British agents that are investigating a Neonazi ring are murdered. The Chief of the Secret Service Pol summons the efficient agent Quiller to investigate the location of organization's headquarter. He contacts the teacher Inge Lindt expecting to get some clues to be followed and soon he is abducted the the leader Oktober and his men. Oktober also wants to know the location of the British base in Germany and uses drugs in Quiller to get the information but the skilled agent resists. Quiller has a love affair with Inge and they seek out the location of Oktober. When they find, Quiller gives the phone number of his base to Inge and investigates the place. But soon he finds that she has been kidnapped and Oktober gives a couple of hours to him to give the location of the site; otherwise Inge and him will be killed. What will Quiller do?"
      ],
      "budget": 0
   },
   "movielensId": 42679,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1966-11-10",
      "dvdReleaseDate": "2006-11-07",
      "directors": ["Michael Anderson"],
      "runtime": 104,
      "movieId": 42679,
      "title": "The Quiller Memorandum",
      "mpaa": "",
      "actors": [
         "George Segal",
         "Alec Guinness",
         "Max von Sydow",
         "Senta Berger",
         "George Sanders",
         "Robert Helpmann",
         "Robert Flemyng",
         "Peter Carsten",
         "Ernst Walder",
         "Edith Schneider",
         "Philip Madoc",
         "Herbert Fux",
         "Herbert Stass",
         "Günter Meisner"
      ],
      "imdbMovieId": "0060880",
      "originalTitle": "The Quiller Memorandum",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "FbLIbIXYxHc",
         "iveB1P_FPT0"
      ],
      "plotSummary": "Two British agents are murdered by a mysterious Neonazi organization in West Berlin. The British Secret Service sends agent Quiller to investigate. Soon Quiller is confronted with Neonazi chief \"Oktober\" and involved in a dangerous game where each side tries to find out the enemy's headquarters at any price.",
      "tmdbMovieId": 46041,
      "avgRating": 3.14286,
      "releaseYear": "1966",
      "numRatings": 7,
      "posterPath": "/spMsYKX6WKn5e7wunLURHzwwpuB.jpg"
   }
}