{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nepal",
            "id": 485
         },
         {
            "name": "himalaya",
            "id": 486
         },
         {
            "name": "trek",
            "id": 157156
         },
         {
            "name": "yak",
            "id": 225244
         }
      ],
      "imdb_id": "tt0210727",
      "video": false,
      "title": "Himalaya",
      "recommendations": [
         209496,
         124475,
         66070,
         104349,
         52216,
         8901,
         54919,
         22161,
         41951,
         280075,
         13730
      ],
      "backdrop_path": "/A9yAa5ImLPprtHwGMaPnS8xNtUq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tinle",
               "gender": 0,
               "credit_id": "52fe451ac3a368484e048aed",
               "name": "Thilen Lhondup",
               "profile_path": "/pPr4K0y94w7AHEXOCR8LWuNd9M7.jpg",
               "id": 992796,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Karma",
               "gender": 0,
               "credit_id": "52fe451ac3a368484e048af1",
               "name": "Gurgon Kyap",
               "profile_path": "/sO6M0GvkdmZzdW30nLbeJERK7dp.jpg",
               "id": 992797,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Pema",
               "gender": 0,
               "credit_id": "52fe451ac3a368484e048af5",
               "name": "Lhakpa Tsamchoe",
               "profile_path": "/z43d44Xxq8bToSGMOtWcsPhmFgG.jpg",
               "id": 14594,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Norbou / Urgien",
               "gender": 0,
               "credit_id": "52ff9273c3a368400f022abe",
               "name": "Karma Tensing Nyima Lama",
               "profile_path": "/np6LfbrurjPdJ8mD0SzWZnoFcyS.jpg",
               "id": 1293100,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Passang",
               "gender": 0,
               "credit_id": "52ff92a8c3a3683ff202161c",
               "name": "Karma Wangiel",
               "profile_path": "/AwaU7MKmKTvWSSjyA0NPXqtTOFG.jpg",
               "id": 1293101,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Labrang",
               "gender": 0,
               "credit_id": "59d69507c3a368189200000b",
               "name": "Labrang Tundup",
               "profile_path": null,
               "id": 1900602,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Jampa",
               "gender": 0,
               "credit_id": "59d69511c3a36818e3000009",
               "name": "Jampa Kalsang Tamang",
               "profile_path": null,
               "id": 53621,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Rabkie",
               "gender": 0,
               "credit_id": "59d6951d9251416740000044",
               "name": "Tsering Dorjee",
               "profile_path": null,
               "id": 1900603,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Tundup",
               "gender": 0,
               "credit_id": "59d69547c3a368193e000048",
               "name": "Rapke Gurung",
               "profile_path": null,
               "id": 1900604,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Tensing",
               "gender": 0,
               "credit_id": "59d69551925141678600006d",
               "name": "Pemba Bika",
               "profile_path": null,
               "id": 1900605,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Meme / Paljor",
               "gender": 0,
               "credit_id": "59d6955e9251416740000094",
               "name": "Karma Chhewang",
               "profile_path": null,
               "id": 1900606,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Chopga",
               "gender": 0,
               "credit_id": "59d695aec3a36818f0000090",
               "name": "Tenzen Charka",
               "profile_path": null,
               "id": 1900607,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Dawa",
               "gender": 0,
               "credit_id": "59d695b992514167400000ee",
               "name": "Yangzom",
               "profile_path": null,
               "id": 1900608,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Chewan",
               "gender": 0,
               "credit_id": "59d695c2c3a368193e0000c1",
               "name": "Gyalsen Gurung",
               "profile_path": null,
               "id": 1900609,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Deld",
               "gender": 0,
               "credit_id": "59d695cc92514167970000d0",
               "name": "Phuti Bika",
               "profile_path": null,
               "id": 1900610,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Angmo",
               "gender": 0,
               "credit_id": "59d695d5c3a36818d20000dd",
               "name": "Sangmo Gurung",
               "profile_path": null,
               "id": 1900611,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Karma's father",
               "gender": 0,
               "credit_id": "59d695e4925141674c0000fb",
               "name": "Karma Angbo Gurung",
               "profile_path": null,
               "id": 1900612,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe451ac3a368484e048ae9",
               "name": "Eric Valli",
               "profile_path": "/w430tGiahvIpl8MHVtAxBQN3woM.jpg",
               "id": 147024,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "59d69474c3a3685bcd001f16",
               "name": "Michel Debats",
               "profile_path": null,
               "id": 1707515,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "59d69480925141384e001f68",
               "name": "Nathalie Azoulai",
               "profile_path": null,
               "id": 1900600,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59d6948bc3a3685c26001fe3",
               "name": "Olivier Dazat",
               "profile_path": null,
               "id": 24888,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59d69492c3a3685bcd001f42",
               "name": "Eric Valli",
               "profile_path": "/w430tGiahvIpl8MHVtAxBQN3woM.jpg",
               "id": 147024,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59d6949e925141380c001f14",
               "name": "Louis Gardel",
               "profile_path": null,
               "id": 27723,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59d694abc3a3685c6a001e94",
               "name": "Jean-Claude Guillebaud",
               "profile_path": null,
               "id": 1900601,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.664181,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "NP",
            "name": "Nepal"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 26813,
      "vote_count": 23,
      "budget": 0,
      "overview": "As the denizens of a Tibetan village prepare for their arduous annual trek to exchange salt for grain, the community's allegiances are split between aging chieftain Tinle (Thilen Lhondup) and rebellious young Karma (Gurgon Kyap). Tinle tries to maintain his clout and preserve obedience to ancient customs when Karma challenges the old man's power.",
      "similar": [
         248450,
         85,
         272,
         253412,
         11678,
         116745,
         7350,
         978,
         16436,
         5137,
         281190,
         21736,
         10946,
         341366,
         59248,
         9103,
         318279,
         19606,
         133441,
         7797
      ],
      "original_title": "Himalaya - l'enfance d'un chef",
      "runtime": 108,
      "poster_path": "/oN5eHMZIdtPeDWUMaqCVyp2i0NX.jpg",
      "spoken_languages": [{
         "name": "",
         "iso_639_1": "bo"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Galatée Films",
            "id": 793,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Les Productions de la Guéville",
            "id": 17873,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Productions JMH",
            "id": 19289,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Antelope Films",
            "id": 95810,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "National Studio Limited (Katmandu)",
            "id": 95811,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bac Films",
            "id": 208,
            "origin_country": ""
         }
      ],
      "release_date": "1999-01-01",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Eric Valli",
         "Michel Debats"
      ],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Nathalie Azoulai",
         "Olivier Dazat"
      ],
      "originalLanguage": "Tibetan",
      "imdbLink": "http://www.imdb.com/title/tt0210727/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzE4MjI5ODgxNl5BMl5BanBnXkFtZTYwMjUwMDk4._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Thilen Lhondup, Gurgon Kyap, Lhakpa Tsamchoe | See full cast and crew »"],
      "reviews": [
         "One reviewer asks if we (Westerners) can ever see the world through another's (non-Westerner) eyes. Good question. There's no 'yes' or 'no' answer because we can't get into people's heads. The cultural viewpoint from the standpoint of the actor in the cultural setting is always different from the outsider. As intruders into that world, we can observe, wonder and learn. Yes, indeed like voyeurs, my friend but these are not \"primitive\" people. These are people who have adapted to a way of life and developed means of coping with it. Since many of these people live isolated lives, the cultural diffusion of technology invades their worlds slowly. (We anthropologists see this fact as a mercy) This film is a wonder. As one reviewer asks, can we watch a film for over a 100 minutes of people walking? It depends. What do you want? Adventure? Rent a Hollywood spawn with phony chases, lots of CGI and god-awful writing. This is a simple story but one basic to the human condition. Loss, death, coming of age, transition, love and resurrection. This film is full of archetypes but without the contrived devices found in so many Western films. The adventure is that of the daily lives of these people who live always on the edge. It is most unfair to judge this simple tale and its depiction from the same viewpoint of another mythic journey. There's only the violence of nature and the triumph of human will to survive-- not happily ever after, but just for another day. As an anthropologist who spent over 25 years working with pastoralists (nomadic herders) in Africa, Central Asia, South America and the Middle East, I was delighted with this unpretentious story. I never worked with yak or reindeer [I highly recommend the exceptional \"Pathfinder\" for an excellent view of the Lapps]herders and the presentation certainly squared with everything I've read about these dynamic, wonderful people.",
         "This film is simply beautiful to watch. The cinematography is absolutely stunning, the music and directorial mood is captivating. The film is light on plot and the little bit of intrigue sort of fades away, but that really doesn't matter. I have been to the Himalayas (Tibet, Nepal and Bhutan) and it is really hard to capture the exquisite beauty of the place and the grace of the Buddhist people who dwell there. This film captures that beauty and grace. If you have any interest in that part of the world and its people, this film will hold your attention and inspire your imagination. How? I don't know, perhaps some of that Himalayan magic rubbed off on the film crew.",
         "I have climbed up a glacier in New Zealand and down a mountain in Switzerland, and it was rough going for a middle-aged film critic. However, truly rough it can be if you're old, live in the Himalayas, and need to spend a couple of weeks taking your yak and salt to get some grain for winter survival. Photographer Eric Valli's beautiful epic film `Himalaya' is the first Nepalese film to be nominated (in 1999) for an Academy Award for Best Foreign Language Film. It is also a heroic fable of a small community's struggle to change the guard from old to young and retain the respect of the gods. The simple plot, told in every culture that has any notion of the grandeur of place and power, may deceive some into thinking this a small cliched film. It is rather a grand design of human struggle and triumph, figuratively and realistically represented in the salt caravans that still traverse the majestic Himalayan Mountains in Tibet. When one of the caravans tries to cut off 4 days by attempting a route reserved for the devils, the ensuing danger as yaks and humans walk the narrow path is so beautiful and harrowing that my glacier experience looks now like a picnic. Blue sky above, blue water below, and a path so dangerous indeed the gods themselves would have second thoughts. Valli's cinemascope is the perfect medium to catch the overpowering mountains and miniscule stones, both instruments of the terrible powers those gods still wield in this other world. The actors are handsome locals, and the story is right out of Shakespeare and Howard Hawks. See this film before you get too old to breathe its artistic air.",
         "If you believe film should be an artform, then you'll love Himalaya. As the director states in the bonus audio track, the production team did not identify and write to a \"target market\" when developing the screen writing, they did not follow the dreary Hollywood \"recipe\" for film-making, and, most importantly, they did use non-actors to portray almost all the lead and back-up roles. Tinle, the lead character, is a treasure. The first time I viewed the movie, I thought, 'what a wonderful actor.' His timing is exact yet unpredictable, his personality forceful, his face is exquisite, his form unique and authentic. A natural, I thought. Indeed, he plays himself in a quasi-autobiography, and what a wonderful character he is. This is a movie about an ancient civilization we are losing and, sadly, will soon be lost. Really, its a documentary, and, as the director states, will certainly be used by future historians as a visual artifact of what is soon to become the lost Dolpo civilization of Nepal. The soundtrack conditions you to this heartbreaking reality. The movie is successful on many levels: a mother's lost love (who hasn't seen her adult child since he was eight); a loving grandfather/grandson relationship, which is painfully lost; a wife who loses her husband, and a young boy who loses his father then attempts to make sense out of the loss; a young religious man who chooses the 'difficult' path over the easy monastic life; a classic confrontation between generations; and an old man whose entire life is built on strength, perseverance, and admiration, but then who ultimately must let go of it all to those who are destined to succeed him. I loved this movie. It made me think of my mother, an artist, whom I miss dearly. Himalaya is a work of art.",
         "The film, set in a remote Himalayan village in Nepal, is gorgeous start-to-finish, a labor of love by those who made it over a long period of time. The cinematography gets a lot of good \"press,\" and rightfully so, but what I really enjoyed was the soundtrack. I expected the good visuals, and got them, but I didn't expect such wonderful music. As for the look, it's different, with rugged barren mountain village terrain and snow-topped Himalayas in background, although we don't enjoy those until almost 50 minutes into the film. What's really different, however is the fact the film employed no professional actors. These were real people of that area! They also faces you won't soon forget. As for the story, the treks don't begin until 45 minutes has gone by in the film. You have to be patient. Much of that first part, people argue back and forth on the merits of making the trip and who would and should be going. Finally, we wind up with two separate camps: the younger guy \"Karma\" and his crowd and the older man, \"Tinle,\" who takes his son, grandchild and his mother,and mainly older friends of the stubborn old coot of a leader. Old man Tinle does nothing but bitch and moan most of the movie but people do their share of complaining to him, too. Yet, I found nobody unlikable for some strange reason. Most of the time, nobody in this village appears happy. These people must love to argue! As one man say, speaking of Tinle: \"Trying to talk to him is like trying to stop the snow from falling.\" I liked the following: when asked why he changed his mind about going on the trip with Tinle, his son and lama-artist \"Norbou,\"\" told his father, \"After you left the monastery, I remembered what one of my masters said: \"when two paths open up before you, always take the hard one.\" I also thought the yaks were fascinating. . I'd like to know more about them after watching this movie. Overall, it's a dramatic and touching adventure story. that will reward you if you can hang with it for first three-quarters of an hour. It also will make you grateful you weren't born in this part of the country.",
         "I had the privilege of seeing this film in a theater. Thus the magnificent panoramas and astounding beauty of the mountains and people can be fully appreciated. The movie is about the essential trek in life: about the passing of the torch from one generation to another. It revolves about the essential aspects of life, and also of its circular nature (the past is always related to the present and future). What is truly awesome is the magnificent level of acting that the Director obtained from true mountain people. All of the film is awesome, but the journey on the path by the border of the lake is a high point in the film. Coming from a mountain country myself, and also enjoying trekking, I found many parallels between the quest of these Nepalese and the quality of people I find up in the high Andes. No doubt there's more wisdom as regards life from the people many consider \"backward\" as opposed to those we feel are \"civilized\". Not to be missed.",
         "This film is about conflict & mistrust between generations. Walking is the minor element. The mutual mistrust between the 2 generations were very well portrayed. Although there was an obligatory change from mistrust to mutual respect, the story is still very convincing and gripping. The film almost seemed like a documentary of the villagers' life, which is what makes the film even more interesting. The location of filming were really stunning. The scenery of the barren mountains and snowy mountains were totally breathtaking. This film may be boring for some people, but for people interested in the Tibetan culture, this is a film for you.",
         "I'm glad I've seen this one at the movie theater! Such a beautiful piece of photography will, of course, look great on the TV, too. And the story is by no means secondary: a warm tale of human endurance, indeed. But watching those images of Nepal on the big screen was just something I thank heavens I was able to do! Delightful!",
         "~Some spoilers~ It stands as a sweet, poignant story of a simple life of hardship, strife, and the necessity of growing up and enduring. Against a backdrop of superstition vs. pragmatism, a village elder's [Tinle's] hatred and need for revenge stem from the death of his first son -- a death he blames on the son [Karma] of another family whose ancestors had bad blood with him and his own. In his stubbornness, he consults the star charts for guidance on when depart on a caravan through the mountains to trade their livelihood (salt), rather than following the urging of Karma, who departs with most of the young men of the village 4 days before him in an effort to avoid late season storms. Tinle asks his second son -- a lama who knows only how to paint and pray -- to help the rest of them voyage over the mountain pass to trade for their livelihood. Initially refusing, the priest later reconsiders, remembering something he was once taught: \"when presented with two paths, always choose the harder one\". This speaks to me of the value of life as a journey rather than a destination: the value of striving and failure (even it does seem ludicrously impractical as *general* advice). Though some of the members of the second caravan are too old or too young to make the journey, stubbornness and need drive Tinle onward, even through a treacherous shortcut through a winding trail high above a mountain lake, as well as stormy snowdrifts in a high mountain pass. Tinle's grandson [Passang?], orphaned now and destined to be the chief in the future, learns much from his mother and Tinle before and during the journey. He takes comfort in the knowledge of the afterlife, that lives are ended and reborn in an eternal cycle. This story, while to me not a tragedy, has a similar fiery cleansing effect because it presents life with such purity and urgency -- that of an ancient legacy. There is need and striving, pain and endurance, and compassion. Most of all, there is reconciliation and epiphany: Tinle breaks his circle of hatred and manages to forgive before he dies, finally coming to terms with his grief and putting the good of the tribe ahead of need to blame someone for his son's death. He is healed. Karma, having never really returned Tinle's spite, learns that there may be more to the superstitious old ways than meets the eye: sometimes there are hidden merits to tradition, even though they seem pointless on the surface. The most memorable moments are at the end of the film. When Tinle collapses, his life spent, Karma says, \"I've sometimes dreamt that you were my father.\" It's touching that his shield of love never let him be deeply wounded by Tinle's long-standing grudge and unrelenting hatred. And Tinle reconciles, showing that his eyes are open, at last, with true insight: \"You're too much like me to be my son. A real chief always starts by disobeying.\" This speaks to me of the need for a strong will, but more: the need to learn through failure. Karma says, \"We're almost there. We can't part now that we've just met\". Indeed, they truly have just met, in a heartfelt, significant way. Finally, Tinle says, \"We've always been together. We wanted the same thing\": such simple words, but so appropriate and regal. When Tinle dies, his very young grandson Passang seems to accept it, saying, \"Let him go. He's going to find my father in Padmasambhava's paradise.\" Is this not a powerful testimony to our urgent need to believe in an afterlife? -- if not just to comfort ourselves, but also our children when they confront the reality of death for the first time -- knowing that lives don't just end pointlessly, the valued soul lost forever to oblivion. But rather that the spirit lives on and is treasured by the world, or by someone who cares. The film's epilogue is symbolic of the main story: The embracing wings of the birds and the sheltering boughs of the trees, which are finally seen for the first time at the end of the journey, symbolize paradise and redemption. And we, the pinnacle of evolution, are left to try to make sense of it all -- to serve the rest of the living world -- perhaps to only rationalize our existence, such as through prayer and painting -- and to mimic and harvest from the land of our birth. It's a soul-wrenching, beautiful agony to experience this film, with its touching and appropriate music, and its painted fresco at the end that celebrates the tapestry of lives spent in strife, loyalty, and perseverance. It's the story of the most formative journey in a leader's childhood, immortalized and revered.",
         "I don't rate movie's at a ten lightly so when thinking about what to rate this Cinematic experience (it's not just movie or film) but i will refer to it as that from here on, i was going to give it an 8 or 9 but the more i thought about it the more i realized that the only reason for this would be that it's not a film that fits into the top ten watch and say wow films and just because it hasn't won as many awards as lord of the rings (which i love and probably is'nt as good as this) doesn't mean that it has to affect how good this movie really is. Watching this movie is like watching the sun rise or watching the love of your life sleeping next to you, when you see something like that it just hits you with wonder. It has beautiful people with very interactive character personalities, very good acting (even by the yaks ha ha) it makes you wonder if they are just being themselves, nearly ever line in this movie has meaning, lines like \"stop praying and lets go\" makes this movie so much more human. A lot of the characters especially Karma have a lot more of a \"western\" way about them than what you would expect and that is probably another thing about this movie that gives it even more attraction to the western type audience. The camera work and locations are just the right balance to make you forget your watching a movie and think your on holidays in the mountains, the music and sounds are also just the right touch. If this was a big budget jerry bruckheimer or oliver stone movie this would have gotten the attention it deserves (but probably wouldn't be as good ha). I probably enjoyed this movie even more by not expecting much from it i didn't even want to see it (i wanted to see star wars) Any movie that makes you feel that you would love to be one of them and give up your x-box and trek through the snow has to be good. This is definitely one of those movies you have to put in your WATCH BEFORE YOU DIE pile."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Galatée Films",
         "France 2 Cinéma",
         "Les Productions de la Guéville"
      ],
      "summaries": ["An aging chief's last stand, lessons for the new, and the education of a young chief-to-be played against harsh Nature in Nepal's Dolpo. When his son dies returning from Tibet's salt lakes, Tinle blames Karma, his son's friend, refuses to give Karma his blessing as the new chief, and organizes a rival caravan to take the salt to lower Nepal to trade for grain. He, a few old men, his son's widow, his grandson, and his second son, a monk, set out on the arduous journey. Fearing storms, Karma has led his caravan out of the village before the auspicious day ordained by the lamas. Tinle's group catches Karma's before the final pass; the two stubborn men lock wills with Tinle's grandson watching."],
      "budget": 0
   },
   "movielensId": 4312,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": "2002-03-05",
      "directors": [
         "Eric Valli",
         "Michel Debats"
      ],
      "runtime": 108,
      "movieId": 4312,
      "title": "Himalaya",
      "mpaa": null,
      "actors": [
         "Thilen Lhondup",
         "Gurgon Kyap",
         "Lhakpa Tsamchoe",
         "Karma Tensing Nyima Lama",
         "Karma Wangiel",
         "Labrang Tundup",
         "Jampa Kalsang Tamang",
         "Tsering Dorjee",
         "Rapke Gurung",
         "Pemba Bika",
         "Karma Chhewang",
         "Tenzen Charka",
         "Yangzom",
         "Gyalsen Gurung",
         "Phuti Bika",
         "Sangmo Gurung",
         "Karma Angbo Gurung"
      ],
      "imdbMovieId": "0210727",
      "originalTitle": "Himalaya - l'enfance d'un chef",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["tEvd-s2vkyc"],
      "plotSummary": "As the denizens of a Tibetan village prepare for their arduous annual trek to exchange salt for grain, the community's allegiances are split between aging chieftain Tinle (Thilen Lhondup) and rebellious young Karma (Gurgon Kyap). Tinle tries to maintain his clout and preserve obedience to ancient customs when Karma challenges the old man's power.",
      "tmdbMovieId": 26813,
      "avgRating": 3.9029,
      "releaseYear": "1999",
      "numRatings": 345,
      "posterPath": "/oN5eHMZIdtPeDWUMaqCVyp2i0NX.jpg"
   }
}