{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "hollywood",
         "id": 12396
      }],
      "imdb_id": "tt0100395",
      "video": false,
      "title": "Postcards from the Edge",
      "recommendations": [
         31052,
         41003,
         9941,
         2075,
         12714,
         10551,
         13818,
         10168,
         34014,
         13574,
         50116,
         2321,
         18169,
         18129,
         25221,
         8130,
         12151,
         36288,
         31640,
         26686
      ],
      "backdrop_path": "/sQQbOVcrM2QLvt1w0UqnbhmDLi2.jpg",
      "revenue": 39071603,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Suzanne Vale",
               "gender": 1,
               "credit_id": "52fe4440c3a368484e018501",
               "name": "Meryl Streep",
               "profile_path": "/uyalVm3tH5DaUoxCmvILS9sUFsR.jpg",
               "id": 5064,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Doris Mann",
               "gender": 1,
               "credit_id": "52fe4440c3a368484e018505",
               "name": "Shirley MacLaine",
               "profile_path": "/faG5S4EOVaGHNf1CwZryGcHCE4e.jpg",
               "id": 4090,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Jack Faulkner",
               "gender": 2,
               "credit_id": "52fe4440c3a368484e018509",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lowell Kolchek",
               "gender": 2,
               "credit_id": "52fe4440c3a368484e01850d",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Doctor Frankenthal",
               "gender": 2,
               "credit_id": "52fe4440c3a368484e018511",
               "name": "Richard Dreyfuss",
               "profile_path": "/7JPMhXnfY5jgPbtByutwkHHZS3M.jpg",
               "id": 3037,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Joe Pierce",
               "gender": 2,
               "credit_id": "52fe4440c3a368484e018515",
               "name": "Rob Reiner",
               "profile_path": "/2zw9Iq9uo4vZiTQNQWdNFwbA1TA.jpg",
               "id": 3026,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Grandpa",
               "gender": 2,
               "credit_id": "52fe4440c3a368484e018519",
               "name": "Conrad Bain",
               "profile_path": "/PIrcDMGAhceckOWTz9S3KdnAOH.jpg",
               "id": 124007,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Evelyn Ames",
               "gender": 1,
               "credit_id": "52fe4440c3a368484e01851d",
               "name": "Annette Bening",
               "profile_path": "/q8pCSQzGLrhgtVXBKzMnwfoeBlH.jpg",
               "id": 516,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Simon Asquith",
               "gender": 2,
               "credit_id": "52fe4440c3a368484e018521",
               "name": "Simon Callow",
               "profile_path": "/pOABmGHa7h1CQ1oG4Q6PyuCbwqL.jpg",
               "id": 4001,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Grandma",
               "gender": 1,
               "credit_id": "52fe4440c3a368484e018531",
               "name": "Mary Wickes",
               "profile_path": "/eVNN8YtXFYGGO7uzaA7SqlVFe63.jpg",
               "id": 20624,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Neil Bleene",
               "gender": 2,
               "credit_id": "55ee22a4c3a3682c6b015897",
               "name": "Oliver Platt",
               "profile_path": "/an9n3aUKFAN50GDsbqwIkvWlcus.jpg",
               "id": 17485,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4440c3a368484e0184fd",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4440c3a368484e018527",
               "name": "Carrie Fisher",
               "profile_path": "/oVYiGe4GzgQkoJfdHg8qKqEoWJz.jpg",
               "id": 4,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4440c3a368484e01852d",
               "name": "Carrie Fisher",
               "profile_path": "/oVYiGe4GzgQkoJfdHg8qKqEoWJz.jpg",
               "id": 4,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5864ed3bc3a36852c001e0c4",
               "name": "Michael Ballhaus",
               "profile_path": "/pMto0iHZb67YaSP9cTgKbAPcaYU.jpg",
               "id": 3769,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5ac2cd880e0a260c4d029a2d",
               "name": "Sam O'Steen",
               "profile_path": null,
               "id": 12015,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.744925,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22414,
      "vote_count": 75,
      "budget": 22000000,
      "overview": "Substance-addicted Hollywood actress Suzanne Vale is on the skids. After a spell at a detox centre her film company insists as a condition of continuing to employ her that she live with her mother Doris Mann, herself once a star and now a champion drinker. Such a set-up is bad news for Suzanne who has struggled for years to get out of her mother's shadow, and who finds her mother still treats her like a child. Despite these problems - and further ones to do with the men in in her life - Suzanne can begin to see the funny side of her situation, and it also starts to occur to her that not only do daughters have mothers, mothers do too.",
      "similar": [
         188222,
         10218,
         599,
         74643,
         294016,
         8012,
         11176,
         157851,
         7446,
         856,
         509,
         2118,
         59436,
         371638,
         313369,
         277547,
         270487,
         17057,
         427900,
         1826
      ],
      "original_title": "Postcards from the Edge",
      "runtime": 101,
      "poster_path": "/gwP68DUIxTj3OrZT88LQDnMO6hr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1990-09-12",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Having a wonderful time, wish I were here.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Nichols"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Carrie Fisher",
         "Carrie Fisher"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100395/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTIwODY5NzY5NF5BMl5BanBnXkFtZTYwMjc0Mjg4._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Meryl Streep, Shirley MacLaine, Dennis Quaid | See full cast and crew »"],
      "reviews": [
         "Great performances by Meryl Streep and Shirley MacLaine. They are both hilarious and poignant in this Carrie Fisher story about a show business daughter coming through the process of working out emotional trauma and baggage in relation to her mother, upbringing and subsequent addiction problems. Also especially good is Gene Hackman in a small supporting role and a cameo by Rob Reiner. Streep and MacLaine carry this film with their talents and are very entertaining as they confront each other and themselves about personal flaws and foibles. What makes this work so well is the smart and oblique humor that is employed to address the internal pain of the main character. I also liked the little jabs at the movie industry itself as well as its nonchalant way of revealing some of it's visual tricks too. One particular touching and bittersweet scene is between Hackman (as movie director) as he comforts Streep (an actress he's working with) with a sort of lighthearted understanding and encouragement to overcome her drug addiction as he builds her up with appreciation of her talent. Considering the obvious autobiographical nature of this story for Fisher, it would appear to be sort of a catharsis for her. She does a good job in bringing painful personal issues to light with humor through her writing. Personal pain and demons often seem to be the source of great art and entertainment as well as amusement for many artists and through their art, for the rest of us as well. This is a case in point and definitely worth the time.",
         "Postcards From The Edge is one of my all-time favorites. It's a truly addictive movie that's always funny and touching no matter how many times I see it. Some of the criticism I've read have always seemed just a tad off base, particularly the ones that say that Streep never seems to get a handle on her character--she just acts kind of comically frazzled. Well I think that's the point, isn't it? Streep as Fisher doesn't know what she wants or who she is, and while trying to discover these things, she must battle her drug dependence, rebuild her career against all odds and hope, in addition to trying to reconcile her relationship with her outlandishly domineering mother, who just happens to be a legendary star with issues of her own. In this scenario, \"frazzled\" would seem to be the way to go. In any case, those who have commented positively on the movie have mostly mentioned the great performances (as well as Carrie Fisher's wonderful screenplay), and rightly so since this is one the most smartly acted (and well-written) movies you will ever see. But it seems strange that the outstanding direction of Mike Nichols is rarely mentioned. I remember one Oscar ceremony when a producer whose movie had just won Best Picture, and, indeed, swept all the major awards--except Best Director--said \"apparently the Academy thinks that the actors directed themselves.\" It would seem that many of the viewers of Postcards From The Edge think the same thing. In my opinion, Nichols doesn't get enough credit for the seamless way this movie moves or for the crispness of the comic timing. At every turn, he brings out the best in his actors, most especially in the dynamic scenes involving Streep and McLaine. I also love the way he shows, through shifting background effects, how movie illusions are created, which he further uses to illustrate how we often hide our true motivations. (The great example of this is in the scene on the lot with Streep and Dennis Quaid where he was trying to convince her he has always been sincere in his feelings for her--and maybe they should even marry. Then suddenly the background, a house and white picket fence cardboard front, is moved away by a production crew.) This is a wonderfully entertaining movie, brilliantly acted and written and, yes, superbly directed.",
         "Luke Skywalker is not the only member of the Star Wars gang with parent issues. Carrie Fisher, the actress who played Princess Leia, channeled hers into a novel that became another winning Mike Nichols domestic comedy, \"Postcards From The Edge.\" Meryl Streep stars as Carrie alter-ego Suzanne Vale, a once-successful actress trying to restart her career after a near-fatal O.D. Her mother, a screen legend in her day named Doris Mann (Shirley MacLaine), happily takes on the responsibility of overseeing Suzanne's recovery, especially given the attendant oversight she gets on daughter's life and career. \"I really hate that you have to go through this,\" Doris sighs upon visiting her daughter in the rehab clinic. \"I wish I could go through this for you.\" MacLaine gives, frame for frame, the best performance in the film, one of her best ever. She and Streep seem to feed off the best aspects of each other's prior screen work, Streep picking up on MacLaine's sass and comedic chops, MacLaine on the way Streep can give you a sea of sadness through just a flickering gleam in her eyes. Streep's comedy turn is the big surprise here, especially given how successfully she pulls it off. No dingoes running off with babies in this production. Nichols helps by putting her in situations that are very un-Streepish, like being threatened by cheesy \"Scarface\" extras or inhaling Fritos. Whatever the props, Meryl herself makes me laugh, something I never expected. Not that she lays back. Her gift for inhabiting others' skin is on fine display, as she gives Suzanne Carrie Fisher's wry intonations and wan half-laugh. You can hear the connection on the DVD commentary; a candid, amusing piece by Fisher in which she explains the background of \"Postcards,\" why she considers it \"emotionally autobiographical\" in the way it deals with her own past drug issues and especially her relationship with her movie-star mother, Debbie Reynolds. At the same time, it's fictional in many key details. Fisher's clever Hollywood-dream-factory send-up of a script gives MacLaine and Streep plenty of great lines that pop off the screen like cherry bombs. \"Instant gratification takes too long,\" Suzanne whines. \"I know you don't take my dreams seriously, even when I predicted your kidney stones,\" crows Mom. The film does get rather pat in the second half, especially when both bond by rounding on Suzanne's ancient grandmother (Mary Wickes). Given that Suzanne's the central character, and the one with the drug problem, more effort should have been made on exposing her flaws and weaknesses, rather than making her seem the most normal character in the story. Fisher makes this point herself in her commentary, wishing she was \"tougher\" on Suzanne. \"Postcards\" is most effective when it focuses on the paradox of how these people perform so well in the limelight and so clumsily outside of it. \"We're designed more for public than for private,\" is how Suzanne puts it at one point. Some comments here complain of too many musical numbers, but of course entertaining is what these women live for. Watching Suzanne watch her mother sing \"I'm Still Here\", realizing for an instant that a throwaway line in the song is really a cry of pain over Suzanne's way of life, and finally responding, silently but in a nakedly emotional way, communicates all you need to know about how much these two people love each other, beneath their banter and blame. Such subtle touches allow Streep, MacLaine, and Nichols to keep the longer dialogues crisp and funny. You may have a hard time understanding the lives these people lead, but you will enjoy their company.",
         "This is easily one of the best American films of the 90s and certainly one of the best screenplays of the last 50 years. Carrie Fisher writes dialogue like nobody else in show business and she outdoes herself with this semi-biopic about her life growing up in the biz with her actress Mom, Debbie Reynolds. The film is loosely based on the novel of the same title by Fisher, and I say \"loosely\", because Nichols asked Fisher to re-write several parts to make them more \"film-friendly\". The book is more about drug addiction and the character of the mother (played brilliantly by Shirley MacLaine) is barely involved. The film focuses (smartly) on the relationship between mother and daughter and Maclaine and Streep have a field day and create some of the most memorable mother-daughter scenes in American cinema history, thanks to the able direction of Mike Nichols. Dennis Quaid is also wonderful as the narcissistic drug addicted man that plays with Streep's character's emotions. This is one of my all time favorite films, it's the only film on my top 10 list made in the last 25 years, and will be remembered for generations to come as the gem that it is. The screenplay is so amazing that about 80% of the dialogue is totally quotable and can be repeated ad nauseum to the delight of its fans (and annoyance of their relatives and significant others). Wonderful cameos from everyone from Mary Wickes, Rob Reiner, Gene Hackman, Annette Benning, Oliver Platt and more...if you can get your hands on the DVD with Carrie Fisher commentary, it's just as hilarious as the film itself. The woman is a genius and it's a crime she wasn't nominated (or won) an Oscar for Best Screenplay for this film.",
         "Meryl Streep, cast against type in a comedic role plays Suzanne Vale, an actress struggling with drug addiction and a difficult relationship with her alcholic has-been singer/actress mother played by Shirley McClaine. The film starts with Vale, making a film, high as a kite and making a mess of her scenes, then she overdoses and is put into rehab. Following her rehab stint, she is forced to live with her mother in order to be able to keep her job on a new film. Her mother tells her that she is making all the wrong career moves, stays up all night waiting for to come home from a date and generally otherwise makes her life very difficult. I won't give away anymore of the plot than that. Streep and McClaine are amazing here, and suprisingly, Streep can sing, very well.",
         "A really wonderful, funny and sad film with bravura performances by Streep, MacLaine, Quaid and a hilarioius cameo by Annette Benning (\"they give you and endolphin rush!\"). One of Streep's best performances and won of the many Oscars she should have won but was passed over for. This film holds up each time I see it.",
         "Meryl Streep is just about the best actress around and this, I think, is one of my favourite performances by her. (so far). Why? Because she is not playing her usual self -- she is a total nut case in this film --- neurotic and downright hilarious. Much like 2002's \"Adaption\" she is playing against her normal dramatic type and is a wonderful comedienne -- a role she should play more often --- actresses usually playing actresses usually are not memorable --- this is a \"keeper\" role --- and what a voice. (had she not been an actress, she could give most singers these days a run for their money!) Do rent it and laugh --- it is worth the trip to the video store!",
         "Debiee Reynolds/Carrie Fisher or MacLaine/Streep? It doesn't really matter. A comedy that swims around a theme without ever getting anywhere. To see Streep and MacLaine together is enough to make this a collector's item. The cheerful side of the Ingrid Bergman/Liv Ullman grim Ingman Bergman \"Autumn Sonata\" I know that Carrie Fisher with her American wit was telling us something, something personal but did it have to be so shallow? There is nothing about this characters with a hint of depth. Drugs and alcohol part of a culture in permanent denial. Maybe that's what it is. We're witnessing the replicas of what used to be human beings. The hurt is so flimsy. He may have told a million women that they smelled like Catalina, so what? Didn't she notice the phoniness in Dennis Quaid's smirk? I had to rush and see \"Plenty\" and stare into Meryl Streep's face to be reminded of her greatness. Not that she's bad here, not at all, she's wonderful, it's the character that made me recoil in horror. Okay, enough of that. the combination of MacLaine and Streep is terrific and the film will keep you entertained even if, like in my case, will leave you with a toxic aftertaste.",
         "This is a very addictive movie. It got me hooked on its genuine and rich characters, sassy and intelligent dialogue that made fun of a serious subject. The performances were spectacular, not only by Streep and Maclaine, but also by the veteran Mary Wickes, Dennis Quaid and Robin Bartlett as Aretha (\"my parents expected me to be black\"). All of the cameos were enjoyable and added SO much to this fabulous film. It's refreshing to see Streep do something where you don't need to buy out a store's tissue supply to get through the movie. And Maclaine shines as this disturbed yet determined matriarch. I like almost everything about this film. Especially the singing at the end, and Maclaine's rendition of \"I'm Still Here\" Great Movie!",
         "Postcards from the Edge (1990) Mike Nichols is as close to a William Wyler as the New Hollywood (post-1967) gives us. His movies are both impeccable and emotionally taut. They feature the very best production values and impressive acting. And they take chances carefully, which isn't actually an oxymoron. Nichols knows he's pushing boundaries, but within the established forms. Even this movie, with its insider look at Hollywood, feels ingenious in a safe way, with echoes of \"The Bad and the Beautiful\" but with everyone toned down to a perfect realism. One of the tricks of this movie, which is a little over the top in so many small ways (again, careful restraint all around), is keeping the acting believable. And foremost is Meryl Streep, lovable and sympathetic but not quite admirable or otherworldly the way older generation actresses so often get portrayed. Streep as a drug-troubled actress is a wonder, and right behind, with deliberate hamminess, is the woman playing her mother, Shirley MacLaine. Add Gene Hackman and Richard Dreyfuss in smaller roles, a cameo by Rob Reiner, and a pretty boy role for Dennis Quaid, and you can see there is something cooking here. So why isn't this a great movie? It has the trimmings of greatness, even beyond the acting. Story by Carrie Fisher, music written by Carly Simon (and performed by the cast). Photography by German import Michael Ballhaus (who by the 1990s was also working for Coppola and Scorcese). Well, some might say it really is great. Even though it is lightweight, even airy as a farce, and even though it leaves you only slightly glad, or happy, at the end rather than transformed, you could argue that Nichols intended something with this flavor, and achieved it. Could be. But for a simple example, take his second movie, \"The Graduate,\" and notice the same tone, humor and irony laced with important topical and emotional strains. How different the effect there, and maybe for a couple of reasons. One, I think, is the subject matter here is the famously glib, plastic, unsympathetic world of overly rich, tabloid saturated Hollywood itself. Another is the inherent plot. What happens? A woman overcomes her addiction to star in another movie, and she seems to move a little forward in her relationship with her mother. Enough? Maybe not. But knowing it's not trying to change the world, you might appreciate the illusory nature of the medium, exposed for us in a whole bunch of different ways (moving props, back projection, doubles used for blocking and framing, lights and camera in action, screening rooms and overdubbing, and so on. This is the stuff behind the drama enacted by Streep and MacLaine and the rest. It's worth watching in its own right. And Nichols and Ballhaus have filmed this to glossy perfection, layering and moving and keeping the long takes going as long as possible (with an apology by Hackman, as a movie director, to Streep, the actress playing the actress, for using such long takes all the time). It's almost as if Nichols is making fun of himself, and the excesses that cause the cast and crew to go a little crazy. Brilliant and entertaining? Completely. Probing or socially satirical in any way? No, not even into Hollywood, which is safely behind all these layers. Still, a film not to miss."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": ["Substance-addicted Hollywood actress Suzanne Vale is on the skids. After a spell at a detox centre her film company insists as a condition of continuing to employ her that she live with her mother Doris Mann, herself once a star and now a champion drinker. Such a set-up is bad news for Suzanne who has struggled for years to get out of her mother's shadow, and who finds her mother still treats her like a child. Despite these problems - and further ones to do with the men in in her life - Suzanne can begin to see the funny side of her situation, and it also starts to occur to her that not only do daughters have mothers, mothers do too."],
      "budget": 22000000
   },
   "movielensId": 4318,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-09-12",
      "dvdReleaseDate": "2001-05-01",
      "directors": ["Mike Nichols"],
      "runtime": 101,
      "movieId": 4318,
      "title": "Postcards from the Edge",
      "mpaa": "R",
      "actors": [
         "Meryl Streep",
         "Shirley MacLaine",
         "Dennis Quaid",
         "Gene Hackman",
         "Richard Dreyfuss",
         "Rob Reiner",
         "Conrad Bain",
         "Annette Bening",
         "Simon Callow",
         "Mary Wickes",
         "Oliver Platt"
      ],
      "imdbMovieId": "0100395",
      "originalTitle": "Postcards from the Edge",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["gSm7CJNzEFY"],
      "plotSummary": "Substance-addicted Hollywood actress Suzanne Vale is on the skids. After a spell at a detox centre her film company insists as a condition of continuing to employ her that she live with her mother Doris Mann, herself once a star and now a champion drinker. Such a set-up is bad news for Suzanne who has struggled for years to get out of her mother's shadow, and who finds her mother still treats her like a child. Despite these problems - and further ones to do with the men in in her life - Suzanne can begin to see the funny side of her situation, and it also starts to occur to her that not only do daughters have mothers, mothers do too.",
      "tmdbMovieId": 22414,
      "avgRating": 3.23417,
      "releaseYear": "1990",
      "numRatings": 837,
      "posterPath": "/gwP68DUIxTj3OrZT88LQDnMO6hr.jpg"
   }
}