{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "schizophrenia",
            "id": 222
         },
         {
            "name": "telepathy",
            "id": 1475
         },
         {
            "name": "brain",
            "id": 2588
         },
         {
            "name": "national security agency (nsa)",
            "id": 3635
         },
         {
            "name": "crime boss",
            "id": 9730
         },
         {
            "name": "fbi agent",
            "id": 18525
         }
      ],
      "imdb_id": "tt0339785",
      "video": false,
      "title": "Thoughtcrimes",
      "recommendations": [
         2703,
         219575,
         64523,
         116008,
         181756,
         51933,
         18451,
         142322,
         38986,
         70408,
         69007,
         27444,
         16405,
         241432,
         17836,
         64049,
         40836,
         34469,
         39467,
         19827
      ],
      "backdrop_path": "/8cP7m1o5sf4dKL1xSYinDdaMBF7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Freya McAllister",
               "gender": 1,
               "credit_id": "52fe462a9251416c7506f60f",
               "name": "Navi Rawat",
               "profile_path": "/neAo8dukxSDh5Hn1Gjqi8nkz1aD.jpg",
               "id": 43778,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Brendan Dean",
               "gender": 2,
               "credit_id": "52fe462a9251416c7506f613",
               "name": "Joe Flanigan",
               "profile_path": "/9IY41CgC8Wd53YqFMafSFfJ4sbN.jpg",
               "id": 26066,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dr. Michael Welles",
               "gender": 2,
               "credit_id": "52fe462a9251416c7506f617",
               "name": "Peter Horton",
               "profile_path": "/uq9ry9LRU2yn63LigCQFkB07CCY.jpg",
               "id": 44990,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jon Harper",
               "gender": 2,
               "credit_id": "52fe462a9251416c7506f61b",
               "name": "Joe Morton",
               "profile_path": "/5adJxjbFX2GeuTTCNqc9dg4Twgx.jpg",
               "id": 3977,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "June McAllister",
               "gender": 0,
               "credit_id": "52fe462a9251416c7506f61f",
               "name": "Jocelyn Seagrave",
               "profile_path": null,
               "id": 77653,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe462a9251416c7506f625",
               "name": "Breck Eisner",
               "profile_path": "/axuZves3hOQYb5R8OnmIcrO6IOH.jpg",
               "id": 52609,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "542337030e0a263b6e001fe1",
               "name": "Thomas Dean Donnelly",
               "profile_path": null,
               "id": 53297,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56cf5b4f9251413e6d0034cb",
               "name": "Joshua Oppenheimer",
               "profile_path": null,
               "id": 1582866,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.950406,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14942,
      "vote_count": 19,
      "budget": 0,
      "overview": "Freya McAllister suddenly starts hearing voices in her head on the night of her High School Prom. One night Dr Michael Welles arrives telling Freya that she isn't crazy but that her voices are the thoughts of everyone around her. He teaches her to turn her telepathic powers into a powerful gift. What he doesn't say is that he works for the National Security Agency...",
      "similar": [
         8838,
         9802,
         8836,
         273481,
         10538,
         10431,
         13027,
         261023,
         4349,
         3595,
         302401,
         1632,
         38322,
         3509,
         293310,
         13515,
         11859,
         18502,
         12476,
         9740
      ],
      "original_title": "Thoughtcrimes",
      "runtime": 86,
      "poster_path": "/8ufPNq1qu5yG4GQsnqLrnUNf3PX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "USA Network",
         "id": 16642,
         "origin_country": ""
      }],
      "release_date": "2003-01-01",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "In a fight against crime, her mind is their most valuable weapon.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Breck Eisner"],
      "runtime": 89,
      "synopsis": "Freya McAllister (Navi Rawat), an ordinary teenage girl finds her life is never the same after her prom night when she starts to hear voices. After eight years in soiltary madness in Brookridge Mental Hospital, diagnosed as a schizophrenic, a Dr Michael Welles (Peter Horton) arrives and explains that she isn't crazy. The voices are not her imagination, she is telepathic. Dr Welles teaches her to control her ability and she is able to regain a somewhat normal life. However Dr Welles works for the National Security Agency and they want Freya to help them in the fight against the danger's to the country's security. Teaming up with agent Brendan Dean (Joe Flanigan) they attempt to foil an assassination plot, however she's been ordered not to reveal her powers to her new partner.",
      "writers": [
         "Thomas Dean Donnelly",
         "Joshua Oppenheimer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0339785/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNzAyNjg1MV5BMl5BanBnXkFtZTcwMDYzMzYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Navi Rawat, Joe Flanigan, Peter Horton | See full cast and crew »"],
      "reviews": [
         "In 1994, in her high school prom, Freya McAllister (Navi Rawat) starts to hear voices in her head, is declared schizophrenic and sent to a mental institution. She is treated by Dr. Michael Welles (Peter Horton), who is sponsored by the National Security Agency (NSA), and along the treatment, he tells her that she in not crazy, but indeed she has powerful telepathic skills, being unique in the world. Nine years later, she is assigned by NSA to work with agent Brendan Dean (Joe Flanigan) in New York, chasing together the dangerous terrorist Cazal, whose identity is unknown by the secret service. What a great surprise this excellent movie was for me! Yesterday, when I decided to watch \"Thoughtcrimes\", I was expecting a common movie just for killing time. However, the intriguing story hooked my attention until its very end. The beginning of the film is a sort of \"Nikita\" or \"Firestarter\", but the story works very well. Navi Rawat and Joe Flanigan show excellent chemistry, the characters are very well developed, the screenplay has no flaws and certainly is an attractive entertainment for fans of action movies. My vote is eight. Title (Brazil): \"Crimes Premeditados\" (\"Premeditated Crimes\")",
         "Thought Crimes arrived on the UK DVD market without much fanfare. I rented it, expecting a cheap B-movie. What I got was a very enjoyable story. I've since shown it to friends, who unanimously agree about its virtues. The story is about a girl who unwillingly receives telepathic powers. She can hear other people's thoughts. After being driven mad by it, she gets picked up by a mysterious scientist, who trains her to develop her powers, and target them. Soon, she is asked to assist in helping with an investigation. The movie is well-written, and many pathways for sub-plots and story lines are opened. Some are closed, but quite a few remain open, suggesting that this was meant to start a series. It's a thrilling movie, with a fairly original concept, dramatic moments that are convincing without getting too sappy and crucially, a sense of humour. It is comparable to Wheddon's various series (Firefly, Buffy et al) in its qualities. (Except for one deplorably bad line of dialogue in a crucial scene near the end) In terms of the acting, most people do a fairly good job. The male NSA agent / hero lays on the charme a bit thick, but I suspect the script forced that anyway. Maybe I just dislike male good-looking actors. I highly recommend this movie for light entertainment purposes. It's more original and enjoyable than most big Hollywood movies these days, and it deserves a larger audience (and a spin off TV series!)",
         "When I first rented Thoughtcrimes, I thought I was going to get one of the usual B-level Orwell knockoffs. The opening did not help much, given that it screams to the rafters that this film was intended as a television pilot. However, in this day when Chris Carter can drag out a series to ten seasons in spite of running out of ideas in the first, or when Joss Whedon can gain a reputation as a guru in spite of putting the audience members most like his characters to sleep, Thoughtcrimes would have made for one hell of a television series. In contrast to Serenity, in fact, it makes a very watchable feature film. Thoughtcrimes kicks off with a setting right out of a teenie soap drama. We even get a mother (I think) telling her daughter that sixty-five percent of prom dates end in sex. I always thought it was closer to ninety-eight percent, but what the hey. Unfortunately for Freya, sex turns out to be the least of her worries that evening when she suddenly becomes aware that she can hear the thoughts of everyone else in the hall. From there, we fastforward through the local mental hospital (mis)treating her for several years until one day, a doctor by the name of Michael Welles takes over her case and starts training her to control her telepathy. It is this point that earns the show five points right off the bat. We have all seen science fiction films in which telepathic characters can simply project their thoughts and ideas into the minds of others, or read the minds of others. To my knowledge, I have never before seen a film or television series featuring psychic or telepathic characters in which said characters have to struggle to come to terms with their gift, as some call it. Even the recent X-Men adaptations, which strike me as the pinnacle of a story about \"those who are different\" on film, did not invest this much effort into the pre-mastery element of the story. There is one moment in the film when Brendan, the more conventional hero of the piece, expresses anger at having his authority superseded by a girl who looks like she is barely out of school. Welles' response is to play him a MiniDisc of thousands of voices all layered over the top of each other. This, he tells Brendan, is what Freya has endured for the best part of a decade. Never, in all the years I have seen films trying to deal with the subject of how the mentally ill, autistic, or just plain neurologically divergent live, have I seen the film hit the nail on the head so hard without even trying. Sometimes, I wonder if certain elements of the psychiatric profession did not slip a few bucks to the right people to keep this pilot from becoming a series, or becoming a wide-release film. It graphically shows how out of touch the medical profession, even those on the proverbial final frontier, have become with the \"first, do no harm\" philosophy that has guided medicine for thousands of years. There is some contention as to whether government agencies such as the NSA would be better at addressing the needs of Aspies or High-Functioning Autistic individuals, but Freya's attempt to escape also inadvertently highlights that those of us on this final frontier are in such a desperate situation that we need to take help wherever we can get it. If these demonstrations are intentional, then kudos to the writer and director for making them. Like all television pilots, however, it does suffer a few weaknesses. Plot tangents such as the process of Freya reconciling with her sister are left loose, and we never get a definitive answer as to the fate of the main villain. Joe Morton, on the other hand, makes a good possibly-evil leader simply because the character is written to suggest he is quite ambivalent, and Morton is proficient enough to take advantage of such writing. Joe Flanigan is competent, but this episode allows his character little chance to be anything other than a frustrated straight arrow, and he as an actor does nothing to fight it. Jocelyn Seagrave plays June McAllister in a very 90210-esque spoiled teen style in spite of the fact that the character has apparently put herself through law school. The real surprise is Navi Rawat as Freya. We Aspies have a saying that goes something like \"if this guy is not an Aspie, he is doing a great job of impersonating one\". Navi does such an awesome job of impersonating a schizophrenic and later a telepath during this piece that she should have won an Oscar at the least. With the right agent, she would be unstoppable. I gave Thoughtcrimes an eight out of ten. It is not perfect, but it is a great way to spend ninety minutes. I thoroughly recommend it to anyone who knows what it is like to fall through the cracks of the current health system. And that is probably the best recommendation I can make.",
         "I just saw 'Thought Crimes' and was very impressed. The plot was well written and the characters were very fleshed out, in part, due to the fact that we could hear what most of them were thinking. I think as the movie progressed, we found out what it was like for Freya to come to terms with her gift, and because she was more at ease with it, we were able to see some of the less serious aspects of mind reading. \"Scooby dooby doo, where are you, we got some work to do now...\" Rare is the TV-Movie that captures the perfect blend of action/drama/humor, but I think 'Thought Crimes' really hit the nail on the head. 10/10",
         "An excellent all round film, from its storyline to its cast. It has elements of X-Men meets Alias. The story runs well taking you from the very beginning to a mouthwatering 'want more' ending. All the characters have their own identities and allow you to understand their feelings and emotions without the need for the usual complex and barely believable plot twists to explain seemingly unnecessary plot rollercoasters. From early on you get very comfortable with the characters and find them very easy to follow and understand, the actors and actresses making this very easy. Special mention must go to Joe Flanagan, (Stargate Atlantis fans will recognise him) who plays a real feeling cop instead of the usual leading Robocop character who never puts a foot wrong, also Peter Horton, (from Sideout and 30something fame) who manages to balance compassion with trying to do the right thing for all people. Give this film a chance, you will not be disappointed; just nervous stood in a crowd the next day with your thoughts running through your mind. Would you want everyone knowing what you were thinking?",
         "This movie wastes no time on long, forced-in background stories, you get right into it and you'll figure everything out as you go. It managed to make me watch it without looking away, checking the runtime or even pausing it for a bathroom break. The acting is just as good as the fast-paced storyline, the characters are played realistic, humane and compelling. Nothing is overdramatised neither handled too casually. You don't realize they're acting, and that's exactly the way it should be done in this type of movie. There's nothing about this movie I didn't like, except for the fact that, like all movies, it had an end.",
         "Thought Crimes is a very powerful drama that also provides enough action for action movie fans. This movie is certainly well thought out, extremely well directed with a cast that fits the movie perfectly. I don't want to sound like the movie starts out slow because it really doesn't. Its captivating from the beginning and keeps building momentum all the way to its finish. The very last scene also leaves room for a sequel. In fact, thats why I'm at this site. I'm hoping to find its sequel. If you haven't seen this movie, I highly recommend it. Its a riveting movie and fit for all but the younger preteen audience. This is certainly a 5 star movie! Its worth renting at the video store or purchasing it for your DVD collection!",
         "Recommended. The movie has a strange start; the kind I don't get to watch in a lot of other movies. It's blunt, straight to-the-point to what happened, and where the story is going to take off from. I recall watching the same kind in a recent Hindi movie called 'Zinda' (that had a completely different story and theme, by the way). Also noted by another viewer, one of the aspects that make this movie different is that within the first 15 minutes of the movie, you know that the central character isn't going to discover her strengths on her own; but she needs assistance. Had they not done that, it would have become yet another 'gifted' story. Overall, I liked the movie, and had a good feeling after watching it. There are many loose ends in the story that have been left unexplored, but hey, nobody's complaining. Navi Rawat has looked great in the movie, by the way.",
         "Thought Crimes is a serviceable action programmer -- not bad, but nothing special -- notable mainly for giving its attractive star, Navi Rawat, her first leading role. Rawat plays a telepathic girl overwhelmed by the cacophony of voices in her head and wrongly hospitalized as insane. Psychiatrist Peter Horton rescues her from the hospital and trains her to control her powers, quiet and focus the multiple voices, and become a powerful mind reader. But he doesn't tell her he works for a government intelligence agency that wants to use her in its investigations, and when she learns that she distrusts him and flees. Misunderstandings are overcome; she works with Joe Flanigan, her new partner at the agency, to detect and prevent a terrorist assassination plot; and she is eventually reconciled with her estranged sister, Jocelyn Seagrave. The film plays as though it is a pilot for a television series, and it would function well to set up Rawat and her supporting characters for continuing thought crime adventures. The best and most adventuresome thing about it, however, is the casting of Rawat and Seagrave in non-ethnic, non-\"exotic\" roles.",
         "A really amazing movie I just saw on the USA channel. It has many twists and turns and it really has the drama, action and thrills all in one film. It is about a girl who is gifted who reads minds who ends up saving lives by the end. She learns to use her power which ultimately makes her a one of a kind hero. I really enjoyed how realistic the movie really was. This is the kind of movie that you feel a part of. If anyone has seen 'Taking Lives' then you'd absolutely love this one. The beginning tells Freya's struggle on realizing that she is telepathic and later on accepting that she is gifted. She ends up becoming part of the NSA in Ny solving crimes by reading peoples minds. This is the movie that will leave you guessing till the very end."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": ["USA Network"],
      "summaries": [
         "Freya McAllister suddenly starts hearing voices in her head on the night of her High School Prom. From then on her future ends and she is diagnosed as a violent schizophrenic and committed to a mental hospital where she spends the next eight years of her life in mental madness. One night Dr Michael Welles arrives telling Freya that she isn't crazy but that her voices are the thoughts of everyone around her. He teaches her to turn her telepathic powers into a powerful gift. What he doesn't say is that he works for the National Security Agency...",
         "In 1994, in her high-school prom, Freya McAllister (Navi Rawat) starts to hear voices in her head, is declared schizophrenic and sent to a mental institution. She is treated by Dr. Michael Welles (Peter Horton), who is sponsored by the National Security Agency (NSA), and along the treatment, he tells her that she in not crazy, but indeed she has powerful telepathic skills, being unique in the world. Nine years later, she is assigned by NSA to work with agent Brendan Dean (Joe Flanigan) in New York, chasing together the dangerous terrorist Cazal, whose identity is unknown by the secret service."
      ],
      "budget": 0
   },
   "movielensId": 43292,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-01-01",
      "dvdReleaseDate": "2009-05-04",
      "directors": ["Breck Eisner"],
      "runtime": 86,
      "movieId": 43292,
      "title": "Thoughtcrimes",
      "mpaa": "",
      "actors": [
         "Navi Rawat",
         "Joe Flanigan",
         "Peter Horton",
         "Joe Morton",
         "Jocelyn Seagrave"
      ],
      "imdbMovieId": "0339785",
      "originalTitle": "Thoughtcrimes",
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["VCFicaw_i3A"],
      "plotSummary": "Freya McAllister suddenly starts hearing voices in her head on the night of her High School Prom. One night Dr Michael Welles arrives telling Freya that she isn't crazy but that her voices are the thoughts of everyone around her. He teaches her to turn her telepathic powers into a powerful gift. What he doesn't say is that he works for the National Security Agency...",
      "tmdbMovieId": 14942,
      "avgRating": 3.32143,
      "releaseYear": "2003",
      "numRatings": 14,
      "posterPath": "/8ufPNq1qu5yG4GQsnqLrnUNf3PX.jpg"
   }
}