{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jurors",
            "id": 1417
         },
         {
            "name": "government",
            "id": 6086
         },
         {
            "name": "right and justice",
            "id": 6145
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "courtroom",
            "id": 33519
         }
      ],
      "imdb_id": "tt0094082",
      "video": false,
      "title": "Suspect",
      "recommendations": [
         19345,
         83714,
         31633,
         9930,
         42176,
         31618,
         10868,
         10859,
         26789,
         57834,
         47892,
         12235,
         11060,
         34014,
         10083,
         4639,
         37753,
         11221,
         31696,
         4916
      ],
      "backdrop_path": "/z4GZWUQ6UZgYz7DtdaDTYzijpJa.jpg",
      "revenue": 18782400,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Kathleen Riley",
               "gender": 1,
               "credit_id": "52fe450a9251416c75049a1d",
               "name": "Cher",
               "profile_path": "/nLi4qPXWEuhjc31bmbeINLVZ8zS.jpg",
               "id": 38225,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eddie Sanger",
               "gender": 2,
               "credit_id": "52fe450a9251416c750499e7",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carl Wayne Anderson",
               "gender": 2,
               "credit_id": "52fe450a9251416c750499eb",
               "name": "Liam Neeson",
               "profile_path": "/9mdAohLsDu36WaXV2N3SQ388bvz.jpg",
               "id": 3896,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Judge Matthew Bishop Helms",
               "gender": 2,
               "credit_id": "52fe450a9251416c750499ef",
               "name": "John Mahoney",
               "profile_path": "/jK2uDKxfysuYjNAgUxbwyhd4fKD.jpg",
               "id": 4251,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Charlie Stella",
               "gender": 2,
               "credit_id": "52fe450a9251416c75049a21",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Paul Gray",
               "gender": 2,
               "credit_id": "52fe450a9251416c75049a25",
               "name": "Philip Bosco",
               "profile_path": "/8B8EQk868fQF8fGZ1w33XDV5Z1S.jpg",
               "id": 6541,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Grace Comisky",
               "gender": 0,
               "credit_id": "560f409e9251415e53001c6d",
               "name": "E. Katherine Kerr",
               "profile_path": "/rXWKKtItHcuRh5NENl0gVkhKYc4.jpg",
               "id": 1218055,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Morty Rosenthal",
               "gender": 2,
               "credit_id": "52fe450a9251416c75049a2d",
               "name": "Fred Melamed",
               "profile_path": "/6K5KWzJ5npYkGl3RmL07zf3Urjo.jpg",
               "id": 105303,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Marilyn",
               "gender": 0,
               "credit_id": "52fe450a9251416c75049a31",
               "name": "Lisbeth Bartlett",
               "profile_path": "/6uRwpwkFQjygOI23UZSN0RlLohj.jpg",
               "id": 937277,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe450a9251416c750499f5",
               "name": "Peter Yates",
               "profile_path": "/skBRJxvtvkylZXk6zjNPvwytr5S.jpg",
               "id": 12804,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe450a9251416c750499fb",
               "name": "Eric Roth",
               "profile_path": "/e73ADDpR3vT1Bwa0Q0oRp5RQWTb.jpg",
               "id": 27,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe450a9251416c75049a01",
               "name": "Daniel A. Sherkow",
               "profile_path": null,
               "id": 73148,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450a9251416c75049a07",
               "name": "John Veitch",
               "profile_path": null,
               "id": 29856,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450a9251416c75049a0d",
               "name": "Michael Kamen",
               "profile_path": "/y83bqw1VP1PkuvOhG2XROwc9eXG.jpg",
               "id": 7714,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450a9251416c75049a13",
               "name": "Billy Williams",
               "profile_path": null,
               "id": 11848,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe450a9251416c75049a19",
               "name": "Ray Lovejoy",
               "profile_path": null,
               "id": 244,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "59e91feac3a3681a1f0079ec",
               "name": "Jennifer Ogden",
               "profile_path": null,
               "id": 56790,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 1,
               "credit_id": "59e91ff39251415698007949",
               "name": "Karen Hazzard",
               "profile_path": null,
               "id": 959421,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59e91ffa9251415691007e76",
               "name": "Stuart Wurtzel",
               "profile_path": null,
               "id": 21379,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59e92002c3a3681a7d00785f",
               "name": "Steven P. Sardanis",
               "profile_path": null,
               "id": 1342249,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "59e92008c3a3681a69007b8f",
               "name": "Rita Ryack",
               "profile_path": null,
               "id": 6192,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "59e9201192514156c800750f",
               "name": "Tony Hall",
               "profile_path": null,
               "id": 1500145,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.920675,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12623,
      "vote_count": 68,
      "budget": 0,
      "overview": "When a Supreme Court judge commits suicide and his secretary is found murdered, all fingers point to Carl Anderson (Liam Neeson), a homeless veteran who's deaf and mute. But when public defender Kathleen Riley (Cher) is assigned to his case, she begins to believe that Anderson may actually be innocent. Juror Eddie Sanger (Dennis Quaid), a Washington lobbyist, agrees, and together the pair begins their own investigation of events.",
      "similar": [
         1645,
         389,
         11975,
         9800,
         595,
         9623,
         12219,
         37257,
         821,
         687,
         1592,
         819,
         881,
         314365,
         396371,
         93,
         392982,
         11560,
         1369,
         1813
      ],
      "original_title": "Suspect",
      "runtime": 121,
      "poster_path": "/tI210KdrdWo7iNmKrW5MtaM7sko.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ML Delphi Premier Productions",
            "id": 44425,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         }
      ],
      "release_date": "1987-10-23",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Yates"],
      "runtime": 121,
      "synopsis": "Set in Washington DC, Suspect centers on three disparate characters. Carl Wayne Anderson is a homeless, deaf-mute Vietnam veteran accused of murdering Elizabeth Quinn, a file clerk at the Justice Department. Kathleen Riley is the beleaguered Federal Public Defender assigned to represent Anderson. An agribusiness lobbyist who normally works on Capitol Hill, Eddie Sanger, is made a member of the jury and begins investigating the details of the murder himself, eventually teaming up with Riley to solve the case. We see some early scenes of Sanger's work as a lobbyist on Capitol Hill, including his efforts to win passage of a bill by seducing a Congresswoman. While not relevant to the movie's plot, these scenes are establishing shots giving us a sense for Sanger as a charming, though somewhat ruthless, person. The movie begins around Christmas with the suicide of a United States Supreme Court Justice, for which no explanation or context is given. We only see the Justice making a tape recording and then shooting himself. Shortly after the Justice's suicide, Elizabeth Quinn's body is found floating in the Potomac river, and Carl Wayne Anderson is arrested for the crime, based almost entirely on the fact that he was found sleeping in Quinn's car, which was abandoned in the parking lot where she worked (and was mostly deserted at night). Anderson explains that he found it unlocked and was just looking for a warm place to sleep since it was the dead of winter. But since he was homeless, had no alibi, and was found in Quinn's car, he was arrested for her murder. The establishing scenes show Riley trying to communicate with Anderson and realizing that he is a deaf-mute. Over time, she begins to penetrate his hard exterior and he tries to cooperate with her efforts to mount a defense for him. In the District of Columbia, all crimes are tried in the federal courts, so a murder trial that would normally be in state court was in federal court instead. Riley selects Sanger to be a member of her jury. Soon thereafter, it becomes clear that Sanger is intent on helping Riley with her investigation and defense of Anderson. As the investigation by Riley and Sanger intensifies, they begin focusing on Deputy Attorney General Paul Gray. Figuring that a key found on Elizabeth Quinn's body has something to do with the Justice Department (where Quinn worked), Riley and Sanger break into the file department at the Justice Department late one night and try to find what the key unlocks. They find that it unlocks a file cabinet, which contained trial transcripts from federal cases from 1968 that Quinn was in the process of transcribing. While the investigation goes on after hours, the movie shows scenes during the day from Anderson's murder trial. During the trial, we are introduced to the stern federal judge Matthew Helms (John Mahoney). Helms is rumored to be the President's nominee for a seat on the prestigious United States Court of Appeals for the District of Columbia. Judge Helms begins to suspect that Riley may be collaborating with Sanger, which would be a disbarrable offense of jury tampering, although he does not have concrete proof. One key sequence in a law library (where Riley and Sanger continue looking for the elusive case from 1968 that may be the key to the murder) brings Helms, Riley and Sanger into close proximity. Riley and Sanger narrowly avoid being caught by Judge Helms. Eventually, Judge Helms sequesters the jury to avoid further contact between Riley and Sanger. Riley and Sanger continue tracking the federal court cases from 1968. Their theory is that Elizabeth Quinn stumbled onto something during her transcription of those cases. They look for any case that might have an impropriety. As is explained to the audience, fixing a case requires participation from both the prosecutor and the trial judge. Riley and Sanger think they will find evidence that Paul Gray was a prosecutor on a rigged 1968 case, which would be his motive to murder Elizabeth Quinn if she approached Gray about what she found. Eventually, Riley goes back to Quinn's car (still impounded where it was found in a government parking lot) and finds an audiotape that the police did not uncover in their half-hearted investigation. The tape is the one we saw the Supreme Court Justice making at the beginning of the movie. In it, he confesses to conspiring to fix a case in 1968 (with a politically influential defendant) in return for an appointment from the United States District Court to the United States Court of Appeals for the District of Columbia. Riley assumes the prosecutor on that case was Paul Gray and goes back to the courthouse to retrieve the case book that will confirm this. As she gets to the courthouse (now deserted at night), she is pursued and attacked by an unseen figure. With the help of Sanger (who managed to get away from being sequestered by creating a diversion with a fire alarm), Riley was able to slice the right wrist of her assailant, who then fled unseen. The following day takes place in court. Paul Gray shows up in the courtroom, to the surprise of Judge Helms. Riley then tells Judge Helms that she wants him to take the stand. Irate and perplexed, Helms says that Riley cannot make him testify as he is the presiding judge. Then, in a somewhat-rushed speech, Riley reveals that Judge Helms, not Paul Gray, was the prosecutor in the fixed case in 1968. The Supreme Court Justice was the presiding judge in that case. In exchange for fixing the case, he was promoted from the District Court to the Court of Appeals. Helms, who was the prosecutor on the fixed case, was appointed to the District Court. Judge Helms then waited 17 years (from 1969 to 1986) to be promoted again to the Court of Appeals. Just as he learned he was the President's nominee, Quinn inadvertently discovered the case fixing as she transcribed the cases from 1968. She approached the Supreme Court Justice, who responded by committing suicide. By contrast, when she approached Judge Helms, he murdered her. As Judge Helms angrily bangs his gavel during Riley's accusation, his right wrist begins to bleed from where Riley slashed him the night before, confirming his identity as the killer. The movie ends with Riley reinvigorated in her job and in a relationship with Sanger.",
      "writers": ["Eric Roth"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094082/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5Nzg0OTc0Nl5BMl5BanBnXkFtZTcwNzg3MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Cher, Dennis Quaid, Liam Neeson | See full cast and crew »"],
      "reviews": [
         "Fine courtroom drama which appears to be about a small change murder involving a pair of street people. But is it? An attorney takes on the case and begins digging deep into the case when evidence turns up that suggests the culprit may have connections other than with simple street bums. Interesting and exciting, though improbable.",
         "Before watching this movie I had some serious doubts about it. Not only is this a courtroom drama (and as you know the streets of Hollywood seem to be paved with this kind of scripts), it also featured Cher as one of the main actresses. I'm not really a fan of her as a singer, but seeing her as a good actress is even a lot harder. As you know, almost all pop diva's, young or old, seem to have that urge to appear in one or two movies and that almost always results in complete disasters. So why would Cher be any different...? When a judge commits suicide and his secretary is found murdered in a river, a homeless and deaf-mute man, named Carl Anderson, is arrested for her murder, because all indirect evidence points to him. Because he can't afford a lawyer, public defender Kathleen Riley is assigned by the court as his lawyer. Even though she doesn't always believes in his innocence, she still goes after the real killer. She gets help from the congressional adviser Eddie Sanger, who is called to be on the jury panel and together they find some important evidence that the murder has something to do with corruption in some high ranks... I must admit that Cher has done a better job than I ever expected from her. She actually was very convincing and interesting to watch as the public defender. Together with Liam Neeson she makes this movie work. Their nice performances and their difficult professional relationship in this movie are actually the best thing this movie has to offer. The story on itself certainly isn't that bad, but the plot is a bit far-fetched and gives this movie an ending that is a bit too abrupt. In the end this is a reasonably well-done courtroom drama / thriller that lacks the required tension to be fully satisfying, but which offers some nice acting and some good direction. It's not the best movie in the genre, but it is enjoyable enough to be worth a watch. I give it a 6.5/10.",
         "Exciting, suspenseful and tightly woven suspense drama. Cher proves she can ACT. You probably will not immediately recognize Liam Neeson in the role of the deaf, mute, shell-shocked Carl Wayne Anderson. For someone that does not speak for the entire film he turns in a stellar performance. Dennis Quaid is very good as the juror that steps outside his assigned duties as a juror and becomes a detective. Also John Mahoney is almost unrecognizable as Judge Matthew Helms -- a polar opposite from his \"Frasier\" character. When I spoke to Tom Barbour (Justice Lowell in this film, stage actor and the father of Dudley Moore in the \"Arthur\" movies) he said when he got the script he was thrilled -- the film opens with him, it took place in his office, he had every other line, and then on page three -- well I guess you will just have to see it. Surprise ending goes right up to the last couple of minutes -- prepare to be shocked.",
         "This movie version of \"Suspect\" finds Cher portraying a public defender that has been given a murder case in which her client, played by Liam Neeson, is deaf, dumb, and homeless. Unable to verbally communicate in his defense, Neeson has to rely on Cher's ability to search through the evidence to prove his innocence. Caught up in this courtroom scene is Dennis Quaid, portraying a member of the jury that is unable to keep himself from being drawn to Cher. The judge in the trial also appears to have an overly sense of apprehension in the trial, and seems bent on preventing justice from being served properly. This movie does launch the viewer from one tense situation to another, and the climatic chase scene in the darkened courthouse does keep you guessing.",
         "i have just re-watched this film, maybe the 5th time since its release. What a treat!Smart, sexy,dynamic and compelling, socially relevant, with a good moral backbone.All the actors are spot-on. Cher easily convinces us of her serious attorney's commitment to helping society's outcasts;Liam Neeson in his first film role as the silent hulking Viet-vet street person accused of murder; Dennis Quaid at his cocky best as a razor-sharp lobbyist/juror, and John Mahoney and Philip Bosco. The screenplay ,directing and editing are all first rate.And if you pay attention, you can learn a lot about the inner workings of our government's congressional/lobbyist bedfellows and the scary fallibility of our justice system and its judges and lawyers. Some may think this is a piece of romance disguised as a get-into-your subconscious morality play, but i think it's just the opposite. How many films have you seen that convincingly made you put yourself into a street person's shoes and think about your attitudes towards them? I usually am close to agreeing with the IMDb average vote on a film, but not this time. For me, this is a real 10.",
         "Anyone who thinks that the United States legal justice system is fair and balanced has been watching too many movies. The poor and the marginalized get convicted and the rich and elite drive away from the courthouse. It's largely a matter of the size of the pocketbook. And it's still amazing how many innocent people are locked away with almost no hope of getting out. \"Suspect\" is how about a how a homeless man (Liam Neesom) and his public defender (Cher) find themselves in a case that has much larger ramifications than a simple matter of did a homeless person murder the victim for $9. The aspect that makes this movie a gem is the fine acting: Cher as the overworked and underpaid public defender, Liam Neeson as the deaf/mute defendant in one of his first major roles, Dennis Quaid as a sexy lobbyist (often messing around with congresswomen to get votes for his industry) turned juror turned amateur sleuth, and John Mahoney as the stoic judge at the trial. A lot of it is pure fantasy but the moments in the courtroom are actually very much like a real courtroom in its obsessiveness with procedure and protocol. The story begins with the suicide of a prominent Supreme Court Justice and the subsequent murder of his assistant who has been slashed to death. When police investigate the surrounding area, they find a homeless man sporting a knife and in possession of the victim's wallet which contained a king's ransom: $9. Cher is appointed to take the case, and Quaid ends up becoming one of the jurors. Because of the suicide at the beginning of the film, Judge Helms (Mahoney) becomes one of the people on the US President's short list to fill the Supreme Court vacancy. Helms requests to preside over the murder case to free up his later schedule in order that he be considered for the vacancy. Several scenes take us into the bowels of the homeless of Washington DC. We see a lot of lawyers, a lot of law libraries and a lot of knives. Every homeless person appears to wield a knife. Cher with the unlawful help of Quaid (lawyers and jurors in the same trial are not supposed to commiserate, let alone team up) stumbles upon some evidence that makes the case much more complex. A thoroughly enjoyable courtroom drama with enough action to keep you on the edge of your seat, and an interesting commentary on the justice system and how it handles the poor and the homeless. Unfortunately, public defenders are probably not as successful as Cher appears to be.",
         "You know, I watched this film for the first time since I saw it in the theater years ago, and I must say that in today's cinematic atmosphere, this is a very underrated and enthralling film. I find today's movies to be so \"dumbed down\" to accommodate the full spectrum of moviegoers (the debt, and Tinker Tailor Soldier Spy as SOME exceptions), and this thriller manages to combine a few genres (mystery, courtroom, thriller, drama, suspense) into one package. Cher stars as a lawyer, badly in need of a vacation, who gets appointed a murder case in which a deaf and mute suspect (Played by the ever-ready Liam Neeson) seems to have perpetrated the crime. As she delves into the case, and into to case precedent, she begins to unravel a mystery that goes much higher than a homeless deaf mute. A fresh faced Dennis Quaid is a juror who is intrigued by puzzle pieces that don't seem to fit and begins his own look at the case, culminating in a heart pounding climax that'll leave you panting and wishing there was another hour to go! Definitely worth a look - even with Cher, whom I had dismissed as a one hit movie wonder. She actually pulls this movie off. And watch for Frasiers dad, John Mahoney, as a judge here - don't worry, you won't miss him. Give it a look!!",
         "\"Suspect\" is a hugely enjoyable courtroom thriller in which a Washington D.C. public defender becomes convinced that the suspect in a murder trial is innocent and also that the case is unwinnable. There doesn't seem to be any way out of her problem until she's offered help from an unexpected source. Unfortunately, accepting the help on offer also involves taking some extremely serious and potentially career threatening risks. Shortly after a Supreme Court Justice commits suicide and a clerk/typist who'd also worked in the Justice Department is found brutally murdered, a homeless man called Carl Wayne Anderson (Liam Neeson) is found with some of the victim's possessions on him and is immediately arrested and accused of her murder. Burned out public defender Kathleen Riley (Cher) is assigned to the case and soon discovers that her client is uncooperative and prone to having violent outbursts. Communication with him improves gradually when she discovers that he's actually a deaf-mute but even then, she finds it almost impossible to find any significant information or evidence that could be helpful for his defence. To make matters worse, the trial judge Matthew Helms (John Mahoney) is unsympathetic to the problems she's experiencing and also seems more preoccupied with other matters as he's said to be the President's nominee for a seat on the U.S. Court of Appeals for the District of Columbia. Eddie Sanger (Dennis Quaid) is a jury member whose interest in the case leads him to carry out his own investigations. He wants to assist Riley by passing information on to her but any such collusion is strictly forbidden and punishable by disbarment. The couple do, however, work together and find some pieces of evidence which reveal that the murder victim had discovered evidence of a high level conspiracy to fix a politically important court case in which the Supreme Court Justice had been involved some years earlier. Ultimately this information provides an explanation for the suicide and the murder and also leads to the discovery of the identity of the real murderer. Cher and Dennis Quaid both give good individual performances but are even better when working together. The differences between their personalities lead to some entertaining exchanges and the high stakes involved also create a certain amount of additional tension. Riley is overworked, lonely and in desperate need of a holiday. She's struggling to cope against what seem like insuperable odds and doesn't feel resilient enough to take risks that could lead to her being disbarred. Sanger, on the other hand, is a Capitol Hill lobbyist who's used to pursuing his goals in a ruthless manner and has no inhibitions about cutting corners or acting outside the rules if such actions are likely to produce the desired results. \"Suspect\" has a good plot with many moments of real suspense and the solid performances provided by Cher and Dennis Quaid are also complemented by those of John Mahoney, Liam Neeson and Joe Mantegna.",
         "Glossy Cher vehicle, and one of her better performances as a defense attorney trying to save a homeless deaf-mute from the gallows. Quaid is excellent as usual as a juror with an agenda. And Neeson as the suspect was a find in what I believe was his first big American film. He also is virtually unrecognizable in his early scenes, until he is cleaned up for his courtroom debut. A bit dated now, perhaps, but still worth a look for Cher in her glory days, before she turned into the bizarre hag we know today. A side note: In his most recent film, COLD CREEK MANOR, Quaid amazingly looks almost like he did in SUSPECT, which was made 18 years ago. Some genes.",
         "I had missed this film during the many years since it was made, and caught it by chance on a Friday afternoon, after a particularly long and hectic week. I thought I might nod off, but instead I found myself engrossed in it very soon. It has some far-fetched aspects, and as the \"goofs\" section in this site points out, it wouldn't have been tried in a federal court, but in the local D.C. courts. However, given the rather surprise ending, this would be a necessary variation, given its circumstances. Cher is not a person whom you reference when thinking of leading, versatile actresses -- but this isn't so. This serious role, as well as a different type in the excellent \"Moonstruck,\" display both her competence and versatility. Dennis Quaid is always excellent, and a favorite of mine, and the remaining cast were as well. John Mahoney's performance is well-delivered, and an interesting performance, in contrast with his more pleasant persona in \"Moonstruck,\" also -- and particularly juxtaposed with his likable presence in the long-running \"Frasier\" series. As another pointed-out, there is a surprise ending, if somewhat more abrupt than seems necessary. But overall, an interesting, entertaining film."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "ML Delphi Premier Productions"
      ],
      "summaries": ["A judge commits suicide, and his secretary is found murdered. A homeless deaf-mute man, Carl Anderson is arrested for her murder. Public defender Kathleen is assigned by the court as his lawyer. She sets to find the real killer, and gets help from the congressional advisor, Eddie Sanger who is called to be on the jury panel. Together they discover a dangerous circle of corruption in high places."],
      "budget": 0
   },
   "movielensId": 4332,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-10-23",
      "dvdReleaseDate": "2001-05-08",
      "directors": ["Peter Yates"],
      "runtime": 121,
      "movieId": 4332,
      "title": "Suspect",
      "mpaa": "",
      "actors": [
         "Cher",
         "Dennis Quaid",
         "Liam Neeson",
         "John Mahoney",
         "Joe Mantegna",
         "Philip Bosco",
         "E. Katherine Kerr",
         "Fred Melamed",
         "Lisbeth Bartlett"
      ],
      "imdbMovieId": "0094082",
      "originalTitle": "Suspect",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["HE86y72xsr4"],
      "plotSummary": "When a Supreme Court judge commits suicide and his secretary is found murdered, all fingers point to Carl Anderson (Liam Neeson), a homeless veteran who's deaf and mute. But when public defender Kathleen Riley (Cher) is assigned to his case, she begins to believe that Anderson may actually be innocent. Juror Eddie Sanger (Dennis Quaid), a Washington lobbyist, agrees, and together the pair begins their own investigation of events.",
      "tmdbMovieId": 12623,
      "avgRating": 3.40176,
      "releaseYear": "1987",
      "numRatings": 397,
      "posterPath": "/tI210KdrdWo7iNmKrW5MtaM7sko.jpg"
   }
}