{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "charles manson",
            "id": 10056
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "crime",
            "id": 14536
         },
         {
            "name": "helter skelter",
            "id": 204364
         }
      ],
      "imdb_id": "tt0383393",
      "video": false,
      "title": "Helter Skelter",
      "recommendations": [
         10031,
         76657,
         385232,
         352209,
         70110,
         65989,
         287241,
         70574,
         161782
      ],
      "backdrop_path": "/qv9ZtLcOxEPNPDD0BytYg4c2QZz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Charles Manson",
               "gender": 2,
               "credit_id": "52fe46d2c3a36847f811404b",
               "name": "Jeremy Davies",
               "profile_path": "/xPM0Wf4zVDpdNw3xokD2mDTqtoP.jpg",
               "id": 4654,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Linda Kasabian",
               "gender": 1,
               "credit_id": "52fe46d2c3a36847f811404f",
               "name": "Clea DuVall",
               "profile_path": "/lNCDz75IsCKIPhr295OBk1SHv2J.jpg",
               "id": 20387,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Patricia 'Katie' Krenwinkle",
               "gender": 1,
               "credit_id": "52fe46d2c3a36847f8114053",
               "name": "Allison Smith",
               "profile_path": "/oKDR5teAmGg51woSSNId9LaTctU.jpg",
               "id": 137410,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lynette 'Squeaky' Fromme",
               "gender": 1,
               "credit_id": "53a0f78a0e0a266534001436",
               "name": "Mary Lynn Rajskub",
               "profile_path": "/icSziituw2XPBKvdgNWcyRyrJMp.jpg",
               "id": 25884,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Charles \"Tex\" Watson",
               "gender": 2,
               "credit_id": "53a0f7a00e0a2665370016db",
               "name": "Eric Dane",
               "profile_path": "/l0O73xzcQqmlVr8ACX5n9C7PYYC.jpg",
               "id": 58115,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Bobby Beausoleil",
               "gender": 2,
               "credit_id": "53a0f7d20e0a2665470014f0",
               "name": "Michael Weston",
               "profile_path": "/opY5b6qQOCIFDpQXYsxFbQ7Ka6h.jpg",
               "id": 51381,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46d2c3a36847f8114047",
            "name": "John Gray",
            "profile_path": null,
            "id": 35155,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.038681,
      "production_countries": [],
      "id": 45759,
      "vote_count": 13,
      "budget": 0,
      "overview": "A new take on the Manson Family murders, with a keen focus on Charles Manson himself.",
      "similar": [
         984,
         1696,
         4638,
         75780,
         1949,
         14240,
         948,
         21484,
         9411,
         11423,
         274,
         10285,
         2832,
         3597,
         2048,
         1991,
         4232,
         4771,
         275,
         281
      ],
      "original_title": "Helter Skelter",
      "runtime": 137,
      "poster_path": "/mNJMBEiDKTaJVtrpws9JqGnTXqb.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2004-07-23",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "How did one man turn all-American teens into cold-blooded killers?",
      "adult": false,
      "homepage": "http://www.cbs.com/specials/helterskelter/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Gray"],
      "runtime": 180,
      "synopsis": null,
      "writers": [
         "Vincent Bugliosi",
         "Curt Gentry"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0383393/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODA4NzMxNDg3NV5BMl5BanBnXkFtZTcwMzY2ODYyMQ@@._V1_SY317_CR25,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeremy Davies, Clea DuVall, Allison Smith | See full cast and crew »"],
      "reviews": [
         "If you are really interested enough in the whole Manson affair to devote 7 hours to it, it would probably be best to see this together with the 1976 original, because the two fascinatingly complement each other like yin and yang, or two pieces of a jigsaw puzzle. Moreover, in spite of the chronology of their release, it would probably be better to see the 2004 version first, then the 1976 version. The 1976 version begins with the murders already having occured, whereas the 2004 version focuses mainly on the events leading up to the murders, and hardly at all on the legal aspects. It could be summed up: 1976 version, mostly detective and legal work, 2004 version, mostly a psychological study. The 2004 version succeeds quite well in showing how Manson had the power that he did. Nothing that Manson says makes much sense; he exhibits what shrinks call tangentiality, i.e., the inability to focus on a point. While this leads most people to avoid Manson in the outside world, in the cloistered environment of Manson's commune, it forces the listener to listen all the more closely. In Jeremy Davies' riveting performance, Manson seems almost oracular; the very obscurity of what he was saying can make him seem, to the young naifs with whom he surrounded himself, profound. It is easy to see how they found him hypnotic. Davies makes Manson seem scarier than ever.",
         "It is with mixed emotions that I give this outstanding documentary such a high rating, because it doesn't exactly know where the line between glorification of a murderous madman and objective re-telling of a truly horrible tale is (and often crosses it), but the movie is so effective at telling the tale of Charles Manson and his followers that it deserves to be seen. Before I go on, it should also be noted that the movie takes a great many creative liberties with its source material, which is perfectly fine with me. What I don't like is when movies are marketed as based on true events or inspired by true events or something and then take some story and do whatever they want with it. This movie is so honest that it starts with nearly a solid minute of full-screen titles explaining that the story has been fictionalized, that certain characters and events have been dramatized for effect. That being said, it clearly is not a history lesson of what Manson did, which I almost think that it should have been because of the horrific nature of his crimes (if I can be excused a gag-inducing legal-thriller cliché). The one problem that I have with the movie is that, since so much was dramatized, it was made almost as a fictional thriller rather than a documentary about the Manson family. I saw a documentary about the standoff in Waco that went into great detail about the ATF's involvement (and endless screwups) that resulted in the deaths of so many people, and I think something similar would have been the best way to approach this movie. The murder scenes in this movie are extremely difficult to watch because you know they really happened. If nothing else, great attention was paid to making sure that the murders were as close to real life as possible. Many of the victims were even in the same position and locations in and around their houses as they really were when they were found. And this is what made me dislike the level of glorification in the movie. Charles Manson is so deeply insane and the murders committed by his followers, no matter how brainwashed they were, were so heinous and so disgusting that it made me wish they had thrown him in prison and barred all reporters from talking to him or anyone who knew anything about him. His punishment should have been disappearance. On the other hand, I guess I have to admit that I am fascinated by stories like his, which is why I watch documentaries about the standoff at Waco and movies about Ed Gein or John Wayne Gacy. But I like to think that I look at them almost like extended news clips (despite being fictionalized to whatever extent, in this case), and that I can watch something like this and maintain a level of disgust at what really happened. I see a line, for example, between being impressed with a fictional murderer like Hannibal Lecter and a non-fictional murderer (whether he killed anyone with his own hands or not) like Charles Manson. It made me think twice about what I should really think of the fact that I own 22 Marilyn Manson CDs (see my summary line). Another thing that I found interesting was that all of this took place in Topanga Canyon, near where I live. In fact, after I finish writing this review I am going on the same bike ride that I do two or three times a week. I go west on Venice Blvd. to Sepulveda, then head north over the Sepulveda pass to Ventura Blvd. I go left on Ventura, through Woodland Hills to Topanga Canyon road, then I follow that all the way to the coast, which takes me directly through the middle of the town where the Manson family lived. I've been through there probably a hundred times and I never knew that was where this all happened. Scary. Jeremy Davies gives a spectacular performance in the movie, and I like that most of it focuses on him and his followers and how he communicated with them to get them to believe that he was their personal savior when in reality he was the exact opposite, and relatively little time is spent showing the murders (which is good because if it was the other way around the movie would have been literally unwatchable). This case is a textbook study for psychologists about the impressionable young minds of the lost young. Another element that the movie is not very concerned with is the actual trial itself, although I see no problem with this because it is not a courtroom drama, it is a TV thriller about a murderous cult leader. The movie is already over two hours long, we don't need another hour showing the convictions of a lot of people that we already know were convicted. The movie is more concerned with what events led up to their arrest and prosecution, and in that sense it does very well. Dramatized for effect, but the heart of the meaning of it all is still there.",
         "Of all the murder trials in American history, only the Charles Manson case continues to hold fascination thirty-five years after it took place. The original \"Helter Skelter\" film aired on CBS in 1976, and focused mainly on the trial of Manson and his zombie teen girls. It was an excellent TV movie, but we never really got a sense of what life with Manson and his young followers was like. This film takes a different approach by focusing on Manson himself, the young people whose lives were ruined by him, and by depicting the actual murders themselves, which were quite intense for a television film. Jeremy Davies (\"Spanking the Monkey,\" \"Saving Private Ryan\") was deeply scary as Manson. Clea Duvall did a fabulous job as Linda Kasabian, the \"family\" member who witnessed the murders but did not participate. After the murders, we get the sense that Kasabian is really torn up inside and knows that what was happening was very wrong, while other family members laughed and cheered as they watched news reports of the savage killings on television. Another excellent performance was by Whitney Dylan as Sharon Tate, the pregnant actress who was violently butchered by Manson's murderous teen followers. The scene in which she is on the floor dying and asks the killers to please try and save her baby was chilling and almost tear-inducing. We also get an excellent feel of the turbulent atmosphere of the time, 1969, and how the Manson murders brought \"the decade of love\" to a thundering halt. What makes this so sad and scary is that this actually happened. The fact that all-American teens from respectable families fell prey to a maniacal con man and are now spending their lives in prison is a frightening reminder of how young people can so easily be led astray by false prophets who promise the world and eventually can lead you into darkness and tragedy, whether it is 1969 or 2004. This film makes you want to hug and talk to your kids about the evil, dangerous alure of cults and false religions. All of the kids in the Manson family were runaways, and Charlie told them exactly what they wanted to hear and soon had them clinging to his every deceptive word. Manson continues to have a following among young people, thirty-five years after these awful crimes, and that's what is really disturbing. Watch the original 1976 film for an exhaustive dramatization of the trial itself, and see this remake for details of the events leading up to the trial. Way above average for television.",
         "Doubtless this will be compared with the 1970s TV movie for most of the feedback on it. Having seen both, the main thoughts that come to mind are that in this version there is more emphasis and clarity on the motives and goals of Manson, as well as what life in the \"Family\" entailed. A lot of the story is shown through the eyes of Linda Kasabian. But what really stands out is that unlike in this remake, in the 70's movie the writers had an extremely irritating penchant for 2 characters to have a conversation in a scene, and then one character suddenly starts talking to the camera like a narrator. Thankfully that is gone, and instead of 2 deadpan detectives talking about the crimes that happened, in this version they show what happened. As anyone who has seen newsreels of the real Manson will attest, the acting of Jeremy Davies as Manson is excellent, even eerily hair raising in some scenes. It would be clear to anyone giving this a fair viewing that Davies has watched a lot of footage of Manson's talking style and mannerisms, and has done his homework quite well. One drawback in this version is the sudden use of film negatives for 1 or 2 second shots, to try and make the violence look more dramatic, but these efforts usually just marred the scene. Overall, well worth watching if you haven't seen it, or would like a fresh take on the Tate-LaBianca murders. Certainly better than most of the shallow junk on the tube these days.",
         "Being as hyped as this movie was, not only was it flawed, it was just plain boring. Although the choice to use Linda Kasabian was a smart one, and interesting to say the least, everything else was yawn-inducing. The performance of Jeremy Davies as Charles Manson was surprising - he pulled it off perfectly - the performances of those at Cielo Drive were cringe-worthy. Even after spending time with Sharon Tate's sister, Whitney Dylan still couldn't find the spark to play her. For reasons unknown, CBS took the step of changing the address of Cielo Drive from 10050 to 10000 - do they know that the now infamous house has been gone for 10 years? They also took the opportunity to change some already dramatic scenes from 1969 to pathetic and downright moronic scenes for this film. Yes, Charles Manson did see Sharon Tate at Cielo Drive in real life, but not like it was shown in the film. And, for anyone who has knowledge on this case, Abigail Folger and Wojciech Frykowski were not that cozy or loving when they were killed - FAR from it. Not only did CBS leave many with the wrong idea about those in Cielo Drive, they thought they could get away with overlooking small details of the case. I, for one, noticed them all. All in all, Clea and Jeremy probably saved this film from being even more boring than it was. They were the only interesting things about this film and should be rewarded by CBS if this dreadful piece gets high ratings.",
         "I sure enjoyed this campy, terrible new version of Bugliosi's flawed, fascinating version of the Manson murders. I suppose the production's tragic flaw is that Warner Bros. was determined to exploit Jeremy Davies' uncanny Charles Manson impersonation, but unwilling to devote much time to it. It's difficult to say who could respect this version of the horrifying events which brought an end to hippiedom. Squeezed unhappily into a little over two hours, those familiar with the case will sneer at the ruthless editing and condensation of the facts and events surrounding the murders. Incredibly, the film comes to an abrupt halt before the trial, hastily summed up in text just before the final credits, even begins! Those only passingly familiar, or unfamiliar, with Manson will simply be left out in the cold by the completely incoherent, fragmented narrative. Luckily, it's loaded with camp value, and there are occasional glimmers of how great this version could have been if they had only pumped up the silliness a few more notches. On the DVD, for instance, there is an outtake of a scene where Susan Atkins breaks into a torrid go-go dance in prison, and you wish she would burst into song, too, so that the whole production would go where it obviously wants to go. Another laughable aspect is the consistent undermining of the various actresses' performances by their ludicrous wigs. Unfortunately, this production doesn't live up to the inherent promise of the source material, either as true crime, or as bad-taste comedy, so I can't give it four stars. Nevertheless, it's wrong-headed enough to be fun, even if all I could think while watching it was how much better it could have been if John Waters had directed it.",
         "Having long nurtured a fascination with the Manson Family murder spree, when I heard CBS was airing a new film version of 'Helter Skelter,' co-produced by Vincent Bugliosi and starring the gifted Jeremy Davies as Manson, I couldn't resist tuning in. Boy, was I disappointed. Davies is a superb actor, but, despite his previously demonstrated ability to play twisted, mentally unstable characters ('Solaris,' 'Saving Private Ryan', 'Ravenous'), his Manson is sort of silly and not particularly persuasive. The casting in general is fairly abysmal--especially Bruno Kirby as Bugliosi, who was at least 15 years younger than Kirby when he tried the case and at least 30 pounds lighter--though there are some small exceptions (Clea Duvall is persuasively haunting as Linda Kasabian, the key witness against the defense). In general, the whole project just seems cheap and crass: the clothes, makeup, and especially the hair on the Manson family look perversely fake and costume-ish, the story offers absolutely no new insights or perspectives on the case, and, worst of all, the direction perpetuates the fetishization of Manson that has contributed to his continued popularity among confused young people who see him as something more than a screwed-up con artist who went nuts because he couldn't get anybody to help him make a record. Why would Bugliosi sign on for this project, given that he has continued to lament Manson's continuing appeal and expressed remorse for his part in helping to enlarge Manson's myth? He couldn't possibly need the money--'Helter Skelter' is the best-selling true crime book of all time, and all of Bugliosi's subsequent literary efforts have also sold well. Initially I had thought that the film would shed light on how Manson became who he was--his history of incarceration and institutionalization, his horrific childhood, the influence of Scientology and the 'Church of the Process' on his new-agey philosophy, which he later wielded to woo his acolytes into worshiping him to the point that they lost their independent will and would be willing to murder on his order--but instead, we get a retread of facts that will be familiar to anyone who has paid the slightest attention to this case in the past. There was an opportunity here to add to the story, and to at least make a stab at unpacking the various forces which led up to Manson's bizarre, apocalyptic vision. Perhaps the most overlooked detail of Manson's history is that he is a product of the failures of society, particularly in relation to our child welfare and penal systems. The son of a 'bad girl' who abandoned him to the state, Manson suffered horrific physical and sexual abuse at the hands of older inmates before he reached his teens. By the time he showed up in the Haight in '67, he'd spent over half of his life in prison, and had even begged not to be released, acknowledging himself that he'd been 'institutionalized'--that he'd spent so much of his life in prison culture that he was neither willing nor able to make the transition back into society. Worst of all, Manson would have been the first person to tell anyone that he was far from rehabilitated when he was let loose on the world for the last time. There's no forgiving Charles Manson for his crimes, nor is there really any way of knowing if his hold over his followers was due to anything more than a shrewd con-man's instincts for exploiting vulnerable marks. But it could be argued that, had he been treated more humanely as a child, he might not have evolved into the man he became. But this film overlooks the possibility of adding something constructive to this sensational story and chooses instead to roll around in the same old dirt. It's awfully hypocritical of Bugliosi to facilitate this garbage, especially given that the product suggests that his only motives were to make a quick buck and maybe sell a few more books. It's also disrespectful to the families of the victims and the other, secondary victims of Manson--Charles Watson, Susan Atkins, Leslie Van Houten, and Patricia Krenwinkle--who were seduced into becoming murderers and, thanks to the continuing public fascination with Manson, will likely never see the outside of a prison, while far more sinister and dangerous killers are regularly paroled after serving half as much time as Manson's unlucky followers.",
         "Although I liked this remake of the '76 version, the original still surpassed it by miles. Jeremy Davies gave a very good performance as Manson, yet didn't send chills down my spine like Steve Railsback did in the original. Although I understand that the focus of this remake was more on Manson and the family and less on the investigation and trial, I felt some key details were, maybe purposely, left out. One that really bothered me was the fact that on both nights, the killers wore dark clothing and brought changes of clothing with them, though in this version they wore whatever they happened to have on at the ranch. Tossing the bloody clothing and weapons over an embankment, they had discarded what eventually became some of the first physical pieces of evidence found linking them directly to the crimes, other than actual prints found at the crime scene. For a film that supposedly paid such close attention to detail, this was a big one to omit. All in all, worth seeing. Do see the original, though, and I think you'll agree that Steve Railsback gave an almost effortless performance as Manson, seeming to be looking at you right through your TV screen.",
         "After watching the \"remake\" of Helter Skelter last night, I can't wait to pop in the far superior 1976 television version tonight. Bruno Kirby was not believable as Bugliosi, nor was Jeremy Davies as Manson, whereas their respective 1976 counterparts, George DiCenzo and Steve Railsback, nailed these difficult parts dead-on, virtually defining their real-life counterparts in the process. This newer version actually shows the murders, whereas the original did not - whether this is an improvement or not is a matter of preference. The new version also spends some time developing the characters of the murder victims, another aspect lacking in the original. The new cast tries hard, but no dice. The superlative performances in the original make this remake pale in comparison. By the way, the chick who played Susan Atkins in the original turned in one of the most chilling television performances ever - whatever happened to her and why have I never seen her in anything else? But I digress... This new version struck me as though it had been slapped together rather quickly. Attempting to cram a complex piece of history into 3 hours (with commercials) does not work. I kept thinking I was watching Part I, and all of a sudden a bogus \"American Graffiti\" type written conclusion appears on the screen. The new version barely touched the trial, whereas the trial scenes accounted for a good chunk of the chills in the original. Helter Skelter did not need to be remade unless someone was going to do it right. Where have you gone, Steve Railsback?",
         "Where do I begin? The most bizarre story in the annals of American murder history and Hollywood just can't tell the facts; it has to \"spin\" the story. Historical accuracy and realistic casting were left in a ditch along the side of the road. Jeremy Davies was horrible as Manson. Couldn't the producers have found an actor closer to the actual height of Manson to play the role? He talks so softly and waves his arms so much, that I thought I was watching a mute orchestra conductor. Linda Kasabian is played as a sympathetic lost sole, who hooks up with the wrong crowd. Yet, in real life it took a nationally announced warrant for her arrest before she turned herself into the police. Over 3 months after she and her baby had left the family! If she was so overcome with remorse couldn't she had just turned herself into police months earlier? Tex Watson, who either killed or helped kill all seven of the victims, appears detached and tormented as he watches a broadcast announcing the victims names on T.V., At it's height there were only 7 male members, including Manson, in the family. At the time of the murders there were a total of 4 male members, including Manson, and approximately 20 female members, yet the movie makes it appear that the family consisted of a bunch of guys with a few girls thrown in for good measure. In real life virtually all of the girls in the family were between the ages of 16 and 22. Yet, the actresses who played them in the movie are all in their mid to late twenties. Why? Aren't there teenage actresses in Hollywood who could have played these roles? The actress who plays Kitty Lutesinger, who was 16 at the time, looks like a clone of Nancy Sinatra circa '68. But the most ridiculous moment in the entire movie occurs when Sharon Tate, after having been stabbed 16 times in the chest with a 5 inch long knife manages to tell Susan Atkins; the best performer in the movie, to \"Take the baby, cut the baby out\" This is a total fabrication, it never occurred."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Lakeside Productions",
         "Warner Bros. Television",
         "Wolper Organization"
      ],
      "summaries": ["A new take on the Manson Family murders, with a keen focus on Charles Manson himself."],
      "budget": 0
   },
   "movielensId": 43549,
   "movielens": {
      "languages": [""],
      "releaseDate": "2004-07-23",
      "dvdReleaseDate": "2004-10-19",
      "directors": ["John Gray"],
      "runtime": 137,
      "movieId": 43549,
      "title": "Helter Skelter",
      "mpaa": "",
      "actors": [
         "Jeremy Davies",
         "Clea DuVall",
         "Allison Smith",
         "Mary Lynn Rajskub",
         "Eric Dane",
         "Michael Weston"
      ],
      "imdbMovieId": "0383393",
      "originalTitle": "Helter Skelter",
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A new take on the Manson Family murders, with a keen focus on Charles Manson himself.",
      "tmdbMovieId": 45759,
      "avgRating": 2.96591,
      "releaseYear": "2004",
      "numRatings": 44,
      "posterPath": "/mNJMBEiDKTaJVtrpws9JqGnTXqb.jpg"
   }
}