{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "new zealand",
            "id": 2658
         },
         {
            "name": "maori",
            "id": 2659
         },
         {
            "name": "epic",
            "id": 6917
         },
         {
            "name": "destiny",
            "id": 40850
         },
         {
            "name": "husband",
            "id": 162271
         },
         {
            "name": "convent",
            "id": 165470
         },
         {
            "name": "marriage problems",
            "id": 166113
         },
         {
            "name": "troubled marriage",
            "id": 166490
         }
      ],
      "imdb_id": "tt0039437",
      "video": false,
      "title": "Green Dolphin Street",
      "recommendations": [],
      "backdrop_path": "/Aa860LVdakIwmaY23AdqtSS9KMy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Marianne Patourel",
               "gender": 1,
               "credit_id": "52fe4aa8c3a36847f81dac2d",
               "name": "Lana Turner",
               "profile_path": "/5iJOE1Q8mqXKgmSjNp5LkaDr0bb.jpg",
               "id": 29623,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Timothy Haslam",
               "gender": 2,
               "credit_id": "52fe4aa8c3a36847f81dac31",
               "name": "Van Heflin",
               "profile_path": "/suFqTm1wVopxWhJRNQLEl8MY1cr.jpg",
               "id": 18803,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marguerite Patourel",
               "gender": 1,
               "credit_id": "52fe4aa8c3a36847f81dac35",
               "name": "Donna Reed",
               "profile_path": "/jGSZJKut5cOHqiKnz6cC0AMol7v.jpg",
               "id": 17752,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "William Ozanne",
               "gender": 0,
               "credit_id": "52fe4aa8c3a36847f81dac39",
               "name": "Richard Hart",
               "profile_path": "/x2RcNDRX2MPSxApvXY3MVOxsado.jpg",
               "id": 98506,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dr. Edmond Ozanne",
               "gender": 2,
               "credit_id": "52fe4aa8c3a36847f81dac3d",
               "name": "Frank Morgan",
               "profile_path": "/wqZaxQOgxkBnfSP7i2OMbBAVMI9.jpg",
               "id": 9067,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Octavius Patourel",
               "gender": 2,
               "credit_id": "52fe4aa8c3a36847f81dac41",
               "name": "Edmund Gwenn",
               "profile_path": "/6IL8cwEo3yPZs6hLq07YC0boUoI.jpg",
               "id": 22600,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mother Superior",
               "gender": 1,
               "credit_id": "52fe4aa8c3a36847f81dac45",
               "name": "Dame May Whitty",
               "profile_path": "/qOZnX0Lyrz6bE2CBnyHCgQeuKUf.jpg",
               "id": 14299,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Captain O'Hara",
               "gender": 2,
               "credit_id": "52fe4aa8c3a36847f81dac49",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sophie Patourel",
               "gender": 1,
               "credit_id": "52fe4aa8c3a36847f81dac4d",
               "name": "Gladys Cooper",
               "profile_path": "/kDebiupJb7f5ZiFVNT9QTNuJfN9.jpg",
               "id": 3366,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mrs. Metivier",
               "gender": 1,
               "credit_id": "52fe4aa8c3a36847f81dac51",
               "name": "Moyna MacGill",
               "profile_path": "/6zLZawpv5idiC5cUtxKwzg28PuL.jpg",
               "id": 120173,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Veronica",
               "gender": 1,
               "credit_id": "557a8c41c3a368035100191f",
               "name": "Gigi Perreau",
               "profile_path": "/qBuJfoaiSdNcK21qH2uXY40Ivdc.jpg",
               "id": 111988,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Guest (uncredited)",
               "gender": 2,
               "credit_id": "5a308fd7c3a3680b931844db",
               "name": "Colin Kenny",
               "profile_path": null,
               "id": 120445,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4aa8c3a36847f81dac29",
               "name": "Victor Saville",
               "profile_path": null,
               "id": 14860,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aa8c3a36847f81dac57",
               "name": "Samson Raphaelson",
               "profile_path": null,
               "id": 2432,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4aa8c3a36847f81dac5d",
               "name": "Elizabeth Goudge",
               "profile_path": null,
               "id": 1197554,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5ab84be5c3a3680a3e026f39",
               "name": "Irene",
               "profile_path": "/uqKuNQzRIV4OJQztp2AHuhitWuc.jpg",
               "id": 1012329,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.624702,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 108994,
      "vote_count": 1,
      "budget": 0,
      "overview": "Sophie loved Edmund, but he left town when her parents forced her to marry wealthy Octavius. Years later, Edmund returns with his son, William. Sophie's daughter, Marguerite, and William fall in love. Marguerite's sister, Marianne, also loves William. Timothy, a lowly carpenter, secretly loves Marianne. He kills a man in a fight, and Edmund helps him flee to New Zealand. William deserts inadvertently from the navy, and also flees in disgrace to New Zealand, where he and Timothy start a profitable business. One night, drunk, William writes Octavius, demanding his daughter's hand; but, being drunk, he asks for the wrong sister.",
      "similar": [
         652,
         21208,
         527,
         713,
         4497,
         27029,
         31767,
         24735,
         39356,
         1126,
         257393,
         283322,
         39340,
         81189,
         59068,
         86645,
         79761,
         201865,
         261626,
         151839
      ],
      "original_title": "Green Dolphin Street",
      "runtime": 141,
      "poster_path": "/gbFfFuCPuCJCzC23cuduBRuBWOG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1947-11-05",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "A Fiery Girl Who Dares The Dangers Of The Sea And A Savage Land... Fighting For The Love Of A Bold Adventurer!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Victor Saville"],
      "runtime": 141,
      "synopsis": "Based on the prize-winning novel by Elizabeth Goudge, the spectacular special effects (including a monster earthquake, a tidal wave and a bloody native uprising) were honored with an Academy Award*. Two beautiful daughters of a wealthy merchant fall in love with the same handsome young man (Richard Hart), but because he favors the gentle modesty of Marguerite (Donna Reed), her \"not quite nice\" sister Marianne (LanaTurner) persuades him to seek his fortune abroad. Settled down in business in New Zealand with a friend (Van Heflin), he sends for Marguerite to join him: however, he drunkenly addresses his proposal to sensual Marianne. When the wrong sister meets up with her husband-to-be and his partner, a bitter rivalry is provoked between the men for the love of an irresistible woman. Green Dolphin Street, which co-stars Frank Morgan. Edmund Gwenn and Dame May Whitty, is an entertaining blockbuster, combining high adventure with violent passion. 2 hours, 21 minutes; Black & White *Best Effects, Special Effects 1948 A. Arnold Gillespie (visual) Warren Newcombe (visual) Douglas Shearer (audible) Michael Steinore (audible)",
      "writers": [
         "Samson Raphaelson",
         "Elizabeth Goudge"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039437/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0MDE0MDA1Ml5BMl5BanBnXkFtZTgwOTQxMTI5NTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Van Heflin, Lana Turner, Donna Reed | See full cast and crew »"],
      "reviews": [
         "I saw this movie when it was first shown on a Los Angeles TV station that had licensed a number of big-budget MGM movies for a once-a-week event. I was in my mid-teens at the time and had a part-time job at a supermarket in Pacific Palisades, where my family lived. Gladys Cooper, who had a supporting role in \"Green Dolphin Street\" and who gave her usual British-sterling performance (as a French matriarch), was a frequent customer at that store and she seemed to always choose the checkout line where I was working. (Must have liked the careful way I packed her groceries!) I usually helped her out with her purchases to her top-down 1956 Thunderbird roadster. On the afternoon after \"Green Dolphin Street\" had been shown the previous evening, I did more than exchange the usual pleasantries with Ms. Cooper and mentioned having enjoyed the film and, in particular, the eloquence of her deathbed scene. She graciously thanked me and admitted to watching the film, too (for the first time, by the way), and that she had also enjoyed it. \"It really wasn't bad!\" she said, as she started up her convertible and waved goodbye. When weather permitted, and it did rather frequently in that southern California town, she usually looked like she'd come in to do her grocery shopping, in tennis shorts and a sleeveless blouse, after spending an afternoon gardening in what, no doubt, was as much of a showstopper as the many roles in which she had excelled. For a woman who was in her late sixties at the time, she radiated a most charismatic energy. A great lady whom I shall always remember most fondly.",
         "Is there really a Plan at work in the strange twists and turns of our lives? Green Dolphin Street makes the case that there is--that things happen for good reasons, which can't be understood during the heartbreak of the moment. We see a meaningful design woven in the lives of three people as the movie reaches its strongly crafted and truly moving conclusion. This is a story with a long-range view, taking us through the intertwined lives of two sisters and the man they love. It even reaches back to reveal secrets from the past, from their parents. And it moves forward with exciting scenes of the dangers of pioneer life in New Zealand in contrast to the peaceful world of the Chanel Islands where it all begins. Intriguingly, another man, a fugitive from British justice, plays a key role in ensuring the happiness and safety of one sister, Marianne. In this role, Van Heflin has one of the best parts of his career and makes the most of it. Even here, the theme of a Plan at work is expressed when he suggests to her that they must be old souls who have known one another a very long time. For me, he greatly overshadowed her husband--in fact, would have made a much more suitable husband for her--and perhaps that was intended as another example of the ironies of life. The role of Marianne, played by Lana Turner, is pivotal to the story. While she gives this part her very best, another actress with a stronger face and more range could have done better. Somehow, Lana still looked and sounded like a Hollywood glamour girl. Yet, at times, I was moved to tears during her scenes. Donna Reed in the role of her sister Marguerite seemed more comfortable with her assignment and developed a strength and radiant beauty in the course of the film. No one who has seen this movie could forget her scene as she climbs the cliff. Other memorable moments take place in New Zealand with the earthquake and tidal wave or the attack of the Maoris. But the best is saved for the last. The ending of Green Dolphin Street conveys a transcendence that lifts it far above the ordinary Hollywood costume period movie.",
         "Lana Turner as Marianne marries her sister Marguerite's beau in \"Green Dolphin Street,\" an MGM extravaganza (but in black and white) that probably was meant to equal Gone With the Wind. The story concerns a family, the Patourels, living on the Channel Islands. Their mother (Gladys Cooper) was forbidden to marry the love of her life (Frank Morgan) and instead married Octavius (Edmund Gwenn) and has two daughters. Morgan returns to the area with a son, William (Richard Hart) and both of the girls go after him, though he falls in love with Marguerite (Donna Reed). Eventually he ends up in New Zealand and, in a drunken stupor, writes to Octavius for his daughter's hand in marriage - except he writes the name Marianne, not Marguerite, thereby changing his life and the lives of the sisters forever. The film is a bit long but holds the viewer once it gets going. Its main problem when it's seen today is the painted backdrops and fake scenery, all extremely obvious. When one compares the backdrops and scenery of the earlier Gone with the Wind to this, it's obvious that Selznick demanded a lot more care from his artists than did the powers that be on this film. There are several striking scenes, but the best is Donna Reed climbing a tunnel inside of a cave to escape the rising tide. The earthquake scenes and the Maori attacks are also excellent and exciting. The role of Marianne is huge and well essayed by Lana Turner. Marianne is a smart, controlling woman whose guidance turns William into a success. Apparently the character in the book was somewhat plain; obviously, Turner isn't, so she brings a femininity and beauty to the part as well as a strong core. Of course, when she's supposed to be pregnant, she's wearing a dress tightly cinched at the waist. It was considered indecent to show pregnancy back then, but it's ridiculous. As Marguerite, Donna Reed manages to bring some color into what is a somewhat thankless role. Van Heflin, as a friend and eventual partner of William, gives a wonderful performance as a tough but kind and tender man who makes William do the right thing by Marianne. Gladys Cooper does her usual fine job as Mrs. Patourel, and her final scene is beautiful. There were several very touching parts of the movie, and that was one of them. Newcomer Richard Hart, who died four years later, is William and looks good once he grows his mustache. The role, however, could have used a more exciting performance. Hart was from the theater and actually performed many of the classics on television in its early days. On an interesting side note, Linda Christian plays Turner's Maori maid. Turner at that time was seeing Tyrone Power. The story goes that Christian overheard Turner say that Power was going to be in Rome. Christian wangled the money for her and her sister, went to Rome, and stayed in the same hotel as Power. He never returned to Turner and the next year married Christian. Apropos of this, \"Green Dolphin Street\" asks age-old questions - are there mistakes in life, or a guiding hand? Did William really write the name of the wrong sister, or was that as it was meant to be? We all have to decide for ourselves. I'm not sure \"Green Dolphin Street\" will help one do that, but it's entertaining nonetheless.",
         "'Green Dolphin Street' is set in the early Victorian era and features two unusual backgrounds for Hollywood films, New Zealand and the Channel Islands. (Contrary to what some have thought, 'St Pierre' is not in France, but rather in the British-ruled Channel Islands, although the model for the offshore nunnery was clearly Mont-St-Michel in Normandy). The plot centers around two sisters, Marianne and Marguerite, who are both in love with the same man, William. (An added complication is that the girls' mother, in her youth, was in love with William's father, but they were prevented from marrying by the opposition of her parents). William himself loves Marguerite; indeed, he seems to be unaware that Marianne is in love with him. He persuades the girls' wealthy and influential father to help him to obtain a commission in the Royal Navy. He is, however, a feckless young man and a heavy drinker, and, after getting drunk and missing his ship while in China, deserts from the navy and flees to New Zealand. He meets Timothy, another Channel Islander and fellow-fugitive from justice who has killed a man in a brawl. Timothy is now running a logging business in a remote area of the North Island with the help of Maori workers, and invites William to assist him in his business. The business prospers, and William writes to Marguerite's father, asking for the hand of his daughter in marriage. Unfortunately, he is drunk at the time he writes the letter, and inadvertently writes 'Marianne' rather than 'Marguerite'. Marianne, delighted to think her love is returned, sets off for New Zealand to marry him. In some respects, 'Green Dolphin Street' is a standard costume drama of its period, a combination of a Jane Austen-style drawing-room romance and an epic of the British Empire. The acting is neither particularly distinguished nor particularly bad. Nevertheless, it has a few interesting features. An earthquake hits the logging camp, and this scene can still generate tension even today, as the special effects are surprisingly well done for a film of this period. The characters are well-drawn and undergo genuine development; the feckless William becomes a more responsible character and comes to appreciate the finer qualities of the wife he has married by mistake. Timothy, a wild character in his youth, also matures. He is himself secretly in love with Marianne, but keeps this a secret as he believes she will be happier with William. (Unlike many of the white settlers, he admires the native Maori population and befriends them rather than treating them with contempt). Marianne, headstrong and determined but capable of sincere love, plays an important role in her husband's success. Back in St Pierre, Marguerite, originally a rather spoiled young woman, develops a religious vocation and enters a nunnery. (The film has a strong, specifically Catholic, religious atmosphere). This is a film that has stayed watchable. 6/10. There are a couple of errors that I spotted. The ship's captain talks of having seen a flightless bird larger than an ostrich in New Zealand. This is presumably a reference to the moa, but this bird was already extinct before Europeans first landed in the country. It seems strange that William and Timothy, both fugitives from British justice, should think themselves safe in New Zealand, where they live quite openly under their real names. The country was, after all, a British colony at the time, and they could presumably have been arrested by the local authorities and extradited to Britain.",
         "Green Dolphin Street with its twists and turns is very intriguing. It was very well acted film its characters very deep in moving and realistic performances. It has action, adventure, suspense, romance, personal tragedies and triumphs and it is a wonderfully made film with the tradition of good storytelling. (PLOTS are not this good in lots of the current movies) Donna Reeds performance is great - Noting the extraordinary moments at Marguerite mother's deathbed when confessions of a personal sort are made to Marguerite and her father and especially suspense scenes in which Donna Reed climbs up the old passage inside of a mountain to the old door of the monastery. The story includes good visual and sound special effects which still hold up to today's hi-tech effects by providing some straight forward excitement!!! (Remember this was a 1947 film). It is rich with well the developed characters and very good acting by Donna Reed, Van Heflin and Gladys Cooper and Lana Turner who shows she can do a great job acting with out being a sex symbol. Mostly likely Green Dolphin Street would not play as well in 2005 with the younger audience, but I think that the \"Old Movie buffs\" will like it.",
         "Individual performances in this romantic epic are excellent--Lana Turner, Van Heflin, Donna Reed and Richard Hart do some fine work. Even more impressive are three of the supporting players involved in a sub-plot of their own: Frank Morgan, Edmund Gwenn and Gladys Cooper. Basically a love story depicting two sisters in love with the same man (Richard Hart) and what happens when, in a drunken stupor, he sends for the wrong woman to join him at an outpost in New Zealand. Plot complications thicken and the rest of the story is told against a backdrop of native uprisings, tidal waves and earthquakes that are all realistically depicted. No wonder the film won an Oscar for its startling Special Effects. Lana Turner does a wonderful job as the spirited heroine on an emotional roller-coaster and Van Heflin gives his usual impressive performance as the only man who knows the truth about her relationship with Richard Hart. Donna Reed is sincere as the good sister and has a gripping scene where she is stranded on an island as the tide closes in and must climb an inner cave wall to the safety of a monastery. She also has an extraordinary moment at her mother's deathbed when confessions of a personal sort are made to her and her grieving father. Edmund Gwenn and Gladys Cooper do an outstanding job of conveying their emotions here. Richly satisfying as a romantic drama, its high production values give it that special MGM gloss worthy of an epic film. It's a lengthy film and by the time it's all over, you feel as though you've experienced a lifetime of personal events.",
         "A good film which will satisfy all tastes. Geographical diversions from France to New Zealand certainly add to the movies scenic appeal. Splendid action via the earthquake and flood scenes in New Zealand plus the tense atmosphere when the natives threaten to attack. The female viewers will enjoy the emotional aspects especially the final 10 minutes. The romance is gentle and restrained unlike the slop which we are assailed with in the modern trash movies. Another nice wrinkle...... no profane language. If you can see it I think you,ll find it very entertaining.",
         "Classic Action-Adventure-Romance-Morality Play and nearly anything else you'd like to see in a film, but presented in such an understated way that you'll find it sneaking up on you partway through. Not sophisticated, not stunning, but full of human truth and including convincing performances in the leading roles. An overlooked, romantic chestnut, highly recommended.",
         "Green Dolphin street is a very wonderful movie. Many people would probably not sit through the whole thing because it is old, it's in black and white, etc. However, if you actually take the time to watch it you will find that it is a wonderful story and it delivers powerful life lessons. Lana Turner plays Marrianne beautifully, she gives a convincing portrayal of a stubborn, slightly pushy, but kind and caring girl. Donna Reed plays her younger sister, Marguerite, a sweeter, gentler girl. The reason I love the story so much is because of the girls' strength and determination throughout all the twists and turns that are thrown at them. Neither of them ever gives up hope, each of the characters works through every problem he or she comes across and never forgets the importance of love and commitment. The story is poignant and beautiful, it makes me cry.",
         "When I was 17, I read \"Green Dolphin Street\" for the first time. The book was one of those that I couldn't put down or forget. The characters became a part of me. Shortly after reading the book, I saw the movie. As with most movies adapted from novels, it fell somewhat short of my expectations, but not as badly as most movies of its time period. The characters in the movie are well developed with the exception of Lana Turner's, which is unfortunate since she is the central figure. Hollywood did it again, making the rather plain figure Elizabeth Goudge wrote of in her book into a sex symbol, but in all other areas, this movie was well put together and was a real treat. I was impressed with how well the special effects people created scenes of such magnitude as earthquakes and floods with the technology available in 1947. I believe that anyone who hasn't read the book would find this a riveting movie, full of action, drama, love, all he or she could ask for in a movie. The best part is the lack of smut and unnecessary violence. For those, like me, who read the book first, it will still be a good movie, even if we might long for a better remake one day!"
      ],
      "genres": [
         "Adventure",
         "Romance",
         "Drama"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["Sophie loved Edmund, but he left town when her parents forced her to marry wealthy Octavius. Years later, Edmund returns with his son, William. Sophie's daughter, Marguerite, and William fall in love. Marguerite's sister, Marianne, also loves William. Timothy, a lowly carpenter, secretly loves Marianne. He kills a man in a fight, and Edmund helps him flee to New Zealand. William deserts inadvertently from the navy, and also flees in disgrace to New Zealand, where he and Timothy start a profitable business. One night, drunk, William writes Octavius, demanding his daughter's hand; but, being drunk, he errs."],
      "budget": 0
   },
   "movielensId": 43631,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-11-05",
      "dvdReleaseDate": null,
      "directors": ["Victor Saville"],
      "runtime": 141,
      "movieId": 43631,
      "title": "Green Dolphin Street",
      "mpaa": "",
      "actors": [
         "Lana Turner",
         "Van Heflin",
         "Donna Reed",
         "Richard Hart",
         "Frank Morgan",
         "Edmund Gwenn",
         "Dame May Whitty",
         "Reginald Owen",
         "Gladys Cooper",
         "Moyna MacGill",
         "Gigi Perreau",
         "Colin Kenny"
      ],
      "imdbMovieId": "0039437",
      "originalTitle": "Green Dolphin Street",
      "genres": [
         "Drama",
         "Adventure",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "xzxS0v8zCP8",
         "FIhd0SPsHRI"
      ],
      "plotSummary": "Sophie loved Edmund, but he left town when her parents forced her to marry wealthy Octavius. Years later, Edmund returns with his son, William. Sophie's daughter, Marguerite, and William fall in love. Marguerite's sister, Marianne, also loves William. Timothy, a lowly carpenter, secretly loves Marianne. He kills a man in a fight, and Edmund helps him flee to New Zealand. William deserts inadvertently from the navy, and also flees in disgrace to New Zealand, where he and Timothy start a profitable business. One night, drunk, William writes Octavius, demanding his daughter's hand; but, being drunk, he asks for the wrong sister.",
      "tmdbMovieId": 108994,
      "avgRating": 3.25,
      "releaseYear": "1947",
      "numRatings": 2,
      "posterPath": "/gbFfFuCPuCJCzC23cuduBRuBWOG.jpg"
   }
}