{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "singer",
            "id": 10229
         }
      ],
      "imdb_id": "tt0057168",
      "video": false,
      "title": "I Could Go on Singing",
      "recommendations": [42631],
      "backdrop_path": "/4Gx6OdMIljuZHjmgC6Gl0d5Dsjd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jenny Bowman",
               "gender": 1,
               "credit_id": "52fe49749251416c910adcf1",
               "name": "Judy Garland",
               "profile_path": "/r2p0SpwpkDc5hhg7hqbar9bKMox.jpg",
               "id": 9066,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "David Donne",
               "gender": 2,
               "credit_id": "52fe49749251416c910add2f",
               "name": "Dirk Bogarde",
               "profile_path": "/rIoedSTXnSooIh4zZV3K4M48gBh.jpg",
               "id": 21605,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe49749251416c910adcf5",
               "name": "Jack Klugman",
               "profile_path": "/7OvZnRbj3DHxieaQpS0ZK5CITiP.jpg",
               "id": 5250,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ida",
               "gender": 1,
               "credit_id": "52fe49749251416c910adcfd",
               "name": "Aline MacMahon",
               "profile_path": "/pFVUxlF3AUe6hnfTkJWXpK2LcUa.jpg",
               "id": 74874,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Matt",
               "gender": 2,
               "credit_id": "52fe49749251416c910adcf9",
               "name": "Gregory Phillips",
               "profile_path": null,
               "id": 199909,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Miss Plimpton",
               "gender": 1,
               "credit_id": "52fe49749251416c910add01",
               "name": "Pauline Jameson",
               "profile_path": null,
               "id": 33093,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Reynolds",
               "gender": 2,
               "credit_id": "58bf2db99251413677000734",
               "name": "Russell Waters",
               "profile_path": "/gxO3jVF5a5Fh4PYFdgH00oet3cI.jpg",
               "id": 114837,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Young girl on ferry (uncredited)",
               "gender": 1,
               "credit_id": "58bf2dd4c3a36851770006a5",
               "name": "Lorna Luft",
               "profile_path": "/xsLXxUmk4h2n3pMo2yGtSeoc0q2.jpg",
               "id": 56752,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Young boy on ferry (uncredited)",
               "gender": 0,
               "credit_id": "58bf2df0c3a368516c0006d0",
               "name": "Joey Luft",
               "profile_path": null,
               "id": 1765486,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49749251416c910add07",
               "name": "Stuart Millar",
               "profile_path": null,
               "id": 13779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49749251416c910add0d",
               "name": "Lawrence Turman",
               "profile_path": null,
               "id": 10770,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49749251416c910add13",
               "name": "Saul Chaplin",
               "profile_path": null,
               "id": 34359,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49749251416c910add19",
               "name": "Arthur Ibbetson",
               "profile_path": null,
               "id": 3454,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe49749251416c910add1f",
               "name": "Ronald Neame",
               "profile_path": "/6ET8GlWzxTkQu5sEH24I0UZ6IrG.jpg",
               "id": 7501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49749251416c910add25",
               "name": "Robert Dozier",
               "profile_path": null,
               "id": 30776,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49749251416c910add2b",
               "name": "Mayo Simon",
               "profile_path": null,
               "id": 66215,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.463458,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 86168,
      "vote_count": 8,
      "budget": 0,
      "overview": "Jenny Bowman is a successful singer who, while on an engagement at the London Palladium, visits David Donne to see her son Matt again, spending a few glorious days with him while his father is away in Rome in an attempt to attain the family that she never had. When David returns, Matt is torn between his loyalty to his father and his affection for Jenny.",
      "similar": [
         334,
         745,
         8272,
         11631,
         601,
         393,
         2539,
         8967,
         2024,
         858,
         111,
         634,
         1164,
         13,
         69,
         88,
         142,
         773,
         2288,
         4347
      ],
      "original_title": "I Could Go on Singing",
      "runtime": 100,
      "poster_path": "/qffefjyDheiJsJtl1kUsBrXu1UL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "barbican films",
            "id": 87476,
            "origin_country": ""
         }
      ],
      "release_date": "1963-03-07",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "It's Judy! Lighting up the lonely stage!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ronald Neame"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Robert Dozier",
         "Mayo Simon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057168/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNzk1MDQyNl5BMl5BanBnXkFtZTcwODA1NDAzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Judy Garland, Dirk Bogarde, Jack Klugman | See full cast and crew »"],
      "reviews": [
         "Just prior to starting her controversial TV series, Judy Garland returned to the big screen for two films: the straight drama \"A Child is Waiting\", and the musical drama \"I Could Go on Singing\". This last film could have been a personal triumph for her, and based upon her excellent performance, should have been. She sings, she emotes, she clowns, and not once does she disappoint. What turned off the critics was the old-fashioned mother love story attached to the glitz and glamour of Judy's performance. The story tells of an American singer, Jenny Bowman who comes to London for a sold-out series of concerts. She longs to see her illegitimate son Matt (Gregory Phillips) whom she left with his father, Dr. David Donne (handsome Dirk Bogarde) years before to pursue a career. Matt, unaware of who Jenny really is, is taken under her magic spell much to David's chagrin. Jenny becomes attached to Matt and undergoes a lot of trauma as she seeks to pursue her way back into David's life in order to become Matt's mother at last. The obvious Madame X story could be an instant turnoff for those who are sickened by sappy dramas like this, even the best ones of the 30's and 40's. However, Judy takes this beyond possible Ross Hunter soap opera twists and turns it into a one-woman show where she gave movie audiences a chance to see what she had been doing live on stage since her MGM years ended 13 years before. The excitement builds with Jenny's manager George (a young Jack Klugman) helping to build up her excitement and the audience's enthusiastic rise to their feet when she makes her first entrance. Matt's smile as she begins to sing is one that must have crossed many a young man's face during this era, particularly the gay fan base Judy had been building up during the past 10 years. His earlier performance in drag in a production of \"HMS Pinafore\" could have come off as camp (especially when he introduces Judy to one of his co-stars as \"One of the Pinafore's best top men\"), but fortunately, his youth kept him from looking like a female impersonator. Each of Garland's numbers are carefully staged with her outfits matching the backdrops, yet not blending in. Particularly dramatic is Garland's rendition of \"By Myself\", a Fred Astaire tune from \"The Bandwagon\". In a flaming sequined red dress (and an equally fiery mood), Garland unleashes all the passion of her performance. One solo ballad, \"It Never Was You\", is reminiscent of \"Friendly Star\" from her last MGM movie, \"Summer Stock\", done in a way which proves Judy could sing any type of song. \"Hello, Blue Bird\" is a companion tune with \"Over the Rainbow\", done in a subtle shade of blue, indicating that maybe Dorothy did find where those happy little blue birds fly. She sings the title song over the credits and in the rousing finale. Dirk Bogarde gets second billing, but doesn't appear as much as the sweet looking Gregory Phillips, then 14 years old, just a few years younger than Judy's daughter Liza. Bogarde and Garland do have some great scenes together, but lack the chemistry of Garland and her previous British co-star, James Mason. Phillips' excitement in the concert scenes is most believable, and he works well with the great lady of song. Following his Broadway experience with another great entertainer, Ethel Merman in \"Gypsy\", Jack Klugman does well as Garland's patient agent, George; It would be almost another decade before he found lasting fame on TV as part of \"The Odd Couple\" and later \"Quincy\". In the confrontation scenes with Garland, Klugman is outstanding. The small role of Ida, Garland's wardrobe lady, is played by the wonderful stage and screen actress Aline MacMahon, a tall lanky character performer who once had the opportunity for screen stardom but preferred the more real characters she ultimately played. (See her as one of the wisecracking \"Gold Diggers of 1933\" as well as one of the many kind hearted characters she played during her Warner Brothers days; You will see what a lovely performer she was, and the chance to appear with Garland was an excellent way to top her career.) It is a shame that this film came and went. It probably did very well in cities such as New York, Los Angeles, and San Francisco, where Judy's gay audiences flocked to see it, but probably failed in smaller areas where audiences wanted to remember Judy as Dorothy and not see her as a troubled adult with a scandalous past (much like herself). Sometimes its hard to tell where Judy ends and Jenny begins, but life is not imitating art here; She is only playing several aspects of who Judy was. Yes, she could be trouble (as Dirk Bogarde would reveal about her behavior on the set), but many people (Dirk included) would admit that when she did deliver, the magic she gave was worth the trouble. Jenny comes off as a troubled woman filled with the love for her audience that Judy indeed had, and an almost unfullfillable need for love from those immediately around her. There is a pain in Judy's eyes that comes out in the character that makes you wonder if she wasn't feeling pain inside from playing part of her own life. Yet, there is a humor that shows the survivor side as well, something Judy could portray as well. Both Jenny and Judy were very complex women, and Judy's ability to play that side of her without coming off as self-parody is a performance that was more than deserving of Academy Award consideration. It is that performance which takes away some of the clichés of an old formula and makes it fresh and moving.",
         "This film, Judy Garland's last, was panned at its premiere for being old-hat melodrama. The theme of secret mother love recalls \"Madame X\", with Garland as a Gladys George or Ruth Chatterton. Her big scene of renouncing her son over the telephone (white, naturally) recalls Luise Rainer in \"The Great Ziegfeld\". Aline MacMahon as Garland's acerbic confidante is like a Joan Blondell or Glenda Farrell. There is a show-must-go-on ending to gratify admirers of \"42nd Street\". Garland's character, Jenny Bowman, is a thinly disguised self-portrait, down to the fluttery neurotic mannerisms (with hints of pill-popping) and the ability to turn around an audience kept waiting an hour past time for her show at the London Palladium- where Garland had sensationally headlined in 1960. After \"A Star is Born\" Garland, cheated of her rightful Oscar, had withdrawn to concerts and cabaret for almost a decade except for \"A Child is Waiting\" and her overheated cameo in \"Judgement at Nuremberg\". Here, for the last time, she essays full-blooded emotional acting against a worthy British opponent (for James Mason, think Dirk Bogarde) and carries it off pretty well, never becoming tiresome and often laughing at her own overwrought persona. She still looks pretty, too, not quite overwhelmed by the blowsiness of her last few years. Bogarde, rapidly maturing after his daring role in \"Victim\", is a superb, challenging foil. Watch how he turns on a sixpence from the surgeon to the ex-lover after reassuring Garland that her throat is okay. His buttoned-up Britishness is never dull; like Ronald Colman, he radiates reliability and sensitivity in a coherent combination. He claimed to have rewritten all his dialogue with Garland during shooting; certainly their exchanges have a cut and thrust which prevents her from chewing the scenery. She has to react as well as posture. The fans are given generous dollops of Garland's act in between plot scenes, but these reasonably complement and underscore the themes of defiance and sacrifice. Yes, it's soapy and lush, with daft interludes like the helicopter flight over London. But a touch of Limey stiff upper lip takes the saccharine taste away, and the Ronald Neame of \"Tunes of Glory\" and \"The Poseidon Adventure\" knows how to keep a story rolling along. File with contemporary efforts such as \"The VIPs\" and \"The Yellow Rolls-Royce\" as an enjoyable wallow, to be taken with boxes of paper handkerchiefs and chocolates.",
         "Judy Garland is magnificent playing herself; sorry, playing Jenny Bowman, an American singer of a certain age, in London for a series of concerts at the Palladium. The movie is a mostly mediocre tale of mother love but as a showcase for Garland, both as actress and as a performer, (her scenes at the Palladium were probably as close as the movies ever came to capturing her on-stage persona), is it exhilarating and indelibly moving. By the time she gets around to her drunken 'I can't be spread so thin' speech all traces of the character have been wiped clean and it's Garland, raw and emotional, up there on the screen. She was never to make another film, which is probably just as well. With this you can say she went out on a high. Co-star Dirk Bogarde fights a losing battle, (and he gets some terrible lines to say). He's a prissy, fussy stuffed shirt and you can never believe that he and Garland could ever have been romantically involved. There is also a wonderful turn from that great and perpetually undervalued actress Aline MacMahon as Garland's dresser-cum-secretary-cum-companion. But it's Garland's show. The panavision frame can hardly contain her.",
         "This afternoon, TCM showed Judy Garland's last and sadly underrated film--restoring its wide-screened brilliance (letterboxed), shimmering color photography, and Ms. Garland's award-worthy portrayal of an internationally famed concert singer's stopover in London to perform at the Palladium and seek a reunion with her illegitimate teenaged son raised by his father (Dirk Bogarde). An astoundingly moving adult drama (not a bit of sentiment or bathos here) also offers the rare treat of seeing and hearing Ms. Garland perform four songs before a live audience at the Palladium: the title song, \"By Myself,\" the haunting \"It Never Was You,\" and, best of all, her incredibly rousing rendition of \"Hello, Bluebird!\" An excellent supporting cast (Bogarde proves her dramatic equal in one of his finest performances), gorgeous location photography in London, and fine, restrained direction by the woefully underrated Ronald Neame. Forget the parallels between the character played by Ms. Garland and her own tumultuous real life. This is a Grade-A production. You don't even have to be a Garland fan to be deeply moved by its emotional resonance. But Ms. Garland's aching \"It Never Was You\" and show-stopping \"Hello, Bluebird!\" are a definitive display of her timeless, unsurpassed musical artistry; and her touchingly underplayed performance remains her final (though sadly neglected) cinematic triumph.",
         "To be honest, I am not REALLY a Judy Garland fanatic, even though I ought to be. I found her TV show extremely entertaining when I saw them on DVD, and, well, how can one NOT be entertained by the Wizard Of Oz? And I've seen snippets of her here and there. I begin this review of 'I Could Go On Singing' saying this and defending my uh, un-Judy Garland obsessiveness, and then say that I found this movie incredibly entertaining! It's as if they got her to play herself during the last portion of her life, what, being a total singing diva, and let the audience go home happy. In this movie, she plays a famous singer who meets up with an old flame (played low-key to the hilt by Dirk Bogarde) to try to meet up with her son who she abandoned long ago, soon after meeting, she wants to keep him! But Bogarde says no! Oh no! What is she to do? Yes, that's pretty much the plot. But who cares when you get to see La Judy in action, singing, bitching and chewing everyone up and spitting everyone out? This is nothing but fun, and well, not Kramer Vs. Kramer. I really would recommend this to anyone, because this could entertain anyone, Judy fan or not (I tell you I'm not!!!!)",
         "After watching this again last night, I realized what an actress Miss Garland was. All you have to do is watch her eyes and you are watching her soul. Everything happens through them first. There are two scenes that stand out,and both near the end of the film - 1) she is on the phone with Matt where he is telling her he can't see her. The camera is locked on her for this scene, which lasts at least 5 minutes, and it never moves until she hangs up. Sitting in bed in a shadow, with a light reflected on her eyes, you see all the pain and anguish / 2) the next to final scene in the film where David goes to get her at the hospital. Again the camera is locked on the two of them as she rips open her heart and throws her life and feelings out for everyone to see. The final kicker is when she arrives at the theatre and George finally tells her off. She stands there and takes it, then gives him a little kiss then on stage she goes. The other film one should checkout is A CHILD IS WAITING if you want to see her act, and of course NURENBURG.",
         "Judy's last film ranks among her greatest as she lurches along as Jenny Bowman, grasping, insecure, and in life pretty much washed up. Echoes of Miss Garland's tragic real life cloud this film in places but that only serves to make it more effective. The three songs are superb and I only wish there had been more. Dirk Bogarde gives good support in a performance which by necessity is in the shadow of the tempestuous star. Seems better every viewing and highly recommended for Judy fans.",
         ". . . to a great artist: Judy Garland. At the end of her fabulous, unparalleled career, Garland made this swansong. Under-appreciated at the time of its release, it now grows in stature, like fine wine aging. Medical experts warned Judy would never sing again in the early fifties before she made the astonishing \"A Star is Born.\" Then she went on to her historic national concert tours, and fifteen years after \"Star\" she made \"I Could Go on Singing.\" Defying all predictions about her career, Garland triumphed. True, it wasn't easy, for her or her fellow actors and crew. Somehow, though, she just kept bouncing back, overcoming the most formidable obstacles. Here she's supported by an excellent cast headed by Dirk Bogard in a very strong performance. Ronald Neame's direction is on-target, though the script is a bit uneven. Yet the film is looking better and better, and viewers are growing in their appreciation of this legacy of one of the 20th century's most talented and beloved artists.",
         "Though she didn't and couldn't have known it, I Could Go On Singing became Judy Garland's farewell to the big screen. In this role she's perfectly cast in a role that bears a lot of resemblance to the real Judy Garland, a famous singer with problems of custody who wants the son she gave up for adoption years ago. Some twenty years before young medical student Dirk Bogarde, studying in America fell in love with singer Judy Garland just starting her career. That career is something she wanted more than him. But one thing couldn't be changed and that was the boy child Bogarde left with her. Bogarde marries a girl from Great Britain and later on Judy who can't manage a baby and a career gives him up to Bogarde who adopts his own son with his wife and raises him. Now his wife is dead and Judy's back to lay a claim on her son played by Gregory Phillips. Of course Bogarde has never told his son about his origin and therein lies the story. It's the kind of tale we've seen in hundreds of films and radio and television soap operas. But of course what makes I Could Go On Singing special is the singing of Judy Garland. Giving this film which title could serve as her epitaph is Harold Arlen and E.Y. Harburg who wrote the title song and who wrote her famous Over The Rainbow. Judy also sings By Myself which was sung and danced to by Fred Astaire in The Bandwagon. But a song I'm really glad she did was the Kurt Weill-Maxwell Anderson song It Never Was You. That song comes from the score of Knickerbocker Holiday and it didn't make the screen version. I'm glad that Judy Garland used it in this film, giving it the classiest interpretation possible. A passable enough drama, but great singing and the best epitaph possible for a career which was one of the brightest.",
         "Although the plot seems old and somewhat predictable, the performance that Judy Garland gives is nothing short of amazing. According to books and articles written about her, portions of the story of Jenny Bowman seem to be an almost autobiographical account of Judy's own conflicted personal and professional life at that time. It's the best opportunity for audiences to see the \"live\" performance documented on film of a true legend. I Could Go On Singing includes incredible songs, some prerecorded and some performed and captured live on film. All of them leave audiences wondering how she could have gone on singing! (\"By Myself\" is enjoyably exhausting to watch!!!) As far as I am concerned, anyone whoever questions Judy's acting ability must not have seen this movie or understood it's ironic treasures. The emergency room scene in I Could Go on Singing is the setting for one of Judy's most magical moments on film. Whether this was entirely scripted, ad-libbed or a hybrid of both.... Judy Garland and Dirk Bogarde give performances (in ONE TAKE yet) that any actor would kill to be able to perform. Although often thought of as sappy, melodramatic fare, I've come to appreciate \"I Could Go On Singing\" as the punctuation mark of a truly remarkable movie career."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": ["Barbican Films"],
      "summaries": ["Jenny Bowman is a successful singer who, while on an engagement at the London Palladium, visits David Donne to see her son Matt again, spending a few glorious days with him while his father is away in Rome in an attempt to attain the family that she never had. When David returns, Matt is torn between his loyalty to his father and his affection for Jenny."],
      "budget": 0
   },
   "movielensId": 43682,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-03-07",
      "dvdReleaseDate": "2004-05-11",
      "directors": ["Ronald Neame"],
      "runtime": 100,
      "movieId": 43682,
      "title": "I Could Go on Singing",
      "mpaa": "",
      "actors": [
         "Judy Garland",
         "Dirk Bogarde",
         "Jack Klugman",
         "Aline MacMahon",
         "Gregory Phillips",
         "Pauline Jameson",
         "Russell Waters",
         "Lorna Luft",
         "Joey Luft"
      ],
      "imdbMovieId": "0057168",
      "originalTitle": "I Could Go on Singing",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["KBEZ0mRDBBY"],
      "plotSummary": "Jenny Bowman is a successful singer who, while on an engagement at the London Palladium, visits David Donne to see her son Matt again, spending a few glorious days with him while his father is away in Rome in an attempt to attain the family that she never had. When David returns, Matt is torn between his loyalty to his father and his affection for Jenny.",
      "tmdbMovieId": 86168,
      "avgRating": 3.14286,
      "releaseYear": "1963",
      "numRatings": 7,
      "posterPath": "/qffefjyDheiJsJtl1kUsBrXu1UL.jpg"
   }
}