{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "fbi",
            "id": 1812
         },
         {
            "name": "train",
            "id": 13008
         },
         {
            "name": "prison break",
            "id": 191047
         }
      ],
      "imdb_id": "tt0120678",
      "video": false,
      "title": "Free Money",
      "recommendations": [
         71825,
         38453,
         63777,
         68964,
         28044,
         16089,
         243856
      ],
      "backdrop_path": "/8Pt0xKgdm13KI6tEIY2dZiVMRW5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Warden Sven 'The Swede' Sorenson",
               "gender": 2,
               "credit_id": "52fe44359251416c9100890b",
               "name": "Marlon Brando",
               "profile_path": "/84aAmVDUiQqzkfliOBemb7FaiuD.jpg",
               "id": 3084,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Bud Dyerson",
               "gender": 2,
               "credit_id": "52fe44359251416c91008907",
               "name": "Charlie Sheen",
               "profile_path": "/g4e1QpcNTpmq2uPr5GDNuMvjRuU.jpg",
               "id": 6952,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Judge Rausenberg",
               "gender": 2,
               "credit_id": "52fe44359251416c9100890f",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Guard",
               "gender": 2,
               "credit_id": "52fe44359251416c91008913",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ned Jebee",
               "gender": 2,
               "credit_id": "52fe44359251416c91008917",
               "name": "David Arquette",
               "profile_path": "/p5l4pnL9xhbHiKSipcdsCekoD52.jpg",
               "id": 15234,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Agent Karen Polarski",
               "gender": 1,
               "credit_id": "52fe44359251416c9100891b",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe44359251416c9100891f",
               "name": "Thomas Haden Church",
               "profile_path": "/a7a2cG0wtkKZ9NpkVfmcyn0UvOU.jpg",
               "id": 19159,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Lauter",
               "gender": 0,
               "credit_id": "5485d4a19251416a720030e0",
               "name": "Jean Pierre Bergeron",
               "profile_path": "/q1zw0WhG5O5teX9cjGi2OO9f0Tl.jpg",
               "id": 94884,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44359251416c91008925",
               "name": "Yves Simoneau",
               "profile_path": null,
               "id": 74566,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c9100892b",
               "name": "Joseph Brutsman",
               "profile_path": null,
               "id": 147956,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44359251416c91008931",
               "name": "Tony Peck",
               "profile_path": "/tEGw5o50ptOCe6RoKw4FN6Dc1Ea.jpg",
               "id": 138020,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.447183,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 30712,
      "vote_count": 13,
      "budget": 0,
      "overview": "The Swede (Marlon Brando), a prison warden, rules his family and his prison with an iron hand in one of the coldest parts of North Dakota. When an inmate dies under mysterious circumstances, however, the FBI sends in agent Karen Polarski (Mira Sorvino) to investigate. On the home front, the sons-in-law of the Swede, Larry (Thomas Haden Church) and Bud (Charlie Sheen) accidentally discover that a train loaded with millions of dollars of unmarked currency slated to be destroyed will soon be passing through. The temptation is too great and the guys hatch a scheme to rob the train. Of course, the biggest obstacle in their way is the Swede.",
      "similar": [
         76640,
         10471,
         107846,
         1701,
         9291,
         278,
         1429,
         75656,
         15794,
         5925,
         1368,
         708,
         57201,
         5924,
         262,
         10734,
         59965,
         5971,
         5503,
         7443
      ],
      "original_title": "Free Money",
      "runtime": 93,
      "poster_path": "/bgdtRP13kgU5P3f1vVwwCN8Edta.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sheen/Michaels Entertainment",
            "id": 40758,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmline International",
            "id": 40759,
            "origin_country": ""
         }
      ],
      "release_date": "1998-12-03",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Right scheme, wrong guys!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Yves Simoneau"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Tony Peck",
         "Joseph Brutsman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120678/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzcxMjAxNDIzNV5BMl5BanBnXkFtZTcwODk4NjcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Marlon Brando, Donald Sutherland, Thomas Haden Church | See full cast and crew »"],
      "reviews": [
         "If you can handle a world about half a bubble off plumb, there's a lot of fun to be had in \"Free Money\". It's quite obvious that all of these characters would vanish in a puff of smoke in what we call the \"real world\", but inside their own rules of logic and social constraints it all makes perfect and hilarious sense. Brando's warden personifies what Joseph Heller once called \"a gigantic belch of a man\", and Hayden Church and Sheen are perfect as man's men dragged either unconscious or screaming into their twin high school bride's playhouse version of married life. Donald Sutherland has a nice turn as a psychotic judge, and Mira Sorvino turns in a fine performance as a kind of bridge between \"our world\" and the asylum run by lunatics that the rest of the characters live in. It's quite possible that we could have lived without some of the brutality (cattle prods, gladiator fights in the prison) but then again, what the hell. It's a 90's film. --bt",
         "Loved this film. Marlon Brando, is a blunt over-the-top parody of a small minded religious, authoritarian, middle American bigot. Very humorous characterization as when Marlon Brando who is a sadistic murderous prison warden, prone to holier-than-thou, fire-and- brimstone religious judgments, covers his beloved truck with a giant American flag and gives thanks to the lord for his truck and all the great trucks America gives to the world. Brando is a genius. He makes these quirky speeches that are soft spoken and impromptu, yet so brilliant, subtle and befitting of the oddball character he plays. Although this movie is perfectly obtuse and surreal, it hilariously portrays a certain truth about dishonest, self- centered, small town Ameircan religious fanatics. Fun just to see the assortment of big name actors even if for minor roles. Sorvino plays an interesting character who makes it big as an FBI agent returning to her hometown to track down Marlon Brando . Lots of interesting comical references to small town politics and culture. Reminds me of David Lynch. Quirky and thoughtful.",
         "Everyone in this movie, Marlon Brando, Donald Sutherland, Charles Sheen, Thomas Hayden Church, Mira Sorvino, seem to simply be going through the motions, yet occasionally, bright moments of very dark comedy arise from the murky script. Speaking of the script, it just never gives the feeling of being fully developed, the actors appear to be simply freewheeling as they go along. Nevertheless, the film is watchable, and there is a chance that repeat viewings may actually improve the experience. A curiosity at best for Brando's over the top performance, a bad film at worst for the uneven script, \"Free Money\" might have just enough weirdness to survive. - MERK",
         "Free Money was not at all what I had expected. It is an entertaining comedy with Brando having great fun. Charlie Sheen also plays against type as a nerd duped into marriage with one of Brando's daughters. This premiered on Sky TV in the UK without even so much as a video release but is much more entertaining than a lot of other Charlie Sheen movies of late. I enjoyed it!",
         "'Free Money,'is a film the masses will not enjoy, for its seemingly avantgarde, zany style of film-making. At times the movies disposal of any recognisable main plot, creates not so much a sense of confusion, but focuses the audiences attention onto the true depth of its innovative,darkly sinister, serio-comical undertones. The film follows the story of two 'nobodys,'who end up married to twins of a draconian, bible-loving father (Marlon Brando,) who unfortunately happens to be the towns jailor. As time passes, Bud and Larry, the two hapless 'going nowhere' protagonists conspire to rob a train of money to solve their daily drudges, and to escape the ever-increasing slavery of the deranged 'Brando'!!! However, all does not go to plan, as the 'Swede'(Marlon Brando) smells a rat!!! Will they make it? is the question raised as all their plans buckle under the weight of the 'Swede.' People expecting a film with a good story will be dissapointed, but those seeking comical improvisation from Brando,a well crafted performance from Charlie Sheen, and a refreshing break into the wacky film techniques of 'Free Money,' will laugh and laugh, and possiblly cower- As the 'Swede' played by Brando is genuinely the scariest film character I've seen for ages- Look out!!!! It's a real shame this B movie, with A class actors didn't take off. It had the potential to be a real landmark film within this genre, but unfortunately, it went straight to T.V. Oh well. watch it, if ya dare!!!",
         "If you are a Brando fan, you'll love this film. He appears to be improvising throughout the film and takes everyone along for an hilarious ride. Sheen and Church deftly underplay their roles of the town dunces (although an argument could be made that the entire town is full of dunces). Good performances all around but the real treat is Brando. He fills the screen, literally and figuratively, with his presence.",
         "Currently this film has a 4.8 rating here at IMDb but in my opinion, VERY unjustly so! It teeters constantly between quirky, sweet humor, and macabre, almost cartoonish dark comedy. Which is to say, it's quintessential Brando. There's even a brief freeze-frame in the film of Brando with his hands flapping by his face in a 'neah-neah' gesture that is so 'Brandoesque'. He knows that his physical presence (a seemingly 500-pound ballet dancer) is a grand mixture of Father Christmas, Charlie Chaplin, Edward G. Robinson, and the man who bites off the heads of chickens at the circus. You just never know what you're going to get with him, so you - and the other characters in the film - are always kept a bit on edge (he played a somewhat similar character in \"The Freshman\"; another film that I've always thought was underrated). Anyway, the train heist is merely a minor plot point, so I'm guessing that maybe that's why the movie bombed. Audiences were probably expecting a heist story with a solid, formula plot (probably along the scale of \"Oceans Twelve\"), and I'm guessing they felt extremely uncomfortable with the film's humble speed. The big-name cast also probably didn't help, because the film has a real 'Canadian provincial' feel to it (Hollywood, this film is not!). Nevertheless, the entire cast is fantastic; particularly Thomas Haden Church who I never would have guessed was the same guy in \"Sideways\"! Perhaps I'm just nuts, but I think this is a sleeper gem that has yet to find its true audience.",
         "Any film with Marlon Brando is worth watching and I was not disappointed by this one. It is as though a bunch of big name stars got together and decided to make a screwball sicko black comedy. The film is erratic but overall they succeeded. Marlon Brando is superb as The Swede, a vicious and sadistic prison warden and a true `River of Fire' on earth. He clearly enjoyed this role. Charlie Sheen is funny but badly miscast loser due to his lack of accent (more on that later). Thomas Church is wonderful as Larry, a dim bulb but big-hearted co-accomplice with Bud. Donald Sutherland is very disappointing as Judge Rausenberg, as is Mira Sorvino as his daughter the FBI agent. The scheming, teenage twins were funny and wonderful. As with many screwball comedies, the plot jumped around frenetically and was difficult to follow. Still, I found it cohesive if lacking in continuity. The strongest points were the scenes with the Swede, the twins, and Larry and Bud while the weakest point was probably the laughably easy train robbery. Also, I found the pit bull like violence in the prison unrealistic and difficult to deal with. Having lived in Minnesota, I was disappointed by some of the details of the movie. First, Marlon moved his hands a lot when he talked while any Minnesotan knows that a true Swede talks with his hands still --- very still indeed --- at his sides. Yah sure, yabecha! Also, the accents were very erratic. Larry had a true northern Minnesota accent while Charlie Sheen had no accent at all --- he was miscast. Marlon and Donald did fairly well but the twins sounded like Valley girls pretending to be Minnesotans --- their enthusiasm for their roles made this cute rather than annoying. The film was so erratic and had such poor continuity that I can't give it more than a six but it still was worth seeing at least once. I recommend it to anyone with an open mind who can deal with the violence and the sexual content. This film definitely is not for children.",
         "I have to say i only saw this movie because of Mira Sorvino , but i enjoyed everything else in it too . But i should have known . You get Charles Sheen , Donald Sutherland and The Godfather himself , Marlon Brando together and you get a great movie. Brando is just amazing in his bad guy role and Sheen shows he´s still a great actor , and makes us forget all his true life problems . Sorvino shows her beauty in the few scenes she has . The twin girls are hilarious in their role . And as a special guest you have Martin Sheen too , which i have to say cracked me up . In the end you have a light , very entertaining , funny movie . SEE IT . Its worth your time .",
         "It's a good thing The Score came along for Marlon Brando as a farewell performance because I'd hate to think of him going out on Free Money. Not what his fans ought to remember him by. Brando in his last years is looking more like Orson Welles and Free Money is the kind of film Welles would have done looking for financing of his own work. Brando is the warden of a local prison which in America, when it's located in a small rural setting is usually the largest employer in the area. That gives one who is in charge a lot of clout. Unfortunately he has one weakness he indulges, his two twin bimbos otherwise known as daughters. Even when they get simultaneously pregnant by a pair of losers, Charlie Sheen and Thomas Haden Church, their hearts still belong to Daddy. Not to fear because Brando's willing to give them jobs in the prison where they work under conditions not much better than the convicts have. What to do, but commit a robbery of a train which goes through the locality every so often carrying used money to be burned by the Treasury. Although Free Money has some moments of humor, for most of the time it's quite beneath the talents of all those involved. Some of them would include Donald Sutherland as an equally corrupt judge and Mira Sorvino as his stepdaughter, but also straight arrow FBI agent. Of course these people and the rest of the cast got to work with someone who many rate as the greatest American actor of the last century. Were it not for Brando's presence and were it some 40 years earlier, Free Money would be playing the drive-in circuit in red state America where the populace could see how they're being satirized. Or a feeble attempt is made to satirize them."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Filmline International",
         "Sheen/Michaels Entertainment"
      ],
      "summaries": ["Walrus-like warden, Sven \"Swede\" Sorenson, a cross between Bluto and Wimpy, runs the prison, murders convicts who escape, and has the FBI on his trail in the form of agent Karen Polarski, the daughter of the town's corrupt judge. Swede's twins tell their father they're pregnant (they aren't), so he pushes their dim boyfriends, Bud and Larry, into shotgun marriages. He also turns his sons-in-law into slave labor, so Bud hatches an escape plan: to rob a train carrying old bills to the mint for burning. Larry's his reluctant accomplice. When Bud is captured and railroaded into Swede's jail, his death looks certain, until he hatches yet another plan that requires Larry's help."],
      "budget": 30000000
   },
   "movielensId": 43692,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-03",
      "dvdReleaseDate": "1999-11-02",
      "directors": ["Yves Simoneau"],
      "runtime": 93,
      "movieId": 43692,
      "title": "Free Money",
      "mpaa": "R",
      "actors": [
         "Marlon Brando",
         "Charlie Sheen",
         "Donald Sutherland",
         "Martin Sheen",
         "David Arquette",
         "Mira Sorvino",
         "Thomas Haden Church",
         "Jean Pierre Bergeron"
      ],
      "imdbMovieId": "0120678",
      "originalTitle": "Free Money",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["WcN-ZVOIMkc"],
      "plotSummary": "The Swede (Marlon Brando), a prison warden, rules his family and his prison with an iron hand in one of the coldest parts of North Dakota. When an inmate dies under mysterious circumstances, however, the FBI sends in agent Karen Polarski (Mira Sorvino) to investigate. On the home front, the sons-in-law of the Swede, Larry (Thomas Haden Church) and Bud (Charlie Sheen) accidentally discover that a train loaded with millions of dollars of unmarked currency slated to be destroyed will soon be passing through. The temptation is too great and the guys hatch a scheme to rob the train. Of course, the biggest obstacle in their way is the Swede.",
      "tmdbMovieId": 30712,
      "avgRating": 1.5,
      "releaseYear": "1998",
      "numRatings": 3,
      "posterPath": "/bgdtRP13kgU5P3f1vVwwCN8Edta.jpg"
   }
}