{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "marshal",
            "id": 1502
         },
         {
            "name": "outlaw",
            "id": 9503
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "yoakam",
            "id": 10510
         },
         {
            "name": "tucson",
            "id": 10512
         }
      ],
      "imdb_id": "tt0179473",
      "video": false,
      "title": "South of Heaven, West of Hell",
      "recommendations": [],
      "backdrop_path": "/j8nOWhedXoPNi9hHGVGSjFnlTLn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Valentine Casey",
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8c3",
               "name": "Dwight Yoakam",
               "profile_path": "/pyqKTjGy0m4aBKDqbH4ne8hUwLi.jpg",
               "id": 20309,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Brig. Smalls",
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8cb",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Adalyne Dunfries",
               "gender": 1,
               "credit_id": "52fe4497c3a368484e02b8cf",
               "name": "Bridget Fonda",
               "profile_path": "/yWxhdN59eksIqyBHdjUcLRgCIaI.jpg",
               "id": 2233,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Shoshonee Bill",
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8d3",
               "name": "Peter Fonda",
               "profile_path": "/dgorN06SQ9ZNL2NY3I7BNxg93lc.jpg",
               "id": 8949,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Arvid Henry",
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8d7",
               "name": "Paul Reubens",
               "profile_path": "/qiY2maQ1iFnoaUiGNGLTKnaj3Xu.jpg",
               "id": 5129,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Agent Otts",
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8db",
               "name": "Bud Cort",
               "profile_path": "/mwCVkL9BG1ZCF9icbcKjE8TCS7H.jpg",
               "id": 4971,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Uncle Jude",
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8df",
               "name": "Michael Jeter",
               "profile_path": "/kCFHCa8Uy4rsgbzWxPCu8xSut6A.jpg",
               "id": 2169,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Taylor Henry",
               "gender": 2,
               "credit_id": "59e392e99251410b67000035",
               "name": "Vince Vaughn",
               "profile_path": "/r6ISnWjO5fA9QA1BTWUGaqdPyxE.jpg",
               "id": 4937,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8b3",
               "name": "Dwight Yoakam",
               "profile_path": "/pyqKTjGy0m4aBKDqbH4ne8hUwLi.jpg",
               "id": 20309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4497c3a368484e02b8b9",
               "name": "Stan Bertheaud",
               "profile_path": null,
               "id": 91646,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a368484e02b8bf",
               "name": "Dwight Yoakam",
               "profile_path": "/pyqKTjGy0m4aBKDqbH4ne8hUwLi.jpg",
               "id": 20309,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 2.084088,
      "production_countries": [],
      "id": 24470,
      "vote_count": 3,
      "budget": 0,
      "overview": "Valentine Casey is a Marshal in the desolate Tucson territory of the early 1900's. On Christmas Eve, his outlaw family pays him a disturbing visit. He must confront the sins of his past. He and his partner, U.S. Christmas, journey through the desert to a small town that the ruthless Henry Clan has hit in order to save Casey's love, Adelyne.",
      "similar": [
         11564,
         2142,
         22323,
         3134,
         8810,
         281,
         948,
         298312,
         14433,
         4638,
         949,
         281957,
         10212,
         43923,
         133805,
         445954,
         4771,
         12162,
         769,
         185
      ],
      "original_title": "South of Heaven, West of Hell",
      "runtime": 104,
      "poster_path": "/2Rdv3iyD5NIgROY9MeXJ9owfiFT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-01-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dwight Yoakam"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Stan Bertheaud",
         "Otto Felix"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0179473/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDczNDg4NDM4OV5BMl5BanBnXkFtZTcwNDU2ODEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Billy Bob Thornton, Luke Askew, Dwight Yoakam | See full cast and crew »"],
      "reviews": [
         "Picking up the jacket of this DVD in the video store I was intrigued. Having watched this sorry excuse for a western I think director Dwight should give a medal for the guy who designed the jacket and has lured to their doom other unsuspecting viewers. The script of the film is potentially interesting... and I bet that's what the impressive members of this film's cast thought when they signed up for this project. But, Dwight, buddy... stick to singing and acting. This must be the worst directed film I have ever had the displeasure of seeing. Badly paced, wooden performances, awkwardly shot, weird music, and even terrible costumes - my God, what is Billy Bob Thornton's wig all about??? I could go on for another ten lines, but this film just isn't worth the bother. Anyone who hates wasting money should stay well away from this stinker.",
         "I love Dwight Yoakam's music and songwriting, he's surely one of the best singer/ songwriters out there but I think he should leave the screenwriting to professional screenwriters. This film looks beautiful, but the plot leaves a lot to be desired and the dialogue is often very dull. It also makes no sense that I can decipher. Dwight has some positives in this, as bad as it is. For instance, he looks great on a horse, but he looks uncomfortable in front of the camera here, which is unusual for him, given his other movies. The characters are interesting enough, but not given enough development that we can see. I don't think Dwight should give up directing entirely, but I would not recommend seeing this. The beautiful scenery and cinematography make it watchable. The horses are beautiful, too.",
         "When you see a film with such great actors, and fantastic scenes, real masterpieces, you ask yourself what went wrong , that the sum of it all is very unsatisfactory. In my opinion, when people go to the movies, they want to enjoy themselves. They do not mind seeing a depressing film, if there is an idea behind it that will stimulate them intellectually. This film has no great idea behind it, it is just depression for depression´s sake. I think I saw the most cruel scenes I could ever think of and what for? The happy moments of this film, like when Val kisses Bridget Fonda on the balloon, or when he is making love in his office are just great. Vince Vaughn is quite impressive as the bad guy, and Dwight Yoakam is a convincing Val. It is a shame that Peter Fonda and Billy Bob Thornton have such small parts. The westerns of the fifties had a certain cheerfulness in them, even when the story was sad, and that is what is lacking in this film.",
         "Having viewed this film three times now, I think I finally have enough together to write a decent review for it. First off, I waited a long time to see this (over two years) and it definitely did not dissapoint. Mainly because I knew the direction that Dwight Yoakam was moving in on this one. He wanted to create a western that was a bit different than the standard shoot 'em up and he wanted to create a story that mirrored a lot of events from his own life while ,at the same time, not spelling everything out for the audience and letting them think and decipher for themselves. While he certainly succeeded in doing this, he also manages to use the ensemble cast for all its worth by bringing in the biggest mix of oddball and eccentric characters I've seen since Jim Jarmusch's \"Dead Man\". \"South of Heaven, West of Hell\" uses the pretty basic story (seemingly) of a man, Valentine Casey (Yoakem) who has been raised by an adoptive family known as the Henrys. The Henrys are led by none other than western vet Luke Askew who seems to have the most level head of the gang. His socio-path son Taylor (Vince Vaughn) does most of the running while his cronies (Paul Reubens and Michael Jeter) follow him around like whipped puppies. Natalie Canerday (Linda from Sling Blade) plays Sissy, the child like sister of the brood who is desperately in love with Valentine. At some point, before the story starts, Valentine dissowned the outlaw family who raised him and fought in the Spanish American war, later becoming a sherriff. All is peaceful for Valentine, living the life of a sheriff in a town where nothing happens, until the Henrys come riding into town raising all manners of hell and pulling a \"wild bunch\" style attack. A few people are killed (the Henry's must not be much for target practice since they fired over a hundred rounds) and a couple more are shot. Valentine waits about a year, then retaliates. That's all I'm going to say in the way of the story, but there's a lot more than that. Let's talk about the characters for a minute. Ol' Val is about the sanest one of the bunch. He's a mild-mannered, likeable guy who is tough only when he has to be. His side kick is an \"odd bird\" who has a thing for wearing dresses. Bo Hopkins plays Doc Angus Dunfries, a blacksmith. A barely recognizable Billy Bob Thornton comes into town as a traveller named Brigadier Smalls. With him is his travelling buddy, the nearly mute Babcock (Warren Zevon). They are escorting Adelyne (Bridget Fonda), Doc Angus's niece, and Val's soon-to-be love interest. Paul Reubens (looking very much like he did in \"Buffy the Vampire Slayer) plays one sick puppy here, as one of the twisted members of the Henry tribe. One of my favorites was Bud Cort, playing a government agent with some papers that strongly suggest that Valentine was killed in the war. He gets off the train, whining about the heat and a toothache. It's pretty clear that this guy is here mainly for comic-relief. He appears to have the worst luck in history and the belt scene had me in stitches. It's easy to see why this only got a limited theatrical release. \"South of Heaven, West of Hell\" isn't necessarily the kind of film that the masses will flock to. I think Yoakam made the film with that in mind, knowing that it would find it's intended audience on video. It's true that the majority just won't get it. To enjoy this film, you have to go into it with an open mind and sort of block out everything around and that's something that a lot of people just aren't capable of. It's hard to explain just what kind of movie this is but I think Vince Vaughn summed it up best, in an interview, by saying that it is the \"punk rock of westerns\". I enjoyed this movie a lot and I'm sure it will probably go down as one of my year's favorites. There is a lot here to enjoy and one viewing is not enough. There is a lot of black comedy that I didn't pick up on the first time around and there is also a lot more going on with and between the characters than what is going on on-screen. It's not just \"worth a viewing\". It's worth several.",
         "Ugly violent, incoherent western. Directed, scored and starring country singer Dwight Yoakum. The music score is also a disappointment. It was exec produced by Buck Owens. You would think all this would bring you a half way decent western, but I think the Bakersfield Ca sun got to them first! Even veteran character actors such as Bo Hopklins and Matt Clark can't save this one. Vince Vaughn, Billy Bob Thornton, Paul (Pee-Wee Herman) Ruebens, Bud Cort, Peter and Bridget Fonda - an unusual cast for a western, is wasted in this beautifully photographed travesty. Hang up your guns Dwight, stick to singin'",
         "Rebecca: This is so bad it's almost good. Enid: This is so bad it's gone past good and back to bad again. We rented this DVD shortly after Noble Willingham's death, thinking that we would watch it as a tribute. There were two problems with this idea. Noble's character gets killed off very early and the DVD was defective. It was missing the scene that explains what's going on. I have to assume that the handful of positive comments were from people who watched an obscure director's cut that had this explanatory scene. But seriously, the writers of the screenplay were totally inexperienced (at screenplays) and the director was totally inexperienced (at writing screenplays and at directing screenplays), so the roadkill that resulted should be no surprise. Let this comment serve as a warning to potential viewers, just because a lot of actors who have performed in excellent films are part of this ensemble does not make it worth viewing. There are some decent performances but the whole is a lot less than the sum of its parts, which in fact adds up to less than zero. Bizarre (in an uninteresting way), sadistic (in a vaguely boring way), foul-mouthed (in a grammar school way), half-baked (in a bad raw egg way), and disorganized (in a director should burn in hell way). It is mostly unwatchable, as even the isolated parts that could be entertaining are burdened with Yoakam and Bertheaud's comically false dialogue. Although this at least gives the production its only hint of unity and should dispel the temptation to blame the result on excessive improv. Imagine inserting clips of \"El Topo\" in no logical order into \"Tombstone\" and you can approximate the product Yoakam inflicts on us unsuspecting Noble Willingham fans. He gave himself the lead role as Valentine Casey, a U.S. Marshall in 1907 Arizona. Casey's old gang and surrogate family keeps popping up and a lot of people are killed and Casey goes after them and eventually everything gets sorted out, although even after just watching the whole thing I couldn't have told you how. Don't understand why the gang keeps turning up or why the Marshall left them to become a lawman or why Pee Wee has put on so much weight. Don't really care either, I think we will just stick to \"The Corndog Man\" and the real \"El Topo\". Then again, what do I know? I'm only a child.",
         "I really like Dwight Yoakam...I love seeing him in interviews, I love his music, I love seeing him in concert. He is one of the most interesting and talented people in the music industry. Sorry to say, he should stay in the music industry. This was one of the worst movies I can remember seeing. I tried and tried to think of something I liked about it, just because I like Dwight so much...but I couldn't come up with a single good thing to say about this movie.",
         "It was surprising to me to see that 1/3 of the people who had voted for this movie gave it a 1! I thought this was one of the best Westerns to come out of Hollywood for a LONG time. The story and acting is superb, and so is the cinematography. These three things are what make a great movie. You could argue the forth being controversy/making you think, but it is not absolutely necessary. This is a great film. So don't listen to the others because they have no sense of taste. If you like Westerns and Independent films, check this one out. It is obviously an overlooked gem.",
         "While some viewers may have difficulty in unraveling this sardonic allegory, Dwight Yoakam's diehard fans will be able to recognize their star at his zenith. South of Heaven, West of Hell is filled with irony, parody, and quiet innuendo. It is a gem of a movie which is sure to attract even those not acquainted with Yoakam's intellectuality. Pervasive black humor weaves its way in and out of nearly every scene. Some may be put off by what appears to be gratuitous violence, but a further look sets up Yoakam's metaphorical statement regarding the internal conflict humans experience in their transformation from victims ambling through the ravages of hell toward survival in the most unexpected heavens, thus rescuing themselves from the morbidity of life. The film seems to be disjointed and vague in spots, and leaves the viewer seeking answers to subtle understated plot twists. Like Yoakam, himself, the mysterious, baffling, and somewhat enigmatic writing accomplishes just what he has set out to do: engage the audience just uncomfortably enough to evoke deeper thinking. South of Heaven, West of Hell embraces both the past and the future, much like Yoakam's latest song collection, Tomorrow's Sounds Today. The film tells a story of redemption and vindication, a shedding of old nightmares in search of new dreams. It is about tying up loose ends while scaling new heights. It is at once ancient ritual and oddly nouveau. Dwight Yoakam is always pushing the parameters while remaining true to who he is. He has never forsaken that identity, or given in to mediocrity. While South of Heaven, West of Hell may be Yoakam's first attempt in breaking through the barriers into film production, one can only hope this will not be his last endeavor in this genre. He is a quintessential artist who deserves more recognition than he seems to get. If Hollywood is smart, they will sit up and take notice of the rare gem quietly walking among them. True talent is true talent, no matter how different the package. Dwight Yoakam may be just becoming the brightest diamond around.",
         "As a great fan of Dwight Yoakam's music as well as his acting performance in \"Sling Blade\", I was extremley disappointed with \"South of Heaven, West of Hell\". What a stinker! Terrible writing with very uninspired and flat performances by several otherwise talented actors. I swear Billy Bob Thornton must have been reading straight from cue cards throughout his minor five minute robotic appearance. It's almost as if he and several of the others must have owed Dwight a favor and that's why they agreed to take part in this project. Otherwise I can't understand why they would want to have anything to do with such a boring and pointless film."
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "Delta Deuce Films",
         "Goldmount Pictures",
         "Movie Mongrel"
      ],
      "summaries": ["Valentine Casey is a Marshal in the desolate Tucson territory of the early 1900s. On Christmas Eve, his outlaw family pays him a disturbing visit. He must confront the sins of his past. He and his partner, U.S. Christmas, journey through the desert to a small town that the ruthless Henry Clan has hit in order to save Casey's love, Adelyne."],
      "budget": 4000000
   },
   "movielensId": 4379,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-01",
      "dvdReleaseDate": "2001-08-21",
      "directors": ["Dwight Yoakam"],
      "runtime": 104,
      "movieId": 4379,
      "title": "South of Heaven, West of Hell",
      "mpaa": "",
      "actors": [
         "Dwight Yoakam",
         "Billy Bob Thornton",
         "Bridget Fonda",
         "Peter Fonda",
         "Paul Reubens",
         "Bud Cort",
         "Michael Jeter",
         "Vince Vaughn"
      ],
      "imdbMovieId": "0179473",
      "originalTitle": "South of Heaven, West of Hell",
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": ["ZTf1VAxtbpA"],
      "plotSummary": "Valentine Casey is a Marshal in the desolate Tucson territory of the early 1900's. On Christmas Eve, his outlaw family pays him a disturbing visit. He must confront the sins of his past. He and his partner, U.S. Christmas, journey through the desert to a small town that the ruthless Henry Clan has hit in order to save Casey's love, Adelyne.",
      "tmdbMovieId": 24470,
      "avgRating": 1.94828,
      "releaseYear": "2000",
      "numRatings": 29,
      "posterPath": "/2Rdv3iyD5NIgROY9MeXJ9owfiFT.jpg"
   }
}