{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "philosophy",
            "id": 490
         },
         {
            "name": "painting",
            "id": 5918
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "middle age",
            "id": 176793
         },
         {
            "name": "marital infidelity",
            "id": 213488
         },
         {
            "name": "german poetry",
            "id": 221686
         }
      ],
      "imdb_id": "tt0094663",
      "video": false,
      "title": "Another Woman",
      "recommendations": [
         22477,
         8217,
         15867,
         28384,
         11337,
         12762,
         8288,
         19200,
         11382,
         11448,
         30890,
         9466,
         9689,
         10462,
         9684,
         56167,
         11562,
         9716,
         9688,
         10440
      ],
      "backdrop_path": "/mKRVshsLHCKdPu8ukp4Yz2uNen9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hope",
               "gender": 0,
               "credit_id": "52fe4442c3a368484e018d3f",
               "name": "Mia Farrow",
               "profile_path": "/kuLfS2jQOnfIOwCO7RHlwjDIERQ.jpg",
               "id": 12021,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Marion",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018d43",
               "name": "Gena Rowlands",
               "profile_path": "/kRHNvkcJlwBr1Xb9XREiZob29NX.jpg",
               "id": 4800,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ken",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d47",
               "name": "Ian Holm",
               "profile_path": "/27SAk1v043GdOeAxT5pPoMUYhGg.jpg",
               "id": 65,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018d57",
               "name": "Blythe Danner",
               "profile_path": "/vGv4EMRcy7xrRt8OvDzSuXohXjv.jpg",
               "id": 10401,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d5b",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Kathy",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018d5f",
               "name": "Betty Buckley",
               "profile_path": "/pP5F1yNuvYfvMuft578k6dwgtAh.jpg",
               "id": 52462,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Laura",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018d63",
               "name": "Martha Plimpton",
               "profile_path": "/7lU1kci6OZMwZk5Kxfnz0u8B5l5.jpg",
               "id": 17495,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Le père de Marion",
               "gender": 0,
               "credit_id": "52fe4442c3a368484e018d67",
               "name": "John Houseman",
               "profile_path": "/yN0o6KfCD7Lbb50oYuYn1oxHONB.jpg",
               "id": 11783,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018d6b",
               "name": "Sandy Dennis",
               "profile_path": "/hy3QacaLrl2GtSPKmZtgSIQJfJG.jpg",
               "id": 18365,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Le père de Marion enfant",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d6f",
               "name": "David Ogden Stiers",
               "profile_path": "/zngM0eXq6RuYZmdocsAY2AMKUja.jpg",
               "id": 28010,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d73",
               "name": "Philip Bosco",
               "profile_path": "/8B8EQk868fQF8fGZ1w33XDV5Z1S.jpg",
               "id": 6541,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d77",
               "name": "Harris Yulin",
               "profile_path": "/MCW4IR3mEB6oeRbX9bfeHkZ3qm.jpg",
               "id": 1166,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Lynn",
               "gender": 1,
               "credit_id": "5866b505c3a3684f530007dd",
               "name": "Frances Conroy",
               "profile_path": "/mQsO4JrmYWKTXtFg7u3zhYGiXfM.jpg",
               "id": 4432,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Engagement Party Guest",
               "gender": 2,
               "credit_id": "5866b549c3a3684f59000707",
               "name": "Fred Melamed",
               "profile_path": "/6K5KWzJ5npYkGl3RmL07zf3Urjo.jpg",
               "id": 105303,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Donald",
               "gender": 0,
               "credit_id": "5866b55bc3a3684f560007d0",
               "name": "Kenneth Welsh",
               "profile_path": "/q44fb9FLrA9ZWzP8xGv6PcX24V6.jpg",
               "id": 6074,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Engagement Party Guest",
               "gender": 1,
               "credit_id": "5866b570c3a3684f65000970",
               "name": "Dana Ivey",
               "profile_path": "/12mxrB5iT1TAwCzIZvmcFGLBQ52.jpg",
               "id": 13314,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Engagement Party Guest",
               "gender": 0,
               "credit_id": "5866b5a7c3a3684f5c000806",
               "name": "Alice Spivak",
               "profile_path": "/wz7LV3BrJt08zqK8ubnL2YonJd6.jpg",
               "id": 1194430,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Laura's Boyfriend",
               "gender": 2,
               "credit_id": "5866b5d092514109d10007df",
               "name": "Josh Hamilton",
               "profile_path": "/uzqTbGXDrVp6j97OkbFBphJUmKf.jpg",
               "id": 52419,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d3b",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d4d",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018d53",
               "name": "Sven Nykvist",
               "profile_path": "/2S1wtqPzCUlAMVpor5o0YHkme21.jpg",
               "id": 11905,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57194ade925141036800003a",
               "name": "Santo Loquasto",
               "profile_path": null,
               "id": 23966,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "58519907c3a3682dfe01a493",
               "name": "Susan E. Morse",
               "profile_path": null,
               "id": 10440,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.483961,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22478,
      "vote_count": 63,
      "budget": 0,
      "overview": "Marion is a woman who has learned to shield herself from her emotions. She rents an apartment to work undisturbed on her new book, but by some acoustic anomaly she can hear all that is said in the next apartment in which a psychiatrist holds his office. When she hears a young woman tell that she finds it harder and harder to bear her life, Marion starts to reflect on her own life. After a series of events she comes to understand how her unemotional attitude towards the people around her affected them and herself.",
      "similar": [
         8967,
         112160,
         13,
         340666,
         263472,
         509885,
         309809,
         38684,
         609,
         11816,
         8204,
         5143,
         12920,
         64678,
         3482,
         232175,
         9081,
         100271,
         1626,
         12225
      ],
      "original_title": "Another Woman",
      "runtime": 84,
      "poster_path": "/cOtXweHPz7XkIyO8admUc4crDWr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1988-10-13",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Woody Allen"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Woody Allen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094663/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzYxMTYyMDA4NF5BMl5BanBnXkFtZTcwMjgxNzUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Gena Rowlands, Mia Farrow, Ian Holm | See full cast and crew »"],
      "reviews": [
         "It's worth noting that in 1978, ten years before he made \"Another Woman,\" Woody Allen created another quiet film, a drama with prominent Bergmanesque influences. The film was called \"Interiors,\" and it was a tribute, or an American take on Bergman's \"Cries and Whispers.\" \"Interiors\" examined the relationships of three sisters and their husbands in the face of the divorce of their dominant mother and detached father. The film essentially detailed the fall of \"interiors,\" or illusory worlds created by the dominant mother in the face of tragedy and loneliness. \"Another Woman,\" made ten years later, shares similar themes with \"Interiors,\" but it is more akin to Bergman's \"Wild Strawberries\" than to \"Cries and Whispers.\" It is a story of a university professor, played spectacularly by Gena Rowlands, in whom something stirs when she overhears a therapy session with a young 30-something woman who is discontent with her life. The professor, Marion, feels an emptiness rise inside her - an emptiness that had settled there years before, that she can consciously feel now. Little by little, like in \"Interiors,\" the world she has constructed for herself, a cold, cerebral world, deconstructs. Marion despairs, enters into conflicts with herself, and questions endlessly trying to reason her way out of her malaise. But the cure for her malaise is not rational resolution and she, realizing that her strongest characteristic (namely her rational intelligence) is not enough to untangle what worries her, finds herself entirely helpless in the face of an unraveling existence. Her drama is very much like the drama of Professor Isak Borg from Bergman's film, a man on his way to receive a medal for his lifetime achievements. And, on the road, he also succumbs to the same malaise as Marion, the same questioning and the same painful re-evaluation. The horror shared by both Marion and Professor Borg, of course, is that despite their highly lauded accomplishments and their intellectual self-satisfaction, they feel void. There must, in other words, be something else to life than strictly intellectual work, however satisfying it may be. In Bergman (both \"Cries and Whispers\" and \"Wild Strawberries\") and in Allen (both \"Interiors\" and \"Another Woman\") life falls under question. The entire existence is evaluated, its worth and meaning doubted. In \"Interiors\" and \"Cries and Whispers,\" however, the meaninglessness pervades everything in the films - the dialogues, behaviors and even visuals. The sisters in \"Interiors\" shatter the mother's reality and find nothingness - they continue as they were, much like the two sisters in \"Cries and Whispers\" for whom the death of their young sister changed absolutely nothing, and only confirmed their beliefs about the world. However, \"Another Woman\" is not as stark (though it is stark indeed at times). Marion grabs at the chance to re-evaluate the life she feels she painfully wasted and tries to start again. It's not a false choice, or a gimmick on Allen's part, but it's a true depiction of Marion's sincere desire to continue to struggle because her life does have value for her. She rediscovers a passion for the struggle and her motivation is the same curiosity that made her go through the questioning process in the first place. \"Another Woman\" is a testament to the fact that Woody Allen was still at the top of his game in the late 1980s. It is a brilliant, honest and (surprisingly) warm film. It is not a remake or rip-off of Bergman's work, though it is highly influenced by him (which shouldn't seem so surprising to anyone, because Bergman himself was influenced by the most basic questions of existence). \"Another Woman\" is an existential film that is both uncompromising and not hopeless. It's one of my favorite Woody Allen films and it reveals to us not only a great American director, but one whose films are of worldly greatness.",
         "Woody Allen's \"Another Woman\" is, upon rediscovery, a film of great power and feeling. Sadly, not many people will be open to rediscovery after the initial viewing. Gena Rowlands stars as Marion Post, a 50ish philosophy professor whose life is in order. She rents an apartment to work on her latest book. By accident, she discovers that through the heating duct, she can hear all conversations from the psychiatrist located in said building. At first, she covers the duct with cushions to block the sound, but she decides to listen in after hearing, by accident, the testimony of a young pregnant woman. This sets in motion a chain of events that changes Marion forever. Woody has said that he originally conceived the idea as a comedy and indeed, it could be played that way (on a smaller scale in \"Everyone Says I Love You\"). But here, Allen resists the temptation to play it for laughs. In fact, there is not one single moment of comedy relief in his film. I think that is a wise decision. I was so absorbed by Marion's journey that comedy would have broken the mood of the film. This film is another venture into Bergmanesque cinema and \"Another Woman\" can compare with the very best Bergman. Gena Rowlands hasn't had a role this good since the films of her late husband John Cassavetes. This in fact, shows another side of Rowlands; a more restrained, mannered character than the fiery, passionate characters in the Cassavetes films. It just shows the different types of roles Rowlands can play so well. She deserved an Oscar nomination for this. In fact, the whole film is well cast by Allen. Gene Hackman is great in a mellow part as Marion's ex-lover. Blythe Danner makes a return to form as Marion's best friend. It is great to see Danner do what she does best, especially following the horrible \"Brighton Beach Memoirs\" in which she was underused. Ian Holm is superb as Marion's husband, who as Roger Ebert puts it \"must have a wife so he can cheat on her\". In his final film, John Houseman allows himself to appear weak and frail; quite a change from the pillar of strength in \"The Paper Chase\" and a good cap to a great career. I mentioned at the beginning that not many people will be open to rediscovering \"Another Woman\". I think that is correct. Here are my reasons why. First, the film is deliberately paced, even with a short running time of 81 minutes. Most viewers' attention spans won't be able to tolerate the long takes Allen is famous for. Second, the film doesn't offer any instant gratification or closure. Allen's story is one of those stories that just can't have a typical happy Hollywood ending. Third, there is T&A, even though adultery plays a large part in the story. So if you're looking for a fast paced film with T$A and guns and action and a happy ending, you might as well move on. \"Another Woman\" is one of those films in which rediscovery is necessary. Allen packs so much into 81 minutes that multiple viewings are necessary to absorb it all. If you make the effort to see it again, you might find that \"Another Woman\" is a film of great power and feeling that works better every time you see it. **** out of 4 stars",
         "This is by far my favorite Woody Allen straight drama (most of his other \"serious\" films, like Crimes and Misdemeanors and Husbands & Wives, have comedic moments). His third \"heavy film\" (after Interiors and September) is chamber drama, beautifully acted and directed. Most of the elements found in Allen's other post \"Annie Hall\" films are here (the upper crust Manhattan intellectuals, dysfunctional relationships), but what's missing are the laughs. The film is very serious stuff, involving repressed emotions and alienation. There is simply no place for Woody's usually nervous character in Another Woman. You can still tell that this is one of his films because of the characterizations. Gena Rowlands is in nearly every scene and is classy, as usual, and the rest of the ensemble cast is just as good. My favorites were Gene Hackman and Ian Holm. The title is fairly clever as well; it doesn't refer to what you might think.",
         "The melancholic mood and Gena Rowland's impressing acting are the most important elements of this movie. It's the Ingmar-Bergman type of film, like \u0084Interiors`, much more serious and thoughtful than all of Woody Allen's other movies, not at all typical for him. In my opinion, it's even more vivid than \u0084Interiors` because there are less people involved and \u0096 something that happens less and less in Woody Allen's movies \u0096 there is only one main character. This time, it's the character herself who tells the story which is really unusual for Allen. By leaving every other trade mark in plot and topics away, Allen concentrates on the intellectual dialogues and the analyses people make about each other. It's characteristic that Marion Post is a professor for philosophy. She automatically analyzes everybody around her, which leads to the fact that they start analyzing her. Her crisis begins, when she learns that people talk about her \u0096 which, of course, is something completely natural \u0096 and therefore starts analyzing herself. Her character really impressed me because I know people myself who are exactly like Marion Post. Woody Allen is a brilliant psychologist who watches people precisely and that's why he is able to create such believable characters.",
         "This is a character study film. There are many \"layers\" to the story. Allen comments via the character in a subtle way. The film uses surreal and the subconscious to lead the characters to their destination. I like the fact that the ending left the viewer with his or her own ideas about the outcome of the characters. Nothing in this film is \"forced on the viewer.\" Gena Rowlands narrates and is very easy to listen to. This is definitly not a film for the person who would rather watch than think. Rowlands puts in a very fine performance, in my opinion, she is one of the under-rated actress' of her time. The film runs less than 90 minutes. I didn't know what to expect when the film started but was surprised and pleased with this film!",
         "This is a wonderful movie but not an easy one. It mixes the present with the past and dreams with real life. You will need to see it three or four times at least to get the best out of it but it's well worth doing. Every performance is spot on, every scene has a purpose, there is no padding here. It comes as a shock to Gena Rowlands character that she is not what she thought she was, that people do not view her in the way she thought they did.She takes a journey through her life to see what went wrong with the unwitting aid of a psychiatrist and patient in the apartment next door. The film ends abruptly without a proper resolution just as life can and does. The final line of Gena Rowlands beautiful narration will haunt you. A masterpiece of writing and direction to say nothing of superb acting and masterful cinematography.",
         "I just watched this last night, and I've been thinking about it all day. What an amazing film! So poignant, so subtle. A woman re-evaluates her life and begins to lament the choices she made years ago. Such a simple premise, such immense possibilities. This film demands a lot of its audience. There is no humor, no action, and very little plot. Most people won't be into this at all, I imagine, which is a shame. This film offers a really wonderful perspective on a subject that is so very rarely addressed in films today: aging. This film is about a woman taking stock of her life at the age of fifty. She looks back, she sees the choices she made and how they turned out. She sees the compromises she made to get where she is today (very successful, head of a philosophy department, about to write another book), and she begins to appreciate, for the first time, what those compromises cost. This is, in my opinion, the central tragedy of human existence. You only get one shot at life, and no one ever tells you how to manage it. So, you make mistakes, and one day, when you're fifty, you've finally learned enough to start making the right choices. But, by that time, is it too late? This film doesn't answer that question, at least not for its central character. But it does offer hope. The film is propelled by several dynamite performances. But, even in such a crowded field of great performances, it is not difficult to pick out Gena Rowlands, who gives an unforgettably nuanced performance as Marion, the film's central character. You may notice that this film is propelled by a number of coincidences. Every chance encounter, however, has an eerie relevance to Marion's soul-searching. It may look contrived, but it isn't. These aren't coincidences at all. The pregnant woman, played by Mia Farrow, is instrumental in setting up each of these 'coincidences', and that character's name is Hope. I was half-expecting a \"Fight Club\" revelation at the end, but it never came, which is good. This film could stand both ways, and it's better for the director to leave the audience to consider the relationship between Hope and Marion on their own. Like I said, I've been thinking about it all day.",
         "There was a certain period in Woody Allen's career when he was trying desperately to imitate Ingmar Bergman's work. It rarely worked, and often turned out disasters like the execrable September. Another Woman is a riff on Bergman's Wild Strawberries: a college professor, played by Gena Rowlands, is past fifty and looking back on and reliving key events in her life as her present life is falling apart. The film is quite stagy at times, just as it was in September, Allen's previous film. He seems to think that adds something, but it really doesn't. One other problem Another Woman has is a couple of very clunky scenes, and a few poor bit performers, which were much bigger problems in September, which was actually the last Allen film that I saw and the one that made me subconsciously avoid him for the past several months. Allen's script here is excellent. He has produced an excellent character study which is probably unsurpassed in all of his other films that I've seen. The lead actors are wonderful here, Rowlands, Ian Holms, Blythe Danner, Sandy Dennis, and Gene Hackman. Allen's use of piano music is beautifully touching. It all adds up to a very touching and sad little film. It might not be Woody's best film, but it ought to be better respected and known. 8/10.",
         "This is not like any other Woody Allen movie I've seen before. He writes and directs this film which hits many levels of the human heart. The acting is well performed and the subject matter makes you reflect upon your own life and the choices you've made along the way. This one is to be added to your collection.",
         "Bergmanesque territory for Allen again, this is an intriguing and well directed film in Bergman's style, however unlike in some of Allen's earlier Bergman ventures this one feels like less of a copy and more so just a unique drama. The film is philosophical without the ideas seeming intangible, and some of the points are very interesting, like how the pain of others can cause one to realise one's own, and how fascinating it is to hear someone else's revelations. It is not a minute too long, and the dialogue is great, but if one was to flaw it, Allen's choice of music seems a little off-balance, the narration is a touch cold, and whilst not bad, the performances are generally rather ordinary. But all these problems are very slight, as the overall production is fascinating and thought-provoking stuff about how one reflects on oneself."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Jack Rollins & Charles H. Joffe Productions"],
      "summaries": [
         "Marion is a woman who has learned to shield herself from her emotions. She rents an apartment to work undisturbed on her new book, but by some acoustic anomaly she can hear all that is said in the next apartment in which a psychiatrist holds his office. When she hears a young woman tell that she finds it harder and harder to bear her life, Marion starts to reflect on her own life. After a series of events she comes to understand how her unemotional attitude towards the people around her affected them and herself.",
         "Facing a mid-life crisis, a woman rents an apartment next to a psychiatrist's office to write a new book, only to become drawn to the plight of a pregnant woman seeking that doctor's help."
      ],
      "budget": 10000000
   },
   "movielensId": 4393,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-10-13",
      "dvdReleaseDate": "2001-06-05",
      "directors": ["Woody Allen"],
      "runtime": 84,
      "movieId": 4393,
      "title": "Another Woman",
      "mpaa": "",
      "actors": [
         "Mia Farrow",
         "Gena Rowlands",
         "Ian Holm",
         "Blythe Danner",
         "Gene Hackman",
         "Betty Buckley",
         "Martha Plimpton",
         "John Houseman",
         "Sandy Dennis",
         "David Ogden Stiers",
         "Philip Bosco",
         "Harris Yulin",
         "Frances Conroy",
         "Fred Melamed",
         "Kenneth Welsh",
         "Dana Ivey",
         "Alice Spivak",
         "Josh Hamilton"
      ],
      "imdbMovieId": "0094663",
      "originalTitle": "Another Woman",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["tBRiwouSG2c"],
      "plotSummary": "Marion is a woman who has learned to shield herself from her emotions. She rents an apartment to work undisturbed on her new book, but by some acoustic anomaly she can hear all that is said in the next apartment in which a psychiatrist holds his office. When she hears a young woman tell that she finds it harder and harder to bear her life, Marion starts to reflect on her own life. After a series of events she comes to understand how her unemotional attitude towards the people around her affected them and herself.",
      "tmdbMovieId": 22478,
      "avgRating": 3.64706,
      "releaseYear": "1988",
      "numRatings": 272,
      "posterPath": "/cOtXweHPz7XkIyO8admUc4crDWr.jpg"
   }
}