{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bounty hunter",
            "id": 801
         },
         {
            "name": "colorado territory",
            "id": 191093
         }
      ],
      "imdb_id": "tt0044953",
      "video": false,
      "title": "The Naked Spur",
      "recommendations": [
         14551,
         29244,
         14554,
         26596,
         18264,
         27725,
         13909,
         29740,
         36206,
         37347,
         14580,
         43828,
         15794,
         14710,
         44190,
         18647,
         678,
         32499,
         19119,
         11617
      ],
      "backdrop_path": "/j1CDLUztqG5gvaq5LAP1rL2ED6t.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Howard Kemp",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e004e4d",
               "name": "James Stewart",
               "profile_path": "/aBLtt0Sl4AZVNclzFrXzbndRzux.jpg",
               "id": 854,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Lina Patch",
               "gender": 1,
               "credit_id": "52fe43e7c3a368484e004e51",
               "name": "Janet Leigh",
               "profile_path": "/3FWYSCJUOuYVDPG9UoMjtqNMdyb.jpg",
               "id": 7302,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Ben Vandergroat",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e004e55",
               "name": "Robert Ryan",
               "profile_path": "/xBAWG79UGCkchPPTbONycJiKW2g.jpg",
               "id": 8253,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Roy Anderson",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e004e59",
               "name": "Ralph Meeker",
               "profile_path": "/qJ6ELh0jYHaCB0lITnAOo7owylz.jpg",
               "id": 14562,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jesse Tate",
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e004e5d",
               "name": "Millard Mitchell",
               "profile_path": "/sYqhWsTBHtAJWqr6vhbIx65zUMc.jpg",
               "id": 13297,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e004e3d",
               "name": "Anthony Mann",
               "profile_path": "/9uc4d2GGoHBRLeAqsZJpwJX4S8x.jpg",
               "id": 40199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e004e43",
               "name": "Sam Rolfe",
               "profile_path": null,
               "id": 86134,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e7c3a368484e004e49",
               "name": "Harold Jack Bloom",
               "profile_path": null,
               "id": 10077,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59061960c3a3684a4e0215f7",
               "name": "Robert Brower",
               "profile_path": null,
               "id": 1807419,
               "department": "Camera",
               "job": "Other"
            },
            {
               "gender": 2,
               "credit_id": "590618adc3a3684a8e01ef0f",
               "name": "William C. Mellor",
               "profile_path": null,
               "id": 18744,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "590618f992514169c0020c4d",
               "name": "Henri Jaffa",
               "profile_path": null,
               "id": 1716722,
               "department": "Camera",
               "job": "Other"
            },
            {
               "gender": 2,
               "credit_id": "590619afc3a3684af001e512",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "590619e2c3a3684ab4021ae7",
               "name": "Malcolm Brown",
               "profile_path": null,
               "id": 9059,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59061a06c3a3684a7601f03f",
               "name": "George White",
               "profile_path": null,
               "id": 120314,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59061a47c3a3684a4e0216a3",
               "name": "Howard W. Koch",
               "profile_path": "/ocnNi4vGIENHuQFzv2ecoLjP9pB.jpg",
               "id": 3428,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "59061abec3a3684a680209d8",
               "name": "Bronislau Kaper",
               "profile_path": null,
               "id": 14861,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59061aee92514169d0020633",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Sound",
               "job": "Recording Supervision"
            },
            {
               "gender": 2,
               "credit_id": "59061b44c3a3684ad7020d01",
               "name": "Edwin B. Willis",
               "profile_path": null,
               "id": 9063,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59061b7292514169d002068e",
               "name": "Warren Newcombe",
               "profile_path": null,
               "id": 13292,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "59061bdb92514169b80206bf",
               "name": "William Tuttle",
               "profile_path": null,
               "id": 29801,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "59061c40c3a3684ad7020da5",
               "name": "William H. Wright",
               "profile_path": null,
               "id": 109727,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 3.464152,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20442,
      "vote_count": 58,
      "budget": 0,
      "overview": "Stewart is a bounty hunter in Colorado territory after killer Robert Ryan. Stewart's efforts to bring in Ryan and collect the reward are compromised by the presence of Ryan's loyal girl friend Janet Leigh and Stewart's two disreputable sidekicks, wily prospector Millard Mitchell and disgraced Union-officer Ralph Meeker.",
      "similar": [
         11942,
         10159,
         922,
         27644,
         335,
         273248,
         68718,
         576,
         429,
         33,
         78,
         938,
         27573,
         335984,
         15999,
         9923,
         2069,
         3595,
         223485,
         12311
      ],
      "original_title": "The Naked Spur",
      "runtime": 91,
      "poster_path": "/7zXRBUvSI22pHLwXfo0WC37STXW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Loew's Incorporated",
            "id": 31892,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1953-02-06",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Packed with Technicolor Thrills!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Mann"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Sam Rolfe",
         "Harold Jack Bloom"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0044953/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNTI3MzY0NV5BMl5BanBnXkFtZTgwMDg0MDgyMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: James Stewart, Janet Leigh, Robert Ryan | See full cast and crew »"],
      "reviews": [
         "MGM's THE NAKED SPUR (1953) is another much treasured classic western from the fifties. It was one of six collaborations between director Anthony Mann and James Stewart set in the great American west that began in 1950 with the brilliant \"Winchester 73\" and ended with the disappointing \"Night Passage\" in 1957. Although he was in a western before in 1939 with \"Destry Rides Again\" \"Winchester 73\" would change the screen image of James Stewart forever. Now he would become a formidable western icon joining the ranks occupied by John Wayne, Gary Cooper, Randolph Scott, Joel McCrea and perhaps to a lesser degree Henry Fonda and Glenn Ford. James Stewart became a great screen presence in westerns and his characterizations in them suited him to perfection and arguably never more so than in THE NAKED SPUR. Produced by William H.Wright for the studio the Acadamy Award nominated script was by Sam Rolfe and Harold Jack Bloom. With an atmospheric score by Polish composer Bronislau Kaper (one of his few scores for a western) and stunningly photographed in colour by William Mellor on locations in the Colorado Rockies it was all stylishly directed by Mann. Stewart plays Howie Kemp a bounty hunter on the trail of wanted killer Ben Vandergroft (Robert Ryan) in the rough terrain of the Rockies. He crosses trails with an old prospector Jesse Tate (Millard Mitchell) who joins up with him as a sort of pathfinder and later by a disgraced decommissioned ex-cavalry officer Roy Anderson (Ralph Meeker) who enlists himself as a helper in catching the killer. On hearing there's a reward of $5000 for the capture both Jesse and Roy now want their share. Howie needs help to bring the killer in so he agrees to splitting the money. They eventually take Ben prisoner and start the journey back. But the return trip is long and fraught with danger from inside and outside of the group. First they are attacked by a hostile band of Indians (an excellent action sequence) and later Ben starts to slyly play each member of the group against each other creating jealousy and suspicion among them. This results in Roy wanting to cut Howie out of the reward money entirely while Ben bribes Jesse to help him escape. It all comes to a tragic and watery end in an action filled finale at a rapid flowing river. There is a cast of only five players in the picture and the performances of all concerned are quite brilliant. Stewart is superb as the main protagonist. His temperamental angst filled and Ah! Shucks demeanour is as appealing as ever. Good too is Millard Mitchell (reunited with Mann and Stewart after \"Winchester 73\") in a Walter Brennan type role as the likable but ultimately ill-fated Jesse and Ralph Meeker plays a great part as the sly and dishonourable ex cavalry officer. But it is Robert Ryan who steals the show as the wanted killer. His viciousness and devious nature well concealed behind a sniggering and playful false persona. Curiously there is the presence of a female in the shape of Janet Leigh as a feisty tomboy girl who accompanies Ben on the run. But her being with him is somewhat implausible and isn't really convincing. However she was probably cast to provide the movie with a little romance and be someone our hero could ride off into the sunset with in the final frame. Nothing wrong with that I suppose! THE NAKED SPUR is an outstanding western and has lost none of its glow over the years and like all classic westerns it just gets better and better with the passing of time.",
         "What I imagine makes THE NAKED SPUR stand out among other Westerns is its close, intimate focus on a small band of characters--for once, the motivations of the cynical bounty-hunter, the luckless gold prospector, the brash ne'er-do-well, the slick outlaw are actually all explored and explained as best as psychology can allow. The focus isn't on the action, though there's plenty of that too; one really gets the idea that the action is peripheral to the character development, to the glimpses of history given by snatches of dialogue. James Stewart turns in a riveting performance as Howard Kemp, the embittered rancher turned bounty-hunter, who is seeking outlaw Ben Vandergroat (Robert Ryan) for the $5000 price on the latter's head. What Howard doesn't gamble on is the people added on to his journey along the way--the prospector Jesse Tate (Millard Mitchell), who's been running after gold all his life but has never managed to catch up to it; the reckless ex-soldier Roy Anderson (Ralph Meeker), discharged from the army for being 'morally unstable'; and the young feisty Lina Patch (Janet Leigh), Ben's companion. Throw this bunch of opposites in a trek back to Abilene, Kansas is a recipe for great drama: for example, the mini Indian massacre Roy brings about that gets Howard shot in the leg; the rock avalanche Ben starts to try to escape after sending Lina to distract Howard... even the even-tempered, apparently rational and loyal Jesse being so blinded by his life's pursuit that he frees Ben in return for gold and certainly winds up regretting it. Throughout the trek, one sees Ben's true duplicitous side, as he charmingly manipulates each and every other member of the group into distrusting one another. He knows Howard as well, from back in Abilene, and he is the one who lets us in on some of Howard's painful past. (Brilliantly illustrated by the fevered dreams Howard suffers from while still in shock from the bullet in his leg.) The entire small cast is excellent. Ryan is slimily charming, Mitchell plays Jesse straight and honestly, Leigh brings off a rather thankless, almost characterless role well (her character is probably the least well developed in the film). It is James Stewart, however, who really deserves special mention for his portrayal of Howard Kemp... particularly since he'd first thought that he was supposed to be playing the role of Ben Vandergroat, and had to be talked into taking the risk and playing Howard Kemp. One can certainly see why: Stewart's stock-in-trade is as the undeniably good hero, with whatever--if any!--psychological darkness (see George Bailey in It's A Wonderful Life) always lurking just beneath the surface but never enough to damage the character's positive standing in the audience's eyes. So of course, it's not easy to accept Stewart as the cynical, rude Howard at first--this probably is the least sympathetic character he has ever played, since the cracks in his tough, mean veneer come very seldom during the course of the film (and kudos to the writers for not having Stewart's innate goodness shine through more often and therefore use the audience's sympathies for the actor to bring some for the character). Howard is driven and relentless, as evidenced with the near psychosis he brings to his task of capturing Ben. From his sullenness when Ben reveals how much the capture really is worth, through to the final exciting sequence when Kemp pulls himself up the rock to face his nemesis (thereafter making it clear why the film is given the title of 'The Naked Spur'), Howard Kemp is evidently a man who no longer trusts even *himself* to do the good thing. Quite a twist on the James Stewart persona, and certainly one he pulls off with great aplomb. His final scene with Janet Leigh, as Howard has to decide whether he can stand to lose his future to his past, definitely stands proud as some of Stewart's greatest work. I watched this film largely because of a great review I'd read of it for Stewart's performance, and there is no denying that that is surely a good enough reason to watch this film. Stewart outdoes himself. Still, I got a lot more than I'd bargained for, because this really is an excellent, psychologically-charged Western as well--the kind that makes you feel and think, and it's only the better films that make one do that.",
         "While \"Bend of the River\" rhymes the tale of pioneers seeking home in a mountain wilderness with ex-outlaw Stewart's desperate efforts to escape his past, \"The Naked Spur\" (with two Academy Award Nominations for Best Story and Screenplay) deals with all characters motivated by greed with Stewart's bounty hunter portrayed as no less violent and neurotic than his murderous victim... Stewart gives a performance so intense and taut as to border, in the words of one critic, on the hysterical... Geographical odyssey reflects the hero's spiritual struggles with panoramic and outstanding views of the Rockies at their best... Beautifully photographed in Technicolor, the film tells the story of a forceful and aggressive Stewart, once a landowner cheated out of his property, who has taken the bounty hunting as the quickest way to regain a measure of respectability... Stewart is hot on the trail of a wild killer (Robert Ryan) who has a $5000 reward on his head, dead or alive... Once captured, the obscure wily outlaw turns the bounty hunters against each other, and almost escapes... Janet Leigh is cast as \"a fancy-talking\" jealous type, and apparently, Stewart finds his renewed decency thanks to our heroine... In a widely admired scene, Stewart breaks down and weeps, finally understanding the inhumanity of his bounty-hunting obsession, and is set free for his preoccupation with the fastened body as a merely rewarded property... Meeker challenges Stewart in his tense, hostile projections, and Ryan is in his element as the crooked hunted killer... With a short hair and hardly a make-up, Janet Leigh plays the tough, spirited, uneducated pretty companion of a murderer... She does her best to control the energies of four men, who include a discharged cavalryman with dishonor and a selfishly greedy guide (Millard Mitchell). Mann-Stewart third movie is a visually an absorbing celebration of violent deeds, a big Western regarded as one of the best ever made, a must-see for the fans of Westerns movies...",
         "The Naked Spur, modestly budgeted, with a big-name cast, is among other things almost an experimental film, as it was shot almost entirely outdoors and uses no standing sets. Directed by Anthony Mann, it is one of the several pictures he made with James Stewart in the fifties, most of them westerns. It is a simple tale of complex characters. That the action takes place against the backdrop of the West cleverly conceals that the movie is a drama as much as anything else; almost Bergmanesque in its spareness, it deals more with the psychology of greed and revenge than with more traditional western themes, such as honor, which scarcely figures in the story. Stewart plays a bounty hunter who is chasing after outlaw Robert Ryan for personal as much as monetary reasons. Even after he captures Ryan his emotionalism gets the better of him, as the outlaw preys sadistically on his vulnerabilities. Ryan's girl, Janet Leigh, is along for the ride, as are Millard Mitchell, as a crafty old codger, and Ralph Meeker, a disgraced army officer. None of these characters is admirable, as one would not want to encounter any of them (aside from Miss Leigh, that is) in a dark alley, or for that matter a bright one. Everyone in the film is deeply flawed and shows conflicting emotions. Aside from Ryan, each character has his good points, and some are likeable in spite of themselves. One never knows where Stewart stands with any of them till the end, as the power struggles that ensue are continuous and unrelenting, driving Stewart to near nervous breakdown. This is neither a happy nor optimistic movie, and its high quality is typical of so many westerns of the fifties, managing to deal with serious psychological, moral, even economic issues in ways that were nearly impossible in films set in contemporary times. Yet for all its grimness the movie is a wonder to behold, as William Mellor's photography is stunning; and Mann makes excellent use of the rocky, mountainous terrain, so like the interior states of the characters. The depth of the film comes from the way it unfolds, and how well we get to know the people in it, rather than the plot, which tends to follow the characters rather than the other way around, unusual in a western. All the actors are fine, though good as he is as the villain I wish that Robert Ryan's part had been cast with another actor,--Barry Sullivan for instance,--whose dandyishness would have made a nice contrast to the others in the film, while Ryan's pathology, though perfectly embodied by the actor is also a bit predictable if one has seen Ryan in other films, as he had, at this point in his career, gone this way perhaps once too often.",
         "James Stewart and Anthony Mann worked together on several films during the 1950's, and this film, \"The Naked Spur\", represents a very satisfying effort, pooling the collective talents of a great star with a renowned director and letting a story tell itself on film. There is very little action in the sense of a normal western, no shootouts in the streets, no bar-room brawls, no breakouts from the jail, or even a bank robbery. There is no town, period; the film was made outdoors in Colorado, and the scenery simply enhances and enriches the plot of the film. Basically, James Stewart plays a bounty hunter, Howard Kemp, who has a chance to catch a major outlaw, Ben Vandergroat portrayed by Robert Ryan. To Kemp, capturing the outlaw represents a chance to make something of himself, start over, with no ties to the former failures he has met. Along the way, he bumps into a weather-beaten prospector, Jesse, played by veteran Milliard Mitchell, and a deserter from the army, played by Ralph Meeker. Ryan has a traveling companion, Lina, (Janet Leigh), and when Ben is captured, she does make efforts to free him, thus causing Stewart's character all sorts of grief and anguish. Ryan, in a starkly brilliant performance, also attempts to create chances to escape. In watching the film develop, one has to wonder if Kemp will ultimately, due to his hardened nature, surrender Ben to the authorities, or will he simply let the outlaw go, and try to make a fresh start elsewhere. The answer comes at the side of a roaring river set between a rocky gorge. A very unique film, and one that deserves a watch by western fans.",
         "This western achieves something remarkable, it brings back your sensitivity. From the start of the film, any scene that shows either human beings or even an animal being shot, you feel the bitter taste of it. The bounty hunter which in so many movies was the hero, is shown here with all his indignity. It was not an easy role for James Stewart and he comes out beautifully. Janet Leigh is excellent as a tomboy. As for the scenery of the Rocky Mountains with the predominance of the green of the trees with the snowy mountains on the background, it is on the same level with everything else on this film which can be rated as one of the best westerns ever made.",
         "Set in the post Civil War American West, The Naked Spur is more than a western. The director, Anthony Mann, took a script by two relatively unknown screenwriters (later nominated for an Oscar) and made a great picture about losers trying to survive in a tough postwar world. James Stewart, the star, plays a rancher who lost everything because before going off to the Civil War, he signed his ranch over to his girlfriend. In 1952, when this picture was filmed, World War II was no distant memory, the Korean War was going on and the idea that a soldier thought he wasn't going to return from a war was real enough. The writers and Anthony Mann placed the story almost a hundred years earlier, but the movie is about regular people on the skids. The cashiered Army officer, always looking out for number one, whatever the cost to others, had to ring true with war veterans in the audience in 1953. There is a villain, and Robert Ryan plays a great one, but James Stewart's character, Howard Kemp, is no hero. Ryan's character, Ben Vandergroat, complains that he knew Howard and he never did Howie any wrong, so there was no reason for Kemp to track him down, regardless of the reward money. Ryan has a point, a western hero doesn't hunt down someone just for money, knowing that if caught the person will be executed. But the scenic views of the Rocky Mountains, the great production values (including Technicolor) by MGM and the stars all are a façade for what could have been a film noir picture, Anthony Mann's earlier specialty. Stewart's character in The Naked Spur is trying to get back the ranch he lost after his world was turned upside down by war. The screaming nightmares he has, showing the psychological trauma the war was responsible for, would now go under the name post traumatic stress syndrome. War veterans trying to return to a normal life has always been a subject for movies, but rarely has the message been hidden as well as here. The Naked Spur is the type of class picture studios don't (or can't) make anymore, and that is the moviegoers' loss.",
         "The Naked Spur is a startling film, an adult western that pushes Jimmy Stewart's anti-hero to the brink of his own humanity. A morality play in some respects, the film sometimes feels like what \"Treasure of the Sierra Madre\" would be if the gold was a living, scheming, malevolent human being - Robert Ryan fulfills this role and drives the film with his devilish prodding of the \"partners.\" The film cranks up the desperation of its characters. They're all losers of some kind - Meeker's discharged soldier, the old prospector who's never struck gold, and most pitifully, Jimmy Stewart's emasculated Howie, who lost everything by trusting in love. Stewart constantly attempts to shed his decency and humanity, but in the end he can't - nor will Janet Leigh let him. At the film's shocking climax, it is she who pulls him back, just as he drags the body from the raging torrent. Stunning.",
         "Looking at the IMDb \"Awards\" link will reveal this outstanding Anthony Mann western was nominated for a single \"Academy Award\", for the \"Story and Screenplay\" by Sam Rolfe and Harold Jack Bloom. The story (and much about the film) is excellent. Certainly, the writers deserved recognition for the intriguing story, and complex characters. But, to see \"The Naked Spur\" was not nominated for \"Best Color Cinematography\" is shocking. William Mellor's photography is truly superior. Perhaps, they felt one nomination was enough for a movie about greed... James Stewart (as Howard Kemp), Janet Leigh (as Lina Patch), Robert Ryan (as Ben Vandergroat), Ralph Meeker (as Roy Anderson), and Millard Mitchell (as Jesse Tate) are an outstanding Colorado quintet. With Mann and Mellor directing, the small cast appears sprawling. Of the five, Mr. Ryan's intensely malevolent \"Ben\" reigns supreme; it's difficult to envision \"The Naked Spur\" without Ryan's psychological thorn throwing. Recipient Stewart is also at his best. The other three are great; though, more should have been to done develop and/or explain the relationship. Leigh had/has with Ryan and Stewart; she is underused. That, and a couple of continuity and/or editing problems may distract, slightly. We shouldn't be to be too greedy about great movies, after all. ********* The Naked Spur (2/6/53) Anthony Mann ~ James Stewart, Robert Ryan, Janet Leigh, Ralph Meeker",
         "I never realized what a scene-stealer ROBERT RYAN could be until I saw THE NAKED SPUR. Although JAMES STEWART is the nominal big name star, it's Ryan's charming, snake-like villain who dominates this rugged western despite strong performances from the entire cast. He obviously relishes his role and is a joy to watch. This is more a character study of a group of desperate losers than your average shoot 'em up western and Anthony Mann has directed it with the focus on the strong clashes between each one of them. RALPH MEEKER does an outstanding job as a war deserter who is both a help and a hindrance to the group as they seek to return outlaw Ryan to Kansas so justice can prevail. Stewart's character is given strong motivation for his deeds but Janet Leigh, as the outlaw's girlfriend, has a role that is not plausibly explained. Photographed in Colorado's Rocky Mountains, it's a rugged kind of technicolor western that gives all of the performers physically demanding roles--and all of them are more than up to it. Stewart, Leigh, Mitchell and Meeker are all superb--but it's Robert Ryan's devious villain that will linger longest in the memory."
      ],
      "genres": [
         "Thriller",
         "Western"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Howard Kemp is a bounty hunter who's been after killer Ben Vandergroat for a long time. Along the way, Kemp is forced to take on a couple of partners, an old prospector named Jesse Tate and a dishonorably discharged Union soldier, Roy Anderson. When they learn that Vandergroat has a $5000 reward on his head, greed starts to take the better of them. Vandergroat takes every advantage of the situation sowing doubt between the two men at every opportunity finally convincing one of them to help him escape.",
         "A bitter Howard Kemp heads westward to the Rockies from Abilene, Kansas on the trail of murderer Ben Vandergroat and the $5000 reward on Vandergroat's head, money after which Kemp lusts in order to re-purchase the ranch that his absconding fiancée had sold during his stint in the army. Kemp unexpectedly crosses paths with an old, star-crossed gold miner, Jesse Tate, and with a recently-discharged soldier of questionable repute, Roy Anderson. Teaming up, they nab Vandergroat and his girl, Lina Patch, but Vandergroat tries to turn his three distrustful, avaricious captors against each other during the return trip.",
         "A bounty hunter trying to bring a murderer to justice is forced to accept the help of two less-than-trustworthy strangers."
      ],
      "budget": 0
   },
   "movielensId": 44168,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-02-06",
      "dvdReleaseDate": "2006-08-15",
      "directors": ["Anthony Mann"],
      "runtime": 91,
      "movieId": 44168,
      "title": "The Naked Spur",
      "mpaa": "",
      "actors": [
         "James Stewart",
         "Janet Leigh",
         "Robert Ryan",
         "Ralph Meeker",
         "Millard Mitchell"
      ],
      "imdbMovieId": "0044953",
      "originalTitle": "The Naked Spur",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": [
         "PcGYPaWpDQI",
         "FtBtW1v6wuw"
      ],
      "plotSummary": "Stewart is a bounty hunter in Colorado territory after killer Robert Ryan. Stewart's efforts to bring in Ryan and collect the reward are compromised by the presence of Ryan's loyal girl friend Janet Leigh and Stewart's two disreputable sidekicks, wily prospector Millard Mitchell and disgraced Union-officer Ralph Meeker.",
      "tmdbMovieId": 20442,
      "avgRating": 3.53383,
      "releaseYear": "1953",
      "numRatings": 133,
      "posterPath": "/7zXRBUvSI22pHLwXfo0WC37STXW.jpg"
   }
}