{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "mad scientist",
            "id": 10125
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "video nasty",
            "id": 189921
         }
      ],
      "imdb_id": "tt0082966",
      "video": false,
      "title": "The House by the Cemetery",
      "recommendations": [
         19204,
         7219,
         24920,
         30874,
         29161,
         20465,
         27346,
         16395,
         40364,
         28172,
         24919,
         27495,
         14029,
         24274,
         39982,
         3699,
         26680,
         47886,
         27813,
         27815
      ],
      "backdrop_path": "/vmWeNabBHAstLdPBuF6AJEGhn0U.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Milo_Jeeder",
         "id": "58a3956bc3a36829cf000344",
         "content": "If I have to be objective, I would say that I can understand why some people criticize \"The House by the Cemetery\" for being a film that lacks of logical explanations all the way through. As a matter of fact, regardless of how much I love this film and how biased I can be, I admit that it is overflowing with nonsensical and misleading sequences that only add a little bit of confusion. This is not the only occasion in which Mr. Fulci is accused of being ambiguous and practically senile for developing such random and unsystematic states of affairs in one his films. However, it is not the only time in which the results are unquestionably effective and unforgettable either. I think we ought to accept by now that several Italian horror movies, let alone the ones directed by Mr. Fulci, are not exactly to be praised because of their plot and exceedingly appropriate logic. The high point in \"The House by the Cemetery\", along with many other films directed by Lucio Fulci, is without doubt the atmosphere and pleasant demonstration of fear-provoking imagery.\r\n\r\nIn \"The House by the Cemetery\", Dr. Boyle moves to the countryside in New England with his wife, Lucy and his obnoxious little son, Bobby. His purpose is to continue an unfinished research and finding out what happened to his colleague, who killed himself and slaughtered his mistress for no apparent reason. Dr. Boyle, who is pretty excited about the research and the fact that he's going to earn five thousand dollars extra, tries to cope with the constant ranting coming from his wife and little Bob, who claims he sees a little girl who says they shouldn't go to the house. Despite the consequences, Dr. Boyle prepares for his research, without even considering that Bobby's so-called hallucinations and lies should be taken seriously. In the cellar of the house, there's something waiting for them. Something that is beyond anyone's nightmare and the Boyles are about to find out what it is.\r\n\r\nLike I said before, it seems that many people were deeply offended by the lack of logic and while I'm not saying that this is untrue, personally, I don't think it's a blameworthy feature. Building up an extremely sensible story, obviously wasn't Lucio Fulci's strongest suit. However, what this film lacks of logic is surpassed with other things, for instance, Dr. Freudstein, who is definitely one of the most horrendous baddies and his bone-chilling appearance throughout the last minutes. The sequence in which we see the family trying to fight against this outlandish creature, taken from Mr. Fulci's worst nightmares, is by far one of the most shocking and professionally made scenes I have witnessed in a horror movie. Not to mention that there's also a nice share of gore as a bonus for those who are always in the mood for brutal murders and guts all over the place. It seems like I may be one of the few who enjoyed the nonsensical succession, like for example, the flash-back in which little Mae sees mannequin losing her head, or the eyes close-up or the arrival of Ann to the house. Those were some of the most criticized and somehow far-fetched little details that I personally enjoyed, for contributing to develop Mr. Fulci's nightmarish atmosphere, which is somehow his trademark. The music is also one of the things I really enjoyed about this film, although it seems like not many people noticed that little nicety. It's quite melancholic and beautiful. The same music is used from the beginning until the end, which somehow helps to create a less fearful atmosphere in the right moments. I think \"The House by the Cemetery\" is one of those films that only pleases horror fans who can appreciate Mr. Fulci's movies for what they are, instead of focusing on the ambiguity and the lack of logic. This movie is enjoyable for its atmosphere and nightmarish sequences and frankly...I wouldn't want it any other way.",
         "url": "https://www.themoviedb.org/review/58a3956bc3a36829cf000344"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Lucy Boyle",
               "gender": 1,
               "credit_id": "52fe45b2c3a368484e069e8d",
               "name": "Catriona MacColl",
               "profile_path": "/hmB3MmfJpNOQ4uOy6q5z7EU1JGp.jpg",
               "id": 101330,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Dr. Norman Boyle",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e91",
               "name": "Paolo Malco",
               "profile_path": "/dRH0Bj1PGPxr4Pxz1H8TbGFR0i7.jpg",
               "id": 27384,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Ann",
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069e95",
               "name": "Ania Pieroni",
               "profile_path": "/pf0b0ri181Nf1bNQV3ABK2yprtr.jpg",
               "id": 102012,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Bob Boyle",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e99",
               "name": "Giovanni Frezza",
               "profile_path": "/2FK2wNs5tZVJbtyyMT4jJX4Vcfq.jpg",
               "id": 102013,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Mae Freudstein",
               "gender": 1,
               "credit_id": "52fe45b2c3a368484e069e9d",
               "name": "Silvia Collatina",
               "profile_path": "/9nVRpPzyaZP9tAcGRGtMXXScKEh.jpg",
               "id": 102014,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Laura Gittleson",
               "gender": 1,
               "credit_id": "52fe45b2c3a368484e069ea1",
               "name": "Dagmar Lassander",
               "profile_path": "/3FAkdrwEpPW0ypLQp37EF5WXooU.jpg",
               "id": 46636,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Dr. Jacob A. Freudstein",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069ea5",
               "name": "Giovanni De Nava",
               "profile_path": "/ok85VGf7nPc5zonOQ01U1T0vk5a.jpg",
               "id": 84304,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "First Female Victim",
               "gender": 1,
               "credit_id": "52fe45b2c3a368484e069ea9",
               "name": "Daniela Doria",
               "profile_path": "/yMd2ytV5RVBU9Yta6Pal6sCXft6.jpg",
               "id": 101333,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Daniel Douglas",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069ead",
               "name": "Gianpaolo Saccarola",
               "profile_path": "/iS0vMT0iox9kJRYiM8Jfp9THbgP.jpg",
               "id": 84309,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Mr. Wheatley",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069eb1",
               "name": "Carlo De Mejo",
               "profile_path": "/jOEO4oEBLiteYiuG5PDjoWHgJTa.jpg",
               "id": 101331,
               "order": 9
            },
            {
               "cast_id": 27,
               "character": "Mary Freudstein",
               "gender": 0,
               "credit_id": "597ee1f39251415daa02a8c0",
               "name": "Teresa Rossi Passante",
               "profile_path": "/cZbwI0H09lNgl5oK5a61httl5Ue.jpg",
               "id": 1861166,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Harold",
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069eb5",
               "name": "Kenneth A. Olsen",
               "profile_path": null,
               "id": 102015,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Cemetery Caretaker",
               "gender": 0,
               "credit_id": "597ee1b0c3a368542e02c799",
               "name": "Elmer Johnsson",
               "profile_path": null,
               "id": 1861163,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Victim",
               "gender": 0,
               "credit_id": "597ee1c39251415d9802c7a2",
               "name": "Ranieri Ferrara",
               "profile_path": null,
               "id": 1861164,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Professor Muller (uncredited)",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069eb9",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e47",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e4d",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069e53",
               "name": "Fabrizio De Angelis",
               "profile_path": null,
               "id": 53188,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069e59",
               "name": "Giorgio Mariuzzo",
               "profile_path": null,
               "id": 84301,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e5f",
               "name": "Dardano Sacchetti",
               "profile_path": "/gAOsap6fh6S9WBTR6iSX0jSLIxX.jpg",
               "id": 44957,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069e65",
               "name": "Walter Rizzati",
               "profile_path": null,
               "id": 56724,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e6b",
               "name": "Sergio Salvati",
               "profile_path": "/7L2BcidnkV8LcNvYgpGtivv5r2n.jpg",
               "id": 53196,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e71",
               "name": "Vincenzo Tomassi",
               "profile_path": null,
               "id": 53197,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069e77",
               "name": "Massimo Lentini",
               "profile_path": null,
               "id": 44958,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069e7d",
               "name": "Massimo Lentini",
               "profile_path": null,
               "id": 44958,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e83",
               "name": "Giannetto De Rossi",
               "profile_path": null,
               "id": 16597,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069e89",
               "name": "Giannetto De Rossi",
               "profile_path": null,
               "id": 16597,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 6.421436,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 28794,
      "vote_count": 95,
      "budget": 0,
      "overview": "A deranged killer lives in the basement of an old mansion and pops out occasionally to commit grisly murders that include be-headings.",
      "similar": [
         19204,
         434873,
         11429,
         24920,
         19908,
         588,
         381288,
         485415,
         341006,
         923,
         273477,
         10185,
         9373,
         336843,
         10781,
         201085,
         72190,
         1690,
         170,
         948
      ],
      "original_title": "Quella villa accanto al cimitero",
      "runtime": 82,
      "poster_path": "/2Pd2tTrktrB2pND61SvIIJxog9B.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1981-08-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Read the fine print. You may have just mortgaged your life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lucio Fulci"],
      "runtime": 87,
      "synopsis": "A young woman (Daniela Doria) in an old abandoned house is looking for her boyfriend Steven who has taken her there for sex. The young woman discovers her boyfriend's horribly mutilated dead body when she gets stabbed through the back of her head with a sharp kitchen knife by an unseen person. The killer drags the woman's body through a door leading to the cellar. New York City, several months later. A young boy named Bob (Giovanni Frezzi), and his parents Norman and Lucy Boyle (Paolo Malco and Catriona MacColl) are preparing to move to a new house in New England just outside Boston previous occupied by Normans ex-colleague, Dr. Peterson, who recently murdered his mistress before committing suicide. The Boyles are to spend six months at the house, whilst Norman finishes his research project of old houses at the request of his employer Professor Muller (director Lucio Fulci). As his mother packs, Bob looks at the photograph of a sinister-looking old house, hanging on the Boyles wall. In it, he sees a young girl warning him to stay away. In New Whitby, Boston, Bob waits in his parents car while they pick up their house keys at the estate office. He makes further contact with the girl in the photo, who this time appears across the street. Despite the distance between them, Bob and the girl (Silvia Collatina), who introduces herself as Mae, can hear each other without opening the car windows. Mae again warns Bob to stay away. In the real estate office, the friendly Mrs. Gittelson (Dagmar Lassander) is annoyed with her laconic colleague Harold, who hands the couple \"the Freudstein keyes.\" \"It's Oak Mansion, Harold,\" she insists. She seems to recognize Dr. Boyle and asks him if hes been to New Whitby before. Norman says that he hasn't. Accompanying the family to Oak Mansion, Mrs. Gittelson promises to arrange for a babysitter to drop by. Lucy is struck the by the resemblance between the house in the photograph and their new home. But Norman seems strangely disinterested. Inside, the old house is spacious, but in a poor state of repair. They notice in the kitchen that the cellar door is locked and nailed shut. As they start unpacking, a strange young woman arrives and introduces herself as Anne the babysitter (Ania Pieroni). That night, Norman hears noises and on rising to investigate, finds Anne unblocking the cellar door. The next day, Norman goes to the local library to look over Dr. Petersons materials. Mr. Wheatley the librarian (Carlo De Mejo) also seems to recognize him and asks if he's been to the town before. Norman again replies that he has not. The assistant librarian Daniel Douglas (Giampaolo Saccarola) informs Norman that Dr. Peterson has conducted private research at the old house. Hed been studying records of disappearances in the area over the last several years as well as medical reports and death certificates, none of which has any relevance to his official studies. In the wild undergrowth around the house, Mae shows Bob a tombstone bearing the name of Mary Freudstein and says that the woman is not really dead. Indoors, Lucy finds a tombstone set into the floor. It bears the name Jacob Tess Freudstein. Scared and confused by her discovery, she hears noises emanating from all over the house and breaks down screaming. When Norman returns home, he reassures his distraught wife that its quite normal for some old houses in the region to have indoor tombs, because of the hard wintery ground. Producing a set of keys and a flashlight, Norman opens the cellar door and proceeds to walk down the stairs only be attacked by a large bat, which sinks its teeth into his hand and proves incredibly hard to get off. Norman stabs at its loasome pulpy body over and over in which the things oozes globs of blood before dropping dead to the kitchen floor. Now completely spooked, the family drives down to the estate officce where they demand to be rehoused. Their demands are met with exaggerated yawns from Harold. They are told they will have to wait just a few more days before they can move somewhere else. \"That Freudstein place\" he intones as they leave. The next day while the Boyles are at the hospital to look over Norman's injury caused by the bat, Mrs. Gittelson arrives at the house to tell the family that a property has been found for them. When no one answers her knock, she lets herself in. When she casually stands on the Freudstein tombstone, it cracks apart, grinding her ankle. As she struggles to free herself, an apparently cadaverous figure (unseen except for a normal left arm and a rotting right forearm) emerges from the cellar and attacks her with a fireplace poker, stabbing her repeatedly in the neck. Mrs. Gittelson bleeds to death when blood jets from her multiple wounds and she's dragged to the cellar. The next morning, Lucy finds Anne scrubbing up a huge bloodstain on the kitchen floor leading to the closed cellar door. When asked what she is doing, Anne is noncommittal and eludes Lucy's attempts to talk. At a local coffee shop in town, Norman tells Lucy that he's discovered that the mysterious Dr. Freudstein was a turn-of-the-century surgeon with a penchant for illegal experiments. Norman tells Lucy that he will be traveling back to New York for more research on Dr. Freudstein, telling Lucy that he will be away until well after nightfall. On the way, Norman drops by the library and finds a cassette recording of Dr. Peterson, whos deranged ramblings explain the horrific circumstantial which drove him to suicide. He was not the killer of his mistress and children, but the ghoulish Dr. Fredustein was. Back at the house, Anne goes down into the cellar looking for Bob, when she is attacked and decapitated by the still-unseen Dr. Freudstein. Bob goes down to investigate, when he sees Anne's severed head come rolling down the metal stairs and runs back screaming, just in time to avoid being shut in with the monstrous denizen. Lucy at first refuses to believe the frantic Bob's wild tale about Anne being killed. However, Lucy cannot find any trace of Anne anywhere in the house. That evening, after his mother has gone to bed, Bob returns to the cellar with a flashlight to look for Anne. The door behind him slams shut, and glowing eyes peer at him from the darkness. Lucy is woken up by Bob's frenzied shrieks for help, and she tries to open the cellar door. The key snaps. Lucy tries using a knife as jimmy, but it too snaps. As Lucy panics, Norman arrives back and attacks the cellar door with an axe. On the other side, the rotting hands of Dr. Freudstein (Giovanni De Nava) appear and hold Bob's head to the wooden panels. Normans axe blows come dangerously close to Bob's head, missing his son by a fraction of an inch. One blow chops off the monster's left hand, and he staggers away in pain from the door, dragging the unconscious Bob with him. At last, the cellar reveals its secrets opening up in full view to reveal a charnel house of mutilated bodies, its shadowy recesses dotted with surgical equipment and a gore-streaked pathology slab. The horribly deformed Dr. Freudstein is shown as a rotting living corpse with shrunken in eyes, and rotting flesh. As the couple ventures into the cellar to rescue their son, Norman breathlessly fills Lucy in on the details of his find. The 150-year-old Freudstein has apparently discovered a way of keeping himself alive by using the hacked up body parts of his victims to regenerate his blood cells. Norman attempts to attack Freudstein, but the revolting-looking ghoul twists the axe from Norman's grip. Norman then grabs a knife off the surgical tray and rams it into Freudstein's gut releasing a sickening stew of maggots and corrupted blood. Although wounded, the monstrous Freudstein continues to attack. Lucy and Bob watch in horror as Freudstein picks up Norman and literally ripps his throat out with his one rotting hand. Lucy and Bob spot a metal ladder in the corner of the basement which leads up to the cracked tombstone in the living room floor. With the ghastly monster standing between them and the cellar door, their only hope is to climb up the metal ladder and try to push apart the two stone segments to escape. Lucy strains desperately to shift the stone, but her ankle is grabbed by the perusing Dr. Freudstein. As Bob clings to the topmost rung, he sees his mother pulled down, her head battered by each metal step down. Freudstein finishes off Lucy by ramming her head into the concrete cellar floor, splattering it like a melon. As Freudstein advances up the metal latter to the helpless Bob, the little boy strains to escape by forcing his head through the jagged aperture. At the last minute, as Freudstein clutches the boy's ankle, Bob is yanked up and out of reach by unseen hands to find Mae standing before him. But with Mae is the 19th Century figure of her mother, Mary Freudstein (Teresa Rossi Passante), who gently urges them to leave for other people will no doubt drop in for her husband's continuing research for eternal life. Mrs. Freudstein leads Mae and Bob away from the house and down the wintery grove into a netherworld of ghosts and sadness. Quote from Henry James: \"No one will ever know whether children are monsters, or monsters are children.\"",
      "writers": [
         "Elisa Briganti",
         "Lucio Fulci"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0082966/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5MzczOTIzOV5BMl5BanBnXkFtZTYwNDQzMjI5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Catriona MacColl, Paolo Malco, Ania Pieroni | See full cast and crew »"],
      "reviews": [
         "Professor Norman Boyle (Paolo Malco) moves his wife Lucy (Catriona MacColl) and \"cute\" (a-hem!) little blonde son (Giovanni Frezza) from New York City to a cursed three-story Boston house by a cemetery. The digs come complete with creaky floorboards, crying/moaning spirits, loud bangs, a rabid devil bat, bleeding walls, a sexy/weird live-in babysitter (Ania Pieroni), the friendly ghost of a little girl and the murderous rotting, eyeless corpse of the house's former owner Dr. Freudstein (Giovanni De Nari); who hides out in the basement and emerges only to hack people up for their blood. Extremely gory Euro-splatter overdone as only Fulci overdoes it: Why slit someone's throat once when you can do it three times? There's also an impalement (make that three impalements), several decapitations, a knife through the head, a ripped out throat, maggots and other gruesome FX stuff to keep it humming along nicely for spaghetti splatter fans, and it all ends with a Henry James quote! Just be prepared to put up with some choppy editing and bad dubbing. Especially grating is the dub on the little boy... yikes!",
         "Quella Villa Accanto al Cimitero/House by the Cemetery(1981) is the first straight forward film for Fulci since Zombie Flesh Eaters(1979). Gets away from the dreamish themematics of his previous two films. Begins with the idea that this could be the third film in the 7 Gates Trilogy. Although not as violent as Zombie Flesh Eaters, The Gates of Hell, or The Beyond, The film does contain some gory set pieces. A bloody haunted house tale that employs the techniques of Lucio Fulci very well. The story builds toward the pessemistic climax. Quella Villa Accanto al Cimitero's major weakness is the poor dubbing of Bob & Mae. Because they are voiced over by adults, the performances of the two children come out weak. Walter Rizzati performs a main theme that sounds alot like the theme music of Don't Torture a Duckling. One of my favorite film scores from a Fulci picture. Tremendously influenced by the zombie classic, Let Sleeping Corpse Lie(1974). This is one of the few Fulci films from the early 80s that Fabio Frizzi did not work on. The film crew seems at home since having done many films together. I was impressed by the film when I first saw it. House by the Cemetery is helped out by the presence of Catriona MacColl who gives it professional respectability. One thing that annoyed some people is the scene where the babysitter is cleaning up blood with Mrs. Boyle not reacting to this. This was not done purposely but resulted due to budget restraints and time limitations. The House by the Cemetery(1981) was filmed after the editing of The Beyond(1981). Dr. Freudstein is another in a line of monsterous villains that follows Father Thomas and Schweik the painter. He is the only zombie in an otherwise non zombie pic. Even though he is not seen for most of the picture, his presence is still sinisterly felt. His name seems to be a mixture of Dr. Frankenstein and Dr. Freud. Dr. Freudstein in my opinion also seems to be inspired by the longevity seeking Dr. Charriere of HP Lovecraft/August Derleth's short story, THE SURVIVOR. Dr. Freudstein is menacing and repulsive. The set designs are eye popping and fantastic. The interiors of the Freudstein house from the past are stunning. Another example of Fulci using great gothic designs for the film. Part of the film was done in Concord, MA. The antique look of the Freudstein house from the past is something out of a Mario Bava movie. The House by the Cemetery(1981) is made special by the sight of gothic architecture in the small New England town. Revolves around the relationship between Bob Boyle and the ghost, Mae Freudstein. They can communicate from far away while understanding each other's thoughts. They are the opposite of Mr. and Mrs. Boyle who are limited in looking beyond what is there. Bob Boyle and Mae are competently played by Giovanni Frezza & Silvia Collatina. Bob Boyle ends up in the same position as Liza and John from The Beyond(1981). Mae's role serves the same purpose as a warner that Emily served in The Beyond(1981). Children play a vital role in Lucio Fulci's top films. In his films, children are the bearers of innocence who are surrounded by a nature of violence. Children are a crucial part in this film because they are the only ones who can sense danger. Dr. Freudstein in my opinion represents the dark half of Norman Boyle. The children in the film are inspired by characters in a Henry James Novella. Its interesting that the doctor lures his victims by crying like a child. Quella Villa Accanto al Cimitero I feel had a profound influence on Clive Barker's Hellraiser(1987). One example is the monster who needs victims to keep himself alive and fresh. Another example is the architecture designs of Hellraiser(1987). Combines the ideas of HP Lovecraft with Henry James and Ambrose Bierce. Giannetto De Rossi produces some effective special effects for a low budget film. Sergio Salvati is one of the key ingredients to this picture because of his fabulous cinematography and camera placement. House by the Cemetery(1981) is comparable to Mario Bava's Shock(1977). Both have families who live in a house with a dark past. Both have a child who talks to someone dead. The two films have female characters who are on the verge of total breakdown. House by the Cemetery & Shock contain a downbeat ending. These two rely on atmosphere and colorful set pieces. There are show stopping highlights in Quella Villa Accanto al Cimitero(1981). One, the murder of the first victim played by Daniela Doria. Two, the murder of Mrs. Gittleson where realistic make up effects are employed. Three, the pix axe scene that is an encore of the \"Buried Alive\" sequence from City of the Living Dead(1980). The scene where Mae envisions the death of Anne, the babysitter is brilliant. The scene where the camera pans out from a house to a picture of that house is quite good and reminds me of a sequence towards the end of Brazil(1985).",
         "I relize it isn't the kid's fault, but I am here to tell you the voice he is dubbed with is so annoying that it almost ruins the entire flick. Can't a more appropiate voice be found, one that sounds like a real child and not one of those really wealthy ones. Other than that this isn't that bad of a flick, but it definately has some flaws. The movie seems to point this way and that, there are a ton of questions like who is the killer, has the father been in the town before, who is the babysitter really, and others. Unfortunately, only one of these questions is answered in this flick and it is the killer. The rest goes unanswered and where as the unanswered questions work in \"The Beyond\" here you wonder why it is brought up in the first place if you are never going to find out. Also to all the people that talk about the baby sitter wiping up the blood, I do believe the mother thought the blood came from the dreaded bat attack. One thing I can't believe though is that this movie has a higher rating than \"Zombie\". Zombie just seems to me to be a more complete movie.",
         "Another terrifying Italian shocker from the legendary Lucio Fulci. A family move into a creepy old house and are unaware that living in the cellar is the flesh-eating zombie of a 19th Century surgeon. The little boy is soon a friend with the ghost of the late doctors daughter who warns them to stay away but to little effect. The creature gruesomely kills and dismembers a variety of Estate Agents, Copulating teenagers and Babysitters leading to a terrifying finale in the corpse-strewn cellar. The Lucio Fulci trademark of graphic gore is abundant as ever but it is the atmosphere that makes this movie stand out. Bumps in the night and the ominous crying of children coming from the cellar are just some of the factors that assault and disturb the viewer. This is a truly amazing movie that relies on shock and terror rather than revulsion. The gore just adds to what is already a truly chilling little tale of cannibalism and depravity that will linger in the mind long after you've forgotten about the illogical plot and poor dubbing. One of Fulci's best films. Deserves its cult reputation. My Rating \u0096 9 out of 10.",
         "In some ways, you get a sense Fulci was trying hard to make this more \"respectable\" than some of his other movies. The camerawork is careful, creating atmosphere as well as a sense of polish. The makeup and gore effects (except for the ridiculous bat scene) are also well-crafted, and the Dr. Freudstein character is fairly creepy to see. Also, there are fewer splatter scenes, and they come more out of the story than any gratuitous attempts to add gore. However, the story (which has shades of THE SHINING) is pretty slow-moving, so after a while you wish Fulci *would* throw in some gratuitous splatter! And like many of Fulci's other movies, a lot of things are simply not explained. (I will admit I got a good laugh at the sudden burst of \"explanation\" by one character at the end, which comes out of nowhere!) Quite frankly, viewers who have heard about Fulci but not seen any of his other movies will be wondering at the end of the movie why he's received so much fuss. So only for Fulci fans, or people with more than a passing interest in Italian horror movies.",
         "If I have to be objective, I would say that I can understand why some people criticize \"The House by the Cemetery\" for being a film that lacks of logical explanations all the way through. As a matter of fact, regardless of how much I love this film and how biased I can be, I admit that it is overflowing with nonsensical and misleading sequences that only add a little bit of confusion. This is not the only occasion in which Mr. Fulci is accused of being ambiguous and practically senile for developing such random and unsystematic states of affairs in one his films. However, it is not the only time in which the results are unquestionably effective and unforgettable either. I think we ought to accept by now that several Italian horror movies, let alone the ones directed by Mr. Fulci, are not exactly to be praised because of their plot and exceedingly appropriate logic. The high point in \"The House by the Cemetery\", along with many other films directed by Lucio Fulci, is without doubt the atmosphere and pleasant demonstration of fear-provoking imagery. In \"The House by the Cemetery\", Dr. Boyle moves to the countryside in New England with his wife, Lucy and his obnoxious little son, Bobby. His purpose is to continue an unfinished research and finding out what happened to his colleague, who killed himself and slaughtered his mistress for no apparent reason. Dr. Boyle, who is pretty excited about the research and the fact that he's going to earn five thousand dollars extra, tries to cope with the constant ranting coming from his wife and little Bob, who claims he sees a little girl who says they shouldn't go to the house. Despite the consequences, Dr. Boyle prepares for his research, without even considering that Bobby's so-called hallucinations and lies should be taken seriously. In the cellar of the house, there's something waiting for them. Something that is beyond anyone's nightmare and the Boyles are about to find out what it is. Like I said before, it seems that many people were deeply offended by the lack of logic and while I'm not saying that this is untrue, personally, I don't think it's a blameworthy feature. Building up an extremely sensible story, obviously wasn't Lucio Fulci's strongest suit. However, what this film lacks of logic is surpassed with other things, for instance, Dr. Freudstein, who is definitely one of the most horrendous baddies and his bone-chilling appearance throughout the last minutes. The sequence in which we see the family trying to fight against this outlandish creature, taken from Mr. Fulci's worst nightmares, is by far one of the most shocking and professionally made scenes I have witnessed in a horror movie. Not to mention that there's also a nice share of gore as a bonus for those who are always in the mood for brutal murders and guts all over the place. It seems like I may be one of the few who enjoyed the nonsensical succession, like for example, the flash-back in which little Mae sees mannequin losing her head, or the eyes close-up or the arrival of Ann to the house. Those were some of the most criticized and somehow far-fetched little details that I personally enjoyed, for contributing to develop Mr. Fulci's nightmarish atmosphere, which is somehow his trademark. The music is also one of the things I really enjoyed about this film, although it seems like not many people noticed that little nicety. It's quite melancholic and beautiful. The same music is used from the beginning until the end, which somehow helps to create a less fearful atmosphere in the right moments. I think \"The House by the Cemetery\" is one of those films that only pleases horror fans who can appreciate Mr. Fulci's movies for what they are, instead of focusing on the ambiguity and the lack of logic. This movie is enjoyable for its atmosphere and nightmarish sequences and frankly...I wouldn't want it any other way.",
         "In New York, Dr. Norman Boyle (Paolo Malco) assumes the research about Dr. Freudstein of his colleague Dr. Petersen, who committed suicide after killing his mistress. Norman heads to Boston with his wife Lucy Boyle (Katherine MacColl) and their son Bobby (Giovanni Frezza) to live in an isolated house in the woods that belonged to Dr. Petersen. Bob befriends the girl Mae (Silvia Collatina) that only he can see and she warns him to leave the house. Soon his parents hire the mysterious babysitter Ann (Ania Pieroni) and creepy things happen in the house, When Bobby goes to the basement, his parents discover the secret of the house. \"Quella villa accanto al cimitero\", a.k.a. \"The House by the Cemetery\", is a sinister horror movie by Lucio Fulci. The screenplay is confused with poor development of the characters, but the supernatural atmosphere is creepy and the camera-work is great. The metaphoric conclusion, with the soul of Bob following Mae and her mother, is excellent. My vote is six. Title (Brazil): \"A Casa do Cemitério\" (\"The House by the Cemetery\")",
         "Out of the horror films by Fulci which I own (The Beyond, City of the Living Dead and this one), this is definitely my favourite. As well as containing the most gore (I'm lucky to have an uncut version) it is also the most scary. There are plenty of moments which will make you jump and the overall images projected from the camera panning of the house in question adds to this, creating a tense and terrifying atmosphere. The murders are spot-on with plenty of blood and great effects which again add to the overall tension in the film. The storyline, though fairly thin, keeps things moving along at a quick pace to the abrupt ending which is typical of Fulci's other work. Overall, I make a point of watching this film regularly (with lights off!) as I think it is just a great horror flick. If you're a horror fan, see this! My score: 8/10.",
         "House By The Cemetery was the fourth and last of a series of Horror films that made Lucio Fulci a major cult figure in America. House is easily my favorite of the four films and quite possibly my favorite Italian horror film of all time. A cold, mysterious piece of gothic cinema, House is not to be missed by lovers of Italian Horror or Fulci's films. Maestro Fulci packs the picture with all sorts of weird little touches like the decapitated store window dummy that foreshadows the death of the baby sitter which in itself informs the death of Katherine MacColl at the film's conclusion. Like a number of classic Italian horror outings, House has a very ambiguous plot point concerning the nature of Dr. Freudstein's immortality. We are told that he must \"kill to revive his cells\" but are not 100% sure what this entails. Does he consume his victim's flesh, take skin grafts from their bodies (the appearance of his victim's remains make these two theories plausible) or is their some kind of alchemical process whereby the act of murder somehow keeps him alive? It's left for the veiwer to decide but one thing is certain, the process works but has done nothing for the evil Doctor's looks. With the exception of his left hand (which he ironically loses via the blade of an axe), Freudstein looks like a dessicated corpse. No wonder he hides in the dark basement of the house. Freudstein with his shocking appearance and his moldy suit of clothing ranks as one of if not the best of Fulci's monsters. Watch for the scene after he has captured Bob and lost his hand. He rocks back and forth in a corner nursing his wound while a child's sobs are heard over the soundtrack. Is this the voice of Bob's ghostly playmate crying over the possible fate of her friend or is it meant to be Freudstein himself, crying over the pain of his dismemberment? All in all a great sequence. Fulci gives the film something that his previous three lacked, a happy ending. Well, of sorts. Bob has witnessed Freudstein murder both his parents and is about to suffer the same fate when he is saved by the ethereal little friend who we find out is indeed the ghost of Freudstein's murdered daughter. The girl and her mother (also a ghost) will now take care of Bob and protect him from Dr. Freudstein but Bob is now part of the ghostly limbo in the which they live, never to return to the real world. The final shot is a beauty as the Mother ghost leads the two children down the path away from the material world as the camera pans back around to show the house where Freudstein is quietly and patiently awaiting his next victims. It's a great way to end a movie that is claustrophobic, gory and scary as hell. House By The Cemetery marked the end of an era. Not long afterwards uncut, unrated films would vanish from the nation's cinemas and become the domain of home video. I regret never seeing this film as it was meant to be seen, on the big screen. Watch House By The Cemetery on a cold, crisp night. It's an experience you won't soon forget.",
         "While most people think The Beyond is Fulci's best, i personally think this is his best film. The FX effects are alot better and realistic looking then his previous movies and the villain in the film Dr. Freudstein is among the ranks of Freddy, Jason, The Shape, Pinhead, Leatherface and others as a truely scary and nasty monster. Like all Fulci's films there are some problems including some bad acting, annoying dubbed voices, multiple plot holes and things that come up but are never hinted at or talked about again but overall the film conveys a frightening atmosphere (which Fulci is great at), excellent FX and gore effects (with one possible exception, lets just say it involves a bat), a great musical score and one of my favorite and most horrific villains ever put on screen. Fulci also ends it in a very dark and ambiguous manner. Vote: 9 out of 10"
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": ["Fulvia Film"],
      "summaries": [
         "In New York, Dr. Norman Boyle assumes the research about Dr. Freudstein of his colleague Dr. Petersen, who committed suicide after killing his mistress. Norman heads to Boston with his wife Lucy Boyle and their son Bob to live in an isolated house in the woods that belonged to Dr. Petersen. Bob befriends the girl Mae that only he can see and she warns him to leave the house. Soon his parents hire the mysterious babysitter Ann and creepy things happen in the house, When Bobby goes to the basement, his parents discover the secret of the house.",
         "In New York, Dr. Norman Boyle assumes the research about Dr. Freudstein of his colleague Dr. Petersen, who committed suicide after killing his mistress. Norman heads to Boston with his wife Lucy Boyle and their son Bob to live in an isolated house in the woods that belonged to Dr. Petersen. Bob befriends the girl Mae that only he can see and she warns him to leave the house. Soon his parents hire the mysterious babysitter Ann and creepy things happen in the house. When Bobby goes to the basement, his parents discover the secret of the house.",
         "Norman takes over the work of a dead colleague, Mr. Petersen, of his. Mr. Petersen killed himself while he was busy on a research about a certain Dr. Freudstein. Norman moves into the Freudstein house with it's wife and son. But something is not all right in the creepy mansion. Especially the basement seems to hide some cruel mystery."
      ],
      "budget": 0
   },
   "movielensId": 4417,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1981-08-14",
      "dvdReleaseDate": "2001-06-12",
      "directors": ["Lucio Fulci"],
      "runtime": 82,
      "movieId": 4417,
      "title": "The House by the Cemetery",
      "mpaa": "R",
      "actors": [
         "Catriona MacColl",
         "Paolo Malco",
         "Ania Pieroni",
         "Giovanni Frezza",
         "Silvia Collatina",
         "Dagmar Lassander",
         "Giovanni De Nava",
         "Daniela Doria",
         "Gianpaolo Saccarola",
         "Carlo De Mejo",
         "Teresa Rossi Passante",
         "Kenneth A. Olsen",
         "Elmer Johnsson",
         "Ranieri Ferrara",
         "Lucio Fulci"
      ],
      "imdbMovieId": "0082966",
      "originalTitle": "Quella villa accanto al cimitero",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["LTlTS4yFjNo"],
      "plotSummary": "A deranged killer lives in the basement of an old mansion and pops out occasionally to commit grisly murders that include be-headings.",
      "tmdbMovieId": 28794,
      "avgRating": 2.91016,
      "releaseYear": "1981",
      "numRatings": 128,
      "posterPath": "/2Pd2tTrktrB2pND61SvIIJxog9B.jpg"
   }
}