{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "painter",
            "id": 437
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "historical figure",
            "id": 6165
         },
         {
            "name": "maid",
            "id": 13097
         }
      ],
      "imdb_id": "tt0028167",
      "video": false,
      "title": "Rembrandt",
      "recommendations": [150392],
      "backdrop_path": "/53pq598VxisQxebM01yACCdRwSm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Rembrandt",
               "gender": 0,
               "credit_id": "52fe47b6c3a36847f81442bf",
               "name": "Charles Laughton",
               "profile_path": "/vEfcV6RA6tJr035OAG9U9o4uRyL.jpg",
               "id": 10921,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Geertje Dirx",
               "gender": 1,
               "credit_id": "52fe47b6c3a36847f81442c3",
               "name": "Gertrude Lawrence",
               "profile_path": "/AnIxQwyp6x8PB00wbALTDqew9PG.jpg",
               "id": 552029,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Hendrickje Stoffels",
               "gender": 1,
               "credit_id": "52fe47b6c3a36847f81442c7",
               "name": "Elsa Lanchester",
               "profile_path": "/2iuHeYDsEEzDScdvYOrIY673Q5N.jpg",
               "id": 2926,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ludwick",
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442cb",
               "name": "Raymond Huntley",
               "profile_path": "/txL0IXHSd70qIAGsGytEjcSL9g2.jpg",
               "id": 87071,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Fabrizius",
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442cf",
               "name": "Edward Chapman",
               "profile_path": "/560SL2ZjiLozbRyWGIMyBk2Aquy.jpg",
               "id": 33267,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Capt. Banning Cocq",
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442d3",
               "name": "Walter Hudd",
               "profile_path": null,
               "id": 85936,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Beggar Saul",
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442d7",
               "name": "Roger Livesey",
               "profile_path": "/2QoHb2n8EztkL8MUiajjVifa2SS.jpg",
               "id": 83907,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Titus van Rijn",
               "gender": 0,
               "credit_id": "52fe47b6c3a36847f81442db",
               "name": "John Bryning",
               "profile_path": null,
               "id": 1053796,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Auctioneer",
               "gender": 0,
               "credit_id": "52fe47b6c3a36847f81442df",
               "name": "Sam Livesey",
               "profile_path": null,
               "id": 134269,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Harmenzs van Rijn",
               "gender": 0,
               "credit_id": "52fe47b6c3a36847f81442e3",
               "name": "Herbert Lomas",
               "profile_path": null,
               "id": 231088,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Dr. Tulp",
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442e7",
               "name": "Allan Jeayes",
               "profile_path": "/qkQs32Rxaan0iM7hBLC9cU3qFfe.jpg",
               "id": 95027,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Govaert Flinck",
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442eb",
               "name": "John Clements",
               "profile_path": "/stiImomtMIM9Tv0Zv6PCUjIquIl.jpg",
               "id": 65851,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Dr. Menasseh",
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442ef",
               "name": "Abraham Sofaer",
               "profile_path": "/uCkrpe6pewrGhDYcuGivTNQXzxT.jpg",
               "id": 135066,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 2,
               "credit_id": "5a111e1dc3a36862830469ae",
               "name": "Skelton Knaggs",
               "profile_path": null,
               "id": 100770,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b6c3a36847f81442bb",
               "name": "Alexander Korda",
               "profile_path": "/iwUTfD7I6hcBWvx2PdJsCng9xmV.jpg",
               "id": 2490,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b6c3a36847f81442f5",
               "name": "Carl Zuckmayer",
               "profile_path": null,
               "id": 2900,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b6c3a36847f81442fb",
               "name": "June Head",
               "profile_path": null,
               "id": 1154789,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "5747026fc3a36808af0025b3",
               "name": "Alexander Korda",
               "profile_path": "/iwUTfD7I6hcBWvx2PdJsCng9xmV.jpg",
               "id": 2490,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57470280c3a3684f910011eb",
               "name": "Geoffrey Toye",
               "profile_path": null,
               "id": 1626291,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5747028fc3a3684f910011f0",
               "name": "Georges Périnal",
               "profile_path": null,
               "id": 20136,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "574702aac3a3684f910011f6",
               "name": "Francis D. Lyon",
               "profile_path": null,
               "id": 29324,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5747039cc3a368024d0000a2",
               "name": "John Armstrong",
               "profile_path": null,
               "id": 33263,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5747044a9251417ef10000e2",
               "name": "Sash Fisher",
               "profile_path": null,
               "id": 1569881,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "574704659251415f60002600",
               "name": "Robert Krasker",
               "profile_path": null,
               "id": 12720,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 2,
               "credit_id": "5747047bc3a368021d0000d8",
               "name": "Muir Mathieson",
               "profile_path": null,
               "id": 39055,
               "department": "Sound",
               "job": "Music Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.342077,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 50031,
      "vote_count": 5,
      "budget": 0,
      "overview": "This character study joins the painter at the height of his fame in 1642, when his adored wife suddenly dies and his work takes a dark, sardonic turn that offends his patrons. By 1656, he is bankrupt but consoles himself with the company of pretty maid Hendrickje, whom he's unable to marry. Their relationship brings ostracism but also some measure of happiness. The final scenes find him in his last year, 1669, physically enfeebled but his spirit undimmed.",
      "similar": [
         306819,
         769,
         5915,
         45317,
         462,
         11202,
         640,
         371638,
         318846,
         324786,
         389015,
         407445,
         363676,
         396371,
         323677,
         228970,
         274479,
         152532,
         300671,
         276907
      ],
      "original_title": "Rembrandt",
      "runtime": 85,
      "poster_path": "/mwPkThzeX5UcvfDNhMP9IAq8rZr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "London Film Productions",
         "id": 659,
         "origin_country": ""
      }],
      "release_date": "1936-11-06",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "He knew all women! Their lives...Loves...Their souls!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alexander Korda"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Carl Zuckmayer",
         "June Head"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028167/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MDYwOTA1OV5BMl5BanBnXkFtZTcwNTE5NzMyMQ@@._V1._CR3,41,326,432_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Laughton, Gertrude Lawrence, Elsa Lanchester | See full cast and crew »"],
      "reviews": [
         "REMBRANDT Harmenszoon van Rijn (1606-1669), overcomes personal tragedy & great sorrow to be revered as the world's greatest painter. Sir Alexander Korda's production of the life of the celebrated artist is beautifully presented on screen. Chief among its assets - and the main reason for its success - is the magnificent performance by Charles Laughton. Eccentric & temperamental, Laughton could be difficult to work with. But once fascinated by a role he gave it the full vibrato of his own extensive genius - here he makes Rembrandt an equal member of his continuing roster of fascinating portraits from the decade: Henry VIII, Bligh, Quasimodo. Laughton had the remarkable ability - like the English actor George Arliss, working in the American cinema - of using his physical ugliness to great advantage, his eyes in particular offering glimpses of his characters' souls. At various points throughout the film - a monologue of Woman's Mysteries; reading from The Scriptures - Laughton's beautiful, soothing voice reaches beyond the screen and down the years to caress the listener. Making a rare screen appearance, stage legend Gertrude Lawrence plays Rembrandt's shrewish housekeeper & companion, Geertje Dirx. Laughton's wife, the luminous Elsa Lanchester, is unforgettable as Hendrickje Stoffels, the housemaid who wins her employer's love and becomes his greatest defender and champion. The wonderful actor Roger Livesey, almost unrecognizable behind a bushy beard (but there's no disguising that unique voice) is memorable as the ragged beggar Rembrandt hires to model the Old Testament despot Saul; Livesey's scenes with Laughton are among the best in the entire film. John Bryning turns in a sensitive portrait as Rembrandt's son Titus. Sir John Clements has the small role as Govert Flinck (1615-1660), Rembrandt's disaffected apprentice and eventual rival. Movie mavens will recognize an uncredited Wilfred Hyde-White in a tiny cameo as an officer of the Amsterdam Civic Guard. The film is given first rate production values, with marvelous interior sets & costumes. The exterior Amsterdam sets are visually striking, with the camera angles and the stark angularity of the buildings making them look almost expressionistic. These contrast nicely with the simplicity with which the brief outdoor rural scenes are depicted. ********************************** Some important dates in the life of Rembrandt: 15 July 1606 - born in Leiden, The Netherlands, to the local miller. 1620-21 - attends University of Leiden. 1631 - moves to Amsterdam. 1634 - marries wealthy Saskia van Uylenburgh. 1639 - purchases large Amsterdam house. 1641 - son Titus is born. 1642 - Saskia dies; Rembrandt paints 'The Shooting Company of Captain Franc Banning Cocq ('The Night Watch').' 1649 - hires Hendrickje Stoffels as housekeeper; she becomes his common-law wife. 1654 - Hendrickje, pregnant with daughter, is censured by church council for living in sin. 1656 - Rembrandt declared insolvent; house & goods auctioned to pay debts. 1663 - death of Hendrickje. 1668 - death of son Titus, aged 26. 4 October 1669 - dies in Amsterdam. Rembrandt produced approximately 300 etchings, 600 paintings and 1,400 drawings.",
         "Why *can't* they make films like this anymore? Today, a film has to be the best part of three hours long and packed with special effects. In this film we see the story of a man's life told in half that time, made at a studio outside London. (Having said that, it was a box-office failure, presumably the audiences who shunned this flocked to see Clark Gable in 'San Francisco'.) Charles Laughton's performance is truly great, portraying Rembrandt's vision and artistic integrity (which appears as perverse stubbornness to his fellow citizens), and his deep humanity. His speeches at the inn which mirror each other at the beginning and end of the film, on the glory of perfect love and the vanity of human life, are so beautifully delivered I almost held my breath so as not to miss a word. More than that, the film succeeds in recreating Rembrandt's world. We see the business-like merchants, self-important local politicians and hard-living peasants who made up Dutch society in the 1600's. One of the most moving passages of the film shows Rembrandt trying to return to his home. He is physically unsuited to his father's work and derided by the villagers. He returns to Amsterdam realising he can't fit in with the merchant-class or the peasant-class where he was raised - he is a man alone. The supporting cast is noteworthy, including Elsa Lanchester (Mrs Laughton, of course) as Rembrandt's last love, Gertrude Lawrence (although I'm still not sure why audiences seemed to fall in love with her, maybe her histrionics were more suited to theatre) and a large crop of Liveseys (Roger, Jack, Sam - I'm sure there were others).",
         "Charles Laughton's heartfelt performance as the famed Dutch painter, Rembrandt, highlights this stylish biography, produced by Alexander Korda. Laughton's real-life wife, Elsa Lancaster, and Charles work together beautifully, and the film boasts a performance by the legendary stage actress, Gertrude Lawrence. One can see that Laughton really loved this role, and gave it his all. Certainly this is one of the more successful artist bios on film.",
         "Charles Laughton returned to his native Great Britain in 1936 for three years and made a series of films there. The first and best of these was for Alexander Korda about Rembrandt Van Rijn, arguably the greatest of all Dutch painters. Later biographical pictures, Lust for Life about Van Gogh and Moulin Rouge about Toulouse-Lautrec had good location photography going for them. Alexander Korda did create some nice sets to depict the Netherlands of the 17th century, but it just isn't the same. Another difference between Rembrandt and the other two later pictures is while Van Gogh and Toulouse-Lautrec died young, Rembrandt lived to be an old man by the standards of his century. The film takes us on a forty year journey of his life from the death of his first wife until just before he dies. Laughton is great at capturing Rembrandt at every stage of his life. As compared to those other two 19th century artists, Rembrandt's life was also not the tormented one the others had. Rembrandt is not a deformed cripple like Toulouse-Lautrec nor is he dealing with the onset of mental illness like Van Gogh. Tragedy happens in his life, but the tragedy isn't out of his own character. Like the other two Rembrandt was constantly plagued with money problems. That's actually what takes up most of the film, the compromises he makes with his artistic vision and the need he has to put bread on the table. Gertrude Lawrence and Elsa Lanchester do fine as the two women in his life. Laughton and Lawrence did not get along during the making of Rembrandt, that may have helped give their scenes some real bite. Three members of the performing Livesey family are in this film and Roger Livesey is a standout as the beggar who Rembrandt uses to paint his portrait of King Saul from the Old Testament. Rembrandt is a finely crafted piece of film making and Charles Laughton gives one of his best screen performances. I wish though it had been done on location the way Lust for Life and Moulin Rouge were.",
         "Truly wonderful and worth all the plaudits piled on this film after sixty-odd years. Laughton was arguably never better than in this role and has able support from Elsa Lanchester, Gertrude Lawrence (fascinating to see her and she made few films and they are rarely seen nowadays), the Livesey clan etc etc. A film of atmosphere, of clarity, and of soul, like a Rembrandt painting in fact. Marvellous.",
         "Just a short review here. I had not seen this film but bought it on the whim to suddenly want to see Laughton....had seen him in Mutiny and was of course very impressed. But this film shows Laughton's greatness even more. There are at least 3 and maybe 4 scenes here where Laughton reads portions of the Old Testament to people around him. He reads quietly and with a world weary reflection in his voice. In moments I was overcome with shivers down my neck. It was incredible to hear that voice. I read recently that he had a knack for being able to hold huge audiences totally spell bound while he read something or other. I can see why. I can only think of a few others, Orson Wells, Richard Burton who could entrance the audience just with the subtle use of a quiet voice. Oh that the modern acting world had such talent. But we do not have anyone of Laughton's ability working today. This is a fantastic film that should be seen over and over again. I am so very thrilled to have chanced upon it. You simply cannot find a more moving portrayal of a great man by one of the finest actors in any generation. Wonderful entertainment and not to be missed.",
         "Artists speak through their paintings and, often, their lives are not that interesting. \"Van Gogh\" gave us a good screen character because that film maximally milked his neurotic excesses. Very recently, \"The Girl With a Pearl Earring\" concocted a fantasy vision of long ago Delft and framed without fear of contradiction by scholars the life of an artist, Vermeer, about whom very, very little is known. In 1936, the great age of the Studio System, Alexander Korda produced and directed \"Rembrandt,\" a sprawling and somewhat disjointed portrait (pun intended) of Rembrandt van Rijn. Charles Laughton alternates as a boisterous or then somewhat subdued Rembrandt. He loses his wife to illness and then takes up with a domestic, Geertje, played by Gertude Lawrence. Lawrence is fine as a woman who combines common sense with hectoring but who, in the process, sacrifice's the relationship's initial passion to hnadling daily burdens. This Rembrandt has no idea that in the future his paintings will be quite desired by museums and thieves, including celluloid ones. He paints, he proclaims, what he sees and not what his patrons want. A huge painting of the Civic Guard is unveiled to shock and denunciations as, Goyaesque, the contributors to the fund for the painting see themselves savagely lampooned. A new model, Hendrickje, charmingly acted by a beautiful and youthful Elsa Lanchester, steals Rembrandt's heart and body, leaving the long suffering Geertje out in the cold. Rembrandt's relationship with Hendricktje is the most charming part of a film that blends unconvincingly connected scenes together. There's too much noise: Rembrandt paints, Rembrandt drinks (a lot), Rembrandt is hounded by creditors, Rembrandt runs back to dad. Laughton's acting carries the film and when he occupies center stage he is never less than attention-grabbing. But this isn't the Charles Laughton of \"Mutiny on the Bounty,\" there a riveting character. Laughton's Rembrandt is a fellow one might care to sip smooth Holland gin with but he's no character with a deep soul inviting speculation and drawing the best from a great actor. \"Rembrandt\" is a studio product well representative of its time. On that basis it merits enjoyable viewing. 8/10.",
         "This was a superbly acted movie. I happened across it on TCM and was instantly sucked in. The dialogue was written very well and beautifully portrayed by all of the actors. This is not a typical movie from 1936 with over the top deliveries from the talent. I just can't say enough about it. Additionally, it was shot very nicely. Keep in mind that this is a very old movie, but the black and white photography is put together in an almost Rembrandt way. If you haven't seen Rembrandt then go and get it. You won't be disappointed. Well done!",
         "This is one of the best-ever biographic flicks about the life of an artist. The scenography is brilliant. The script is minimalist, but just sufficient. Learn how to beg. This film tells it all. Get that leg kick just right! Not exactly pennies from heaven, but the House of Orange willingly provides. Never trust merchants or burghers to pay up. Learn how to love. This story is a true love story. That's the law in Holland! Vanity of vanities, all is vanity! Wish this film were out on DVD in the UK,",
         "\"Pictures must not be too picturesque\" (Ralph Waldo Emerson). Alexander Korda, the founder of London Films, appears to be an altogether intriguing personality in cinema history. Brian Eggert in his Deep Focus review nicely observes that he frames his characters \"in a way that personalizes the drama, seeing them as people and not dry historical figures.\" How beautifully this notion occurs to manifest itself in this picture. His REMBRANDT is a movie which is far from any biographical approach but rather stands out as an insight into an artist tormented by conflict between the gravity of 'properly social' requirements and the eagle's wings of inspirations - a genius whose life and work are far from 'too picturesque' traditionalized sweetness. Therefore, Emerson's quote, which I entailed at the beginning of my review, seems to correspond to that development which we find in this barely 'ornamented' 80 minute-long film. The fact that Korda's movie boasts of many charming moments, beautiful camera shots, dazzling costumes and stunning cinematography remains pretty indisputable. Although the recreation of the Amsterdam of the time does not occur to be fully satisfactory due to certain lacks of possibilities at hand, the interiors make for artistic impressions. The cinematographer Georges Perinal powerfully employs his efforts to combine visual with overtones (consider Rembrandt's indicative love scene with his wife to come, the shadows, the name of his desire written on the table and the ever present storm that sets the tone for the sensually typical moments on the screen). But it is not where the film's triumph really lies. When seeing the film nowadays, it seems that we are watching quite a modern approach to the 'interpretations' of an artistic personality. The movie, as I have mentioned before, does not focus on descriptive approach of Rembrandt's paintings but rather on the protagonist who speaks his mind, shares what lies deep down his heart. In this way, it's not just like \"I am going to present to you a life of an artist\" but he invites a viewer for a fruitful discourse of perceptions. Of course we could quarrel here to what extent it is the historical Rembrandt. Ignoring some cinematic liberties taken with the genial leading hero of art, we are at least supplied with a vibrant, vital, engrossing image of a man who grows in both skill and thought. Isn't that what many of us long for in movies? Apart from flawlessly delivered biblical verses corresponding to his life experience, Rembrandt (Charles Laughton) shares with us his thoughts about life, women, social status, success, his vision of the 'caged' world. His inner dictates allow him to reveal himself, his struggles between vision and reality, 'women' and 'wives,' conventions and Love. As the movie skips all glorification, all baseless idealization or illusionary assumptions, we may 'properly' talk about the movie in terms of Korda's revolutionary approach along with Laughton's revelatory portrayal that deeply focus on the humanity of character. This 'humanization' refers to many scenes from the frequently discussed rejection of THE NIGHT WATCH when Rembrandt powerfully makes it clear to everybody that he wanted to 'paint men. Soldiers. Company marching out' instead of glorified 'gentlemen of rank and position' through his encounter with one of his 'lowest of the low' subjects of painting, a beggar (played by Roger Livesey) along with the lesson both learn from each other, Rembrandt's visit at his hometown Leyden where he aims at recognizing his sense of belonging and hopes to restore his sense of attachment... Concluding from the turmoil, an artist belongs nowhere but his inner individualized existence. In one scene, Rembrandt says: \"Every man is a destined path.\" Nowhere does it appear as clear as in his relation to WOMEN. He seems to be in love with his wife Saskia (whom we actually never see on screen) but as soon as we appreciate the witty verses in a skillful game of words, funeral chimes toll over the windowed husband mourning and grief. In one moment when he tries to forget the sorrows, he spills the beans about the inner desires (I need a woman I can call my wife) and, unreasonably, gets married to his housekeeper Geertje Dirx (Gertrude Lawrence). However, she symbolizes all that is 'material' and 'down-to-earth' in a subtle man's perception of a woman. \"Use your common sense\" seems to be the slogan that does not only takes hold of her but which also interrupts the artist's great moment of inspiration. As a cure comes a young and beautiful Hendrickje Stoffels. Strikingly similar in looks to the artist's wife, she inflames jealousy within the envious woman and the Sanhedrin-like assembly of accusers. Within the moral and financial hazards, the love of the two does not find obstacles serious enough to spoil their feelings. ELSA AND CHARLES supply the movie solely with power scenes of unique chemistry. Brian Eggert memorably points out that \"Laughton's busy hands and eyes create an observant, thoughtful character\" being \"bold yet timid and modest, as only a poor but gifted genius could be.\" However, he shines fully at Elsa's side Their most unforgettable scene shows them 'recreate' their first meeting when he looks at her as both and artist and a man. With its height of emotions within 'from the inside out' method, derived from Stanislavskyan school, the moment beautifully addresses human longing for the possibility to experience the happiest moments of life once again. Yet, at the same time, it draws parallels with an intriguing assumption that true love is the only source of happiness in anyone's life. A highly worth seeing movie about a man whose was a destined path and yet a man whose modest approach derived from Solomon's words of wisdom have resulted in transcending portraits that still personify absorbing developments of artists tormented by storms yet touched by the grace of talent...and inspiration growing in a ray of enlightenment."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["London Film Productions"],
      "summaries": ["This character study joins the painter at the height of his fame in 1642, when his adored wife suddenly dies and his work takes a dark, sardonic turn that offends his patrons. By 1656, he is bankrupt but consoles himself with the company of pretty maid Hendrickje, whom he's unable to marry. Their relationship brings ostracism but also some measure of happiness. The final scenes find him in his last year, 1669, physically enfeebled but his spirit undimmed."],
      "budget": 0
   },
   "movielensId": 4431,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-11-06",
      "dvdReleaseDate": "2001-06-19",
      "directors": ["Alexander Korda"],
      "runtime": 85,
      "movieId": 4431,
      "title": "Rembrandt",
      "mpaa": "",
      "actors": [
         "Charles Laughton",
         "Gertrude Lawrence",
         "Elsa Lanchester",
         "Raymond Huntley",
         "Edward Chapman",
         "Walter Hudd",
         "Roger Livesey",
         "John Bryning",
         "Sam Livesey",
         "Herbert Lomas",
         "Allan Jeayes",
         "John Clements",
         "Abraham Sofaer",
         "Skelton Knaggs"
      ],
      "imdbMovieId": "0028167",
      "originalTitle": "Rembrandt",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["VRYaJD-RUYs"],
      "plotSummary": "This character study joins the painter at the height of his fame in 1642, when his adored wife suddenly dies and his work takes a dark, sardonic turn that offends his patrons. By 1656, he is bankrupt but consoles himself with the company of pretty maid Hendrickje, whom he's unable to marry. Their relationship brings ostracism but also some measure of happiness. The final scenes find him in his last year, 1669, physically enfeebled but his spirit undimmed.",
      "tmdbMovieId": 50031,
      "avgRating": 3.30769,
      "releaseYear": "1936",
      "numRatings": 52,
      "posterPath": "/mwPkThzeX5UcvfDNhMP9IAq8rZr.jpg"
   }
}