{
   "tmdb": {
      "original_language": "cn",
      "keywords": [{
         "name": "martial arts",
         "id": 779
      }],
      "imdb_id": "tt0077594",
      "video": false,
      "title": "Game of Death",
      "recommendations": [
         11713,
         12481,
         9462,
         9461,
         48773,
         44645,
         53321,
         10423,
         18666,
         10222,
         154114,
         10616,
         10413,
         2099,
         9626,
         10617,
         19267,
         11537,
         9056,
         17466
      ],
      "backdrop_path": "/7QSm8b79BWB9x71CxXglyvgjcLu.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "DanDare",
         "id": "592cbec99251417c59004362",
         "content": "Billy Lo is a famous action martial arts film star who is being courted by a crime syndicate. After constantly rejecting their advances they try to kill him and fail. Lo fakes his own death and goes underground to get back at the criminal gang.\r\n\r\nBruce Lee only half finished a version of this film before he died in 1973. Five years later director Robert Clouse who made Enter the Dragon with Lee completed the film.\r\n\r\nIn order to do this, he used the existing footage with Lee, also used stock footage from previous Lee films and got a double and shot new footage with a new story line.\r\n\r\nThe result is a choppily edited film despite getting Hollywood actors such as Dean Jagger and Gig Young as well as John Barry to do the musical score. In fact Jagger gets some awful dialogue.\r\n\r\nThe new footage with the double is leaden and so are the action scenes. Only the Bruce Lee shot sequences bring the film to live.",
         "url": "https://www.themoviedb.org/review/592cbec99251417c59004362"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Billy Lo",
               "gender": 2,
               "credit_id": "52fe455b9251416c75053b4f",
               "name": "Bruce Lee",
               "profile_path": "/kzeeWP2pHcGcyWfUYJOx65DaJlP.jpg",
               "id": 19429,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Colt",
               "gender": 2,
               "credit_id": "52fe455b9251416c75053b57",
               "name": "Chuck Norris",
               "profile_path": "/v37EfVIoKV4ooy1KE5z8BxsT6wU.jpg",
               "id": 51576,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Lo Chen",
               "gender": 2,
               "credit_id": "5a3c399a0e0a264ccd2345a4",
               "name": "Sammo Hung",
               "profile_path": "/hpqwIMmLLpn0mMmpi4EhzARK24K.jpg",
               "id": 62410,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Billy Lo",
               "gender": 0,
               "credit_id": "52fe455b9251416c75053b6b",
               "name": "Yuen Biao",
               "profile_path": "/hdBQMhtzpamgodIURGPQAcKdbWC.jpg",
               "id": 62414,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Pasqual",
               "gender": 0,
               "credit_id": "52fe455b9251416c75053b73",
               "name": "Dan Inosanto",
               "profile_path": "/hUAio3rKy18OMPCTZReblMqtLZa.jpg",
               "id": 1071306,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Hakim",
               "gender": 2,
               "credit_id": "52fe455b9251416c75053b53",
               "name": "Kareem Abdul-Jabbar",
               "profile_path": "/xUzZxzrAaAKZ1l2quIJRgmBwOGU.jpg",
               "id": 14414,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Ann Morris",
               "gender": 1,
               "credit_id": "52fe455b9251416c75053b5b",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Dr. Land",
               "gender": 0,
               "credit_id": "52fe455b9251416c75053b5f",
               "name": "Dean Jagger",
               "profile_path": "/ynPzyxE5xvkKDwr8xw18WoCsITN.jpg",
               "id": 29313,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Jim Marshall",
               "gender": 2,
               "credit_id": "52fe455b9251416c75053b63",
               "name": "Gig Young",
               "profile_path": "/b3ygoxK0hWTDtKdwE0C8fUgLoLu.jpg",
               "id": 70985,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Billy Lo",
               "gender": 0,
               "credit_id": "52fe455b9251416c75053b67",
               "name": "Tai Chung Kim",
               "profile_path": "/ab6ZG5UVxVHuMqMrpLsCVqrwYF6.jpg",
               "id": 73662,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Carl Miller",
               "gender": 2,
               "credit_id": "52fe455b9251416c75053b6f",
               "name": "Robert Wall",
               "profile_path": "/lsffFZ7zG2PkLMAOSv1PyYrYr0v.jpg",
               "id": 131170,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Macau fighter",
               "gender": 2,
               "credit_id": "5a3c39af9251410336234334",
               "name": "Lam Ching-Ying",
               "profile_path": "/vumuAR5gwnvVOS0jHwut8MSuUKf.jpg",
               "id": 62423,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "[Extra]",
               "gender": 2,
               "credit_id": "5a3c39c39251410336234353",
               "name": "Mars",
               "profile_path": "/zGGxzvblNq4UxNIdXLsQLanvhtS.jpg",
               "id": 119454,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "[Extra]",
               "gender": 2,
               "credit_id": "5a3c39c90e0a264cc4223e61",
               "name": "Chung Fat",
               "profile_path": "/p4JkuLfeK8enSyh4gZ6rqt0lvoY.jpg",
               "id": 119460,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe455b9251416c75053b4b",
               "name": "Robert Clouse",
               "profile_path": "/y4Wd9h5WeOGEEklhCcDYnEQOcKx.jpg",
               "id": 57727,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe455b9251416c75053b79",
               "name": "Robert Clouse",
               "profile_path": "/y4Wd9h5WeOGEEklhCcDYnEQOcKx.jpg",
               "id": 57727,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5572d4149251416af70036ee",
               "name": "Raymond Chow",
               "profile_path": "/zAIthSX6xZoaj1J09Uv6JzagKWP.jpg",
               "id": 46323,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5572d424c3a3686ef90014c0",
               "name": "Andre Morgan",
               "profile_path": null,
               "id": 71018,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5572d43b9251410872006b13",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5572d45792514111610020d8",
               "name": "Godfrey A. Godar",
               "profile_path": null,
               "id": 1474505,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5572d46892514111610020de",
               "name": "Alan Pattillo",
               "profile_path": null,
               "id": 67452,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac2a04e0e0a260c0102319b",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 10.385126,
      "production_countries": [
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 13333,
      "vote_count": 155,
      "budget": 10000000,
      "overview": "Billy Lo is a Hong Kong-based movie actor, who is a box office draw. His girlfriend, Ann Morris, is a singer who is also climbing to the top. Now it seems the syndicate wants Billy and Ann to join their \"management firm\". But Billy knows that they will be treated like property, so he refuses and tells her to do the same. So they try to \"encourage\" him to join but he still refuses. He would be advised that they will not stop, so he must stop them, permanently. He is even more hesitant to do that but when an attempt on his life is made, he fakes his death and alters his appearance, and decides to go after the syndicate; taking them out one at a time.",
      "similar": [
         9053,
         55292,
         9461,
         44865,
         140300,
         146,
         24,
         272,
         604,
         682,
         605,
         98566,
         11770,
         9502,
         7549,
         11841,
         2024,
         16320,
         27578,
         27582
      ],
      "original_title": "死亡遊戲",
      "runtime": 94,
      "poster_path": "/xXZHuTg6qtxWbbXAbTZsEqhpL3.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Golden Harvest Company",
            "id": 2521,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Concord Productions Inc.",
            "id": 3526,
            "origin_country": ""
         }
      ],
      "release_date": "1978-03-23",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Bruce Lee challenges the underworld to a Game of Death.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Robert Clouse",
         "Sammo Kam-Bo Hung"
      ],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Robert Clouse"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077594/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5ODYxNDM5MV5BMl5BanBnXkFtZTcwMDQ5NzQzMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Bruce Lee, Gig Young, Colleen Camp | See full cast and crew »"],
      "reviews": [
         "Before Bruce Lee died he worked on scripts for Game of Death (also known under some titles as \"song of the knife\")...and shot some 40 odd minutes of footage including test screenings and actual fight sequences. The idea of the film was to make a multi-layer, philosophical film made for the chinese and eastern audience to ask the question over martial arts style - the advantages and disadvantages of each style, as well as questioning the need for style anyway. The film's main plot was to be based in Korea. Bruce Lee would be forced into storming a 4 or 5 storey Pagoda which is said to hold a infinite treasure with each level guarded by a different style. The bottom floor would be held by hundreds of Karate students (much like the ending of Enter the Dragon), the first layer would be a style under the handle of \"Gate of Enlightment\". The Second layer would be the Preying Mantis with elements of Wing Chun. The Third layer would be a Philophino style whilst the Fourth, the Temple of Gold would be held by a Hapikdo expert (though I'm not sure about this). The Fourth layer would be the Temple of the Unknown, guarded by one Kareem Abdul Jabbar - doing an unknown style. Whilst shooting, most of the footage was lost to the ravages of time. And when Bruce Lee died, his fans cried out for any footage to be shown as a mark of respect. The end footage of Bruce Lee fighting Jabbar and previous footage would be cut to bits by Robert Clouse and put into a new film under the same name. The end film is offensive and shatters the whole idea of the original GOD plot and story - but then again there wasn't enough info on the film to start with. Bruce Lee fans were in uproar...the film was a shambles, yet was commerically succesful. Most of the film had no Bruce Lee in it, or had lookalikes or even worse used Stock Footage of old Bruce Lee films and interspliced it into the film. The DVD, whilst is good, doesn't do much to help the film - there isn't enough info on the script notes...why is there so much text, why didn't they try to recreate the scenes, the floors or even re-do the film as new? You'd be better off not to buy either the DVD or video version unless you want to waste money or actually are a die-hard bruce lee fan. The DVD doesn't give you much - but then again there was never much to start with. You'd be better off looking on the Internet for the original GOD scripts and info or even multimedia - as even now on the web you can see the footage that Bruce Lee shot and never got into the original DVD or movie. Overall this is a very, very weak film with a good score and bad camera angles and discredits Bruce Lee's image so much it becomes deeply offensive and patronising to the viewer. In fact you could argue that this film singly-handly started the Bruce Lee imitators phenomnen. Whether the film's patronising and offensive viewpoint is the fault of Robert Clouse, Sammo Hung who directed the fight sequences and drafted in the services of two look-a-likes or even the producer Raymond Chow is unknown, but what is clear is the fact they tried. and failed. As Brandon Lee once said: \"Game of Death has 40 minutes of footage, and the rest is junk\". I couldn't agree with him more. Overall: 2/10",
         "I wish this wasn't credited to Bruce Lee's name, it's an embarrassment to all involved, and I honestly can't see why this film is praised by some people. Lee filmed a few fight scenes for a movie before putting the project on hold to do Enter The Dragon, and of course his death. This is the finished product (without his input). His scenes were poorly edited into a full length piece of crap. I tried to look past the fact that shots switched from old, grainy film to cleaner, sharper film continuously throughout any scene with the real Lee. I tried to look past the appalling effects; such as sticking a picture of Lee's face on a mirror, and filming it as if attached to someone's reflection. I even managed to look past the fact that the guy playing Lee's character for the rest of the film barely looked like him at all. But I still ended up with a bad taste in my mouth at the end of the film. There is still a point of interest for Bruce Lee fans, the last 15 minutes are great, (the real) Lee's fight with Abdul-Jabar is amazing...But it didn't do the overall product very much help (for the full unedited version of what Bruce Lee filmed for this, check out the documentary on the man called 'Bruce Lee: A Warriors Journey'). This is my second bad experience with unfinished/unreleased films being edited into others, (see also, or more appropriately -- don't see also: Sam's Song starring Robert De Niro), so I have learnt my lesson. 2.5/10.",
         "'Game of Death' is the equivalent of having your dog swallow a gold ring - you've got to sift through the cr*p to find the polished stuff. Completely different to Bruce's original vision, the 1978 version is hugely controversial. To some, it's a shameless cash-in and insult, to others it's a curiosity. To me personally, it's a guilty pleasure. Obviously, with such limited footage of Bruce Lee to use, the film was always going to suffer. Not only that, but how do you incorporate the footage into a film and give it context? The stand-in's that are used to fill the time leading up to the Lee footage are never going to fool anyone. Even as a kid, I could tell it someone else. The techniques used to have Bruce Lee on screen range from awful (superimposed heads) to tasteless (his real funeral) to fairly good (quick cuts from old footage). The disguises that Billy Lo and Bruce's doubles wear throughout the film are hokey but nothing that we haven't seen in Lee's films before (Fist of Fury), so that didn't bother me too much. Despite some awful dubbing and a poor script, 'Game of Death' is still watchable for it's action. Fight choreographer Sammo Hung makes the non-Lee fight scenes entertaining even if the doubles don't match Bruce Lee's speed or technique. However, they do capture some traits of Lee's fights including the slow motion finishing move. Also, the film's budget allows for a number of locations ensuring that Billy's quest for revenge keeps moving. In this regard, the Hollywood frills that are added give the film a degree of watchability, especially the classy score which appears throughout and heightens the final scenes. But of course, the main point of watching 'Game of Death' is to see Bruce in action. Although criticised for cutting down the \"pagoda sequence\", I think it still contains enough to satisfy. You have to remember that this original footage included two companions of Lee's who don't feature in the 1978 film, meaning a lot had to be left out. The nunchuk duel is unique while the fight with Kareem Abdul Jabbar is bizarre but thrilling. There are some moments of bad taste, but on the whole the film is a cheesy and quite fun attempt to build up to the final 20 minutes. Whether you think this was a cash-in or a tribute, you still need to see it in order to understand the 'Game of Death' phenomenon.",
         "The sad: Bruce's premature death, the disposal of the original script, the inclusion of the current one, the cop-out ending, \"Bruce's\" punking out... The Funny: The double used through mist if the film meant to be passed off as Bruce Lee, the blatant use of stock footage from other Bruce films, the acting... The enjoyable: The score is very underrated, one of John Barry's finest (I have the soundtrack to this movie, along with another Barry film, Night Games.) Some real good martial arts sequences make the wait for the real Bruce footage towards the end, especially the locker room fight between \"Bruce\" and Bob Wall (choreaographed by Sammo Hung and Yuen Biao, who reportedly portrayed Bruce in that scene.) Sammo himself appears as a fighter in the film. I give this movie a modest recommendation.",
         "lee didn't manage to finish this film but director robert clouse (of e.t.dragon fame) manages to pick up the pieces left behind and make a film out of it which is where the film falls down. you see they had to bring in stunt doubles to replace Lee so everytime he's wearing shades or has his back to you you just know that it's not really lee. for the scene in which lee is shot they reused scenes from the superb fist of fury(it is sooooo obvious because the colour quality is different)!!! apart from the fun of spotting which scenes lee failed to complete, the changing room scene is fantasticly good fun to watch, your jaw will drop open at lee's two final finishing moves the penultimate kick is compareable to lee's complete bicycle kick in e.t.dragon. overall this film is well worth the mere £5.99 of which it costs in england",
         "Game of Death (1978) was another film project that was a Warner Brothers and Golden Harvest joint production. Movie goers all around the world were still in shock from the sudden death of Bruce Lee. His last film Enter the Dragon was a worldwide success. After his death a plethora of knock-offs and wannabe Bruce Lees flooded the market place. Raymond Chow and company saw an untapped market for another film \"starring\" Bruce Lee. He heard of an unfinished film that Bruce was working on before he was dead. So he hired Robert Clouse to direct new footage so it could be worked into the existing one. Sammo Hung was hired to become the action director (he also appears as a prize fighter). Robert Clouse used two doubles for Bruce Lee (one of them was Yuen Biao) and a lot of stock footage was used whenever it could. The use of the footage was a very, very bad idea. Many of the seems were obviously cut-and-paste and made the film look very cheap and exploitive fare. This was going to be another movie with Hong Kong actors and American ones thrown into the mix. Gig Young, Dean Jagger and Collen Camp (when she was extremely hot) co-star as well as Kareem Abdul-Jabbar and several of Bruce Lee's friends. Instead of fleshing out the movie that Bruce was working on before he died, the film makers noticed that there were already several different films that were already made that bore a similarity to the original Game of Death. The new movie centered around a murder mystery and a lot of fighting peppered with a lot of action direction work from Sammo Hung. The finished results were a mixed bag. The American cut of the film was not that great and is pretty mediocre. The Hong Kong version is a whole lot better with extra footage (It's also edited differently, has all the trademarks of a Sammo Hung film project instead of one by Robert Clouse). and more Hong Kong actors and plot. It must have been a success in Hong Kong because a sequel was made from even more unused footage and outtakes of Bruce Lee. This movie is actually better than this one because it doesn't take itself seriously, not as much recycled footage and the fight scenes are even better. If I were to watch this movie I would recommend finding the Hong Kong version. It's a lot better than the boring American release. Followed by the Tower of Death a.k.a. Game of Death 2.",
         "\"Game of Death\", a frankenstein concoction of bits and peices of Bruce Lee's final performance in a movie originally shot in 1972-73 and a later filmshot in 1978 after Lee's death is really two movies in one. The first, a crime/revenge caper helmed by Robert Clouse is not as bad as you may have heard. The scenes are intercut badly and Lee's many doubles do look bad, but as a movie on it's own merit it isnt that bad. The film concerns a young movie star, Billy Lo (played by several uncredited doubles) and a crime syndicate headed by evil Dr. Land (Dean Jagger who is good) His henchman (Hugh O'Brian, Mel Novak, and Bob Wall) won't let our hero rest until he signs an exclusive contract with them, which will put Billy under their control. Colleen Camp and Gig Young Co-star. Camp is benign as Billy's voluptuous girlfriend and Young looks like he wants to be anywhere else. The score is excellent courtesy of John Barry's music which sets a mood for the picture. The second part of the movie is the final fight scenes in a pagoda which include Bruce Lee himself in some magnificent fight scenes with several worthy advesaries including Kareem Abdul Jabbar(!) and Danny Inosanto. The last 15-20 minutes are the only to feature the real Bruce Lee, but watch the locker room fight, it is very good on it's own merit. In summary, a cheesy 70's Kung Fu movie that wraps around some spectacular footage of Bruce Lee in his \"final performance\", but which also has some charm of it's own.",
         "Game Of Death is a mess of a film,and that's putting it lightly. Nothing to do with Bruce Lee's original conception for the film in 1973,the filmmakers here took the fight footage {somewhat edited down} that he shot for that proposed film,placed it at the end of the film,and than decided to pretend that the rest of the film also features Bruce Lee. Badly. In fact the sheer ineptitude of this aspect of the film is extraordinary,as well as several doubles,none of whom look like Lee and usually wear sunglasses to try to hide the fact,there are also shots and brief bits from previous Lee films edited in and even a scene with a guy wearing a Lee mask! Nonetheless,there is a certain fascination to the film. The plot is kind of interesting and even has a scene in which Lee's character,a movie star, fakes his own death by being shot whilst filming a scene,this being disturbingly similar to the way Lee's son Brandon died many years ago. There is loads of fighting,not all of it great,but it's pretty constant and contains at least two good sequences {a fight in a changing room and a battle with some motorcyclists}en route to the 'real' Lee stuff at the end,which is certainly worth the wait. The duel with Kareem Abdul Jabbar is almost as good as the famous one with Chuck Norris. Dean Jagger is a great slimy main villain,and John Barry {an odd film for him} provides great musical backing,even if the main female star Coleen Camp is not really good enough to sing his lovely theme song. Game Of Death is undeniably a piece of exploitation and sometimes leaves a bad taste in the mouth,as when a funeral scene is interspersed with shots of Lee's real funeral. It's really a bad movie and for the most part a badly made movie too, but it's certainly not dull and is kind of fun, as many bad movies are.",
         "POSSIBLE SPOILERS!! Structurally and historically a mess, Lee's final film had the potential to be the greatest ever martial arts movie. Unfortunately, Lee died well before filming was completed, and his vision was never finished. However, the producers managed to finish the film by taking what had already been filmed, mostly fight scenes, and make a story round it, one based roughly on the many pages of scripts and ideas that Lee had left behind. As Lee's original story was so complex though, and probably only he could have made it the way it should have been, the finished product is a mere shadow of the what was in Lee's head. The story sees Lee's character, a famous martial artist and actor faking his own death so that he can uncover the corruption of those who had previously tried to kill him. Not even his girlfriend is aware that his death was a fake. As the film progresses, Lee stalks the bad guys, his girlfriend gets suspicious, and Lee reaches a pagoda where he must overcome the trials of each floor in order to reach the top, and fulfill his revenge. Lee's original script focused much more on the Pagoda scenes, with each floor showcasing a different martial arts style that Lee must overcome, using his own 'way of no way' style. With each floor completed, he would achieve a higher level of spiritual and fighting skill. The fight scenes are easily some of the best ever filmed, skillfully thought out, and beautifully directed, and no-one since has been able to capture the technique, skill, or intensity of Lee. The other fight scenes are also good, including the motorcycle scene, and Shower room fight. If anyone has any of the Hong Kong Legends DVDs they feature many deleted scenes, the Game of Death one being particularly good- The glass house fight is a classic. The actors brought in to finish shooting are unsure of themselves, which comes across on camera, but this is understandable considering they were finishing a film starring a man who had died years before. The music is excellent, the story messy, but the fights stand out. The overall tone of the film is dark and ominous, as Lee's character is almost killed mysteriously, then fakes his own death, and the ending is not conclusive. Footage of Lee's own funeral is used, adding to the tone. However, it is a vital piece of work for any fan of Lee and should be remembered for its ideas, if not for how it eventually turned out to be. 7 out of 10",
         "Rated R for Violence Quebec Rating:13+ Canadian Home Video Rating:14A Game Of Death was Bruce Lee's final film.He originally had a different vision for it however Bruce died in 1973.A few years later, they decided to finish it for Bruce but they didn't use much of Bruce Lee's original ideas.It has been a while since I have seen this movie so I cant remember much of it.All I really remember is Bruce Lee is an actor who is in trouble with the mafia.So he fakes his own death and gets revenge on them basically.The fight scenes are pretty good especially the end with basketball player Kareem Abadul Jabar.Game Of Death is an entertaining movie but it could have been much better if Bruce was still alive.Funny thing is only some of the film is really Bruce Lee.The rest of the film has a Bruce Lee look-a-like named Bruce Li who made cheap Bruce Lee rip-off films in Hong Kong during the 1970's.A disturbing thing about this movie was that during one of the scenes where Bruce is filming a movie, somebody puts real bullets in the gun and actually shoots Bruce.This is how he fakes his death.Bruce Lee's son Brandon Lee got shot and killed on the set of the 1994 film The Crow the exact same way."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Columbia Pictures",
         "Paramount Pictures",
         "Concord Productions Inc."
      ],
      "summaries": [
         "In this movie, Bruce Lee is a very famous martial-arts master who stars in many films. After an unsuccessful murder attempt against him, everyone thinks his is dead, but he's just hiding, preparing his revenge...",
         "Bruce Lee plays Billy Lo, a HongKong based movie actor, who is a box office draw. His girlfriend, Ann Morris is a singer who is also climbing to the top. Now it seems the syndicate wants Billy and Ann to join their \"management firm\". But Billy knows that they will be treated like property, so he refuses and tells her to do the same. So they try to \"encourage\" him to join but he still refuses. He would be advised that they will not stop, so he must stop them, permanently. He is even more hesitant to do that but when an attempt on his life is made, he fakes his death and alters his appearance, and decides to go after the syndicate; taking them out one at a time.",
         "A martial arts movie star must fake his death to find the people who are trying to kill him."
      ],
      "budget": 0
   },
   "movielensId": 4441,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English"
      ],
      "releaseDate": "1978-03-23",
      "dvdReleaseDate": "2001-07-03",
      "directors": ["Robert Clouse"],
      "runtime": 94,
      "movieId": 4441,
      "title": "Game of Death",
      "mpaa": "R",
      "actors": [
         "Bruce Lee",
         "Chuck Norris",
         "Sammo Hung",
         "Yuen Biao",
         "Dan Inosanto",
         "Kareem Abdul-Jabbar",
         "Colleen Camp",
         "Dean Jagger",
         "Gig Young",
         "Tai Chung Kim",
         "Robert Wall",
         "Lam Ching-Ying",
         "Mars",
         "Chung Fat"
      ],
      "imdbMovieId": "0077594",
      "originalTitle": "死亡遊戲",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "K6Ic_4m6tYE",
         "GDCwCynGFU4"
      ],
      "plotSummary": "Billy Lo is a Hong Kong-based movie actor, who is a box office draw. His girlfriend, Ann Morris, is a singer who is also climbing to the top. Now it seems the syndicate wants Billy and Ann to join their \"management firm\". But Billy knows that they will be treated like property, so he refuses and tells her to do the same. So they try to \"encourage\" him to join but he still refuses. He would be advised that they will not stop, so he must stop them, permanently. He is even more hesitant to do that but when an attempt on his life is made, he fakes his death and alters his appearance, and decides to go after the syndicate; taking them out one at a time.",
      "tmdbMovieId": 13333,
      "avgRating": 3.28454,
      "releaseYear": "1978",
      "numRatings": 304,
      "posterPath": "/xXZHuTg6qtxWbbXAbTZsEqhpL3.jpg"
   }
}