{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt0106873",
      "video": false,
      "title": "Fatal Instinct",
      "recommendations": [
         21119,
         5709,
         11131,
         27465,
         9409,
         22434,
         31608,
         141127,
         16814,
         34151,
         30644,
         27642,
         14361,
         20242,
         11718,
         24073,
         28733,
         20318,
         62761,
         23303
      ],
      "backdrop_path": "/vXg2Kw22le7Itmmv0M2k5701G9w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ned Ravine",
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4ab",
               "name": "Armand Assante",
               "profile_path": "/m9DCpe9HkIXEAp3aq1wKpmN8mih.jpg",
               "id": 23346,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Laura Lincolnberry",
               "gender": 1,
               "credit_id": "52fe44efc3a368484e03f4af",
               "name": "Sherilyn Fenn",
               "profile_path": "/1AKZocU6gfD1udBPUxYH6Vez8Ll.jpg",
               "id": 6681,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lana Ravine",
               "gender": 1,
               "credit_id": "52fe44efc3a368484e03f4b3",
               "name": "Kate Nelligan",
               "profile_path": "/4GpQvniLNMKF19qtHMb0tBBgNce.jpg",
               "id": 18794,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lola Cain",
               "gender": 1,
               "credit_id": "52fe44efc3a368484e03f4b7",
               "name": "Sean Young",
               "profile_path": "/4zgkRFQruIlaJ4JakNZLoKJ70fH.jpg",
               "id": 586,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Frank Kelbo",
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4eb",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Max Shady",
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4ef",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Judge Skanky",
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4f3",
               "name": "Tony Randall",
               "profile_path": "/9CV7E5onJ6AuYFvHuIdMtEiW6PG.jpg",
               "id": 40206,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Clarence",
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4f7",
               "name": "Clarence Clemons",
               "profile_path": "/bS1ymumIAPFNTOYTXEwUcy8gqmY.jpg",
               "id": 118602,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Murder Investigator",
               "gender": 2,
               "credit_id": "53b94bd10e0a2676d30094ff",
               "name": "Keith Campbell",
               "profile_path": "/1PQSshXQ2AgifwYbykqXEyQYmDg.jpg",
               "id": 15318,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Laura's Husband",
               "gender": 2,
               "credit_id": "58b33a1092514177d100b5bc",
               "name": "Michael Cumpsty",
               "profile_path": "/gwldSJBtljCxKVc0tTBPm60uCYS.jpg",
               "id": 171652,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5abcd8aac3a36843a6027726",
               "name": "Bob Uecker",
               "profile_path": "/zq4Q0u8aqkbElrHBIWbgi7LotFE.jpg",
               "id": 147486,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Trial Judge",
               "gender": 1,
               "credit_id": "5abcd8be0e0a2609de0261d5",
               "name": "Eartha Kitt",
               "profile_path": "/orRADHGrQwUD2H9eUcFA8wDbYNH.jpg",
               "id": 70243,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Man in Park",
               "gender": 2,
               "credit_id": "5abcd8d3c3a3684379026a5c",
               "name": "Bill Cobbs",
               "profile_path": "/cP2ETKFdk93z4e1oXZVG0utI3IM.jpg",
               "id": 8854,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Bailiff",
               "gender": 2,
               "credit_id": "5abcd8f80e0a2609db0271e6",
               "name": "Kevin Michael Richardson",
               "profile_path": "/9dMOW2CFRrlDkNzeXVGMJfASupM.jpg",
               "id": 24362,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4bd",
               "name": "Carl Reiner",
               "profile_path": "/AtDqJQkl7dH2m19kPio3cosfbes.jpg",
               "id": 1895,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44efc3a368484e03f4c3",
               "name": "Katie Jacobs",
               "profile_path": "/kdn9llKconxaMhZYFDExnZlW2fR.jpg",
               "id": 41424,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4c9",
               "name": "Pierce Gardner",
               "profile_path": null,
               "id": 52012,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4cf",
               "name": "Pierce Gardner",
               "profile_path": null,
               "id": 52012,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4d5",
               "name": "Pieter Jan Brugge",
               "profile_path": "/wSaIhLLvLSxxgOPugUx7M8ZBpD8.jpg",
               "id": 639,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4db",
               "name": "Richard Gibbs",
               "profile_path": "/5jTk1fUsMzslWB86XdWB8JoYdMl.jpg",
               "id": 21068,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44efc3a368484e03f4e1",
               "name": "Bud Molin",
               "profile_path": null,
               "id": 30725,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44efc3a368484e03f4e7",
               "name": "Stephen R. Myers",
               "profile_path": null,
               "id": 25746,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.040193,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26141,
      "vote_count": 49,
      "budget": 0,
      "overview": "A spoof of the late 80s and early 90s suspense thrillers and murder mysteries, including Basic Instinct, Sleeping With The Enemy, Cape Fear and others. A cop/attorney (yes he's both) is seduced by a woman while his wife is having an affair with a mechanic. Lots of other sublots and visual gags in the style of Naked Gun.",
      "similar": [
         40264,
         4258,
         11072,
         8005,
         3049,
         109414,
         9255,
         856,
         64688,
         19908,
         808,
         813,
         4247,
         4638,
         829,
         281,
         539,
         4232,
         9593,
         3034
      ],
      "original_title": "Fatal Instinct",
      "runtime": 91,
      "poster_path": "/1C6CpzLarG9pYS6pWt5w45vAJT4.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1993-10-29",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Sex, murder and revenge were never this funny.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Carl Reiner"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["David O'Malley"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106873/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyNzc2ODU5Nl5BMl5BanBnXkFtZTYwNzAxNDg5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Armand Assante, Sherilyn Fenn, Kate Nelligan | See full cast and crew »"],
      "reviews": [
         "I'd see this movie on the shelf at the video store alot and I'd always pass it up thinking it's just a stupid cheap comedy. Boy was I wrong, I didn't think I'd like it because I thought Armand Assanti was a real serious actor and he wouldn't be funny but 5 minutes in to it when he put that hot dog in his jacket pocket I didn't stop laughing. Since then I've seen this movie so many time and I laugh just as hard as the first time. If you want a real good laugh get this one.",
         "A wild spoof of suspense and film noirs, I appreciated this silly film a little more than most being a fan of \"noirs.\" As with any comedy, the movie is a combination of genuinely laugh-out-loud gags and sight scenes and genuinely stupid lines. It depends on what makes you laugh. One thing it has for sure: lots of sexual innuendos and just plain overt sexuality. It's yet another one of these PG-13 ratings that is a joke. This is not for kids. Also, this film won't be much for those without a knowledge of classic crime films of the past, from the '40s to the '80s. Many parts of this movie parrot scenes from Fatal Attraction, Body Double, etc. It takes several viewings to catch most of the inside jokes. Armand Assante is the smooth private detective and Sherilyn Fenn is his attractive and loyal secretary. Kate Nelligan, Sean Young and Christopher McDonald add to the fun. To be frank, I enjoyed this more on the first viewing than I did on the second. After watching it twice, I thought the film would have been better had it been cut 10-15 minutes, and it's only 90 minutes. However, I am not knocking it: it's a fun movie.",
         "Very funny film noir spoof, that's undeservedly criticised. It may lack the \"quality\" feel of e.g. The Naked Gun, but I think it's almost as funny. The film looks great, and the jokes aren't as much of a hit-and-miss affair as you could fear. Naturally it's almost essential that you've seen most of the films it takes a crack at (Double Indemnity, Body Heat, Basic Instinct, Fatal Attraction, Sleeping with the Enemy just to mention a few). But what really elevates Fatal Instinct above similar efforts is the brilliant performance from Armand Assante, who displays a comic timing that I never would have guessed he had. He plays his completely oblivious-to-everything-that's-happening-around-him detective with such dead pan seriousness, that it's impossible not to laugh (the scenes with his skunk little Neddy are hilarious). Never mind the critics, find this film and see it. [8/10]",
         "Carl Reiner, a man that knows about comedy, is the man behind this spoof on the noir genre. Mr. Reiner, working here with David O'Malley's screen play, has created a film that parodies movies like \"Double Indemnity\", \"Basic Instinct\", and \"Fatal Attraction\", among others, with great style. The result is a film with some clever lines spoken by the cast as though they are acting in the prototype movies that Mr. Reiner is spoofing, with great panache. Not everything works, but when it does, the fun never seems to stop making us laugh. The cast Mr. Reiner assembled is up to the task. Armand Assante is excellent as Ned Ravine, a man who is a policeman and lawyer and who does some excellent dancing in those red stiletto shoes his character seems to love. Sherilyn Fenn is the loyal secretary Laura. Kate Nelligan does an excellent imitation of Barbara Stanwyck as the scheming wife, Lana. Sean Young has some good moments in the film. \"Fatal Instinct\" is a film to watch with a lot of friends. Mr. Reiner shows why he has been one of the best comic writers in America.",
         "I stumbled upon this film late one night on TV a few years ago and laughed so hard that I could barely breathe. Armand Assante plays Ned Ravine, a totally clueless cop/lawyer. He is so clueless that he doesn't see that his wife (Kate Nelligan)is having an affair with a mechanic(Christopher MacDonald), or that his secretary (Sherilyn Fenn) is deeply in love with him (She also has an abusive ex-husband that's looking for her). Into the picture comes Lola Cain(Sean Young), a woman with shoe problems (everything sticks to the bottom of it). She also wants Ned. This film spoof \"Fatal Attraction,\" \"Basic Instinct,\" and every film noir movie ever made. Funny Carl Reiner film.",
         "Armand Assante plays a great \"distracted\" Ned Ravine and brings comic timing that Johnny Carson would admire. Kate Nelligan plays Lana Ravine (Ned's Wife)and does a great Barbara Stanywick imitation through-out the film.These two combine with Sean Young,Sheilyn Fenn ,and Christopher McDonald to make a hilarious film parody of the noir/crime movies that were serious and exaggerated that we all tried not to laugh at.When you're having a bad day turn this flick on and good tings will happen.A gotta see film.No matter what you have heard go catch \"Fatal Instinct\" If you like Spy Hard,Naked Gun ,Airplane,etc.You'll like this film.",
         "This film has been repeated like 4 times on cable TV here in Sweden in the past year! I watched it the first showing (last year) and it is SO my type of movie. I read what it was about and thought I had to see it since I had seen some of the movies it made fun of. All I can say is that most, or all the jokes are so hilarious. They are very \"kind\" or shall I say \"simple\" ones, but this is the kind of movie you watch when you don't want anything deep, but just a funny movie which is \"easy watching\". Not only is it funny, it also has the beautiful Sherilyn Fenn which is very nice of course :) I highly recommend you see it, because even though I didn't \"laugh my *** off\", it was such an amusing movie to watch! Jens",
         "I am afraid I am a sap for the whole spoof genre, and this appears as funny as any to me. Armand Assante as the hero who is both a cop and a lawyer (\" I am going to have to arrest you. Have you got a lawyer?\") plays his role with a deadpan stupidity that is wonderful, and the jokes and the bits and pieces of business come thick and fast.",
         "Strange, but when I think about this one, the expression \"oldie but goodie\" comes to mind. After sitting through countless comedies and parodies with gross and often times just plain bad jokes (try scary movie) one might wonder if it is actually possible to have a really brilliant spoof without insulting humor. Well, it is. And just to see how good a well-made parody can be, try this one. Of course, it would help having been a late 80s early 90s movie fan, but that is not a prerequisite. And, without going into too many details, this one effectively proves that a parody/comedy can actually be original.",
         "When a producer selects the actors and actresses for a film, it's usually in his mind what he is looking for. The selection Mr. Carl Reiner made in this film \"Fatal Instinct\" is nothing short of incredible. Taking a cue from the film parried here ( Fatal Attraction) from the moment it begins, you will begin laughing, so one had better have a good grip on his chair. Whoever selected straight actors or at least actors with a serious streak to do comedy knew they were trolling for gold. What they achieved is memorable in various films, like airplane and Horror Movie. In this hilarious offering, Reiner combines the works of the 1950's black/white films with modern murder venues. Armand Assante is incredible as Ned Ravine, super sleuth and lawyer. Sherilyn Fenn as Laura Lincolnberry, Kate Nelligan is Lana Ravine and Sean Young playing Lola Cain. All take the hero for a mind-bending spin and spoofs and succeed. However, the best selection for real comedy out of his element is none other than James Remar (The Warriors) , who plays, Max Shady. The outcome is fantastic. You've got to see this film for all it's humor. ***"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "A spoof of the late 80s and early 90s suspense thrillers and murder mysteries, including Basic Instinct, Sleeping With The Enemy, Cape Fear and others. A cop/attorney (yes he's both) is seduced by a woman while his wife is having an affair with a mechanic. Lots of other sublots and visual gags in the style of Naked Gun. Check the rating !",
         "Fatal Instinct is about a man named Ned Ravine who is both a police officer and a lawyer. He thinks he understands everything about every kind of woman to the point of throwing his badge aside if he is proved wrong. One day, during a stakeout, Ned meets a sultry and seductive young woman named Lola. She decides to show up at his office, asking him to look over some papers she found. At the same time, a mysterious and shifty man named Max Shady is released from prison and plans to kill Ned for not defending him in court. Surprisingly, Ned's wife is having an affair and plots to kill her husband so that she can collect his accident insurance, which is worth nine million dollars. Ned comes to Lola's house and examines the papers she gave him, only noticing that these papers are an expired lottery ticket and an old laundry receipt. After this happens, the two end up having sex with each other. The next day, Ned feels guilty for having sex with Lola, so he then tells her that he has a wife that he loves dearly, and that he can no longer have sex with each other again. A few days later, Lana and Frank take the same train Ned is in, plotting to kill him. Instead, Lana shoots and kills Max with a revolver, mistaking Max for Ned. Ned finds Lana and thinks that she had saved his life, so in order to help clear her charges, he arrest Lana and defends her in court. Ned then finds out that Lola and Lana were twin sisters, until Lola's face was smashed by Lola's shovel. Lola then had to get plastic surgery, which gave her a completely new face. Lana's main reason for ruining Lola's face was to take her life away from her by taking Lola's husband away from her, which ruined her marriage."
      ],
      "budget": 0
   },
   "movielensId": 445,
   "movielens": {
      "languages": [
         "English",
         ""
      ],
      "releaseDate": "1993-10-29",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Carl Reiner"],
      "runtime": 91,
      "movieId": 445,
      "title": "Fatal Instinct",
      "mpaa": "PG-13",
      "actors": [
         "Armand Assante",
         "Sherilyn Fenn",
         "Kate Nelligan",
         "Sean Young",
         "Christopher McDonald",
         "James Remar",
         "Tony Randall",
         "Clarence Clemons",
         "Keith Campbell",
         "Michael Cumpsty"
      ],
      "imdbMovieId": "0106873",
      "originalTitle": "Fatal Instinct",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["gLYus-Z2I9s"],
      "plotSummary": "A spoof of the late 80s and early 90s suspense thrillers and murder mysteries, including Basic Instinct, Sleeping With The Enemy, Cape Fear and others. A cop/attorney (yes he's both) is seduced by a woman while his wife is having an affair with a mechanic. Lots of other sublots and visual gags in the style of Naked Gun.",
      "tmdbMovieId": 26141,
      "avgRating": 2.8845,
      "releaseYear": "1993",
      "numRatings": 1987,
      "posterPath": "/1C6CpzLarG9pYS6pWt5w45vAJT4.jpg"
   }
}