{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0273300",
      "video": false,
      "title": "Jump Tomorrow",
      "recommendations": [
         26195,
         106222,
         465,
         51145,
         31875,
         20861,
         117233,
         2287,
         13076,
         48862,
         51230,
         16771,
         32513,
         52654,
         20471,
         45174,
         46280,
         43886,
         102631
      ],
      "backdrop_path": "/zEoZDTZEcqEpa16kZSoHPIxpELy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George",
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03dbaf",
               "name": "Tunde Adebimpe",
               "profile_path": "/6Jz4YznTAaPBAxl1Z8rmmbkMUUd.jpg",
               "id": 94476,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Alicia",
               "gender": 1,
               "credit_id": "52fe44e8c3a368484e03dbbf",
               "name": "Natalia Verbeke",
               "profile_path": "/hb31IMVnDfRVZS1yGD3X4t1zu6a.jpg",
               "id": 27461,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Claudette Chadoutard",
               "gender": 0,
               "credit_id": "52fe44e8c3a368484e03dbc3",
               "name": "Murielle Arden",
               "profile_path": null,
               "id": 148443,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Nathan",
               "gender": 2,
               "credit_id": "570283cec3a368569000321e",
               "name": "James Wilby",
               "profile_path": "/vGwguIlASm4qs4xEymLJwFtLArt.jpg",
               "id": 42627,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Heather Leather",
               "gender": 1,
               "credit_id": "52fe44e8c3a368484e03dbcb",
               "name": "Kaili Vernoff",
               "profile_path": "/8BzSjzya0468jpKVlC0fU2ELcEZ.jpg",
               "id": 28003,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Gérard",
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03dbcf",
               "name": "Hippolyte Girardot",
               "profile_path": "/xCek1WRJqjXoQCKxPLdZs0kjjY3.jpg",
               "id": 23388,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03dbb5",
               "name": "Joel Hopkins",
               "profile_path": "/e7oGcQJCHy8fURizZLWjFZYUlfh.jpg",
               "id": 81256,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e8c3a368484e03dbbb",
               "name": "Joel Hopkins",
               "profile_path": "/e7oGcQJCHy8fURizZLWjFZYUlfh.jpg",
               "id": 81256,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.452385,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 25985,
      "vote_count": 9,
      "budget": 0,
      "overview": "When shy, straitlaced George (Tunde Adebimpe) meets vivacious, adorable Alicia (Natalia Verbeke), he's instantly smitten -- which puts his imminent arranged marriage in jeopardy. He vows to do the right thing, but then he falls in with Gerard (Hippolyte Girardot), a lovesick, voluble Frenchman who overcomes George's sense of propriety and takes him on a meandering road trip to amour.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         101,
         205,
         141,
         339692,
         281957
      ],
      "original_title": "Jump Tomorrow",
      "runtime": 97,
      "poster_path": "/8k7gR1scAI2onir2ygkizIgv1Gi.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Eureka Pictures",
            "id": 1002,
            "origin_country": ""
         },
         {
            "logo_path": "/5uoaxZCSYuc6KEiJgEYSWzLIFAW.png",
            "name": "Film4 Productions",
            "id": 6705,
            "origin_country": "GB"
         }
      ],
      "release_date": "2001-11-09",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joel Hopkins"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Joel Hopkins",
         "Joel Hopkins"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0273300/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyNzk1MDEwMF5BMl5BanBnXkFtZTcwMDg5OTYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tunde Adebimpe, Hippolyte Girardot, Raul A. Reyes | See full cast and crew »"],
      "reviews": [
         "My first viewing of \"Jump Tomorrow\" was a rare instance when I knew I was going to love a film as soon as I saw the first shot, which depicts nothing more unusual than a bespectacled man being fitted into a suit. From the man's stiff posture and timid face it is obvious that he's very shy and passive. I immediately realized that I was seeing a good actor who was able to suggest an entire personality while hardly doing anything, indeed barely moving at all. The name of the actor is Tunde Adebimpe, and I am astonished that he is not more famous. Apparently, this is one of the only films he's ever acted in, other than the short college film it's based on, in which he played the same character. Primarily, he's an animator rather than an actor. But the performance he gives in this film is nothing short of remarkable. And it is in the course of an extremely creative and quirky little movie that brings surprising life to an old formula. The plot is simple: George, an American from a Nigerian immigrant family, is about to marry a childhood friend, and on the way to the wedding he falls for a Spanish woman, Alicia. If that premise sounds hopelessly familiar, the movie finds just about every possible way to make it seem fresh and original. While the beginning and end stick pretty closely to the conventions of the genre, the events in between manage to take some very interesting turns. The film is like one of those magical rooms that's much larger on the inside than on the outside. When you hear the premise you might be led to assume, as I first did, that this is merely another ethnic comedy about someone who's expected to marry within the culture but ends up falling for someone of another ethnicity and at first the family objects, but eventually everyone comes around and learns a valuable lesson about cultural tolerance. While some of those films are enjoyable in their way, this patronizing approach is all too common in the movies, where the formula is always about whether some \"exotic\" culture is willing to adapt to Western norms that are inevitably deemed superior. Thankfully, \"Jump Tomorrow\" is not in that tradition at all. In fact, it deals surprisingly little with ethnicity, even though all the major characters are either non-white or non-American. By the middle of the film, you're likely to forget that it's even about an interracial relationship, because that point is never dwelt upon. George's family naturally expects him to marry the woman he grew up with, and the reason he's going along with their plans has nothing to do with some antiquated family betrothal custom: it is simply because he's such a passive and accepting individual. Adebimpe plays the character to such perfection that some of the movie's laughs come simply from the nuances of his voice and gestures. His lines reflect an understanding of these subtle traits, as when he casually observes that \"My face doesn't make sense without glasses.\" Comedy usually depends on frustrating a character's expectations, and \"Jump Tomorrow\" is no exception. I just don't believe I've ever seen in any other comedy a character quite like George, who wants nothing more than to blend in and be invisible, to avoid making waves. But he's inevitably humiliated in a hilarious sequence involving a woman named Heather Leather (the name still cracks me up), in an ill-advised scheme by his friend Gerard to make Alicia jealous. The event takes place at a hotel with a love motif and a variety of strange furniture, including a bathtub in the form of giant champagne glass. Without ever quite descending into surrealism, these scenes play like a tribute to several comic filmmakers from Blake Edwards to Woody Allen. But George has a very basic dignity that grows on you as the film progresses. Gerard has his own problems, and indeed the movie's title refers to George's words when talking his friend out of suicide. Gerard calls it \"the best talk-down speech I've ever heard,\" and I'd have to agree. As in most romantic comedies, the rival love interest is a douche bag. But in \"Jump Tomorrow,\" even this character is given so many quirky and eccentric traits that he seems an original creation. He's a British professor who practices taekwondo in the rain, gives Alicia an engagement ring made of bone, and refers to her family as \"fascinating.\" We are tempted to wonder what she, a hopeless romantic, sees in him. That is a question we've all asked many times, both about movies and about real life. At one point, Gerard gets into an argument with the professor over whether the French language is obsolete. This is one of many amusing scenes that deal with the theme of language differences. In an attempt to impress Alicia, George tries to learn Spanish by listening to travel audio-cassettes picked up at a local convenience store and by watching Spanish soap operas. Of course, he never gains more than a beginner's proficiency in the language, but in his fantasies he can speak the language fluently. The movie spoofs Spanish soaps in a handful of scenes in which he imagines himself as a character in one of these shows. Then there is Alicia's deaf-mute grandfather who takes an immediate liking to George, giving a wonderful performance without words and helping to highlight the movie's theme that commonality transcends language. \"Jump Tomorrow\" is a small masterpiece that I have made it my mission to make known to other movie lovers.",
         "George is a young Nigerian American who is due to get married to Sophie, who is coming from Nigeria. George is one day late to pick her up from the airport and she has gone ahead to Niagara Falls for their wedding. George bumps into Gerard, who is on the point of suicide from unreturned love, and the pair travel up to Niagara Falls. On the way George meets Alicia, herself in a relationship and he begins to fall for her. Extended from a short I haven't yet seen (Jorge) this film attracted me as it was part of a season of `indie' films and shorts being shown on channel 4. From the opening scenes it was apparent that this film had a nicely comic tone to it that was amusing. The plot is also `nice', a romance without ever getting too heavy or too sickly sweet. The comic feel running through the film keeps it amusing even when nothing much happens. The film's weakness is that it is clearly made by a director of shorts. The feel of the film is like that of many short films \u0096 development is not the key and it assumes we sort of know the characters well enough after only a few minutes. Similarly the film feels very episodic \u0096 the scenes don't flow into each other but feel more like they are very distinct and separate events. However that said the film is still entertaining but it didn't give me more as the film went on \u0096 rather just more of the same. I enjoyed the film but it's hard to praise it simply because it doesn't excel itself in any one area but drifts along amiably enough. Part of the reason I enjoyed the film was a great lead by Adebimpe, who fits the role like a glove! He is suitably uptight and is very good as George. Verbeke's Alicia is not as good but is `nice'. Girardot is great fun and really gives the film some energy. Overall I enjoyed this film and many others will as long as you're in the mood for something slight. If you expect something more substantial then you may be disappointed as this really is a film with all the qualities of a short \u0096 in some cases this is good and in others it is a weakness. Generally the film was `nice', I neither loved nor hated it but did enjoy it \u0096 I just can't find a better way of putting it as I did think it was remarkably middle of the road in many regards.",
         "This is what a genuine love story should be all about. I was amazed I had never heard of this film and how truly good it is. The writing, directing and acting are truly superb. All the characters are likable, except the obvious ones, and one seems to form a bond with them. Whether it be true friendship, love, emotions, feelings... well, this film has it all. There is great chemistry between Adebimpe and Verbeke. Girardot serves as a dysfunctional guardian angel to Adebimpe and as comic relief in scenes where there is supposed to be some tension. Although, this film is completely hilarious. Love may not be a science, but it is honestly such a complex subject to understand. Just go with the flow and watch this excellent film.",
         "Jump Tomorrow is one of those smart and funny films you just can't help but like. A first time effort from writer/director Joel Hopkins , Jump Tomorrow is a fresh breath of air and an absolute relief from the bevy of re-hashed romantic comedies which find their way into theaters. At the center of Jump Tomorrow is George (portrayed by first time star Tunde Adebimpe), a very serious, composed, and all too contained Nigerian. At times George reminds me of Woody Allen or M. Hulot as he awkwardly stumbles through his life on a journey to the inevitable. But it's the journey that has an impact on George and watching that change is both humorous and entertaining. Joel Hopkins has a lot of the same qualities as director Wes Anderson (who directed the fantabulous Rushmore) - he has a sense of framing, music and pacing that is funny, but not at the expense of the characters. Over the course of the movie you really get to know and like these characters, feel for their struggle and can revel in their personal triumphs. It's rare that you get that from a Romantic Comedy, and for that I'd definitely recommend Jump Tomorrow. Think of it as the perfect 'indie' date movie!",
         "A few years before JUMP TOMORROW was filmed, the same leading man (Tunde Adebimpe) starred in a shorter version of this script entitled \"Jorge\". I have not seen the original film, so I cannot base my review on it but I was so taken by JUMP TOMORROW that I'm going to try to find a copy of this 30 minute short. Adebimpe very ably plays a Nigerian-American (George) who is a very odd man, indeed and I loved his low-key performance. In many ways he's a total geek and it's nice to finally see a Black nerd in a film who is NOT \"Steve Urkel\"! During most of the film, George is very quiet and shy--part of which is due to his introverted personality and part is due to his lack of enthusiasm for a pending arranged marriage. This film is about his trek from home to Niagra Falls to be wed. Along the way, he meets up with a very strange man (Gerard) who is suicidal and desperately in need of a friend. While George is in a hurry to get to his wedding, he is too decent a man to leave Gerard in his emotional condition. So, they travel together cross country to the wedding and they both become very unlikely friends. There's MUCH more to this movie that this--including a tough to believe but nice romance that occurs between George and a new lady--again, someone who seems so unlike George in almost every way. While this aspect of the film is a tad predictable, the performances and dialog are so fresh and unusual that the film held my interest throughout. As a result, I strongly recommend you see this romantic-comedy if you are looking for something different from the usual Hollywood offerings.",
         "\"Jump Tomorrow\" is a delightful, surprising sweet road trip of a movie. Very similar in tone to one of my little favorites, \"The Daytrippers,\" it brings together a quirky group of people in a concentrated period of time for a romantic quest. The fresh-faced (though mostly experienced), multi-cultural cast is absolutely disarming, and their cultural variety is integrated into the script very nicely. Very amusing is the cute but restrained use of fantasy; the continuing technique of inner thoughts revealed as dreams in a Spanish telenovella is very original. The song selection is selectively classic rock. I could very well adopt the theme in my personal life: hey, you can always jump tomorrow! (originally written 7/27/2001)",
         "I was charmed by the short, Jorge, taped it and saw it many times. I was teaching film, and used it in class to exemplify a well-made, comic and moving short film. Clicking around on digital TV, I was happy to find myself watching the same delightful, bewildered man on his further adventures. I liked Jump Tomorrow enormously, found it touching and laugh-out-loud funny. Tunde Adepimbe has charisma even when he's struck dumb. All the characters are warm and natural, and the script allows for an impromptu feel, even when it's heading toward a well-structured conclusion. A graceful good-hearted road movie. Thank heaven for independent films. I look forward to Joel Hopkins' future work with great anticipation!",
         "I mean the story was simple, production was fine although the budget obviously wasn't in the 10s of millions of dollars and I never quite understood why George and Alicia liked each other so much. But despite all of that I sat in the theater very happy that I took a chance on this one. I think the spartan production made the whole thing seem more real, and since it seemed more real I wanted them to be happy... The characters were all very likeable too, like Gerard and Alicia's aunt. Finally, bonus points for not using subtitles (hey, I understood most of the Espanol!).",
         "much like watching the fax machine assault in the movie 'office space' there are moments in this movie when you too can agree you have a \"milton in your work\". i can't express how much this movie should be explored. there are times you want to stand up and say \"yeah! you figured it out...this is exactly how i've been feeling!!! \"........then you realize you're sitting in coach on a return flight home from british airways.",
         "This is a little nugget of a film pretty much overlooked by the world. It's a very simple film but does a rare thing these days - appeal to the heart with its honesty and sincerity. It's very well written, amusing, entertaining and in the end you really care about the characters. Warm and life affirming."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Comedy"
      ],
      "productionCompanies": [
         "Eureka Pictures",
         "FilmFour",
         "Jorge Productions"
      ],
      "summaries": [
         "George, a passive and sometimes expressionless Nigerian, arrives at the Buffalo airport to meet the women his family has arranged for him to marry. He's late, she's gone on to Niagara Falls, so he has two days, traveling slowly and reluctantly, to get to the wedding. At the airport, he meets Alicia, a lively Latin, going with her boyfriend to see her family. George is smitten. Partly by happenstance, and partly by the designs of Gerard, a romantic and manic Frenchman George meets at the airport, his path crosses Alicia's a few times. As Gerard puts it, George should seize the chance to see what happens with Alicia - he can always jump tomorrow. Can George take on fate and custom?",
         "A young Nigerian man on the verge of being in an arranged marriage, suddenly questions his situation after an encounter with a stunning Latin woman, who is also about to be married."
      ],
      "budget": 1000000
   },
   "movielensId": 4451,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Español"
      ],
      "releaseDate": "2001-11-09",
      "dvdReleaseDate": "2003-09-16",
      "directors": ["Joel Hopkins"],
      "runtime": 97,
      "movieId": 4451,
      "title": "Jump Tomorrow",
      "mpaa": "PG",
      "actors": [
         "Tunde Adebimpe",
         "Natalia Verbeke",
         "Murielle Arden",
         "James Wilby",
         "Kaili Vernoff",
         "Hippolyte Girardot"
      ],
      "imdbMovieId": "0273300",
      "originalTitle": "Jump Tomorrow",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When shy, straitlaced George (Tunde Adebimpe) meets vivacious, adorable Alicia (Natalia Verbeke), he's instantly smitten -- which puts his imminent arranged marriage in jeopardy. He vows to do the right thing, but then he falls in with Gerard (Hippolyte Girardot), a lovesick, voluble Frenchman who overcomes George's sense of propriety and takes him on a meandering road trip to amour.",
      "tmdbMovieId": 25985,
      "avgRating": 3.46116,
      "releaseYear": "2001",
      "numRatings": 103,
      "posterPath": "/8k7gR1scAI2onir2ygkizIgv1Gi.jpg"
   }
}