{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "alibi",
            "id": 2326
         },
         {
            "name": "discontentedness and displeasedness",
            "id": 3921
         },
         {
            "name": "rage and hate",
            "id": 3927
         },
         {
            "name": "poacher",
            "id": 8723
         },
         {
            "name": "policeman",
            "id": 33699
         },
         {
            "name": "humiliation",
            "id": 33740
         }
      ],
      "imdb_id": "tt0061996",
      "video": false,
      "title": "Mouchette",
      "recommendations": [
         20108,
         690,
         4495,
         41391,
         48764,
         7974,
         42112,
         105552,
         38360,
         4497,
         35124,
         30368,
         499,
         5801,
         94702,
         36265,
         15244,
         50183,
         26782,
         90056
      ],
      "backdrop_path": "/6v0iaMqsPu1qKPIZitpxbodSsJQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mouchette",
               "gender": 0,
               "credit_id": "52fe42fdc3a36847f803244d",
               "name": "Nadine Nortier",
               "profile_path": null,
               "id": 17589,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Arsène",
               "gender": 0,
               "credit_id": "52fe42fdc3a36847f8032451",
               "name": "Jean-Claude Guilbert",
               "profile_path": null,
               "id": 17590,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mutter",
               "gender": 0,
               "credit_id": "52fe42fdc3a36847f8032455",
               "name": "Marie Cardinal",
               "profile_path": null,
               "id": 17591,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Vater",
               "gender": 0,
               "credit_id": "530b67fa9251415e7100231f",
               "name": "Paul Hébert",
               "profile_path": "/uZ0MUzS7D64eRwyb23LBgPqhCyr.jpg",
               "id": 1244470,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mathieu",
               "gender": 0,
               "credit_id": "52fe42fdc3a36847f803245d",
               "name": "Jean Vimenet",
               "profile_path": null,
               "id": 17593,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mathieu’s Frau",
               "gender": 0,
               "credit_id": "52fe42fdc3a36847f8032461",
               "name": "Marie Susini",
               "profile_path": null,
               "id": 17594,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42fdc3a36847f8032467",
               "name": "Robert Bresson",
               "profile_path": "/g3FxA6fdB3YmRZTnHJu3dl4aOET.jpg",
               "id": 10346,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fdc3a36847f803246d",
               "name": "Georges Bernanos",
               "profile_path": null,
               "id": 17595,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f8032473",
               "name": "Robert Bresson",
               "profile_path": "/g3FxA6fdB3YmRZTnHJu3dl4aOET.jpg",
               "id": 10346,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f8032479",
               "name": "Jean Wiener",
               "profile_path": null,
               "id": 36997,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fec3a36847f803247f",
               "name": "Ghislain Cloquet",
               "profile_path": null,
               "id": 11988,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f8032485",
               "name": "Raymond Lamy",
               "profile_path": null,
               "id": 10350,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f803248b",
               "name": "Pierre Guffroy",
               "profile_path": null,
               "id": 9358,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032491",
               "name": "Odette Le Barbenchon",
               "profile_path": null,
               "id": 36998,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 9.149312,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 1561,
      "vote_count": 59,
      "budget": 0,
      "overview": "Robert Bresson plumbs great reservoirs of feelings with one of the most searing portraits of human desperation ever put on film.",
      "similar": [
         284276,
         43923,
         842,
         590,
         343,
         152780,
         309,
         261,
         22640,
         272099,
         399612,
         14054,
         75345,
         273817,
         552,
         156,
         272061,
         14578,
         276615,
         168454
      ],
      "original_title": "Mouchette",
      "runtime": 81,
      "poster_path": "/2jlGE69Wl8kHhvP7EmeoOmVBR1T.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Argos Films",
            "id": 6116,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Parc Film",
            "id": 14680,
            "origin_country": ""
         }
      ],
      "release_date": "1967-03-28",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Bresson"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "Georges Bernanos",
         "Robert Bresson"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0061996/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5NzgwOTMxMV5BMl5BanBnXkFtZTcwMDk2NDE0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Nadine Nortier, Jean-Claude Guilbert, Marie Cardinal | See full cast and crew »"],
      "reviews": [
         "Just like I remembered. The face of Nadine Nortier has not changed. The unbelievable \"Mouchette\" in this unforgettable Robert Bresson masterpiece. I hadn't seen the film since I was a teen ager. I saw it again last night and as if by magic it felt more contemporary today than it did then and then, let me tell you, it felt pretty real in its own rigorous lyrical style. What a shockingly wonderful effect a film like this could have on teen agers today. To stay with a character who takes us with nothing more than her naked truth through a landscape of absolute desolation. Her innocence intact, in spite of the outrage. Her ultimate act as breathtaking as anything we have ever seen on the screen, before or since. I tried to show the film to a group of twentysomethings, all of them walked away within the first fifteen minutes. All except one, a boy of 21, he had escaped Bosnia with his brother a few short years ago. As the film ended I looked at him. He was silent. He spoke without looking at me \"can I see it again?\" That's at the center of the experience that provides this film. \"Mouchette\" is meant for everyone, but it'll touch only some.",
         "Never before has cinema been this simple and honest. No one makes films with more emotion than Bresson and no one puts less emotion in their films than he. I could cite so many Bressonian cliches and talk of his uniquely personal style which by 1967 was firmly established, especially since he had abandoned the voice-over he used in the 50s. I will point out his use of sound and approach to acting which remain so distinctive and by now so familiar. There is nothing in Mouchette that is new, especially after Balthazar, what remains is the story of Mouchette, told with the utter grace and passion that makes this film a masterpiece that transcends technique, even cinema itself, and makes most cinema look frivolous in the process. Finally I must mention the films ending, which I rank with that of Balthazar as the most beautiful I have seen.",
         "In a film as inexorable and irrevocable as this, it is appropriate that Bresson's masterpiece should begin with an elaborate rite. The film actually opens with the heroine stating her anguish calmly to the camera, and the bizarrely Baroqued-up strains of Monteverdi. But the action begins in a green space of remarkable beauty, adjacent to the 'civilisation' of the village. It is an overgrown, profusely sparse space, in which one man sets up a wire trap, watched by another. A pigeon is caught in the trap, and we watch his terrified, bewildered struggle for agonised moments. The second man follows the bird, we assume to finish him off, and sets him free. He looks at the second man, who scarpers. These two men are a poacher and a gamekeeper, but Bresson doesn't tell us until after this sequence. Although their roles may be obvious, there is a ritual solemnity about the action, characters moving and behaving to seemingly pre-ordained rules, in an environment that is supposed to be realistic (no music; natural sounds etc.) but seems unworldly, stripped bare. The sequence is loaded with symbolic detail, with a cruel foretelling of the plot to come that takes on the power of Greek myth, an intriguing starting point for the very Catholic Bresson's film. Although Bresson's austere films are defended by his admirers as being full of suppressed passion, it's hard to fully engage with them. They are fragmentary (e.g. in the way he films parts of the body that seem to deconstruct it, rather than its familiar wholeness; the way the plots are constructed not by conventional flow, but the build up of episodes), and yet his films are full of contradictory connections, patterns, rhythms whether real or imaginary that, perhaps (I'm no theologian) approximate the underlying Catholic impact. The reason MOUCHETTE is his most appealing film is that it is in many ways more conventional than most. It's the story of an adolescent girl living in a grim, parched provencal village, unloved by her parents, mocked by her schoolmates, brutally beaten by her teachers. She clumps around in heavy shoes that make her look disabled, and there is unexpected comedy when, every day after school, she hides behind a hedge and hurls, with unerring accuracy, mud at the popular girls, with their perfumes and motorbike-owning boyfriends. Parallel to this story is that of the gamekeeper and the poacher, both fighting over the same woman. The film initially consists of revelatory vignettes, with little apparent plot point, revealing the spiritual void of provincial France, with its medieval rituals and codes, hatreds, unloving Churches, pinched villagers, heavy parched stones. Mouchette's mother is dying, her father and brother involved in smuggling. One connecting pattern in the film, foreshadowing L'ARGENT, is that of money, a blasphemous matrix that only alienates its practitioners. There are some brief snatches of relief, such as Mouchette playing bumping cars at a fairground, but an incipient reaching for companionship is harshly beaten away by her father. This loveless, sterile, man-made community is seemingly contrasted with the neighbouring countryside. Mouchette gets lost one night in the forest, and the thundering cyclone seems to unleash an almost Romantic expressivity, revealing Mouchette's feelings that are usually curtailed in the social realm (the fact that this may by pathetic sympathy and subjective is shown in two subsequent denials of the cyclone's power). Her seeming freedom is linked to losing a burdenous shoe. But 'civilisation' is never far away, and the medieval fued of honour is pushed to this natural realm. Bresson cuts the outcome of the two men's drunken meeting, and the characters' own ignorance leads to misinterpretation and misinformation that crucially decide Mouchette's fate. The short, elliptical style now gives way to two extended, gendered set-pieces, one with Arsene the poacher and possible murderer, one with her dying mother. This two-fold division presumably has religious or Platonic significance, the rest of us can watch the dreadful plight of a young girl who so wants to belong that she is prepared to abet a killer, get raped and see her mother die in the space of a couple of hours. Predictably, the attempt of this outsider to belong results in her being cast out as a slut, leaving seemingly only one heartbreaking option open to her. Mouchette is a classic movie outsider, but she is not subversive. Her presence is marginalised even in her own film - although she serves to expose the fundamental evil and disruption underlying so-called 'tight' communities. The treatments of rape and the links of the female with death, not fertility, seem troubling - Bresson's attack on a 'patriarchal' society seems to bemoan the arrogant usurping of the real Patriarch. This is how JEAN DE FLORETTE should have been filmed - shorn of heritage accoutrements, provincial France is shown to be an unlovely hell. With all the discussion of Bresson's philosophical power, it shouldn't be forgotten that he has compelling narrative gifts - and even uses the notion of story as the crucial plot motor - Mouchette acts on the erroneous story she's told by Arsene, on the creation of a world through mere words - and her lack of either narrative control or critical power results in her downfall.",
         "It seems entirely appropriate that the film opens with the metaphor of birds being snared as this seems to apply not only to Mouchette's life, but to Bresson's approach to the viewer as well. For what, after all, is the director attempting to do here? Are we really to regard this as an unblinking gaze into the life of an abused, outcast girl? If so, why is Bresson so intent on excluding even the most fleeting moments of joy (or at least humor) that enter even the darkest of lives (I believe a philosopher once said \"alas, joy too must have its day\")? It is pretty telling that the one scene involving happiness for Mouchette is the most monotonous and lifeless in the picture (the bumper cars). Not only are we not allowed to experience her joy, but Bresson is careful to distance us from the real experience of her pain as well. This is done by the use of \"gestures\" (particularly prominent in Bresson's later films) that \"signify\" a character's experience rather than giving us the person's individualized emotional and visceral reactions to events. Thus the assault on Mouchette is shown in a distant, almost pantomimed manner, her relationship with her father is suggested by dropping coins in his hand, a disembodied hand slapping her face, etc. So, are we really to identify with Mouchette, to feel her pain, seeing how her experience of life intersects with our own in only the most symbolic, muted fashion? Is this really \"compassion\" and is this really Bresson's purpose? Or is Mouchette a figure that Bresson uses (and dehumanizes), as literally every character in the movie uses her, to achieve other purposes? In this case the selling of a particular view of the world. One which sees the world as a snare, both in its joy and its pain, that is \"saved\" only by the (symbolic) suffering of the innocent, and transcended/transformed only by death. In other words a viewpoint that that advocates looking beyond (or turning away from)life to find \"transcendent\" truths. A view based on judgement rather than acceptance. And if this is \"the truth\" why must so much of what we experience as truth (such as joy, intimacy, occasional feelings of \"oneness\" with the world) be so forcibly excluded? Are these all really illusions, the world simply a snare? And without acceptance of ALL of Mouchette's reality can she,or any of us, really be redeemed? Yes, Bresson is a meticulous, incisive, and occasionally powerful filmaker. But is he really honest? Are there some TRUTHS that he can't face (and so desperately restricts his view). In MOUCHETTE we are a little more aware of the puppeteer's strings than usual. 7 out of 10.",
         "Stories of childhood have often been tempered with the melancholic yearning of lost innocence (as in Louis Malle's Au Revoir Les Enfants) or the profound weight of human misery (as in Robert Bresson's Mouchette). -An opinion in a filme web - Director Robert Bresson disliked many things like, greed, shallowness, insincerity His filmes and his characters are surrounded by indifference,INJUSTICE and cruelty.and Mouchette the intransigent anti heroine of this remarkable filme knows about that.In one scene Mouchette said something,(to the man he later assaulted her), that really strikes me: `You can trust me ... I detest them' Every great film has its unforgetable moments in this one is Mouchette's night in the woods,and later over the edge and into the water\u0085 Mouchette went through a lot of bad things,the adults in this filme are just awful,one woman tells to her `You are bad.... You have evil in your eyes.' Bresson said: `Mouchette offers evidence of misery and cruelty. She is found everywhere: wars, concentration camps, tortures, assassinations.' \u0096That's it\u0085 the Master has spoken.",
         "Sixteen years after having successfully exploited Georges Bernanos' universe for his \"Journal d'Un Curé De Campagne\" (1951), Robert Bresson appropriates once again another book by the French writer: \"Mouchette\" for a very personal, stylish rendering and a canonical film about stolen childhood. The filmmaker always supported that he'd prefer a film to be felt rather than to be understood. Needless to say we leave the projection with a big emotion inside us and we also feel helpless about Mouchette' terrible life. According to Bresson, Mouchette's tragic fate enabled him to put forward \"misery, cruelty. They're everywhere: wars, tortures, murders\". The film starts with Arsène's and the gamekeeper's eyes staring at quails and partridges that desperately try to free themselves from snares. This harrowing introduction sequence sets the scene for what follows after wards. How not to think of a metaphor for Mouchette's life that offers her no horizon and no hope? This teenage girl is all alone and in spite of her young age, she has to take care of her sick mother, her alcoholic father and her baby brother. She goes to school but feels rejected by her female fellow students, notably when school's over, they stone her. It's the same thing every day and Mouchette is trapped in her loneliness. That's why the sequence at the fair comes as a sort of relief for her. The scene at the bumper cars provides her momentary solace and joy. Then, the key sequence with Arsène will make her open her eyes about what she really wants. In spite of her poverty and solitude, Mouchette needs to love but where to find it in a hostile world? Mouchette strongly belongs to the Bressonian world. She's an outcast and she can't integrate herself to her surrounding. Once again, Bresson underscores the opposition between a pure, subjective person and an objective, hostile world in a sparse, minimal directing with a supremacy granted to images and sounds and the evident symbols they convey. An eloquent example would be when the little girl is all alone in the country and can hear the sound of guns and can see rabbits running or dying. She hasn't got a friend or even one member of her family to talk to. When she wants to tell her mother what Arsène did to her, she dies. Fate dogs her. There's no room for the weak and there's one last exit left... Bresson's austere, intensely visual making fits the story and its themes like a glove and if you don't feel anything during the last sequence, you have a heart of stone.",
         "Sublime film from Robert Bresson! Actually it was my first encounter with Bresson's work, five or six weeks ago. I was so eager to see it...Bresson's films (\"Mouchette\" and \"Au hasard Balthazar\") haven't disappointed me- to see the least! \"Mouchette\" is such a pure film, so sublime. So powerful. When I saw this film, it really blew me away totally. So overwhelming. But now, weeks after that experience (I saw that films more than once, btw) it's still beginning to gain more power and emotion. \"Mouchette\" has such overwhelming, graceful, brilliant images, shots and scenes. The opening scene may be the best ever: brilliant and pure, it tells everything you will see in the next hour and twenty minutes. The use of the music, sublime sounds of Monteverdi, is unique, powerful and brilliant. No more than- what is it?- ten seconds or so it can be heard. The opening scene is so short... That's the power of Bresson: images, sounds, scenes are presented in such a brilliant way. When we are beginning to be attached to them, other images and shots are already presented. As a viewer, you can't really be attached totally by them. That's way these images, shots, scenes will be in your mind long after the film: all things, all scenes and situations, and especially all emotions (if they are shown at all) are shown in actually too short a time, that you, as a viewer, will be forced to \"finish\" them. You are forced to locate the emotions not shown, to locate the situations and details which are only suggestively shown. Bresson's editing is just brilliant, bt it may take some time before you are aware of that. Some of the most brilliant scenes ever are presented here: Mouchette, forced to go into church by her father; Mouchette's brilliantly and superbly simple introduction to the viewer. Most notable for me, besides the ending scene of course, is the scene with Mouchette in the dodgem cars, having her only small feelings of joy and relieve. The expressions and emotions shown in this really magnificent scene, maybe the best and most emotional I've ever witnessed, are to diverse to even describe them. Just watch this scene... Nadine Nortier, playing Mouchette, blew me away with her magnificent acting. So pure, sublime, graceful and heartfelt. One of the most striking peaces of \"acting\" I've ever seen...! This superb film will be in my mind for ever, just like \"Au hasard Balthazar\". Nobody, not even the best like Dreyer, Ozu, Bergman and Tarkovsky, can present stories, images and \"emotions\" in such a superbly simple, transcendental and pure way as Bresson. Masterpiece!",
         "A poor teenage girl, Mouchette, living in rural France, is immediately depicted as a tragic heroine: with a bed-ridden mother and an absent alcoholic father, Mouchette takes care of everything in the household, including her baby brother. She has no friends, and seems to live a purposeless life; even when she does want to escape her reality, and try to remind herself she's a kid, either people or circumstances violently throw her back into the harshness of a scary adult world. One night, her life will make things even worse, and, as the second part of the film flows in, Mouchette encounters a series of people who treat her all in different ways. Only at the very end of the movie, will she take action. Robert Bresson's eighth film contains typical trademarks of the director, like the frequent religious symbolisms found within the technical aspects of the film: they are located in the particularly attentive shots of the camera, but especially, in the clever use of sound : most of the film flows through a series of suffocating scenes that show Mouchette's every-day tasks, which unfold maintaining a painful silence in the background: God's silence. Only at the end of the movie is there music, a simple but effective expedient to highlight the sense of relief the protagonist should feel. Winner of the OCIC Award at the Cannes festival of 1967.",
         "'Mouchette' is a film shot simplistically and delicately, which captures the angst and despair of a 14 year old girl. The opening sequence entails the capture of a bird in a poachers trap; we witness long length shots and intense close-ups of a gamekeeper spying on the poacher. Only natural sounds of footsteps and rustling trees are audible. Instantly, we could argue this unpleasant image of the trapped bird, parallels the entrapment of Mouchette in her abandoned life. Interestingly the poacher in these scenes, Arsene, later traps Mouchette in luring her into a false sense of security, reinforcing his role as a poacher. From the beginning, Bresson's attention to realistic natural diegetic sounds emulates Mouchette's destitute, impoverished lifestyle. This technique also enables the audience to focus primarily on the visuals. Dialogue is dispersed through the film and appears in only brief quantities. The raw stark shots of Mouchette's struggle, for example, tending to her mother, sitting alone in the forest and walking home alone after school contrast with the brief moment at the funfair in which she evades the reality of her life. I could not help but differentiate these busy, active shots, accompanied by an upbeat diegetic soundtrack and close-ups of Mouchette's happiness from her solidarity before and after this sequence. This moment, the only point where we see her physically and emotionally content, is taken from her suddenly and becomes one of our first reflections on our sympathy for her. Added to this are the recurring medium close-ups of Mouchette's frown, which I found prominent when reflecting on the film. I think many people who have seen 'Mouchette' will note that although the closing sequence is sudden and perhaps bleak, you cannot help feeling a sense of catharsis due to the ending of Mouchette's suffering.",
         "Bresson one of the true architects of modern cinema found in this story the perfect distillation of form and content coupling his pared down style with the poignant story of a young french girl trying to live through impoverished circumstances and doing her best to survive. Being one of my heroes I have always had nothing but total respect for the way he intellectualized every aspect of film-making without denuding it of emotional impact. A chemist of cinematic ingenuity there will never be a more profoundly personal look at cinema than that of Bresson. May the film-makers of today at least make the effort to rob from this man. Viva Bresson!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Argos Films",
         "Parc Film"
      ],
      "summaries": ["Mouchette is a young girl living in the country. Her mother is dying and her father does not take care of her. Mouchette remains silent in the face of the humiliations she undergoes. One night in a wood, she meets Arsene, the village poacher, who thinks he has just killed the local policeman. He tries to use Mouchette to build an alibi."],
      "budget": 0
   },
   "movielensId": 44657,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1967-03-28",
      "dvdReleaseDate": "2007-01-16",
      "directors": ["Robert Bresson"],
      "runtime": 81,
      "movieId": 44657,
      "title": "Mouchette",
      "mpaa": "NR",
      "actors": [
         "Nadine Nortier",
         "Jean-Claude Guilbert",
         "Marie Cardinal",
         "Paul Hébert",
         "Jean Vimenet",
         "Marie Susini"
      ],
      "imdbMovieId": "0061996",
      "originalTitle": "Mouchette",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Robert Bresson plumbs great reservoirs of feelings with one of the most searing portraits of human desperation ever put on film.",
      "tmdbMovieId": 1561,
      "avgRating": 3.64596,
      "releaseYear": "1967",
      "numRatings": 161,
      "posterPath": "/2jlGE69Wl8kHhvP7EmeoOmVBR1T.jpg"
   }
}