{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt0423176",
      "video": false,
      "title": "The World",
      "recommendations": [
         47046,
         80243,
         54659,
         33341,
         52103,
         12130,
         45935,
         86266,
         91067,
         20531,
         121036,
         125829,
         222463,
         86282,
         176651,
         45861,
         29972,
         61485,
         47102,
         90041
      ],
      "backdrop_path": "/97Uet8Epg1G2Ybn1B4vAyPf9C0V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Tao",
               "gender": 1,
               "credit_id": "52fe45c1c3a36847f80d8a4d",
               "name": "Zhao Tao",
               "profile_path": "/zcnM5OPkJAcGwnWhWvtkxjlh30R.jpg",
               "id": 24044,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Taisheng",
               "gender": 2,
               "credit_id": "52fe45c1c3a36847f80d8a51",
               "name": "Cheng Taishen",
               "profile_path": "/kjUNn0WGxHVVjmRwjns1WLdDZmZ.jpg",
               "id": 72483,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Wei",
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a55",
               "name": "Jue Jing",
               "profile_path": null,
               "id": 126082,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Niu",
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a59",
               "name": "Jiang Zhong-Wei",
               "profile_path": null,
               "id": 126083,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Qun",
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a5d",
               "name": "Yi-qun Wang",
               "profile_path": null,
               "id": 126085,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sanlai",
               "gender": 2,
               "credit_id": "52fe45c1c3a36847f80d8a61",
               "name": "Wang Hongwei",
               "profile_path": "/9msX6TMlOqc9RWbbtXCSGncHkRQ.jpg",
               "id": 27997,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Tao's ex-boyfriend",
               "gender": 2,
               "credit_id": "52fe45c1c3a36847f80d8a65",
               "name": "Liang Jingdong",
               "profile_path": "/d3KpBTePZwZxgYJ4y91FMo36IU2.jpg",
               "id": 27999,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Erxiao",
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a69",
               "name": "Shuai Ji",
               "profile_path": null,
               "id": 126088,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Youyou",
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a6d",
               "name": "Wan Xiang",
               "profile_path": null,
               "id": 126089,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Anna",
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a71",
               "name": "Alla Shcherbakova",
               "profile_path": null,
               "id": 126090,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sanming",
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a75",
               "name": "Han Sanming",
               "profile_path": null,
               "id": 24043,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "53018a9c92514121981c3956",
               "name": "Wang Xiaoshuai",
               "profile_path": "/bHeg0Pf4NZvSCr26CLkV8yxmKED.jpg",
               "id": 1016305,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a43",
               "name": "Jia Zhangke",
               "profile_path": "/3ktsTI4PzD7MJcdHGp3Mts43n1i.jpg",
               "id": 24011,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c1c3a36847f80d8a49",
               "name": "Jia Zhangke",
               "profile_path": "/3ktsTI4PzD7MJcdHGp3Mts43n1i.jpg",
               "id": 24011,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58994ecf92514160b3000b51",
               "name": "Wang Yu",
               "profile_path": null,
               "id": 1752519,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58937004c3a3684a28000622",
               "name": "Nelson Yu Lik-wai",
               "profile_path": "/7g8aiO4jxaxjCDFKPqrsTbPax9g.jpg",
               "id": 25471,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58994d2ec3a3680429000ad5",
               "name": "Lim Giong",
               "profile_path": null,
               "id": 25472,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58994d3fc3a368042c000a5d",
               "name": "Jing Lei Kong",
               "profile_path": null,
               "id": 27998,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58994d5492514160aa000b34",
               "name": "Zhang Yang",
               "profile_path": null,
               "id": 1181008,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "58994d8692514160b6000ae4",
               "name": "Chow Keung",
               "profile_path": null,
               "id": 105394,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58994d99c3a368041d000a86",
               "name": "Shozo Ichiyama",
               "profile_path": null,
               "id": 73141,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58994da9c3a3680421000c34",
               "name": "Masayuki Mori",
               "profile_path": null,
               "id": 544325,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58994db992514160b6000b04",
               "name": "Hengameh Panahi",
               "profile_path": null,
               "id": 55486,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58994dc8c3a368043a000ab0",
               "name": "Nelson Yu Lik-wai",
               "profile_path": "/7g8aiO4jxaxjCDFKPqrsTbPax9g.jpg",
               "id": 25471,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "58994de4c3a3680425000af7",
               "name": "Zhong-lun Ren",
               "profile_path": null,
               "id": 105396,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58994e0592514160b6000b2b",
               "name": "Tianyan Wang",
               "profile_path": null,
               "id": 25476,
               "department": "Production",
               "job": "Supervising Producer"
            },
            {
               "gender": 0,
               "credit_id": "58994e15c3a3680425000b19",
               "name": "Takio Yoshida",
               "profile_path": null,
               "id": 13246,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.936087,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 41292,
      "vote_count": 19,
      "budget": 0,
      "overview": "“The World” is a theme park on the outskirts of Beijing, sixteen kilometers from the Chinese capital, designed around scaled representations of the world’s famous landmarks such as the Eiffel Tower or the Leaning Tower of Pisa.The site is seen here not from the visitors’ point of view but through the eyes of a few of its staff, lonely people, communicating poorly, a bit disillusioned with life, glittering for the tourists but dull and restricted as far as they are concerned.",
      "similar": [],
      "original_title": "世界",
      "runtime": 143,
      "poster_path": "/cP5uD3tTKJcrSLEgBaSE38XRBP6.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Xinghui Production",
            "id": 94951,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Office Kitano",
            "id": 567,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lumen Films",
            "id": 6216,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Xstream Pictures",
            "id": 1079,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shanghai Film Group",
            "id": 3407,
            "origin_country": ""
         }
      ],
      "release_date": "2005-03-18",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Zhangke Jia"],
      "runtime": 143,
      "synopsis": null,
      "writers": ["Zhangke Jia"],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0423176/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzNTk1Mzc0Ml5BMl5BanBnXkFtZTcwMDIzODEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tao Zhao, Taisheng Chen, Jue Jing | See full cast and crew »"],
      "reviews": [
         "\"The World\" is set in the tacky eponymous Beijing theme park and details the lives of the alienated young workers who are spiritually and physically trapped there. It's a subtle, delicate, yet powerful film with a directing style that can best described as artfully unobtrusive. The young director/writer is a master of composition, camera movement and sound. Some of the scenes unspool without editing for several minutes, the camera mostly still, sometimes moving with the action but never on the whim of the filmmaker. Sound and dialogue occur off-screen in a way that reminds one of the great Japanese director Ozu. (Indeed, one of the film's inter-titled chapters is called \"Tokyo Story\". One of the best examples of this style is a grimy hotel room scene between the lead couple in which very little happens--an attempted seduction, but no sex--that is so authentic it feels almost voyeuristic to watch. In another scene, a father counts and pockets four stacks of money bestowed to him by the authorities for the accidental death of his son, his face an expressionless mask that hides more pain than could ever be shown. In an opening scene the camera tracks a female dancer running through a theatre backstage, pleading for a band aid she will never get--thus slyly presaging the untreatable tragedies that will eventually unfold. The central characters are so alone, alienated and unable to communicate in any meaningful way--much of the dialogue is spoken into the ubiquitous cellphones--that the closest any two people come together are two woman--one Chinese, the other Russian--who don't speak a word of each other's language. This is the best kind of social commentary a film can offer, images that show and don't tell. At times it feels plodding--especially the last half hour--some of the characters could use more development, and the animated cellphone sequences seem unnecessary and distracting. But the depiction of contemporary urban China's deepening social malaise--the result of far too rapid urbanization and unchecked Westernization--is troubling enough to make one fear the country's--and the world's--future.",
         "While this film is radically different from Jia's earlier films it still packs the same cultural criticism wallop. A commentary on the urbanization of modern day China, Jia has moved into the slick world of government approved film-making without losing touch with the direction of his earlier films. It is tempting to watch the film superficially and dismiss it as a glossy state approved image. However, from my perspective, what is happening in the film is much more subtle; it is form of art-making that is particular to China and its authoritarian governing systems through history. Practically speaking China has never enjoyed freedom of expression for its artists and writers. In order to get around censorship that came from absolute monarchies or dictatorships artists and writers would use subtle inter-textual messages. For instance, a line or radical would be left out a character to slightly change the meaning within the text. The head radical might be left out of a character describing the emperor to indicate the writers desire that the emperor be beheaded, or something along those lines. They were small enough messages that sympathizers would pick up on them, but a censor (censors usually not being the brightest or most creative people around) would miss it. It is my opinion that Jia Zhangke is doing something along these lines with this film. It may not be as subtle as the messages have historically been, but a close reading clearly conveys something the government wouldn't be happy with. The Chinese government would like for the world to see them as metropolitan, glitzy, shiny, and new, so Jia, in this first film of his with government backing, uses cinema-scope, modern techno beats, computer animation and up-to-date electronics. But under the glitz is the reality screaming to get through the World Park facade. It is dirty and personal. There is prostitution, crime, and pirate copiers (maybe the theme here is modern Chinese society, as promoted by the government and big business, that is the pirated copy of the rest of the world). The subsistence living youth can all have cell phones, but for all their text messaging they don't seem to be able to communicate. Basically Jia seems to say that the Chinese youth are headed for a future of oblivion under the current direction of their country. It is hard to disagree with him. But at least he he leaves a morsel of hope in the end of it all.",
         "While fifth generation Chinese directors Zhang Yimou succumbed to crowd pleasing, turning out cheap, hollow, showy crap like Flying Dagger, sixth generation Jia Zhangke continues to remain faithful to making movies that reflect the sometimes painful metamorphosis the Chinese populace is going through at the crossroad of modernization. The World is such a recent attempt, although there are comments that this movie has already treaded across the line of commercialism. \"The World\" here is a miniature world theme park which might be a novelty to Beijing but not the modernized parts of the world (there was one en route from Toronto to Niagara Falls over three decades ago, albeit at a smaller scale). The story evolves around dancer Xiao Tao (ZHAO Tao) and her boyfriend Tiasheng (CHEN Tiasheng). (While the actor conveniently adopted his real name for the character, Tao in the movie means \"peach\" while Tao in the actress means \"waves\", two entirely different words). Through the daily lives in the park (part of which is still under construction) and visits from various friends and relatives of the two main characters, we are exposed to how people interact, think, perceive, love, and more. Many of the sequences and dialogue are so realistic and real that you would wonder if these are simply people in the street asked by director Jia to stand in front of the camera (but some distance away) and converse the way they normally do. The storytelling is straightforward and efficient, sometimes to the point of being skeletal. The camera is objective, impassionate and some may even call it dull. As if to make up for it, director Jia interspersed the script with animations, sometimes to mark off short episodes, each separately titled. Not for the general audience, The World has an air of the rough-diamond kind of crudeness that makes it quite appealing to seekers of less main-stream cinemas. I do find it a little too long, even when I watched a two-hour version rather than the 140 minute version billed in the IMDb listing.",
         "\"The World (Shijie)\" is one of the saddest films I've ever seen and is a moving visualization of the tragedy of rising expectations. While it is set very particularly in China, it achingly proves the universality of the twin globalization pulls of modernization and immigration over the past three hundred years around the world, recalling films from \"Hester Street\" to \"The Emigrants (Utvandrarna),\" and films about cities in throes of developmental change, like \"Atlantic City.\" These are universally recognizable young people - they rebel against and yet feel tied to their families and regretfully break ties with old friends; they fight with their siblings but bail them out; they get lonely, a bit homesick, and bored; they are jealous and ambitious; and they constantly compromise, particularly the women bargaining with the oldest currency. With what is a bit heavy-handed symbolism, the film is specifically set in what I presume is a real amusement park called \"The World\" on the outskirts of Beijing that replicates landmarks in scaled miniature and focuses on the employees and their extended, inter-connected network of friends and family. At first, they look to us as swaggering city sophisticates, as they dress-up in international costumes for a park revue, surrounded by emblems of international commercial culture, like fake Louis Vuitton bags and movie posters, such as of \"Titanic,\" They jealously and zealously call each other constantly by the most modern cell phone and text messengers, particularly from the encircling monorail that at first seems like a symbol of modern technology, but is really cobbled together from airplane parts--though one woman wistfully notes that she doesn't know anyone who has been on a plane- a frequent response to a call is \"I'm on the train.\" -- but by the end the canned voice of progress is emblematic of the dead end circularity of their lives as they can't get passports to leave, let alone to see the real landmarks. Travel is a constant theme visually and of conversation - when a country bumpkin shows up, the surprised greeting is \"How did you get here?\" such that \"I bought a ticket.\" is not self-evident. -- to the security guards riding camels around the fake pyramids and horses around the fake castles, to the six hour bus ride it takes to another city to pay off a relative's gambling debts, and emphasized through fanciful animated interstices. The ironic geographical headings of the chapters emphasize a character's quixotic goal -- \"world.com\", \"Ulan Bator Evening,\" \"Belleville\", \"Tokyo Story.\" Striving as they all are, for these folks even Ulan Bator, the depressed capital of Mongolia, looks like a step up. There are moving scenes when immigrants with different languages try to communicate to share the commonalities in their lives -- a Russian immigrant is terrified when her passport is taken away, while the Chinese woman is envious that she even has one. It is a bit confusing keeping up with the various characters, in and out of their work costumes, especially when the two main characters seemed to change so much without explanation, but they are enormously sympathetic so it is devastating as we see their hopes and dreams, however unrealistic or selfish, defeated. And those who succeed do so on very compromised terms. They are also not very articulate, which writer/director Zhang Ke Jia compensates for by spending a lot of time slowly setting up individual scenes and watching people interact, as we see how different they are in different contexts with different people, as body language becomes more important than words, whether spoken or in text messages. While the cinematography was beautiful, the print I saw in New York was a bit scratchy and the English subtitles had several misspellings. I'm sure subtitle-dependent viewers lose a lot of the significance of different accents and regional differences among the employees from all over China.",
         "Jia Zhangke's The World, his first state supported film, continues his look at the disillusionment of Chinese youth with Western-style globalization but shifts the setting from a rural to an urban environment. Young people work at Beijing's 114-acre \"World Park\", a sprawling Chinese Disneyland that displays scale models of famous landmarks such as The Eiffel Tower, The Pyramids of Egypt, The Leaning Tower of Pisa, The Taj Mahal, and The Vatican. For most of the low-paid employees, however, it is the closest they will ever come to seeing the world. Jointly produced by the Shanghai Film Group Corporation and Hong Kong's Xinghui Production Company, The World, unlike his previous independent work (Unknown Pleasures, Platform), has a big budget, glossy special effects, animation sequences, colorfully costumed song and dance routines, and uncharacteristic melodramatic plot contrivances. The film's main protagonists are young Chinese who have come to the city from rural areas to find work at the theme park and come in contact with migrants, petty criminals, and other lowlife characters who seem to thrive in this consumer-centered environment. The plot consists of the turbulent love affair between a dancer named Tao (Zhao Tao) who performs in lavish shows at the park and a security guard named Taisheng (Chen Taisheng) who has trouble remaining faithful to her. Zhao Tao, who has appeared in other Jia films, is sparkling in her role as the dancer whose horizons become more and more constricted. When she tells him, 'You're my whole life.' he replies, 'You can't count on anyone these days. Don't think so much of me.' As critic David Walsh points out, \"all the young people have great trouble expressing their emotions to one another; they prefer cell-phones and text messages. The picture of a terribly repressed and repressive society, with vast problems and contradictions, begins to emerge\". The employees live in overcrowded dorms or sleazy hotels and a group of Russian performers have their passports taken away when they arrive and some are forced to become prostitutes. In a heartbreaking sequence, Tao's brother Erxiao is arrested by the police for petty theft, and his brother, a construction worker known as \"little sister\", experiences a distressing industrial accident. Jia presents the world in small episodes, similar he says to the \"way you use a computer-you click here, you click there, each time leading you to another location.\" The vignettes, however, did not come together for me as a totally satisfying experience and the animation effects seemed showy. The World has stunning visuals and relevant social commentary and I'm happy to see Jia achieve a wider audience by working through the system, but by the end of The World, I felt that the sharp edge of his previous films had been lost.",
         "How can you truly show disconnection. I think I have truly seen a master in action with Shijie, a film that takes place in a world theme park (this place does really exist) in China. Zhang Ke Jia is a masterful director. His use of colour and character direction is unreal. One of the things he uses to great effect are arches and hallways. Characters appear in them, or look out of them in what is some of the most visual photography I have ever witnessed. There is also a great conversation scene between two characters who don't share the same language, and the use of reflected light that is truly remarkable, make sure to watch for this scene. But it doesn't end there. Zhang also does something so miraculous that I thought would be impossible. He borrows heavily from Ozu, particularly a scene that is reminiscent of Tokyo Story and makes something that is uniquely his own. The basic synopsis of \"The World\", is of the lives of the workers in the theme park. Some romances develop, a foreign Russian worker Anna is introduced to the group even though she and another Chinese girl Tao don't share the same language. Everyday trials and tribulations happen for these young adults who are trying to work in the 'New China'. Somehow though with all the issues involved, rural people coming into the cities, technological communication, the erosion of China's agrarian past, the fakeness of place, the exploitation of workers and lead up to prostitution, the camaraderie of friends, the cheapness of life.. somehow all of these themes are jumbled into a glorious presentation that you can't take your eyes off of. The film is beyond surreal, its real setting makes it all more spectacular and that more effective. I had a hard time separating the actors from the characters, at times I thought I was watching a documentary and I prayed or hoped for someone to do well and be happy and find themselves thinking that these were real people in harsh sometimes difficult situations. \"The World\" has this effect on you, you can't begin to believe the beauty and harshness it shows, and it tricks you in the most crafty way. The World is a truly fantastic small place in more ways than one... Rating 9 out of 10",
         "Though this movie is to some extent, demanding on the audience, a little patience and decent memory will leave you spellbound after the movie. I do warn that if you don't have the patience for books such as The Idiot, don't watch it. Otherwise, I'm sure it will be enjoyable. Jiangke takes the candor of Yasujiro Ozu's dramas and removes kindness, whimsicality, and love and replaces these with loneliness, harshness, and austerity. Powerful combination. The lead actress acts in a way that seems to forget that it's being filmed for a movie. The level of focus on her part is astounding to me. This is in fact true for the entire cast. The irony of the movie lies in its title: The World - a word that conveys a sense of endless possibility. What you get is quite the opposite - in fact the characters seem to be confined by such a level of endless impossibility that the throughout the film, I found myself fearing an imminent gunfight. That never came but the end is equally, if not, more shocking.",
         "Few directors in any genre anywhere in the world have been able to capture the heart and true essence of a modern nation in just two short hours as Zhang has done with Shijie. After books like Ted Fishman's \"China Inc.\" or Gordon Chang's \"The Coming Collapse of China\", this film arrives as a breath of fresh air sharing at a very personal level just how a rapidly changing China isn't always dealing with her 'prosperity' and globalization as easily as we would hope. The World is perhaps one of the best modern Asian films in years. We can only hope Zhang Ke Jia will continue to write, direct and interpret his homeland for us for years to come. Shijie is an emotional tour de force on modern China.",
         "If you want to get an aesthetic view on modern China, this is an excellent vehicle. Over two hours long, some scenes are poetic and subtle with an Eastern beauty lovely to behold. English sub-titles are well done. A big screen experience of common workers from the countryside and the artistic dance community in the big city of Beijing. There is a lot of smoking... and cell phone use, of course - this is the new China. Some animation sequences provide creative transitions of scenes. Not for the adrenaline junkie addicted to violence. Excellent portrayal of relationships. A true artist behind the camera. The acting is so natural. The backdrop and chapters are structured around the different national landmarks at the World Theme Park in Beijing. ( 8/10 )",
         "A friend of mine says that his defining image of modern China is of a marble facade slapped onto a jerry-built wall; and it's this kind of picture that also emerges from 'The World', a touching movie about the lives of a group of workers in a Beijing theme park in which all the planet's tourist attractions are copied in a single location. Beautifully acted, the film provides an interesting insight into the patterns of behaviour of young Chinese; but the underlying tone is melancholic, and this flavour grows stronger as the story progresses; in some ways, it's a tale about the death of hope. But it's done with a light touch, some striking photography and some nicely realised animated interludes. I found it moving and subtle, and ultimately, very sad."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Office Kitano",
         "Lumen Films",
         "X Stream Pictures"
      ],
      "summaries": [
         "\"The World\" is a theme park on the outskirts of Beijing, sixteen kilometers from the Chinese capital, designed around scaled representations of the world's famous landmarks such as the Eiffel Tower or the Leaning Tower of Pisa.The site is seen here not from the visitors' point of view but through the eyes of a few of its staff, lonely people, communicating poorly, a bit disillusioned with life, glittering for the tourists but dull and restricted as far as they are concerned. We meet, among others, pretty young dancer Tao and Taisheng, a security guard who is fond of her but not of personal commitment...",
         "An exploration on the impact of urbanization and globalization on a traditional culture."
      ],
      "budget": 0
   },
   "movielensId": 45303,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "2005-03-18",
      "dvdReleaseDate": "2006-02-14",
      "directors": ["Jia Zhangke"],
      "runtime": 143,
      "movieId": 45303,
      "title": "The World",
      "mpaa": null,
      "actors": [
         "Zhao Tao",
         "Cheng Taishen",
         "Jue Jing",
         "Jiang Zhong-Wei",
         "Yi-qun Wang",
         "Hongwei Wang",
         "Jing Dong Liang",
         "Shuai Ji",
         "Wan Xiang",
         "Alla Shcherbakova",
         "Han Sanming",
         "Wang Xiaoshuai"
      ],
      "imdbMovieId": "0423176",
      "originalTitle": "世界",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "“The World” is a theme park on the outskirts of Beijing, sixteen kilometers from the Chinese capital, designed around scaled representations of the world’s famous landmarks such as the Eiffel Tower or the Leaning Tower of Pisa.The site is seen here not from the visitors’ point of view but through the eyes of a few of its staff, lonely people, communicating poorly, a bit disillusioned with life, glittering for the tourists but dull and restricted as far as they are concerned.",
      "tmdbMovieId": 41292,
      "avgRating": 3.42,
      "releaseYear": "2005",
      "numRatings": 25,
      "posterPath": "/cP5uD3tTKJcrSLEgBaSE38XRBP6.jpg"
   }
}