{
   "tmdb": {
      "original_language": "nl",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "roadhouse",
            "id": 2781
         },
         {
            "name": "vacation",
            "id": 6876
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "missing person",
            "id": 156091
         }
      ],
      "imdb_id": "tt0096163",
      "video": false,
      "title": "The Vanishing",
      "recommendations": [
         31417,
         931,
         11167,
         827,
         16372,
         11020,
         10692,
         16307,
         11772,
         204,
         22307,
         25504,
         3031,
         25508,
         11481,
         16938,
         11033,
         779,
         28942,
         36095
      ],
      "backdrop_path": "/o00qtY66z8ucNeLdXLMBMlMLRAB.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "52b9832519c2954e72079065",
         "content": "Traceless.\r\n \r\nSpoorloos (AKA: The Vanishing) is directed by George Sluizer and Sluizer co-adapts the screenplay with Tim Krabbe from Krabbe’s own novella The Golden Egg. It stars Bernard-Pierre Donnadieu, Gene Bervoets, Johanna ter Steege and Gwen Eckhaius. Music is by Hennie Vrienten and cinematography by Toni Kuhn.\r\n \r\nIt’s a lesson in creeping unease, a film firmly interested in character development as it unfurls a tale of obsession whilst casting a clinical observation of a sociopath at work. Story is basic on plot terms, young lovers are separated during a vacation when the girl mysteriously disappears. So begins her boyfriend’s obsessive search that spans years, then things get intriguing as the person responsible for girls disappearance starts sending the boyfriend messages, giving him the run around, until the question is asked. Just how far are you prepared to go to find out what happened?\r\n \r\nThe script is brutally clever, we follow two parallel lives, that of emotionally torn boyfriend Rex Hoffman (Bervoets), and that of sociopath Raymond Lemorne (Donnadieu), the latter of which is a family man moving freely amongst his loved ones whilst simultaneously practising his perfect crime. Lemorne is a very different type of sociopath to what normally fills out horror movies, he’s sometimes a figure of fun, even inept, but he beats a black heart and as Rex Hoffman is going to find out, he’s very methodical in his belief that he was destined to enact a perfect crime.\r\n \r\nSluizer builds the picture very slowly, only turning the screw an inch at a time. He lets Spoorloos chill our blood not by jolt shocks or stalk and slash histrionics, but by the very fact that Raymond does what he does just because he can. While the disintegration of Rex’s emotional being is terrifying in its realism, what gnaws away at him also gnaws away the audience, so when the coup de grace comes at film’s end, the impact is like being run over by a tank. Great direction is matched by great acting from the principal players, to seal the deal for Spoorloos being a truly excellent thriller that’s well worth seeking out by those after a bit more thought in their thriller viewings. 8.5/10",
         "url": "https://www.themoviedb.org/review/52b9832519c2954e72079065"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Raymond Lemorne",
               "gender": 2,
               "credit_id": "52fe44b6c3a36847f80a5d99",
               "name": "Bernard-Pierre Donnadieu",
               "profile_path": "/2Mj60zJTf2RzI7HXBcehWZztvYS.jpg",
               "id": 38500,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rex Hofman",
               "gender": 2,
               "credit_id": "52fe44b6c3a36847f80a5d9d",
               "name": "Eugene Bervoets",
               "profile_path": "/lHObzWAaSJbljAsnuhj6gZE6qOU.jpg",
               "id": 55850,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Saskia Wagter",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5da1",
               "name": "Johanna ter Steege",
               "profile_path": "/fWY2HuHSORn5EnPqFJ8sSJia2ME.jpg",
               "id": 55851,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lieneke",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5da5",
               "name": "Gwen Eckhaus",
               "profile_path": "/xGqUvi7msSp3k4KJ8lDzdH9QCG4.jpg",
               "id": 55852,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Denise Lemorne",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5dad",
               "name": "Tania Latarjet",
               "profile_path": null,
               "id": 55854,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Gabrielle Lemorne",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5db1",
               "name": "Lucille Glenn",
               "profile_path": null,
               "id": 55855,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Manager",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5db5",
               "name": "Roger Souza",
               "profile_path": null,
               "id": 55856,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Cashier",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5db9",
               "name": "Caroline Appéré",
               "profile_path": null,
               "id": 55857,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Farmer Laurent",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5dbd",
               "name": "Pierre Forget",
               "profile_path": "/oQ9Ll7S9AJbR1jxZREZOPYGhgT.jpg",
               "id": 51948,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "TV Journalist",
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5dc1",
               "name": "Didier Rousset",
               "profile_path": null,
               "id": 55858,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Simone Lemorne",
               "gender": 0,
               "credit_id": "54fc3df8925141238c001c88",
               "name": "Bernadette Le Saché",
               "profile_path": null,
               "id": 577769,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b6c3a36847f80a5dc7",
               "name": "George Sluizer",
               "profile_path": "/1HlwIkG0HgzEdM0DZywCPW2ChFy.jpg",
               "id": 18335,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5dcd",
               "name": "Tim Krabbé",
               "profile_path": null,
               "id": 55859,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5dd3",
               "name": "Tim Krabbé",
               "profile_path": null,
               "id": 55859,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5ddf",
               "name": "Anne Lordon",
               "profile_path": null,
               "id": 55860,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b6c3a36847f80a5de5",
               "name": "George Sluizer",
               "profile_path": "/1HlwIkG0HgzEdM0DZywCPW2ChFy.jpg",
               "id": 18335,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b6c3a36847f80a5deb",
               "name": "Henny Vrienten",
               "profile_path": "/tN9tXtSaPpfntCaUw9LoxbFy08K.jpg",
               "id": 16673,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5aa14285925141610200786c",
               "name": "George Sluizer",
               "profile_path": "/1HlwIkG0HgzEdM0DZywCPW2ChFy.jpg",
               "id": 18335,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5aa1429b92514160f5007bf9",
               "name": "Toni Kuhn",
               "profile_path": null,
               "id": 1993079,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5aa142a30e0a2644dd008250",
               "name": "Lin Friedman",
               "profile_path": null,
               "id": 23317,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5aa142ab9251416102007895",
               "name": "George Sluizer",
               "profile_path": "/1HlwIkG0HgzEdM0DZywCPW2ChFy.jpg",
               "id": 18335,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5aa142b40e0a2644dd008269",
               "name": "Santiago Isidro Pin",
               "profile_path": null,
               "id": 1993080,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5aa142bd92514160ff00795e",
               "name": "Sophie Dussaud",
               "profile_path": null,
               "id": 1318442,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5aa142c70e0a2644ed007f10",
               "name": "Léone Noël",
               "profile_path": null,
               "id": 1773860,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5aa142d1c3a36850670088b5",
               "name": "Beppie van den Berg",
               "profile_path": null,
               "id": 1993081,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5aa142dc0e0a2644e9009536",
               "name": "Joop Pieëte",
               "profile_path": null,
               "id": 1871656,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "5aa142e7c3a36850670088cb",
               "name": "Piotr van Dijk",
               "profile_path": null,
               "id": 1440442,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.160398,
      "production_countries": [
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 8740,
      "vote_count": 166,
      "budget": 0,
      "overview": "Rex and Saskia are enjoying a biking holiday in France when, stopping at a gas station, Saskia disappears. Confounded, Rex searches everywhere, but to no avail. Three years later, he's still obsessed with finding her, pleading his case on television, putting up posters and ruining his new relationship in the process. Eventually an unassuming chemistry teacher, Raymond, approaches Rex, intimating that he knows what happened.",
      "similar": [
         2163,
         275,
         562,
         8067,
         10742,
         101,
         14869,
         1571,
         210577,
         3600,
         4771,
         193893,
         984,
         398175,
         11835,
         321258,
         10795,
         9039,
         13641,
         2320
      ],
      "original_title": "Spoorloos",
      "runtime": 106,
      "poster_path": "/rInUOmuP36paf3fQ4gJMUZNx6Bp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "MGS Film",
         "id": 8677,
         "origin_country": ""
      }],
      "release_date": "1988-10-27",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "Who Has Seen This Woman?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Sluizer"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Tim Krabbé",
         "Tim Krabbé"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0096163/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3ODk5OTEwN15BMl5BanBnXkFtZTYwMzAwNzU5._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Bernard-Pierre Donnadieu, Gene Bervoets, Johanna ter Steege | See full cast and crew »"],
      "reviews": [
         "STOP!!!! Observe these 3 rules if you plan on seeing this film: Rule #1, AVOID the 1993 remake \"The Vanishing\" or if you absolutely need to see it, watch the original first. Rule #2, If you're of a sensative nature and easily depressed, don't watch this. Rule #3, do NOT read any other comments on this film until you have seen it. This is a love it or hate it type of movie and looking for opinions to decide if you want to see this WILL ruin it for you. See it first, form your own opinion, then check back here. Trust me on this, you'll thank me afterwards.",
         "The Vanishing is a movie only those with ice in their veins can ever forget. The direction is absolutely brilliant, from the opening frames until the very end. I felt Saskia's fright when she thought she lost Rex initially, and her description of her dream made me feel chills. When she disappeared, Rex's combination of rage, frustration, anxiety, and grief was torture to watch. A particularly powerful moment was when he slammed the car door shut so hard the window crumbled into pieces. Watching Rex become consumed in every way by his quest to find Saskia was also extremely difficult to watch, although it was certainly inevitable. I found the professor's description of his actions appalling in many cases, the most notable one being when he fixates on Saskia and we see his POV. Seeing Saskia warmly respond to him was devastating, knowing what would happen. Throughout the film there was an overwhelming sense of doom and isolation, like this was a cruel world where even in the most idyllic settings evil lurked everywhere and attempting to fight it was futile. Rex undergoes one of the most harrowing emotional ordeals of any movie character ever, and when he is at the end of his rope his crucial decision would seem so insane out of context but viewers understand that it really is his only choice. The shock ending, especially the way it was done, almost made me scream, and I will never forget the final shot. The Vanishing could be shown in any film class on direction, as an example of perfection. Material that could have been turned into just a mediocre thriller with would have seemed like a lame twist was turned by George Sluizer into an utterly harrowing filmgoing experience. And that is the right word, because a movie like The Vanishing is not just watched-it is experienced. I estimate I have seen around 700 movies in my life, and horror is my favorite genre. I have only seen two films that left me so scared that after they ended I couldn't even move. One was Psycho, which I saw 10 years ago when I was only 12. The other one was just this year-The Vanishing.",
         "After reading several recommendations of Spoorloos (a.k.a. The Vanishing), I went ahead and bought the Criterion DVD release, which, by the way, has no extras. Let me say, I was not disappointed with the movie. If you like well-made, well-directed thrillers, it is definitely worth checking out. The story was simple enough; Rex's girlfriend mysteriously disappears at a gas station they stopped at while on vacation. Cut ahead three years and you still have him searching for her. Due to his persistence, the man responsible finally decides to get involved. With very little violence and no gore, Spoorloos was able to leave the viewer in a truly depressing state. Some people might call it boring but I found the slow and steady pace to work in favor of the characters, as the acting was top notch. So was the direction of the scenes, which were set up quite nicely. It was interesting to see such attention paid to both the victim and criminal's point of view. You could really understand the desperation, confusion, and obsession that Rex felt with his loss. In turn, you see cold evil in a form that does exist in our world. While maybe not shocking to all viewers, the ending is terrifyingly tragic, made so by the realism and calmness throughout the film. Just ask yourself, how would you feel if that happened to you? If pushed for a criticism, I would say that some of the symbolism seemed a bit too heavy handed but other then that, this is an intelligent, deep thriller. I have not seen the American remake (oddly enough, both versions are from director George Sluizer) but I can all but guarantee that the original is what you want to go with first. Many people suggest skipping the remake altogether!",
         "There aren't too many scenarios like this one. The original version and the Hollywood remake of this film were both directed by the same man, George Sluizer. As I understand from popular opinion, this is one film that was fine the first time round, and not well received on the second go. I cannot fairly compare them, and I have no more desire to see the remake of \"Spoorloos\" than I do the remake of \"La Femme Nikita\", namely \"The Point Of No Return\". I saw the original version upon the strong recommendation of a newspaper reviewer proclaiming it one of the most disturbing films they'd ever seen. The photograph of a young couple about to be torn apart in the paper reeled me in. A pleasant holiday excursion goes horribly wrong when a man's lady friend goes missing at a crowded rest stop. He grasps at straws in desperation as very little can be done because few clues or leads exist. The abduction is arbitrary and nearly flawless. The film was indeed well done and what struck me the most was the focus on that of the villain. It is a portrayal of a normal, respectable family man who trains himself in meticulous detail for an abduction. His cold, calculating approach is probably the most frightening aspect. His inhumanity is difficult to comprehend. Many film endings can be shocking and may stick with you forever, and for a lot of people that is certainly the case with this film. That's why I was surprised to learn that the TV commercials for this film gave away the ending. However it didn't ruin the film for me. The suspense and chilling setting of this film makes it hard to forget. The viewer constantly wondering, \"What would I do?\" or \"How would I cope?\". Impossible questions we all hope we'll never find the answer to. Of course, keep a few handy responses in mind should you watch this with your better half when they ask the inevitable, almost rhetorical question, \"What would you do if I went missing and you couldn't find me?\" \"I'd surely die, dear.\"",
         "This movie gave me nightmares for...well, I'm still having them. Rex and Saskia are a young couple on vacation. They stop at a gas station, Saskia goes inside and never returns. Rex becomes obsessed with finding out what happened to her and, when at last faced with the man who abducted Saskia, finally has the chance to find out. But there's one condition: Rex must surrender himself to Saskia's abductor and agree to experience the same thing she herself went through. The only trouble is, he has no idea what that might be, or even whether Saskia is alive or dead. Rex believes that the Not Knowing is the worst thing, but it isn't. The Knowing is the most horrible thing of all. This is a powerful film that practically punches you in the stomach with its gritty realism. The performances are flawless and haunting, and the climax and aftermath, delivered with a quiet matter-of-factness, are the very definition of horror. This is real horror, the kind we try not to think about but which can happen, and has. If this film doesn't disturb you, I can't think of anything that will. Highly recommended, but only for people who are emotionally equipped to deal with the fear and the terror that the camera never flinches from. People with claustrophobia would be wise to stay far away from this film.",
         "This is a most unsettling and haunting film which vividly depicts the banality of evil. American filmgoers who are too lazy to settle in to the ambiance and mood of foreign films will probably not be patient enough for it, though. I went to see it not knowing at all what to expect, and really got a jolt. One factor that made it so powerful was the everyday reality of it all. These are seemingly normal people you'd see on the street anywhere. I thought it was a masterful depiction of what would probably actually happen when someone you loved just disappeared out of the blue, and the turmoil of emotions that would be unleashed. If you are at all susceptible, the ending will absolutely chill you to the bone, and is the perfect topper to a great film. Please do yourself a favor, and DON'T make the mistake of seeing the American remake instead of the original!",
         "\"The Vanishing\" is one of my favorite movies, probably in my top ten. I first saw it in 1990 in San Francisco. Without giving anything away, the end of this Dutch/French film contains an extraordinarily diabolical twist, and at the theater at which I saw it, the projector crapped out with about 15 minutes left. Everyone was issued a free pass to come back, which I did the next day, having barely been able to get the creepy story out of my head. I couldn't wait to see what happened at the film's conclusion. Fifteen years later, it still makes me shudder sometimes. The American remake with Jeff Bridges and Kiefer Sutherland should, in my opinion, be avoided at all cost; the ending was changed, no doubt to suit the bottom-line aspirations of some brain-dead producer. But the European original is full of great acting (particularly from the villain, Bernard-Pierre Donnadieu), a tight storyline, and, of course, a wickedly brilliant ending. It's a film worthy of Hitchcock.",
         "When I searched for \"The Vanishing,\" all I could find was that abysmal \"Americanized\" version of the film starring Jeff Bridges. What a horrible mistake of a movie that was. Let's consider, instead, the original film in which a fellow and his girlfriend are on an outing when she vanishes without a trace. He becomes obsessed with discovering what happened to her. Whether he can be completely successful in his quest is the whole point of the movie. Why the original director would remake this little masterpiece in English with a Hollywood ending is completely beyond me. See the original. You won't soon forget it.",
         "According to Poe, without a traceable motive, anyone can commit murder with impunity. Thats what this movie documents. A sociopath who for an insane reason he's in his head concocted, plans and executes the perfect crime. His victim's lover refuses to give up on her disappearance, and begs the culprit for a private meeting, just so he may learn the truth. I cant think of a more successful development of a movie villain. The guy is plain evil, successfully living a double life that his family suspects, but is inclined to think of as a trivial extramarital fling. In France extramarital goings on, i assume Are trivial. You quickly loathe the man. He's rather hideous to look at, and his superior manner gets under your skin. Film is very well done, and the two hours is well paced. Understanding the murderers motives even upon revelation is somewhat confusing, and i dont think it was meant to be.",
         "George Sluizer has made a movie that moves slowly forward, giving the viewer clues that work as pointers to take us back and forth in time. Bernard-Pierre Donnadieu as Raymond Lemorne depicts a man who knows the difference between right and wrong, but when he is 16, looking down from his parents veranda 15 feet above ground, he asks himself this question: Where is it predestined that I will not jump? And then he has to jump. This highly disturbing way of thinking moves him in a different direction. We see in his every day life that he is a most normal man, he has two daughters, a good wife, a job as a chemistry teacher. But he is something else too. Is he evil? This is a very disturbing movie."
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Argos Films",
         "Golden Egg",
         "Ingrid Productions"
      ],
      "summaries": [
         "Rex and Saskia are on holiday, a young couple in love. They stop at a busy service station and Saskia disappears. Rex dedicates the next three years trying to find her. Then he receives some postcards from her abductor, who promises to reveal what has happened to Saskia. The abductor, Raymond Lemorne, is a chilling character to whom Rex is drawn by his intense desire to learn the truth behind his lovers disappearance. The truth is more sinister than he dared imagine.",
         "Inspired by the current Tour de France, married Amsterdammers Rex Hofman and Saskia Wagter drive to France to go on a cycling vacation. At a highway gas station/rest stop in France, Saskia goes inside to use the facilities and make some purchases, but Rex never sees her come out. Despite the two having had a serious argument earlier that day, Rex doesn't believe she left him on her own volition and that she was abducted. His cursory questioning of people at the gas station does provide some information, but does not result in Rex finding out definitively what happened to her. Fast forward three years... Rex has a renewed fervor in finding out what happened to Saskia, often taking to the media as a plea to the public about any information. His new girlfriend Lieneke supports his efforts, but she may only be able to be the third wheel in their relationship for so long. Rex's search is spurred by the occasional postcard he has received by an unknown person asking to meet him at the same café in Nîmes, that person who never shows up. But that person eventually does show himself to Rex. He is Raymond Lemorne, a chemistry professor and family man with wife and two daughters. He admits that he used several rudimentary and unsuccessful ruses in the past to try and lure women into his car with the purpose of knocking them unconscious with chloroform. His quest was inadvertently spurred by his daughter's worship of him after he saved a girl from drowning. Raymond vows to tell Rex the entire story only on the condition that Rex experience exactly what Saskia experienced. With no hard evidence tying Raymond to Saskia's disappearance, Rex has to decide if he will go along with Raymond's conditions to find out what happened to Saskia.",
         "Rex and Saskia, a young couple in love, are on vacation. They stop at a busy service station and Saskia is abducted. After three years and no sign of Saskia, Rex begins receiving letters from the abductor."
      ],
      "budget": 0
   },
   "movielensId": 4546,
   "movielens": {
      "languages": [
         "English",
         "Nederlands",
         "Français"
      ],
      "releaseDate": "1988-10-27",
      "dvdReleaseDate": "1998-05-13",
      "directors": ["George Sluizer"],
      "runtime": 106,
      "movieId": 4546,
      "title": "The Vanishing",
      "mpaa": "NR",
      "actors": [
         "Bernard-Pierre Donnadieu",
         "Eugene Bervoets",
         "Johanna ter Steege",
         "Gwen Eckhaus",
         "Tania Latarjet",
         "Lucille Glenn",
         "Roger Souza",
         "Caroline Appéré",
         "Pierre Forget",
         "Didier Rousset",
         "Bernadette Le Saché"
      ],
      "imdbMovieId": "0096163",
      "originalTitle": "Spoorloos",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "KlO2oIieI44",
         "_hwGbs69kX0"
      ],
      "plotSummary": "Rex and Saskia are enjoying a biking holiday in France when, stopping at a gas station, Saskia disappears. Confounded, Rex searches everywhere, but to no avail. Three years later, he's still obsessed with finding her, pleading his case on television, putting up posters and ruining his new relationship in the process. Eventually an unassuming chemistry teacher, Raymond, approaches Rex, intimating that he knows what happened.",
      "tmdbMovieId": 8740,
      "avgRating": 3.9269,
      "releaseYear": "1988",
      "numRatings": 1628,
      "posterPath": "/rInUOmuP36paf3fQ4gJMUZNx6Bp.jpg"
   }
}