{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "poker",
            "id": 383
         },
         {
            "name": "sheriff",
            "id": 798
         },
         {
            "name": "saloon",
            "id": 1582
         },
         {
            "name": "ranch",
            "id": 2752
         },
         {
            "name": "inheritance",
            "id": 10911
         },
         {
            "name": "rancher",
            "id": 14574
         },
         {
            "name": "stagecoach",
            "id": 33600
         },
         {
            "name": "wild west",
            "id": 155573
         },
         {
            "name": "shot",
            "id": 184369
         },
         {
            "name": "stagecoach driver",
            "id": 220322
         }
      ],
      "imdb_id": "tt0037343",
      "video": false,
      "title": "Tall in the Saddle",
      "recommendations": [
         40717,
         40743,
         144610,
         146784,
         100318,
         23189,
         79720,
         147603,
         48698,
         162749,
         210972,
         234817,
         128753,
         48276,
         105560,
         34712,
         46707,
         84669,
         84762,
         86753
      ],
      "backdrop_path": "/fXtWB4ro87Nas8CGOeyzhhzCYVS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rocklin",
               "gender": 2,
               "credit_id": "52fe46499251416c750736e9",
               "name": "John Wayne",
               "profile_path": "/iw9gHSQj1l3TQeiJb5tNK2N8k2w.jpg",
               "id": 4165,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Arleta 'Arly' Harolday",
               "gender": 1,
               "credit_id": "52fe46499251416c750736ed",
               "name": "Ella Raines",
               "profile_path": "/afTfqyrJDcFpToQ7IIb2worWdMn.jpg",
               "id": 78052,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "'Judge' Robert Garvey",
               "gender": 2,
               "credit_id": "52fe46499251416c750736f7",
               "name": "Ward Bond",
               "profile_path": "/y7WrIGuVPHlMaakPHRYNldxvZRf.jpg",
               "id": 4303,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dave",
               "gender": 2,
               "credit_id": "52fe46499251416c750736fb",
               "name": "George 'Gabby' Hayes",
               "profile_path": "/bW3k2dyTraxwWJTRB5UoUI8JD3H.jpg",
               "id": 88978,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Clara Cardell",
               "gender": 1,
               "credit_id": "52fe46499251416c750736ff",
               "name": "Audrey Long",
               "profile_path": "/oEohGuChKCbAUIMdcZmBH5re6jB.jpg",
               "id": 111431,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Miss Elizabeth Martin",
               "gender": 1,
               "credit_id": "55d234f6925141180a0001f2",
               "name": "Elisabeth Risdon",
               "profile_path": "/lWDXhI6GCbMF3AIWyTmCGBeOwpD.jpg",
               "id": 99329,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Harolday",
               "gender": 2,
               "credit_id": "55d2350692514117fb000215",
               "name": "Donald Douglas",
               "profile_path": "/wD8T5t6cICiWHNkKe3sbXGBbX8G.jpg",
               "id": 96257,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Bob Clews",
               "gender": 2,
               "credit_id": "55d23516c3a36834280002a3",
               "name": "Paul Fix",
               "profile_path": "/5uySf96UVra95Ru24YvbjLuiBS5.jpg",
               "id": 8496,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Clint Harolday",
               "gender": 2,
               "credit_id": "55d235269251411804000251",
               "name": "Russell Wade",
               "profile_path": "/7z4KfH8mQCnjkH28MfYxlPHSbxE.jpg",
               "id": 106104,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Sheriff Jackson",
               "gender": 2,
               "credit_id": "55d23537c3a36834370001f5",
               "name": "Emory Parnell",
               "profile_path": "/1duv3EnZjZSz8jgtXGZS4MOArNK.jpg",
               "id": 124875,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Tala",
               "gender": 2,
               "credit_id": "56b67e2b9251413c010034bf",
               "name": "Frank Puglia",
               "profile_path": "/cC89EI595bAz4SPIE1JKIOkdVU.jpg",
               "id": 89691,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "George Clews",
               "gender": 2,
               "credit_id": "56b67ea49251414a25004531",
               "name": "Harry Woods",
               "profile_path": "/3dA8pb7nD6QCBCfEm7PW2boVPIL.jpg",
               "id": 100920,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46499251416c750736f3",
               "name": "Edwin L. Marin",
               "profile_path": "/tOsRr6PgCYIE0uKBd3t3LxgH4kz.jpg",
               "id": 78053,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46499251416c75073705",
               "name": "Michael Hogan",
               "profile_path": null,
               "id": 231131,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46499251416c7507370b",
               "name": "Paul Fix",
               "profile_path": "/5uySf96UVra95Ru24YvbjLuiBS5.jpg",
               "id": 8496,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46499251416c75073711",
               "name": "Gordon Ray Young",
               "profile_path": null,
               "id": 1159337,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 2.989916,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15264,
      "vote_count": 21,
      "budget": 0,
      "overview": "When Rocklin (John Wayne) arrives in a western town he finds that the rancher who hired him as a foreman has been murdered. He is out to solve the murder and thwart the scheming to take the ranch from its rightful owner.",
      "similar": [
         196,
         9394,
         49849,
         11697,
         14168,
         9359,
         11967,
         10213,
         9086,
         12501,
         6644,
         301,
         27945,
         9287,
         5698,
         10046,
         9028,
         95864,
         13496,
         49397
      ],
      "original_title": "Tall in the Saddle",
      "runtime": 87,
      "poster_path": "/gvLZw3AciIyXTR4pIKSVGZp3Cl1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1944-09-29",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "WAYNE PACKS A WALLOP...In Action...In Love!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edwin L. Marin"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Michael Hogan",
         "Paul Fix"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0037343/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2MTMwODI4Ml5BMl5BanBnXkFtZTcwNDk5Nzc0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: John Wayne, Ella Raines, Ward Bond | See full cast and crew »"],
      "reviews": [
         "One of the best of John Wayne's westerns is Tall In The Saddle which came out in 1944 for RKO. Good characterization with a little more plot than the usual western. Wayne is the straight arrow Joel McCrea-Gary Cooper like hero who's come to town because he's been sent for by Red Cardell, a local rancher who's concerned about an outbreaking of cattle rustling. When Wayne arrives he finds Cardell murdered and a few others occur before the truth comes out. Wayne has two leading ladies, prim and proper easterner Audrey Long and hard riding Ella Raines. Raines in those tight cowboy outfits is something to see. Her scenes with the Duke have some real spark to them. Raines had a Lauren Bacall-like appeal and should have risen higher as a movie sex symbol. Old friends of the Duke like Ward Bond and Paul Fix are in the cast as is Gabby Hayes. Hayes, who was the quintessential cowboy sidekick was never better than as Dave, the old stagedriver who befriends the Duke and sticks with him when it gets pretty dark for him. I remember Gabby Hayes with his television show for kiddies in the 1950s and supposedly he was anything but the illiterate old coot he normally played. During his pre-Stagecoach period, Hayes appeared in several films with Wayne. In fact my title quote is one of two favorite lines he says in Tall In The Saddle. The other favorite line is a piece of wisdom that's just as valuable today as in 1944. When the Duke asks Gabby how he feels about law and order, Gabby replies \"depends on who's dishing it out.\"",
         "This is one on John Wayne's better early western movies. The plot is very good and the movie moves along at a good pace. It has all the elements of a good western movie. Bad guys against the good guys. John Wayne is the stranger in town that no one knows and two women want. Ella Raines plays one of the women who is just as tough as the Duke. And she is just absolutely beautiful in this movie. The chemistry between John Wayne and Ella Raines is right on the money. Audrey Long plays the more timid woman, who is controlled by her aunt. It doesn't take long for things to heat up in this movie. There is good humor supplied by none other than the great Gabby Hayes. Ward Bond plays the low down dirty lawyer/judge. Paul Fix (pre Rifleman) as one of the bad men. A must see movie",
         "There are better Westerns than 'Tall in the Saddle', but very few that are as much sheer fun. The plot is conventional, but the performances elevate the film above the ordinary, especially that of Ella Raines as the wild-spirited ranch operator. Raines is simply a hoot to watch, especially in the three way meeting between her, John Wayne, and Audrey Long in which she makes it clear that Wayne's expectation that no woman is going to \"hogtie and brand him\" is already in trouble. Watch her face; she manages to pack coyness, bravado, sensuality, wit, and smugness into a comparatively brief scene without ever overreaching herself. She's handy with a gun, with a knife, and with Wayne. The result plays off and balances Wayne's traditional laconic approach very effectively, and thus helps give Wayne's character more depth than was often the case in his mid-40s Western programmers (notice his reaction after his first encounter with Raines; for once in a Western you feel that there's a genuine reason for the hero ordering a whiskey in the middle of the day). I recommend this film highly; it's unpretentious, crisply made, and very enjoyable.",
         "You might want to look into the work of director Edwin Marin if you're not already aware of the man. While not in the first line of star moviemakers like John Ford or William Wyler, Marin kept busy with a steady stream of lesser-known but immensely-viewable films throughout the 1930's and 1940's (Marin died in the saddle in 1951). Check out \"Tall\" for a good taste of Marin's style. You'll find plenty of John Wayne, hellcat Ella Raines, wonderful Gabby Hayes (who gets knocked down twice while Wayne punches out a villain in one hilarious scene) plus Wayne/Ford touring company regular Ward Bond who plays the heavy in this one. There's a lot going for this film--a love triangle around the nonchalant Wayne, a full quota of western chase scenes, a showdown in the streets and some snappy dialogue to boot. It's a fun film and worth catching the next time it rolls across the small screen on \"John Wayne Theater.\"",
         "Fast-moving, well-acted, and impeccably directed, this is my favorite John Wayne western of all-time although the Quiet Man is my favorite John Wayne movie. The plot is intelligent; the dialogue is crisp; the supporting characters are fascinating; and the chemistry between Wayne and Ella Raines is magnificent. Well worth watching.",
         "Perfectly paced film. Many older films as well as new ones are not as successful as they could be due to poor pacing. It's hard to define pacing - it is maybe in the editing, the director rushing or slowing down the actors, or the way the camera shots are set up. Whatever \"pacing\" is, this film is a good example of it. This film makes very good use of character actors (Fix, Gabby, and the others). The producers trusted them enough to really feature them in some scenes, and they deliver. It seems that most producers (in the 1940's as well as today) are afraid to take the camera off the film's star for fear of not making big box-office. Wayne does a great job in a no-nonsense, straight-arrow role. It is amazing how he could make such a character charismatic, rather than wooden. Ella Raines and Wayne should have made more movies together because they had good chemistry. More importantly Raines was capable of portraying one of the major character traits of the western United States expansion- strong women. Film buffs can view \"Tall in the Saddle\" as good movie-making, but anyone can just view it as good entertainment and not even stop to analyze anything. Perhaps that is the genius of a film like this.",
         "This is one of the old movies I watch year after year. John Wayne in his prime & Ella Raines seems to be ideal for her role. I do not remember seeing her in another movie where she is as beautiful as she is in Tall In The Saddle. To see all the old timers such as Gabby Hayes, Ward Bond, & Paul Fix among others is a treat for an old western fan. The back ground viewed from the the wild stage ride is sort of phony, but have to remember this was in 1944. Still I enjoy it each time I see it. It brings back memories of a simpler time when I use to go to the Rialto Theatre on Saturday afternoon, pay 15 cents for admission & spend a dime on popcorn & drink",
         "This is, perhaps, my favorite movie. I like John Wayne and westerns. What I loved about this flick is Ella Raines. She looks and acts great. Her bantering with Wayne is delightful. Great role for Wayne, too -- strong, silent type, mysterious stranger. Good poker game scene. Good Gabby Hayes humor.",
         "I think this is a top-notch film. First, and perhaps most importantly, this film cannot be categorized as belonging to any particular, well identified genre. Indeed, the film is best described as a very original mix between a Western, a thriller/detective story, a love story and a romantic comedy with strong existentialist overtones. I am not kidding, you have to see it to believe it! All this perfectly integrated in as perfect a script as there ever was. Second, the movie is very well executed. All actors are quite good, starting with the young Duke, who delivers a very solid and typical performance. The directing is also first-rate, as is the cinematography (as far as be judged from the rather good Laserdisc and DVD transfers); only the editing does perhaps leave something to be desired, but not to the point of preventing appreciating the other qualities of the movie. I'd like to finish this review by emphasizing that my rating (7/10) is actually pretty conservative and prudent. If I were to go by my heart and forget about my \"brain\", I would rate this movie a 10/10. Trust a movie buff and rent or buy \"Tall in the Saddle\"; you will not be disappointed.",
         "\"Tall In the Saddle\" is one of John Wayne's better westerns of the first half of the forties. It contains plenty of action including fistfights, shoot outs and an eternal triangle. A stranger named Rocklin (Wayne) arrives in town on a stagecoach driven by a whiskey swilling driver named Dave (George \"Gabby\" Hayes)seeking a local rancher Red Cardell who had offered hum a job. It turns out that Cardell has been murdered and his niece Clara Cardell (Audrey Long), along with her crusty old guardian Miss Martin (Elizabeth Risdon) have come to claim her uncle's ranch. Judge Garvey (Ward Bond) is looking after the Cardell's affairs and has plans of his own for the property. Meanwhile Rocklin faces down young Clint Harolday (Russell Wade) in a card game and sends the young man home embarrassed. The next day Rocklin encounters Clint's firebrand sister Arly who takes after him with her gun. However,there is an immediate attraction between the two although Rocklin is also attracted to the lovely Clara at the same time. Judge Garvey and Miss Martin scheme to wrest control of the Cardell ranch from Clara. Rocklin takes a job with the Harolday ranch at the request of Harolday (Donald Douglas)to keep an eye on things and find out who murdered Cardell. Of course he clashes with Arly and she winds up firing him. Later Rocklin is framed for the murder of young Clint and flees the town seeking to clear himself. Arly along with her sinister bodyguard Taro (Frank Puglia), who has witnessed the murder, also seek the truth. Finally Rocklin has a showdown with Garvey and his boys (Paul Fix, Harry Woods) learns the identity of the real killer and......... Wayne is Wayne the true and honest rough and tough hero once again, a role that he had come to perfect. Raines is beautiful and feisty as the scrappy Arly. Audrey Long is more of the stereo typed western heroine as Clara. Gabby Hayes, in his final appearance with Wayne is well, Gabby Hayes the cantankerous old timer that we all came to love. Ward Bond makes a swarthy villain. Oddly enough, although he and Wayne were life long personal friends, they did not appear together that often prior to this film. Frank Puglia as the sinister Taro was unbilled in this film but stands out nonetheless. In addition to Harry Woods and Paul Fix (who also co-wrote the script), there are several western veterans in the supporting cast. Look for Raymond Hatton as Hayes' drinking pal, Emory Parnell as the sheriff, and Cy Kendall, Russell Simpson, Eddie Waller, Hank Bell and Clem Bevans in a variety of roles. And from the blink and you'll miss him department, a very young Ben Johnson as a townsman. Good entertainment."
      ],
      "genres": [
         "Mystery",
         "Western",
         "Romance"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "When a stranger arrives in a western town he finds that the rancher who sent for him has been murdered. Further, most of the townsfolk seem to be at each other's throats, and the newcomer has soon run contrariwise to most of them.",
         "An experienced ranch hand, Rocklin, arrives in town expecting to start a new job only to find that his prospective employer was shot dead a few weeks before. Also arriving at the same time is a pretty young woman, Clara Cardell, who is about to inherit her uncle's ranch and her domineering aunt, Elizabeth Martin. Rocklin no sooner arrives than he has a run-in with Arly Harolday, owner of a neighboring ranch, a woman who can ride and shoot as well as he does. Rocklin finds that he's not very welcome in town and finds that there are plans to swindle Clara out of her inheritance. There's also an attempt to frame him for murder.",
         "Rocklin arrives at a ranch to take over as foreman, but discovers the owner has been murdered. He helps solve the mystery of the murder and a scheme to swindle the ranch away from its rightful owner.",
         "Ranch hand Rocklin arrives in town to start his new job but his employer has been murdered and the locals don't seem too friendly."
      ],
      "budget": 565754
   },
   "movielensId": 45537,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-09-29",
      "dvdReleaseDate": "2005-05-03",
      "directors": ["Edwin L. Marin"],
      "runtime": 87,
      "movieId": 45537,
      "title": "Tall in the Saddle",
      "mpaa": "",
      "actors": [
         "John Wayne",
         "Ella Raines",
         "Ward Bond",
         "George 'Gabby' Hayes",
         "Audrey Long",
         "Elisabeth Risdon",
         "Donald Douglas",
         "Paul Fix",
         "Russell Wade",
         "Emory Parnell",
         "Frank Puglia",
         "Harry Woods"
      ],
      "imdbMovieId": "0037343",
      "originalTitle": "Tall in the Saddle",
      "genres": ["Western"],
      "youtubeTrailerIds": ["rt6bvg8N7L0"],
      "plotSummary": "When Rocklin (John Wayne) arrives in a western town he finds that the rancher who hired him as a foreman has been murdered. He is out to solve the murder and thwart the scheming to take the ranch from its rightful owner.",
      "tmdbMovieId": 15264,
      "avgRating": 3.16667,
      "releaseYear": "1944",
      "numRatings": 12,
      "posterPath": "/gvLZw3AciIyXTR4pIKSVGZp3Cl1.jpg"
   }
}