{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "hitchhiker",
            "id": 11546
         }
      ],
      "imdb_id": "tt0096294",
      "video": false,
      "title": "Track 29",
      "recommendations": [39884],
      "backdrop_path": "/cO7dQAGTpEh9pNaq7BVSc2fAW40.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Linda Henry",
               "gender": 1,
               "credit_id": "52fe45e5c3a36847f80e0c9d",
               "name": "Theresa Russell",
               "profile_path": "/wsuvlVzWU5V96QG0Nh8902ZxvBk.jpg",
               "id": 9207,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Henry Henry",
               "gender": 2,
               "credit_id": "52fe45e5c3a36847f80e0ca1",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Arlanda",
               "gender": 1,
               "credit_id": "52fe45e6c3a36847f80e0ca5",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Nurse Stein",
               "gender": 1,
               "credit_id": "52fe45e6c3a36847f80e0ca9",
               "name": "Sandra Bernhard",
               "profile_path": "/nYCnCtbbWjrMsmbanQLGhRM3FXh.jpg",
               "id": 3664,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe45e6c3a36847f80e0cad",
               "name": "Gary Oldman",
               "profile_path": "/tofLS5A6lBXNjeROGvgpfe2JwaT.jpg",
               "id": 64,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Dr. Bernard Fairmont",
               "gender": 2,
               "credit_id": "52fe45e6c3a36847f80e0cb1",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Trucker",
               "gender": 2,
               "credit_id": "52fe45e6c3a36847f80e0cb5",
               "name": "Leon Rippy",
               "profile_path": "/n6CHIOFY3uWwTPQtmhmFSZh2zv4.jpg",
               "id": 15374,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e5c3a36847f80e0c6f",
               "name": "Nicolas Roeg",
               "profile_path": "/m1f5AHFoKMabMBKEpllcm0MhbMz.jpg",
               "id": 14132,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e5c3a36847f80e0c75",
               "name": "Dennis Potter",
               "profile_path": null,
               "id": 54349,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e5c3a36847f80e0c81",
               "name": "Rick McCallum",
               "profile_path": "/qfKgg9sNcIOp2hELpEksqI4DDoo.jpg",
               "id": 19801,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e5c3a36847f80e0c87",
               "name": "Denis O'Brien",
               "profile_path": null,
               "id": 61865,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e5c3a36847f80e0c8d",
               "name": "Stanley Myers",
               "profile_path": null,
               "id": 40150,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e5c3a36847f80e0c93",
               "name": "Alex Thomson",
               "profile_path": null,
               "id": 21516,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e5c3a36847f80e0c99",
               "name": "Tony Lawson",
               "profile_path": null,
               "id": 12685,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5594455bc3a3683566001215",
               "name": "George Harrison",
               "profile_path": "/3U4WXM0pNb7ob7gvQCnZ3sJYgB9.jpg",
               "id": 10593,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.153635,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 41974,
      "vote_count": 8,
      "budget": 5000000,
      "overview": "Years after a desperate teenage Linda gives up her baby for adoption, she finds herself face-to-face with Martin, a young man claiming to be her long-lost son. Linda embraces Martin and in him finds a welcome reprieve from her unhappy marriage to the neglectful Henry. But soon Martin grows violent and becomes obsessed with Henry -- a philandering man whose only offspring is an expansive model train set that devours his waking hours.",
      "similar": [
         28468,
         401898,
         1939,
         27066,
         705,
         49950,
         1259,
         8088,
         13523,
         467,
         1578,
         2252,
         1813,
         1586,
         3594,
         1903,
         8329,
         1213,
         10545,
         64682
      ],
      "original_title": "Track 29",
      "runtime": 86,
      "poster_path": "/3V9PpZyxg9vzs6VW1vTrZ6x5Rvi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "HandMade Films",
         "id": 20076,
         "origin_country": ""
      }],
      "release_date": "1988-05-15",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Was he her dream or obsession? Was she his mother or his lover?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nicolas Roeg"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Dennis Potter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0096294/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MzcyMzUzN15BMl5BanBnXkFtZTcwMDQ4MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Theresa Russell, Gary Oldman, Christopher Lloyd | See full cast and crew »"],
      "reviews": [
         "I only rented out the film last night and Ive watched it three times since. Such an interesting little film and it leaves tons of questions. Its thought provoking on whether some scenes are real or some are part of Lindas (Theresa Russell) insanity. I wasnt too keen on watching Theresa Russell or Christopher Lloyd on screen (the spanking scene was incredibly disturbing) but Gary Oldman somehow saves the film which makes it at least watchable. He was loveable all the way through as Martin. If you love Gary Oldman, watch this. If you dont, then youll be disappointed. 4/5",
         "As one of screenwriter Dennis Potter's few feature films, this is definitely worth seeing for fans of his work. Potter incorporates a grab-bag of typical themes (and a couple of familiar jokes) into a surrealistic erotic thriller. Oldman and Russell have a smoldering chemistry, and many of their scenes together are very well done. But ultimately, as a movie, Track 29 gets hung up on a couple of points. First of all, as everyone has pointed out, the southern accents are really, really bad in this movie. Oh what a difference a good language coach would have made. Given Potter's interest in accents, and social class, I can't help but think that the juxtaposition of the characters' strong East London and North Carolina accents was probably specified in the script, but the utter ineptitude of Russell and her co-stars to sound like they're actually from *anywhere* in the South keeps destroying the viewer's suspension of disbelief. The other stumbling block, is the director's style. Potter's writing, bred at the BBC, seems to work better when filmed in an understated, realistic style. He's a writer who really packs a lot into every line, and his material doesn't generally need to be \"played up\" at all in order to carry the intended impact; all the power is right there in the script. Unfortunately, Roeg comes out with both guns blazing, and while his over-the-top visual style works really well in some sequences (as when Oldman destroys the train set), the overall effect was one of \"more is less\". I couldn't help wondering as the movie ended how differently the script could have been handled by a director like Jonathan Demme, who not only has an ear for accents and an understated visual style, but also a more subtle understanding of class in rural America than any director I can think of. In the end, an enjoyably campy B-movie with unfulfilled potential for greatness.",
         "Track 29 begins with the image of Gary Oldman appearing out of thin air - he appears by the side of the road with his thumb stretched out. Then after a while he screams, like a banshee, 'Mummmmmmeeeeeeeee!' Er, okay. We've got a weird one here. One of the first hints that the film gives you about the nature of Oldman's character, aside from his entrance, is some dialogue on a television show. We hear, as Theresa Russell works out, that two or more things can apparently inhabit the same area at the same time, co-existing in parallel dimensions. O-kay. And then later, after Oldman has convinced Russell that he's her son, a son that she gave up at birth, we find out that other people can't even see him. Right, so she's mad and all of this is in her head. Fine. But with this gimmick do we learn anything of interest about Russell's character? Do we feel the pain she felt at having to give up her child? No, not really. The film is nothing more than a silly freak show, a film where young men act like retarded children, where old men act like pathetic perverts and where southern belles toss their hair about like crazy. This film tells you next to nothing about the human condition. One of the most amazing things about Track 29 is Oldman's performance. He plays Martin like a hyperactive manchild. He screams and he spazzes and he almost foams at the mouth. There's no restraint, no subtlety. He chews the scenery like crazy. But even though it's incredibly over the top, it is amusing. At one point he even takes Russell's diaphragm and puts it to his mouth and begins to talk through it, using it as a second mouth. These silly moments are the only pleasure that's to be found in this dire film. And it's always amusing whenever Oldman begins screaming or talking like an over-sized child (which he does with great regularity). He berates his mother, comes on to her and at one point even blows a raspberry at a painting of Lloyd after drawing a moustache on it. But there's a scene in a restaurant where he begins pouting that is even funnier. He says, 'You never kissed it better.' 'Kissed what better?' his mother replies. There's a brief pause, and you know Martin is thinking about his penis, and he then says, 'My knee'. It would be queasy if it wasn't so ridiculous. But Martin isn't the only ridiculous character. Christopher Lloyd plays Dr Henry Henry, Russell's husband. He's a man who spends all his spare time playing with toy trains and who likes to be spanked by one of his nurses. And to make it worse, the nurse is played by Sandra Bernhard. Even Satan himself couldn't have created a more hideous image than Bernhard spanking Lloyd's exposed buttocks with red rubber gloves as both of them mug the camera with orgasmic glee. It's the sort of sight that makes you want to pour disinfectant into your eyes to remove the stain. However, Lloyd's character is a sidenote. Russell and Oldman are the focus. And what horrible event could have screwed Russell up to such an extent that she's making up people in her own head? Well, when she was a kid she was shagged in the bushes by a tattooed carnie, a carnie who looks exactly like her son. Okay, so that would mess you up pretty bad, but please, there must be a better actress than Russell to communicate the pain of the event. When she talks or thinks about it, all she can do is toss her hair, clench her fists and squeal through gritted teeth. There's no depth to her character at all. But the film does try and provide some complexity by not providing a clear answer as to whether this was rape or just rough sex - she says no as the carnie rips her clothes off, but once he's on her she begins shouting yes and encouraging him. And the entire flashback occurs as her 'son' squeals with excitement as he asks her to tell more of the story. But the film never adequately explores Russell's emotions. She's screwed up and that's that. And you can feel the film running out of ideas. At the end the film suddenly tries to turn into a thriller. Ooh, look at Martin destroy Henry's train set like Godzilla. Ooh, where did Martin go? Oh, there he is, he's jumped naked onto Henry and is stabbing him to death. Great. Oh, but seeing as Martin doesn't really exist, it never really happened...did it? The end of the film sees Russell all spruced up and apparently ready to get own with a new life, one without Henry. But even though we continually hear him call her, the question still remains as to whether he's still alive - one of the final images is of blood spreading over the surface of the ceiling. Yes Martin didn't kill Henry, but prior to this death scene we see Russell walking up the stairs with a knife. Maybe she killed him and maybe the voice of Henry is in her head. But what does it matter? Either way the film says the same thing: isn't it terrible when you get nailed by a tattooed carnie as a kid and your child is taken away, and isn't it awful when your husband plays with toy trains and you aren't sexually compatible. Yes, terrible fates both of them, but both made terribly uninteresting by horrible acting and direction.",
         "The plot is wacky enough to promise a great film: a repressed alcoholic middle-class housewife with incestuous tendencies, married to a doctor with infantilism tendencies, encounters a young English guy who turns out to be her lost son (fruit of a teenage rape, whom she had to give for adoption). But it's not clear what's real & what's not. Freud would be proud. The bad thing is seeing how generic Hollywood-ian Nicolas Roeg's direction has become. There really is very little here that reminds of \"Don't Look Now\" or \"Bad Timing\". Not that it's not worth watching. The spanking sequence is hilariously disturbing, the film has the feel of a hysterically surreal 80's soap opera, and the interplay between past, present, reality & fantasy is sometimes inspired. In fact David Lynch ended up copying lots of stuff from here, particularly on \"Twin Peaks\" and \"Lost Highway\". Notice for example the demonic rape scene, or the merging of the truck driver and lost son characters.",
         "In a small southern American town, housewife Linda Henry lives a unsatisfied life and wants a child to fulfil that gap, but her husband Henry seems more concerned about his model trains and receiving his fetish spanking from nurse Stein. One day in a diner, an odd and mysterious young English lad Martin approaches Linda and her friend. He seems to appear where she is, so when another confrontation eventuates. He admits to being her son, which he was taken from her at birth when she was a teenager, due to the reasoning of his conception. This newfound responsibility is bittersweet for Linda, but has it come at a price for her well-being. Bizarre, extremely bizarre\u0085 and sultry! Nicholas Roeg's \"Track 29\" is really hard to fathom, which can make it quite frustrating, due to the fact the pieces of this hysterically traumatic psychological puzzle never come to be one. Maybe that was on purpose, as the dysfunctional characters (usually lurking in small town settings) we follow seem rather disconnected, never quite sure of themselves and longing for something which could lead to an emotional breakdown. This exploration into the protagonists' wavering consciousness brings out many facets, like revelations of the past and those things that matter most for them to feel anything. The obsessive nature takes hold, where torment and frustration develops with neurotic results, which could finally lose out to fantasy, because reality and their situation is just to hard to come to grips with. Because of that, Dennis Potter's unbalanced, warped screenplay really does put you on the spot and throws around plenty of eye-boggling surreal passages. Symbolic clues feature thickly throughout and the themes that drown the moody, but complex script leave a strong imprint. While I don't think it's all-successful in conveying its ideas, it's still very interesting to watch. Building it up is the unusual kinky charge, perversely pitch-black humour and a terror-away performance by the nutty Gary Oldman. Boy, Oldman annoys with his infantile portrayal, but that peculiar intensity he generates and his edgy rapport with co-star Theresa Russell has you hypnotised. The two have some curious exchanges. Russell projects a fully realised performance, that bubbles, but you also feel her growing pain and uncertainty of her fragile character. Too bad about the southern accent though. Christopher Lloyd goes offbeat too, but more so in an understated and controlled turn. Sandra Bernhard's Nurse Stein makes an impression. Roeg's leisurely paced direction might not be as beautifully visceral, but winning out is a very gleeful and excessive approach that's high quality. Like Oldman's character, Roeg lets it play out like a kooky tantrum with a lingering mean-streak. The leering camera-work seems to hover on its shots awkwardly, or give it a smothering feeling, and the simmering music score is been kept under-wraps. Another original and provocative piece of work into the realm of surrealistic ambiguity combined with expressive allegories and a sensually twisted flavour. This one really challenges the viewer (like most of Roeg's work), then highly entertains.",
         "Nicholas Roeg's \"Track 29\", while confusing and frustrating, appears to accomplish what the director and writer set out to do. The film introduces and examines many aspects of Linda's life that are never very clearly answered. If Martin is a figment of her imagination, what is truly imagined? He does appear at the hamburger stand, so is he real after all? Early in the film, a television program is overheard discussing the idea that \"two things may ocupy the same time and space\". If this is indeed true, than maybe one thing can ocupy more than one time and space. It appears that Linda and Martin may in fact be \"exploring\" alternate dimensions. The film seems to explore the occurrence and outcome of many different events, and ends with the viewer unclear about what truly happened and what did not. After undergoing real or imaginary emotional torture, Linda calmly collects herself and leaves the house a new woman. To further confuse the lines between imaginary/real, her husband is heard calling to her, even though a pool of blood is forming over her head. (presumably from the stabbing death of the same husband) It is through these very strange events and ideas that the director and writer force the viewer to attempt to decide what is real and what is imagined. The most frustrating thing of all is that there is no real answer to this question.",
         "A woman suffers mental trauma twenty years after being raped - at least that's the most obtainable synopsis for this bizarre but entirely unengaging drama. Theresa Russell plays the bored housewife, trapped in a passionless marriage with doctor Christopher Lloyd. When a man claiming to be her son - stolen from her arms at birth after the rape - appears out of nowhere, knowing an awful lot about her, it releases the trauma she has kept hidden for so long. What should be intriguing is anything but. It is impossible to care for Russell because she's embarrassingly bad. Lloyd has nothing to do (never mind nothing funny). The young Oldman is shown up in this most difficult of roles. That's probably thanks to the director more than himself. Roeg's output is horribly inconsistent. You would have hoped that working from a script by the late, brilliant Dennis Potter would have inspired him to make a masterpiece. He can't even keep the film on the ground. But then again, the Americans never got a grasp on Potter's humour. And Roeg has hardly been worth watching since he went to the States.",
         "A young man is going around provincial USA searching for his mother that he never saw. As soon as he was born his young and careless parents sent him to mental hospital. Now Gary Oldman is free to go so he decides to find his mother, the one he was missing all those mental hospital days. His mother Linda (Theresa Russell) lives in American dream but doesn't seem to be happy. Her husband is fond of collecting railways for children. Sure, he has one of the largest railway-toy system in the whole state. He is proud of his railway model and pays more attention to his railway-world than to his young wife. Who used to have some nasty experiences before became a noble woman. But all that world is just smashed by the coming of that crazy son, who wants the revenge for such unhappy childhood. Finally Mummy lets her successful husband to meet her naughty son. Great, rather cynic, cold black humour film. www.myspace.com/neizvestnostlab",
         "Linda is a bored housewife whose husband shows no interest in her. She wants a child and is haunted by the memory of the baby she was forced to give up from a teenage pregnancy. But when a strange young man named Martin suddenly appears, claiming to be her long lost son, is he who he seems to be, or is she starting to lose her mind ? I really like movies about the strangeness of the mother-son relationship (Psycho, The Manchurian Candidate) and this, from the pen of the brilliantly perverse Dennis Potter, is possibly the strangest. Its clever touch is in never explaining the Oldman character; he probably only exists in Russell's head, but equally he might be real, or he might be just a calculating psychopath (Potter used the same idea in Brimstone And Treacle, where the character is also called Martin). But as a metaphor for both Oedipal repression and the desire not to grow up (slyly mirrored in Lloyd's obsession with toy trains), he is endlessly fascinating and Oldman's histrionic performance is sensational. Russell too is amazing, in an impossible part, playing the whole movie with her eyebrows lowered quizzically, and the sexual tension between her and Oldman is incredible. Purists may claim their ages are wrong - he's too old and she's too young - but they are perfect casting, and Lloyd and Bernhard provide great wacky support, almost as if they are in a separate movie of their own. I love all the witty maternal references in this movie; it starts with John Lennon's song Mother (he was raised mostly by an aunt), the trucker's tattoos, at one point Oldman mashes a knife into an egg and at another he plays the old traditional song M-O-T-H-E-R on the piano, the clips from the erotically-charged Cape Fear on TV, etc. Beautifully shot by Alex Thomson throughout, with all sorts of clever visual tricks to keep us guessing at the characters' mental states. Produced by Rick McCallum (of Star Wars fame), funded by George Harrison's Handmade Films and shot at the DeLaurentiis Entertainment Group studios in North Carolina. This is a great primal scream of a movie, in equal parts bamboozling, funny and thought-provoking, with one-of-a-kind performances; a film for all mothers and sons to see, although probably best not together. This was the fourth of Roeg's six intriguing movies with his former wife Russell, and for my money their best one together (although they both made better films separately).",
         "A doctor's wife (Theresa Russell) tires of his obsession with model trains, and spends her days wondering about the son she gave up for adoption at birth... How can you not love a film with Christopher Lloyd as a masochist doctor who drops his pants? And Gary Oldman as a weird, British man-child? And directed by the wonderfully under-appreciated Nicholas Roeg (\"Don't Look Now\")? Well, with this film, it is possible. Janet Maslin has more than a few problems with it, as she says \"the direction is so laden with contempt for the characters... Roeg's films can often be perverse... (but) they are rarely this silly.\" The film is \"too mindless to have any impact\" and she believes the actors' skills are \"regrettably wasted\". I will agree with that last point -- for as much as I love Oldman and Lloyd, I felt they were too confined by this film to really show off. Roger Ebert gave the film three stars, despite saying he did not like it. He posits the idea that the film is \"perhaps deliberately\" unlikeable. Yet, the film is still a good one and \"more interesting\" because of it. Roeg's work is \"strange\" and \"convoluted\", as well as \"bad-tempered, kinky and misogynistic.\" While I am unsure of all that, I do agree with the overall point Ebert makes. I, like him, did not enjoy the movie. Yet, I see the psychological message it was trying to send, the odd symbolism and the cacophony of images. The direction is, in fact, top-notch. Oldman is frustratingly annoying, but that is who his character is. I think the goal was met, despite being a goal I had rather they were not striving for."
      ],
      "genres": [
         "Drama",
         "Mystery"
      ],
      "productionCompanies": ["HandMade Films"],
      "summaries": [
         "A doctor's wife tires of his obsession with model trains, and spends her days wondering about the son she gave up for adoption at birth. While eating at a roadside cafe, she encounters a British hitchhiker, who turns out to be her son. They spend time together trying to find a bond. The son begins to hate the husband, and the wife begins worrying about the safety of her husband and his train set.",
         "For this psychological drama, Dennis Potter reworked his 1974 TV play, Schmoedipus, transposing the setting from London to the United States. The title \"Track 29\" is taken from the lyrics of \"Chattanooga Choo Choo.\" Distraught and dreamy Linda Henry complains to her husband, surgeon Henry Henry, about their sex-less, childless marriage, but he's obsessed with his basement model railroad layout and also engaged in an affair with a nurse. When mysterious stranger Martin drops in on Linda, he claims to be her long-lost illegitimate son. As seen in flashbacks, the 16-year-old Linda was raped at a carnival by a man who resembles Martin. Subsequent events hint at Martin as a delusion, a product erupting from Linda's fantasy world."
      ],
      "budget": 5000000
   },
   "movielensId": 4556,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-05-15",
      "dvdReleaseDate": null,
      "directors": ["Nicolas Roeg"],
      "runtime": 86,
      "movieId": 4556,
      "title": "Track 29",
      "mpaa": "R",
      "actors": [
         "Theresa Russell",
         "Christopher Lloyd",
         "Colleen Camp",
         "Sandra Bernhard",
         "Gary Oldman",
         "Seymour Cassel",
         "Leon Rippy"
      ],
      "imdbMovieId": "0096294",
      "originalTitle": "Track 29",
      "genres": [
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["C71Df240VZE"],
      "plotSummary": "Years after a desperate teenage Linda gives up her baby for adoption, she finds herself face-to-face with Martin, a young man claiming to be her long-lost son. Linda embraces Martin and in him finds a welcome reprieve from her unhappy marriage to the neglectful Henry. But soon Martin grows violent and becomes obsessed with Henry -- a philandering man whose only offspring is an expansive model train set that devours his waking hours.",
      "tmdbMovieId": 41974,
      "avgRating": 2.9,
      "releaseYear": "1988",
      "numRatings": 55,
      "posterPath": "/3V9PpZyxg9vzs6VW1vTrZ6x5Rvi.jpg"
   }
}