{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monk",
            "id": 345
         },
         {
            "name": "nun",
            "id": 745
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "orphanage",
            "id": 6783
         },
         {
            "name": "ringer",
            "id": 8945
         },
         {
            "name": "money",
            "id": 10594
         }
      ],
      "imdb_id": "tt0457510",
      "video": false,
      "title": "Nacho Libre",
      "recommendations": [
         9957,
         13260,
         9718,
         9955,
         11543,
         11017,
         13257,
         8193,
         10663,
         10402,
         11453,
         11857,
         9429,
         10878,
         13595,
         10074,
         2179,
         9750,
         4953,
         6575
      ],
      "backdrop_path": "/cb73g9x8mUyxkW0G13wkGo4UoMG.jpg",
      "revenue": 80197993,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Nacho",
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b1fe7",
               "name": "Jack Black",
               "profile_path": "/vMXgtzMdt2jSAjOECFQ5F53blbr.jpg",
               "id": 70851,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sister Encarnación",
               "gender": 1,
               "credit_id": "52fe44ecc3a36847f80b1feb",
               "name": "Ana de la Reguera",
               "profile_path": "/lMFcS5MT1NNDo6gSE6h78nkeMmU.jpg",
               "id": 57409,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Esqueleto",
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b1fef",
               "name": "Héctor Jiménez",
               "profile_path": "/gdPEBAWjybV1eBp4qvFg2dj410j.jpg",
               "id": 57410,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Chancho",
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b1ff3",
               "name": "Darius Rose",
               "profile_path": null,
               "id": 57411,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Juan Pablo",
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b1ff7",
               "name": "Moisés Arias",
               "profile_path": "/ePxOMBZwY0dCYZm3VKa1CyghaWz.jpg",
               "id": 57412,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Segundo Nuñez",
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b1ffb",
               "name": "Carlos Maycotte",
               "profile_path": null,
               "id": 57413,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Guillermo",
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b1fff",
               "name": "Richard Montoya",
               "profile_path": "/6aXusAwLuIEfUvhIlcfp7fPwZJM.jpg",
               "id": 57414,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ramses",
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b2003",
               "name": "César Barrón",
               "profile_path": "/q1Ew2BhMp0ippxKmjYsycVJwdDr.jpg",
               "id": 57415,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Elderly Monk",
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b2007",
               "name": "Rafael Montalvo",
               "profile_path": null,
               "id": 57416,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Snaggle Tooth Monk",
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b200b",
               "name": "Julio Sandoval",
               "profile_path": null,
               "id": 57417,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Emperor",
               "gender": 2,
               "credit_id": "57be71d5c3a3682a7a003d88",
               "name": "Peter Stormare",
               "profile_path": "/dDR0brp5L7fXDyEywrhjQv01LSg.jpg",
               "id": 53,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b1fd7",
               "name": "Jared Hess",
               "profile_path": "/sQsIDQEpPl1ZAUcK6nqRSj4RSZ9.jpg",
               "id": 53925,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b1fdd",
               "name": "Jared Hess",
               "profile_path": "/sQsIDQEpPl1ZAUcK6nqRSj4RSZ9.jpg",
               "id": 53925,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b1fe3",
               "name": "Jerusha Hess",
               "profile_path": "/yS21FRsuK12aIZkOSqnDM2ko0SJ.jpg",
               "id": 57408,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b2011",
               "name": "Jared Hess",
               "profile_path": "/sQsIDQEpPl1ZAUcK6nqRSj4RSZ9.jpg",
               "id": 53925,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b2017",
               "name": "Jerusha Hess",
               "profile_path": "/yS21FRsuK12aIZkOSqnDM2ko0SJ.jpg",
               "id": 57408,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44ecc3a36847f80b201d",
               "name": "Graciela Mazón",
               "profile_path": null,
               "id": 11425,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b2023",
               "name": "Billy Weber",
               "profile_path": null,
               "id": 909,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b2029",
               "name": "Gideon Ponte",
               "profile_path": null,
               "id": 32036,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b202f",
               "name": "Xavier Grobet",
               "profile_path": null,
               "id": 40545,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b2035",
               "name": "Steve Nicolaides",
               "profile_path": null,
               "id": 9249,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b203b",
               "name": "Mike White",
               "profile_path": "/cbwwGeYAUJuSFB95i7TL98LPRRc.jpg",
               "id": 17735,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b2041",
               "name": "Jack Black",
               "profile_path": "/vMXgtzMdt2jSAjOECFQ5F53blbr.jpg",
               "id": 70851,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ecc3a36847f80b2047",
               "name": "Mike White",
               "profile_path": "/cbwwGeYAUJuSFB95i7TL98LPRRc.jpg",
               "id": 17735,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.935858,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9353,
      "vote_count": 448,
      "budget": 32000000,
      "overview": "Nacho Libre is loosely based on the story of Fray Tormenta (\"Friar Storm\"), aka Rev. Sergio Gutierrez Benitez, a real-life Mexican Catholic priest who had a 23-year career as a masked luchador. He competed in order to support the orphanage he directed. The producers are Jack Black, David Klawans, Julia Pistor, and Mike White.",
      "similar": [
         9291,
         2300,
         86130,
         11287,
         22881,
         10637,
         104,
         323677,
         17108,
         10474,
         5693,
         21972,
         26602,
         319888,
         9955,
         9767,
         9563,
         10158,
         13680,
         10393
      ],
      "original_title": "Nacho Libre",
      "runtime": 92,
      "poster_path": "/lNue9evMBzqjWE4tJmUegkep8Qs.jpg",
      "spoken_languages": [
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": "/m31fQvZJuUvAgxoqTiCGYFBfZYe.png",
            "name": "Nickelodeon Movies",
            "id": 2348,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Black & White Productions",
            "id": 2777,
            "origin_country": ""
         }
      ],
      "release_date": "2006-06-16",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "He's not lean. He's not mean. He's nacho average hero.",
      "adult": false,
      "homepage": "http://www.nacholibre.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jared Hess"],
      "runtime": 92,
      "synopsis": "Ignácio (Jack Black) is a young orphan boy dreaming of becoming the world's greatest luchador (Spanish wrestler) and decides to test his fighting skills in a monastary graveyard. He is discovered by monks and is taken to be cleansed and made into the orphanage chef. This does not bode well for young Ignácio, but he does his duty and continues to do so even after fifteen years, although not entirely successfully.. As an adult, Ignácio still dreams of becoming the ultimate luchador, but has been taught that wrestling is a sin. To make matters worse, he meets his soul mate, a nun, Sister Encarnación (Ana de la Reguera) who has been hired as the orphans' teacher. He is smitten with her, but knows the relationship will never work for they both have take an oath of celibacy. Nevertheless, he goes to speak with her and invites her to have toast with him in his quarters, but is interrupted by the lead monk (Eduardo Gómez) who tells him to visit a man sick with influenza. Ignácio reluctantly obeys. Upon arriving at the man's house, Ignácio meets the man's wife, but sees that the man is apparently dead. He begins to give a eulogy, but as he does so, the man awakes from a deep sleep. This terrifies Ignácio and he leaves to take care of other duties. As he travels through the village on his trademark chariot (a motorized chariot-like shopping cart), he stops at a local eatery to pick up the free chips that the restaurant's owner leaves each day for the orphans. He is unexpectedly attacked by an extremely skinny street urchin (Hector Jiménez), who steals the chips and leaves Ignácio bruised and disgraced. That night, on the way back to the orphanage, Ignácio witnesses a luchador, the great Ramses (Cesar Gonzalez), being adored and worshipped by his many fans. Ignácio finds out that a tag-team tournament will be offered to new luchadors, and this grabs the attention of our dismayed hero. Ignácio and Encarnacion later enjoy toast in Ignácio's quarters and he sheds some light on his past. He then goes on to tell Encarnacion of his feelings about the monastary, and tells her of the luchador he encountered in the village. She tells him that luchadors are false idols, and to be patient, for his passion to fight should soon pass away. The next day, the monks complain about the missing chips. Ignácio tries to explain the situation, but his efforts fall on deaf ears. Angered, Ignácio leaves the monastary and heads to the village with a handful of leftover chips. He throws them into the alleyway where he was previously attacked. He waits behind a wall for the homeless assailant to pounce. He almost succeeds in sneaking up on him, but gives himself away when he breaks wind. He tackles the man and they begin to fight. During the fight, Ignácio asks the man if he would join him in the tournament. At first, Steven, the homeless man, ignores the proposition, but after hearing that there is a grand prize of two hundred pesos, he decides to team up with Ignácio. They make two makeshift luchador uniforms out of stolen items, train themselves with unusual methods, and then enter into the tournament. Ignácio and Steven now go by the names Nacho and Esqueleto (Nacho is a nickname for Ignácio; Esqueleto means \"skeleton\" in Spanish which suits malnourished Steven perfectly), and face their first two opponents, El Semental (Ignácio Camarena) and El Pony (Carlos Barroso). Esqueleto is struck down by El Semental, but Nacho gives El Pony a run for his money. At one point, it seems that Nacho and Esqueleto are nearing victory, until Nacho is knocked unconcious by El Semental. Although they failed to win the tournament, Nacho and Esqueleto are given a well-portioned consolation prize. Nacho spends his part of the winnings on better food for the orphans' meals, and begins to draw out plans for a new uniform, a baby-blue and red one. Luckily, Steven has a knowledge of sewing and helps Ignácio create their new outfits. Chancho (Darius Rose), an orphan child, catches Nacho trying on his outfit in the monastary, but promises to never tell a soul. As Nacho and Esqueleto prepare for their next fight, Nacho hassles Esqueleto about his beliefs in science, and not in the Lord. He unofficially baptizes him, and then they head on to the fight. This time, they are pitted against two midget wrestlers known as Satan's Cavemen (Agustin Rey and Ricardo Castillo). Although they are small, they prove worthy adversaries for our heroes, and after a struggle they defeat Nacho and Esqueleto. Once again, however, the duo are paid a hefty consolation prize. This time they spend their cash polishing up their physical appearances. Ignácio buys new clothes and boots, and Steven gets a pedicure and a charicature. Ignácio tells Steven about his feelings for Encarnacion, and Steven concocts a plan. He proposes that Nacho should take Encarnacion on a date, and that he would show up with some of his hobo buddies to beat Nacho up, but that they would let him win. Ignácio likes the sound of this idea. That night, Ignácio takes Encarnacion out, by telling her that he wants both of them to minister to a bum he claims he saw previously. Once they get there, Nacho says a few cheesy lines, but then notices two gentlemen walking down the street. Thinking that they are Steven's friends, he challenges them to a fight. They ignore him, but he runs up to the two men and rips one of the mens' jackets. They turn and face Ignácio, but he is already in his fighting position. However, he hears Steven's voice far off and sees him with his real hobo friends. This distracts Nacho, giving the two men enough time to sucker-punch Ignácio, knocking him unconscious. The next day, Nacho is humiliated and expresses his anger at Steven for being late. Steven feels bad for Ignácio, and tells him about a secret water gypsy who uses magical eagle eggs to grant peoples' desires. Nacho sees this as an opportunity to gain power as a luchador and the two embark on a journey to see the gypsy. When they arrive, they sail over to a cliff in the water where an eagle's nest is precariously perched. The gypsy tells Nacho to climb the cliff and to eat one of the eggs, and that this will give him the strength he needs. Ignácio makes the strenuous and difficult climb to the cliff's peak, and cracks open an egg and swallows the yolk inside. He then dives off the cliff into the sea below. Contrary to the gypsy's promises, Nacho and Esqueleto's next fights against the luchadors Paradise (Albert Madrid), Sage (Lauro Chartrand), and many others prove disastrous. Nacho feels that he was lied to and tells Esqueleto that they need to go pro if they wish to advance in their wrestling careers. He makes a plan to go to a party being thrown by Senor Ramon (Enrique Munoz), the best manager in wrestling. The next day, Ignácio takes the orphans on a field trip to see the village. He humorously gives insight into the town's various locales, and then he and the orphans see Ramses and other luchadors leaving the gym. The orphans ask Nacho to get Ramses's autograph, but after trying to persuade the wrestler for his signature, Ramses gets annoyed and shoves Nacho into a melon cart. Nacho then gives up trying. That night, after Steven once again sews new outfits for himself and Ignácio to wear to the party, Ignácio tells Encarnacion not to worry about getting the orphans food, but that he would do this himself. Nacho and Esqueleto then head to the party. After failing to get past the party's bouncers, Ignácio boosts Steven over a wall so that he can get in. Although Steven cannot lift Nacho, he is able to sneak in by pretending to be a member of the hired mariachi band. Steven strikes up a conversation with Senor Ramon, who who tells him about an upcoming tournament known as the Battle Jam. The winnner of this competition receives eight hundred pesos, and is given a chance to fight against the current champion, Ramses. Steven accidentally attracts the attention of Ramon's plus-sized daughter, Candidia (Carla Jimenez), and she is instantly love-struck. Meanwhile, Ignácio tries his best to pretend to play the bass guitar with the band. Steven goes upstairs to relax and finds Candidia's extensive doll collection. He accidentally breaks one of the dolls, but is surprised to find Candidia sitting right next to him in the room. She instantly forgives him. Naturally, Steven asks how she got upstairs so fast. Her reply is that she installed secret tunnels throughout the house. Obviously freaked out, Esqueleto makes a mad dash to leave, but Candidia travels down her secret tunnel. At the same time, Ignácio is asked to sing a song, so he makes one up right on the spot. However, his composition doesn't go over well, and Ramses shows his disapproval by pouring out his wine on Nacho's shirt. Screams can be heard over the crowd though, and Nacho goes over to see what the matter is. He finds that Candidia is trying to pull Steven into her secret tunnel, and tries to help by slamming her with his bass. He misses, and accidentally hits Steven. The two are then kicked out of the party. As they travel back to the chariot, they see two rival luchadors, whom Nacho and Esqueleto almost beat, slashing their tires. They engage them, but keep their disatance because their foes have knives. Steven uses an ear of corn he had been munching on as a projectile, and lands it in his foe's eye socket. The duo push the cart back to the orphanage, and then Nacho remembers that he forgot to the get the groceries. It's too late to go back however, because it is now approaching daybreak, so he takes his anger out on Steven. He blames him for his shortcomings and Esqueleto replies by saying that he hates all the orphans in the world. Later that day, Ignácio attends mass and prays for forgivness and that God would bless him in battle so that he could win money for the orpans. He goes to light a candle at the altar, but accidentally sets his robes on fire. The congregation sees the luchador outfit Nacho was wearing underneath his robes, and soon realizes what he has been doing. Nacho tells the monks and Encarnacion about his plan to win the Battle Jam and give his winnings to the orphans for all of their needs. He leaves the orphanage to go to the Battle Jam, where he must fight several fighters all at once. The fighters include Silencio (Donald Chambers), El Snowflake (Craig Williams), Dynasty (Brett Chan), El Chino (Mike Ching), Muneco (Abelardo Hernandez), Carlos Rosales (Emiliano Quiroga), and his trusty companion, Esqueleto. Dynasty, El Snowflake, Muneco, and Carlos Rosales are defeated in the beginning, and Silencio takes out El Chino and Esqueleto at the same time. Nacho approaches Silencio but for some odd reason, Muneco trips Nacho from outside of the ring causing Nacho to fall in front of Silencio. Silencio picks Nacho up and then drops him, once again knocking our hero unconcious, also once again leaving him defeated. Nacho sullenly returns to the orphanage and decides to give up wrestling and spend the rest of his days in the wilderness. Chancho gives Nacho his lucky machete (his mother gave it to him before she died) and then Nacho heads into the wilderness. Ignacio creates a makeshift shelter and lives off of cactus water. The next day, however, Steven drives into the wilderness on the chariot and tries to persuade Nacho to come back to wrestling. As it turns out, it was easy for him to find Nacho because although he thought he was in the wilderness, Nacho was really right next to a small village. Esqueleto tells him that Silencio cannot fight Ramses because he got injured (which is humorously shown in a clip where Esqueleto runs over Silencio's foot with the chariot after Silencio was mean to a poor orphan child) and that Nacho gets to fight Ramses because he came in second place. Nacho is reluctant at first, but agrees to fight him. Ignácio writes a letter to Encarnacion which Steven delivers, which tells her of his love for her and of the fight he will be in against Ramses. While in the locker room, Nacho sings a very comical song to Esqueleto which he wrote for Encarnacion, but he is interrupted by an arena worker who tells him that the fight will now begin. Nacho goes into the ring and the battle against Ramses commences. Although there are many close calls, Nacho makes it to the second round. Ramses ignores the bell and begins an all-out street fight against Nacho. Ramses seems to have Nacho pinned until Encarnacion enters the arena with the orphans. The sight of his lover gives Nacho the strength to fight back, and he eventually flings Ramses out of the ring. Nacho then climbs up one of the corner pillars of the ring and dive-bombs towards Ramses. It is here that the eagle powers finally kick in and give Nacho the needed air time to reach Ramses and put him into an unbreakable submission. Against all odds, Nacho comes out victorious and is declared the luchador champion. A week later, Nacho takes Encarnacion, Steven, and the orphans on a field trip to see the Mayan pyramids of Chichen Itza in a newly-purchased bus and closes out this movie with a somewhat disturbing smile.",
      "writers": [
         "Jared Hess",
         "Jerusha Hess"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0457510/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1OTQxNTk4NV5BMl5BanBnXkFtZTcwNDQzMjYzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jack Black, Ana de la Reguera, Héctor Jiménez | See full cast and crew »"],
      "reviews": [
         "Honestly people, get over it. Stop being so damn sensitive, suddenly people think everything is racist. People are so busy tripping over themselves trying to be politically correct all the time, it's ridiculous. Nacho Libre is not being racist. It's telling the story of a guy who lived in an orphanage and became a wrestler to save it. Take it for what is it...a movie. Yes, Jack Black's accent is annoying...but guess what...it's a comedy, it's supposed to be one of the things that makes people laugh. It's not supposed to be realistic so stop thinking that it has to be. Go watch the movie. It's funny and Jack Black is priceless.",
         "Much to my surprise, as I begrudgingly went to the movies with my 12 yr old son, I LOVED this film. I expected nothing, yet in return, I received a wonderful 1 hour and 40 minute respite from the real world, filled with slapstick humor and total silliness. Slapstick humor always walks a tightrope between bad taste and belly laughs. The Three Stooges are mind-numbingly inane: most laugh intensely and some never get the joke. Laurel and Hardy isn't for everyone either. Nacho Libre is not filled with Woody Allen irony, it doesn't have Christopher Guest's drollness, and it's not James Brook slick. It's not sophisticated humor! How can any film featuring Jack Black as a Mexican friar/fryer/wrestler/wannabe wooer ... all for the \"good of the orphans\" be taken seriously? It's simply for the 12 year old boy in all of us who laughs when Moe hits Curly and laughs when fat guys, even with over the top Mexican accents, are paired with skinny guys ... in a wrestling ring ... with stretchy pants. I originally wrote this as a reply to a poster who asked if the mean IQ of people who liked this was 93, but the post was subsequently deleted. But to him I say, \"By the way, I'm a physician and my IQ is a tad over 93. But even if I had no job at all and even if my IQ was 93 ... who cares ... I laughed, with my son, eating popcorn, in the dark. And that's the joy of sharing a movie like this.\" No es?",
         "Preface: I will avoid giving specifics on the movie in this review. There is nothing more damaging to a comedy that knowing the jokes before hand. Since I liked this movie, and it was funny. I shall shy away from spoilers. Jared Hess shoots his movies like a funny David Fincher. His obsession with grime and dirt and everything looking old and decrepit, is almost fetishistic. But he has grown a lot since we last saw his work, (shooting extreme close-ups of steak and tater-tots in Napoleon Dynamite). Not to sound cruel, but I was surprised while watching his latest effort, Nacho Libre, because, well\u0097it looks like a \"real\" movie. There is dynamic lighting, proper shot composition, and interesting camera movements. I guess a budget increase from $400,000 to about 38 million makes a difference. Oh, and by the way, the movie is very, very funny. I'm talking cola out your nose funny. Starting with the addition of (the brilliant) Mike White to his writing staff, Hess has crafted a much more cohesive and narratively satisfying film.Though it does keep the skit-ish nature of Napoleon Dynamite, stuff actually happens in this film. The movie, (apparently based on a real monk, though the end of the credits state that the film is totally fictitious) tells the story of Ignacio (Nacho for short), an orphaned boy who becomes a monk at an orphanage. Nacho is in charge of \"Cooking duties and\u0085dead guy duties\" and is generally looked down upon by the other monks and priests, though the children love him. After the orphans nacho's are stolen by a homeless man and the head priest humiliates Nacho for his pitiful meal preparation skills, Nacho--who's greatest love in life is masked luchador wrestling\u0097decides to enter a tag team match, with the thief as his partner. They lose, horribly, but discover that even the losers get paid. And with money, Esqueleto, the street urchin (and yes, those are his real teeth) can live comfortably and Nacho can buy better food for the orphans. Orphans who are hilariously always referred to as \"the orphans\", as if to constantly reminding them of their misfortune. Also, during all of this, Nacho is trying to woo the new girl, Encarnación, who just happens to be a nun with the same name he has. Given the current battery the Catholic Church is taking in public opinion, it is nice to see a movie that never once mocks the religion. Sure, there are priests who have the hots for Ana de la Reguera. But the she is so dumbfoundingly gorgeous, it would be silly for any man, much less one who must be celibate, to not at very least look twice at her. The church here is played as a wholesome, good place. There is never any salacious undertone to the scenes between the priests left alone with small children, and nobody \"gets\" the girl in the end, so all the general morals are upheld. Also, it is nice to see a movie about Latin culture starring\u0097gasp\u0097Latinos! Everyone in the movie, except Black, (who is actually playing a white guy, not a Mexican as many IMDb posters have postulated) is of Hispanic origin. And the culture comes off well. Beck does a few wonderfully fun songs for the soundtrack, and Danny Elfman's score is his best in years. (ironically, shortly after I wrote this, I discovered that he had taken his name off of the film because he was unhappy with the way his work was presented). There is a general irrepressible levity to the proceedings that is infectious. And though the movie meanders more than it should, you can't help forgive its shortcomings because it is so well natured. Oddly in contrast to this are the wrestling scenes. They come off as overly violent, and though this could have just been Mann's Chinese's killer sound system, I could hear bones crunch, and things looked painful. The action scenes aren't farcical like the rest of the film, though some of them are thrilling. Parents should be aware that this movie could be a bit scary for children under 9 or 10, and though the film has a more positive role for minorities and women than any film I've seen in a while; it does seem a little bit inappropriate at times. There is nothing sexual, and there are good morals to be found, but the movie does have a strong line of toilet humor and Punch and Judy level slapstick throughout. However, this isn't really a kid's movie. It is just a movie, that happens to be rated PG. It is made for teens and adults, but there is nothing objectionable enough as to keep kids out. Overall, Nacho Libre is a pretty damned funny movie, with a good heart and lots of laughs. Jack Black even gets to sing, a few times! And while it is less instantly quotable than Napoleon Dynamite it is a better film overall. If you like Jack Black, Dynamite, Wrestling, or your kids have already seen Cars and you want to take them to something else, this movie is about as good as you could hope for. Though not especially deep, it is exactly what I want when I go see a big summer comedy. Now I just can't wait for the Tenacious D movie. Post Script: Prepare to hear \"I only believe in science\" constantly after this film is released.",
         "I saw this at the LA premiere at the Chinese Mann Theater. The audience was laughing so much at times, it was hard to hear the film. Jack Black may at times go over the top but he more than makes up for it with some moments of real genius. Besides the obvious jokes there's an intelligent, awkward humor here for those who look for it. Some critics are saying the plot is too predictable. C'mon. This is often an issue with critics trying to take storytelling in comedies too seriously. If a comedy succeeds in making you laugh all the way through, who the heck cares? Were you going to this movie to feel suspense or to pee your pants laughing? If the latter, you'll love this film.",
         "It's good to know that farce is alive and well in the world. Since the mid 90's it feels like film makers have lost their grip on truly great weird comedy. Movies that speak to the few and turn off the rest. It seems that even as the tools to unlock our imaginations get flashier and flashier, and special effect budgets grow and grown, American film grow static and stale. Then when it seems like all hope is lost, a film like NACHO LIBRE comes along. Somewhere in Mexico, a young priest named Nacho (Jack Black) longs to be recognized. He's tired of serving the same bland food to the young boys in his charge. He's tired of being disrespected by the other priests. He longs to be a luchadore (a Mexican wrestler), and to gain the affections of the stunning Sister Encarnación (Ana del la Regura). Then when all hope is lost he teams up with a new friend named Esquelta, and takes the Mexican wrestling world by storm. Will the orphan boys get better food? Will Nacho win the heart of Sister Encarnación? Will he lose everything he has, on a quest to become a great warrior? Giving this movie its due will provide those answers and more. The movie not perfect. It's a little overlong and some of the jokes fall flat on their face. But there is an earnestness and a sweet gentility in the film that will win you over. You cannot enter this movie with the wrong attitude and if you don't like weird movie its not for you. But if you let it entertain you and if you give into the fact that it really bizarre, it will work. You have to take every scene with grain of salt and logic must be thrown out the window. But if you turn off that part of your brain that strives for everything to be plausible, than this film will entertain. Then for no apparent reason the movie does something I didn't quite expect, it begins to tackle a serious subject. Behind all the silliness is a story about how legalism traps us in a place of boredom and predictability. Whether it be religious legalism or secular legalism, NACHO LIBRE is about a misfit who succeeds because he goes out on a limb. He doesn't give up his religious fervor when the chips are down, when his atheist friend tells him to give into science and logic, and he doesn't give up on God because men of cloth treat him badly. He stays true to his faith and not his religion. This message is not beaten over the audiences head. This is not a religious picture. But it gives the film a dimension that I didn't expect. Director Jared Hess, doesn't stray to far from his Napoleon Dynamite roots. But that's okay. It works here and he hits the right comic tones. I can't wait for the DVD because I'm convinced that the film really needs to be viewed a second time. Knowing what to expect allows the audience to settle into Hess skewed comedy. The film is very dry and if you don't know what to expect its easy to dismiss the comedy and think the film is horrible. You have to work at it a little bit and let it sink in. But when you get it you'll love it. If you're looking for an hour and half of silliness you can't go wrong with NACHO LIBRE. It's cute, sweet, and you get to stare at Jack Black's upper torso for far too long. Trust me if you like weirdly sweet Mexican wrestling comedies this is the film for you.",
         "This movie is based on a real priest, Rev. Sergio Gutierrez Benitez. who has been in over 4,000 matches over the past 23 years. His ring name is Fray Tormenta (\"Friar Storm\" in Spanish)and he does wrestle under the mask in Mexico to support an orphanage. The story was on the CBS evening news and a couple of the news magazine shows several years ago. Every now and then you either see, or read something about him. I watch movies to be entertained. If I wanted \"deep thought\" I'd go to a library. This is Jack Black being Jack Black. The dialog is crude, humor slapstick, and storyline so, so. But it's funny. I wouldn't buy it for my personal collection, but it's good for an evening of rental movies at home.",
         "\"Nacho Libre\" contains much of the same dry, deadpan humor that made \"Napoleon Dynamite\" so much fun to watch. I'm sure Jared Hess's brand of humor is not for everybody. We're living in an era where Dane Cook is our top comedian. So if you're expecting the same loud, obnoxious gags you see in most comedies nowadays, you'll probably be disappointed. I, on the other hand, love this type of humor. Just like in \"ND,\" the actors don't try hard to be funny. Jack Black is not very convincing as a Mexican. With his skin so white, he sticks out like a sore thumb amongst the rest of the cast. But that's no big criticism. This is a comedy farce, and if his accent didn't sound so phony, I doubt his character would be nearly as funny. As an extra treat for all the \"ND\" fans out there, his character is paired off with a soft-spoken Mexican buddy. They make a good comic team, with Jack being so short and fat, and his buddy being so tall and thin. I tend to just roll my eyes at many of the crude gags I see in movies nowadays, but I even enjoyed the bathroom humor in this movie. I found myself laughing most of the way through, and this is one of the rare cases where I felt that the film lived up to its trailer. Some of the funniest gags were given away in the trailer, but there are many other funny gags that weren't. If I have any complaints, the movie does sort of drag in the third act. But all in all, \"Nacho Libre\" is good fun for the entire family. I can't wait to see Jared Hess's next project.",
         "I make no apologies for liking this movie. It seemed everyone at the video store, from the manager on down, all thought otherwise....but I took a shot, rented it, and laughed my butt off watching this film. Now I own it. Jack Black was hilarious as the monk-pro wrestling wannabe \"Nacho.\" The premise alone is humorous: an overweight Mexican monk who would rather be a famous wrestler. It doesn't say much for his spirituality, but it made for a lot of laughs. It's all outrageous, absurd humor, not meant to do anything but evoke laughs, at any cost......just harmless fun. Detractors should keep that in mind. I have no interest in wrestling but the wrestling scenes in this film had me constantly laughing out loud. Black's tag-team partner, \"Esquelito\" (Hector Jimenez) was just as funny as the main star, if not funnier. Just the look on his face with all his teeth sticking out was funny! I have no interest in being a monk, either, but I know none of these \"monks\" in here were realistic figures, especially the nun: \"Sister Encarcion\" (Ana de la Reguera ). No offense, but only in the movies are nuns this beautiful. Wow, Reguera looked like a cross between Penelope Cruz and a young Winona Ryder. And, she wasn't just beautiful, but a sweet lady, too. Although it's a comedy, the story had some nice touches of sentimentality and humanity, namely: \"Nacho's\" attitude adjustment, his genuine compassion for orphaned kids that the Brothers and Sisters took care of, and his basic desire to do good despite a very weak commitment to \"vows.\" Maybe that's why there are so many critics of this film: it wasn't mean-edged and nasty enough to satisfy them. However,those who appreciate good slapstick will like this movie. Also, if you appreciate bold, beautiful colors, you'll find this an attractive movie. There was a feast of brilliant colors shown. I was impressed how much effort was made to make this movie look nice in addition to getting laughs. In, a very, very pleasant surprise: much better than I ever hoped it would be....and recommended for those wanting a bunch of belly laughs for an hour-and-a-half.",
         "Saw this on a plane flight from Thailand to Japan, and it seemed as if I was the only one laughing. Once I found where this movie was coming from, it had me LOL and getting a few glances from others more interested in the food. Let me explain. Its not gag, punchline funny and was never intended to be. The understated dryness of visual gags and 'dead pan' delivery of dialog makes this movie totally ridiculous and a crack up! Black is great and pulls off some excellent poses. The movie is clever and artistically shot, adding even more depth to the humour. At worst this movie has a few slow spots, but it is peppered with some great 'laugh till there is dribble running out the side of your mouth' slapstick.",
         "If you didn't know a face is the good guy in wrestling. I'm a big fan of wrestling and I was afraid this movie might do wrestling a injustice but I was surprised by how good this movie was. It can be a bit slow and awkward at times but this is a excellent film. It is hilarious at times but as I have said at other times it can be a bit slow. It comes from the same people who made Napolean Dynamite and School of Rock, both two of my favorite movies and so I thought this should be similar, and it was but there were differences from those two films in terms of humour. Jack Black is, like in many of his other films, excellent in this. The rest of the cast is good and most of them were unknowns. It is laugh out loud funny and even if you don't like wrestling you will probably like this if you liked Napolean Dynamite."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Nickelodeon Movies",
         "Black & White Productions"
      ],
      "summaries": [
         "Nacho (Black) is a monastery cook, who spends his day feeding orphans and being overlooked by the monastery. When Sister Encarnación (Reguera) arrive at the monastery, Nacho realises that the only way to win her affection and to save the children, will be by competing as a Luchador wrestler.",
         "The monk Ignacio loves the orphan in the monastery and dreams on becoming a wrestler. He teams up with the bum Esqueleto and wears a mask to secretly fight in the arena for amateurs with the alias Nacho. They are losers but they receive money for the fight that Ignacio uses to buy better food for the orphans. When the gorgeous Sister Encarnación comes to live in the monastery, Ignacio has feelings for her. When the monks discover his secret, Ignacio is expelled from the monastery. Now he needs to win the number one wrestler Ramses to become a professional fighter.",
         "Nacho (Jack Black) is a young man who was raised in a orphanage in Mexico and now works there as a cook. Fueled by his passion for lucha libre wrestling, he dons a mask and cape and picks up a partner to compete in a local Lucha Libre tournament to try for the 200-peso prize so he can buy better food for the kids and achieve respect. When a new nun, Sister Encarnación (Ana de la Reguera), arrives at the monastery, he tries to win her adoration as well, all while attempting to prove that being a Luchador isn't a sin and win the grand prize at a battle-royale tournament so he can buy a bus for the kids.",
         "Ignacio is a monk who aspires to be a professional lucha libre wrestler, which is considered a sin at the orphanage where he works. He wrestles in hiding under the name Nacho for the children to help pay for their needs. The movie is what happens when he does this.",
         "Berated all his life by those around him, a monk follows his dream and dons a mask to moonlight as a Luchador (Mexican wrestler)."
      ],
      "budget": 32000000
   },
   "movielensId": 45666,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "2006-06-16",
      "dvdReleaseDate": "2006-10-24",
      "directors": ["Jared Hess"],
      "runtime": 92,
      "movieId": 45666,
      "title": "Nacho Libre",
      "mpaa": "PG",
      "actors": [
         "Jack Black",
         "Ana de la Reguera",
         "Héctor Jiménez",
         "Darius Rose",
         "Moisés Arias",
         "Carlos Maycotte",
         "Richard Montoya",
         "César Barrón",
         "Rafael Montalvo",
         "Julio Sandoval",
         "Peter Stormare"
      ],
      "imdbMovieId": "0457510",
      "originalTitle": "Nacho Libre",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["btfjTl7sEIg"],
      "plotSummary": "Nacho Libre is loosely based on the story of Fray Tormenta (\"Friar Storm\"), aka Rev. Sergio Gutierrez Benitez, a real-life Mexican Catholic priest who had a 23-year career as a masked luchador. He competed in order to support the orphanage he directed. The producers are Jack Black, David Klawans, Julia Pistor, and Mike White.",
      "tmdbMovieId": 9353,
      "avgRating": 2.71648,
      "releaseYear": "2006",
      "numRatings": 1984,
      "posterPath": "/lNue9evMBzqjWE4tJmUegkep8Qs.jpg"
   }
}