{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0097521",
      "video": false,
      "title": "Homer and Eddie",
      "recommendations": [
         101887,
         16486,
         26798,
         91471,
         17978,
         212967
      ],
      "backdrop_path": "/l8LB8nkMHl1ShhooxHqGYe3MLwU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Homer Lanza",
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b3d",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Eddie Cervi",
               "gender": 1,
               "credit_id": "52fe470cc3a36847f8120b41",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Edna",
               "gender": 1,
               "credit_id": "52fe470cc3a36847f8120b61",
               "name": "Anne Ramsey",
               "profile_path": "/24AFp6szxbyExOewAGrQIVJzlmN.jpg",
               "id": 49944,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Belle",
               "gender": 1,
               "credit_id": "52fe470cc3a36847f8120b65",
               "name": "Karen Black",
               "profile_path": "/xKtsATh6T64NJfE1io1AnofnFRi.jpg",
               "id": 8963,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Linda Cervi",
               "gender": 1,
               "credit_id": "52fe470cc3a36847f8120b71",
               "name": "Beah Richards",
               "profile_path": "/iJjXKrigq7w7zLl3nHnr4AUESjm.jpg",
               "id": 32774,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Tommy Dearly",
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b75",
               "name": "Tracey Walter",
               "profile_path": "/pMeImyAZ8fpQ32QyPO8g6W8gs13.jpg",
               "id": 3801,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Robber #1",
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b5d",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Cashier",
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b69",
               "name": "Pruitt Taylor Vince",
               "profile_path": "/p3xmcGJ7IKCxw42lwQbg4WmwPTA.jpg",
               "id": 3201,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Preacher",
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b6d",
               "name": "Wayne Grace",
               "profile_path": "/cLpzZ67EY36fChyzW83pjynoAfp.jpg",
               "id": 52145,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b47",
               "name": "Andrei Konchalovsky",
               "profile_path": "/6RzqNCx3ZaFCrVN7cfpB0trhdEQ.jpg",
               "id": 58728,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b4d",
               "name": "Patrick Cirillo",
               "profile_path": null,
               "id": 57988,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470cc3a36847f8120b59",
               "name": "Moritz Borman",
               "profile_path": null,
               "id": 20295,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "571f112dc3a3686c990017cc",
               "name": "James Cady",
               "profile_path": null,
               "id": 1140568,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "571f113e9251414df4001be5",
               "name": "Henry Richardson",
               "profile_path": null,
               "id": 10613,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "571f1147c3a368338c00256f",
               "name": "Robert MacDonald",
               "profile_path": null,
               "id": 33144,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "571f114f9251414df4001bed",
               "name": "Michel Levesque",
               "profile_path": null,
               "id": 41702,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "571f1116c3a368352f001a96",
               "name": "Lajos Koltai",
               "profile_path": null,
               "id": 47275,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "571f1135c3a368338c00256b",
               "name": "Eduard Artemev",
               "profile_path": null,
               "id": 1204438,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "571f1156925141052c001698",
               "name": "Katherine Dover",
               "profile_path": null,
               "id": 1494277,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "571f115fc3a368339300282f",
               "name": "Marty Hornstein",
               "profile_path": null,
               "id": 2504,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.989394,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46786,
      "vote_count": 16,
      "budget": 0,
      "overview": "A retarded man get help from a sociopathic woman when tries to reunite with his dying father, who years earlier disowned him.",
      "similar": [],
      "original_title": "Homer and Eddie",
      "runtime": 102,
      "poster_path": "/aMY8AQwUbZnUtpG5NTZooo7cvhG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Kings Road Entertainment",
         "id": 4255,
         "origin_country": ""
      }],
      "release_date": "1989-08-17",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrei Konchalovsky"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Patrick Cirillo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097521/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3MzUzMTgxNV5BMl5BanBnXkFtZTcwMzQwOTgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Belushi, Jim Mapp, John Waters | See full cast and crew »"],
      "reviews": [
         "Though it has been years since I have seen this movie, I remember it with affection and feel compelled to counter the sweeping dismissals of many reviews. In the bone-hard truth of the desert, humanity is stripped down to persistence, interdependence, and hope and faith in the absence of a visible destination. The road is a trajectory for self-recognition, catharsis, and redemption. And so, just as the desert surprises us with life in the most unexpected places, Homer and Eddie surprise themselves. Homer and Eddie are not that unlikely a couple. Neither has anywhere to go, figuratively or literally; so they keep on going. Neither has a future to look forward to, and yet each of them harbors hope. They do so because they are still alive, and moving and hoping are as basic to life as breathing. They did not choose each other's company, and they are no less prejudiced towards others for their own low station in society. Though a road movie, `Homer and Eddie' it is not of the usual sort. Violence here is not redeemed by a `good cause' or an undercurrent of sex appeal; vile speech is not tempered by youth or good looks; and there is no romantic involvement to offer distraction. Homer and Eddie are not Thelma and Louise. They have more in common with Lennie and George in `Of Mice and Men', or with Josué and Dora in `Central Station'. Sidelined by society for crime, poverty, terminal disease and mental disability, Homer and Eddie begin their companionship by default. Eddie reluctantly looks after Homer, like a parent after a stranger's child. As she takes on responsibility for someone more helpless than herself, Eddie senses a reawakening of her capacity to care (in every sense) for another human being and, implicitly, for herself. By defending Homer's human dignity, she recovers her own. Though it will not avert her fate, the experience restores Eddie's humanity. I found the film empowering because it takes its protagonists and their situation seriously. Homer and Eddie are not innocent. Nor are their shortcomings dismissible as picturesque, colorful, or cute. They don't try to be lovable; they simply are who they are. Their humor is that of people who believe they have nothing to lose. The film's perspective is level and from the inside out, not from the lofty perch of mainstream society. In that sense, it isn't judgmental, either, and so allows us to empathize with its outcasts. Their heroism is in their refusal to be victims, and in rising above their situation against all odds. This quiet and remarkably subtle piece is some of the best I have seen of Hollywood, and the tears I cried were those of joy and relief: No matter how low you sink in life, it is never too late to be a worthy human being.",
         "Unusual film was wrongly advertised as a wacky comedy; it is actually a surprisingly sensitive and light-on-its-feet drama about friendship. Mentally backward man (James Belushi, in his best performance) hits the road with an escaped female mental patient named Eddie (Whoopi Goldberg) who has a brain tumor and keeps thinking she sees Jesus going by. Sort of a tragic love story between two unfortunate people that life threw away. Both stars are just fine, but the sloppy editing shows signs of an indecisive captain of the ship, and the blue-collar rock-n-roll on the soundtrack is irritating. Panned by just about everybody, I found a great deal of depth here, some scattershot laughs, and I was really moved by Belushi's matter-of-fact performance (no showing off) and his touching scene at the funeral. *** from ****",
         "This is easily the \"craziest\" Road Movie ever made - and one of the best. It's funny, tragic, dramatic and intelligent. Konchalovsky's composition is without any flaws - you'll find no plot holes or boring sequences destroying the flow of the story. The soundtrack supports the atmosphere of the movie perfectly. James Belushi stars as Homer, a retarded man, who goes on a long journey to see his dying father. Right at the start he's being robbed of all his cash and has to sleep in a car cemetery. There he meets the criminal Eddie, played by Whoopi Goldberg, who's slowly dying of a brain tumor. This tumor is the reason for several violent outbreaks. Eddie escorts Homer and arranges the first sexual contact for him - with a monstrous prostitute. This results in one of the most charming and funny \"sex scenes\" I've ever seen, beaten only by the priceless dancing scenes with Homer and Eddie at the pier. I've never seen one of the two acting better. But don't miss the guest appearances of Anne Ramsey, Karen Black and Jesus! And be warned: even though this film is full of funny, charming and lovable scenes it has also its violent parts. If you liked \"Harold & Maude\" and \"Gilbert Grape\" this is a film for you!",
         "OK, first thing: this movie is NOT a comedy, not by a long shot. It has funny parts, but it is not a comedy. This is the best piece of acting you'll ever see from James Belushi and also one of Whoopi Goldberg's finest, unarguably. The movie is touching, funny, sad, violent and breathtaking. So for anyone who hasn't seen it, see it!",
         "I don't know what all the dissing is for! This is a great film, although I would've picked different music for the soundtrack. Entertaining...funny...heart and soul. What more could you ask for? Whoopi's best performance next to The Color Purple...",
         "I really wonder why so few people know or have heard of this movie I really wonder why this movie has only 5.2 score... I really wonder what kind of people these days watch movies... but let me tell you that a movie ain't a animated COMIC by definition I'm just trying to say that this movie is just awesome it has so many elements on it fun drama sex craziness and wonderful just wonderful acting skill of Belushi and Whoopi they give you a real deep insight in peoples souls and mind their problems and their happiness and affection love in short I love of those on the most under scale of society 2 psychopaths with no money and no one but each other and their car... trying to give their life a direction and meantime survive...",
         "Let's start with the ugly just to get it out of the way. I think this movie would have been considered a cult classic on par with Harold and Maude if someone besides Belushi had played Homer. At times he seemed to fall out of character at others it just looked like he was an actor playing a retarded person and very rarely he seemed in character. It wasn't a role that could be pulled off by over-acting or playing bigger than life. This was a great role played by the wrong actor. Now the bad, the continuity and sound track distracted from the story, How would people recognize Homer if he had been gone since childhood and his parents had denied him? The times you were expected to suspend belief to forward the story or develop characters were too glaring and the music was out of sync with the moods. But yet I gave it a 5 out of 10 because of the good. Whoopi who is not my favorite actress did everything with her character that Belushi could not do with his, and the story as a whole and what it was trying to convey about the cast-aways of society kept me watching to see the inevitable ending.",
         "Let's see: a foul mouthed, violent murderer, thief, escaped mental patient dying from an inoperable brain tumor (Goldberg)is driving a witless, infantile, drooling wanderer who has severe and permanent brain damage (Belushi) home to see his ashamed, abusive father who completely disowned him years earlier. Sounds like a fun road trip picture, doesn't it? Not even close. This movie was so vile that most theater chains passed on it, and those that didn't yanked it from their screens in less than a week. It is not funny, even in the context of a black comedy. It is violent, disturbing, foul and completely off the entertainment meter in the negative values. I have yet to see this on any retail or rental shelf, or any cable or TV station, even during the graveyard hell populated by Psychic Fraud Network and Ronco Commercials. Don't hitch a ride with these two. Your sense of humor may be permanently hijacked.",
         "I am a real big fan of both Whoopi Goldberg and James Belushi. However I was real disappointed in this movie. I guess I won't discuss it and ruin it for someone else. I would love the opportunity to rip this movie to shreds, I really hated it. anyone finding the reason to like this movie- please email me!!! Maybe you can show me something I missed. I felt Whoopi's character was overly violent and harsh. I felt the guy who walks through the background of several scenes ( I won't reveal anything there) belonged in an avant garde film, foreign film, anywhere but there. The script,... well, I won't go on. Comments welcome.",
         "Jim Belushi tries to play against type. Whoopi tries to show a menacing side to one of her whacked-out characters. There are some tremendous supporting bits by Beah Richards, Harry Caesar, and Karen Black. All efforts are totally wasted, save two or three touching moments. The pacing of this movie is horrific, the camera work is annoying and intrusive, the verbal exchanges are practically inaudible during the movie's first half, and the sound track is wholly inappropriate. The responsibility for all of this lies on the director -- who makes or breaks a movie. Homer and Eddie, unfortunately, is broken beyond repair. For enjoyable and entertaining Whoopi, leave Homer at home, and just watch \"Eddie.\""
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Kings Road Entertainment"],
      "summaries": ["An mentally disabled man get help from a sociopathic woman when tries to reunite with his dying father, who years earlier disowned him."],
      "budget": 0
   },
   "movielensId": 4604,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-08-17",
      "dvdReleaseDate": null,
      "directors": ["Andrei Konchalovsky"],
      "runtime": 102,
      "movieId": 4604,
      "title": "Homer and Eddie",
      "mpaa": "",
      "actors": [
         "Jim Belushi",
         "Whoopi Goldberg",
         "Anne Ramsey",
         "Karen Black",
         "Beah Richards",
         "Tracey Walter",
         "John Waters",
         "Pruitt Taylor Vince",
         "Wayne Grace"
      ],
      "imdbMovieId": "0097521",
      "originalTitle": "Homer and Eddie",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["aXcH0W5s_ZQ"],
      "plotSummary": "A retarded man get help from a sociopathic woman when tries to reunite with his dying father, who years earlier disowned him.",
      "tmdbMovieId": 46786,
      "avgRating": 2.47368,
      "releaseYear": "1989",
      "numRatings": 19,
      "posterPath": "/aMY8AQwUbZnUtpG5NTZooo7cvhG.jpg"
   }
}