{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0422015",
      "video": false,
      "title": "The Ax",
      "recommendations": [
         64968,
         8425,
         84644,
         64567,
         8286,
         9736,
         12455,
         39967,
         62134,
         64481,
         38414,
         3480,
         70270,
         2065,
         54157,
         5062,
         70967,
         65081,
         57726,
         3424
      ],
      "backdrop_path": "/8GbDmcn8IUvpAX60fSrjW1hwux7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Marlène Davert",
               "gender": 1,
               "credit_id": "52fe455a9251416c9102f5fd",
               "name": "Karin Viard",
               "profile_path": "/o12F6rIgJNPAyJa1aUsFSntRmf.jpg",
               "id": 13688,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bruno Davert",
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f601",
               "name": "José Garcia",
               "profile_path": "/qhPlKvzQnBBXE6meIAK1PenR0QU.jpg",
               "id": 24895,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hutchinson",
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f605",
               "name": "Ulrich Tukur",
               "profile_path": "/assJYvivgfukHFWim6o9T3sUmu9.jpg",
               "id": 8198,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Etienne Barnet",
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f609",
               "name": "Yvon Back",
               "profile_path": null,
               "id": 46278,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "l'inspecteur Kesler",
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f60d",
               "name": "Thierry Hancisse",
               "profile_path": "/5CnSGP3E9X4c5CscnWg4COEUshp.jpg",
               "id": 96376,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Machefer",
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f63b",
               "name": "Olivier Gourmet",
               "profile_path": "/y1g5UGYEiRiBqdc35zrekZox0tu.jpg",
               "id": 45152,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Maxime Davert",
               "gender": 0,
               "credit_id": "52fe455a9251416c9102f645",
               "name": "Geordy Monfils",
               "profile_path": null,
               "id": 368249,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Betty Davert",
               "gender": 1,
               "credit_id": "52fe455a9251416c9102f649",
               "name": "Christa Théret",
               "profile_path": "/zHwGQ1ybMJmqJ2bJc8nDvnVFuls.jpg",
               "id": 91355,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Iris Thompson",
               "gender": 0,
               "credit_id": "52fe455a9251416c9102f64d",
               "name": "Olga Grumberg",
               "profile_path": null,
               "id": 146213,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "préposée de la Poste",
               "gender": 1,
               "credit_id": "52fe455a9251416c9102f651",
               "name": "Yolande Moreau",
               "profile_path": "/xvNEPTrfgvHeH1wOvMq0WGzovKv.jpg",
               "id": 2415,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Quinlan Longus",
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f655",
               "name": "Dieudonné Kabongo",
               "profile_path": "/ayDR0YFMBw6K3JesdrEGpEEbogU.jpg",
               "id": 280872,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe455a9251416c9102f613",
               "name": "Michèle Ray-Gavras",
               "profile_path": null,
               "id": 56840,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f619",
               "name": "Jean-Pierre Dardenne",
               "profile_path": "/kn4tpNTPwWODCu356VHzCjGzSG0.jpg",
               "id": 56209,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f61f",
               "name": "Luc Dardenne",
               "profile_path": "/rZRSDYFQn0MJE1ZQHYIsFnO06XC.jpg",
               "id": 45138,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe455a9251416c9102f625",
               "name": "José María Morales",
               "profile_path": null,
               "id": 7356,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f62b",
               "name": "Donald E. Westlake",
               "profile_path": "/tPbsbutxJU6tPeyZoOeJBe8ulzp.jpg",
               "id": 21672,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f631",
               "name": "Armand Amar",
               "profile_path": null,
               "id": 20682,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe455a9251416c9102f637",
               "name": "Nicolas Naegelen",
               "profile_path": null,
               "id": 228788,
               "department": "Sound",
               "job": "Sound Engineer"
            },
            {
               "gender": 0,
               "credit_id": "52fe455a9251416c9102f641",
               "name": "Costa-Gavras",
               "profile_path": "/qYwJwz88aAf0Uraz79egHt5R1a1.jpg",
               "id": 27436,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe455a9251416c9102f65b",
               "name": "Donald E. Westlake",
               "profile_path": "/tPbsbutxJU6tPeyZoOeJBe8ulzp.jpg",
               "id": 21672,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.935972,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 34186,
      "vote_count": 50,
      "budget": 0,
      "overview": "A chemist loses his job to outsourcing. Two years later and still jobless, he hits on a solution: to genuinely eliminate his competition.",
      "similar": [],
      "original_title": "Le Couperet",
      "runtime": 122,
      "poster_path": "/f79n2rX4vUJMh8QC83p018SQTci.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "2005-03-02",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Costa-Gavras"],
      "runtime": 117,
      "synopsis": "Bruno Davert (José Garcia) is a highly-qualified chemist. After working for fifteen years for a paper company, improving products and saving money to shareholders, the company lets 600 workers go before outsourcing many of the jobs. The result for the company is a 16% increase in dividends to shareholders. Two years afterwards, Davert is still jobless. The only profitable company in his sector is Arcadia, but joining that company is impossible for him. Suddenly, he thinks of a way of getting rid of his competition. He offers a fake job - the kind of job he would apply for - on the job section of a newspaper and that way he gets dozens of curriculi vitae. The person who occupies the job he'd like to have is like him: middle-aged, balding, a bit overweight; but he always smiles and projects a successful image. His name is Raymond Machafer (Oliver Gourmet). Bruno selects the five curriculi which are most likely to get the job, and he decides to eliminate them all. His wife, Marlène (Karin Viard) try to be as supportive as she can. She holds two part-time jobs which cannot pay for all their bills, so that their teenaged children Maxime (Geordy Monfils) and Betty (Christa Theret), find some things lacking, for example the satellite TV. Bruno is jealous of Marlène's boss (Hervé Pauchon), always smiling, and he's afraid that he wil make a pass at her sooner or later. Bruno goes to the basement where there are some military artifacts from back when his father fought in the WWII. He takes a gun and some bullets, and learns to shoot in the woods nearby. His first killing spree happens in Belgium. Every time he shoots, his arm hurts. Bruno kills the first applicant, Birch (Marc Legein) when he leaves home to pick up his mail. Nobody has a clue that he has done anything strange. The only thing which Marlène notices is that he is more nervous than usual, but she blames his jobless situation. She notices that he has light up the chimney before time, and that he has got somebody else's CV, but he just dismisses it as that he has prepared a new résume and CV. He goes to a job interview. The HHRR manager, Iris Thompson (Olga Grumberg) makes him tough questions. Bruno gets cocky, tells the truth about what he feels, so that he realises he has destroyed all his possibilities of getting the job. The second time that he kills somebody he has problems in finding the right moment. A female biker (Luce Bouchel) looks at him in a weird way. When he comes to that location a second time, the weird woman shouts and threatens him, as she thinks he is the pervert who is harassing her daughter. She finds out about Bruno's gun, so Bruno has to kill her. Her husband - which is his victim - goes out to the garden when he hears the shooting, and Bruno kills him. Later on, the case appears on the news. Judy Rick (Marie Kremer) accuses the man who harassed him of killing both her parents, whom she was living with. Bruno repents, and thinks that he has to give himself up, because he can't allow an innocent person to pay for his crimes, but the suspect jumps from a height. He dismisses his initial intentions. He finds another applicant working at a small restaurant. He's trying to come back to the paper industry, and working as a chef in the meantime. Bruno tries to kill him when he leaves his job, but he can't find the right moment. At last, he runs over him accidentally. After the incident, Bruno has to take the car to the garage. The workman (Jean-Pierre Gos) talks to him concerning how his wife has also been made redundant after 11 years at the local hospital. The workman is afraid of losing his job as well, but he says that he's going to shoot himself in front of his bosses if that moment finally arrives. Marlène insists in attending to a psychology expert, Quinlan Longus (Dieudoné Kabongo Bashila), in order to help them out. Bruno has to express feelings of loss, threat and anger. Marlène will support him through thick and thin if he changes his ways a little bit. Maxime is caught red-handed stealing videos and videogames. A social worker gives Bruno and Marlène until six in the morning to send the police home. Bruno and Marlène argue it was Maxime's first time, but when they are back home, they pressure Betty into telling them where Maxime's loot is hiding - in a double wall in his wardrobe. Bruno throws away three whole rubbish bags of stolen goods, so when the police arrive there is nothing to hide. That way, Maxime gets out of his predicament lightly. Another different of police officers (Michel Carcan, Serge Larivière) appear later on to question Bruno about the deaths of paper workers. He asks for protection, but there is no staff to protect everybody who may be threatened by a mysterious psychopath who is killing paper industry workers with an old Nazi gun. Inspector Otto Zirner (Robert Borremans) even makes a comment about the possibility of the gun exploding every time it is used. Marlène thinks it's further questioning concerning Maxime's illegal activities. A new applicant appears. Gérard Hutchinson (Ulrich Tukur) is working, which is going to be a great asset when applying for a job. Bruno wants to get rid of him, but he realises he can't use the gun, so takes a kitchen knife. Bruno calls him to a restaurant with the pretence of a job interview, and then he follows him: Gérald works in a menswear clothes shop. Gérard talks to him, and says that he should get used to his new job, as after five years he may have lost his touch with the paper industry, and also mentions that a police officer told him about a psycho who is killing paper industry workers. Bruno has to hide the huge knife from him, but he finally doesn't kill him, at least at that moment. Bruno will decide to leave him alone, as Gérard is eager to keep his preset job, and quite the paper industry race. He breaks into Raymond Machafer (Oliver Gourmet)'s home, but as he arrives accompanied by a woman, he can't kill him at that moment either. Bruno falls sleep at that home of another of his would-be victims, and dreams he's already working for Arcadia and is showing some people around. Raymond appears, completely drunk, and believes his story that the door was aghast and that he entered in order to make him some questions about the possibility of working for Arcadia. Raymond is afraid of losing his job, as some positions are being outsourced as well. Raymond points a gun of his to Bruno, but he convinces him and they both end up drinking even more. When Raymond is completely passed out, Bruno opens the gas spit. When Raymond lights a cigarette, he blows himself to death. Back home, Bruno makes some exercise while waiting for an Arcadia phone call. Finally, Anne Futerman from Arcadia sends him an e-mail asking to reply back in 24 hours. A police officer visits Bruno to tell him that Gérard has committed suicide. They think he was the one who killed all the paper industry workpeople, and the police officers wants to calm Bruno down, as there is no danger anymore. A professionally woman (Vanessa Larré) is so obsessed with him as he was with the other applicants before.",
      "writers": [
         "Donald E. Westlake",
         "Costa-Gavras"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0422015/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3MDAzNjYxNF5BMl5BanBnXkFtZTgwOTIzMDA2MDE@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: José Garcia, Karin Viard, Geordy Monfils | See full cast and crew »"],
      "reviews": [
         "Bruno DAVERT (Jose Garcia) is locked-out for economic reasons. To find a new job, his method is simple : kill the other candidates. His behaviour changes, and his wife Marlène(Karin Viard) feels Bruno moving away from the family, from herself and from the true life. Costa-Gavras shows as the unemployment can make a man crazy. A perfect look on the stupidity of our society when a man is only the money he can earn. Costa-Gavras show us the vacuum we are running to, destroying everything to obtain what ? Probably the best political movie of the ten last years. Garcia is excellent, probably because he does not know he his good. K. Viard change her usual energy in distress, her performance is excellent. Everybody is good. Run to this movie. It shows you your future",
         "People who characterize this film as a comedy obviously haven't got it. The comic element is just a thin surface. This is a tragic story and a very strong political statement. Obviously Bruno's decisions and actions are absurd, but his circumstances are not. The movie offers an incisive look at the dark reality of chronic unemployment. Corporate greed leads to story after story after story of desperation. Westlake and Gavras know that in order to pass the message you have to lighten up the atmosphere (a la Truman Show), or else the viewer won't sit the whole movie. In order to appreciate the film you have to marginalize the main plot element (the murder story) and concentrate on all the subplots.",
         "Loved it! Loved it! A terrific satire of the modern corporate downsizing which destroys a man's pride and then everything else. Better yet, this social satire is packaged as an absurd black comedy - serial killer story. A picture of the world we're living in. Don't take the killings too seriously. Obviously, they are a metaphor for the desperation of the man. It's a little bit like \"Shock to the System\" but I liked this one better. Whether you laugh at this movie today or not, tomorrow this will be the reality for most all of us when only endless service jobs will have remained. Or, flipping burgers. I highly recommend this socially conscious movie, as I applaud its director for the courage to make it. Bravo!",
         "I completely disagree with the reviewer who called this a'TV movie'. it's anything but... (did he see it on a TV screen?). It's a thriller that actually deserves to be called by that over-used adjective 'Hitchcockian' as we gradually identify more and more what the lead character who starts off as what, a hit-man, a serial-killer? As we get into his motives and hit and miss way of carrying them out together with unrelated encounters with the cops we are willing, despite ourselves, that he will succeed. Why does this not have a US distributor yet? I saw it with an appreciative crowd in Paris earlier this year. Jose Garcia who I last saw overdoing it in a so-so comedy called APRES VOUS is very good as the ordinary guy pushed to the limit and Karen Viard also always watchable as his blandly oblivious wife, who also becomes involved via a different set of crimes involving their family.",
         "Many years ago there was a film starring Alec Guinness called \"Kind Hearts and Coronets\", which took the case that a member of a wealthy family murders off his relatives to inherit the estate. \"Le Couperet\" offers a similar plot, although this time a disgruntled unemployed engineer becomes an inept assassin to remove his competitors for a top job with often-hilarious consequences. In this very dark comedy Jose Garcia does well as the bumbling killer, at times reminiscent of a young Jack Lemmon, and there are many surprises along the way. The film does highlight more sincerely than you may expect the plight of middle-aged professionals that are retrenched, and find it difficult to obtain positions in the current climate. Many watching the movie might well relate to its characters and their plight. Excellent sequences include the job interview, which has more than a ring of truth, the discussions about unemployment and its social consequences by the discouraged out-of-work executives, and the scenes with the marriage counselor. Despite its black humour, there is a very human side to this film. Costa-Gavras is an exceptional filmmaker, with experience that shows in the smooth integration of the hilarious with an undertow of real pathos. The story ends on a suitably enigmatic note.",
         "*** May contain some spoilers *** \"Le Couperet\", the last Costa-Gavras, talks about the insanity provoked in a middle-age manager after the loss of his very specialized job in a company that rearranged its stuff aboard by economic convenience. The plot, very well adapted from the novel \"The Ax\", by Donald E. Westlake, is itself a denunciation of what is happening in our capitalist and liberal system were people hardly conserve their employ and, once fired, they can reinsert themselves even more hardly into the system. Costa-Gavras remarks all throughout the movie the concept of consummation nowadays and how this attitude becomes a growing problem to maintain the status of our style-life. I went to the theater foreseeing a remake of \"Falling Down\" (Schumacher, 1993), where a lonely man becomes crazy after been fired and starts to kill people indiscriminately into the crowd. And I was wrong. Machiavellian Bruno (José García), the depressed and introspected main character, reacts in a peculiar way by selecting extremely well their preys -their job's rivals. Moreover, murders occur in isolated places. In the meantime his loving wife (Karim Viard) works outside and tries to maintain the marriage equilibrium and the family integrity. Both actors are GREAT! The movie has a really great rhythm from the beginning to the end. A cute melange of dramatic and hilarious situations spices the entire movie, as well as an intelligent use of the voice-off to look into somebody's head decided to kill someone else. Direction simply excels. Actors are credible and familiar. The couple García-Viard works finely and perfectly in tuning. That's why face to face scenes between García and Viard or with the victims are of such efficiency that one feels into the place. Dialogs sound naturally unforced. Supporting actors dance very well synchronized with mains ones. Photography is clean, vivid, luminous contrasting with the internal dark mood of Bruno. Camera scans little villages in the north of France and Belgium, and pierces in houses and surrounds of middle-class people. Music is very discreet and works mainly as an insinuation of Bruno's moods than a heavy score omnipresent. In summary: a very solid Costa-Gavras, sadly current and confirming that the director has not said his last word yet (and fortunately!). I recommend this movie to those that love the soul of a good director reacting efficiently on the actor's work, and the landscapes of social denunciation painted on canvas made of present. 9/10",
         "Costa Gavras has a reputation for very serious and very political thrillers. He first came to prominence 40 years ago with \"Z\", a film about a political assassination in his native Greece. Of his oeuvre since then I have seen and enjoyed \"State of Siege, about the Tupamaros insurgency in Uruguay and \"Missing\", about the aftermath of the deposition of Salvador Allende in Chile (though the country is not actually named). This film, based on a 1997 novel by the prolific American crime writer Donald E Westlake, could be described as Costa Gravas lite, as it has many of the elements of black comedy. The protagonist, Bruno (Jose Garcia), has lost his well-paid job as a senior chemist at a paper manufacturing company owing to a corporate merger. Increasingly desperate and running out of money, he decides to eliminate his likely rivals for advertised positions in the same field. Bruno is no psychopath, murder is not easy for him, but he truly believes he is nothing without his job � he literally seeks Arcadia (earthly paradise) through his work since the job he is after is with the (fictitious) Arcadia paper company. Some of the best lines in the movie come from Bruno's encounters with his victims, two of whom, unaccountably, have English surnames (Hutchinson, Barnet) Some have suggested that there is an air of unreality in the story since Bruno would in real life be quickly detected. Virtually every hit is bungled in some way, he uses his own car and the same World War 2 handgun, and the police are on his trail. However, getting away with it, or at least not getting caught by the forces of law and order, is par for the course in this type of black comedy. Costa Gavras is obviously out to show the injustice of it all but he lays the blame on the system. Incidentally, if you find the ending mysterious have a look in the credits for the name of the character played by the lovely Vanessa Larre. While Bruno is out bumping off his rivals there is trouble on the home front. His teenage son has been caught shoplifting and Bruno returns to thwart the police investigation. His wife (Karin Viard) suspects Bruno might be having an affair, though since the story has been relocated to France from New England she is only mildly upset about the possibility, and they troop off to a marriage counselor. She is blissfully ignorant as to what Bruno is really up to. Jose Garcia reminds me of Kevin Spacey and he makes an effective deranged Everyman. The minor characters are well realised, particularly Ulrik Tukur as Hutchinson and Olivier Gourmet as the man whose job Bruno is after. Karin Viard is effective as the baffled wife, and Geordy Monfils filled the bill as their errant son.I also liked Olga Grumberg in a small but significant role as a contemptuous job interviewer. Costa Gavras has sugared the pill a bit here, but the film remains much stronger stuff, than, say, \"Up in the Air\", Jason Reitman's recent take on giving people the sack.",
         "Maybe the best 'noir' movie I've seen in the last years, and definitively the best Donald Westlake adaptation so far, \"Arcadia\" is the story of a man obsessed with a job, who thinks that the only way to get it is killing every candidate who can be better than him, and must cope with his many mistakes and family problems. It sounds like a tragedy, or a drama, but it is the best piece of black (or not so black) humor combined with noir I remember, which is surprising: I didn't know that Costa-Gavras had so much sense of humor. There are many symbols, allegories, but above it all, it mentions every controversial and denounce topic in existence for just one, two or three minutes, just to mention it. The result is, incredibly and amazingly, funny, intellectually engaging, extremely suspenseful (the results of every situation and, at last, the end of the movie are unpredictable) and a master class of narrative progression, at least until the last 20 minutes, where the movie drags. But until then it is a flawless masterpiece, and it deserves to be watched over and over again. José García is another surprise, a very good comedian.",
         "Costa -Gavras 's body of work does not lack in unity. Except for his two fist movies,which were thrillers , a romantic tale (\"Clair de Femme\" ) and a comedy that does not count (\"Conseil de Famille' ) all that he has made display social and political concerns. From his early French classics (\"Z \"(He is alive) \"L'Aveu\" ,\"Etat de Siège\") to his American period (\"Missing\" \"Betrayed\" \"Music Box\" ) to his French comeback (\"Amen\" ) there is a cohesion which even André Cayatte ,his closest contender in the field,did not reach. And then \"Le Couperet\" .Don't be mistaken.It's not that much different from CG's previous efforts.Based on a Donald Westlake novel-a writer whose black humour was fierce- ,it contains lines Henri Jeanson or Michel Audiard would not have disowned.Comedy walks a fine line ,but it walks hand in hand with tragedy .You must watch it seriously to realize what heavy things CG is saying.While making his film verge on parody,he is also putting the French society in a less exalted light than we have been used to seeing it in.Suddenly our world seems frightening (the gas station man who hides a gun in his cash register,the icily impersonal female headhunter -I wish I had had my gun!-)It is really the society of the leave-you-behind and perhaps -I hope not - an omen of things to come in the future.I do not speak of the murders obviously.There are other ways of destroying a human being.\"When I saw them enter the restaurant ,the German ex-engineer says,I knew that I didn't stand the slightest chance \". The last picture has (and will be) widely talked about.Actually it reminds me of the ending of Mankiewicz's \"All about Eve \" when Phoebe tries Eve's crown .When you get to the top,there is nowhere to go but down. A film noir,a farce,a psychological drama ,a social satire and a movie where CG talks politics.One of his most accessible and one of his strongest works.At seventy plus,CG is as young as the reporter who bothered the fascists in \"Z\".He is abetted by Jose Garcia on top of his game. Like this?Try these..... \"Extension du domaine de la lutte\" Philippe Harel 1998 \"L'adversaire\" Nicole Garcia 2002 \"Working girl\" Mike Nichols 1988",
         "We are introduced to Bruno Davert as he is being recognized for his many years of service for a paper manufacturer. Little does Bruno know that soon he will be on the unemployment line because the company has decided to outsource the work to a Rumanian firm. Thus begins the story of a man's sudden descent into a crisis caused by the situation in most of the industrialized nations. Bruno devises a scheme to eliminate the possible competition that are looking for the same position he is after. For that purpose, he rents a mail box at the post office after he has placed a phony ad asking worthy candidates for the same position he covets. Bruno selects the five men and a manager that will have to be eliminated for his chances to be better. How he will go about it presents a problem: he wants to use an old pistol that belonged to his father in WWII. Life at home has begun to deteriorate. His loyal wife Marlene has taken part time jobs as a nurse in order to help in a household without steady income. Their married life also suffers because the strain Bruno is going through trying his hand as an assassin. Not content with that, the Daverts find out in the worse way their son has been stealing software programs and faces jail time if found out. Bruno goes through a killing spree eliminating the competitors. His resolve is almost shattered when he has a chance to meet with one of his would be victims that he has followed to a department store after setting up an interview he doesn't intend to keep with the man. In this unhappy man Bruno sees himself as in a mirror. As luck would have it, Bruno seems to get away with murder, but does he really? The last scene of the movie offers a puzzle that is left to the viewer to solve. \"Le Couperet\", directed by Costa-Gavras, is a black comedy for our times. In it, we are taken to see first hand the indignities anyone has to face when corporations such as the one that employed Bruno Davert decide to take the business some place else, leaving the stranded employees to fend for themselves. The film is an adaptation of Donald Westlake's novel \"The Ax\". Mr. Westlake's books lend themselves for screen treatments such as the one Mr. Costa-Gavras has given the material. Some commentary to this forum suggests this movie to be a film noir, but to tell the truth, only the one sequence might fall on that category and nothing else. It's rather a black comedy of mystery and suspense in our humble opinion. The best thing in the film is Jose Garcia, an actor with a face that goes perfectly with his character. Mr. Garcia was a happy choice, as he never disappoints. Karin Viard appears as Marlene a wife at the end of her rope because her world is crashing on her. Ulrich Tukur and the excellent Oliver Gourmet are seen among the accomplished cast doing amazing work for the director. \"Le Couperet\" is worth the prize of admission, or the DVD rental."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "K.G. Productions",
         "StudioCanal",
         "France 2 Cinéma"
      ],
      "summaries": [
         "Bruno Davert, a chemist working for a paper company, is fired. After three years he's still unemployed, too much competition for the few job position he could fit in his sector. He sent tons of resumes, he attended many qualifying courses, he tried everything but there is nothing to do: no job for him in the industry. The only healthy company in the sector is \"Arcadia\", but joining it is just an impossible dream. At this point Bruno is desperate. What he could do: to kill all the competitors? Could he?",
         "The thirty-nine years old executive Bruno Davert has been working for fifteen years in a paper company. After a merging operation with a Romania's company, he is fired in a downsizing. While unemployed for two years, Bruno loses his self-esteem and sanity and his family loses the middle-class lifestyle without cable television, Internet and regular consumption. He concludes that there is too much competition in his sector for a few job positions and decides to literally eliminate his competitors, killing those more qualified than him.",
         "A chemist (Garcia) loses his job to outsourcing. Two years later and still jobless, he hits on a solution: to genuinely eliminate his competition."
      ],
      "budget": 0
   },
   "movielensId": 46156,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2005-03-02",
      "dvdReleaseDate": null,
      "directors": ["Costa-Gavras"],
      "runtime": 122,
      "movieId": 46156,
      "title": "The Ax",
      "mpaa": "",
      "actors": [
         "Karin Viard",
         "José Garcia",
         "Ulrich Tukur",
         "Yvon Back",
         "Thierry Hancisse",
         "Olivier Gourmet",
         "Geordy Monfils",
         "Christa Théret",
         "Olga Grumberg",
         "Yolande Moreau",
         "Dieudonné Kabongo"
      ],
      "imdbMovieId": "0422015",
      "originalTitle": "Le Couperet",
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A chemist loses his job to outsourcing. Two years later and still jobless, he hits on a solution: to genuinely eliminate his competition.",
      "tmdbMovieId": 34186,
      "avgRating": 3.72517,
      "releaseYear": "2005",
      "numRatings": 151,
      "posterPath": "/f79n2rX4vUJMh8QC83p018SQTci.jpg"
   }
}