{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pornography",
            "id": 445
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "sexual abuse",
            "id": 739
         },
         {
            "name": "drug addiction",
            "id": 1803
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "celebrity",
            "id": 6562
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "puppetry",
            "id": 11691
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "bribery",
            "id": 159937
         },
         {
            "name": "crime lord",
            "id": 167352
         },
         {
            "name": "eating disorder",
            "id": 172383
         }
      ],
      "imdb_id": "tt0097858",
      "video": false,
      "title": "Meet the Feebles",
      "recommendations": [
         9964,
         27814,
         31150,
         40095,
         22455,
         22172,
         32458,
         14510,
         14005,
         16288,
         15762,
         763,
         14742,
         20481,
         24922,
         27813,
         12476,
         24920,
         17467,
         180685
      ],
      "backdrop_path": "/sqSFFY0m2iLzPOurPwAaKmaYO6N.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Samantha the Cat / The Sheep (voice)",
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed55",
               "name": "Donna Akersten",
               "profile_path": null,
               "id": 81875,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Sebastian / Dr. Quack / Daisy the Cow / Sandy the Chicken (voice)",
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed59",
               "name": "Stuart Devenie",
               "profile_path": "/24ULaHp8antJCog28T59tJByJZ1.jpg",
               "id": 81876,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Heidi / Robert / Barry the Bulldog (voice)",
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed5d",
               "name": "Mark Hadlow",
               "profile_path": "/qNBpe4BKgKrLF6yZrCtCjFMRFJv.jpg",
               "id": 81877,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Wynyard the Frog / Trevor the Rat / The Fly (voice)",
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed61",
               "name": "Brian Sergent",
               "profile_path": "/qPqXA0lzAxFUuPlBOv58pQgj2wu.jpg",
               "id": 81878,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed65",
               "name": "Ross Jolly",
               "profile_path": null,
               "id": 81879,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Bletch / Arfur the Worm (voice)",
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed69",
               "name": "Peter Vere-Jones",
               "profile_path": null,
               "id": 81880,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Sid the Elephant / The Cockroach / Louie the Fish (voice)",
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed6d",
               "name": "Mark Wright",
               "profile_path": null,
               "id": 81881,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Heidi the Hippo",
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed71",
               "name": "Danny Mulheron",
               "profile_path": null,
               "id": 81882,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Killer man (uncredited)",
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed75",
               "name": "Jay Snowfield",
               "profile_path": null,
               "id": 81883,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Bletch (voice) (uncredited)",
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed79",
               "name": "Doug Wren",
               "profile_path": "/bEYOS0BJ7RPGItzXLvaRg9cbXoU.jpg",
               "id": 81884,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 2,
               "credit_id": "5540c82c9251413d6d0013d0",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed3f",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed45",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed4b",
               "name": "Peter Jackson",
               "profile_path": "/kSrfI3TbMdIMmPVOflLQ56OfscB.jpg",
               "id": 108,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed51",
               "name": "Murray Milne",
               "profile_path": null,
               "id": 11328,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed7f",
               "name": "Jim Booth",
               "profile_path": null,
               "id": 15089,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed85",
               "name": "Murray Milne",
               "profile_path": null,
               "id": 11328,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed8b",
               "name": "Jamie Selkirk",
               "profile_path": null,
               "id": 1390,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4497c3a36847f809ed91",
               "name": "Stephen Sinclair",
               "profile_path": null,
               "id": 11325,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4497c3a36847f809ed97",
               "name": "Fran Walsh",
               "profile_path": "/hLihP60zpszrowcMLpWoJ4wvtuy.jpg",
               "id": 126,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4497c3a36847f809ed9d",
               "name": "Danny Mulheron",
               "profile_path": null,
               "id": 81882,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 5.994814,
      "production_countries": [{
         "iso_3166_1": "NZ",
         "name": "New Zealand"
      }],
      "id": 8216,
      "vote_count": 90,
      "budget": 750000,
      "overview": "Heidi, the star of the \"Meet The Feebles Variety Hour\" discovers her lover Bletch, The Walrus, is cheating on her. And with all the world waiting for the show, the assorted co-stars must contend with drug addiction, extortion, robbery, disease, drug dealing, and murder. Meanwhile the love between two of the stars is threatened by Trevor the Rat, who wishes to exploit the young starlet for use in his porno movie.",
      "similar": [
         979,
         109414,
         281957,
         429733,
         8012,
         3134,
         4771,
         281,
         627,
         339692,
         59967,
         180863,
         238636,
         395834,
         357096,
         4247,
         106646,
         9093,
         445954,
         226
      ],
      "original_title": "Meet the Feebles",
      "runtime": 94,
      "poster_path": "/mQQptNMh4OgzmMjLbeHAyYO5fUp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "WingNut Films",
         "id": 11,
         "origin_country": "NZ"
      }],
      "release_date": "1989-08-12",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Hell hath no fury like a hippo with a machine gun.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Jackson"],
      "runtime": 94,
      "synopsis": "The eponymous 'Meet the Feebles' theatre troupe is rehearsing the title song with hopes of finding success through being picked up for a syndicated television show. Heidi the Hippo, the star of the show, is insulted by Trevor (a pornographic director) and complains to her boss and lover, Bletch, who is actually in an adulterous relationship with Samantha. Meanwhile, Robert, the new member of the team, arrives at the theatre, and quickly falls in love with Lucille, another newcomer. Samantha confronts Heidi, insults her, and reveals her relationship with Bletch. Robert confesses his love to Lucille, and the two become engaged. Sidney, Arthur's friend and member of the team, receives a visit from his former wife Sandy with his alleged son Seymour (Seymour comically resembles Sidney very strongly). Sandy informs him she will be preparing a paternity case against him. At a toilet in the mens room, the second most important star of the show, Harry, is suffering from a mystery disease. Meanwhile, Wynyard (the drug addicted knife thrower) tells Robert his story of Vietnam, and convinces Robert to give him $50 to buy drugs from Trevor. After seeing Trevor's latest porno film, Bletch decides they need a new porn star, and Trevor chooses Lucille; he drugs her and tries to rape her as an audition but is caught by Robert. When he walks in on the scene Robert thinks that Lucille was drinking and throwing herself at Trevor, and tells her he never wants to see her again. The last part of the film takes place during the prime-time show. After a good beginning (they sign with a TV chain), Bletch confesses to Heidi that he actually hates her and wants to give the main role to Samantha. After trying unsuccessfully to attempt suicide, Heidi goes on a shooting spree and kills many of the cast. The whole film is told concurrently among all of these sub-plotline stories happening along with the action. Love Triangle A distraught Heidi runs to Bletch after being insulted by Trevor. Bletch is having sex with Samantha, but hides the tryst. Although Bletch is physically disgusted by Heidi, he insincerely comforts her since he needs her talent on the show. Later Samantha insults Heidi, claiming Bletch really wants Samantha. Distraught, Heidi drowns her sorrows by eating an entire chocolate cake, as she reminisces about her past romance with Bletch in a black-and-white flashback to her days as a lounge singer. Flatulence caused by the cake causes Heidi to lay waste to the set during the rehearsal of a feature number; Sebastian then lambasts her. Heidi rushes to Bletch for emotional affirmation, but he is unable to spare her the sight of Samantha performing oral sex on him. Heidi locks herself in her room and refuses to perform, but relents after Bletch has make-up sex with her. Heidi's performance helps secure the Feebles a syndicated series. Shortly afterwards, Heidi attempts to seduce Bletch in his office, but Bletch completely disowns her since Samantha is now to be the star of the show. Unfortunately, Bletch is unaware of Heidi's extremely fragile mental state. Robert and Lucille Robert shows up for his first day as a cast member, and is accosted by the Fly, who tries to corrupt Robert into informing on the cast. Arthur rescues Robert and shows him around, where Robert sees Lucille for the first time. Although he is romantically terrified of her at first, he later summons up enough courage to ask her out and they fall in love. Later Trevor drugs Lucille (to manipulate her into performing in his pornographic films). Robert walks in on the drugging, but misinterprets it as Lucille's decision, and disowns her for being a drunk. They make up later after Robert saves her from Heidi's crazed gun rampage, and eventually get married. The Big One Dennis is shown peeping on Harry in a threesome with two female rabbits. Harry feels physically ill after this episode and is accosted by the Fly, who assumes he has a sexually transmittable disease (STD) and wants to publish the scandal. Dr. Quack diagnoses Harry with \"The Big One\". The Fly publishes the scandal in a local tabloid - to the dismay of Bletch, who presumably wants to avoid negative press on the cast. Trevor lures the Fly into the bathroom, where Bletch tears his wings off and flushes the Fly down the toilet. After vomiting all over the stage in the live performance, he finally learns that he only has 'bunny pox'. Unfortunately, while rejoicing in the news that \"The Big One\" will not cause his death, Harry's head is blown apart by a gunshot during Heidi's rampage. Sexcapades Trevor is shooting a porn film in the basement with the Masked Masochist and Madam Bovine. They are interrupted by Robert, who mistakes the scene for torture and tries to save the cow, who in turn accidentally crushes the Masked Masochist, suffocating him. Trevor later replaces him with Dennis (who has a snout resembling male genitalia) to perform 'nasal sex' on Madam Bovine. Drug Running Trevor is approached by a sniveling Wynyard looking for his fix, but the drugs have not yet been delivered. Bletch is later shown on a golf course consummating a deal with Cedric. However, after testing on Dennis, the drugs provided by Cedric turn out to be household borax, infuriating Bletch. Louie, Cedric's agent, is literally liquefied after being force-fed some of the borax by Bletch's henchmen. Bletch and his cronies venture to the docklands to fight Cedric and his crab-crewmen. Bletch's side prevails after killing Cedric and the crabs, maneuvering past a huge spider, and driving through the insides of Cedric's boss Mr. Big. However, Barry's head is eaten by the spider. When the drugs finally arrive at the theatre, Wynyard is finally able to get his fix, which puts him into a stupor. The Show While the cast performs an opera number, Sebastian lambastes Robert for not acting his part as an extra on the stage. As punishment, he assigns Robert the task of replacing Wynyard's assistant, who has just been killed by Wynyard's knife throwing while going through drug withdrawal. Wynyard guilt-trips Robert into giving him money for drugs, after telling him a horror story about his time in Vietnam (shown as a flashback parodying The Deer Hunter). He eventually gets his fix from Trevor and injects himself into a deep slumber. The acts gradually disintegrate - Heidi nearly destroys the set by botching a swing, the Indian mystic incapacitates himself by contorting his head into his rectum, and Sid's tribble-like pets are crushed by a barrel. Seeing his show in shambles, Sebastian tries to convince Bletch to feature his personal performance, the sexually explicit number 'Sodomy'. This is summarily rejected by Bletch, who physically throws Sebastian out of his office. Sebastian decides to use the number anyway and performs it in front of the live audience, to Bletch's horror. The Elephant and the Chicken Sandy accuses Sid of being the father of their chicken-elephant baby, to his dismay and denial. During the live show, Sandy again accosts Sid on stage with the paternity suit. During a later tragic crossfire scene, Sid braves the crazed Heidi's automatic fire to save his baby. His heroism costs the elephant two bloody knee wounds, and he accidentally crushes Sandy's shot-off head after it squawks out one final invective. The Climax While the live show is proceeding elsewhere, Heidi attempts suicide by hanging, but her weight breaks the chandelier from the ceiling and she falls through the floor. She makes her way to Bletch's machine gun and tries to kill herself, but at the last moment, Samantha shows up and taunts her. Heidi responds by killing Samantha. Meanwhile Wynyard, in a drugged stupor, tries to kill Robert before accidentally killing himself. Sebastian does his \"Sodomy\" number, while Heidi rampages over the entire set on a killing spree. She finally finds Bletch and pumps many rounds into him as well. Bletch lies to Heidi about loving her and orders Trevor to kill her. However, Robert swings in just in the nick of time to kick Trevor, saving Heidi. Heidi then literally blows Bletch's brain out. Realizing that she killed her love, she gives up her gun and sadly sings \"Garden of Love\", leading into the epilogue in which the fates of the six only known survivors are shown.",
      "writers": [
         "Fran Walsh",
         "Stephen Sinclair"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097858/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5Mzg3NDAwNV5BMl5BanBnXkFtZTYwMTQ1MTg5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny Mulheron, Donna Akersten, Stuart Devenie | See full cast and crew »"],
      "reviews": [
         "Basically Peter Jackson made a parody of \"The Muppets Show\". It's about a bunch of animal puppets (or people in animal costumes) putting on a show where everything goes wrong. Half of the puppets are strung out on drugs; some are doing porno videos in the basement; the rabbit is basically getting it on with everybody (and gets a potentially fatal disease); a walrus is going at it with a cat (this is shown) and a psychotic hippo gets hold of a machine gun.... As you can see this is NOT for the kiddies. What it is is an all out, no holds barred assault on good taste. Jackson and his crew show puppets vomiting, having sex, being graphically killed or sexually assaulted. If you have a weak stomach this is NOT for you. However if you have a REAL sick sense of humor and can take VERY graphic material (like me) you'll have a ball! I was actually laughing myself silly during this. The movie keeps topping itself with the humor getting more sick and graphic until the final massacre sequence at the end. Hard to believe this guy went on to do \"The Lord of the Rings\" trilogy. NOT FOR EVERYBODY but damn I had so much FUN watching it!!!!",
         "This movie is crazy!. It's a puppet flick full of drugs, sex, guns and porn. As an early Peter \"Lord of the Rings\" Jackson flick it also features a bit of gore. The puppets don't just die, they get mushed. I really liked it however I imagine some people would be repelled by it. Jackson himself said in his Oscars speech that it was 'wisely overlooked' by the Academy. He's the first to admit that this type of movie simply aint going to be to everyones taste! However if your open minded and looking for something a little 'out there' then I would check it out. 8/10",
         "Great puppetry and a whacked out plot make this New Zealand effort on par with some of the best cult films today. There are animals of all shapes, sizes, colors, and ethnicities(?); some are into money, others are into dancing, and then there are others who are into porn, coke, and feces. This film is rude, gross, demented, and hilarious. The end is really cool, and when Peter Jackson made this, he must've been on something. The voices and the lighting were probably the main producers of the major headache I received while watching this phenomenon of a movie. I mean, ordinary people just don't make this, and then wrap up one of the best trilogies off all time! This guy is a genius, pure and simple. I really hope Jackson goes back to his gory film making roots. Overall: *** out of ****",
         "I can understand all those people who gave bad reviews on \"Meet the Feebles\", because this film is far beyond political correctness and not suited for highly sensitive! Obviously shot with a higher budget director Peter Jackson made all the things possible he was not able to do in his predecessor \"Bad Taste\". The humor in this movie is insulting, gory and often repulsive, so Muppets-inventor Jim Henson would turn in his grave for this. Nevertheless \"Meet the Feebles\" is a real cult movie because of its unique character and his inimitable sense for dark humor. Many people hate this film, others love it. I belong to the last mentioned... Just don´t let your children watch this!!!",
         "Sure, Meet the Feebles may not be director Peter Jackson (yes, Peter Jackson of Lord of the Rings and King Kong) at his finest hour of directorial standing, but as a fan of a certain kind of really deranged and off-kilter cult movie, a lot of this made my night. It's an ultra-perverse, ultra-absurd, and sometimes really ultra-stupid take on a variety show where puppets are preparing for the night's performance, only everything that could go wrong- or more precisely anything that could be unexpected to go wrong- does every which way to Sunday. It's actually the kind of movie when I was watching, for the most part early on, I almost couldn't really laugh. I just had a look on my face like 'what am I watching?' And, 'how can something like this actually exist?' It's not even so much a question of how well or how not well Jackson and his low-budget team pull it off, but how someone can take the time and energy to think this all up and put it all on paper. Let me try to sort through some of the varied story lines- there is Robert, a newcomer to the Feebles gang (and gang I mean in literal and figurative terms), who wants to impress a certain poodle-dog type of girl who really has him going to lengths to impress her. But meanwhile, a really nasty rodent- also a porno director as well as the boss's assistant- decides to use her in his next porno flick by drugging her. This rodent also has to deal with some other low-lifes in the group, like a junkie lizard who has one big story to tell Robert at one point about his crazy, violent trip to Vietnam (including a 'why not' homage to Deer Hunter). There's also a rabbit who may or may not be dying from an STD of some sort (I think it was an STD anyway), and has a pestering fly (always in the most uncomfortably close of close-ups) trying to get the scoop on his condition. There's even the overly-annoying stage manager who can't wait to put on his God-awful dance number of his own. But the main center of attention and star of the Feebles shows is Heidi, a hippo who loves to binge on junk food, and is also suspecting a femme-feline of stealing away her previous man- the boss. When she finds out what's really up, it leads to the unbelievable climax. And so on. I still keep thinking about my reactions to certain scenes, and the kind of sensibility about this whole project. Maybe in part its really lampooning something maybe more common in New Zealand, like with whatever kinds of variety shows or kid shows they have there. But it's also without a doubt that Jackson's also seen his share of Muppets, as the basic concept follows off from the Muppet Show. What's amazing about the film, and at times a little frustrating, is how a real mind-set of gonzo film-making is apparent. It doesn't seem original in parts, like it's taking things from other movies- or maybe other movies and shows that have come after this seem quite similar- but it really is in the bizarre, crude nature of everything. The climax probably holds the biggest laughs and surprises, even in its tight context of everything going to hell in a hand-basket. As its a world entire devoid of humans, all of its logic is based around how outrageous these puppets can be in their own whacked-out environment. With the exception of the naive, method-trained Robert, and maybe his love interest, every character in the picture is severely flawed in one way or another, or just really put to abstract lengths so mind-boggling they work only in conjunction with Jackson's unnerving, low-budget style. It has the same jarring, diabolically juvenile and in-your-face comedy of some of the South Park guys stuff (Team America and Cannibal sort of come to mind), but without necessarily the sharp edge of satire. And at the end of it all, with all the laughs I had and shocked 'huh' moments at what Jackson had done with all these weird characters (some of which are outright perverts, drug addicts, criminals, egoists, adulterers, and even father half elephant-half chicken offspring), I wasn't sure totally what the point of it all was. Maybe though there really isn't any; I have to think this is the kind of movie that a director makes with himself as the audience, and not really in a selfish manner either. It's not great art by any means, and doesn't pretend to be, which is part of the dark fun of it all: Meet the Feebles, with its singing and dancing miscreants (quite a catchy theme song by the way), and numerous scenes of more-than-suggestive sexual moments and gory bouts of extreme violence, is a case of kamikaze independent film-making, where homage spreads out into the concept and becomes something very strange but, in its own world, sort of wonderful too. It might be far from my favorite of the director's, but it's got things in it that are really fantastic and uproarious. It's one of those fine guilty pleasures of the late 80s.",
         "Unlike most people, I saw this film long before The Fellowship Of The Ring. In fact I saw it way back in 1992 and was simultaneously appalled, amused and impressed by it. Maybe it is best described as \"Bad Taste with puppets\" or \"The Muppet Movie in bad taste\" but it is certainly a movie I would recomend to anyone of sufficient maturity (no children should EVER see this film). Like Bad Taste before it this movie features disgusting humour, lots of blood, and impressive low budget special effects, and the puppets in it have to be seen to be believed. One of the best things about The Fellowship of the Ring (and I Love that movie as well) is that in the hype following it more people may see Meet The Feebles. Maybe Meet The Feebles and Bad Taste will be released on DVD in Australia now (I have them both on VHS). I will say one thing tho, it is certainly a strange feeling to have been a Peter Jackson fan for 10 years before Lord Of The Rings was released and the whole world finally discovered him.",
         "This is a really odd film for people who have always wanted to see the Muppets covered in doo doo or at least seriously injured by being hit by a bus. I like offensive, mean-spirited movies so this was right up my alley. Warning: do not show to children unless they are as warped as you are.",
         "Wow, what a fun-loving, brilliant, magical story for kids to enjoy, as well as adults. (hehe, OK, maybe not kids!) I liked this movie, since it took a typical kid show idea and morphed it into something straight outta hell. This difficult-at-times to watch movie will make the sick ones laugh, and I found myself laughing alot. It takes place in this weird freaking world where everyone is a puppet, and the feebles run this muppet-type show. The concept is great. Basically, instead of happy, fun-loving puppets, we have puppets who still have that \"crazy\" aspect that puppets usually do have, but with evil (and good) human traits attached. What you get, mostly, is an odd \"Hell\" kind of world. (Kermit, you better have been good, or you'll end up here!) Somewhere in my demented mind I have a great desire to show this messed up movie to a kid, and see how they react. But I won't, not yet... hehehehe! >:) Great concept. Difficult to watch. Messed up movie. Great for druggies. Not exactly for the kids...",
         "MEET THE FEEBLES is one of the most outrageously insane films I've ever seen, and I mean that in the BEST possible way...Another home-run from Peter Jackson (BRAINDEAD, BAD TASTE, and most recently LORD OF THE RINGS). FEEBLES is a gleefully perverse film where all the actors are Muppet-like puppets or people in full costume. The very basic story is that the FEEBLES is a variety show similar to the Muppets and that they are getting prepared for their first live telecast, when everything goes horribly wrong. So much happens in this film that I can't even begin to explain the story any more than that. Characters include (but are not limited to) a heroin-addicted frog, an over-sexed rabbit, a hippo with low self-esteem (and a short fuse...), a cow and insect porn film-making duo, a sleazy fly tabloid reporter...and a lovable and friendly porcupine. MEET THE FEEBLES is a gleefully twisted comedy that is often shocking and strangely endearing at the same time. Many will be offended so this film IS NOT FOR EVERYONE. But if you are a sick bastard like me and have a twisted sense of humor, this film is absolute genius!!! Very Highly Recommended 9.5/10",
         "Let me just say that this film is one of the most bizzare shocking and funny films I've ever seen. Where else can you see puppets doing cocane, having sex and singing about sodomy. The story is about a cast of bizzare puppets who are about to get a chance to perform live. There's the drug addicted veitnam veteran frog , a rabbit with vd a hippo whose husband is cheating on him with a siamese cat , a rat who makes porn flicks with cows and cockroaches, and then theres robbert who's trying to break into show biz. It all comes down to a hippo going on a rampage with a machine gun. Sure this movie looks like a kids movie but trust me this film will have anything to shock you. So sit back and enjoy peter jackson before he was working with hobbits and elves. Trust me you'll never be the same."
      ],
      "genres": [
         "Comedy",
         "Musical"
      ],
      "productionCompanies": ["WingNut Films"],
      "summaries": ["Heidi, the star of the \"Meet The Feebles Variety Hour\" discovers her lover Bletch, The Walrus, is cheating on her, and with all the world waiting for the show the assorted co-stars must contend with their own problems. These include drug addiction, extortion, robbery, disease, Drug dealing, and even murder. While this is happening the love between two of the stars is threatened by the devious Trevor the Rat, who wishes to exploit the young starlet for use in his porno movie business."],
      "budget": 750000
   },
   "movielensId": 4624,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-08-12",
      "dvdReleaseDate": "2002-03-26",
      "directors": ["Peter Jackson"],
      "runtime": 94,
      "movieId": 4624,
      "title": "Meet the Feebles",
      "mpaa": "R",
      "actors": [
         "Donna Akersten",
         "Stuart Devenie",
         "Mark Hadlow",
         "Brian Sergent",
         "Ross Jolly",
         "Peter Vere-Jones",
         "Mark Wright",
         "Danny Mulheron",
         "Jay Snowfield",
         "Doug Wren",
         "Peter Jackson"
      ],
      "imdbMovieId": "0097858",
      "originalTitle": "Meet the Feebles",
      "genres": [
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": [
         "afzrKqO8kDA",
         "UtSPU4rqtTU"
      ],
      "plotSummary": "Heidi, the star of the \"Meet The Feebles Variety Hour\" discovers her lover Bletch, The Walrus, is cheating on her. And with all the world waiting for the show, the assorted co-stars must contend with drug addiction, extortion, robbery, disease, drug dealing, and murder. Meanwhile the love between two of the stars is threatened by Trevor the Rat, who wishes to exploit the young starlet for use in his porno movie.",
      "tmdbMovieId": 8216,
      "avgRating": 3.3675,
      "releaseYear": "1989",
      "numRatings": 917,
      "posterPath": "/mQQptNMh4OgzmMjLbeHAyYO5fUp.jpg"
   }
}