{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "vietnam",
            "id": 2956
         },
         {
            "name": "vietnam war",
            "id": 2957
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "immigrant experience",
            "id": 208176
         }
      ],
      "imdb_id": "tt0107096",
      "video": false,
      "title": "Heaven & Earth",
      "recommendations": [
         6106,
         10132,
         39787,
         18856,
         12395,
         31659,
         23908,
         22073,
         10126,
         10333,
         7015,
         32221,
         46027,
         15006,
         34322,
         31676,
         38953,
         4639,
         46625,
         32077
      ],
      "backdrop_path": "/wK9KMT9ERHqvgBnLDU2hpxfnGD1.jpg",
      "revenue": 5,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Steve Butler",
               "gender": 2,
               "credit_id": "52fe44929251416c91015569",
               "name": "Tommy Lee Jones",
               "profile_path": "/gRXugLFvr1oHZ6alLUxmYDq8cgW.jpg",
               "id": 2176,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe44929251416c9101556d",
               "name": "Robert John Burke",
               "profile_path": "/ctVRWqY0KfSBIpaGulJMbhyE3jy.jpg",
               "id": 31512,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Big Mike",
               "gender": 2,
               "credit_id": "52fe44929251416c91015571",
               "name": "Timothy Carhart",
               "profile_path": "/1UEUs6UJdxjSbGakZflWuN4TS7T.jpg",
               "id": 17396,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Young Sergeant",
               "gender": 2,
               "credit_id": "52fe44929251416c91015575",
               "name": "Tim Guinee",
               "profile_path": "/8UeJw5Nwfq6YUT6xGtyi184jmbd.jpg",
               "id": 40275,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Le Ly",
               "gender": 1,
               "credit_id": "53a97a59c3a368749500626e",
               "name": "Hiep Thi Le",
               "profile_path": "/s7eDAproo0vjNpYyw1oK2yirwNS.jpg",
               "id": 167166,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Eugenia",
               "gender": 1,
               "credit_id": "52fe44929251416c91015579",
               "name": "Debbie Reynolds",
               "profile_path": "/p5o3qOl4bFZxrnUxG826cIN0GvP.jpg",
               "id": 8857,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Papa",
               "gender": 2,
               "credit_id": "52fe44929251416c91015583",
               "name": "Haing S. Ngor",
               "profile_path": "/dwvHUD5Q85IgxvDSEFXUlTtQq61.jpg",
               "id": 8976,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mama",
               "gender": 1,
               "credit_id": "52fe44929251416c91015587",
               "name": "Joan Chen",
               "profile_path": "/ekWS5bAB0kv4RColHqYaUAoXz0I.jpg",
               "id": 6720,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sau",
               "gender": 2,
               "credit_id": "52fe44929251416c9101558b",
               "name": "Dustin Nguyen",
               "profile_path": "/5smJtyCBYoHV6nbIf0Hv2APHqK0.jpg",
               "id": 61632,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Viet Cong Captain",
               "gender": 0,
               "credit_id": "52fe44929251416c9101558f",
               "name": "Liem Whatley",
               "profile_path": null,
               "id": 175791,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Madame Lien",
               "gender": 1,
               "credit_id": "52fe44929251416c91015593",
               "name": "Vivian Wu",
               "profile_path": "/sCB8qsYL8Qqf6pG2Z6gBEjOszNz.jpg",
               "id": 69033,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Anh",
               "gender": 2,
               "credit_id": "52fe44929251416c91015597",
               "name": "Long Nguyen",
               "profile_path": "/nK95uO8Y2bYxfZ83ojYNeFBRejV.jpg",
               "id": 111185,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Bernice",
               "gender": 1,
               "credit_id": "52fe44929251416c9101559b",
               "name": "Conchata Ferrell",
               "profile_path": "/p7KiBF2blE5KOXKrXMrVpMgCYZX.jpg",
               "id": 1909,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Uncle Luc",
               "gender": 0,
               "credit_id": "53a97b64c3a3687a2e006f5b",
               "name": "Thuan K. Nguyen",
               "profile_path": null,
               "id": 1333976,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44929251416c91015565",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44929251416c9101557f",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56db6e0ec3a3682db00003ce",
               "name": "Robert Kline",
               "profile_path": null,
               "id": 355372,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "581f649cc3a368555f0010c5",
               "name": "Robert Richardson",
               "profile_path": "/9tLrDHL9qL9yYIhcJVaINwnzmWN.jpg",
               "id": 149,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "581f64b192514168b90010ba",
               "name": "David Brenner",
               "profile_path": null,
               "id": 6051,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "581f64bcc3a3685563000e0b",
               "name": "Sally Menke",
               "profile_path": "/8cUdiGU7KhBgd8UNnoUYNCMZYgQ.jpg",
               "id": 156,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.989045,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 31642,
      "vote_count": 65,
      "budget": 33000000,
      "overview": "Le Ly lives in a small Vietnamese village whose serenity is shattered when war breaks out. Caught between the Viet Cong and the South Vietnamese army, the village is all but destroyed. After being both brutalized and raped, Le Ly resolves to flee. She leaves for the city, surviving desperate situations, but surviving nonetheless. Eventually she meets a U.S. Marine named Steve Butler who treats her kindly and tells her he would like to be married -- maybe to her.",
      "similar": [
         1368,
         1369,
         10590,
         13,
         613,
         28,
         11202,
         11778,
         371638,
         324786,
         363676,
         323677,
         2604,
         152532,
         300671,
         462,
         640,
         769,
         5915,
         276907
      ],
      "original_title": "Heaven & Earth",
      "runtime": 140,
      "poster_path": "/hXSUatA39pbfwaqOGFHFdwswAXc.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Tiếng Việt",
            "iso_639_1": "vi"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1993-12-24",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "An amazing true story of survival.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Oliver Stone"],
      "runtime": 140,
      "synopsis": null,
      "writers": [
         "Le Ly Hayslip",
         "Jay Wurts"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107096/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyMTMyMTY3Ml5BMl5BanBnXkFtZTcwMTMyMzMzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hiep Thi Le, Tommy Lee Jones, Haing S. Ngor | See full cast and crew »"],
      "reviews": [
         "As he did with his first two Vietnam films, \"Platoon\" and \"Born on the 4th of July\", Oliver Stone creates a powerful tale of the devastation of the Vietnam War. What makes this movie so unique, both from Stone's earlier work and virtually every other American movie about the Vietnam War, is that \"Heaven and Earth\" is told from the perspective of a Vietnamese woman. This movie is based on two books of memoirs written by Le Ly Hayslip, a Vietnamese woman who grew up in a simple farming village in central Vietnam but whose life --- and those of most Vietnamese people, we can infer --- is turned upside-down by the madness of the Vietnam War. Strictly as a movie, this is a good but not great film. Even at almost 2 1/2 hours, the structure is a bit stilted in order to accommodate such an extensive story. The first 30 minutes are mostly voice-overs and the movie doesn't pick up steam until later, when scenes are allowed to flow for extended amounts of time and we become caught in the drama. Tommy Lee Jones gives another brutally realistic performance as a lifetime military man who can't leave the war behind. Hiep Thi Ly is okay as Le Ly Hayslip; not Tommy Lee Jones caliber acting, but she competently plays a very difficult role. I read she was an amateur actress only chosen after an extensive casting call, and I'm glad that they decided to go with an actual young Vietnamese woman instead of choosing a generic asian actress. It might not make a difference to most, but it certainly felt more \"real\" to me with an authentic Vietnamese-American in the main role. Oliver Stone shows his mastery of mood and camerawork as he jumps from the beauty of the Vietnam countryside, to the ravages of war, to the shocking (for Le Ly) wealth of suburban America. The movie occasionally drags but overall I'd still give it an 8 out of 10 because it's such a powerful and important addition to the cinematic depiction of the Vietnam War. The movie also inspired me to read the 2 books (\"When Heaven and Earth Changed Places\" and \"Child of War, Woman of Peace\") it was based on. Stone had to compress many events in order to fit the run time; for example, the Tommy Lee Jones character is a fabrication based on 3 different men (and probably meshed into one man as much for the drama such an explosive character provides as for the time constraints), while her books spend extensive time on all 3 relationships. However, the dialogue for several key scenes were taken almost word for word from her books, and I thought it captured the spirit of the story remarkably well, especially for a major studio movie. I highly recommend anyone interested in the film or in the war to read these books, and I commend Oliver Stone for making a trilogy of important films not just for cinema, but for American history.",
         "I don't understand why most people don't appreciate this movie. I guess one reason is that it's not easy to look at your own people, US soldiers, as enemies, or at your country - in the final - as the land of fatty meaninglessnes. Or maybe they were expecting something different from Stone, something more than that history - not so unusual as someone observed - of a simple vietnamese country girl. The point, for me, is that this is not a film about the vietnam war, which is only the background. If you make the effort to forget the vietnam war, its historical and cultural legacy, to avoid being on the side of one of the armies (maybe is easier for me, being an italian), you'll discover one of the most intense movie about the family and the bonds with the earth where you belong. Stone through the story of this simple girl succeeded in telling the story of entire humankind, analizing those which are its roots, its ties, its hopes, its condemnations. Honestly, one of the best movies I've ever seen. Sincere, profound, touching. True.",
         "I should state this up front: I'm an American who was born in 1970 towards the end of the Vietnam War and I know very little about it *first-hand*. Most of what I know is from school and the media -- the men in my family who were there just don't talk about it. My wife and my closest friend for the past 9 years was born in Danang, (central) Vietnam, in 1969 and remembers some personal experiences as a child at the end of the war and after until she escaped without her family in 1982 to Hong Kong. I've *been* to Vietnam including the areas where this movie takes place. This movie very accurately expresses a common view of the war by many Vietnamese people of the era -- that when a civil war like this occurs around you and your home with both sides there day and night your concept of right and wrong can easily change. (or heaven & earth \"change places\" as they put it in the movie) If you can possibly get the DVD, you can see deleted scenes including an \"alternate/extended\" beginning to the movie. It was actually a 30 minute clip that was cut down to be the first 5 minutes of the released movie. It's very interesting because it illustrates many basic parts of Vietnamese life (mainly rural life) as it has been for hundreds or thousands of years. Yes, this movie contrasts pre-war, war, and post-war life for the Vietnamese (for the ones who stayed there and also for Viet Kieu or overseas Vietnamese like my wife) sometimes in a ridiculously extreme way. Even though life was \"idyllic\" before the war and horrible during and after, the Vietnamese have fought for literally thousands of years to retain their national identity and independence not just against Americans but also the French, Japanese, and Chinese to name a few. If you've been moved by other Vietnam War movies, but haven't seen this one then you have only seen the story told from our viewpoint, which is absolutely vain. If you haven't, you must see this movie for their view of the \"American\" war. Hopefully it will inspire you as it did me to learn more about the Vietnamese people and their long, proud history spanning thousands of years.",
         "Oliver Stone has always had a special bond with Vietnam. He is a veteran of that war and the theme about a veteran trying to cope with his war experiences is a subject that comes back in several of his movies. This is the last movie in his Vietnam trilogy. His first movie was \"Platoon\" (1986), his second \"Born on the Fourth of July\" (1989) and the third one was \"Heaven & Earth\" (1993). In Heaven & Earth he tells the true story of a Vietnamese village girl who survives a life of suffering and hardship during and after the Vietnam war. Before she meets and marries the U.S. marine Steve Butler, she already has had an entire life behind her. She once fled for the violence of the Viet Cong, leaving her farming village for Saigon together with her mother. But soon she disgraced herself by becoming pregnant with her new master's child and as an unmarried mother, she tried to make a living by being a freedom fighter, a hustler and sometimes a prostitute. As soon as they are married, they move to the USA, but life on the other side of the ocean certainly isn't as perfect as she imagined it to be... Some people say that it is a good thing that Oliver Stone has finally made a movie that shows the Vietnamese perspective of the war and I agree, but only to a certain extend. It's true that we only get to see movies that show the American side of the story and that we need other movies that give us a broader view on the matter, but \"Heaven & Earth\" isn't the only 'reversed' Vietnam film. Perhaps not many people know this, but the French movie \"Indochine\" (1992) does approximately the same. The main difference with \"Heaven & Earth\" is that it doesn't talk about the 'American' period, but about the French colonial period that proceeded it and in which time the Vietnam war really started (The French had almost lost all their battles when the Americans came to help them and thereby got completely stuck into the war themselves...). But it is true, Oliver Stone has done a nice job with this movie. He has made it an interesting character study, with the war always present in the background. The acting is very good and I don't think there could have been a better actor than Tommy Lee Jones to play the role of Major Steve Butler. The other actors all did a good job too, in fact, I might say that Stone has had an excellent cast to work with and he probably got the most and the best out of them. If there is one lesser point to this movie, although only a small one, than it must be the language. The Vietnamese all start by speaking almost perfect English to each other, but when they speak to Americans their English is poor, yet when they speak to each other in front of an American its in Vietnamese. I believe it would have been better if Stone had chosen to let the Vietnamese speak their own language all the time and to speak with an accent when speaking to the Americans. But as I already said, I only see this as a minor detail and it certainly didn't spoil the good times that I had with this movie. This is an underrated movie that deserves to be seen by a great audience. I give it a 7.5/10 at least, perhaps even an 8/10.",
         "I don't understand why this film has been rated so poorly, it really deserves better. The breath-taking landscapes, subtle imagery, the overall excellent craftsmanship alone make this movie worth seeing. The unique and very personal perspective of this movie makes it hard to keep your distance. Some scenes are rather brutal, but these scenes are necessary for telling a realistic story. Definitely no Disney family movie though. I give it a 9 out of 10, because even with 140 minutes runtime the story feels rushed and crammed. Sometimes less is more, I shall read the books now.",
         "Oliver Stone's \"Heaven and Earth\" is a fantastic film that shows what the effects of war are on the human spirt. Now, more than ever this film is very poignant. The movie is based upon two of Lelay Hayslip's memoirs which chronicle her growing up in Vietnam and the effects of war upon her, her family and her country. It was fascinating and at times very difficult to watch. I couldn't help but thank God that as Americans we have not had to experience what the Vietnamese went through. The view of war that Stone portrays is very humanistic. One line in the film was especially riveting.... \"Rebuilding a country after war is like having a family thru rape\". We see how the war throws apart Lelay's family. If you haven't seen this film.. I highly recommend it!",
         "A different perspective of war, and very much needed one. This story covers the lives affected by war. The male lead undergoes emotional strain while the female lead contrastingly grows strength from, or perhaps in spite of the war. The movie's subtext is thankfully never handed to you in a Hollywood-direct manner - yet the movie develops it thoroughly for the viewer. This is the most plain statement there is that war is much more than the sides of the conflict, the survivors, the wounded, the dead. And, it makes clear that the trauma caused affects many for a long long time, and for each it is their own journey. Oliver Stone is obviously a master movie maker. He is a great story teller and you are always provided a visual and sound experience like no other. This movie contains some incredibly beautiful shots which all by themselves are worth the viewing. When combined with the plot, the beauty contrasts with the brutatilty to help develop the subtext mentioned above. You might notice I have never said if I like the film. Because the subject matter makes me queasy, uneasy, I don't think I could ever say I like this. But, this is a very powerful film that got under my skin. So, here I am recognizing the movie for its message and method, not necessarily for providing me a Pavlovian reaction seeking more. Instead of plopping in another war DVD, try this one. I bet you will walk away and it will continue to live with you.",
         "After a long string of box office and critical successes, Oliver Stone tried making a different kind of war film, this one being shown from a Vietnamese woman's perspective. Very interesting and entertaining throughout, but it does have some extremely unpleasant and cruel scenes, not unlike many other war films. The first hour of the film takes place in Vietnam during the war and is full of Vietnamese culture and feeling. As soon as Tommy Lee Jones comes into the picture as an unstable American soldier, the film soon feels and becomes much more Americanized and eventually very depressing. An interesting work from Oliver Stone that unfortunately was barely released in 1993 and received lukewarm reviews from critics. Still, its worth watching, and its never boring. 7/10.",
         "\"Different skin, same suffering.\" Only a director such as Oliver Stone, who is not afraid to take risks and say what needs to be said could make a set of films so daring and powerful that they almost beg to be watched. For those who don't know Stone himself fought in Vietnam. He has since made, not only three of the best films on Vietnam, but three of the best war films period. The first is the award-winning Platoon, followed by Born on the Fourth of July and finally this one. What makes this trilogy so good is that instead of making three war films he has made on war film and two other character studies to accent it. Also these films are not just about huge battles and high body counts like a lot of today's war films. Stone is just as concerned in showing the war going on inside every man on the battle field just as much as the war at hand. Platoon was based on Stone's personal experience in Vietnam, he made an atmosphere where every step could bring death and there was no sympathy. It was hailed as a masterpiece, winning Stone an Oscar for best director and also placing it as one of the greatest war films ever made. Instead of travelling back to Vietnam, Stone decided to follow up Platoon with a look into the decayed life of a worn down veteran. When We Were Soldiers came out last year it was praised as being one of the only films to show that the soldiers were just as human as your or I. Obviously these people didn't see Heaven and Earth because this film bases itself almost entirely on showcasing the life and struggle of a war victim. The only difference here is that it is the life of the enemy. Can anyone honestly say that while watching a war film they think of how whenever an enemy is killed it is someone's son or brother dying or, how the war is effecting the innocent ones? I can say that I haven't and this film has helped me see Vietnam through an all new set of eyes. That is why Stone is such a great director, even though he fought and killed these people he still finds it in his heart to show both sides of the story. This film often gets mixed reviews and I guess that is because it is being compared to Platoon, but to say that one is better than the other would be missing the point. Although they are entirely separate films they all function as one entity and must all be seen in order to see Stone's vision, and a hell of a vision it is, these are three of the most realistic and horrifying war films to date. This is the true story of a young, Vietnamese girl named Le Ly who lives in a small village that is being ravaged by war. The inhabitants spend most of their day peacefully growing rice because it is their only food source. \"We worked like slaves and all we wanted was a bowel of rice and another day alive\" says Le Ly's father, a line that is important towards the second half of the film. She is then taken away and tortured for information. These torture scenes are brutal ad were particularly hard to watch due to their brutal realism. She is then released on a bribe from her parents that has the whole town questioning their ties with the government. She is the taken away by the Viet Cong and raped because they suspected she gave away information. Her and her mother then move to the city to become servants but are soon asked to leave after Le Ly gets pregnant with her masters son. She then meets Steve; a solider that she thinks just wants sex before he goes home. It turns out Steve is a nice guy. The two get married and go back to Chicago to live in America. Suddenly she sees that America is not what it is cracked up to be. Even though she now has more she was at least happy at home in Vietnam. Now she finds herself seeing tables of food wasted and is living with a family of plastic people who are following the American dream. The film actually functions as two separate works. The best being the first half that is possibly the saddest and most heart-wrenching depiction of a war stricken human being these eyes have ever seen, it truly is powerful stuff. When Le Ly and Steve move to American it stops being a war film and Stone gets a little carried away. He chooses an other-the-top style of direction to show every American as shallow pigs who are blinded by all their material possessions and look down upon the relationship. \"They don't understand, but I do.\" Says Steve. But Stone is smart in how he shows that even though America has much more than Vietnam that doesn't mean it is better. In Vietnam you had to work together and function as a team in order to achieve anything. Everyone loved each other and the people were happy with that. In America it is either push or be pushed, there is no sympathy for anyone. Although this was a smart way to contrast the war, after an hour and a half of watching the horror of Vietnam I felt a little obscure when then film suddenly changed from a war picture. Especially when just coming out of hardships that are enough to twist anyone's heart into knots. This then levels off and we are left with a study of bigotry and how one mans possessions can corrupt his mind and blind his eyes. Stone shows us that although war can leave a life torn and mangled, the people who came out of it are not cold and alone. These people are human beings as well. I don't think people realise this because in most war films we don't see the face of the enemy, they are just nobodies who have set out to be killed. This film helps us realise that they can love, they can hurt, they can feel and the can bleed just like the rest of us. Stone has not just placed a solider and a Vietnamese girl together and sees what happens. He has placed a human and a human together to see how they adapt and grow as one and as separate parties. We see how certain things react with certain emotions and how certain feelings are flared in different situations. Le Ly is not some character that has been made up; she was a real life human being who went through real life struggle. She was a human who lived in a human world. Stone does a fabulous job at showing that Le Ly was a human and he gets us so deep inside of her we can't help but feel for her. Stone filmed on location and the scenery is beautiful. Stone soars his camera across the stunning green plains, through the swaying rice fields, atop the tree and up into the shimmering blue sky. His use of scenery also helps to feel the tragedy when all the beauty is swept away and the horror of war begins. Stone also wrote the screenplay which he based on the two memoirs written by the real life Le Ly. Again he does an amazing job if showing the horrors of war, but this time without using mounds of violence. He also does a great job of contrasting the life in Vietnam as compared to that in America by making them seem like almost separate worlds. I also love the dialogue in this film. It is touching, heart-breaking and empowering all at the same time and that is rare in war films. The acting is also superb from Hiep Thi Le as Le Ly. This girl can show all of her inner torture yet innocence just through her eyes. Tommy Lee Jones is also good as her partner yet enemy Steve. Both of the actors show their humanity on their faces and their struggle in their eyes and easily change emotion from environment to environment, even from minute to minute. Because Stone can make a film like this, showing and saying what many would be afraid to, he truly is one of the greatest directors of our time (only being matched by David Lynch). It is nice to see that someone cares enough to show us that even though they were our enemy, the people of Vietnam were just as effected by this war as anyone in America and that they people just like us. Even though the two films following Platoon didn't reach the success or praise of the first film, Stone has made has made a great American trilogy. Three war films that have just as much to say as they do to show and it would be a tragedy to pass any of them up. Whether you are interested in Vietnam or just want a war film with something more than endless violence, this one is worth checking out.",
         "Wow, some people live their lives the same way like robots till their death, but this woman lives her life with so many dramas. Same thing is happening in Iraq now, people here in the US are enjoying their lives to the fullest while so many innocent Iraqi people are suffering with no end. I am surprised that the rating is not too high. The movie \"Deer hunter\" which was also about Vietname war, it was so slow and boring. If it didn't win some Oscars, I would have stopped watching in the middle of it. This movie is about the same feature length, but this one is much more emotional, and not boring at all. It is another tear-jerking movie. This movie helped me to understand the pain that Vietnamese people suffered during the war. It is very authentic. Those are the common people who just want to make the best out of their lives, they just want to live. It was especially touching when she finally came back to her village, and her brother told her about how he felt throughout the years. She is not a hero, but she is such a brave woman who suffered so much, who almost died. How many of us will ever live a life like hers. In the end, this movie makes all of us to treasure the life that we have now, there are so many people who are living in this world who still don't have the things that we take for granted. Thank you for all those who worked on this great movie."
      ],
      "genres": [
         "Action",
         "Biography",
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": [
         "Alcor Films",
         "Canal+",
         "Ixtlan"
      ],
      "summaries": [
         "The final movie in Oliver Stone's Vietnam trilogy follows the true story of a Vietnamese village girl who survives a life of suffering and hardship during and after the Vietnam war. As a freedom fighter, a hustler, young mother, a sometime prostitute, and the wife of a US. marine, the girl's relationships with men suggests an analogy of Vietnam as Woman and the U.S. as Man.",
         "Fleeing the violence of the Viet Cong, Le Ly leaves her farming village with her mother for Saigon. After disgracing herself by becoming pregnant with her new master's child, she moves in with her sister and, through hustling the American troops, meets up with Steve Butler. They become lovers and, encouraged by his promises, she agrees to return with him to the strange but wonderful land of \"America\"."
      ],
      "budget": 33000000
   },
   "movielensId": 465,
   "movielens": {
      "languages": [
         "English",
         "Tiếng Việt"
      ],
      "releaseDate": "1993-12-24",
      "dvdReleaseDate": "2004-10-19",
      "directors": ["Oliver Stone"],
      "runtime": 140,
      "movieId": 465,
      "title": "Heaven & Earth",
      "mpaa": "R",
      "actors": [
         "Tommy Lee Jones",
         "Robert John Burke",
         "Timothy Carhart",
         "Tim Guinee",
         "Hiep Thi Le",
         "Debbie Reynolds",
         "Haing S. Ngor",
         "Joan Chen",
         "Dustin Nguyen",
         "Liem Whatley",
         "Vivian Wu",
         "Long Nguyen",
         "Conchata Ferrell",
         "Thuan K. Nguyen"
      ],
      "imdbMovieId": "0107096",
      "originalTitle": "Heaven & Earth",
      "genres": [
         "History",
         "War",
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["WpjxuJV6FfY"],
      "plotSummary": "Le Ly lives in a small Vietnamese village whose serenity is shattered when war breaks out. Caught between the Viet Cong and the South Vietnamese army, the village is all but destroyed. After being both brutalized and raped, Le Ly resolves to flee. She leaves for the city, surviving desperate situations, but surviving nonetheless. Eventually she meets a U.S. Marine named Steve Butler who treats her kindly and tells her he would like to be married -- maybe to her.",
      "tmdbMovieId": 31642,
      "avgRating": 3.26209,
      "releaseYear": "1993",
      "numRatings": 765,
      "posterPath": "/hXSUatA39pbfwaqOGFHFdwswAXc.jpg"
   }
}