{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0432260",
      "video": false,
      "title": "Brothers of the Head",
      "recommendations": [
         93946,
         33247,
         18869,
         69324,
         42264,
         57978,
         30177,
         61280,
         42142,
         106837,
         111469,
         41166,
         38770,
         80572,
         5333,
         43886,
         13943
      ],
      "backdrop_path": "/uDq4MZq6xEVMMzejzozP6ooSa6s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 26,
               "character": "Barry Howe",
               "gender": 2,
               "credit_id": "564665c99251413ad7000a5e",
               "name": "Luke Treadaway",
               "profile_path": "/TitiF5bdbrj9sn3vHve8XcfO8j.jpg",
               "id": 103351,
               "order": 0
            },
            {
               "cast_id": 27,
               "character": "Tom Howe",
               "gender": 2,
               "credit_id": "564665e19251413adb000ab8",
               "name": "Harry Treadaway",
               "profile_path": "/jqnSVR4J3aCaPBKeSfApJh9ntiN.jpg",
               "id": 45051,
               "order": 1
            },
            {
               "cast_id": 24,
               "character": "Nick Sidney",
               "gender": 2,
               "credit_id": "5548a7159251415602001da2",
               "name": "Sean Harris",
               "profile_path": "/zTUONNd9Lq063lpp7GvtjzZmMLW.jpg",
               "id": 16702,
               "order": 2
            },
            {
               "cast_id": 25,
               "character": "Chris Dervish",
               "gender": 2,
               "credit_id": "5548a732c3a3687886001ed7",
               "name": "Edward Hogg",
               "profile_path": "/cZ9Iqj7l0vmpHcJBA26JYKgqVLP.jpg",
               "id": 114252,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Henry Couling",
               "gender": 2,
               "credit_id": "5548a5cc92514155fd001d4e",
               "name": "Jonathan Pryce",
               "profile_path": "/dAgcoPcDtlhIUTrksPtsWdlfBX.jpg",
               "id": 378,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Brian Aldiss",
               "gender": 2,
               "credit_id": "5548a5e9c3a3687882001d31",
               "name": "James Greene",
               "profile_path": "/mQNSBTK93AXGGd5f0mbQqPhgBtY.jpg",
               "id": 1266585,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Boatman",
               "gender": 2,
               "credit_id": "5548a5ff92514155fa001d43",
               "name": "John Simm",
               "profile_path": "/5D2ZDf6yX65fnvzvE9hIT6D30b4.jpg",
               "id": 42604,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5548a61592514155ff001a85",
               "name": "Ken Russell",
               "profile_path": "/8LcmAJ2STZUmN0cFriDFtXug9Pz.jpg",
               "id": 32327,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Roberta Howe",
               "gender": 0,
               "credit_id": "5548a647c3a3687886001eb3",
               "name": "Elizabeth Rider",
               "profile_path": null,
               "id": 1463146,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Zak's Mum / Rita Bedderwick",
               "gender": 0,
               "credit_id": "5548a674c3a3687886001ebe",
               "name": "Anna Nygh",
               "profile_path": null,
               "id": 1211868,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Zak Bedderwick",
               "gender": 0,
               "credit_id": "5548a6b1c3a3687877001e77",
               "name": "Howard Attfield",
               "profile_path": null,
               "id": 1230421,
               "order": 10
            },
            {
               "cast_id": 28,
               "character": "Laura Ashwood",
               "gender": 1,
               "credit_id": "56466664c3a3682605000a3d",
               "name": "Tania Emery",
               "profile_path": null,
               "id": 152202,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d39251416c75084c5d",
               "name": "Keith Fulton",
               "profile_path": null,
               "id": 74647,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d39251416c75084c63",
               "name": "Louis Pepe",
               "profile_path": null,
               "id": 106537,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5548a1ba92514155fd001cba",
               "name": "Tony Grisoni",
               "profile_path": null,
               "id": 19725,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5548a1d7c3a368787b001d8c",
               "name": "Brian Aldiss",
               "profile_path": "/tkrHtRYb2TqBHedzlnzXXpa9PcI.jpg",
               "id": 9635,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5548a1f9c3a368787e001b8c",
               "name": "Simon Channing Williams",
               "profile_path": null,
               "id": 20423,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5548a20e9251417afc000a37",
               "name": "Clive Langer",
               "profile_path": null,
               "id": 1463143,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5548a222c3a368787b001d9d",
               "name": "Anthony Dod Mantle",
               "profile_path": "/wpdk8Wo8xGhvZ4WVee2miDSfPj8.jpg",
               "id": 1570,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5548a2b19251415602001cff",
               "name": "Nicolas Gaster",
               "profile_path": null,
               "id": 75079,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5548a2f2c3a3687877001dd7",
               "name": "Nina Gold",
               "profile_path": "/kljYhRvTAqQfX198mjz0ITP0hFM.jpg",
               "id": 16363,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5548a313c3a368787b001dbd",
               "name": "Jon Henson",
               "profile_path": null,
               "id": 582928,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5548a324c3a368788c001adf",
               "name": "Patrick Rolfe",
               "profile_path": null,
               "id": 1327443,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5548a33792514155fd001cf6",
               "name": "Michelle Day",
               "profile_path": null,
               "id": 26194,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5548a349c3a368787b001dc6",
               "name": "Marianne Agertoft",
               "profile_path": null,
               "id": 1053074,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5548a532c3a3687877001e2f",
               "name": "Emma Fryer",
               "profile_path": null,
               "id": 1463145,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "5548a55b9251413837001001",
               "name": "Sylvia Parker",
               "profile_path": null,
               "id": 1402943,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5548a595c3a368787e001c1c",
               "name": "Anna Nygh",
               "profile_path": null,
               "id": 1211868,
               "department": "Crew",
               "job": "Choreographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.151081,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 16429,
      "vote_count": 9,
      "budget": 0,
      "overview": "In the 1970s a music promoter plucks Siamese twins from obscurity and grooms them into a freakish rock'n'roll act. A dark tale of sex, strangeness and rock music.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         101,
         205,
         141,
         241,
         949,
         550
      ],
      "original_title": "Brothers of the Head",
      "runtime": 93,
      "poster_path": "/4YVWpJyyAkbb6q6EutC0WW2EBqd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Screen East",
            "id": 7276,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Potboiler Productions",
            "id": 36615,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Blue Sky Films",
            "id": 19651,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "EM Media",
            "id": 1917,
            "origin_country": ""
         },
         {
            "logo_path": "/5uoaxZCSYuc6KEiJgEYSWzLIFAW.png",
            "name": "Film4 Productions",
            "id": 6705,
            "origin_country": "GB"
         }
      ],
      "release_date": "2005-01-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Keith Fulton",
         "Louis Pepe"
      ],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Brian Aldiss",
         "Tony Grisoni"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0432260/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMDMwMDM4MV5BMl5BanBnXkFtZTcwNDI2OTMzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Luke Treadaway, Harry Treadaway, Jonathan Pryce | See full cast and crew »"],
      "reviews": [
         "Directors Fulton and Pepe get full marks for the rare feat of making a film where the fake-verite style is not a distraction and takes a back seat to the story and characters. The film is very deftly crafted, especially considering the subject matter. After all, the film is about conjoined twins being sold to a music promoter who wants to make them into pop stars. (The mind boggles at the heavy-handed way such a story MIGHT have been told.) And, yes, there is an actual meat and potatoes story here. The fact that these brothers are conjoined is key to the plot, but mercifully, it is NOT a one-note gag that the whole film is hung on. The directors made many interesting and ultimately daring choices, such as shooting the film in a verite style. Unfortunately, this will beg obvious (but ultimately irrelevant) comparisons to other fake-verite films with musical themes. Another interesting choice was shooting the performance scenes in what appear to be live takes, rather than having the actors lip sync to a studio recording. This seems like an insane choice because of the extra casting and logistic hassles. You'd have to find actors that could actually play, get them to practice together and then who knows if they'll be a decent band. But they pull it off. The music is authentic-sounding pre-punk--an undeniably raw and vital soundtrack. (I'll buy the soundtrack for sure. They could even put this band on tour and I'd go see them.) So, here's to insane choices. There are modest, surreal sequences between some scenes, but the directors know when to say when on this. The art-house crowd (and the stoned) are thrown a bone. But normal people will not be left rolling their eyes or checking their watch. These parts don't feel like art for art's sake. The casting is amazing. Using two different actors to play the older and younger versions of certain characters is yet another interesting choice. A few of the actors bear such a striking resemblance to one another that you may find yourself scanning the credits to see if they're related. This is the first narrative film by these two directors and I wholeheartedly encourage them to make many more films.",
         "I suppose that a film about co-joined twins who become punk rock stars in the mid-70's has to have something going for it and, indeed, this partially successful film did keep me gripped for most of the journey. As with most rock films, melodrama is the order of the day and this is no exception as the boys face physical abuse, drugs and rock star blow-out in the grand tradition of the likes of Hazel O'Connor in that other punk drama Breaking Glass. There is much to like in this film including the stylised direction which veers away from the mockumentary format into more creative territory from time to time. There are some excellent ideas at play here; including scenes from an 'unfinished' Ken Russell film. The problem is that this film is screaming out to be great little cult film but it never quite succeeds; perhaps its the lack of humour and the ease with which it lapses into cliché. Mostly though I think the tired 'mockumentary' format is what ultimately works against this film. Interesting and worthwhile but ultimately not the success it should and could have been.",
         "Some people seem confused as to whether they are supposed to take the film seriously or not. Perhaps such people are going into it thinking in terms of the standard mockumentary format, satirical in an obvious form of comedy. That is, taking an idea to the extreme version of itself to point out the irony on the subject matter. This concept is certainly taken to the extreme as any good satire, but it does not rely on humor to get this point across. The approach used in this film is fresh and unique, exploring human exploitation without actually exploiting anyone. I was forced to look inside myself and find my own values and beliefs in this unconventional story and I commend the filmmakers for giving me the opportunity to do so. The messages are more subtle and require more participation than most satirical portrayals, so perhaps this is something people are not ready to do with this subject matter. If you think you might like a challenge, set yourself outside your comfort zone and see this movie. Decide for yourself, don't depend on the unfair opinions of those unprepared for the experience for what it is, not what they think it should be.",
         "This film lingered in the memory for days after I saw it. It was a portrait, not only of the scabbier side of the music business, but of the intimacy, love and hate that exists between siblings of all descriptions. A lot of it rang true; the cinematic values were lovingly collaged within an overall 'feel' that was at times stunningly beautiful. The performances, particularly of the real-life identical twin brothers, Luke and Harry Treadaway, were lyrical, loving and intense. There was a sense that these two talented actors-who are also rock musicians in their own right, no musical stand-ins or overdubbing here-were giving the performances of a lifetime. After all, how many conjoined-twin-rock-star movies are there likely to be? Having said that, the fictional Howe brothers made a stunning metaphor for the freakishness that is almost a natural part of getting on a stage and screaming into a microphone; it really looked as though it could work, especially in this post-Slipknot world. The plot was, at times, obscure; there was perhaps a bit too much cleverness in the multiple, and terribly post-modern, overlapping of supposedly-documentary narratives. I found that there was so much going on within the structure that I hardly noticed the climax of the story. In all, to my surprise, I would describe this as a beautiful film, but with enough rock'n'roll grit to keep me riveted. We need more films like this.",
         "Deceiving audiences is risky business when it comes to films. You don't want to anger the watchers by pulling the wool over their eyes in an effort to show how naive they are. But if you do it right, and entertain them without this intent, you can pull magic out of a hat. BROTHERS OF THE HEAD (an IFC film) is a slice of fiction shot in documentary format. It is done so convincingly (including interviews with the author of the actual novel, Brian Wilson Aldiss) that if someone wasn't aware of the film's machinations, they could easily be fooled. Although the characters and situations are completely fictitious, the era and locations and industry it portrays certainly are not. The basic premise is that of exploitation for money and fame. Some people have no morals and will do anything to make dollars, including putting conjoined twins up on a music stage in an effort to expose the strange and bizarre; a circus act of music. The young boys' names are Tom and Harry Howe (real life twin brothers Harry and Luke Treadaway). Their mother having died at birth, the boys are swept into isolation by their protective father and their older sister. But reality sinks in as the father realizes the boys must earn a viable living somehow. When an unscrupulous entertainment guru approaches the father with a significant contract offer, the father jumps on it and the boys are sent away and taught to sing and play guitar. The British punk-rock movement of the early 70s is in full swing and the Howe brothers melt into it like heroin on a hot spoon. Their odd Siamese connection is exploited to the max, and audiences (particularly young women) fawn over the unusual pair. Interviews with lovers, managers, supposed friends, and even the fake documentary maker are driven home with painful results. The boys are seen initially as creatures, but soon they are transformed into stars. Drugs, sex, smoking, alcohol, all become part of their daily existence as they sink further and further into a world they were never prepared for. The mockumentary utilizes flashbacks to great advantage, showing \"the head\" (the location where the boys grew up) in increasingly muted and shadowed tones. It's also noteworthy to mention that \"the head\" has two distinct definitions: the first being their birthplace, and the second being a fetal head growing out of Barry's shoulder. This second head is only touched on, mentioning that it may very well be the downfall of the boys thanks to its cancerous nature. But the boys aren't brought down by cancer or drugs. They succumb to the world of fame the way many rising stars do. The ending is touching and not just a bit frightening. We know from the beginning that the boys will die (everyone refers to them in past tense from the get-go), but the manner in which they die is lonely and bitter. There's a lot to love about this film. The British punk-rock music of the 70s is authentic (if somewhat hard to understand), and the Treadaway brothers pull in Oscar-caliber performances. The fact that some movie watchers will continue pondering the reality of the film incorporates a significant \"Wow\" factor.",
         "When I viewed the catalog for the Cleveland International Film Festival, Brothers of the Head was the first film I decided I wanted to see. It had all the potential of being a great rock movie with an interesting twist. The film itself was not completely what I had expected. The storyline was interesting and unusual. The music was humorous. The acting was great. The cinematography was excellent, especially during dream sequences that appear throughout the story. The one problem with this film, which has the potential to destroy the entire experience for the viewer, is its faux-documentary style. The writing was obviously intended to give a third person narration of the boys' life so that it is more dark and tragic. In this way, it is absolutely effective, especially at the conclusion of the film. However, it slows the beginning and keeps the viewer from being pulled in at the start. Many viewers in Cleveland found that this kept them from enjoying the rest of the film. It is sad that such an unusual film may not meet its full potential because of not-quite-there writing.",
         "Experts can outline for you the elaborate history of rock docs and mock rock docs. Suffice it to say that Keith Fulton and Louis Pepe's Brothers of the Head goes them all one better with the kinkiness of the fantasy world it creates. It's about Seventies Siamese-twin boys from a remote area in England joined at the lower chest who're taken up by an impresario looking for something special: a musical freak show. Isn't that redundant, in the era of Lou and the Velvet and Ziggy and the New York Dolls? Well, no, because we've never seen a movie about Siamese twins before and we'll never see one about Siamese twin rock stars again. Real twins Harry and Luke Treadaway play Tom and Barry Howe, respectively, with incredible enthusiasm and scary charm. Joining them is a large band of prosthetic conjoining flesh, hidden at first but successively more boldly revealed in public performances when the initial audiences thought them a fake. Probably none of this would work if the two actors didn't look like the healthiest, happiest, prettiest English boys you could imagine. When they do the intimacy and the conflict involved in such a scene, the Treadaways know whereof they speak. The heart of the movie is watching them together in action. The opening scene shows a lawyer tiptoeing into a damp corner of the northeast English coastline to get the dad of the two boys to sign a contract. This turns out to be a clip from \"Two-Way Romeo,\" an unfinished fictional film about the boys' lives by Ken Russell, who talks about the \"project\" on screen. A down-on-his-luck manager, Zak Bedderwick (Howard Attfield), we learn, found the actual twins and had them trained musically to develop a novelty rock band. Later we alternate between successively creepier cuts from Russell's opus interruptus (in his version one of the boys gets a fetus growing out of his stomach) to the \"real,\" also unfinished, documentary done in the early to mid-Seventies by American filmmaker Eddie Pasqua (Tom Bower) about the boys' shaky beginnings -- they're lodged in a big empty mansion where their rough working class musical manager Spitz (Stephen Eagles) beats Barry, the more obstreperous twin, to keep him in line -- and ultimate rise and hectic meltdown of hysteria, emotional conflict, sex, drugs, and inevitable, obligatory breathless self-destruction. Later after their talent-less-ness is patiently trained out of them and Tom masters guitar and Barry does lead vocals, they sing together and get so much into the whole performance thing (Roeg's Performance may come to mind--something of the same hothouse surreal sensuality is evoked) along with the high of public appearance-cum-substance abuse, the twins are having a mad, wild good time.. But the more they enjoy themselves -- and this is what undercuts the creepiness: the sense of pure joy of self realization -- the more being forever conjoined becomes both raison-d'être and curse for the pair. The film's ultimate guilty pleasure is absorbing a sense of the many complex levels of physical and psychic interaction Siamese twins (especially in such an intense lifestyle) would have, which the real twin actors are able to play convincingly: Tom and Barry go from finishing each other's sentences to erotic acts we can only imagine. They eventually become a manic pre-punk pair in a band known as Bang Bang, which plays in successively larger clubs, as the boys graduate from chain smoking to drinking to lines of coke and pills, feverish sex and psychosexual warfare. An attractive woman, Laura Ashworth (Diana Kent, Tania Emery) comes along to do an academic treatise on the pair as a study of \"the exploitation of the handicapped.\" To quiet her the manager hires her on with the crew and she falls in love with Tom. Once they're part of the music scene all kinds of pleasure come the boys' way along with mood swings, especially from the always unstable Barry, that challenge the power of their togetherness. A surgeon speaks about the unfeasibility of separating the two, especially now they're grown, since they share a single liver and Barry has a congenital heart defect; but later investigation reveals that Laura indeed was looking into the possibility of surgery and contacting this very surgeon, no doubt with a view to having Tom all to herself. She was banished for her pains. A sequence perhaps suggestive of Frank's C--ck--er Blues about the early Stones on tour hints at the obvious point that if one boy of the pair had sex, they both would, and the natural pattern was a polymorphous foursome. There's freaky sex for you. All of which brings back the Seventies as vividly as any almost-real fantasy could. Kink in this case would especially include that sub-genre of twin fantasies, and this one constantly tickles out thoughts of the queerness of glam rock, (the whole Iggy/Ziggy thing) -- or, as Pepe said at a festival Q&A, \"When you strap two good-looking 20-year-olds to each other, a certain subtext starts to emerge.\" Tom and Barry are perpetually hugging and touching each other because they're conjoined. They're adept at moving together and you even see them running and cavorting on an English lawn. You can laugh at the genre but with the sleazy-beautiful mock-Seventies images and the twin actors' natural verbal and physical volatility, Fulton and Pepe really pull you into this story, which was drawn from a novel by Brian Aldiss (who is a character played here by James Greene as the author of Kurt Russell's movie) and adapted for the screen by Tony Grisoni. The images are ably handled by Anthony Dod Mantle, who shot 28 Days Later, Dogville, and Manderlay but gets to play with styles more here, producing footage that combines current talking heads with beautifully faked Seventies-style footage from the presumably unfinished documentary. If you like kink, you like the Seventies, and you like proto-punk, this is the cult mock rock doc for you.",
         "No major spoiler in this comment, but if you don't want to know much, don't read much. The two directors brought this film to Hollywood's Egyptian Theatre and their introduction was minimal, stating \"Just open your mind\". This was a very cleverly crafted movie that engages you early, teases you with hints of a classic rocker-style crash and burn tale, but never lets you know fully what is to come until it hits you. Creatively structured, you have a tale of mid 70's rockers, examined in real-time in a faux documentary, which allowed the film to have the story you're promised; yet includes actors portraying those same characters years later, commenting on the experience with the benefit of hindsight. This nuance not only keeps you intrigued, but also moves the plot-ball from cup to cup, keeping the storyline actively non-linear. The hook to this movie, besides sexy young conjoined twin rockers, is the documentary feel they achieve. The directors told the audience at the Egyptian that sets were built 360degrees, and the cinematographer acted like a real-time documentary cameraman, moving through the scenes naturally, which were never blocked. Scenes were rehearsed and improv was encouraged as long as the essence of the scene was preserved. All the sound and dialog is real-time; all the concert music is recorded real-time and the band is actually playing the music you're hearing. They mentioned that the boom-mic operator even dressed in costume to blend in with the crowd during club scenes. This builds a very believable feeling of reality rather than a corny set-up that easily happens when creating faux star docs. The story is well told and very engaging and it's worth seeing for that - but if you have any interest in the film-making process, this is a great study in new styles. The faux documentary style also allows for surprise celebrity cameo appearances. Definitely not a \"happy\" film, but hearing the produced soundtrack version of the music during the credits does add a lift at the end.",
         "An incredible debut by Harry and Luke Treadaway, who steal the show in a pretty distinguished cast. I can't imagine better casting - the directors can have scarcely believed their luck. Excellent music, well-performed and never false or embarrassing. If Chryssie Hynde voted for this movie as a judge at some film festival (Edinburgh?) then it shows the music works well. Brilliant cinematography by a master of the art. Some of the interviews with doctors (and the girl journalist, who is otherwise pretty good) felt a bit contrived; the American doc film-maker too doesn't quite ring true. Ken Russell, on the other hand, is completely believable. It's not the greatest film ever, but it's very well worth seeing, and not just for that remarkable debut by the brothers.",
         "i loved the movie from about the middle to the end. (the beginning was kind of slow for my taste and confusing to catch on to) i thought it had great actors (who played as the acquaintances/friends/family) to play the supporting roles, as well as the two boys in the film. it was fantastically emotional in the right way (only slightly was it overdone). the photography was phenomenal and the story couldn't have been any more to-the-point and entertaining. again, the movie was a bit slow and direction-less in areas of the final, edited film, but the points in which the two boys were to figure each other out after hitting the \"big time\" were very interesting and kept me watching all the way through with no problem after the middle of the film. i gave it 8 stars, and i regard this a very cool film indeed. it feels like \"velvet goldmine\" mixed with a bit of brotherly rival-ism, which can sometimes prove fatal. great film to see with someone you love, but it might not lift so many spirits up as you might think."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Potboiler Productions",
         "Blue Sky Films",
         "EM Media"
      ],
      "summaries": ["In the 1970s a music promoter plucks Siamese twins from obscurity and grooms them into a freakish rock'n'roll act. A dark tale of sex, strangeness and rock music."],
      "budget": 0
   },
   "movielensId": 46581,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-01-01",
      "dvdReleaseDate": "2006-11-14",
      "directors": [
         "Keith Fulton",
         "Louis Pepe"
      ],
      "runtime": 93,
      "movieId": 46581,
      "title": "Brothers of the Head",
      "mpaa": "",
      "actors": [
         "Luke Treadaway",
         "Harry Treadaway",
         "Sean Harris",
         "Edward Hogg",
         "Jonathan Pryce",
         "James Greene",
         "John Simm",
         "Ken Russell",
         "Elizabeth Rider",
         "Anna Nygh",
         "Howard Attfield",
         "Tania Emery"
      ],
      "imdbMovieId": "0432260",
      "originalTitle": "Brothers of the Head",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In the 1970s a music promoter plucks Siamese twins from obscurity and grooms them into a freakish rock'n'roll act. A dark tale of sex, strangeness and rock music.",
      "tmdbMovieId": 16429,
      "avgRating": 3.16667,
      "releaseYear": "2005",
      "numRatings": 15,
      "posterPath": "/4YVWpJyyAkbb6q6EutC0WW2EBqd.jpg"
   }
}