{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "jewel thief",
            "id": 156236
         },
         {
            "name": "pink panther",
            "id": 159550
         }
      ],
      "imdb_id": "tt0085384",
      "video": false,
      "title": "Curse of the Pink Panther",
      "recommendations": [
         9699,
         46828,
         12268,
         6081,
         11573,
         53229,
         19258,
         11843,
         31671,
         28081,
         111749,
         113674,
         41279,
         24575,
         33762,
         24152,
         155450,
         22994,
         42176,
         3486
      ],
      "backdrop_path": "/qK6gKbiKY1k2uq9zcSHifOwGmrn.jpg",
      "revenue": 4491986,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sir Charles Litton",
               "gender": 2,
               "credit_id": "52fe45f49251416c91044385",
               "name": "David Niven",
               "profile_path": "/xslrziGA3B24iQ7BG9IO0ugycDo.jpg",
               "id": 14261,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "George Lytton",
               "gender": 2,
               "credit_id": "52fe45f49251416c91044389",
               "name": "Robert Wagner",
               "profile_path": "/nlRWGpsQPo8sSFdl8larlPUy1rS.jpg",
               "id": 9208,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chief Insp. Charles LaRousse Dreyfus",
               "gender": 2,
               "credit_id": "52fe45f49251416c9104438d",
               "name": "Herbert Lom",
               "profile_path": "/85tCjSGBH778wpycsIDb7mxhZia.jpg",
               "id": 14503,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Countess Chandra",
               "gender": 1,
               "credit_id": "52fe45f49251416c91044391",
               "name": "Joanna Lumley",
               "profile_path": "/2RFXqaFpeN9WmhfAyNaumz0rZUV.jpg",
               "id": 34901,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lady Simone Litton",
               "gender": 1,
               "credit_id": "52fe45f49251416c91044395",
               "name": "Capucine",
               "profile_path": "/pGzEiXMc77pxXwhiH4j0vdb20IO.jpg",
               "id": 14262,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Chief Insp. Jacques Clouseau",
               "gender": 2,
               "credit_id": "52fe45f49251416c9104439d",
               "name": "Roger Moore",
               "profile_path": "/8tnAaHY6cehjC9B6mIvxaFPewbh.jpg",
               "id": 10222,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Cato Fong",
               "gender": 2,
               "credit_id": "52fe45f49251416c910443a1",
               "name": "Burt Kwouk",
               "profile_path": "/7s1Sul5L6NU2TEfgLarBqrde65v.jpg",
               "id": 21944,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Bruno Langois",
               "gender": 2,
               "credit_id": "56281b12c3a368488c00006d",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Prof. Auguste Balls",
               "gender": 2,
               "credit_id": "56281b229251414ccd000070",
               "name": "Harvey Korman",
               "profile_path": "/zXLYvJP3ReKPI6lJr2VuDGupL1j.jpg",
               "id": 13640,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Sergeant Clifton Sleigh",
               "gender": 2,
               "credit_id": "56281b37c3a3684880000067",
               "name": "Ted Wass",
               "profile_path": "/hXwdMim4pZUjKaR95o3KfBVpPxK.jpg",
               "id": 151192,
               "order": 9
            },
            {
               "cast_id": 7,
               "character": "Taxi Driver",
               "gender": 2,
               "credit_id": "52fe45f49251416c91044399",
               "name": "William Hootkins",
               "profile_path": "/lGPSg64fsqbWS5PUFKsUKLNOqsx.jpg",
               "id": 663,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Mr. Chong",
               "gender": 2,
               "credit_id": "573d90ea9251413687001e4c",
               "name": "Ed Parker",
               "profile_path": "/nO1nvVF4ApysNnkupdcvn7rYsbM.jpg",
               "id": 166254,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Aldous (voice, uncredited)",
               "gender": 0,
               "credit_id": "56281fd39251414cdd0000de",
               "name": "Geoffrey Edwards",
               "profile_path": null,
               "id": 58658,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f49251416c91044381",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56281d20c3a368488f0000b6",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56281d2a9251414cdd000092",
               "name": "Geoffrey Edwards",
               "profile_path": null,
               "id": 58658,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56281d3fc3a368488700009f",
               "name": "Blake Edwards",
               "profile_path": "/tQ13izDBcErAV2qSz9KGjQbV5p9.jpg",
               "id": 1927,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56281d4b9251414cdb00009d",
               "name": "Jonathan D. Krane",
               "profile_path": null,
               "id": 14093,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56281d55c3a368488000009f",
               "name": "Gerald T. Nutting",
               "profile_path": null,
               "id": 1433977,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "56281d5f9251414cd8000087",
               "name": "Henry Mancini",
               "profile_path": "/sXl1lCYNnSf10ESG1nyCEDYGs1L.jpg",
               "id": 1938,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "56281d6ac3a368488f0000bf",
               "name": "Dick Bush",
               "profile_path": null,
               "id": 58660,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 4.405561,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 36576,
      "vote_count": 48,
      "budget": 11000000,
      "overview": "Inspector Clouseau disappears, and the Surete wants the world's second best detective to look for him. However, Clouseau's enemy, Dreyfus, rigs the Surete's computer to select, instead, the world's WORST detective, NYPD Sgt. Clifton Sleigh. Sleigh obtusely bungles his way past assassins and corrupt officials as though he were Clouseau's American cousin.",
      "similar": [
         4771,
         949,
         75780,
         193893,
         2017,
         984,
         9411,
         10651,
         11423,
         15069,
         20676,
         12150,
         189,
         96,
         320,
         807,
         395990,
         1847,
         25376,
         1266
      ],
      "original_title": "Curse of the Pink Panther",
      "runtime": 109,
      "poster_path": "/mDBa72BXFZvb9aDyfHis3GuEfg0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Titan Productions",
            "id": 1582,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Blake Edwards",
            "id": 6407,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         }
      ],
      "release_date": "1983-08-12",
      "vote_average": 3.5,
      "belongs_to_collection": {
         "backdrop_path": "/9Lc4YOIwprqMYNaUkJRRa5unakk.jpg",
         "name": "The Pink Panther (Original) Collection",
         "id": 937,
         "poster_path": "/xu6gZ0zGUSR8SC2QLKFaUrX2niM.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Blake Edwards"],
      "runtime": 109,
      "synopsis": "[Note: this is a direct sequel to Trail of the Pink Panther with most of the cast from the previous film] While investigating the theft of the Pink Panther diamond from the previous film (Trail of the Pink Panther), Chief Inspector Jacques Clouseau, hailed as France's greatest detective, has disappeared during the investigation and no trace can be found of him. Chief Inspector Charles Dreyfus (Herbert Lom) is under pressure to set up a thorough inquiry called Operation Paragon. What the world at large does not realize is that Clouseau was a clumsy, bungling idiot whose cases were solved more through luck than actual detective work. Since Clouseau's clumsiness drove him to a series of nervous breakdowns, Dreyfus in particular is desperate not to see or hear from him ever again. He is told to use the Interpol computer, a fictional Huxley 600 named \"Huxley\" to find the world's greatest detective, but instead sabotages the machine to select the worst. This turns out to be Sergeant Clifton Sleigh (Ted Wass), an officer of the NYPD who are glad to get rid of him for a while after Sleigh is shown to bungle a sting operation when he dresses up as a woman to nab a purse snatcher, only to get acousted by a leering dirty old man, a pimp and a couple of prostitutes whom think that he's intruding on their turf, and falsely arrested by a pair of beat cops who think he's a prostitue while the purse snatcher steals another woman's purse right under everyone's nose. When his harried boss sends him on assignment to France to find the missing Inspector Clouseau, Sleigh, who is descended from a long line of cops, sees this as an opportunity to prove his worth. Dreyfus and his long-suffering assistant Sergeant Francois Durval (André Maranne) soon find that the plan has worked a bit too well: Sleigh is just as clumsy as Clouseau, falling around, causing disaster and driving Dreyfus crazy. When Sleigh meets Dreyfus for the first time in his office, as Dreyfus warily offers to shake his hand, Sleigh walks forward only to trip over his own feet and fall on Dreyfus who falls back in his wheeled office chair which rolls out a walk-in window and Dreyfus falls three stories into a pond, breaking his left leg. Later in the movie as Dreyfus goes insane again and attempts to murder Sleigh, he keeps injuring himself by falling off buildings and even a steep cliff, leading to him breaking most of his bones and ending up in a body cast. As he sets about his inquiry, Sleigh becomes the target of many people who would rather he did not find Clouseau. These include the inspector's former manservant Cato (Burt Kwouk) (who had given up trying to defeat Sleigh the first time and let him go to find the missing Inspector); Dreyfus, who attempts to kill Sleigh like he tried to kill Clouseau; and Bruno Langlois (Robert Loggia), the mafia boss from 'Revenge of the Pink Panther'. Langlois attempts many assassinations on Sleigh, but Sleigh's bumbling nature allows him to evade the attacks, and ultimately, Langlois, along with his henchmen (including Mr. Chong from 'Revenge of the Pink Panther'), have a final showdown with Sleigh, although a mysterious young woman (smitten with Sleigh) comes to his rescue and manages to defeat Langlois (by giving him the Family Jewels) and the thugs in combat. Langlois is finally arrested and taken to prison. Sleigh also meets Sir Charles Lytton (David Niven) who is now married to Clouseau's former wife Simone (Capucine) and accompanied by his nephew George (Robert Wagner) (all from the very first Pink Panther movie). Sir Charles Litton is the notorious jewel thief known as the Phantom, though only Clouseau was convinced of this. The Phantom would steal items of jewelry and leave behind a white glove. Eventually the trail leads Sleigh to a health spa run by Countess Chandra (Joanna Lumley). There he meets a famous British film star (Roger Moore), who speaks with a rather odd French accent and falls about all over the place (behaviour characteristic which would be familiar to those who have seen the previous films in the series). Countess Chandra tells Sleigh that Clouseau visited her claiming to be Gino Rossi and asking for a good plastic surgeon. Sleigh concludes, wrongly, that Clouseau stole the Pink Panther diamond, underwent plastic surgery, was made to look like Rossi and was then killed for the diamond. Anxious to end the matter and be rid of Sleigh, Dreyfus announces that this is indeed the solution, officially closing the case and that the deceased Rossi was Clouseau (though it is clear that Dreyfus does not believe that this is what happened). In a final irony, as Dreyfus sets fire to Clouseau's official death certificate, happy to be rid of Clouseau once and for all, he accidentally sets fire to his whole office. Sleigh runs in an attempts to put out the fire with a fire hose only to accidetly hit Dreyfus with the water in which the force of the water pushes Dreyfus back out of his walk-in window and falling down three stories into the pond at the base of his window... again. As it transpires, the Pink Panther was stolen by Gino Rossi (Christopher Reich) (in 'Trail of the Pink Panther') who bore a little physical resemblance to Clouseau. Rossi then tried to sell the diamond to Countess Chandra who instead killed him (shown in the pre-credits sequence) when trying to kill Clouseau who arrived at Chandra's house to retrieve the diamond. His body was later found on a beach. The film star that Sleigh met was in fact Clouseau who had undergone very extensive plastic surgery. However, Sleigh is right that Clouseau has \"turned bad\", becoming Countess Chandra's lover and partner in crime (possibly either have been brainwashed by the Countess or disillusioned about going against criminals); but when they go to admire the Pink Panther it is to find that it has been taken from its safe and replaced by a white glove. \"Swine Phantom!\" mutters Clouseau, knowing only too well who is responsible for the theft. In the final scene, Sir Charles, Simone, and George sail away on board the Lytton yacht, along with the Pink Panther jewel.",
      "writers": [
         "Blake Edwards",
         "Geoffrey Edwards"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0085384/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4OTE5MjYyNF5BMl5BanBnXkFtZTcwNzY2MTMyNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: David Niven, Robert Wagner, Herbert Lom | See full cast and crew »"],
      "reviews": [
         "Ignore the negative press when viewing this. O.K., the movie cant hit the heights of either A shot in the dark or The Pink Panther Strikes Again, but it is a nice little film in it's own right. Firstly Ted Wass is good in the role of Clifton Sleigh, perhaps it is the fact that the character is too bumbling in the wrong direction that it doesn't work out. The stars of the show are again Herbert Lom and Joanna Lumley, and the sexy Leslie Ash in a Bond girl like role. The man who steals the show is surprisingly Roger Moore as the newly Plastic surgery clad Clouseau who is made up to look like, rather appropriately, Roger Moore. An hilarious twist which is something Clouseau would have gone in for. It is a pity Moore wasn't given the role of Clouseau out right because he is effective in the part and quite funny. An enjoyable little film.",
         "Blake Edwards directed three panther-films after the death of legendary Peter Sellers (1925-1980) - the original Clouseau and a master comedian. \"Curse of the Pink Panther\" (1983) is the middle one of 'em. I have no idea why he had the nerve to make a laughing matter out of the fact that Sellers is gone and respect his immortal memory little enough to continue the saga. Was he in the need of some more money (I doubt) or was he just missing a good hobby? If his intention was to make the audience happy, he failed. I think \"Trail of the Pink Panther\" (1982) wasn't all that bad yet. It was fine entertainment but mostly because of the funny leftover scenes with Sellers in 'em. The last two panther-flicks sucked pretty hard because they had absolutely nothing to got to do with Sellers anymore. I remember I actually liked \"Curse of the Pink Panther\" when I was a kid. That doesn't tell much of anything, kids like lots of crappy movies. Of course I was old enough to miss Clouseau but it didn't bother me that much. From today's point of view I miss Clouseau even more and like the movie even less. Still, surprisingly \"Curse of the Pink Panther\" isn't all that bad because I can still watch it without throwing up and I'm sure that's something everyone can't manage to do. There's couple of good scenes here and there and I can still enjoy it because of the old team: David Niven, Robert Wagner, Herbert Lom, Joanna Lumley, Capucine, Burt Kwoak...they're all here to fill the enormous hole Sellers left behind. What troubles me most is this Ted Wass guy. His failed attempt is to be some kind of a modern Buster Keaton. Is he actually trying to be funny? Who is he anyway? His clumsiness works a few times now and then but he's millions of light years away from the stylish act of Sellers. The cameo of Roger Moore was probably the only really nice surprise this movie had to offer. My rating: 3 out of 10. Ten years later Edwards felt he had to direct \"Son of the Pink Panther\", awful conclusion to the essentially great series of movies.",
         "After Peter Sellers passed away, the producers of the \"Pink Panther\" franchise tried to carry on without their star. As evidenced in \"Inspector Clouseau,\" having another actor play the bumbling French detective was not the answer. They tried to fill the void left by Sellers with old footage, in \"Trail of the Pink Panther.\" Then they tried to introduce a new character, a counterpart to Clouseau. Thus was created \"Curse of the Pink Panther.\" Ted Wass plays the newcomer, an amazingly inept New York cop named Clifton Sleigh, who is chosen to investigate Clouseau's disappearance. His act is loaded with slapstick, in attempt to copy Clouseau's style. However, it's not the same. Also appearing in \"Curse\" is a load of actors from all the previous \"Pink Panther\" movies, including Herbert Lom as Chief Inspector Dreyfus, Burt Kwouk as Kato, and David Niven as Sir Charles Lytton. Watch it if you must, but you'll be reminded of how Peter Sellers will be missed.",
         "Following the death of Peter Sellers, the Pink Panther series seemed to have little future but director Blake Edwards still managed to grind out two further entries. The Trail Of The Pink Panther was mediocre but it had funny moments; The Curse Of The Pink Panther is a stretch too far. This - number seven in the popular series - is a feeble comedy in which the plot is poorly contrived, the actors look totally indifferent, and the comic moments are tired rehashes of scenes from the earlier films. It's no exaggeration to say this is the worst of the series. Dreyfuss (Herbert Lom) is assigned to use a super-computer to track down the world's greatest detective. Once found, this awesome detective will be entrusted with the task of finding the missing Inspector Clouseau. However, Dreyfuss has no intention of helping in the hunt for Clouseau (you may remember from earlier films that Clouseau drove Dreyfuss to the brink of insanity). Thus, Dreyfuss deliberately misuses the computer and finds the worst detective in the world - the inept New York officer Clifton Sleigh (Ted Wass). Sleigh travels to France and follows a trail of clues hither and thither, accidentally surviving numerous attempts on his life and getting into all manner of wacky situations as he closes in on the truth. Along the way he crosses swords with various characters from earlier Pink Panther films, before it is finally revealed to the audience (though not to Clifton Sleigh) what actually became of the hapless Inspector Clouseau. There are a few compensations amid the general air of indifference. A certain famous film star, billed as Turk Thrust II, makes a guest appearance as Clouseau near the end, and has a funny cameo role mimicking the mannerisms that Sellers had brought to the character. Henry Mancini's music is as catchy as ever, and there are infrequent sight gags which are fairly amusing (e.g. the scene where Wass sits on a giant rubber duck, only for the beak to poke out suggestively from between his legs). On the whole, alas, The Curse Of The Pink Panther is a very poor film. With a running time close to 2 hours, the film needs more than a couple of amusing gags and a good cameo appearance. Long before the end (heck, long before the middle!) it becomes a tedious affair, and as the plot unfolds one increasingly wishes that the final credits would hurry up and put an end to the misery. After this, Edwards gave up on the series until, in 1993, he belatedly added one final flick entitled The Son Of The Pink Panther.",
         "As I watched this movie, I asked myself if Blake Edwards could watch it and laugh out loud during the whole thing, or if he got as bored and tired with it as I did. The classic Sellers Panther movies contain many laugh-out-loud sequences. For me, there is only one in this movie, a nice little scene that happens outside the Chicago airport. But by the way, if Sleigh is a NY cop, and he's going to France, why the heck does he have to go through Chicago??? Moore's cameo is nice. Almost makes you wonder if the idea was ever there to carry on the series with him. If you have to see it to flesh out the whole series, go ahead, but don't expect much...",
         "This following to popular series is a new attempt to maintain the slapstick franchise in spite of Peter Sellers death by substituting in American actor Ted Wass . He's investigating bungling Clouseau disappearance and is on the trail of the jewel known as the Pink Panther and during his first scenes Ted appears in drag . Clouseau's previous chief (Herbert Lom) threatens to destroy the new detective . At the same time Ted Wass like Clouseau is making life intolerable for Inspector Dreyfuss . He then goes to Clouseau museum where he meets Kato (Burt Kwouk) , to the French Riveira and Valencia (Spain) where encounters mobsters (Robert Loggia) who wish to kill him . Later on , aboard a yacht (along with the habitual David Niven , Capucine , Robert Wagner) he goes to Mallorca . There he attempts to track down the Clouseau trail but he meets a suspect Countess Chandra (Joanna Lumley). This is arguably one of the most average of the series about the botcher Inspector and being the eight ¨Pink Panther¨ movie in the known film franchise . In this slapdash as well as disconcerting comedy , Wass attempts to investigate whether or no Clouseau is living somewhere . This fun release has some hilarious moments here and there . The film continues where Trail of the Pink Panther (1982) leaves off . Though uncredited, late Peter Sellers can still be heard in various scenes through archival sound . Starring Ted Wass as Sleigh is sympathetic imitating to Sellers , outdoing his botcher and diverting character . Actors considered for the role of Clifton Sleigh included John Ritter, John Cleese, Dudley Moore and Rowan Atkinson ; in the end , the part went to Ted Wass . The actors seem to enjoy immensely themselves but they are supposedly spending some amusing holidays in Riveira , Mallorca, Valencia . Players appearing in this movie who had appeared in the original Pink Panther (1963), the first film in the series , were Capucine, David Niven, and Robert Wagner . In the film appears the usual series as Herbert Lom (chief Inspector Dreyfuss), Andre Maranne (Sergeant Francois Duval), Grahame Stark (as a bored waiter) and the ordinary professor (Harvey Korman) . The movie was simultaneously filmed along with ¨Trail to the Pink Panther¨ where equally the protagonist (Joanna Lumley) is looking for Inspector Clouseau . Writer, producer , director Blake Edwards gets some inspired bits penned by himself ; however he attempts to alive his classic personage with no much success . Rating : Mediocre but entertaining .",
         "Considering that \"Curse of the Pink Panther\" is a relatively recent film, it looks surprisingly dated. No wonder, since it's filled with stale jokes and visual gags that have already been executed in previous \"Pink Panther\" entries. Harmless and good-natured but completely unimaginative and mostly unfunny, this comedy may help you kill two hours, but it may also irritate you because of its exploiting the images of many of the series' stars just to gain some \"dignity\" as a film. Moore's cameo appearance at the end is indeed funny, but personally I've always known than Moore has a great comic flair.",
         "For those who consider the Pink Panther films only watchable for Peter Sellers' performance as Inspector Clouseau, the series could be considered over with \"Revenge of the Pink Panther.\" For those who love the Pink Panther brand of humor and want to see the full extension of the story line, \"Curse of the Pink Panther\" is worth a look. True, without Peter Sellers this movie doesn't feel quite authentic, but it makes an interesting epilogue to the series, picking up where the wafer-thin plot of \"Trail of the Pink Panther\" left off. Glad that Clouseau is gone but wanting to appear like he's doing his best to find the missing Inspector, Chief Dreyfus (Herbert Lom) searches for the worst possible detective to put on his old foe's tracks. He settles for Sgt. Clifton Sleigh (a young Ted Wass), a bumbling NYPD officer who can't understand why everyone thinks he's somehow related to Jacques Clouseau. While plenty of the worn-out routines from previous movies are repeated here, there are certainly some new bits, and Wass' likable character breathes some freshness, if only a little bit, into the film. Still, while Peter Sellers is missed, his character is missed even more. The studio could have counted its losses and found a new Clouseau and a new director to bring new blood to the franchise. Instead, the events of the previous films, including the little inconsistencies between movies, are brought to a head as Clouseau's disappearance and the Pink Panther diamond's theft come together in one mangled conspiracy theory. This, sadly, taints the simplicity of the individual films. Certain elements of the classics are here, including an exotic babe (Leslie Ash) and David Niven in his final film role. Appropriate, since this was originally supposed to be his franchise. It turns out in the end that Clouseau has had plastic surgery in order to look like Roger Moore, played by Roger Moore. The scene where Moore and Wass meet is priceless, providing a chance for \"Clouseau\" and \"Sleigh\" to see who the bigger buffoon is in a hilarious game of comical oneupmanship. Not as funny as any of the Peter Sellers films by a long shot, but a novelty among the series and a worthwhile comedy for fans of this comedy-mystery series.",
         "This is definitely the worst Pink Panther film of all, but it's worth seeing (read-wait until the end of the film) because of a fantastic cameo of (great in this role) Roger Moore who shows that he fits very well in the part of Clouseau. I think Peter Sellers would be satisfied with Moore's outing. P.S. Note that it's the last David Niven film.",
         "inspector Cleaseau is off somewhere searching for the Pink Panther diamond so in the meantime, Chief Inspector Dreyfuss programs a computer to find his replacement,, but instead of picking the best qualified detective he programs the computer to pick the worst detective,, so from NYC comes a bumbling idiot you would think is closeau's American cousin,, i'm sure Dreyfuss is going ape now that he has met the police officer,,, Roger Moore has a cameo in the end of the movie that's pretty cool,, This was David Niven's last film,, I really liked him throughout his work on some of the Pink Panther movies,, alothough obviously not the strongest panther movie,, certainly not the weakest."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "United Artists",
         "Titan Productions",
         "Blake Edwards"
      ],
      "summaries": [
         "Inspector Clouseau disappears, and the Surete wants the world's second best detective to look for him. However, Clouseau's enemy, Dreyfus, rigs the Surete's computer to select, instead, the world's WORST detective, NYPD Sgt. Clifton Sleigh. Sleigh obtusely bungles his way past assassins and corrupt officials as though he were Clouseau's American cousin.",
         "When famed French detective Clouseau goes missing while searching for the Pink Panther diamond, his bosses at the Surete decide they need a detective like him to find him. So they use a computer to select that person. They decide to let Chief Inspector Dreyfuss program the computer. But Dreyfuss, fearing the Clouseau return, decides to rig the computer to select the opposite. And after doing that, the computer chooses Clifton Sleigh from New York. And it turns out he is just as inept as Clouseau. When Dreyfuss meets him, he can't help but wonder if the two men are related. And just like Clouseau, he wants him dead. Sleigh sets out to find Clouseau but there are those who would like him not to find Clouseau so they try to take him out but like Clouseau manages to avoid getting harmed."
      ],
      "budget": 11000000
   },
   "movielensId": 46604,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-08-12",
      "dvdReleaseDate": "2004-11-01",
      "directors": ["Blake Edwards"],
      "runtime": 109,
      "movieId": 46604,
      "title": "Curse of the Pink Panther",
      "mpaa": "PG",
      "actors": [
         "David Niven",
         "Robert Wagner",
         "Herbert Lom",
         "Joanna Lumley",
         "Capucine",
         "Roger Moore",
         "Burt Kwouk",
         "Robert Loggia",
         "Harvey Korman",
         "Ted Wass",
         "William Hootkins",
         "Ed Parker",
         "Geoffrey Edwards"
      ],
      "imdbMovieId": "0085384",
      "originalTitle": "Curse of the Pink Panther",
      "genres": [
         "Crime",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Inspector Clouseau disappears, and the Surete wants the world's second best detective to look for him. However, Clouseau's enemy, Dreyfus, rigs the Surete's computer to select, instead, the world's WORST detective, NYPD Sgt. Clifton Sleigh. Sleigh obtusely bungles his way past assassins and corrupt officials as though he were Clouseau's American cousin.",
      "tmdbMovieId": 36576,
      "avgRating": 2.6954,
      "releaseYear": "1983",
      "numRatings": 87,
      "posterPath": "/mDBa72BXFZvb9aDyfHis3GuEfg0.jpg"
   }
}