{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "armageddon",
            "id": 12654
         },
         {
            "name": "warlock",
            "id": 157667
         }
      ],
      "imdb_id": "tt0108517",
      "video": false,
      "title": "Warlock: The Armageddon",
      "recommendations": [
         26042,
         11342,
         11119,
         10824,
         70024,
         26103,
         28762,
         46500,
         73218,
         36996,
         28218,
         29621,
         29883,
         2199,
         38940,
         12485,
         24527,
         68665,
         10001,
         40236
      ],
      "backdrop_path": "/meOtdGhHZIOCmCdBqVe1AzTG7M2.jpg",
      "revenue": 3902679,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Warlock",
               "gender": 2,
               "credit_id": "52fe4483c3a368484e02768b",
               "name": "Julian Sands",
               "profile_path": "/hDb4UlbeTvvVK53Cmh7W0Ijo41h.jpg",
               "id": 6104,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kenny Travis",
               "gender": 2,
               "credit_id": "52fe4483c3a368484e02768f",
               "name": "Chris Young",
               "profile_path": "/4TBxXTdUtQ7VcnUR8BFEt1lDWFi.jpg",
               "id": 27504,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Samantha Ellison",
               "gender": 1,
               "credit_id": "52fe4483c3a368484e027693",
               "name": "Paula Marshall",
               "profile_path": "/631RjKeHEmOGwq6Pw9ijs8w9dtR.jpg",
               "id": 59449,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Paula Dare",
               "gender": 1,
               "credit_id": "52fe4483c3a368484e027697",
               "name": "Joanna Pacula",
               "profile_path": "/697EWuER2k3lQ4oNZdYdkU6cvvd.jpg",
               "id": 36059,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Will Travis",
               "gender": 2,
               "credit_id": "56d1e7e9c3a3681e4a009334",
               "name": "Steve Kahan",
               "profile_path": "/ROLtxokJ0mFtPxpVQwosqDQysi.jpg",
               "id": 14328,
               "order": 4
            },
            {
               "cast_id": 23,
               "character": "Franks",
               "gender": 2,
               "credit_id": "59b591d892514138f7000484",
               "name": "R.G. Armstrong",
               "profile_path": "/iyOD1sUIX4SAPbfF4C9C7cI3ayP.jpg",
               "id": 1107,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Ethan Larson",
               "gender": 2,
               "credit_id": "58b8f468c3a36866300040c2",
               "name": "Charles Hallahan",
               "profile_path": "/bXRE5dfHZZhovEbXgQCXDTw9ZHY.jpg",
               "id": 15414,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ted Ellison",
               "gender": 2,
               "credit_id": "58b8f473925141607700445b",
               "name": "Bruce Glover",
               "profile_path": "/xIaAA5KFhaB4Z5FmWd5Rd2KenVn.jpg",
               "id": 10194,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Andy",
               "gender": 0,
               "credit_id": "58b8f47dc3a36866300040d3",
               "name": "Craig Hurley",
               "profile_path": null,
               "id": 1176338,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Amanda Sloan",
               "gender": 0,
               "credit_id": "58b8f488c3a36866b70046be",
               "name": "Dawn Ann Billings",
               "profile_path": "/9PmZrtQBxHkgeu7q82sFomxr4gv.jpg",
               "id": 174680,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Douglas",
               "gender": 2,
               "credit_id": "58b8f491c3a368664d0047ac",
               "name": "Zach Galligan",
               "profile_path": "/u06Txf30YaDkr0qENUbSp4DGab3.jpg",
               "id": 16170,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Celine",
               "gender": 1,
               "credit_id": "58b8f4a2c3a36866af004491",
               "name": "Michelle Moffett",
               "profile_path": null,
               "id": 148196,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Barker",
               "gender": 2,
               "credit_id": "58b8f4b0c3a36866af0044a0",
               "name": "Richard Zobel",
               "profile_path": null,
               "id": 147397,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "One-Eyed Man",
               "gender": 2,
               "credit_id": "58b8f4bdc3a36866a50043ca",
               "name": "Ferdy Mayne",
               "profile_path": "/cUfriRFlTJpP5XxITl5Y4KxTsfl.jpg",
               "id": 26557,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Dark Leader",
               "gender": 2,
               "credit_id": "58b8f4c8c3a368668f003bd6",
               "name": "Anthony Hickox",
               "profile_path": "/tWAG2uZS9B9QTSzZJRTgWHFlbOs.jpg",
               "id": 48965,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Man in the Crowd",
               "gender": 2,
               "credit_id": "58b8f4dbc3a36866a50043dc",
               "name": "George Buck Flower",
               "profile_path": "/xHzW4GszCLTZLNxvTcKL9ICuLIc.jpg",
               "id": 54564,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Model",
               "gender": 1,
               "credit_id": "58b8f50b925141606b004724",
               "name": "Monika Schnarre",
               "profile_path": "/eH2taq6fmrhijYnx5tnvo6dhIHO.jpg",
               "id": 101905,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Model",
               "gender": 1,
               "credit_id": "58b8f538925141606b00473f",
               "name": "Wendy Hamilton",
               "profile_path": "/wh7c3nqw0kQIK1TPdL9LT0ubjBC.jpg",
               "id": 112467,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4483c3a368484e02769d",
               "name": "Anthony Hickox",
               "profile_path": "/tWAG2uZS9B9QTSzZJRTgWHFlbOs.jpg",
               "id": 48965,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4483c3a368484e0276a3",
               "name": "David Twohy",
               "profile_path": "/7hJbNy5XKO5je9FsSGvl4QbGyMM.jpg",
               "id": 28239,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4483c3a368484e0276a9",
               "name": "Kevin Rock",
               "profile_path": null,
               "id": 91027,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 4.303671,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24126,
      "vote_count": 46,
      "budget": 3000000,
      "overview": "Every six hundred years, a great evil has the opportunity to escape and unleash Armageddon. A group of five stones has the power to either free the evil, or banish it for another six hundred years. An order of Druids battles with a Warlock determined to unleash his father upon the world.",
      "similar": [
         9543,
         123553,
         11342,
         34205,
         18498,
         27850,
         173736,
         2160,
         173731,
         26042,
         55537,
         46158,
         173897,
         1411,
         44259,
         406759,
         108132,
         353420,
         443042,
         487152
      ],
      "original_title": "Warlock: The Armageddon",
      "runtime": 98,
      "poster_path": "/mvvrauRX0BRJVCUS9bSBKqBamjh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tapestry Films",
            "id": 870,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Trimark Pictures",
            "id": 4063,
            "origin_country": ""
         }
      ],
      "release_date": "1993-05-01",
      "vote_average": 5.1,
      "belongs_to_collection": {
         "backdrop_path": "/im5iJHo8UwswhKHlcADqUO3sZtA.jpg",
         "name": "Warlock Collection",
         "id": 87536,
         "poster_path": "/wkwtv5NMpBfo1eGjZpNJEQ2cZH0.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Anthony Hickox"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "David Twohy",
         "Kevin Rock"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108517/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4MDA1MTY3OV5BMl5BanBnXkFtZTcwNDkwOTAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Julian Sands, Chris Young, Paula Marshall | See full cast and crew »"],
      "reviews": [
         "It had been years since I had watched this film, but watching it recently, I was reminded of how much I enjoyed this sequel to the original warlock. The characters weren't near as annoying as that girl who lost her bracelet in the original, and the Warlock was actually given some pretty cool lines and parts. I don't know, maybe it was the plot, but the Warlock just seemed so much more evil in the sequel. Is it cheesey? Yes, because the early nineties were a cheesey time, but sometimes it's fun to look back at the past and smile. If you like cheap, cheesey horror films, this one might make you grin.",
         "First off, let me say that you can watch \"Warlock: The Armageddon\" without having seen the first \"Warlock\" movie. Of course you will have more depth to the warlock character, if you have seen it, but you will not miss out on anything if you haven't. This sequel is as good as the first movie in the series. Again, the role of the sinister warlock is portrayed by the charismatic Julian Sands. And in this movie the character is much more dark and evil, far more twisted than the warlock portrayed in the first movie. Julian Sands is so perfect for the role of the warlock. The cast is good, and the roles of the druids are good, both for the young druids and the elderly druids. The movie has a bunch of cool effects and wicked magics, something that have to be seen. However, it is not all good though, the scene with the knife went horribly wrong. That knife is perhaps the worst CGI effect I have seen to date. For fans of adventure genres or for people who like to play D&D games, this movie provides good entertainment. And like the first \"Warlock\" movie, this also have enough entertainment for more than one watching. I never grow tired of it, at least!",
         "Julian Sands returns here, but I don't know if he is supposed to be the same guy are not. The rules are all changed around here and in many ways it is almost an entirely different movie. The Warlock in this movie seems nearly indestructible than in the first, and instead of the puritan types that were the ones to try and stop him in the first one, here he must be stopped by druids. This time the Warlock makes a most memorable first appearance, and then he goes after these magic stones so he can release Satan into the world. This makes the druid angle seem rather dumb as I don't think they believe in such things. However, it still is a rather good movie, just not as good as the first...in fact this movie might have seemed better if the first one never happened. The movie though does follow a certain pattern. You see scenes of this kids coming into terms with their special powers to stop the Warlock, then a scene of the Warlock finding one of the stones, finally whoever has the stone is killed in an unusual way, and then repeat. This happens till the end and the big showdown occurs. I do so enjoy the shotgun scene. That is about all there is too it, but then the Warlock does kill people in vastly different and interesting ways. Not a great movie, but it is okay and worth checking out, though it is rather gruesome at times.",
         "Anthony Hickox is only about a light year ahead of Steve Miner in his vision of modern-day witches and magick users, but he still gets it wrong. The narrative begins as such: 'Throughout time, people known as Druids have used their mystical powers to protect the Earth from evil. Once every millennium, when the sun aligns with the moon, these guardians summon the magic of their sacred rune stones in the quest to prevent the birth of Satan's son...' Druids would be working hard to prevent untoward events, yes. But the birth of Satan's son is not a concern to the Druids, who also realize and understand that Satan is a Christian heresy and invention, and not one that any pagan would hold in high regard. Therefore, the entire plot of this movie is moot and negated, as far as learning or 'getting' anything from this movie. However, it is an entertaining thriller with a few surprises, turns and even a twist or two. Classic 'B' movie horror, again starring Julian Sands, and as sequels go, I find this one to be a more entertaining endeavor than the flick from which it spawned. The idea of the Druid Stones is ancient, though they had nothing to do with the birth of Satan's son. As legend has it, the Druid Stones were the only keys to the seven World Gates, leading to seven different areas within the three dimensions of this World; IE: Primordial, Psychic, and Ethereal planes. Therefore, the signs and omens utilized within the context of this movie are quite good and well used. The story centers around two young people, Kenny (played by Chris Young *Buck of Candy/Aykroyd's 'The Great Outdoors'*) and Samantha (Paula Marshall, who's had a rather...obscure acting career, so far). Both are children of Druid heritage and blood, and although neither have been trained, taught, nor raised within the magickal system, now they must realize their powers and abilities in order to prevent the end of the world. A bit far-fetched, if you ask me. What's also a bit far-fetched is the very idea that a Druid's power comes from 'God.' Druids were here thousands of years before christians and the Hebrew god YWYH. That was just stupid. Outright ignorant. A small listing of well-seasoned actors makes this movie quite enjoyable, regardless of the puerility of story line/plot. This production is full of 'B' movie effects and classic horror fare. The mirror scene with the carny has a very strong 'Dean Koontz' feel to it with the end of that scene finishing out in an almost Hellraiser style. All in all, not a bad way to kill ninety minutes. This movie rates a 6.7/10 from... the Fiend :.",
         "'Warlock: The Armageddon' is a more than capable sequel to the original film. **SPOILERS** A druid ceremony is interrupted and five sacred stones are stolen and buried, hoping to never be used again. Today, high school teen and future warlock Kenny Travis (Chris Young) is having a series of problems involving his girlfriend Samantha (Paula Marshall) and the school bully Andy. (Craig Hurley) Kenny's father Will (Steve Kahan) tells him of his destiny, but he would rather get along with Samantha. The Warlock (Julian Sands) is reborn and goes off in search of the five sacred stones that are needed to bring his father back to Earth. One of the stones is held by fashionista Paula Dare (Joanna Pacula) and acquires it forcefully. Kenny learns that he comes from a long line of druids who protect the world instead of destroying it and that only he can defeat the Warlock. Will and his Warlock friend Franks (R.G. Armstrong) teach him to learn the ways of the druids to fight the Warlock, who continues on a bloodbathed path to find the stones. With Samantha coming along to help, Kenny takes on the Warlock for the fight of mankind. The Good News: I'm really glad this one is a bloodbath. The first one was a very decent effort that featured very few gore effects, but this one contained several impressive kills. Being impaled on a series of spikes from a torture chamber, having an eye ripped out, having more than twenty slash marks all over their body, and being dropped over thirty feet onto a skylight, then falling trough with blood splattering on the onlookers are just some of the scenes which are more violent in here than in the first one. The elevator scene, with the stabbing, was the real killing highlight because of the suspense it involved. Because there was a couple false movements where something didn't happen when it was believed to have been, then it suddenly happens does shock the first time viewer. However, than is the only main jump in the movie. Sands really seems to have fun in the role as he actually kills people in this movie. He almost becomes a sort of Freddy-ish killer in this movie, as he does have a few pretty funny comments to his victims, but they just don't seem as good as Freddy's lines. He does kill with abandon, so it does come as a surprise when he kills them. The actual method of killing the Warlock was pretty creative, with the whole scene carrying out pretty entertaining way. The battle shifts back and forth as no one has a clear-cut advantage over the other and it never loses your interest. The Bad News: There was a serious lack of jumps in this movie compared to the first one. The first one was pretty clever in how it build up suspense in it through the use of camera, scene layout, lighting, etc. This one simply abandoned that in favor of simply showing images that could've been scarier, but instead seems rather dull. If you get used to the violence, this becomes a very shock-less movie over time. The Freddy lines do need some work, as only a few are actually pretty funny. If only they would've taken the same approach, then part three would've been the laugh-fest it could been. The Final Verdict: It could've been a whole better than what it was, but as it stands, this is a very entertaining film. It has a lot more blood and gore than the first one, so gore hounds will love this one. Seek it out if you like the first one or if supernatural films about witches and warlocks are up your alley. Rated R: Graphic Violence, Graphic Language, Brief Nudity, and a brief sex scene.",
         "Hmm Great Story..actors, not bad at all...music and light good...still.. it is a bad movie, Why? Well i must tell you that I loved the first Warlock, so i bought this one at once when it came, but it was just another. \"Lets do a sequel and make some money movie\" Julian Sands is performing rather well but the feeling and mystery is gone. This story COULD have been great but ..hmm some transparent evil thing is climbing up to our world..hello..no my opinion is that its a fine story but a bad movie",
         "Warlock: The Armageddon (1993) would be a total waste of space if it wasn't for Julian Sands as the Warlock, his scenes are great fun to watch, all the other characters in this film are awful and boring. Julian Sands is the Warlock who is on a mission to get hold of 6 magical runestones that will enable Satan to raise hell on earth, Only 2 people have the power to stop him, 2 teenagers who have inherited druid warrior power!!! The boy who plays the main \"hero\" is such a geeky wimp, it's an insult that this dweeb would have this power to stop the mighty Warlock!!! Like i said before, this film is a one man show, the scenes with Julian Sands are funny, entertaining and the way he kills off various people with lots of clever special effects makes it great fun to watch. But overall i give this movie 5/10, coz all the other scenes were so dull.",
         "Okay this wasn't a great movie but Julian Sands is great as the warlock. more violent that the original, Part 2 shows the Warlock as a much eviler being which I liked. The story is Every six hundred years, a great evil has the opportunity to escape and unleash Armageddon. A group of five stones has the power to either free the evil, or banish it for another six hundred years. An order of Druids battles with a Warlock determined to unleash his father upon the world. I do admit that the first one concentrated on the plot and the atmospher and the second one was lets do a sequel and kill some people but I didn't mind that. I thought it was a good watch, funny at times.",
         "Julian Sands again stands out as the evil oozing, soft spoken disciple/ son of Satan in this slightly less well done sequel to \"Warlock.\" The problem is mostly one of a script that could have been a little more exciting and with a few more thrills. The level of gore just was not as necessary to the story line. Given all that it was still a very watchable film. I have noted one error in the listed credits. Charles Hallahan is listed as Ted Ellinson, the father of the female lead in the story. Actually that part was played by Bruce Glover(best known from \"Diamonds are Forever.\") Hallahan actually played Ethan Larson. The opening scene was somewhat confusing. SInce the Druids were supposed to stop the birth of the Warlock, why were they the ones at the birth, and who were the others that slaughtered most of them?",
         "I was doing a bit of channel hopping and came across the opening credits of some movie that was starting . When I say \" Movie \" I was convinced it was one of those made for television movies ( TVM ) since everything was so brightly lit and plastic looking . Unsure what I was getting I picked up the TV guide which informed me the movie was WARLOCK: THE ARMAGEDDON . I`d seen the original WARLOCK and found it disappointing but after seeing the sequel the original was some kind of masterwork in comparison The first problem is with Anthony Hickox directing . After seeing HELLRAISER 3 : HELL ON EARTH I had some reservations about Hickox ability as a director and after seeing this I do hold the view that he`s not much cop as a director . As I said everything about this movie is far too brightly lit and plastic looking just like you`d see in a TVM while the cast are either poor actors or they`ve been poorly directed . Hickox also insists on filming sequences in slow motion for no other reason than it seemed like a good idea at the time . I also think we could have done without blood splashing everywhere The script too is very bad with the characters being nothing more than cyphers . It lacks any type of idiosyncratic dialogue too . Take this scene for example where the warlock approaches a New York taxi driver Warlock : I want you to transport me to Chicago Taxi driver : Get the f*ck outta my face buddy So there you go the only written scene that features anything resembling characterisation revolves around a stereotypical view of NYC cab drivers . But my major problem with the script involves the plot - I`m not sure it actually has one . What happens is that the Warlock is born ( From a scene stolen from XTRO ) and he goes on a journey which involves him killing people in a bloody way every five minutes . I criticised the original movie for not using its great potential but this sequel had no potential to start with I suppose gore hounds might like it but anyone expecting a coherent story and good acting should give this a wide berth"
      ],
      "genres": [
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "Trimark Pictures",
         "Tapestry Films"
      ],
      "summaries": [
         "Every six hundred years, a great evil has the opportunity to escape and unleash Armageddon. A group of five stones has the power to either free the evil, or banish it for another six hundred years. An order of Druids battles with a Warlock determined to unleash his father upon the world.",
         "The Son of Satan attempts to bring his father to Earth with the aid of some mystic stones."
      ],
      "budget": 3000000
   },
   "movielensId": 4685,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-05-01",
      "dvdReleaseDate": "1999-05-25",
      "directors": ["Anthony Hickox"],
      "runtime": 98,
      "movieId": 4685,
      "title": "Warlock: The Armageddon",
      "mpaa": "R",
      "actors": [
         "Julian Sands",
         "Chris Young",
         "Paula Marshall",
         "Joanna Pacula",
         "Steve Kahan",
         "R.G. Armstrong",
         "Charles Hallahan",
         "Bruce Glover",
         "Craig Hurley",
         "Dawn Ann Billings",
         "Zach Galligan",
         "Michelle Moffett",
         "Richard Zobel",
         "Ferdy Mayne",
         "Anthony Hickox",
         "George Buck Flower",
         "Monika Schnarre",
         "Wendy Hamilton"
      ],
      "imdbMovieId": "0108517",
      "originalTitle": "Warlock: The Armageddon",
      "genres": [
         "Fantasy",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["5arLbaVo_og"],
      "plotSummary": "Every six hundred years, a great evil has the opportunity to escape and unleash Armageddon. A group of five stones has the power to either free the evil, or banish it for another six hundred years. An order of Druids battles with a Warlock determined to unleash his father upon the world.",
      "tmdbMovieId": 24126,
      "avgRating": 2.47973,
      "releaseYear": "1993",
      "numRatings": 222,
      "posterPath": "/mvvrauRX0BRJVCUS9bSBKqBamjh.jpg"
   }
}