{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "sadomasochism",
            "id": 6373
         },
         {
            "name": "illegal prostitution",
            "id": 33625
         }
      ],
      "imdb_id": "tt0420555",
      "video": false,
      "title": "How Much Do You Love Me?",
      "recommendations": [
         12426,
         74641,
         52032,
         64538,
         332980,
         4974,
         56578,
         229878,
         35101,
         18897,
         3542,
         73764
      ],
      "backdrop_path": "/55lr1QMJYx9RKoe6o9ut4PROQ95.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Daniela",
               "gender": 1,
               "credit_id": "52fe43f2c3a36847f8079e1d",
               "name": "Monica Bellucci",
               "profile_path": "/nkrIGojQy6FNn9s5cfpiUAmLeNz.jpg",
               "id": 28782,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "François",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e21",
               "name": "Bernard Campan",
               "profile_path": "/yW7gE7jkRNQUBk4CGq25NDjlVlz.jpg",
               "id": 41029,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Charly",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e25",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "André Migot",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e29",
               "name": "Jean-Pierre Darroussin",
               "profile_path": "/951QpVbYDqI8s0TSQrPyhFZOlHY.jpg",
               "id": 28463,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Michael",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e2d",
               "name": "François Rollin",
               "profile_path": "/jiuNdyIDLOJot0wZ3XKN3tK8jLE.jpg",
               "id": 41031,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Client Daniela",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e31",
               "name": "Jean Barney",
               "profile_path": "/ZciILzAZgoC6hcJxxpM34sy0jG.jpg",
               "id": 25064,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Quidam Pigalle",
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079e35",
               "name": "Baptiste Roussillon",
               "profile_path": "/jNAlEuCeZKYiQyGvtocJHzyS0zu.jpg",
               "id": 41033,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Pamela",
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079e39",
               "name": "Valérie Karsenti",
               "profile_path": "/55p7DtRX1478ctUtrLUvmUqRQ1r.jpg",
               "id": 41014,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Toubib cimetière",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e3d",
               "name": "Jean Dell",
               "profile_path": "/qrtuNju4HlQ1n1T7a3ZnLGQowJA.jpg",
               "id": 35359,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Muguet",
               "gender": 1,
               "credit_id": "52fe43f2c3a36847f8079e41",
               "name": "Sara Forestier",
               "profile_path": "/xtNEa5vbzZ8IWI5bTn5zlMy6Cz2.jpg",
               "id": 17074,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Toubib escalier",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e45",
               "name": "Michel Vuillermoz",
               "profile_path": "/aYw7eWyWMgJsVrv9eHsQDdSFlwm.jpg",
               "id": 20082,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Edouard",
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e49",
               "name": "Edouard Baer",
               "profile_path": "/aRCoMQ6dv366sQ54ccvbemMzRxp.jpg",
               "id": 41035,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "La Voisine",
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079e4d",
               "name": "Farida Rahouadj",
               "profile_path": "/3uTefTPZPwyxjXuLBwlQLuN6c8j.jpg",
               "id": 41037,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e19",
               "name": "Bertrand Blier",
               "profile_path": "/wlAFSiO2T5u8KJ1MVdkbRmm11xW.jpg",
               "id": 34262,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e53",
               "name": "Bertrand Blier",
               "profile_path": "/wlAFSiO2T5u8KJ1MVdkbRmm11xW.jpg",
               "id": 34262,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e59",
               "name": "Olivier Delbosc",
               "profile_path": null,
               "id": 4401,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e5f",
               "name": "Marc Missonnier",
               "profile_path": null,
               "id": 4402,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079e65",
               "name": "François Catonné",
               "profile_path": null,
               "id": 27716,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079e6b",
               "name": "Marion Monestier",
               "profile_path": null,
               "id": 41843,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079e71",
               "name": "Gérard Moulévrier",
               "profile_path": "/gqxUPAjdvLFKKdFXkUi3KpcJzBI.jpg",
               "id": 28690,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079e77",
               "name": "François de Lamothe",
               "profile_path": null,
               "id": 24693,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe43f2c3a36847f8079e7d",
               "name": "Catherine Leterrier",
               "profile_path": null,
               "id": 19058,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.092225,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 5070,
      "vote_count": 43,
      "budget": 0,
      "overview": "After winning the lottery, François goes to a bar in Pigalle and offers one hundred thousand Euros per month to a prostitute named Daniela to live with him as his wife until his money runs out.",
      "similar": [
         50270,
         1904,
         86331,
         10068,
         50124,
         1427,
         1690,
         979,
         2832,
         281,
         261023,
         12662,
         2770,
         4638,
         1278,
         114,
         88,
         319,
         496,
         28468
      ],
      "original_title": "Combien tu m'aimes ?",
      "runtime": 95,
      "poster_path": "/p6bzV2OwL4phDv8abWAK17SH4Ru.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Fidélité Productions",
            "id": 147,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pan Européenne Production",
            "id": 796,
            "origin_country": ""
         },
         {
            "logo_path": "/z0vTTWBhZggM09oZWSY3hbXgPKv.png",
            "name": "Wild Bunch",
            "id": 856,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Plateau A",
            "id": 1852,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films Action",
            "id": 1853,
            "origin_country": ""
         }
      ],
      "release_date": "2005-10-26",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "French Director Bertrand Blier creates an intensely seductive story about beauty, sex and Love.",
      "adult": false,
      "homepage": "http://www.combientumaimes.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Bertrand Blier"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Bertrand Blier"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0420555/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwMjE4MzE2MV5BMl5BanBnXkFtZTcwOTQyNTY1Mw@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Monica Bellucci, Bernard Campan, Gérard Depardieu | See full cast and crew »"],
      "reviews": [
         "Yes, I confess that my approach to this movie was not so enthusiastic, Mrs. Bellucci is not my favorite actress. But the director (Blier) and Gerard Depardieu are a warranty, in my opinion. The movie is a \"divertissment\" played around a man, who try to buy the love of a magnificent whore(Bellucci), stating he win the price at the lottery,and so offering her a 100 thousand euros per month salary. So, could this indecent proposal buy her love? and what's about the pimp(Depardieu)? The plot has the capacity to stay light, the music helps a lot to accept the events as a play, the life is surprisingly wonderful, love is the mystery. And Monica Bellucci is a full joy, a daydream for all the middle aged, insignificant men searching for a reason to dream.",
         "How Much Do You Love Me? is a romantic sex comedy featuring the irresistible Italian actress Monica Bellucci as the leading actress, with veteran actor Gerard Depardieu and Bernard Campan as the 2 leading guys in the drama, which involves weak heart, sex, lottery, blackmail and tonnes of laughter. Francois (Campan) is a civil servant living in a bachelorhood. He strike lottery and he set his eyes on Daniela (Bellucci), a beautiful prostitute. He makes an offer of paying her 100,000 euros per month to stay with him until he used up his cash award of 4 million euros. She moves in with him and everything begins from a role play of husband and wife. As they goes on, he develop feelings for her. However, Charly (Depardieu), a mafia boss, who was the lover of Daniela, steps in. He opens up a proposal for Francois: to buy the freedom of Daniela from Charly at 4 million euros. Director Bertrand Blier has spiced up the film with tonnes of laughter, with a touch of slapstick. While some of the scenes might seems to be exaggerating, it is actually not. At a certain level, he has brought up the loneliness of a middle age bachelor faced, from mentally to physically. Monica Bellucci is the focus of How Much Do You Love Me. Once again, she takes up the sexually challenging role of a prostitute after Malena and Irreversible. She swings in between Campan and Depardieu, where the former is a civil servant paying for the service, and the latter her lover. Swining in between the 2 men spices up the later part of the film, where it is unmissable. Depardieu, however, seems to be pulling the whole film down, where the role of Charly the mafia boss seems to be too dull and boring. Though he might be trying hard to play the role of mafia boss, more effort can be put in. Campan, on the other hand, has room for improvement, though it can be seen that effort has been put in. Do not expect any raunchy sex scene in How Much. Instead, do expect the witty and humorous sex jokes and argument in a scene where Bellucci, Campan and Farida Rahouadj (who plays Francois's neighbor) gather outside the house for a dispute. This movies worths 6/10. And it is a good movie to spice up a boring weekend night.",
         "How Much Do You Love Me? examines that emotion called Love, or what it's perceived to be. Will you make pretend and move in with someone? Are you loving someone because of his riches? Or because of his huge wiener or her hot body? Is it purely lust or love? And how in the world do fugly people snag all the hot chicks too? Between money and love, which would you choose (and taking too long to decide doesn't earn you brownie points)? Like Pretty Woman, only with less candy fluff, how can someone fall in love with a whore? (Ok, so it might sound politically incorrect, but that's how the movie plays it out) A regular joe, Francois, falls for a prostitute at a bar. Played by Monica Belluci, Daniela is the obsession of Francois, as he engages her services for 100,000 Euros to live with him for a month (she charges 150 Euros a night, so work out the math) until he runs out of cash. A balding man who just won the lottery of 4 million Euros and some, he sure knows how to pick up and select his women. Soon after, Francois becomes the envy of everyone (so is Vincent Cassell, but I digress), as friends like his personal doctor advises him to go easy on his escapades because of his weak heart. But in this black comedy, unfortunate events befall upon those who try to keep the couple apart. It's a tad interesting too as the movie plays out the fantasies of these nay- sayers, as they too lust after Daniela in secret. There's a twist to all the madness, and the final revelation will make you go \"ahh!\" as the scheme is unveiled to a whacked out near ending sequence (do I love that sexy dance move). However, as do most art movies go, the ending leaves much to be interpreted in many ways. The visuals are beautiful to look at, and no, I'm not just talking about Bellucci here, although I'd rather watch her in action than the other old babe Sharon Stone in Basic Instinct 2. Blended with a lot of jazz, it has a bluesy feel to it all, punctuating melancholic mood throughout as felt by the characters. And it's the three key characters who keep the storyline interesting. A regular bloke buying his way to a woman's heart. A woman who whores because she wants to (and probably satisfying her insatiable appetite for sex), and her gangster husband Charly (Gerard Depardieu) who allows her to do what she wants to, as his interpretation of love is the clichéd \"if you love her set her free. If she returns she's yours\" belief. In the end, love is also about respect, and that's the lesson Charly needed to learn. It's plenty talk about love, sex and even orgasms, and the highlight is probably the three way negotiation on the table as Francois and Charly haggle the price over Daniela. Can love be attached with a price? How much is it worth? The plenty of ah-peks in the audience will probably have an answer to this question, and no doubt, ensure this movie's longevity in local screens.",
         "I would probably tear \"Combien tu m'aimes?\" to shreds, if it weren't for gorgeous Monica Belluci. She's perfect as a prostitute, Daniela who decides to change her life. To my mind, she's the sexiest actress in the showbiz and all guys will obviously like this flick as Monica exposes her beautiful body here. Nevertheless, I cannot write anything else good about this film. I found writing terrible. The movie consists of numerous accidental threads and, therefore, is very incoherent. I think that screenwriters really had nothing interesting or particularly funny to say. All men are simply overwhelmed by Daniela throughout the flick and it's generally the whole plot. The movie is kept in tiring in the long run grotesque style and some scenes are wordy. I couldn't stand operatic music which was unnecessary in this supposedly light comedy. To summarize, this French movie should solely see ardent fans of Monica Belluci. I'm numbered among them and wish Italian actress chose better projects.",
         "In Paris, after winning the lottery, the clerk François (Bernard Campan) goes to a bar in Pigalle and offers one hundred thousand Euros per month to the prostitute Daniela (Monica Bellucci) to live with him until the end of his money. François is a lonely man, with heart problems and Daniela stays with him for eight days. Then, she decides to come back to her man, the mobster Charly (Gérard Depardieu), but she misses François and returns to his place. But once a whore, always a whore. The promising \"Combien Tu m'Aimes?\" is a great deception: having Monica Bellucci, Gérard Depardieu and Bernard Campan in the cast, and directed by Bertrand Blier, this \"dramatic romantic comedy\" has a weird development and a confused and disappointing open conclusion. I honestly did not understand the last quarter of this movie, which is simply awful. The screenplay wastes a good and original idea, and the character of Gérard Depardieu is absolutely dull and ridiculous. The beauty of Monica Bellucci, even with forty-one years, is the best this mislead movie can offer. My vote is five. Title (Brazil): \"Por Amor ou Por Dinheiro?\" (\"For Love or For Money?\")",
         "As his earlier film \"Merci la vie\", \"combien tu m'aimes\" is Blier's homage to almost unknown Alain Robbe-Grillet films, auteur of the Nouveau Cinema, movies that try to invent a new language or new styles to show stories in cinema. So in this movie actors are shown as actors, they're really acting and don't try to seem natural. In fact they're real accessories to serve the director. He ask them to do whatever he wants and big stars even like Depardieu listen to his orders because he knows that he's a good director that knows what he wants and that he's in control of the movie. But I have to tell that it is a really sexist movie, some women shouldn't watch it because they would be offended. The word \"whore\" comme at least every minute, and Bellucci is shown as a female object. Sure the movie say that women can manipulate and control men, but at the end of the movie we see that men have the last word. There is some hilarious scenes like the one in the corridor with the neighbor and Bellucci arguing about how women should have an orgasm, and some jouissive scenes for their daring, but there are also some scenes I didn't like because they were maybe 'too much' and useless. Still it's a really enjoyable film to see.",
         "I've watched the Depardieu-Blier films all the way back to VALSEUSES and enjoyed them so I came at this one believing all the knocking comment must be wrong. Well it's certainly not a dead loss. Campan registers in a tricky role acquiring Pigalle poule de luxe Bellucci and taking her back to his office worker flat, despite his shaky health and down at heel associates and this part plays quite well. Surprisingly, it's when an aged Depardieu doing \"vieux jeu con\" shows up that things become strained. Well with a record like this, these guys are entitled to one screw up. The film is by no means a write-off with the changes of light, background and costume within scenes getting attention until you realize that, if they have any meaning, Blier is not going to share it with us. The opera score has oddity value and the small parts are striking. Farida Rahouadj's turn as the Northern neighbour is particularly attention getting. It's a pity to find this one getting international showing on the strength of its star power, in place of more imposing product.",
         "What a disappointment. I was expecting much more from a film coming from Bertrand Blier, who has made Tenue de Soir in the 80s, and a bunch of reasonable films since. Having Depardieu and the mind-blowing Monica Belucci in the film was not certainly enough. All the film turns around Monica Belucci. Sure, such a beauty makes man die for and can make them pay millions or kill for, the issue is that the characters in this film seem to be willing to do exactly this, and this is the whole story, not much more. One of the reasons of failure is I believe the cast. Bernard Campan in the role of the gray clerk who wins the lottery and intents to buy a beautiful Italian whore for the rest of his life is lacking charisma, and there is no chemistry between him and Monica Belucci. In other words, I can certainly understand him, but I cannot understand her, and the whole intended love story is less than credible. All around dance a bunch of characters who fail to be coherent enough, or funny, or to be able to collect any sympathy. Even Gerard Depardieu who is an actor who seemed not to be able to do wrong looks like mis-cast. Actually all characters seem under-developed, and if it were not for Monica Belucci's beauty and talent (almost completely wasted here) the film would have sunk into complete failure. It gets a few stars however, and all belong to Belucci.",
         "Bertrand Blier, one of the most innovative provocateurs of the French Cinema, is at it again with this satire which will be viewed with pleasure or anger by his fans. Mr. Blier, who also wrote the screen play, is a man whose movies appear to be something on the surface, but he, like other Europeans are really examining the society in which they live. Therefore, it's easy to dismiss this work on the outward appearance of what one sees on screen. The premise is about how money can't buy happiness, or even sexual excitement, as is the case with the poor Francois, a man who, might, or might not, have won a fortune in the French lottery. When he spots the luscious Daniela, he wants her, at whatever cost. The way he figures, even in spite of his health, he is entitled to the gorgeous prostitute now that he has money. Little prepares Francois, an office worker, to a life with Daniella. She is rather complicated, with a pimp named Charly, who has a different plan for her and the man who has paid for her services. Charly enters their lives and everything changes, as Daniella's loyalties are put to a test. The best reason for watching this film is Monica Bellucci, an actress with a lovely face and figure. The spectator becomes riveted to the time she is on the screen. Bernard Campan is the deadpan Francois, a man whose will is put to a test when he gets more than what he bargained for. Gerard Depardieu, a man who owes his career to Mr. Blier, plays the enigmatic Charly. Farida Rahouadj, is seen as the neighbor of Francois and Jean Pierre Derroussin has a pivotal role as well. \"Combien tu m'aimes\" is not for everyone, but true fans of Bertrand Blier will enjoy this film because of the way he provokes them into areas that are original as well as different from many filmmakers.",
         "I love French cinema, but I was rather disappointed by this movie. The most positive thing about this movie is beautiful and erotic Bellucci taking her clothes off but the plot is so poor I can't understand Gerard Depardieu playing such a one-dimensional person. The dialogs are sometimes ridiculous, maybe unintentionally because of the bad German synchronization I watched. It is not enough to play classical opera music instead of creating a convincing dramaturgy and script. But to mention some positive aspects as well, there are plenty of breathtaking stills like Bellucci sitting in the window of the bar in Pigalle or \"Francois\" and \"Daniela\" at the beach, so the movie offers, as French cinema often does, excellent aesthetic quality. Accepting that this is cinema showing totally artificial characters, you might have a good time watching this movie."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Fidélité Productions",
         "BIM Distribuzione",
         "France 2 Cinéma"
      ],
      "summaries": ["In Paris, after winning the lottery, the clerk François goes to a bar in Pigalle and offers one hundred thousand Euros per month to the prostitute Daniela to live with him until the end of his money. François is a lonely man, with heart problems and Daniela stays with him for eight days. Then, she decides to come back to her man, the mobster Charly, but she misses François and returns to his place. But once a whore, always a whore."],
      "budget": 10000000
   },
   "movielensId": 46957,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2005-10-26",
      "dvdReleaseDate": "2007-12-04",
      "directors": ["Bertrand Blier"],
      "runtime": 95,
      "movieId": 46957,
      "title": "How Much Do You Love Me?",
      "mpaa": "",
      "actors": [
         "Monica Bellucci",
         "Bernard Campan",
         "Gérard Depardieu",
         "Jean-Pierre Darroussin",
         "François Rollin",
         "Jean Barney",
         "Baptiste Roussillon",
         "Valérie Karsenti",
         "Jean Dell",
         "Sara Forestier",
         "Michel Vuillermoz",
         "Edouard Baer",
         "Farida Rahouadj"
      ],
      "imdbMovieId": "0420555",
      "originalTitle": "Combien tu m'aimes ?",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After winning the lottery, François goes to a bar in Pigalle and offers one hundred thousand Euros per month to a prostitute named Daniela to live with him as his wife until his money runs out.",
      "tmdbMovieId": 5070,
      "avgRating": 3.30556,
      "releaseYear": "2005",
      "numRatings": 18,
      "posterPath": "/p6bzV2OwL4phDv8abWAK17SH4Ru.jpg"
   }
}