{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monitor",
            "id": 156641
         },
         {
            "name": "hitchhiking",
            "id": 163726
         },
         {
            "name": "electroconvulsive therapy",
            "id": 164880
         }
      ],
      "imdb_id": "tt0068379",
      "video": false,
      "title": "Ciao! Manhattan",
      "recommendations": [],
      "backdrop_path": "/zEqGWH1lWcVjN1Ax07mSBYGVMLJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Susan Superstar",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7ac3",
               "name": "Edie Sedgwick",
               "profile_path": "/2GNZ8oIgc5pZi1GKEKzM3UNp5XX.jpg",
               "id": 105056,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Butch",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7adf",
               "name": "Wesley Hayes",
               "profile_path": null,
               "id": 1272764,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Mummy",
               "gender": 1,
               "credit_id": "52fe4605c3a36847f80e7ae3",
               "name": "Isabel Jewell",
               "profile_path": "/oTaZ9jY0BpCjiGuoGnlxVA3m24b.jpg",
               "id": 33277,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Geoffrey",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7ae7",
               "name": "Jeff Briggs",
               "profile_path": null,
               "id": 1272765,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7aeb",
               "name": "Paul America",
               "profile_path": null,
               "id": 1272766,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Tom",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7aef",
               "name": "Tom Flye",
               "profile_path": null,
               "id": 1272767,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mario",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7af3",
               "name": "Gabriel Lampa",
               "profile_path": null,
               "id": 1272768,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Yoli",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7af7",
               "name": "Pat Hartley",
               "profile_path": null,
               "id": 980367,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Receptionist",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7afb",
               "name": "Nell Bassett",
               "profile_path": null,
               "id": 1272769,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Doctor Robert",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7aff",
               "name": "Charlie Bacis",
               "profile_path": null,
               "id": 1272770,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Charla",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7b03",
               "name": "Jane Holzer",
               "profile_path": null,
               "id": 1272771,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "David",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7b07",
               "name": "David Weisman",
               "profile_path": null,
               "id": 70282,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Wes",
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7b0b",
               "name": "Wesley Rand",
               "profile_path": null,
               "id": 1272772,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Dr. Braun",
               "gender": 2,
               "credit_id": "52fe4605c3a36847f80e7b0f",
               "name": "Roger Vadim",
               "profile_path": "/oftdq5DjC1loKRBLP4KfKauuc5e.jpg",
               "id": 53767,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7ac9",
               "name": "David Weisman",
               "profile_path": null,
               "id": 70282,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7acf",
               "name": "John Palmer",
               "profile_path": null,
               "id": 192625,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7ad5",
               "name": "John Palmer",
               "profile_path": null,
               "id": 192625,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4605c3a36847f80e7adb",
               "name": "David Weisman",
               "profile_path": null,
               "id": 70282,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.317656,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42479,
      "vote_count": 4,
      "budget": 0,
      "overview": "The very sad tale of socialite & Warhol muse Edie Sedgwick (1943-1971) who effectively plays herself in a film that follows her life in a large part from the time she left Warhol's 'factory' and what the life of excess drugs did to her sanity. Edie was such a beautiful fragile girl - who finally got her head together and got married (her wedding day video is edited into the end of the movie) but it was too late, her husband woke up on a morning in November 1971, only weeks after filming wrapped, and found her dead beside him. She had died in her sleep from overdosing on her medication she was 28.",
      "similar": [
         137094,
         8456,
         94329,
         320,
         3078,
         14484,
         9913,
         9777,
         1599,
         29917,
         11934,
         868,
         61653,
         14223,
         24679,
         300,
         38842,
         11602,
         12271,
         10856
      ],
      "original_title": "Ciao! Manhattan",
      "runtime": 84,
      "poster_path": "/9mhw6juV5hi2Tly96z2xQiDt0dy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1973-04-19",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "John Palmer",
         "David Weisman"
      ],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "John Palmer",
         "David Weisman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068379/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MTExNDUzNl5BMl5BanBnXkFtZTcwOTk1NzcxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Edie Sedgwick, Wesley Hayes, Isabel Jewell | See full cast and crew »"],
      "reviews": [
         "As Edie's biography here on IMDb says, she was in and out of institutions. It is clear that this woman-child was taken advantage of very callously by Andy Warhol and others, at first for her money, and later for her celebrity. Ciao! Manhattan shocked and angered me when I first saw it in 1972, because I had known Edie. For several months in 1962, when she was in a very tony, low-security psychiatric institution in Westchester, I knew her as a sweet-natured, somewhat reticent, and very artistic 19-year-old. When I first met her I thought she was a 12-year-old child, as I was, for she was so thin and under-developed looking for her age. Seeing the way she is abused in Ciao! Manhattan just leaves me feeling very sad for her. She deserved better than this exploitation film. As for the \"Summer of Love\" reference made by an earlier reviewer on IMDb, referring to the fact that this film was actually made partly in 1967, I do not think Ciao, Manhattan represents any of the genuine feelings of free expression and loving attitudes that were touted at the time. There is far too much cynicism inherent in this film to connect it in any way to the hippie happiness one could experience in pleasanter circles than that inhabited/created by the ghastly, selfish, mean-spirited, and self-involved Warhol. He used and threw away such gentle souls as Edie. I weep for the lost and under-appreciated life she led while under the influence of Warhol. In kinder company, she might have survived and been happier. Ciao, Edie! You deserved better.",
         "The thing I really love about the D.V.D. revolution of the last few years is that some of the strangest and most obscure movies are now readily available. No longer do you have to spend hours searching through the racks in out of the way video stores or resort to fourth generation bootleg copies. 'Ciao Manhattan' is a case in point. I'd been curious about this movie ever since reading Jean Stein's brilliant Edie Sedgwick bio 'Edie' back in the 1980s, and now here it is! The 30th Anniversary edition, with excellent picture commentary and deleted footage. The only people who seem more excited about seeing it again than me are the directors (John Palmer and David Weisman) themselves going by the chatty and informative commentary track they have made with 'Ciao Manhattan' co-star Wesley Hayes. For those who don't know Edie was \"The Face of 1965\", a beautiful socialite turned model and Warhol \"superstar\". At one point in the 1960s quite possible the coolest girl in the world. Very shortly thereafter she was almost forgotten, and died aged 28 after a drug overdose. 'Ciao Manhattan' is made up of black and white footage shot in 1967 originally intended for a never finished movie that almost accidentally starred Edie, and later colour footage filmed in an attempt to salvage the project. In the final version Edie plays a character called Susan, a former model and underground film star who has retreated to her mother's home for \"treatment\". She's a mess - has permanent brain damage and a drinking problem. Hayes plays Butch a young Texan drifter who picks Susan up while she is hitchhiking half naked down the highway. He returns her home and Susan's mother (Isabel Jewell) hires him to babysit her troubled daughter. The movie cuts between \"now\" and then, colour and black and white, documentary footage and paranoid sci fi fantasy. It's quite a trip! Anybody interested in Andy Warhol or The Velvet Underground will want to see this very strange, but watchable mess. Neither Warhol or The Velvets actually appear mind you, but Warhol scenesters like Paul America, Baby Jane Holzer, Brigid Berlin (Brigid Polk) and Viva do, as do Beat legend Allen Ginsberg (as himself, mostly naked) and 'Barbarella' director Roger Vadim (clothed, as Susan's doctor). If you watch the outtakes you also get to see Robert and Nena Thurman. Yes, Uma's folks. 'Ciao Manhattan' may not thrill everyone but for me it's essential viewing for anyone interested in 1960s pop culture, especially Warhol's Factory, which subsequently influenced almost every underground pop movement thereafter from punk on down.",
         "This might register as the most disturbing movie I've ever seen--and I've seen a lot of Italian cannibal movies. Edie Sedgwick, the most tragic (because most beautiful) of all contemporary tragic beauties, undergoes her last humiliation in this nightmarish fake-\"underground\" movie, which suggests the movie the Manson Family might have made if Sharon Tate hung around them for a few weeks. Rebounding from a stint in rehab, and a meteoric rise in the Warhol Factory world, \"Susan\" (Edie) frugs topless in her tent in the swimming pool behind Mummy's house, while a hitchhikin' hippie from Houston thinks in voiceover narration, \"Maybe now I get me some poont!\" For anyone nostalgic for the idealism of the Summer of Love, CIAO! MANHATTAN is essential viewing--its cold-blooded delectation of its terminal heroine makes old stoners like Dennis Hopper and Oliver Stone look like pantywaists. Why Sedgwick participated in this drooly, tabloid-voyeuristic cartoon of her steep decline is hard to imagine: Her famous beauty is in such staggering ruins that the filmmakers evilly pose her against a poster of her winsome debutante self to mark the damage. The experience of watching this movie resembles seeing a once-dewy ingenue dancing a jig for coal miners to buy a ten-dollar rock of crack.",
         "Ciao! Manhattan is an avant-garde film that makes the films of Jean-Luc Godard seem conventional. That's not to attack Godard, mind you. I'm just comparing the two to express how far out Ciao! Manhattan is. The slight narrative concerns a young Texan hippie traveling the American countryside just because he likes to see things. One night, he sees something quite unexpected: a beautiful young woman with bare breasts hitchhiking. He picks her up (who wouldn't?) and finds that she has a couple of dog tags around her neck with her name, Susan, and address on them. He takes her home. Susan's mother thanks him and offers him a job taking care of her daughter. Susan was a young model in New York, a discovery of artist Andy Warhol. She lived a life of hard partying, and is now paying for it with a severe case of brain damage. Now Susan lives in a drained pool in her mother's back yard, and she spends endless hours drinking hard liquor and rattling off stories about the old days in New York. At first, Ciao! Manhattan just seemed to me an excessively playful experimental film with a bunch of bizarre imagery and editing and stuff. I was laughing, it was fun to see the excesses of that sub-culture which I know so little about. But after a while, the film just started working, and really well. Susan is played by Edie Sedgwick, who really was a protege model of Andy Warhol. The film works a fine balance between reality and fiction. How much of Sedgwick are we seeing? Is any of it fictional. She died three months before the film was released, and, edited into the last moments of the film, there is a shot of a newspaper headline that announces the death. Whether Ciao! Manhattan was meant to be or not, it serves as a dirge, not only to Edie Sedgwick, but to the young generation of the time. I don't know, maybe I loved this film because I grew to adulthood so far after the hippie generation, but I'll tell you one thing: I have seen a ton of the greatest films ever made. It's a rare experience to come upon one that is as unique as this one. Perhaps there were a thousand films like this at the time, but none are available except this. Well, I choose to praise this. 10/10.",
         "In this hip,beat and drugged out portrait of famed NY.city underground glitter Queen and palsy walsy of Andy Warhol,we have a trippy docudrama of that time period and how one very cutesy and impressionable little rich girl didn't survive the wear and tear of a life dedicated to drugs and big city glitter.Edie Sedgewick was almost the perfect model,being very camera friendly and celluoid exposed.She didn't take bad pictures and had THAT FACE,which drew attention and was seemingly just right for exposure.The trouble wasn't in her posing or ability to get the right profile,only in her devotion to staying on top of the world with drug induced glee and ever more satiable desire to repeat the scene.She couldn't grow out of her infatuation with being high and on top of the world,the ultimate speed freak,with a penchant for glitzy clothes and crowd of Warhol underground artsy fartsy hangers who lived faster than the human anatomy was meant. This movie captures her at her worst and yet via flashback photo's, also at her prima dona prime,being one of Warhol's favorite underground side kicks and possible muses.For a wealthy Radcliffe girl from an estemmed family of strict heirarchy and upbringing,her troubles were best felt in the book \"EDIE\" by George Plimpton ,but also more than touched on in this movie,which also parodied her real life with more than a bit of candor.Since the movie was shot around her last days,and her apparent pathetic condition - PBD ,permanent brain damage, we are left with a shallow and uncharacteristic rendering of that fantastically cute and bubbly little Miss prissy innocence,stained by too many ciggs,pills,drinks, and shacks ups.A life of indulgence that got her to the point of the overall plot of the movie,wretched excess and the hallucinatory effects and spill over of that psychosis of conspiracies and mind confusing tricks that long term drug use and little sleep play upon the human condition.I remember reading in Plimptons book 'EDIE\" that Paul America once went a whole year with only a 20 min. nap whilst on a bus in N.Y.city.Crazy times and crazy behavior was the theme of his life as well as Susan \"Edie\" in this movie and of course,their real alter ego lives that went nary too far past their prime,sadfully.",
         "This film is interesting only to anyone familiar with the saga of Edie Sedgwick. And it seems a bit ghoulish/voyeuristic to admit watching it for that reason. Although it's often claimed to be a biography of Edie, the film really is just a painful look at a person in the final stages of mental illness-drug addiction. She died soon after filming completed, which is no surprise. The plot of Ciao is pretty garbled by the storyline involving the character Mr. Vedecchio. The director's commentary explains that Vedecchio was only added to the movie because during shooting the rest of the cast disappeared and there was nothing else to do but beef-up this role. In fact, the whole movie is a cut-and-paste of pre-meltdown Edie (black and white footage) and post-meltdown Edie (color), with Vedecchio and Paul America tossed into the mix. The color section also introduces Butch, the drifter from Texas, who does provide some much-needed comedy. Although Ciao, Manhattan might not be particularly entertaining on its own, the DVD extras in the Anniversary package are wonderful, and to me made the disc worth purchasing. The directors' (and Butch/Wesley's!) commentary provides the story of how this movie \"directed itself\", and informs much about Edie and her state of mind during the last days of her life. There is quite a bit of extra footage from the Warhol-NYC days, and some terrific stills of Edie. A nice booklet is also included.",
         "A silver lipstick stained blueprint to the \"Big Come Down\" era, Ciao Manhattan is, by technical standards, very bad. Though the color sequences are well photographed and the older clips seem well reproduced, the narrative is clumsy and the sound is choppy. This doesn't bother me and whereas, I would like to see a coherent documentary on Edie, the flaws of the film are perfect alongside the flawed characters in the film. It possesses a very paranoid, broken and detached quality that is in keeping with a certain sub genre that has grown over the ensuing years. In music, it's everything low-fi since the LP, The Velvet Underground & Nico(1967). In film-making, it's any art film since Andy Warhol's Empire(1964). The film is, quite by incident, the very quintessence of the dangers of mixing cinema verity lifestyle with a diet of tablets which include a total disregard for the wages of sin, in favor of \"really living\". (i.e. on film, on drugs and off reality). What illustrates this is that Susan(Edie)isn't really acting in this film, but seems to be fooling herself (with coaxing from the filmmakers, no doubt) into thinking that she is, simply because, she's using the name Susan and is probably on LSD most of the time. It's a kind of twisted defense mechanism that Edie is using to distance herself from her own personal reality. This is ironic, considering the fact that her personal reality is the focus of the entire film and that her(Edie's) own mortal coil is unraveling faster then footage can record it. But, the cameras are tenacious and keep rolling thru her staged shock treatments(a true event) to her \"last chance at a normal life\" marriage(a true event captured on 8mm complete with a Warholsque posterized sequence) and finally a news clipping of her obituary. The film serves well as a cautionary tale to the contemporary modern girl, with Susan(Edie) as the prototype modern girl, trying anything new, without regard to the consequences. i.e. forced stardom, derelict emotions, mood management drugs, radical psychotherapy techniques and even a botched breast job. This has all become a common lifestyle today(in 2006), perfected by time and human casualty. Susan(Edie) was an incidental trailblazer in a film(lifestyle) where the sun shines too white hot for human beings to bare it, yet is too intoxicating for the obsessive ones to turn away from. Like a pretty, lactose intolerant, lab rat that keeps eating the cheese in spite of the gas pains, Susan(Edie) was caught in a maze of learned behavior and couldn't resist it's unhealthy escapism's, even though she must have felt the grim reaper's hand on her emaciated shoulder. As long as she was feeding her head and all eyes where on her, she really lived. She only \"snuffed it\" after filming had concluded and she was faced the realism of a sober, off camera existence. The book \"Edie, An American Biography\" is required reading if you want to get the most out of this film and may be all you can take. *Not for the mentally squeamish.",
         "Definitely an odd little time killer about Edie Sedgwick, an Andy Warhol fledgling who has fallen on hard times, and is living in a swimming pool in Beverly Hills. Very trippy strange little flick, more so pasted together with old clips of Edie in some early Warhol films. Would have served a better purpose as a documentary, but definitely worth checking out. Obviously this is not for all tastes.",
         "\"Ciao Manhattan\" has a lot of interest for those interested in Andy Warhol and his parade of 15 minute superstars. The film has an experimental style that recalls \"El Topo\" with more editing. Given these two characteristics, it sounds like a film with limited appeal. Surprisingly, its an oddly touching and tragic (if occasionally incoherent) tale of how one can't accept their fifteen minutes of fame being over. It details someone who is a has-been in the worst sense and how fortune and excess damaged her life and mental capacities. Viewed in the new footage, Edie Sedgwick comes across as pathetic and sympathetic all the same. The filmmakers never seem to exploit Sedgwick, only letting her speak for herself. Its a grim and depressing picture. The film's style works to enforce the central theme. John Palmer and David Weisman creatively take footage from an abandoned Warhol spy picture and work it into flashbacks of the New York scene. I didn't realize a lot of it wasn't actual documentary footage until reading so afterwords. The film is heavy on the symbolism which could garner comparisons to other midnight head films of the time such as \"El Topo\". However, the editing style is closer to the works of Kenneth Anger and (of course) Andy Warhol. Still, the film's style is all its own and while it isn't flawless (its draggy in spots), its overall a very effective work. (7/10)",
         "WARNING: May Contain Spoilers Despite its veneer of fiction, this film more resembles an autobiography of tragedy. And, to be sure, this is a cautionary tale. At least it should be. If you ever wanted to see how ugly a \"beautiful\" person can be, watch this movie. Viewing this movie is akin to watching a train wreck in slow motion. It is terribly interesting, yet awful at the same time. The underlying story involving the league of \"drug\" pushers, \"alien\" manipulators, \"quack\" doctors, and self serving hippies does not mask the gritty reality underlying this film. Frankly, fame, drugs, and the Warholians ruined a beautiful young woman's life. I'm sure the critics of the day appreciated this film's message of moral relativism and the supposed hypocrisy of the \"normal\" world. Thirty years later, it is clear that the destructive, callous, and cavalier attitude of the social experimenters wreaked havoc with those bold enough to be \"different.\" I think it is fair to say that the survivors of that lifestyle don't have a bit of regret about that fact either. The proof is in the pudding, and Warhol and his cult are still celebrated. I give this film a generous 4 out of 10 ranking because the subject matter is fascinating. If this footage was reworked as a true documentary, dropping all of the psychic garbage, this could be an 8 out of 10 piece. Of course, the rework would have to be made by historians rather than art historians."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Court Pictures",
         "Maron Films",
         "Sugarloaf Films Inc."
      ],
      "summaries": ["CIAO! MANHATTAN parallels Andy Warhol Factory star Edie Sedgwick's glory days in the late 60's through her inevitable downfall and the tragic addiction that would take her life only weeks after filming wrapped in 1971."],
      "budget": 0
   },
   "movielensId": 47165,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-04-19",
      "dvdReleaseDate": "2002-11-12",
      "directors": [
         "David Weisman",
         "John Palmer"
      ],
      "runtime": 84,
      "movieId": 47165,
      "title": "Ciao! Manhattan",
      "mpaa": "",
      "actors": [
         "Edie Sedgwick",
         "Wesley Hayes",
         "Isabel Jewell",
         "Jeff Briggs",
         "Paul America",
         "Tom Flye",
         "Gabriel Lampa",
         "Pat Hartley",
         "Nell Bassett",
         "Charlie Bacis",
         "Jane Holzer",
         "David Weisman",
         "Wesley Rand",
         "Roger Vadim"
      ],
      "imdbMovieId": "0068379",
      "originalTitle": "Ciao! Manhattan",
      "genres": [
         "Documentary",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The very sad tale of Socialite &amp; Warhol Muse Edie Sedgwick (1943-1971) who effectively plays herself in this odd Film, it follows her life in a large part from the time she left Warhol's 'Factory' and what the life of excess drugs did to her sanity, Edie was such a beautiful Fragile girl - who finally got her head together and got married (her wedding day video is edited into the end of the movie) but it was too late, her husband woke up on a Morning in November 1971 and found her dead beside him, she had died in her sleep from overdosing on her medication she was 28.",
      "tmdbMovieId": 42479,
      "avgRating": 2.6,
      "releaseYear": "1973",
      "numRatings": 10,
      "posterPath": "/9mhw6juV5hi2Tly96z2xQiDt0dy.jpg"
   }
}