{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "casino",
            "id": 585
         },
         {
            "name": "ambulance",
            "id": 1546
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "wound",
            "id": 2820
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "trumpet",
            "id": 6653
         },
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "ballet",
            "id": 10551
         },
         {
            "name": "dead body",
            "id": 10877
         },
         {
            "name": "tears",
            "id": 14708
         },
         {
            "name": "drink",
            "id": 33719
         },
         {
            "name": "car wash",
            "id": 156401
         },
         {
            "name": "drunkenness",
            "id": 188991
         }
      ],
      "imdb_id": "tt0250323",
      "video": false,
      "title": "The Deep End",
      "recommendations": [
         27362,
         41166,
         40927,
         42719,
         32831,
         43940,
         123067,
         41747,
         84278,
         42134,
         3581,
         47692,
         147747,
         54933,
         1999,
         84090,
         66488,
         55819,
         49299,
         45390
      ],
      "backdrop_path": "/8CIYv7iQgB5aXBC82a49DJ1TrCc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Margaret Hall",
               "gender": 1,
               "credit_id": "52fe44b0c3a368484e031547",
               "name": "Tilda Swinton",
               "profile_path": "/eGNo9qwlunvAi4kCVUEFtQFM5X.jpg",
               "id": 3063,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alek Spera",
               "gender": 2,
               "credit_id": "52fe44b0c3a368484e03154b",
               "name": "Goran Visnjic",
               "profile_path": "/kMtnrBNrinINIgQIyWhATYRP8Ne.jpg",
               "id": 5725,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Beau Hall",
               "gender": 2,
               "credit_id": "52fe44b0c3a368484e03154f",
               "name": "Jonathan Tucker",
               "profile_path": "/jvJpYDbwmUTACw7Yn7PKOP6CdlJ.jpg",
               "id": 17243,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Darby Reese",
               "gender": 2,
               "credit_id": "52fe44b0c3a368484e031553",
               "name": "Josh Lucas",
               "profile_path": "/gv7jI1SZLRXRVJnNGOS1zK6yWB.jpg",
               "id": 6164,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jack Hall",
               "gender": 2,
               "credit_id": "553acdccc3a3683e550021f4",
               "name": "Peter Donat",
               "profile_path": "/uHnhxFAfc9mStZG2lFFyFPeJFYV.jpg",
               "id": 14849,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Carlie Nagel",
               "gender": 2,
               "credit_id": "553acdfdc3a36878450093ed",
               "name": "Raymond J. Barry",
               "profile_path": "/k4WDNgYHOUgRaPQIsZUPUxl1lO6.jpg",
               "id": 10361,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Paige Hall",
               "gender": 1,
               "credit_id": "553ace0d9251413f5a0048a5",
               "name": "Tamara Hope",
               "profile_path": "/amCIcZJ7RoJP5x9qlqMgZanYqTl.jpg",
               "id": 36810,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Dylan Hall",
               "gender": 0,
               "credit_id": "553ace4fc3a36820ec0009ef",
               "name": "Jordon Dorrance",
               "profile_path": null,
               "id": 1458758,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Sue Lloyd",
               "gender": 0,
               "credit_id": "553ace669251416788001ff7",
               "name": "Heather Mathieson",
               "profile_path": null,
               "id": 1190369,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Loan Officer",
               "gender": 2,
               "credit_id": "553ace7ac3a36831dd00aa6c",
               "name": "Holmes Osborne",
               "profile_path": "/gMeHJT6u5VRO8RnAgPuBYrB7Krn.jpg",
               "id": 1578,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Deputy Sheriff",
               "gender": 2,
               "credit_id": "553ace9992514135c8000d19",
               "name": "Richard Gross",
               "profile_path": "/kpFs6V76raU7AEe3bVlHh1ZwE4s.jpg",
               "id": 158126,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "BYD",
               "gender": 0,
               "credit_id": "553acec9925141651800bf41",
               "name": "Kip Martin",
               "profile_path": null,
               "id": 63471,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b0c3a368484e031559",
               "name": "Scott McGehee",
               "profile_path": "/yEXNO9FHYshsXOM2QRJNN8Xv7zm.jpg",
               "id": 101444,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b0c3a368484e03155f",
               "name": "David Siegel",
               "profile_path": "/eZfwXXLE8lChZnd3RUqDD34I4hn.jpg",
               "id": 101446,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53bbde61c3a368661a002128",
               "name": "Scott McGehee",
               "profile_path": "/yEXNO9FHYshsXOM2QRJNN8Xv7zm.jpg",
               "id": 101444,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53bbde74c3a368661e00222a",
               "name": "David Siegel",
               "profile_path": "/eZfwXXLE8lChZnd3RUqDD34I4hn.jpg",
               "id": 101446,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "553acee6c3a36820ec0009fd",
               "name": "Elisabeth Sanxay Holding",
               "profile_path": null,
               "id": 109703,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "553acef89251416874002098",
               "name": "Lauren Zuckerman",
               "profile_path": null,
               "id": 1001368,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "553acf03925141275e003f78",
               "name": "Giles Nuttgens",
               "profile_path": null,
               "id": 3079,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "553acf6b925141651800bf4a",
               "name": "Peter Nashel",
               "profile_path": null,
               "id": 63979,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "553acf7a9251413f5a0048c3",
               "name": "Sabrina Rosen",
               "profile_path": null,
               "id": 1458759,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "553acf8692514135c8000d26",
               "name": "Mindy Marin",
               "profile_path": "/qzqo2SyYdwb3CKeLuUMXBJneWEe.jpg",
               "id": 6044,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "553acfaac3a3683e1400216a",
               "name": "Christopher Tandon",
               "profile_path": null,
               "id": 76016,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "553acfb7925141651800bf4d",
               "name": "Kelly McGehee",
               "profile_path": null,
               "id": 958228,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "553acfc592514135c8000d29",
               "name": "Nancy Wenz",
               "profile_path": null,
               "id": 1458760,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "553acfe99251416788002020",
               "name": "Rebecca Fulton",
               "profile_path": null,
               "id": 1400835,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 4.145525,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24936,
      "vote_count": 46,
      "budget": 3000000,
      "overview": "With her husband Jack perpetually away at work, Margaret Hall raises her children virtually alone. Her teenage son is testing the waters of the adult world, and early one morning she wakes to find the dead body of his gay lover on the beach of their rural lakeside home. What would you do? What is rational and what do you do to protect your child? How far do you go and when do you stop?",
      "similar": [
         8065,
         104,
         44214,
         336843,
         128,
         14564,
         269,
         10223,
         24469,
         10424,
         8688,
         64568,
         337,
         32044,
         31592,
         10856,
         1723,
         28892,
         432641,
         18555
      ],
      "original_title": "The Deep End",
      "runtime": 101,
      "poster_path": "/4Qw1NbxvYjqYQ6HZbCctcWVH7DL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "i5 Films",
         "id": 26927,
         "origin_country": ""
      }],
      "release_date": "2001-01-21",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Scott McGehee",
         "David Siegel"
      ],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Elisabeth Sanxay Holding",
         "Scott McGehee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0250323/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjczMDg4OTMzOV5BMl5BanBnXkFtZTYwNjE4NDg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tilda Swinton, Goran Visnjic, Jonathan Tucker | See full cast and crew »"],
      "reviews": [
         "I saw this film last summer in the theaters and while it didn't do much for me at the time, something in it stayed with me. I rented it again and watched it twice more and am now convinced it is a terrific film. A lot has been said about Swinton's portrayal of a frustrated housewife and she is brilliant, she carries the film with a head-on intensity. But the screenplay should also be lauded. Yes, this is straight out of 1940's noir, but it all works. A lot has been said about the sex and sexuality switch of Swinton's son, but it works perfectly. One might ask . . . why doesn't she ask her son about the body before she dumps it? But that would involve TALKING to her son about his sexuality. She'd rather bury the evidence, than ever admit to herself that her son is gay. Over the course of the film, Swinton begins to understand her son better, she realizes that everyone has their secrets and desires. Her son also realizes the worry he has put his mother through. The last shot, of mother and son huddled together on the bed is of two strong-willed people finally understanding each other as equals. It's a wonderfully telling moment. Be sure to watch this film more than once . . . it can be taken on many levels. james",
         "Taking care of others often involves self-sacrifice, and mothers of most feather will put themselves in harm's way to shield their young. In the THE DEEP END, a modern retelling of Max Ophuls' 1946 thriller THE RECKLESS MOMENT, Margaret Hall is a mother of three willing to do whatever it takes to keep her family safe from the irrational forces that follow her teenage son home one night from a nightclub of ill repute. But mom, played with stoic intensity by Tilda Swinton, quickly learns that heroism doesn't fit on a calendar already packed with soccer practices, trumpet lessons and visits to the grocery store. Superficially the story concerns a vicious run of bad luck. Noirish events are set in motion when Margaret tries to cover up the accidental death of her son's unsavory friend (Josh Lucas as a spookily playful predator). The next day a man with a dice tattoo on his neck knocks on her door and demands $50,000 to suppress a videotape linking her son to the death, which police have ruled a homicide. The dramatic heart of the film concerns Margaret's dealings with the blackmailer, cagily played by Goran Visnjic, ER's Slavic heartthrob in a less soapy but perversely related role. Mr. Visnjic is credible though never quite menacing as a predator in awe of, and ultimately vulnerable to, his tender prey. Taken at this level THE DEEP END, luminously shot in the gambling resort of Lake Tahoe, is an eerie joy ride that leans heavily on coincidence to tangle then unknot its plot. But the presence of Tilda Swinton indicates that more is going on here than melodrama. Ms. Swinton is a brilliant post-feminist actress whose work sheds light on paradoxes of femininity and female power. Her earlier films include ORLANDO, in which she explored androgyny and immortality, and FEMALE PERVERSIONS, a Freudian critique of the feminist myth of \"having it all.\" In THE DEEP END, Ms. Swinton's nuanced performance comments on motherhood as a source of both power and vulnerability. A woman may be willing to do anything for her son, as Margaret Hall clearly is, yet still be constrained by a \"glass ceiling\" of caregiving attachments that prevent her from achieving man-style success. In cinema, the latter typically means blowing the villains' brains out, something Margaret Hall might consider doing if she weren't so busy taking care of her kids and aging father-in-law. Throughout the film Margaret tries but is unable to reach her husband, a Navy officer on an aircraft carrier somewhere in the mid-Atlantic. His unavailability is more than an inconvenience. Attempting to negotiate with the blackmailers, Margaret finds herself hamstrung when the bank refuses a critical withdrawal without her husband's say-so. Mr. Hall's conspicuous absence and his infirm father's burdensome presence amplify Margaret's predicament, showing how hollow the conventions of marriage and machismo can be. The fact that both men are soldiers, society's designated heroes, is no accident. They defend motherhood in the abstract while remaining blind to a real mother's needs. Margaret Hall is Ms. Swinton's most reluctant feminist character to date, a woman whose maternal ferocity the family setting renders moot and who must ultimately rely on the kindness of strangers. Her performance transforms THE DEEP END from a good summer thriller to a dramatic critique of the politics of caregiving.",
         "The myriad effects of the natural instincts of a mother are at the heart of this film, which explores the positive aspects, as well as the inherent flaws of those same instincts. The ways in which an ordinary person will react under extraordinary circumstances often produces results that are most inexplicable; and when it's a mother responding to a situation in which her son is involved, the results may, in fact, be absolutely incomprehensible. And in such cases, decisions made quickly in the shadows of the subjective are often revealed as unconscionable in the cold light of objectivity, a scenario examined by writers/directors Scott McGehee and David Siegel, in their tension laced drama, `The Deep End,' starring Tilda Swinton. Margaret Hall (Swinton) lives with her family in a picturesque lakeside home in Tahoe City, Nevada; but her life is about to become less than that offered by her distinctive surroundings. Her husband is away at sea on an extended tour of duty, and the care and responsibility of raising their three children has fallen to her. And all is not well. Her seventeen-year-old son, Beau (Jonathan Tucker), an aspiring musician who hopes to garner a scholarship to study music at college, has become involved with a man, Darby Reese (Josh Lucas) who owns a bar, The Deep End; and once she is aware of it, it's a situation of no little concern for a mother. For her son's welfare, Margaret knows that this relationship-- whatever the context-- must end, and she goes to Reese, insisting that he leave her son alone. There is some question as to whether or not he agrees, but regardless, late that night he shows up at Margaret's home, where he entices Beau to come outside with him. Things go badly, and by the next morning, Margaret is embroiled in a situation beyond her wildest nightmares. Blinded by fear and concern for Beau, she does something out of character for any rational person, yet within the parameters established by the unconditional love of a mother for her son. It's an act that brings more bad news to her doorstep, in the form of a man named Alek Spera (Goran Visnjic). And it's the beginning of a series of events that will take her into places darker than any she has ever known. McGehee and Siegel adapted their screenplay from the novel `The Blank Wall,' by Elisabeth Sanxay Holding, and it's a taut thriller, to be sure; but it is so singular of purpose that it decidedly becomes more of a character study that focuses on Margaret, and the effects of that natural bond between mother and son that provides the catalyst for her motivation and the impetus of her actions. It's a story that clearly illustrates how even the most discerning individual (and most especially a mother) will abandon reason in the heat of the moment, giving way to the most primitive and basic instincts for survival that are inherently a part of the human condition. And though MeGehee and Siegel maintain the tension of the situation throughout the film, it does wear a bit thin along the way, and at least one pivotal element of the plot is questionable, and strains the credibility of the overall story. The real interest of the film, however, is the study of what the mother/son relationship is really all about, and how affecting it can be, especially under extreme circumstances. What really makes the film work, though, and what maintains interest, is the performance by Tilda Swinton as Margaret. And it's quite a feat, given the fact that the emotional boundaries she is given to explore are somewhat limited, as the conflict begins even as the film begins, and Margaret is driven on and presented in an emotional state that gives her very little latitude in which to operate. To her credit, however, Swinton finds all of the variables one could expect in what is basically a lone emotion, which encompasses concern and apprehension, and she conveys them admirably; it is, in fact, what keeps the film afloat. Her portrayal of Margaret is subtle, concise and introspective, and most importantly, comes across quite naturally; all of which makes her character and her actions-- which on the surface and in the cold light of day may seem questionable-- convincing. As Alek, Goran Visnjic gives a solid performance, though it somewhat lacks the kind of emotional depth that could have made this character more than what it is. Whether it is the way the character was written, or the way it was acted, there is an ambivalence to Alek that makes him less than believable. He looks good on the surface, and Visnjic does have some nice touches, but he doesn't tap into the absolute credibility that he needs. And it makes one aspect of the film seem a little too pat, as if the character is there merely as a means to an end, to help the story along and tidy up the resolution. It's a minor weakness, not worthy of blame; suffice to say that something apparently was missed in the translation of the material from page to screen. In retrospect, Visnjic does a good job with what he is given to work with. In a smaller, but pivotal role, Josh Lucas gives a good performance as Reese, creating a character that is repugnantly smarmy, a guy whose influence over one's son would be any mother's nightmare. Lucas does exceptionally well in this regard, and with comparatively little screen time; he uses his time well, however, as it is the nature of his character more than anything else that gives credence to Margaret's actions. The supporting cast includes Peter Donat (Jack), Raymond J. Barry (Carlie), Tamara Hope (Paige) and Jordan Dorrance (Dylan). As a thriller, this one has merit; but viewed as a character study/drama, `The Deep End' is even more engrossing. It's flawed, but it's still smart, thought provoking entertainment-- the magic of the movies. 7/10.",
         "THE DEEP END is an original and suspenseful thriller, pitting a mother, played by Tilda Swinton, against a blackmailer, played by Goran Visnjic. It's the relationship between the two that drives this movie, as Visnjic's character begins to change because of the decency and honesty he encounters in Swinton's character. I gave this 8 out of 10 instead of 9 out of 10 because the ending is somewhat predictable, it's like something from a 1930's big Hollywood studio film. Nevertheless, a compelling script and convincing performances from all the actors make this worth seeing. 8/10",
         "Once I had finished watching \"The Deep End\" I had to look at the Netflix packaging to find out what year it was made because I couldn't believe that in the year 2001 an entire suspense melodrama could be mounted on the lone homophobic premise, \"Dad Can't Find Out!\" This tale of a Mad-Mom (as in insane) who goes to great lengths to prevent the world from finding out that *gasp* her 17 year-old son is gay (she can't even say the word!) is like a perverse remake of the 1950's Loretta Young feature \"Cause for Alarm!\" in which an average housewife does numerous stupid things trying to conceal a death she had nothing to do with. Here the wonderful Tilda Swinton (a good deal less wonderful here) plays a mom whose protectiveness of her near-adult son borders on the psychotic. Indeed, as the film progressed and she acted wackier and wackier, I was sure that it would come out that she is unwholesomely possessive of her son. Sonny boy (sullen and closed-mouthed) is carrying on with a much older man and mom interferes in a way that even a 13 year old would find mortifying, much less a 17 year old. She operates under the assumption that her gay son has been seduced and lured into contact with this man, but from what we see, he is just a young man who has fallen in with a bad crowd and is drawn to an older guy. A creepy guy albeit, but when we later find out how absent the father is and would not understand his son's gayness no matter what, then subtext kicks in and you start to imagine that Sonny boy is drawn to bad boys and inappropriate partners for a reason. Mom, however is hearing none of this. Even when said son wrecks a car drunk driving with his lover, the mom convinces herself that it is the sole fault of the 30 year-old man, not her son who was actually behind the wheel. Her son seems troubled and she seems like a reactionary nut, but is this what the film focuses on? No. The film has the creepy older gay guy accidentally die on their property and mom spends the entire film covering it up because she thinks in some way her son is involved. Since this family is severely screwed up (to me, that is, the filmmakers seem to think this affluent family of non-communicative, isolated individuals is worth protecting from scary gamblin', screwin' and blackmailin' homosexuals) she never actually asks the son what happened, calls the police, or even wonders how she could think her son capable of murder. The son mourns his ex lover for about ten minutes and never loses much sleep over the possibility that he may have been the last one to see him alive. No, everything is a whirlwind of dance classes, music lessons, baseball games and laundry for this bunch. Who has time to talk? After a series of plot contrivances too ridiculous to recount (among them an empathetic blackmailer who doesn't have the heart for the job...oh yeah, there are lots of those around), an alarming amount of people pay with their lives for the sole purpose of keeping Sonny boy's big, dark secret from daddy and maintaining the privileged class status quo. Oh, brother! Much of the stupidity that preceded it would have been forgivable if at the end there was perhaps an awareness on the mother's part that the distasteful acts she engaged in were not equal to what she thought she was protecting: the problem was not that her son was gay, nor that he rebelliously got mixed up with a guy almost twice his age, the problem was that her son's father would not understand and that she raised her son in an environment where who he was was not as important as what he appeared to be to others. She was less concerned with his lying, underage drinking and hanging out with guys with possible mob ties than she was with his being gay and \"outed.\" What are the biggest moral transgressions here? \"The Deep End\" is so woefully shallow and is content to sacrifice psychological depth for artificially earned suspense. I can't remember when I've been so put off by the unintended offensiveness of a film's premise. Loathed it.",
         "SPOILERS Spoilers sure, but what's to spoil? The critics, no doubt parched for anything resembling a movie of substance these days, have collectively gone off the deep end, hook line and sinker, for this piece of unmitigated garbage. This is surely among the worst \"serious\" movies ever made, marred at every turn by inexplicable emotional reactions, ludicrous plot turns, bad acting, and bafflingly amateurish ineptitude. The plot can be summarized as follows, tongue only slightly in cheek: Kid has preposterous sexual relationship with a disgusting slimy smarmy creep, creep gets in fist fight with kid, during fight creep manages to hurl himself lung first upon an anchor in Lake Tahoe without kid knowing it, super soccer Mom discovers body the next day and calmly totes it in her little power boat out into the middle of Lake Tahoe in order to bury it in 2 feet deep water (soccer Mom has a screw loose), Mom comes back an hour later to do a striptease and dive to get keys out of corpse's pocket, handsome stranger comes to blackmail Mom, Mom irons sheets drops kids off at tennis and runs around trying to raise $50,000 to pay blackmail, Mom never has more than a 2 second conversation with son, son is an uncommunicative jerk who seemingly has no relationship at all with Mom, Mom hocks jewelry, irritating sit-com father-in-law has a heart attack, handsome stranger performs CPR, handsome stranger looks at family picture while Mom is at hospital and falls in love with her, Mom joins traveling Mariachi band and travels naked throughout Portugal to raise cash, handsome stranger gets in fight with partner in crime and kills him, then dies in car crash in his get-away car, Mom frantically discovers this and smears her love all over his bloody forehead, kid watches the whole thing bemused, and they all live happily ever after. Sounds like a classic, eh? This compelling and organic plot line had a significant portion of the audience in giggling fits throughout. Some of the dialog is so lame, you can't wait for more of the characters to find some absurd way to off themselves, perhaps wishing you could do the same to whoever talked you into seeing this disgusting and degrading trash.",
         "\"The Deep End\" is a psychological thriller about a kid, Beau, who apparently killed his boyfriend (Reese) and about his caring mother Margaret covering up the deed. Margaret, who lives with his son and her other kids in a house on Tahoe lake, wanted Reese to stay away from his son. After Margaret heard the boys fight earlier on, she finds the dead body and without ever talking to Beau about it, she disposes the body in broad daylight using her boat's anchor to weigh the body down in the water. She wants to protect her son. Many reviewers complained about the fact that she should have at least spoke to Beau about it but I find this not unrealistic and like this use of unconditional love. The movie takes a promising start. Back to the plot: A few days later a guy (Alek) shows up at their house and blackmails Margaret. He wants her to pay $50.000 and threatens to hand a videotape to the police who have found Reese's body in the meantime. The tape shows Beau and Reese having sex. Maragret tries to somehow get the $50.000. Now comes the part of the movie that I found really annoying and stupid. She cannot tell her children anything about the blackmail so she has to keep doing her maternal duties while she desperately tries to get the money. Margaret explains to Alex why she does not have the money yet and their dialog is really laughable: Margaret Hall: We don't have the money. Alek 'Al' Spera: You have to get the money. Is that not clear enough? MH: It's $50,000. It is not the kind of thing that everyone can just go out and get. Alek: Have you spoken with your husband? M: He can't be reached. He's on a carrier somewhere in the nor - This is truly none of your business. Alek: What about the old man? Well, you have to try harder. M: \"Try harder?\" Alek: I don't think you're really trying. M: Really? Alek: Yes. Margaret Hall: Well, maybe you should explain \"really trying\" to me, Mr. Spera. Tell me - how would you be \"really trying\" if you were me? But you're not me, are you? You don't have my petty concerns to clutter your life and keep you from trying. You don't have three kids to feed, or worry about the future of a 17-year-old boy who nearly got himself killed driving back from some kind of a nightclub with his 30-year-old friend sitting drunk in the seat beside him. No, these are not your concerns. I see that. But perhaps you're right, Mr. Spera. Perhaps I could be trying a little harder. Maybe sometime tomorrow between dropping Dylan at baseball practice and picking up my father-in-law from the hospital, I might find a way to try a little harder. Maybe I should take a page from your book: go to the track, find a card game. Maybe I should blackmail someone. Or maybe you have another idea. I mean, maybe you have a better idea of how I might try a little harder to find this $50,000 you've come here to steal from me. Alek: You're right. I'm not you. I don't - This is only a business opportunity. That's all. Just the typical conversation between blackmailer and the person whom he blackmails. Happens all the time. But Alek turns out to actually be a really nice guy and the two fall in love. Alek does not want his part of the money anymore and tries to convince his boss to give Margaret more time to get the boss' $25.000. This turn is laughably ridiculous. Him falling for her is really unrealistic. There really is not a lot of tension and the police is underused. They never show up at her house again after they briefly asked if she knew anything about an anchor. She says their boat has no anchor; the cops leave. In the end, Alek sacrifices himself by driving off a cliff as he is driving with his boss. Magaret who was following the two takes the videotape out of the wrecked car and as she is reaching for it her lips touch Alek's lips. Alek and his boss die. It turns out that Beau did not know anything about Reese's death which turned out to have been an accident. Beau and Reese had an argument outside Beau's house. Beau told Reese to leave and went back inside before drunken Reese fell into an anchor and died. Seems like a missed opportunity as the story really has some potential. ** 5.0/10 **",
         "Contains Spoilers!!! The short version: Poorly written, poorly performed. I would like to say this movie is horrible. But it's not the kind of horrible where you get up thinking \"well, they tried really hard to write a good script, just too ambitious.\" It's the kind of horrible where you think \"man, they really weren't trying.\" Tilda Swinton is poorly cast and not convincing at all as the mother. The film seems to need to overstate things to the audience, such as when Swinton disposes of the body in broad daylight, the screenplay felt the need to show a helicopter-shot panoramic view of the area, to quell the \"yeah, right, like she could do that in broad daylight\" feelings you're having. The film also insults your intelligence in other ways, such as dressing Swinton in black and handing her a cigarette in the scene where you find out her sinister intentions. The story is decent, but it seems like the cinematic devices used in the screenplay are straight out of the 1930's. The characters in the film behave in excessively stupid ways. For example, why did she wait until the morning to dispose of the body? Why did she not question her son about the incident before disturbing the crime scene? Police are a non-factor, in fact no authority speaks to a member of the cast until 3/4 of the way through, when the sheriff's officer asks Swinton about the anchor. She says their boat doesn't have an anchor, and he simply accepts it and the police never enter the plot again; apparently not having looked around the houses at the lake at all to discover the broken board, as well as the blood the body would have certainly left in the boat. Earlier in the film, after Swinton drives the dead man's Corvette to another location, (how did the keyless entry still work after the car keys had been submerged for some length of time?), she wipes the steering wheel 'clean' of her prints - neglecting other obvious places like the door handle, the shifter, the radio buttons which she adjusts, and other things she would have certainly touched on the interior of the vehicle. These are just a few examples; there aren't really any gaping holes in the plot, just a small number of examples where the characters behaved in excessively careless or irrational ways, but frequently enough to interrupt your acceptance of the rest of the plot. The story itself is not awful, the acting is serviceable but not at all above average, but the script sank this one from the beginning.",
         "THE DEEP END / (2001) *** (out of four) By Blake French: Lake Tahoe, the tenth deepest lake in the world, is a long, cold body of clear, turquoise water thriving at 6,000 feet in the Sierra Nevada Mountain Range. Isolated by snow-covered mountain tops, ponderosa pines, and upper class wood homes, this is the perfect backdrop for The Deep End. The Deep End captures some of this harrowing atmosphere, but I wanted even more. The photography, by Giles Nuttgens, won the coveted Best Cinematography Award at the Sundance Film Festival this year for its unflinching look at images of Lake Tahoe awash in moral tensions. The camera cuts through aquariums, dripping water faucets, bursting water bottles, and of course, across and beneath the lake's surface. On a photographic level, this is one great movie. Writers/directors Scott McGehee and David Siegel found their inspiration for The Deep End from the little known 1940's novel The Blank Wall by Elisabeth Sanxay Holding. The Ladies Home Journal first published an abridged version of the story. It became so popular that the writer eventually made it into a novel. According to the film's press notes, even Alfred Hitchcook was impressed as evident when he chose the book for his classic anthology My Favorites in Suspense-1959. Holding's novel was the only full length feature book of fiction included on that list. McGehee and Siegel previously worked on the independent film Suture. \"In their day, stories like these were very subversive because they asked questions about the nature of families, about the limits of communication, and the loneliness of personal sacrifice,\" says Siegel of Holding's story. \"We wanted to bring those same elements in a contemporary setting with characters that would be sympathetic and believable to people today.\" Holding certainly did have an innate understanding that true suspense emerges not just from violence and mystery, but also from the fabric of everyday life. The Deep End examines a housewife named Margaret (Tilda Swinton) who protects her gay teenage son (Jonathan Tucker) by covering up the death of his lover (Josh Lucas). Did her son kill this person? Someone might know the truth behind this act of violence, but silence has a very high price tag. A very involving introduction and first act suffer after the diabolical murder plot takes a downhill spiral into a different set of events. Alek Spera (Gordan Visnijc), who needs money for his boss (Raymond J. Berry), creates a blackmail scheme. The film goes downhill from here, but the overall product is far from boring. That's largely because of the beautiful performances. Tilda Swinton, seen opposite Leonardo DiCaprio in 1999's The Beach, leads the cast with a powerhouse performance. Swinton paints a vivid, intriguing portrait of domestic serenity, peaceful ordinariness, and motherhood's merciful nature. She can move the audience with utter silence; her eyes exclude intelligence, instinct, and compassion. She completes what the movie leaves unfinished, including her character's adherence to routine and complete loss of moral compass. Gordon Visnjic (Dr. Luka Kovac on \"ER.\") with his dark, brooding physique, creates a shadowy nature for his character. His motives remain a mystery; we never know why he does what he does. It lets the audience guess-but we do not have much to guess with. The film does not complete his character. He's one of the most interesting characters here, but Visnjic needs more to chew on. The filmmakers comment about the hidden romantic feelings between Margaret and Alek. \"It's the kind of romance I miss in movies. It's not explicit and it is not necessarily even realized, but it is there in a haunting, melancholic way,\" says Visnjic. Where? We never really grasp these potentially fascinating plot points because the movie never examines these emotions. This is the kind of material that would have taken The Deep End to another level of interest.",
         "It appears that either this movie works for you or doesn't. It worked for me for several reasons, not the least being the great performance by Tilda Swinton as Margaret, an upper-middle-class mother with an obsessive desire to protect her son. Swinton projects the image of a woman who can handle any situation; blackmail, the revelation of her son's sexual orientation, the notion that her son may be a murderer, taking care of her aging father-in-law, and running the family are all in a day's work. I was drawn into the story by the beautiful photography, the captivating music, and the plot twists. For whatever reason I did not dwell on plot holes but simply allowed myself to be absorbed. And, if you accept Margaret's almost pathologically obsessive devotion to her family, then most of what happens hangs together. I found the unexpected relationship that develops between Margaret and the blackmailer to be interesting. The experience is more transformative for him than for her. I also like the way the tables were turned on the relationship between Margaret and her spoiled son. In the beginning his behavior was confusing to Margaret and he was not willing to talk about it and in the end Margaret's behavior was mysterious to her son and she was not willing to talk about it. It was only the contrived ending that bothered me."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["i5 Films"],
      "summaries": [
         "With her husband perpetually away at work, a mother raises her children virtually alone. Her teenage son is testing the waters of the adult world, and early one morning she wakes to find the dead body of his gay lover on the beach of their rural lakeside home. What would you do? What is rational and what do you do to protect your child? How far do you go and when do you stop?",
         "A woman spirals out of control while trying to keep her son from being found culpable in a murder investigation."
      ],
      "budget": 3000000
   },
   "movielensId": 4723,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-01-21",
      "dvdReleaseDate": "2002-04-16",
      "directors": [
         "Scott McGehee",
         "David Siegel"
      ],
      "runtime": 101,
      "movieId": 4723,
      "title": "The Deep End",
      "mpaa": "R",
      "actors": [
         "Tilda Swinton",
         "Goran Visnjic",
         "Jonathan Tucker",
         "Josh Lucas",
         "Peter Donat",
         "Raymond J. Barry",
         "Tamara Hope",
         "Jordon Dorrance",
         "Heather Mathieson",
         "Holmes Osborne",
         "Richard Gross",
         "Kip Martin"
      ],
      "imdbMovieId": "0250323",
      "originalTitle": "The Deep End",
      "genres": [
         "Drama",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["1BgxNWvx36c"],
      "plotSummary": "With her husband Jack perpetually away at work, Margaret Hall raises her children virtually alone. Her teenage son is testing the waters of the adult world, and early one morning she wakes to find the dead body of his gay lover on the beach of their rural lakeside home. What would you do? What is rational and what do you do to protect your child? How far do you go and when do you stop?",
      "tmdbMovieId": 24936,
      "avgRating": 3.49883,
      "releaseYear": "2001",
      "numRatings": 856,
      "posterPath": "/4Qw1NbxvYjqYQ6HZbCctcWVH7DL.jpg"
   }
}