{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0233699",
      "video": false,
      "title": "Lisa Picard Is Famous",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d1cc3a368484e1d7aeb",
               "name": "Laura Kirk",
               "profile_path": "/s8isCe7huZp1PR5SuSy5e4y8yGb.jpg",
               "id": 21881,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4d1cc3a368484e1d7aef",
               "name": "Nat DeWolf",
               "profile_path": null,
               "id": 1188912,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4d1cc3a368484e1d7af3",
               "name": "Griffin Dunne",
               "profile_path": "/4oCLupH3Uo2otzF77LrYE4s1iqw.jpg",
               "id": 2171,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d1cc3a368484e1d7af7",
               "name": "Daniel London",
               "profile_path": "/yX7Nga9EYG1ejlRFRV5wbZBM60W.jpg",
               "id": 95604,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sandra Bullock",
               "gender": 1,
               "credit_id": "52fe4d1cc3a368484e1d7afb",
               "name": "Sandra Bullock",
               "profile_path": "/1Im0NV6nVaKyXMpYjGOfWaj5khS.jpg",
               "id": 18277,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d1cc3a368484e1d7aff",
               "name": "Carrie Fisher",
               "profile_path": "/oVYiGe4GzgQkoJfdHg8qKqEoWJz.jpg",
               "id": 4,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d1cc3a368484e1d7b03",
               "name": "Melissa Gilbert",
               "profile_path": "/kOvrMgGhdsw7VaWGx8oqoaZi3Qk.jpg",
               "id": 142858,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Spike Lee",
               "gender": 2,
               "credit_id": "59085bc6925141644a00b64f",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Charlie Sheen",
               "gender": 2,
               "credit_id": "59085bd5925141645500afee",
               "name": "Charlie Sheen",
               "profile_path": "/g4e1QpcNTpmq2uPr5GDNuMvjRuU.jpg",
               "id": 6952,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mira",
               "gender": 1,
               "credit_id": "59085beb925141644a00b673",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Penelope Ann Miller",
               "gender": 1,
               "credit_id": "59085bfac3a36858a700b88c",
               "name": "Penelope Ann Miller",
               "profile_path": "/6wjG6NUBKc6Ca4KX6G6V4t6sU2.jpg",
               "id": 14698,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Punk #2",
               "gender": 2,
               "credit_id": "59085c20925141643300b3ed",
               "name": "Robert Rodriguez",
               "profile_path": "/bPqRdLWWwpOT8sBdj9PWOzNgwou.jpg",
               "id": 2294,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4d1cc3a368484e1d7ae7",
            "name": "Griffin Dunne",
            "profile_path": "/4oCLupH3Uo2otzF77LrYE4s1iqw.jpg",
            "id": 2171,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 1.484657,
      "production_countries": [],
      "id": 206412,
      "vote_count": 1,
      "budget": 0,
      "overview": "A documentarian decides to follow the career of New York actress Lisa Picard, believing she is on the brink of fame. Instead, he bears witness to Lisa's continued, humorous, struggles as an actress, as well as the conflict that arises when Lisa's best friend Tate hits it big with an off-Broadway one-man show.",
      "similar": [],
      "original_title": "Lisa Picard Is Famous",
      "runtime": 90,
      "poster_path": "/2Zf9NVZIFUdBwgJz2Z8AEUXU3tF.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-05-14",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Griffin Dunne"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Nat DeWolf",
         "Laura Kirk"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0233699/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTcwNTI1OTU4N15BMl5BanBnXkFtZTcwNDUxNjQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Laura Kirk, Nat DeWolf, Griffin Dunne | See full cast and crew »"],
      "reviews": [
         "Historically, Hollywood has done a lousy job of capturing what really goes on behind the scenes in its own industry. The \"dream factory\" that thrives on creating glossy visions of idealized lives has never been very good at examining its own underbelly. The sole exception to this rule is Robert Altman's \"The Player,\" a film that satirically nails Hollywood's shallow desperation with pitch-perfect accuracy. \"The Player\" finally has its bookend companion piece in \"Lisa Picard is Famous,\" a \"mockumentary\" about an aspiring actress. It comes as no surprise that this very funny and painfully true-to-life film was created by actors. Produced by actress Mira Sorvino (\"Mighty Aphrodite\") and directed by actor/director Griffin Dunne (\"After Hours\"), the movie was written by and stars unknown actors Lisa Kirk and Nat DeWolf. Kirk plays Lisa Picard, a fiercely determined New York actress who, after a series of minor parts and commercials, is poised for her major breakthrough \"in a small but pivotal role\" in a tv movie starring Melissa Gilbert. DeWolf plays Lisa's gay friend and fellow actor Tate Kelly whose major credit is an ill-fated gig as an extra on \"Days of Our Lives.\" He's set to debut in his autobiographical Off Off Off Broadway one man show that \"deals with issues of gay bashing and homophobia\" (although he's had no first hand experience with either). The gloriously deadpan film is told through the eyes and lens of a documentary film maker (played by Dunne) who's trying to capture the esssence of fame by following Lisa. Tossing her beret into the air a la Mary Richards, she appears to be on the brink of stardom. Although it borrows the mockumentary style of \"This is Spinal Tap\" and \"Waiting for Guffman,\" the film ultimately goes beyond mere satire. By scrutinizing the lives of these desperately hungry actors (in squirmingly painful detail), it sheds much more meaningful light on the subject of fame than Woody Allen's \"Celebrity,\" which focused on the lives of the shallow and famous. While Hollywood typically depicts actresses as vain divas (see Catherine Zeta Jones in \"America's Sweethearts\"), Kirk's performance beautifully captures more fundamental elements of an actor's pathology including a self-absorption that runs so deep that she doesn't even know it's there. She experiences a callback audition for an Advil commercial as a desperate matter of life and death. In analyzing her character's motivation in the Japanese horror flick \"A Nymphoid Barbarian in Dinosaur Hell,\" she's careful not to give away the film's ending, \"in case it's ever released.\" The underlying joke of \"Lisa Picard is Famous\" is that by chronicling the unknown actress' every move, the documentary itself elevates her to a kind of unwarranted fame, while plaguing her daily life with fame's intrusiveness. Contributing additional irony, humor and depth are sly interviews with the likes of Carrie Fisher and Buck Henry. A handful of cameo performances aid in the illusion of documentary reality, including Sandra Bullock, Charlie Sheen, Penelope Ann Miller and Spike Lee. While some of the gags push the limits of deadpan reality (like Lisa's erotic Wheat Chex commercial), most of the film's humor is dead on. Tate's hilariously banal gay monologue is sure to strike a chord with those who've seen one too many self-revelatory one man shows.",
         "Lisa Picard Is Famous is a clever mockumentary directed by Griffin Dunne that follows an aspiring actress while she strives for stardom. The humor is extremely subtle and dry, and I found myself actually laughing out loud a whole lot more than I would during your average Hollywood-industrialized comedy. It is well acted, well executed and definitely worth watching just to catch some of the many absolutely hilarious celebrity cameos. (Most notably Spike Lee, who looks like he is about to crack up at any second). Before this viewing, I only had a passing knowledge of Griffin Dunne's work and after this biting film I plan to keep an eye out for his future productions. --Shelly",
         "I saw this in Lawrence, KS, where one of the co-writers & principal characters (Laura Kirk/\"Lisa Picard\") had gone to college. The reviews of it in the Topeka paper made it look interesting; the paper said it was a very small budget production and there were only six copies of the film so I wanted to see it before it moved on to other theaters. I'm glad we saw it. It's an interesting film, built on the premise that a director is making a documentary of an aspiring actor (Laura Kirk/Lisa Picard) who is just passing the cusp on her way to fame and stardom. Some of the film's questions are, \"what does fame/success do to a person -- does it change their walk, talk, the way they behave?\" And so this documentary will answer those questions. This form is called a \"mockumentary\" -- somewhat in the vein of \"Waiting for Guffman\" and others. \"Slice of life\" would also be as appropriate and more accurate for this film in my view. \"Waiting for Guffman\" was a parody of the community theater scene in which the characters were all as broadly drawn and about as deep as most cartoon figures. While there was a slight tinge of that in \"Famous,\" the characters are more complex, more layered, more fully formed as people. The actors are excellent in their roles, both major and minor parts. All the roles are psychologically believable and quite realistic. The film is kind, funny, yet still letting us see a layer or two below and beyond surface appearances. On the way to its conclusion, we get several surprises. As a view of the lives of aspiring actors trying to break in, it was great. It would have been an even more touching movie if it had allowed us to empathize or identify just a little more with its lead character. But what talent, in both writing and acting!! We'll see more from these people and they'll be even better.",
         "I watched this movie 2 days ago and while watching it, I thought it was pretty good. It is a very funny look at fame and being on the cusp of fame and about a very particular type of person who becomes an actor. It is a \"mockumentary\", which is a genre that can be a bit dicey. In the hands of Christopher Guest (Spinal Tap, Waiting For Guffman and Best In Show), it can be taken to the level of brilliance, but then again, there is always \"Drop Dead Gorgeous\". Anyway, as time goes by, I can't get the movie out of my head. The actress (and writer), Laura Kirk, playing Lisa Picard just nails this character and makes her pathetic, oddly lovable and annoying all at once. I know people like her, just so completely obliviously self obsessed that they don't even realize it. And her relationship with her best friend, a gay man who is performing a HORRIBLE one man show about gay bashing and homophobia (that he has not experienced, but can relate to), is just perfect; full of support, jealousy and competition. I keep thinking of certain scenes (which I won't reveal here), that make me want to watch again. It is definately not a perfect movie, but it was such a pleasant surprise, that I want to keep telling people about it!",
         "This film is brilliant and it accurately portrays the lives of many struggling NYC actors, from the fact that talented actors are passed up for models for jobs, how do you try to stay in your craft, how no one really cares about their \"survival job\" and how many actors don't have an off switch. This film was brilliant, funny, heartwarming and a real gem.",
         "Please, stop comparing it to Guffman and Spinal Tap! Guffman is seemingly similar because it deals with a faux documentary on actors. But, my friends, there's little real truth in the Guffman characters, did anyone REALLY think they were real? Great movie, but no one was fooled by it and they weren't supposed to be. Lisa Picard is Famous, however, really builds on what could very well be real people. And while things get pretty crazy in the end, by then you're really enjoying the ride too much to mind. While you certainly don't have to be an actor to appreciate it, if you are you've seen people just like Lisa and Tate. You've seen the agencies and casting directors' offices. You've lived through the childrens' shows and \"one man\" shows. There are scenes in this movie that my wife and myself busted out hard laughing. The extra scene with Tate was one of them. Lisa's breakdown of \"models\" was one of them. I won't give anything away by revealing more. But, in the end, you do genuinely care for these people. You empathize with the very real situation of Lisa being on the cusp of fame and possibly having it snatched away (which is full of truth, too). You empathize with Tate's \"artistic vision\" eventually turned into someone else's vision, Hollywood style. You cringe and hide at Lisa's boyfriend's horrible timing. And, in the end, you want these \"monkeys\" to be friends and be happy. Look, this is BETTER than Guffman. Guffman mostly makes fun of it's characters. It wants you to laugh at them. They're so extreme in their small-town, wide-eyed ways that they just can't be real. Lisa Picard is Famous has people, believe me, that are right now walking the streets of New York, Chicago and L.A.. The performances are wonderful and you KNOW that these stories are ones that the creators witnessed first-hand as they embarked on their own journey to be famous. After this creation, the deserve to be.",
         "\"Lisa Picard Is Famous\" is a mock-umentary about, the struggle and the sacrifices one makes to get to fame. This of coarse is taken with all comic-fun otherwise it would be a worthless film. Laura Kirk is perfectly fit as Lisa Picard, and Sandra Bullock shows up in an awkward slightly wasted scene thats nevertheless a nice touch. The film is taken with such stupid slapstick that it is hard not to laugh even if it is mostly predictable. One of the main focuses is the friendship between Lisa and Tate and how it is nearly terminated, done comically well, hits a little too close to home than one would expect from this kind of film. LPIF is not really breaking any new ground, its just fun, not to mention it has a cool movie title.. try saying it a few times to people.. it makes you seem like you really \"know\" movies with quoting such a little known farce! **Attention All Aspiring Actors**... if this film teaches you one thing... its that most of you really should re-evaluate yourself, give it up to save heartache, or (to put it boldly) admit to yourself that you really don't have what it takes... After all it is truly a shot in the dark, even if there is a little \"Lisa Picard\" in all of us.",
         "What struck me about this film was how truly believable the \"documentary' within the film is. BUT Seeing as how the film fell flat towards the end, losing its sense of direction, i would have preferred to watch a \"real\" documentary on the subject.",
         "Lisa Picard Is Famous is a film that never achieves greatness, but comes close to deconstructing that nebulous and intriguing world of fame. Numerous movies have been made on this subject, but Lisa Picard Is Famous is the first that follows an actress on the verge of stardom, and where the \"impartial\" documentarian (Griffin Dunne) makes sure she gets there. This breakdown of observer and subject is the central theme in this movie, reflecting the generalized tendency of the average person's inability to resist the temptations of fame and stardom. Watching this movie and the antics of Dunne and Picard, I wondered who wanted to be more famous, the director who wants respectability, or the actress who just wants work and money. This dynamic of observer and subject works well to inject laughs and insight to the phenomenon of fame, including some memorable encounters with the likes of Mira Sorvino, Sandra Bullock, and Spike Lee (Buck Henry appears to make wry observances, including this gem: the root word \"fame\" is derived from \"famine\"). One example is the hilarious scene where Picard, in all seriousness, compares her appearance with famous celebrities, and the director complements the absurdist moment by adding their faces on the screen, inviting the audience to made the ridiculous comparisons. Without giving away the ending, it was of great interest to see that no matter how much energy was expended on Picard's career by Dunne, chance plays an unexpectent and important role to derail Dunne's self-serving needs; proving that fame may be more of a random act, than a self-charted destiny.",
         "I wasn't looking forward to seeing Griffin Dunne's film from the start, especially knowing that it was a \"mockumentary\" about fame. As well, I was quite skeptical about the use of the DV format to give the film a realistic look. However, I was pleasantly surprised...at least for the first half of the film. Famous is one of those movies that doesn't know how to end. It's very funny - the \"Wheat Chex\" gag is hilarious! And I have to give credit to anyone who humorously uses a Charlie Sheen cameo (Spike Jonze included). Unfortunately, the film runs out of steam and the comedic possibilities are wasted. The cast is solid, and the film's subversive feel must be praised. For Dunne, this could be the direction he could be looking for in terms of further projects. Alas, with this project, he is treading the familiar ground of \"Spinal Tap\" and \"Waiting for Guffman,\" two highly superior projects that set the standard for all mockumentaries on the same subject."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "GreeneStreet Films",
         "Longfellow Pictures",
         "Sidney Kimmel Entertainment"
      ],
      "summaries": ["A documentarian decides to follow the career of New York actress Lisa Picard, believing she is on the brink of fame. Instead, he bears witness to Lisa's continued, humorous, struggles as an actress, as well as the conflict that arises when Lisa's best friend Tate hits it big with an off-Broadway one-man show."],
      "budget": 0
   },
   "movielensId": 4739,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-05-14",
      "dvdReleaseDate": "2002-01-22",
      "directors": ["Griffin Dunne"],
      "runtime": 90,
      "movieId": 4739,
      "title": "Lisa Picard Is Famous",
      "mpaa": null,
      "actors": [
         "Laura Kirk",
         "Nat DeWolf",
         "Griffin Dunne",
         "Daniel London",
         "Sandra Bullock",
         "Carrie Fisher",
         "Melissa Gilbert",
         "Spike Lee",
         "Charlie Sheen",
         "Mira Sorvino",
         "Penelope Ann Miller",
         "Robert Rodriguez"
      ],
      "imdbMovieId": "0233699",
      "originalTitle": "Lisa Picard Is Famous",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A documentarian decides to follow the career of New York actress Lisa Picard, believing she is on the brink of fame. Instead, he bears witness to Lisa's continued, humorous, struggles as an actress, as well as the conflict that arises when Lisa's best friend Tate hits it big with an off-Broadway one-man show.",
      "tmdbMovieId": 206412,
      "avgRating": 2.76829,
      "releaseYear": "2000",
      "numRatings": 41,
      "posterPath": "/2Zf9NVZIFUdBwgJz2Z8AEUXU3tF.jpg"
   }
}