{
   "tmdb": {
      "original_language": "th",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "volleyball",
            "id": 5605
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "transgender",
            "id": 17975
         }
      ],
      "imdb_id": "tt0263957",
      "video": false,
      "title": "The Iron Ladies",
      "recommendations": [
         222071,
         61385,
         24403
      ],
      "backdrop_path": "/waGS6IHQIQr7x8ellKN7NSaoBlO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Chai",
               "gender": 2,
               "credit_id": "56ed4473c3a3682253006e88",
               "name": "Jesdaporn Pholdee",
               "profile_path": "/b2OUR0k5BC2KCnxMMeQELdWAqth.jpg",
               "id": 113949,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Mon",
               "gender": 0,
               "credit_id": "5781d2f6c3a3685922005d2b",
               "name": "Sahaphap Tor",
               "profile_path": null,
               "id": 1647815,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Wit",
               "gender": 0,
               "credit_id": "5781d300c3a3685922005d35",
               "name": "Ekachai Buranapanit",
               "profile_path": null,
               "id": 1647816,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Nong",
               "gender": 0,
               "credit_id": "5781d30ac3a3685922005d3f",
               "name": "Giorgio Maiocchi",
               "profile_path": "/nuuMFNyn9MAp5ZVhB9x8yVXjkc8.jpg",
               "id": 1365833,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Jung",
               "gender": 0,
               "credit_id": "5781d3149251417c4c00078c",
               "name": "Chaichan Nimpulsawasdi",
               "profile_path": null,
               "id": 1278042,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Pia",
               "gender": 0,
               "credit_id": "5781d31dc3a36873ea00350a",
               "name": "Kokkorn Benjathikoon",
               "profile_path": null,
               "id": 1647817,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Coach",
               "gender": 0,
               "credit_id": "5781d328c3a3681f50000865",
               "name": "Shiriohana Hongsopon",
               "profile_path": null,
               "id": 1647818,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "April",
               "gender": 0,
               "credit_id": "5781d332c3a36875ce00340e",
               "name": "Phomsit Sitthijamroenkhun",
               "profile_path": null,
               "id": 1647819,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "May",
               "gender": 0,
               "credit_id": "5781d340c3a3681fc300076d",
               "name": "Sutthipong Sitthijamroenkhun",
               "profile_path": null,
               "id": 1647820,
               "order": 9
            },
            {
               "cast_id": 9,
               "character": "June",
               "gender": 0,
               "credit_id": "5781d349c3a36875ce003419",
               "name": "Anucha Chatkaew",
               "profile_path": null,
               "id": 1647821,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5781d35bc3a3681f4d00092c",
               "name": "Yongyoot Thongkongtoon",
               "profile_path": null,
               "id": 1091281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5781d3669251417c4c0007c7",
               "name": "Yongyoot Thongkongtoon",
               "profile_path": null,
               "id": 1091281,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5781d36e9251417c4c0007cc",
               "name": "Visuttchai Boonyakarnjawa",
               "profile_path": null,
               "id": 1647822,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5781d377925141196e005473",
               "name": "Jira Maligool",
               "profile_path": null,
               "id": 1180432,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5781d3869251417cc60007f4",
               "name": "Jira Maligool",
               "profile_path": null,
               "id": 1180432,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5781d395c3a3681f4d00094e",
               "name": "Sunij Asavinikul",
               "profile_path": null,
               "id": 545212,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5781d3a0c3a36875ce00343d",
               "name": "Ekasith Meeprasertsakul",
               "profile_path": null,
               "id": 1096192,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.299937,
      "production_countries": [{
         "iso_3166_1": "TH",
         "name": "Thailand"
      }],
      "id": 106230,
      "vote_count": 6,
      "budget": 0,
      "overview": "The two main characters, Mon and Jung, play two gay transvestites, who had been constantly overlooked by volleyball coaches because of their appearance. However, when a local team changes coaches, the new coach holds tryouts for a new team. When Mon and Jung are selected, most of the old players resign, leaving the new coach, Coach Bee, in a sticky predicament.",
      "similar": [
         449176,
         184352,
         26280,
         338189,
         413666,
         380874,
         47643,
         10938,
         26933,
         383526,
         258034,
         26371,
         376867,
         425193,
         428493,
         383559,
         52799,
         382475,
         340684,
         11000
      ],
      "original_title": "Satree lek",
      "runtime": 104,
      "poster_path": "/nLxxZt5zlVcSoyjjRA5SxpWDZsb.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "ภาษาไทย",
            "iso_639_1": "th"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Tai Entertainment",
         "id": 9281,
         "origin_country": ""
      }],
      "release_date": "2000-03-04",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Thailand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yongyoot Thongkongtoon"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Visuttchai Boonyakarnjawa",
         "Jira Maligool"
      ],
      "originalLanguage": "Thai",
      "imdbLink": "http://www.imdb.com/title/tt0263957/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NTA1Mjg0N15BMl5BanBnXkFtZTcwNTE0MzMzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jesdaporn Pholdee, Sahaphap Tor, Ekachai Buranapanit | See full cast and crew »"],
      "reviews": [
         "What more can you ask for in a movie than campy characters, memorable performances, a happy ending and non-stop laughter? The Iron Ladies truly delivers on all accounts. The true story of a Thai volleyball team made up mostly of gay men, drag queens and transgendered women (\"katoueys\") that wins the men's national championship, The Iron Ladies is sassy, funny and extraordinary. Cross-dressing Jung (Chaicharn Nimpulsawasdi), make-up loving soldier Nong (Giorgio Maiocchi) and transsexual cabaret star Pia (Kokkorn Benjathikoon) are the standouts in this hilarious cast of characters who unite together to overcome the adversity they face on a daily basis, and take Thailand by storm. Shiriohana Hongsopon gives probably the best performance as Coach Bee, the glue that holds the often hot-tempered and always effervescent team together. As we see the Iron Ladies through to the national finals, all the characters receive a touch of humanity from each other, and rally together to reach the top. This hilarious romp will keep you laughing, and it will definitely be a film you will never forget! For it's fantastic script, three stars...the amazing acting, one more star...and because it's a movie you'll want to see again and again, one more. 5 stars out of 5!",
         "From Thailand, this film (winner of two 2001 Berlin Film Festival \"Teddy Awards)\" is an outrageous high-camp comedy, which despite its eccentricities, is sure to entertain all audiences, and have a strong positive message for everyone. THE IRON LADIES (English title) celebrates the true 1996 triumph of a group of hilarious Thai screaming queens. Through a series of circumstances, the drag queens, join a new (and female) coach and the sole survivor (and only straight player) of a district volleyball squad to form a new team. Representing its district and now competing at the national level, they are clearly face down at odds. In spite of this and their individual \"personal issues,\" they strive for championships and national recognition, creating an Asian phenomenon on the way. The film is very Hollywood-slick, but at the same time, very Asian. It is a unique picture of very unconventional sportsmen battling bigotry on and off the court. IRON LADIES breathes new life into both the screwball comedy and the root-for-the underdog sports movie. Not to be missed.",
         "This film is not only hysterically funny, it's a true story. You will be cheering these kids on at every turn. I've seen it twice and it holds up and never disappoints! Comedy of course is subjective, but I sat in an audience of New Yorkers the first time I watched this and the laughter was amazing.",
         "Not every gay film *has* to be politically correct, the characters don't *have* to be non-stereotypical, and it doesn't *have* to \"send the right message about the gay community,\" and it can *still* be fun, funny, and a treat to watch. Part of the reason that the characters were so outrageously stereotypical is because the real people on which they were based were themselves screaming queens - and, last I checked, there's nothing wrong with that. These were people who celebrated who they were - everyone else's opinions of them be damned. Moreover, their differences were what brought them together to win the championship, defy the odds, and defy perceptions of what they *should* be like. It puzzles me that other readers focus on the \"negativity\" of their behavior, when the story is about acceptance, fighting ignorance, and celebrating the differences in us all.",
         "I'm not a big fan of the oriental comedy movies, but I saw \"Sa tree lex\" and I have to say that this is great film, full of laughs, feelings and a great script. After the movie I realized that it was based on a true history, that made me feel happy. It's worth to see it.",
         "I've heard about this movie for quite sometimes before actually manage to see it. It has been given very good reviews from the Media. In this movie, each character is interesting and been given their own special attention, starting from the important character like Mon & Chai, to the less important roles like April, May & June. It pretty much revolves around a bunch of drag queen playing volleyball , entering competition,sportsman ship, team work, relationship between transsexuals and real men, sexual discrimination. You will enjoy this movie from the start till the end, although sometimes in some scenes, the director didnt really make it clear why on earth that particular scenes is needed for. The actors and actresses made a good job as drag queen and gay people considering the fact that all of them (except one) claimed to be straight and most of them are in 'straight relationship', and also, you'll get to learn and see the wonders or Thailand, and also the way they made a movie about volleyball in thailand, considering that Volleyball is not a popular sports in Thailand, yet, this movie still manage to emerged as the 2nd highest grossing movie ever, in Thailand, behind the movie NangNak. Recommended to everyone, you wont regret it.",
         "You all know the plot .. a team of dis-advantaged misfits takes on the reigning champs and triumph in an emotional demonstration of \"heart\" and teamwork over the talented, but ultimately flawed, defenders. You've seen it a hundred times. You'll see it a hundred more times. And every time you see it you'll wonder why you bothered because, generally, these films suck like a black hole. But not this one. I can't tell you exactly why this one works .. you know how it will end before you even get to your seat .. but it stands head and shoulders above all of the also rans (see what I did there? A sports metaphor) Let's be honest - it's a formula film and it's not going to make you think and it's not going to break down the boundaries of film. But it does deliver humour and some passable performances and it does NOT cram \"teamwork\" down your throat. It's fun. My second favourite sports film after Slap Shot. And I only like two sports films.",
         "This movie is very entertaining. Thai movies are not as familiar as American movies in Japan, but I enjoyed this one. Thai society has a huge number of gay people while it still holds bias about them. This movie has successfully changed the attitude to gay people in Thailand. Now people are less likely to discriminate gay people than before. This is what I have heard from my Thai friends. If you are biased about gay people, you should take time to watch this movie. If you are not, you should watch it. It is still worth watching. This movie not only has some serious comments by gay people but also includes funny scenes. You can laugh and enjoy while you learn about gay culture in Thailand. At last, please do not forget that this movie is based on Amazing truth!",
         "I just watched this film (albeit dubbed in German!) and I just couldn't turn away! It's like a train wreck, but in a good way. I'd like to see it in English, but even in German it was funny with a few poignant moments and a bit of Bollywood thrown in for good measure. The characters were very believable tho I found the premise a bit obtuse, until I saw in the credits that it was based on a true story..that just blew me away. I wasn't aware that the Thais were SO into volleyball. I'm looking forward to seeing part 2 (so if anyone at arte reads this, please show part 2!). I'm going to do some more internet research about the background and recommend this film to all my friends.",
         "So what? Some of the characters are over the top. Some of the actors playing the Iron Ladies might have pushed the stereotype, but quite frankly, I LOVED IT! The movie is entertaining and such a joy to watch, and it's supposed to be stereotypical. If we can't laugh at ourselves and our own not so perfect life, then we'd be rather dull wouldn't we? If I recall my trip to Thailand, where I have encountered trans-gendered, gay, and transsexuals; who live their lives as normally as any of us do, they are very much like how the actors portrayed them in the movie. If this movie misrepresents diversity, then I would beg to differ. Being a gay man myself, and knowing all the obstacles that come with acceptance, the LAST thing I'd want to do is JUDGE something we have no real connection to. I have never put on a dress, have never walked in their shoes. I do play a mean game of volleyball though, and if I were to meet these \"Iron Ladies\" across the net, I would be honored to play with them as I would any other team. GAME ON! For the Iron Ladies! May the best \"man\" win."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["Tai Entertainment"],
      "summaries": [
         "The Iron Ladies tells the true story of a Thai male volleyball team that competes in the national championships in 1996 with a team consisting mostly of gays, transvestites and transsexuals. Mon, who becomes the team leader, was a very talented player who constantly failed to be selected for various teams because he was gay. Jung, Mon's best friend, also experienced the same treatment but was always more optimistic about things. Their chance comes when Coach Bee is selected to put together a winning team, and she announces that the team will be open for all to tryout. But when the coach selects both Jung and Mon to be on the team, some of the more macho players resign in protest. In order to form a team, the coach asks Mon to find a few of his friends to join the team. They select Nong, a gay sergeant in the army; Pia, the transsexual star of a cabaret show; and Wit, whose parents don't know that their only son is gay.",
         "A triumph over adversity. Based on the true story of the 1996 Thailand National Champion Volleyball Team."
      ],
      "budget": 0
   },
   "movielensId": 4763,
   "movielens": {
      "languages": [
         "English",
         "ภาษาไทย"
      ],
      "releaseDate": "2000-03-04",
      "dvdReleaseDate": "2002-11-26",
      "directors": ["Yongyoot Thongkongtoon"],
      "runtime": 104,
      "movieId": 4763,
      "title": "The Iron Ladies",
      "mpaa": "NR",
      "actors": [
         "Jesdaporn Pholdee",
         "Sahaphap Tor",
         "Ekachai Buranapanit",
         "Giorgio Maiocchi",
         "Chaichan Nimpulsawasdi",
         "Kokkorn Benjathikoon",
         "Shiriohana Hongsopon",
         "Phomsit Sitthijamroenkhun",
         "Sutthipong Sitthijamroenkhun",
         "Anucha Chatkaew"
      ],
      "imdbMovieId": "0263957",
      "originalTitle": "Satree lek",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The two main characters, Mon and Jung, play two gay transvestites, who had been constantly overlooked by volleyball coaches because of their appearance. However, when a local team changes coaches, the new coach holds tryouts for a new team. When Mon and Jung are selected, most of the old players resign, leaving the new coach, Coach Bee, in a sticky predicament.",
      "tmdbMovieId": 106230,
      "avgRating": 3.4127,
      "releaseYear": "2000",
      "numRatings": 63,
      "posterPath": "/nLxxZt5zlVcSoyjjRA5SxpWDZsb.jpg"
   }
}