{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "shopping mall",
            "id": 6490
         },
         {
            "name": "zombie",
            "id": 12377
         }
      ],
      "imdb_id": "tt0277605",
      "video": false,
      "title": "Bio Zombie",
      "recommendations": [
         44914,
         181080,
         50108,
         68529,
         32774,
         55313,
         36169,
         83830,
         27539,
         40378,
         30994,
         33840,
         13319,
         52466,
         22573,
         47647,
         38405,
         62338,
         40037,
         62108
      ],
      "backdrop_path": "/s9csCyvsOeObFyZFABwqB4U9nnE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Woody Invincible",
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030eb7",
               "name": "Jordan Chan",
               "profile_path": "/yRyMDpQ1N4gTCUS6h8ed3w9YQuP.jpg",
               "id": 132739,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Loi",
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030ea1",
               "name": "Emotion Cheung",
               "profile_path": null,
               "id": 92824,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Crazy Bee (as Chan Sum Lee)",
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030ebb",
               "name": "Sam Lee",
               "profile_path": "/peBEATyBMxLnbqdg9DLBZVyJXkY.jpg",
               "id": 74193,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Kui (as Yiu Cheung Lai)",
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030ebf",
               "name": "Yiu-Cheung Lai",
               "profile_path": null,
               "id": 123654,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030ea7",
               "name": "Wilson Yip",
               "profile_path": "/6TDvEZYjxBLqZW6ER5fBi8d0ydK.jpg",
               "id": 63571,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030ead",
               "name": "Matt Chow",
               "profile_path": "/qPDiIqUIW1YoGz2eC8EsSR7g7E1.jpg",
               "id": 92829,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030eb3",
               "name": "Siu Man Sing",
               "profile_path": null,
               "id": 92830,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030ec5",
               "name": "Peter Kam",
               "profile_path": null,
               "id": 66053,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44aec3a368484e030ecb",
               "name": "Wilson Yip",
               "profile_path": "/6TDvEZYjxBLqZW6ER5fBi8d0ydK.jpg",
               "id": 63571,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44aec3a368484e030ed1",
               "name": "Joe Ma Wai-Ho",
               "profile_path": "/po61pgkFNTgqfqTvUNYK7m4B6LT.jpg",
               "id": 588140,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.455859,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 24916,
      "vote_count": 20,
      "budget": 0,
      "overview": "A soft drink tainted with bio-chemicals has the power to turn people into flesh-eating zombies.",
      "similar": [
         10925,
         485415,
         400136,
         24920,
         1562,
         72190,
         19908,
         170,
         82654,
         766,
         16288,
         13648,
         8408,
         336843,
         294254,
         24935,
         923,
         16871,
         1576,
         49524
      ],
      "original_title": "生化壽屍",
      "runtime": 94,
      "poster_path": "/oBjYa5N4VyDIkhKIxmKcnokMX2C.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [],
      "release_date": "1998-06-11",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wilson Yip"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Matt Chow",
         "Siu Man Sing"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0277605/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NDU4ODYyNl5BMl5BanBnXkFtZTcwNTc5MDAzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jordan Chan, Emotion Cheung, Sam Lee | See full cast and crew »"],
      "reviews": [
         "Having recently gotten into the asian horror genre, I finally had a chance to watch this movie. Bio Zombie is original in the way it blends comedy, horror, action.....and it works!! I really liked the transition the film. When you meet Woody Invincible and Crazy Bee, they are far from winning any moral awards. This provides so much humor especially their \"tough\" guy personas, so you naturally take a liking to the two. Follow that with crossing paths with a couple of gals including hottie babe Rolls, and you have really funny moments!! The way director Wilson Yip progresses the story, you find out about the characters and then he adds the deadly biochemical plot which takes the film to another level. It's not a horror film having you shut your eyes or watch through the cracks of your fingers, but you find yourself drawn into the story following the plight of our unlikely heroes. VERY good chemistry between the cast. Jordan Lee (Woody) and Sam Lee (Bee) really seem like two buddies who get into all sort of trouble. Their personalities, facial expressions, mannerisms are all assets to their respective characters. Angela Tong Ying-Ying (Rolls) is good as well and flaunts her sex appeal very well! The bathroom scenes with her and Woody are hilarious! Even the Sushi guy plays a vital part! Credit goes to Yip for giving a shopping mall a very unique and creepy look due to great cinematography. As more and more zombies appear, the twist from comedic entertainment shifts to \"struggle to survive\" entertainment. The great thing is this film doesn't take itself too seriously and it looks like they had a lot of fun shooting this film. Trust me, you'll have fun seeing it too.",
         "Should this movie be described as a Hong Kong take on Dawn of the Dead? No. Return of the Living Dead? No, certainly not. Mallrats with zombies? Sounds better. The point of this movie is not to provide stark raving terror, deep social commentary, or five gallons of blood per second. This movie is fun. Follow the lives of a pair of small-time punks running a VCD shop, the likable Crazy Bee and the incredibly named Woody Invincible, as they try to get their boss's car and end up accidentally unleashing a zombie plague. Oops. But even before the first zombie shows up, the duo has gotten into some amusing scrapes and got out of them with bluster that for once is not unlikable. They may be jerks, but at least their the kind of jerks you can see yourself hanging out with. When the zombies show up, the movie stays focused on Woody and Bee. It seems so wrong to say that this movie is character driven, but it is. Not it a dramatic sense, but in the sense that the characters and not the zombies are the main focus of the movie. That surprisingly doesn't hurt the film, as the interactions are definetly between our heroic duo and the zombies are generally amusing. But the movie knows when to get serious. The last ten minutes or so switch from humor to seriousness (save one speech from Bee) suddenly and yet without missing a step. The last ten minutes seem to come from a \"real\" zombie movie and are filled with emotion and pathos. It's kind of startling, but it also fits. All in all, I definetly recommend this movie. It is one of my favorites. Just go in expecting humor. Heck, it's best to go into the movie not knowing anything about it.",
         "~Spoiler~ Biozombie has been on my list of movies to watch for quite some time. As the film began, I didn't think it was going to live up to its reputation. It starts out as a screwball comedy and I got a little worried that it was going to suck (okay, a lot worried). It really takes way too long to get to the zombie action and I didn't find myself amused at the antics of the two heroes. But stick with it. About an hour in the film really picks up and drops some of the comedy. There are moments in this thing that are so sad and depressing they rival some of Romero's work. And that is a huge statement coming from me. I believe the comedy was thrown in to lighten our mood so the director could sucker punch us with the dark finale. It reminded me of Man Bites Dog in this way, only not as deep. But it did affect me and I loved that ending. It was worth it to sit through an hour of goofiness for that awesome and utterly depressing finish. Biozombie is not a film I would buy, but I recommend watching it (maybe as a double feature with Wild Zero).",
         "Although not the standard zombie splat-fest which i had hoped for, I've gotta say I totally enjoyed this quirky little flick. Apparently made on a shoestring, the whacked out, neon dripping, Plaza setting offers an almost halucinatory overtone to the proceedings. The story throws a small group of young HK shopkeepers into a siege by the undead. Kind of plays as a combination of DOTD and Night of the demons, helped by a heavy dose of HK youth culture and comedy, very reminiscent of that in other HK comedy-horrors (Mr Vampire springs to mind.) Despite wanting a bloodbath, I couldn't help but to appreciate it for what it is - entertainment. By no means up there with DOTD, The Beyond or any other of the slew of late 70's early 80's zombie cannibal chunk blowers - but still, more than enough of a breath of fetid air to keep zombie fans ticking over. To summarize - Great 90 mins worth. Not taxing on the mind. Entertaining characters (great subs!). But if you want gore - it's back to an umpteenth viewing of \"The Beyond\"... Well worth seeking out if you're looking for something different. Well, I liked it anyway...",
         "Bio Zombie (aka.\"Sang dut sau shut\") is one sucessful and pretty zany HK black comedy/horror film. The plot has to do with Crazy Bee and Woody having to own a VCD/DVD store, owned by the greedy Kui and his wife. Their hobbies in the mall (which seems to strangely be their home...) are chasing girls, going to arcades, cause trouble and eat. In the meantime, the government comes up with a sports biological weapon in disguise as a sports drink. The drinks turns people whom drink it into the living dead and the fun starts to begin. There are also alot of decent special effects and rather different plot twists as well, but just to be nice, I WON'T spoil anything! Plus, Jordan Chan, Sam Lee and Angela Tong are very talented (as well as sexy!) This is one film of such a strange combo of genres that does not dissapoint.",
         "Bio Zombie (simplified Chinese: 生化寿尸; traditional Chinese: 生化壽屍; Mandarin Pinyin: Shēng Huà Shòu Shī; Jyutping: Sang1 Faa3 Sau6 Si1) is a 1998 Hong Kong zombie comedy film, starring Jordan Chan. It spoofs George A. Romero's Dawn of the Dead and shows many similarities to Peter Jackson's Braindead. This movie takes place in a mall where two young men and other people work. They do not seem to get along very well due to a lack of customers. One night the two young men give an apparently dying businessman a soft drink, which is in actuality an experimental Iraqi biological weapon that turns him into a flesh-eating zombie. Returning to the mall, the man escapes and begins infecting the population, forcing a small group of misfits to band together in order to survive.",
         "Horror comedy with uneven make up. Two slacker hustlers Working at a mall selling video games and VCDs and DVDs. When they run over a man fleeing from an escaped zombie (he was looking to get the soft drink like substance that turns people into flesh eating ghouls when it all went wrong and he fled and then got hit). The friends give him a sip of the \"zombie\" juice and then throw him in the trunk and head back to the mall unaware they've just started a zombie infestation. Best described as Dawn of the Dead in Hong Kong with a humorous eye, this is a movie that works in fits and starts and ends up just missing. The problem is that while there are nice touches like the zombie chef who loves an unaffected girl, our lead characters are real jerks and while that makes for some good laughs, it leaves you with no one to really root for, or people you're rooting for by default. So much for the antihero and snarky tones that some films take. Its not a bad movie just a disappointing one. Worth a look for horror aficionados.",
         "With the two main characters characters named Woody Invincible and Crazy Bee, and the love interest named Rolls... how can a movie fail? A lovelorn zombie sushi chef, a neglectful husband and a spiteful, yet faithful wife, two bumbling thieves, and a couple of beauty salon workers, Bio Zombie's cast is full of great characters; all that are played convincingly. Combined with a great script, Bio Zombie provides ample entertainment. A hilarious spin on an age-old premise, Bio-Zombie is a comedy disguised as a zombie movie. Amazing dialog, impractical events, and great lead actors, this movie definitely delivered. The perfect bad horror movie. 7/10",
         "This movie is great fun! I read a comment that said it was like mallrats with zombies, which is exactly what i thought while watching. The two main characters Bee (Sam Lee - who is on his usually funny form) and Jordan Chan's Invincible, while being both entertaining, offensive and lacking morals (they don't worry about mugging people, running people over or generally bullying people) do show some redeeming qualities towards the end (Bee -\"I don't want to be a zombie, i'd rather die\" what a line!). OK so the zombie (sub)plot does take a while to get in place, but the comedy does provide entertainment up until the zombies all start shuffling in. The pacing is great, with scenes of tension (the handcuff key in mouth scene)and cheesy emotion (The Sushi zombie giving a present to that girl) pushing along the narrative and character development to a good standard. Before watching it i was expecting a gore-fest, but gore fans will be disappointed, scenes of zombie-culling are quite brief and restrained, but fans of comedy-horror or zombie films should enjoy. To be honest the film does play as a bit of a spoof with moments of clichéd and cheesy emotion and the whole computer game idea towards the end. Although the ending does shaft the comedy element for emotion (although i think its played for laughs) and the ending is a bit of shock, it is overall an enjoyable experience and if you do enjoy this check out Peter Jackson's Braindead!",
         "Although I am not a big fan of \"Zom-Coms\" (Zombie-Comedies) after seeing the high rating on IMDb I decided to give this one a try. Needless to say I found it to be more than a little disappointing for several reasons. First, it is my opinion that this particular sub-genre is a very difficult undertaking to begin with due to the simple fact that zombies are not typically \"funny\" and any comedy at their expense risks lessening their overall value--and subsequently that of the movie as a whole. Therefore, I believe that it is extremely important to have the audience invested in the main characters as their welfare or predicament is quite often the key to the entire film. Unfortunately, in this particular case the two main characters named \"Woody Invincible\" (Jordan Chan) and \"Crazy Bee\" (Sam Lee) were hardly worth any concern or sympathy as they were nothing more than mere street thugs. Perhaps if they had been \"adorable losers\" it might have changed things but as it was I certainly didn't care for them one way or the other. As a matter of fact, if anything the only characters of any interest was a mugging victim named \"Rolls\" (Angela Tong) and an abused wife named \"Mrs. Kui\" (Dorothy Elias-Fahn) due in part because of their unfortunate circumstances but also because but they both lent some nice scenery to an otherwise drab atmosphere. And then there was the awful decision to give ridiculous names to the characters like \"Jelly\" (Suk Yin Lai) and the afore-mentioned \"Rolls\". Quite frankly, I found this action to be both cheap and childish. Ditto the entire movie. Below average."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": [
         "Brilliant Idea Group (BIG)",
         "Cameron Entertainment Ltd."
      ],
      "summaries": [
         "Hong Kong's answer to George Romero's Dawn Of The Dead. A soft drink tainted with bio-chemicals has the power to turn people into flesh-eating zombies. A man drinks from the bottle, and wanders into the night. As two young VCD sellers (Woody Invincible and Crazy Bee) from a local mall are returning to the mall with their bosses' car, they hit the man. Unsure of what to do, they bring the man back to the mall with them. The mall closes, and soon there are zombies everywhere! A small group of mall employees must bond together to try and fight their way out.",
         "A group of young shoppers and employees must band together when a zombie outbreak over runs their Hong Kong shopping center in the middle of the shopping day."
      ],
      "budget": 0
   },
   "movielensId": 47980,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "1998-06-11",
      "dvdReleaseDate": null,
      "directors": ["Wilson Yip"],
      "runtime": 94,
      "movieId": 47980,
      "title": "Bio Zombie",
      "mpaa": "R",
      "actors": [
         "Jordan Chan",
         "Emotion Cheung",
         "Sam Lee",
         "Yiu-Cheung Lai"
      ],
      "imdbMovieId": "0277605",
      "originalTitle": "生化壽屍",
      "genres": [
         "Horror",
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A soft drink tainted with bio-chemicals has the power to turn people into flesh-eating zombies.",
      "tmdbMovieId": 24916,
      "avgRating": 2.76471,
      "releaseYear": "1998",
      "numRatings": 17,
      "posterPath": "/oBjYa5N4VyDIkhKIxmKcnokMX2C.jpg"
   }
}