{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "drinking",
            "id": 15111
         },
         {
            "name": "spring break",
            "id": 158054
         }
      ],
      "imdb_id": "tt0086352",
      "video": false,
      "title": "Spring Break",
      "recommendations": [
         52736,
         91155,
         57665,
         76297,
         24881,
         61117,
         433829,
         16634,
         4288,
         28147,
         20863,
         54803,
         48375,
         4704,
         113693,
         69292,
         66918,
         80200,
         291362,
         35616
      ],
      "backdrop_path": "/cNM55I4KgZwT4xsl5SzB0eRHE7n.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Nelson",
               "gender": 2,
               "credit_id": "52fe440cc3a368484e00c9bf",
               "name": "David Knell",
               "profile_path": null,
               "id": 41253,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe440cc3a368484e00c9c3",
               "name": "Perry Lang",
               "profile_path": null,
               "id": 124783,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Stu",
               "gender": 2,
               "credit_id": "52fe440cc3a368484e00c9c7",
               "name": "Paul Land",
               "profile_path": null,
               "id": 223622,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "O.T.",
               "gender": 2,
               "credit_id": "52fe440cc3a368484e00c9cb",
               "name": "Steve Bassett",
               "profile_path": null,
               "id": 940950,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Susie",
               "gender": 1,
               "credit_id": "52fe440dc3a368484e00c9cf",
               "name": "Jayne Modean",
               "profile_path": null,
               "id": 152353,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Joan",
               "gender": 0,
               "credit_id": "52fe440dc3a368484e00c9d3",
               "name": "Corinne Wahl",
               "profile_path": null,
               "id": 157672,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe440dc3a368484e00c9d7",
               "name": "Richard B. Shull",
               "profile_path": "/eDosLV4XIsZoARHm77evMPACHUs.jpg",
               "id": 27515,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Geri",
               "gender": 1,
               "credit_id": "52fe440dc3a368484e00c9db",
               "name": "Jessica James",
               "profile_path": null,
               "id": 75195,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Eesh",
               "gender": 2,
               "credit_id": "52fe440dc3a368484e00c9df",
               "name": "Daniel Faraldo",
               "profile_path": "/sbGm3pgHEVTEuSUFStsDG0uVGW5.jpg",
               "id": 57598,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Ernest Dalby",
               "gender": 2,
               "credit_id": "52fe440dc3a368484e00c9e3",
               "name": "Donald Symington",
               "profile_path": null,
               "id": 10560,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "May Dalby",
               "gender": 1,
               "credit_id": "52fe440dc3a368484e00c9e7",
               "name": "Mimi Cozzens",
               "profile_path": null,
               "id": 158664,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Dalby's Henchman",
               "gender": 2,
               "credit_id": "52fe440dc3a368484e00c9eb",
               "name": "John Archie",
               "profile_path": null,
               "id": 981410,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Dalby's Henchman",
               "gender": 0,
               "credit_id": "52fe440dc3a368484e00c9ef",
               "name": "Robert Small",
               "profile_path": "/4Fdee5hcm7F0p302oeswWg7lMvH.jpg",
               "id": 1116654,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Gut Gut",
               "gender": 2,
               "credit_id": "53a28ef4c3a368320a000d91",
               "name": "Jeff Garlin",
               "profile_path": "/cBs7u7rBTvDFp5MFCnvrPeF7SI2.jpg",
               "id": 60074,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe440cc3a368484e00c9b5",
               "name": "Sean S. Cunningham",
               "profile_path": "/n2NNVtKE42SNGm9q75IknMZhMtr.jpg",
               "id": 35475,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe440cc3a368484e00c9bb",
               "name": "David Smilow",
               "profile_path": null,
               "id": 42628,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5345819ac3a3682591001946",
               "name": "Sean S. Cunningham",
               "profile_path": "/n2NNVtKE42SNGm9q75IknMZhMtr.jpg",
               "id": 35475,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "534581adc3a3682589001adb",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "534581bac3a36825a00019b6",
               "name": "Susan E. Cunningham",
               "profile_path": null,
               "id": 58715,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "534581c8c3a36825a00019b8",
               "name": "Steven Poster",
               "profile_path": null,
               "id": 1590,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "547f9f28c3a36829b2000263",
               "name": "Virginia Field",
               "profile_path": null,
               "id": 38687,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.309361,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21148,
      "vote_count": 17,
      "budget": 0,
      "overview": "Two sets of two college guys spend a spring break together in Fort Lauderdale, Florida. There they have lots of fun in and out of the sun.",
      "similar": [
         272693,
         57214,
         449176,
         10625,
         9880,
         308369,
         10314,
         37725,
         2105,
         8363,
         19840,
         81250,
         26123,
         43923,
         286565,
         11887,
         4951,
         9029,
         9655,
         9377
      ],
      "original_title": "Spring Break",
      "runtime": 102,
      "poster_path": "/8Mts1Re4CfWPCv41RrwgJ3Xl8cC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fogbound Inc.",
         "id": 3909,
         "origin_country": ""
      }],
      "release_date": "1983-03-25",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Like it's really, totally, the most fun a couple of bodies can have. You know?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sean S. Cunningham"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["David Smilow"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086352/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NzI2MDkyN15BMl5BanBnXkFtZTcwODE4NjkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: David Knell, Steve Bassett, Perry Lang | See full cast and crew »"],
      "reviews": [
         "Lookit, I know the humour is lame, and the plot is standard fare, but lets call a spade a spade. When this film came out, it had no intention of setting the world on fire, or raking in hordes of Oscars...it's just a teen movie. I am a child of the 80s. In fact, Spring Break holds a very dear place in my heart as it was the first \"R Rated\" film I ever saw (I was 14 at the time) and it was merely fuel for my raging hormones, which was all it was supposed to be. There were millions of movies just like this in the 80s. However, as lame as this film could be considered, I strongly feel that the teen films we see now are far worse. At least the acting in this film is good (the actors did well with what they had to work with). If nothing else, it's great to watch and remember our (fleeting) youth. I just got it on video and was afraid to watch it for fear that it was much worse than I remembered (after all, it WAS 1983 when I saw it last...19 years ago!!!). I must admit that I was pleasantly surprised. What more, even through all the bad hair and a wardrobe that makes us cringe and say \"What were we thinking\", the girls are still very beautiful and REAL!!! Nary an implant in sight! Another highlight: .38 Special's \"Caught Up In You\" used in a great spot for the soundtrack. Yeah, it's another 80s teen-geek-gets-laid-and-becomes-cool flick, but it's a good one!",
         "This movie fueled my pre-adolescent dreams of loose chicks and beer diving. The soundtrack includes such memorable tunes as \"Tijuana bring your mother to the gang-bang\" and \"I wanna do it to it - I wanna do it to you.\" This flick has made me what I am today. Bless you 'Spring Break', bless you. Of course Spring Break isn't a master piece. It isn't supposed to be. Just one of those late night HBO flicks from the 80's that they played over and over and over again. Since the good people at IMDb are forcing me to write at least 10 lines I guess I should try to say something more. College kids break free from the clutches of their paternal guardians and discover what it means to be ... well, drunk and stupid. The movie offers no great insight into the human mind or spirit - not every movie should. It didn't have the actors as Farris Buehler or Fast Times at Ridgemount High (nor the budget) but it was fun. Kind of a \"watered-down\" version of 'Girls Gone Wild' except you won't see your sister or daughter disgracing herself.",
         "Charming Ft. Lauderdale spring break film from 1983. Would this movie ever win any awards for cinematic excellence? Not a chance. But then it never tries to be anything other than what it is; mindless spring break fun circa-1983, but with a difference. The movie has heart, treating its likable leads in a positive way rather than depicting them as the stupid, sex-crazed, goofs that most films of the time seem to prefer. In short, there are a LOT less worthwhile ways to spend 101 minutes. Although this was my era, I never experienced spring break while in college myself (much to my ever-lasting dismay). But movies like this allow those of us spring break wannabe's who missed out, a way to share in the fun. DON'T bother watching if you are looking for a deep, filmatic experience. Instead, simply celebrate the era and enjoy the good \"clean\" fun that was Florida's spring break, before 'girls gone wild'!",
         "SUN!!Ladies!!Beer!!! This movie shows exactly a dream life!!!!What is better than spend some days chasing girls, drinking beer and chasing more girls and drinking more beer!!!!!!!!!! i think that every guy who wants to enjoy his life should see this movie to learn how to behave during vacations!!!Only the big nerds don't like this one!!!! Please Hollywood stop making boring movies with guys searching for the love of their lives!!When you are 20 21 you don't love girls!!!You love taking them to bed and drinking all day!!!!!!!!!!!I want the 80's movies style again!!!!!!!!!!!!!!!",
         "This is a wonderful film that captures so much of the early 1980's feeling at spring break, before the commercial exploitation and the cheap video cam made it a display. It is a warm film despite its attempts at gross comedy. My favorite line is OT upon reaching the motel, handed a beer he drains the entire quart and says \"beer is like...f**king great\". That captures the spirit of the movie. There is also a tender love story and a silly sideline about evil politicians. The love interest in the movie is one of the hottest women ever to grace the screen, and all of the characters of wonderfully funny and memorable. Ish (EESH) the bellboy at the motel,grabs a strip of satin hanging from a wall painting and shakes it \"Sanitized for your protection\", then says \"You want anything you see eesh, you need anything you come to eesh, you get in troubles ... they work themselves out.\" I love this movie, as you can tell. It was what we at the time wanted spring break to be.",
         "I LOVED this film! It is such a reminder of the great teenage sex films of the 80's. HBO used to show this almost 24/7 and I still watch it everytime I can. Most people probably dismissed this film as being nothing more than another 80's \"teenage coming of age\" movie, but it really is more! Look at MTV's Spring Break yearly specials and \"reality\" shows. You'll see how much things REALLY have NOT changed. It should be noted that Steve Bassett who was an actor in this film went on to become one of the most loved actors in the daytime drama \"As The World Turns\" in the role of \"Seth Snider\" for many years. If you catch this film, watch it an relive the 80's fun all over again! And by no means, Don't Burn It!",
         "Please do not confuse this film with any other spring break movie made in the last ten years. This movie is vintage 80s and has the killer soundtrack to match. I saw it when I was a kid one late night while my parents were asleep and it's been near and dear to my heart ever since. It's about a rich kid who comes to Spring Break in search of love and adventure and finds both. Other than that it has Corrine Alpha singing, many shots of Spring Break rituals and romance. The thing that separates this film from many of the other Lauderdale flicks is that it has a heart. It's a heart that likes to flash it's breasts to the beat of \"Caught Up in You\" by 38 Special but it's a heart none the less. David Knell is adorable and if you blink you'll miss a great butt shot of Jeff Garlin from Curb Your Enthusiasm as a drunk guy who moons the camera. Fun for everyone.",
         "This film is one of the most brainless and asinine 'comedies' I have ever seen. The acting is terrible, the production values are terrible, the script must have been written in crayon by a ten-year-old and anyone with half a braincell will be bored senseless by the sight of all those fun-lovin' college kids en route to alcohol poisoning and/or braindead whooping it up unconvincingly for the cameras. So why have I watched the film a number of times? Easy - Corinne Alphen (aka Corinne Wahl) has quite a sizeable role in it, and she alone lifts this imbecilic muck out of the gutter. She lights up every scene she appears in. She looks terrific in that skimpy white vest, stunning whilst taking a shower on the beach (this movie's so coy, though, she keeps her swimsuit on!) and simply awesome leading her all-female band Hot Date (a scary cross between the Bangles and Girlschool, with a very cute lead guitarist and three other members who are so ugly they'll probably bust the tubes in your TV) through a number subtlely titled 'I Wanna Do It With You'. It's a shame Corinne's acting career never transcended this kind of low-budget exploitation dreck, as she's always great fun to watch, and she seems to be having a fun time all the time; sadly the same cannot be said of the viewer!",
         "\"Spring Break\" is nothing more than an exploitive teen flick, but that is exactly what it set out to be. Following in the footsteps of the immensely popular \"Porky's\", this movie ups the nudie and the cheese ten fold. The entire film is a fine slice of swiss, with college drinking games and mayhem. You will probably not find another film that features more beer being dumped on everyone than this film. This is a movie that brings back those nostalgic days of the 80's, where everything was about having fun. What other movie could get away with a guy urinating on an alligator? As far as 80's teen comedies go, this might just be the holy grail. While it doesn't have all that many moments of intentional hilarity, the entire film is full of lovably cheesy and wild antics. It is about four guys having the time of their lives, and it is great. The soundtrack is stocked with some great 80's bands like 38 Special and NRBQ, complete with MTV-style editing. This film certainly wont win any awards, but it sure is one electric and fun trip back to the 80's. Never a dull moment, \"Spring Break\" is a film definitely worth saving from those dust covered VHS shelves! Forget \"Friday the 13th\", this is Sean Cunningham's masterpiece!",
         "For anyone who didn't make it to Fort Lauderdale in the 80s for Spring Break, this is as good as it gets. Luxuriate in the process of getting wild, drunk, lucky and laid along with Nelson, Adam, Stu and O.T. in the last hotel room in town. It's all about the fun, except that Last American Virgin Nelson is hounded by his politician stepfather and his bumbling henchman, Eddie Potmore. A timeless comedy that should be a required course in how to have fun before you grow up. There is some great music by .38 Special, \"Caught Up In You\", that accompanies some wacky hotel shenanigans that NO young adult should ever, ever have to endure, but I suspect a few may have. There are no statements to be made at all. No attempts at anything heavy in this movie, ala Porky's. It is just pure fun from start to finish. I still watch it occasionally, and I highly recommend it to anyone who missed it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Fogbound Inc.",
         "Sean S. Cunningham Films"
      ],
      "summaries": [
         "Stu & O.T. are two studs from the big city who arrive in Fort Lauderdale for spring break. They discover that the room they had reserved in an over-crowded motel is already being occupied by Nelson & Adam, a pair of college-nerds. With no other accomodations available, Nelson & Adam reluctantly agree to share the room with Stu & O.T., who promise to show them a good time. The wet-T-shirt contests and beer-guzzling-fun are threatened when Nelson's controlling step-dad shows up, along with a building inspector who wants to shut down the motel.",
         "Two sets of two college guys spend a spring break together in Fort Lauderdale, Florida. There they have lots of fun in and out of the sun."
      ],
      "budget": 0
   },
   "movielensId": 4807,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-03-25",
      "dvdReleaseDate": "2001-09-18",
      "directors": ["Sean S. Cunningham"],
      "runtime": 102,
      "movieId": 4807,
      "title": "Spring Break",
      "mpaa": "R",
      "actors": [
         "David Knell",
         "Perry Lang",
         "Paul Land",
         "Steve Bassett",
         "Jayne Modean",
         "Corinne Wahl",
         "Richard B. Shull",
         "Jessica James",
         "Daniel Faraldo",
         "Donald Symington",
         "Mimi Cozzens",
         "John Archie",
         "Robert Small",
         "Jeff Garlin"
      ],
      "imdbMovieId": "0086352",
      "originalTitle": "Spring Break",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["0k6HNTX3jLE"],
      "plotSummary": "Two sets of two college guys spend a spring break together in Fort Lauderdale, Florida. There they have lots of fun in and out of the sun.",
      "tmdbMovieId": 21148,
      "avgRating": 2.33667,
      "releaseYear": "1983",
      "numRatings": 150,
      "posterPath": "/8Mts1Re4CfWPCv41RrwgJ3Xl8cC.jpg"
   }
}