{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "islam",
            "id": 187
         },
         {
            "name": "persia",
            "id": 1241
         },
         {
            "name": "violent husband",
            "id": 2320
         },
         {
            "name": "married couple",
            "id": 2587
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "escape",
            "id": 10685
         }
      ],
      "imdb_id": "tt0102555",
      "video": false,
      "title": "Not Without My Daughter",
      "recommendations": [
         50116,
         17956,
         12714,
         9941,
         25697,
         102059,
         41760,
         32221,
         31908,
         16219,
         32911,
         21219,
         83489,
         26261,
         24073,
         61954,
         18551,
         30943,
         33633,
         11060
      ],
      "backdrop_path": "/zoErHxQb92rxuFDgvTAF2gLHOQg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Betty Mahmoody",
               "gender": 1,
               "credit_id": "52fe450dc3a36847f80b98d9",
               "name": "Sally Field",
               "profile_path": "/ymhpsxujOO3a9qaGYSpkenCt9Le.jpg",
               "id": 35,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Moody",
               "gender": 2,
               "credit_id": "52fe450dc3a36847f80b98dd",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mahtob",
               "gender": 1,
               "credit_id": "52fe450dc3a36847f80b98e1",
               "name": "Sheila Rosenthal",
               "profile_path": null,
               "id": 58078,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Houssein",
               "gender": 0,
               "credit_id": "52fe450dc3a36847f80b98e5",
               "name": "Roshan Seth",
               "profile_path": "/64HQvZuu8IeImXFe7vXgs4aZlUo.jpg",
               "id": 693,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Nicole",
               "gender": 1,
               "credit_id": "52fe450dc3a36847f80b98e9",
               "name": "Sarah Badel",
               "profile_path": "/pjgW0dWhbG0MMAdC4selNhsY6us.jpg",
               "id": 58079,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe450dc3a36847f80b98ef",
               "name": "Brian Gilbert",
               "profile_path": null,
               "id": 58080,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe450dc3a36847f80b98f5",
               "name": "Betty Mahmoody",
               "profile_path": null,
               "id": 58081,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe450dc3a36847f80b98fb",
               "name": "William Hoffer",
               "profile_path": null,
               "id": 58082,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe450dc3a36847f80b9901",
               "name": "David W. Rintels",
               "profile_path": null,
               "id": 58083,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe450dc3a36847f80b9907",
               "name": "Harry J. Ufland",
               "profile_path": null,
               "id": 58084,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450dc3a36847f80b990d",
               "name": "Mary Jane Ufland",
               "profile_path": null,
               "id": 58085,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450dc3a36847f80b9913",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe450dc3a36847f80b9919",
               "name": "Peter Hannan",
               "profile_path": null,
               "id": 57699,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe450dc3a36847f80b991f",
               "name": "Ofer Bedarshi",
               "profile_path": null,
               "id": 58086,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe450dc3a36847f80b9925",
               "name": "Terry Rawlings",
               "profile_path": null,
               "id": 5056,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.269491,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9585,
      "vote_count": 68,
      "budget": 0,
      "overview": "An American woman, trapped in Islamic Iran by her brutish husband, must find a way to escape with her daughter as well.",
      "similar": [
         12088,
         873,
         1701,
         1368,
         708,
         107846,
         10999,
         7972,
         49519,
         329103,
         10559,
         2698,
         13291,
         638,
         116711,
         903,
         1730,
         29259,
         8545,
         9093
      ],
      "original_title": "Not Without My Daughter",
      "runtime": 116,
      "poster_path": "/9EwpERBZ6urOSUokGqiLq8hYRxC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "فارسی",
            "iso_639_1": "fa"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/wINnSd4I6udJvHRKSWtrvdP3FjB.png",
            "name": "Pathé Entertainment",
            "id": 841,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ufland",
            "id": 12548,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1991-01-11",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "In 1984, Betty Mahmoody's husband took his wife and daughter to meet his family in Iran. He swore they would be safe. They would be happy. They would be free to leave. He lied.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian Gilbert"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "Betty Mahmoody",
         "William Hoffer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102555/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MTQwNjMzNF5BMl5BanBnXkFtZTcwNjAyOTM2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sally Field, Alfred Molina, Sheila Rosenthal | See full cast and crew »"],
      "reviews": [
         "While I was re-watching bits of this movie a few weeks ago, I read the user comments here at IMDb and was very disturbed. Since it is still bothering me, I decided to write my own comments on the movie and on what has been said here. First, the movie. It is about an international custody battle. That is a very real problem in this day and age. When couples from different countries break up they often each want the children to live with them and grow up in the country (and culture) in which they were raised. Each naturally thinks the way he or she was raised is better for their children. This movie is Betty Mahmoody's story. And the culture clash is between the United States and Iran. It takes place in 1984. The Ayatollah Khomeini was still very much the leader Iran and the Iran-Iraq war had been going on for 4 years and would continue for another 4. Iran was quite isolated from much of the world at that time. And 'Moody' Mahmoody, an Iranian-born doctor practicing in the U.S., brings his American wife, Betty, and their daughter, Mahtob, to Iran for a visit. When they arrive, Moody is dismayed at the changes in Iran, especially the breakdown of the education system and the resulting shortage of doctors. Then he becomes an ultra, ultra fundamentalist Muslim \u0096 so reactionary he makes suicide bombers look moderate. He demands that Betty dress and behave how he thinks a good Muslim wife should and wants their daughter to be raised to do the same. He becomes physically abusive to Betty. If she wants to return to America, it is fine with him, but Mahtob will remain with him in Iran. So Betty plans a dangerous escape for herself and her daughter. Does the movie work? Somewhat. 'Women in peril' movies are always a guilty pleasure and Sally Field is a good actress. The biggest problem is with Moody's character. Alfred Molina is a wonderful actor, but it's hard to do much with a character that undergoes such a radical change in his basic character in a matter of weeks. I kept expecting to learn that he had once been diagnosed as psychotic or schizophrenic. Is the movie unfair to the Iranian people? Again, somewhat. Virtually all the characters in the movie except Betty and Mahtob are Iranian. Some are good. Some are bad. But you can't have a 'woman in peril' with no peril. And that is provided by Moody and his family. But the people who help Betty escape are also Iranian. What unfairness there is lies not in maligning the Iranian people (it doesn't do that) but in implying (and sometimes saying explicitly) that the Iranian culture is inferior just because it is not westernized. As a free American woman I would not want to live in any fundamentalist society, regardless of which religion was in control. But post-revolution Iran is no more representative of thousands of years of Persian culture than Italy under Mussolini was representative of a land that produced the Roman Empire and Michelangelo. Is the movie unfair to Moody? No, because this is BETTY's story. Talk to anyone in a bitter custody battle and they'll tell you all about why their ex is evil. And they wouldn't be lying. They are giving you their point of view. That doesn't mean Moody doesn't have a different point of view which is equally true and equally untrue (and which, I gather from the comments, was explored in another movie.) But 'Not Without My Daughter' doesn't pretend to be a sociological examination into the two sides of a dispute. Let me repeat for the third time, this is BETTY's story. That brings me to why some of the comments disturb me so much. I would fully understand if some viewers thought the movie was silly or inaccurate or biased. But several writers have used their reviews as an excuse to joyfully bash the United States. My favorite was 'Who died and made Americans god to do movies about other countries??' That writer is from Sweden but doesn't seem to have a problem with Jan Troell making 'The New Land' (Nybyggarna) about America. And, were we to listen to her, we wouldn't have 'An American in Paris' or 'The Killing Fields' or 'Out of Africa' or 'Amadeus' (all of which are much better films than 'Not Without My Daughter.') But in the United States we have freedom of speech. That means that movie producers are free to make any movie to which they think they can sell tickets. And, as a member of the viewing public, when I disagree with what they are saying I have a very simple remedy. I don't buy a ticket.",
         "I am a bit confused as to why so many people seem to question the truth of Betty's story. She and her family are the ones who lived it. Who is anyone else to assume she is falsely presenting it? In my opinion, much of the reason for the movie and the book (which I agree is much better based on thoroughness alone) is that she is telling her story as a warning to other wives who may find themselves in a similar situation to not put herself and child(ren) at that risk. Others have mentioned that they were free to come and go as they pleased from Iran back to the U.S. Betty clearly points out in her book that she knows others in that same situation. It just wasn't true for her. I agree that the book is far superior to the movie, but for the movie to accurately represent the book, it would have been several hours long. As such, within the time frame, I think it did a great job. Perhaps I find the book and movie 100% believable having had the pleasure of meeting Betty. Also, I was born and raised in one of the small towns in Michigan where Betty lived, and worked for a year in one of the other small cities where she lived. Her descriptions of those places were right on target. My sister, a nurse, knew Moody from one of the hospitals mentioned--and confirmed, as stated by Betty herself, that at that time in his life, Moody was indeed a very nice man. In the book, Betty also makes it VERY clear that she knows and has great love and respect for many of the Iranian people--many of whom put their own lives at risk to help her and Mahtob escape--people whom she knows she can never repay in any way for what they did for her. The only Iranian people she presents (in the book) in any really truly bad light are those of Moody's family--especially the freeloading, ungrateful relatives who lived with them for a short time in America and expected her to wait on them--her being a second class citizen simply because she is a woman. There is nothing wrong with her making those statements. After all, she should know. She was not portraying all Iranians as having those characteristics. Also, in the book, she very adequately describes how erratic Mood's behavior and personality were, problems with situational depression--and how she chose to ignore/tolerate it because neither of them were very realistic and were non-confrontational people--often letting things get out of control before situations were even addressed. I could go on with many other things, but I think the reviews that see this as a culture bashing movie are reading a lot into it that is not there. It is simply one woman's story of what happened to her--as a warning of what is a chilling reality of what could happen to a child in this kind of situation. After what she went through to make sure her daughter did not have to live as a subservient second class citizen, she wrote it to try and keep the same thing from happening to anyone else.",
         "I have seen this movie a few times and in my opinion, I enjoyed it and didn't find it racist at all. This is what happened to Betty and her story. Is she saying that this is how ALL Iranians are? No, just what happened to her. The movie didn't give Iranians all a bad name because who were the people who helped her to escape from Iran? They were Iranians. It was not like every single person she met in Iran was rude to her. She is just talking about her husband's family and the way they treated her. Also remember this happened in 1984, twenty years ago. For people to compare Iran now to the Iran in the movie, it's totally different. The country has changed in the pass 20 years. I fully enjoyed this movie and admire the real Betty's courage. As a mother myself, I totally understand her not wanting to leave without her daughter. I would fight to the ends of the world for my child and that is what Betty did for her child as well.",
         "Many people on here have said that they were not speaking Farsi in this movie. Actually they were. Most of the actors were Israelis of Persian origin. Most of the dialogue in this movie was in Farsi, not in Arabic contrary to the claims made by many who have posted here. Even the non native speakers like Alfred Molina, etc muttered lines in Farsi, not in Arabic. In fact all throughout the movie you could see banners of Farsi hanging over the streets of Tehran, and graffiti saying \"Marg Bar Amreekaa.\" This means \"Death to America\" in Farsi. None of this was Arabic. How do you say \"Death to America\" in Arabic? \"Al Mout Li Amreeka\"....this line was not once uttered throughout the entire movie. And it never appeared on a single banner or graffiti message. There was Farsi throughout the entire movie. Just for starters basic words or phrases like \"Khoda Hafez\" \"Salaam\", \"Ashpazkhaneh\" etc. etc. Farsi is a very distinct language from Arabic. Very recognizable. Even if you didn't speak farsi you could easily distinguish it by ear from Arabic. Arabic is extremely loud and guttural. In contrast Farsi is much softer. The accents of these two separate languages are entirely different. So to the many people who said they didn't speak Farsi in this movie, you are wrong. Its been a while since I have seen it, but as far as I can remember, the only Arabic used was in prayers over the loud speakers. And when the family was performing morning prayers, they did speak Arabic, but it was ironically even in Persian accent. But this is normal. Iranians always pray in Arabic, the language of the Holy Quran. The movie was absolutely right about this. This movie was filled with Persian culture. Even the names of the foods were Persian, not Arabic. And remember some of the names of the characters? Ameh Bozorg, Baba Hajji, Miss Alavi, Khanum Shaheen, Aga Hakim...etc. etc. These are literally Persian names and titles. Very authentic. So I am really clueless as to what people are talking about when they said they only spoke Arabic in this film. Clearly not true. A note on Persian culture and language. There is no denying that Farsi is extremely arabized Persian. Farsi belongs to the Indo European language family but has thousands of Arabic loan words. Even the name \"Farsi\" itself is arabized. Its actually \"Parsi\" but the Arabs have no \"P\" sound, so its always been known as \"Farsi\". So although Iranian culture and the Farsi language is quite distinct from Arab culture and is Persian in origin, there is no doubt that it is at least somewhat influenced by Arabic ways. Why do you think Farsi is written with the Arabic alphabet? Why is the main religion of Iran Islam? Obviously because of the impact Arabic expansion and culture had on Persia so many centuries ago. Throughout the movie you also saw posters of Khamenei and Khomenei. Two Iranian totalitarian clerics. These men are not Arabs they are Persian. There were so many references to Persian in this movie. Moody even said to Mahtob (another Persian name)....\"You know, I was born in Persia.\" So when people accuse the producers of this film of being ignorant about Iranian culture and Farsi language, you are quite mistaken. They did a very good job, especially with filming this in Israel. They could have easily botched this movie, but for the most part they didn't. Also, some on here have said this movie is \"racist.\" I beg to differ. This movie is based on a true story. The book is even more graphic. This movie actually sugar coated a lot of things. And how could one be \"racist\" against Iranians? Since when has there been an \"Iranian race\" or a \"middle eastern race\"? Thats like saying there is an \"American race\" or \"North American race\" or something. It doesn't make sense. But anyway, this is a great movie. Very informative about the current oppressive regime in Iran. The Shah was bad, and unfortunately America supported him. But the current Islamic theocracy is far worse. They hang little girls from cranes in public.",
         "The story of Betty Mahmoody is a truly frightening one. The book she wrote and this movie based on it are controversial (many see it as little more than a racist slam against Iranian culture) but to me this movie came across as both believable and balanced. There's no doubt that life in Iran isn't presented as paradise, but the story really isn't about life in Iran; it's about one woman's experience of being forced to remain in Iran against her will after she and her daughter accompany her Iranian born doctor husband back to his homeland to visit his family, and about her subsequent efforts to escape Iran with her daughter. It also does a great job of depicting the almost complete lack of rights and freedoms women possess in Iran - having a status as little more than property to their husbands, and subject to their complete control. Sally Field was excellent in the role of Betty and Alfred Molina was also disturbingly believable as \"Moody\" - her husband. As the story opens, the family are living a comfortable life in Michigan and Moody is a completely Americanized doctor working in a local hospital - a loving husband and father. Against her better judgement, Betty agrees to visit his family in Iran - a family more radically Islamic than Moody who from the moment they arrive begin to pressure him to stay and adopt their ways. Molina did a good job of showing the gradual changes in Moody's character and as he becomes more and more abusive and controlling toward Betty. Field superbly portrays Betty's growing desperation and her feelings of helplessness (and hopelessness) as every opportunity for her to escape with her daughter seems to close. Finally, with the help of some sympathetic Iranians, Betty and daughter Mahtoub make a mad escape attempt toward Turkey. Whether all aspects of Iranian life and culture are accurately portrayed here seems somewhat beside the point to me. This isn't, after all, a documentary about life in Iran. This is Betty's own story as she experienced it and remembered it - and it's a story that makes the viewer ache for her as she tries to figure out a way to escape this nightmare she's caught up in. I found her story completely believable and brilliantly portrayed.",
         "I have seen other comments that tell \"his\" side of the story. He was a cruel man and basically held her hostage by not letting her leave without her daughter. He was a worm and a bully. Hurray for Betty and the bravery of her escape. I would have loved to see his face when he found out she made it back. He under estimated her--that stupid fool. He forgot that American women don't like to be bossed around. I hope he never got to see or talk to his daughter again. He doesn't deserve it. And don't believe any propaganda they try and sell you about how her poor husband got the dirty end of the stick. He pulled an underhanded sneak attack on her and didn't have the \"you know what\" to tell her his plans. Good for you Betty--and as for that creep and all creeps like him in Iran--good riddance. And don't buy it for a minute that Betty was lying. She wasn't. I have heard the same from other women in the same boat. She spoke the truth about everything and it is much worse than she even described.",
         "I saw this movie quite some time ago and enjoyed it. It did not leave me with a negative image of Iranians, Islam or Persia at all. I saw it as a simple story of mother trying to do what was best for her daughter. Not wanting ones daughter to be a second class citizen in my own opinion does not warrant the hostility I have seen portrayed in the previous comments. Sally Fields performance was certainly good. The movie told the story from the wifes/mothers point of view. I found that the movie showed just cause why the husband would become disenchanted with the USA. I can completely understand why he would like to return to his home. After all there is no place like home. My sympathy however with the husband left me when I saw the deception he displayed keeping his American family in Iran. This movie, though flawed was well worth viewing.",
         "I don't understand the rather low ratings of this film, although it drags quite a bit in the middle, it is a gripping true story, well scripted and well acted. Alfred Molina as the Iranian husband and Sally Field as the American wife are perfectly cast and each does a great job in their respective roles. I give it \"8\" of 10. First, we need to accept that part of the reason this film was made, and part of why it drags a bit in the middle, was the producers' desire to expose the mistreatment of women in certain Arab countries. This one was set in Iran, but presumably thousands of American women married to men in these countries are virtually imprisoned, not allowed basic freedoms, including the freedom to return to the USA. Or perhaps other \"western\" countries. I was in one of the Arab countries for a week in 1991 and what is depicted in this film is very accurate. The story - SPOILERS FOLLOW - it is 1984 and Betty is happily married to an Iranian-born doctor, and they have a 5-year-old daughter. We see them as a typical well-off American family, fishing in the lake in Michigan (filmed in Georgia) and having a family outing with the in-laws. At the hospital fellow doctors are making uncomplimentary remarks about Iranian doctors, and kids at school to the daughter. Plus, his large extended family back in Iran (formerly Prussia) are putting pressure on him to return. Betty is afraid to go for a short visit, but her husband swears on the Koran that he will see that they remain safe, and they will return home in the US after a two-week visit. When they arrive in Iran, the large family celebration looks more like a grand homecoming, which is what it was. After two weeks he told Betty they weren't going back, in Iran she is his property and she has no independent rights. When she argued, he hit her in the face with his fist. At one point, when her father was ill back in the states, and she wanted to travel to visit him, she would not be allowed to bring her daughter. She said, \"Not without my daughter\" will I leave, thus the title. Betty and her daughter were there for almost two years before they finally escaped, taking a dangerous route across one border, risking their lives for freedom. She had spent most of that two-year period constantly trying to find a way to escape. Angered by her attempts at one point he told her, \"Try this again and I will kill you.\" That coming from her husband with whom she lived such a normal life just months earlier. All in the name of his religious beliefs. The DVD is relatively sharp, but not \"reference\" quality. There is only one short \"extra\" of note, and it is a \"making of\" which also includes some comments from the real Betty. Good film, still can't figure out why it has a relatively low IMDb rating.",
         "This movie does everything possible to ilicit a reaction to the horror that betty mahmoody went through. Sally Field plays Betty Mahmoody, an american woman that married an Iranian in the US, only to go back to Iran being told by him that it would be a vacation, he decided to stay in Iran and virtualy had her as prisoner because she didn't want to stay. This movie has been criticized for being one sided, showing muslims, especially men as violent wife beaters. Though I agree that the film does do that, the film is told from her point of view, and is not meant to be a documentary. The husband is Moody is played by Alfred Molina, his performance is good, the script does allow him to be 3 dimensional, there are moments when his facial expressions transmit that he knows that what he is doing to his wife is wrong. The movie might have been better if they would have focused more on his feelings, but it is hard to sympathize with him, from the beginning he had mislead his wife, later beating her often. Is it a great film,no, but its performances are good and it inspires thought. This movie works on the level of a personal story, politicaly, it can be said that it is just pro US propaganda. But Betty's story is harrowing nonetheless",
         "This was on the Bravo Channel one night. The commercial looked quite appealing, and I figured I'd check it out. Mind you, my cup of tea is horror (check my review list) but I'm open to anything. And boy, was I surprised. First, I'll start with the plot. Betty, an American, and her husband Moody, an Iranian, live with their daughter Mahtob in America. One day, Moody overhears two fellow doctors at the hospital he works out making racial comments about him. He quits, and proposes to Betty that they take Mahtob and go to Iran for a two-week vacation. Hesitant and scared, Betty agrees. And that's only the beginning. The life in Iran is harsh and Betty is constantly forced to be wary of her surroundings. But the real nightmare begins when she realizes that Moody doesn't want to go back to America, and she herself is trapped in Iran, and has to save herself and her daughter. This movie is enthralling. Sally Field plays the role perfectly, and her character is someone you can't help but identify with. The helplessness of her situation is overwhelming, but to watch her struggle for an escape from her abusive husband (abusive in anger because she is trying to leave) and the rough conditions of a foreign country is even more overwhelming. Some of the scenes are amazing. When Betty's nightmare first begins, and she's begging for help from Moody's family, and they're all yelling at her in Iranian as she screams, \"God Damn you all!\" to them is one of the most intense of the whole film. And the ending is great. Not what you would expect. Well, it's not like something shocking, it's just subtle. But it will definitely give you so much pride to be an American, and you'll feel some comfort in being in this free country. All in all, I definitely recommend this movie. For anyone. You will be amazed. I was."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Pathé Entertainment",
         "Ufland"
      ],
      "summaries": [
         "\"Moody\" is an Iranian doctor living in America with his American wife Betty and their child Mahtob. Wanting to see his homeland again, he convinces his wife to take a short holiday there with him and Mahtob. Betty is reluctant, as Iran is not a pleasant place, especially if you are American and female. Upon arrival in Iran, it appears that her worst fears are realized: Moody declares that they will be living there from now on. Betty is determined to escape from Iran, but taking her daughter with her presents a larger problem.",
         "Betty Mahmoody is an American housewife living in America with her daughter and Iranian husband \"Moody\". Moody is very anxious to return to his homeland again, and wants to take his wife and daughter to Iran for a two week vacation. Betty expresses her doubts, but Moody assures her they would be fine, happy, and free to return anytime they want. But unfortunately, Betty's worst nightmare comes true as he has lied to her. Within time, Moody becomes more belligerent and abusive towards his wife and daughter, taking advantage of the Iranian laws. If Betty divorces Moody, he'll get full custody of their daughter, and her only salvation to return home is to escape with her daughter out of Iran.",
         "An American woman, trapped in Islamic Iran by her brutish husband, must find a way to escape with her daughter as well."
      ],
      "budget": 0
   },
   "movielensId": 4862,
   "movielens": {
      "languages": [
         "English",
         "فارسی"
      ],
      "releaseDate": "1991-01-11",
      "dvdReleaseDate": "2001-10-02",
      "directors": ["Brian Gilbert"],
      "runtime": 116,
      "movieId": 4862,
      "title": "Not Without My Daughter",
      "mpaa": "PG-13",
      "actors": [
         "Sally Field",
         "Alfred Molina",
         "Sheila Rosenthal",
         "Roshan Seth",
         "Sarah Badel"
      ],
      "imdbMovieId": "0102555",
      "originalTitle": "Not Without My Daughter",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["0TSmbayUJCo"],
      "plotSummary": "An American woman, trapped in Islamic Iran by her brutish husband, must find a way to escape with her daughter as well.",
      "tmdbMovieId": 9585,
      "avgRating": 2.9955,
      "releaseYear": "1991",
      "numRatings": 555,
      "posterPath": "/xqQ7Xc2JQAOcAc3uQr0IpVoLr3m.jpg"
   }
}