{
   "tmdb": {
      "original_language": "th",
      "keywords": [
         {
            "name": "gun",
            "id": 1419
         },
         {
            "name": "repayment",
            "id": 1522
         },
         {
            "name": "deaf-mute",
            "id": 1635
         },
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "male friendship",
            "id": 3230
         },
         {
            "name": "bangkok",
            "id": 3432
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "mafia",
            "id": 10391
         },
         {
            "name": "killer",
            "id": 15127
         },
         {
            "name": "gunshot",
            "id": 41644
         }
      ],
      "imdb_id": "tt0263101",
      "video": false,
      "title": "Bangkok Dangerous",
      "recommendations": [
         106230,
         121883,
         222071,
         95380,
         121522,
         48273,
         61385,
         109048,
         250312,
         144717,
         183784,
         104062,
         38025,
         37285,
         57395,
         54326,
         49475,
         41732,
         43713,
         180651
      ],
      "backdrop_path": "/lGW3oudlGnRmCrPzExD66iU1TvW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Fon",
               "gender": 1,
               "credit_id": "52fe438cc3a36847f805cc35",
               "name": "Premsinee Ratanasopha",
               "profile_path": null,
               "id": 31042,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Aorn",
               "gender": 1,
               "credit_id": "52fe438cc3a36847f805cc39",
               "name": "Patharawarin Timkul",
               "profile_path": "/1HwH20ov6RQoabhcoNE6uFZr9d6.jpg",
               "id": 31043,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Jo",
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc3d",
               "name": "Pisek Intrakanchit",
               "profile_path": null,
               "id": 31044,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "unknown",
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc41",
               "name": "Korkiate Limpapat",
               "profile_path": null,
               "id": 31045,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "unknown",
               "gender": 1,
               "credit_id": "52fe438cc3a36847f805cc45",
               "name": "Piya Boonnak",
               "profile_path": null,
               "id": 31046,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Kong",
               "gender": 2,
               "credit_id": "58bb2ee9925141609b0288c6",
               "name": "Pawarith Monkolpisit",
               "profile_path": "/2KYyvqiLijYKRL41OXKbmVXFeNk.jpg",
               "id": 1250057,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe438cc3a36847f805cbfd",
               "name": "Thanit Watcharasakpaisan",
               "profile_path": null,
               "id": 31030,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc03",
               "name": "Oxide Pang Chun",
               "profile_path": "/jrzNMBQjOCw9KZm7wuecQJhf9z9.jpg",
               "id": 31033,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc09",
               "name": "Danny Pang",
               "profile_path": "/A7jZ7cjEdWufEwN5Eh7CiIknLX7.jpg",
               "id": 21905,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe438cc3a36847f805cc0f",
               "name": "Pracha Maleenont",
               "profile_path": null,
               "id": 31035,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc15",
               "name": "Brian L. Marcar",
               "profile_path": null,
               "id": 31036,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc1b",
               "name": "Adirek Wattaleela",
               "profile_path": null,
               "id": 31037,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc21",
               "name": "SirLaosson Dara",
               "profile_path": null,
               "id": 31038,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438cc3a36847f805cc27",
               "name": "Nonzee Nimibutr",
               "profile_path": "/zp1I77AmKdmBYuYFdFlsTxhzCrN.jpg",
               "id": 31039,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe438cc3a36847f805cc2d",
               "name": "Akaradech Maneeploypech",
               "profile_path": null,
               "id": 31040,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "58bf167e925141607706b08d",
               "name": "Danny Pang",
               "profile_path": "/A7jZ7cjEdWufEwN5Eh7CiIknLX7.jpg",
               "id": 21905,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58bf1685c3a36866a50648de",
               "name": "Oxide Pang Chun",
               "profile_path": "/jrzNMBQjOCw9KZm7wuecQJhf9z9.jpg",
               "id": 31033,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58bf16a5c3a36866300625c1",
               "name": "Danny Pang",
               "profile_path": "/A7jZ7cjEdWufEwN5Eh7CiIknLX7.jpg",
               "id": 21905,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58bf16b4c3a3680d6801a2eb",
               "name": "Oxide Pang Chun",
               "profile_path": "/jrzNMBQjOCw9KZm7wuecQJhf9z9.jpg",
               "id": 31033,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.5942,
      "production_countries": [{
         "iso_3166_1": "TH",
         "name": "Thailand"
      }],
      "id": 3173,
      "vote_count": 18,
      "budget": 0,
      "overview": "The movie is about a deaf-mute hitman and his partner. Trouble begins when he starts a relationship with a young woman.",
      "similar": [
         13184,
         682,
         10651,
         1429,
         7516,
         245891,
         249070,
         787,
         7345,
         77338,
         1164,
         390043,
         10585,
         1620,
         2075,
         400,
         10222,
         483,
         11220,
         51608
      ],
      "original_title": "เพชฌฆาตเงียบอันตราย",
      "runtime": 105,
      "poster_path": "/tJngLwxlLcFYndYPvf2wLZlAPAd.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "ภาษาไทย",
            "iso_639_1": "th"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pang Bros.",
            "id": 87466,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Bangkok",
            "id": 1240,
            "origin_country": ""
         }
      ],
      "release_date": "1999-11-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Thailand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Oxide Pang Chun",
         "Danny Pang"
      ],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Oxide Pang Chun",
         "Danny Pang"
      ],
      "originalLanguage": "Thai",
      "imdbLink": "http://www.imdb.com/title/tt0263101/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NDg3NzQyMV5BMl5BanBnXkFtZTcwODM0ODQyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Pawarith Monkolpisit, Premsinee Ratanasopha, Patharawarin Timkul | See full cast and crew »"],
      "reviews": [
         "I picked up this DVD because I've been to Bangkok couple of times, and wanted to see how the filmmakers Oxide and Danny Pang manage to capture the more sleazy side of the city, and combine it with gangster noir to come up with Bangkok Dangerous. I've heard about the movie, and was surprised that our National Library actually had this DVD in its collection. Bangkok Dangerous tells the story of a deaf mute assassin Kong (Pawalit Mongkolpisit). His is a life of mission after mission, a cold and professional, though small time, killer. Growing up being bullied because of his disability, he finds work at a gun range as a cleaner, until he chances upon Joe (Pisek Intrakanchit) and his girlfriend Aom (Patharawarin Timkul). Kong learns his skills from Joe (in an excellent montage), and together, form a tag-team partnership. During the course of work, Kong chances upon the beautiful Fon (Premsinee Ratanasopha) who works at a drugstore, and in between missions, he romances Fon, who doesn't shun him in spite of being a deaf mute. The killer has finally known what it is to develop feelings and to love. However, if you live by the gun, chances are there will be those who are after you. Things change for the worse when Aom offends one of the gang's ranked member, and gets raped. Joe goes for revenge, but ultimately gets literally betrayed by the hand that feeds. Kong has to decide - to finish what had started and avenge his friends, or to try and begin life anew with the woman he loves, even after she has started to avoid him, knowing what he does for a living. In a cosmopolitan city like Bangkok, this film manages to capture a kaleidoscope of colours, mood, and use various camera angles to its advantage. It contrasts the shady underworld and strip bars, and its pulsating music, with the silent, kind world of love that Kong for the first time experiences when he's with Fon. It's a story of finding one's own morality when living in the midst of violence and sleaze, and the seeking of redemption from a life of sin. Code 3 DVD extras: Filmography of filmmakers and inspiration for the film.",
         "I thought it was actually a pretty superior 'hitman' film. If you want full-on action in a style of early John Woo, then no, it is probably not perfect for you, but the directing is excellent, the character development is good, and the idea as original as any other. I liked it, and liked the style particularly. It does borrow a lot from early Woo i guess, but it is borrowing and not stealing. There is enough originality of idea and of direction. The acting is pretty uniformly good as well. The critics in Toronto liked it too. (see awards and nominations)",
         "I Really enjoyed this one. The imagery is beautiful and imaginative, excellent editing and vibrant colors. The cast was good, especially the guy playing Kong, the deaf assassin, he did a fantastic job, showing a full range of emotion without uttering a word. I really felt for the guy. In fact, I completely fail to see how the characters are flat and undeveloped like someone said. True, we don't get their life story, but i found my self really caring for them, they felt sort of real even though you didn't get to know that much about them. That, and the girl playing Kong's love interest is so cute it'll make your eyes hurt... About the action. Some people complain about this not being up to par with John Woo's action choreography, but who said an action flick, just because it's from Asia should have to be about making every shoot-out look like the Swan Lake? This is grittier, more unrehearsed, it's not about looking good firing that gun (even though I'm a big fan of that too).I thought that there was some really smart stuff, where brains won over brawn, watch out for the scene with laser sights at the end. I went \"ahhh - Clever!\" This is not a perfect movie, it has flaws. I felt the ending to be a bit formulaic, and the whole \"violence begets more violence\" concept surely is nothing new plotwise, but still, it's not dumb and full of holes like so many other action movies. And it's sooo pretty to watch...",
         "Bangkok Dangerous I felt was a very stylish, well acted film with themes and, to an extent, a plot that ran along the same lines as alternative assassin flick Leon. Bangkok dangerous forms its protagionist with character interactions but mostly by delving into how he became the cold killer he is through a series of flashbacks which are not integral to the plot or even shown fluently but integral to our understanding of this troubled soul. The camera work in this film is its pro and con, at certain points style, fluidity and technique are all concentrated together to make some memorable scenes whereas occasionally certain shots has failed to impress and look slightly amateurish. The relationships in this film could also have had more focus on them because instead what we have is a series of different characters stories when we should have one large companionship struck by fate, betrayal and love. Warning for anybody watching this soon, the music ranges from OK to terrible and frequently fails to match the action. In conclusion: Pretty good, if actions you're thing then this is you're thing but you'll probably cry you're guts out anyway. Its still quite moving. Plot - 5 Plot Development - 7 Acting - 8 Style - 7 Music - 3 Action - 10 Average - 6.66 Stars",
         "Bangkok Dangerous is the story of a lonely mute who becomes a hit-man, partly to avenge himself upon the world that has alienated him. Only when he finds happiness does he realize the full horror of his life. The film boasts some great performances, particularly by Pawalit Mongkolpisit as Kong, the main protagonist. His face is beautiful yet impassive, and his large eyes convey all the strangled emotions of a person unable to communicate with those around him. There are many excellent moments to savour in this film, but the contrived way in which Kong's partner is forced out of retirement is ridiculous. However, despite the generic plot - which at times has a square-peg-round-hole forced feel to it - and the thoroughly predictable narrative progression, the film is actually pretty rewarding. It has a tender humanism at the centre, which gives the film real depth, and there are many moments worth savouring. Score 7/10 (6 is too low, but 7's maybe a little too high)",
         "I really loved this movie, i stayed up late one night to watch it, and this is the Original.. not the remake with nicholas cage. I haven't seen that one yet, i probably will, but i really loved this one, i really felt for the main character, i felt sorry for him that he was deaf, i just kept thinking during the movie, please get back together with Fon, she was so sweet and cute, she was perfect for him, all in all great movie, i am a big movie fan, American and foreign. And for me, this was grade A for a foreign film. Bravooooo. I will admit i cried at the end, why did he have to kill himself, i guess, he would've ended up in prison for life anyway.",
         "A good film with a great visual style. Although I kept finding it hard to overcome the problems a deaf\\mute assassin would encounter, it was something that was easily overlooked. Revenge, death and love, what more could a story ask for, and this one delivers it well. As with a lot of good Japanese movies, there is a heavy emphasis on visual style to convey a feeling, action or even thoughts of the characters onscreen, and this is done well here. Added to that is the use of audio to either cover the sound in a scene, or totally ignore it, showing the problems of the assassins' deafness, and yet at no point is this made obvious to the viewer, it's something you just notice. There's no Hollywood here either, and it's well appreciated. Watch this film, it's a good one.",
         "I would have to agree the quote that said that this was Wong Kar Wai mixed with John Woo and that was my thoughts exactly when I saw the movie. Its a good movie, could have been great, but definitely worth seeing. The movie is gritty and realistic and like a Woo film has characters that are flawed, but sympathetic and likeable which makes the violence and there is some graphic violence here have a lot more impact than in the average smash and crash movies. The hitman with a heart of gold scenario has been done before, but this one covers some new ground. *SPOILER ALERT*--------------------------------------------------------- The new ground covered is that the hitman actually realizes the consequences and impact of the killings he has committed on the victim's families, which if I recall is rarely ever touch upon in the hitman movies. Most of the targets in other movies of this genre all thugs who probably deserve a bullet put through their head and not an innocent person who is just living his life. *END OF SPOILER -------------------------------------------------------- This film has a lot going for it: stylish visuals, tight direction, and good melodrama, but I think the major fault of the film that kept it from being great was when the main character was onscreen, I felt that we should have been looking through his world through his eyes, as if we were deaf too, but instead only does this when he is making a hit. I think that would have been a lot people than having the characters write notes to him and having us hear what they are saying to have. I really like how the director's made what could have been an imitation of the classic restaurant shootout in A Better Tomorrow and with a visual twist gave the scene an originality all its own. I also found the ending to be a bit, corny and manipulative, although it did work and the decision that Kong made to change his fate was sad and at the same time clever and creative. All in all I would give this movie *** out a possible ***** because it did breathe some fresh life into a very cliched genre and is definitely worth watching.",
         "As a dead man's blood seeps across bathroom tiles, the opening titles to BANGKOK DANGEROUS appear in it. From its first scene, this movie is art. Writers-directors-brothers Danny and Oxide Pang launch BANGKOK DANGEROUS at us with the intensity of an adjective incorrectly following a noun, in the story of a hit-man who finds redemption. But there's an inventive hook to this old story. Hit-man Kong (Pawalit Mongkolpisit) is a Thai teen who lives in squalor with roommate Joe (Pisek Intrakanchit), a young ex-hit-man whose gun hand was injured when both he and Kong were in a street shootout. Kong has no other friends and his only education was the snarling underbelly of Thailand: brutal mobs, dirty dance clubs, seedy streets, bashings, blood and bullets. And he is deaf and mute. And you thought YOUR teen years were screwed up. Kong's whacking expertise is shown in the opening scenes, where a poignant dynamic is unveiled, that is, even in his supposedly ruthless hits, Kong does not seem \"heartless\" or \"merciless\" - but not because he has a \"heart of gold\" - it is because he has been so desensitized from a young age to regard whacking as just another job. We discover through flashbacks that Joe and his stripper girlfriend, Aom (Patharawarin Timkul), befriended the young Kong at the shooting range where he worked sweeping bullets, and took him under their wing to become a REAL bullet sweeper. Kong is a sociopath through nurture not nature. An excellent scene punctuates this point: Kong takes aim from a rooftop at a mark below. A little girl on another rooftop sees Kong and looks down to see what he is aiming at. Instead of alerting a nearby grownup, she also aims with her little hand. She pulls her imaginary trigger as Kong squeezes his real one. When the mark goes down... she jumps up and down in joy. This kind of scene is verboten in American movies. But the Hong Kong-born Pang Brothers illustrate that unless anyone tells you something is \"bad,\" how would you know? The violence is portrayed like real violence: quick ,efficient, sudden; no camera playing lovingly over splattered faces. It's indie, it's scarring and raw with forceful sound design and evocative music. It's movie \"making\" - Kong enters a room with his gun drawn on six guys, who all look up, frozen. Jump cut. Six guys lie strewn around the room, dead, bloodied, without seeing a shot fired. And Kong looks like he has not moved. When Kong falls for a teen pharmacist, Fon (Premsinee Ratanasopha), his infatuated reaction is believable because of his age and circumstances. He has never attended any special schools for his disabilities, and he is basically a shutaway who only ventures out to kill, so we imagine his seclusion has left him a lonely virgin. Even though we know Kong's \"redemption\" must be coming, it does NOT come via the doe eyes of Fon. One idyllic night, as they get close to that moment when anyone who has watched a romantic movie knows they are going to exchange girl germs, they get mugged. And Fon, who has spent the night trying to guess the quiet, shy Kong's job, gets to see first hand his greatest abilities. And she is repulsed. As John Cusack showed us in the magnificent GROSSE POINTE BLANK, a hit-man can find redemption even whilst in the process of doing that which he is being redeemed from. BANGKOK's powerful redemption scene comes as surprisingly as the rest of its scarring adventures in misanthropy. The other most affecting thing about BANGKOK is its original soundtrack, which is credited to Orange Music. We have grown so inured to Western Civilization's glossy neo-classical John Williamses and Hans Zimmers and Danny Elfmans that it is a welcome jarring evocative earful when exposed to people who have not been exposed to them. A rape, a revenge, a setup, a hit gone wrong. An eye for an eye. When Fon realizes she digs the bad guy, it is too late. The Pangs have packed up, moved to America and scored funding to remake their own movie with a bad mullet... --Review by Poffy The Cucumber.",
         "This movie is like \"Ghost Dog: The Way of the Samurai\", in that they are both films where the anti-heroes are vicious professional killers, molded by the circumstances of their youth, both awakened to the possibility of love. But I liked Bangkok Dangerous much more, in that the grit seemed less contrived. The reference to Charlie Chaplin is significant. In Thailand, Chaplin is revered even more than the French worship Jerry Lewis. To the Thai people, \"The Little Tramp's\" struggle against the domineering authority figures of his world is something that the average Thai relates to deeply. In Bangkok Dangerous, Kong, the killer, is a little guy buffetted by forces he doesn't fully understand -- but ultimately ones he fights back against. Don't be too critical when watching this. Just settle back and enjoy it; and you will indeed."
      ],
      "genres": [
         "Action",
         "Crime",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Film Bangkok",
         "Pang Bros."
      ],
      "summaries": ["The story is of a deaf-mute hitman and his partner who are based in Bangkok. He is friends with his partner's girlfriend who is a stripper at a local club. They go about their assassination business as usual as the boss climbs the underworld ladder and forms new alliances. Flashbacks explain how he got to this point in his life. He forms a relationship with a young woman from the pharmacy who is caring and innocent. The hunts continue as treachery begins. A big name hit makes him realize that good people are hurt by his actions. The first rule of assassination closes in on him as he strikes revenge."],
      "budget": 0
   },
   "movielensId": 4868,
   "movielens": {
      "languages": ["ภาษาไทย"],
      "releaseDate": "1999-11-01",
      "dvdReleaseDate": "2002-02-26",
      "directors": [
         "Oxide Pang Chun",
         "Danny Pang"
      ],
      "runtime": 105,
      "movieId": 4868,
      "title": "Bangkok Dangerous",
      "mpaa": "",
      "actors": [
         "Premsinee Ratanasopha",
         "Patharawarin Timkul",
         "Pisek Intrakanchit",
         "Korkiate Limpapat",
         "Piya Boonnak",
         "Pawarith Monkolpisit"
      ],
      "imdbMovieId": "0263101",
      "originalTitle": "เพชฌฆาตเงียบอันตราย",
      "genres": [
         "Thriller",
         "Action",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["_2rQqjyTzjg"],
      "plotSummary": "The movie is about a deaf-mute hitman and his partner. Trouble begins when he starts a relationship with a young woman.",
      "tmdbMovieId": 3173,
      "avgRating": 2.8937,
      "releaseYear": "1999",
      "numRatings": 127,
      "posterPath": "/tJngLwxlLcFYndYPvf2wLZlAPAd.jpg"
   }
}