{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "christian",
            "id": 5950
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         }
      ],
      "imdb_id": "tt0805526",
      "video": false,
      "title": "Facing the Giants",
      "recommendations": [
         17345,
         14438,
         72213,
         29697,
         45767,
         323272,
         335805,
         129705,
         54897,
         62698,
         58430,
         41144,
         86531,
         45928,
         106968,
         42950,
         49345,
         33201,
         15005,
         24613
      ],
      "backdrop_path": "/sVWbYcAqK6hTg5708llYg7i2XV5.jpg",
      "revenue": 10178331,
      "reviews": [{
         "author": "chtfn",
         "id": "50e3be2b760ee30b571bcad8",
         "content": "Terrible Christian propaganda movie. The story is ridiculous, the jokes are bad. We nervously laughed while watching it because we could not believe it. A sort of gross USA caricature.",
         "url": "https://www.themoviedb.org/review/50e3be2b760ee30b571bcad8"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Matt Prater",
               "gender": 2,
               "credit_id": "52fe47ab9251416c750a1791",
               "name": "James Blackwell",
               "profile_path": null,
               "id": 83902,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Grant Taylor",
               "gender": 2,
               "credit_id": "52fe47ab9251416c750a1795",
               "name": "Alex Kendrick",
               "profile_path": "/o3u0dmWJjipYX1aJHhQwfGEOW49.jpg",
               "id": 78040,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Brooke Taylor",
               "gender": 1,
               "credit_id": "52fe47ab9251416c750a1799",
               "name": "Shannen Fields",
               "profile_path": "/4KUtjxsdavEWaPLXmTMoWJrHE3u.jpg",
               "id": 135798,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "JT Hawkins",
               "gender": 0,
               "credit_id": "52fe47ab9251416c750a179d",
               "name": "Chris WIllis",
               "profile_path": null,
               "id": 135799,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Brady Owens",
               "gender": 2,
               "credit_id": "52fe47ab9251416c750a17a1",
               "name": "Tracy Goode",
               "profile_path": null,
               "id": 135800,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47ab9251416c750a178d",
               "name": "Alex Kendrick",
               "profile_path": "/o3u0dmWJjipYX1aJHhQwfGEOW49.jpg",
               "id": 78040,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47ab9251416c750a17a7",
               "name": "Alex Kendrick",
               "profile_path": "/o3u0dmWJjipYX1aJHhQwfGEOW49.jpg",
               "id": 78040,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.602806,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18925,
      "vote_count": 84,
      "budget": 100000,
      "overview": "A losing coach with an underdog football team faces their giants of fear and failure on and off the field to surprising results.",
      "similar": [
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         323677,
         10474,
         9563,
         2323,
         86130,
         13416,
         1578,
         5925,
         12163,
         1367,
         1374,
         9552,
         612,
         45317
      ],
      "original_title": "Facing the Giants",
      "runtime": 111,
      "poster_path": "/dHh6Bw9LsUYAPv5CsSCp5JF8tHx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Destination Films",
         "id": 769,
         "origin_country": ""
      }],
      "release_date": "2006-09-29",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Never give up. Never back down. Never lose faith.",
      "adult": false,
      "homepage": "http://www.facingthegiants.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alex Kendrick"],
      "runtime": 111,
      "synopsis": "In December of 2002, Grant Taylor's (Alex Kendrick) Eagles, of Shiloh Christian Academy, are slightly behind against the Tucker Tigers, late in the fourth quarter. Taylor shouts to Zach Avery (Brandon Glow), \"Cross the Thirty!\" He wants his offense to get within good field-goal position. But Zach, though his receiver Jonathan Weston (Tommy McBride) is open, gets sacked. Since this is fourth down, the Tigers take the ball, fall on it, and run out the clock. So ends the game, and another losing season--Taylor's sixth in a row. The 2003 season begins with some dire news: Darrin, the Eagles' top scorer in 2002, has moved in with his father so he can transfer to the rival Tucker school. Taylor's offensive and defensive co-ordinators, J. T. Hawkins (Chris Willis) and Brady Owens (Tracy Goode), break it to him. He then has to break it to his players, who of course take it very badly. When Grant drives home, his car dies after he barely gets off the road. His house has a very bad smell, which neither he nor his wife Brooke (Shannen Fields) can figure out. THeir evening meal will be cold, because their stove does not work. And their combined salaries ($24,000 a year for Grant, and the $6,000 that Brooke makes in the local florist's shop) will not let them improve their situation. And to top it all, Brooke desperately wants to be pregnant, and yet again takes a home pregnancy test, finds it negative, and carelessly leaves the test kit for Grant to find. In the next scene, sportscaster Alicia Houston (Erin Catt) reports on this year's defending champions, the Richland Giants. Coach Bobby Lee Duke (Jim McBride) is itching for a match-up with anyone who dares challenge their title. That Friday night, the season begins--badly. Twenty-three to nothing--and on their home turf, yet. The failure of Grant's car to start in the parking lot does not help his mood. Nor does Brooke's embarrassment as Grant has to ask Brady to give him a jump start. He'd like to buy a new compact car, but the facts remain: they cannot afford it. Brooke also says her gynecologist says there is no physical reason why Brooke cannot have children. So Grant agrees to see a urologist to check his own reproductive system. Monday begins with a student named Stanley (Jason Rossi) finding himself, desk and all, on top of the teacher's desk. With the students laughing at him, he dismounts--with difficulty. Then the teacher tells Brock Kelley, the team captain, that he and Stanley are in detention for their little joke--and for their poor grades. The coaching team faces some more sad facts: they have the toughest season they've ever had, with the least amount of talent. In the middle of it, Grant leaves for his doctor's appointment--and leaves J. T. and Brady to argue about what kind of doctor Grant is going to. (J. T. suggests Grant is going to see a dermatologist to see about a hair transplant; Brady doubts that.) That afternoon, David Childers (Bailey Cave) talks to his father, Larry Childers (Steve Williams), about his athletic options. He is new at Shiloh, and they don't have a soccer program. Larry encourages his son to try out for the football team as a kicker, even though he is of shorter stature than average and has never kicked a football in his life. The next afternoon, Alvin Pervis (Mike Garner), one of the fathers, talks to Brady Owens and invites him to a secret meeting aimed at replacing Grant Taylor as head coach--and naming Brady to replace him. The fathers have asked for a meeting with Dan Ryker(Dennis Erickson), the A.D. Grant asks Brady about the talk with Pervis, but gets nothing out of him. Just then, Larry and David Childers show up, and David tries out as a kicker. Jonathan Weston, the regular kick holder, doesn't mind the tryout--because Joshua Webster (Chris Matthews, with Mark Gahagan as stunt double), the regular place kicker, doubles as a wide receiver and would rather receive than kick. David kicks a lot of balls wide or short--but finally manages to kick the ball straight through the goal posts. After practice, Matt Prater (James Blackwell) has another fruitless argument with his father, Neil Prater (Bill Butler), over his after-practice schedule--and the coaching team notices old Mr. Bridges (Ray Wood) praying over the school lockers, as he always does. J. T. recommends that David Childers stay on the team as a relief kicker. But that Friday night, Shiloh loses to Dewey County, twenty-one to seven--when Dewey hasn't beaten Shiloh in more than ten years. And angry Grant roars at his players for their apathy, the missed practices, and all the mistakes they made on the field. David talks to his father about that sobering session, and about whether he can help the team at all as a kicker. Larry encourages his son not to give in to his fears. (The wheelchair-bound Larry also gives his son a turn when he tries to touch up a paint spot his son missed, and falls back into his chair, making a racket that brings David running.) On Monday, Grant sees the urologist, Dr. William Jordan (Wayne Holley), for his follow-up appointment. The news is dire: his sperm count is low. Too low. (The film does not mention this, but that's the most logical problem.) Grant spends the day moping about it, even staying late at the school because he doesn't want to face Brooke. And so he overhears Alvin Pervis, Neil Prader, and Luke Prey talking to A. D. Dan Ryker about replacing him. Ryker stands up for his head coach, but he has three fathers telling him that Grant has to go. What makes it worse: Brady Owens is at that meeting, saying nothing. Ryker makes no decision--but Grant does not stick around to hear the end of the meeting. A humiliated Grant finally goes home and confesses everything to Brooke--about the secret meeting he overheard with the A. D., and about what the urologist told him. That scene ends with the two of them sitting at their kitchen table and crying. That night, Brooke wakes up at 3:11 a.m. to find Grant sitting up in their living room, reading a book--presumably his Bible. So she gets down on her knees and prays. On Saturday morning Grant walks out into a nearby forest and offers a heartfelt prayer to God, to tell him what His will really is for his life. It's early, so Brooke once again wakes up in an empty bed--but now she comes out to join him and assure him she will accept whatever adventure the Lord sends them. The next game ends just as badly as the last two. David Childers takes a shot at a field goal--and misses. David feels terrible about that, but Larry will not let his son quit. Alvin Pervis takes yet another chance to ask Brady Owens to try out for head coach to replace Grant. This time Grant walks up and stares Alvin down, forcing him to retreat. Then Grant tells Brady to decide once for all whose side he is on, and stay on it. On Monday morning, Mr. Bridges does more than pray over lockers. He walks in on Grant to share with him Revelation 3:7-8, about Him Who opens and no man shuts, and shuts and no man opens. He also shares with Grant a parable about two farmers who prayed for rain--but only one of them cultivated his fields to prepare for that rain. Grant takes the hint. He draws up a new working team philosophy: to give all to God, and concentrate on that, not on something idle like winning games. Brooke likes what he has written, and sees that it's applicable to their home life, too. Grant lays this on the team the next day, with a simple illustration: no one can remember who won the State championship five years earlier. Out on the field, Grant tells them that their attitude is \"the aroma of the heart.\" If the heart stinks, so does the attitude, and that carries over. To prove that, he puts his players through the Death Crawl--on all fours, with the knees off the ground, and another teammate on one's back--for ten yards. But when Brock Kelley (Jason McLeod), the lead tackle, and his friend Jeremy Johnson (Chris Heape) start talking about the coming match with Westview, as if it is already lost, Grant singles out Brock and Jeremy for a special exercise. He will ask Brock to do the Death Crawl, with Jeremy on his back, for fifty yards--blindfolded. Of course what he actually does is push Brock to go all the way to the opposite endzone--and when the rest of the team sees that, they stand up and stare in wonder. Grant tells Brock that he, Brock, is the most influential player on the team--so his attitude affects others. The demonstration impresses Brock, and the rest of the team. It also impresses J. T.--and Brady, who at last decides whose side he's on. Grant then takes a moment to tell Matt Prater to stop taking a disrespectful attitude toward his father. \"You can't judge your father by his acts and then judge yourself by your intentions. It doesn't work that way,\" he says. One complication exists: Matt is at Shiloh because Westview kicked him out. That will be important later in the week. (Recall that Neil Prader is also one of the three fathers who tried to persuade the A. D. to fire Grant.) That evening, Grant finally finds the source of the bad smell in the house: a dead mouse. He teases Brooke unmercifully about it, but is still glad to get rid of it. The next day, J. T. finally tells David Childers what he needs to know about kicking: not to approach every kick as if he's going to kick it wide. He even quotes the Scriptures about the wide gate and the narrow gate. Brady loves overhearing that, and so does Grant. More to the point: it works, because David does start kicking the ball straight. Next day, another teacher shows a truly awesome scene: a revival, happening right on the field, this after Mitch (Brian Kelley), the Bible teacher, brought his class out to the field. Matt Prater started it, the teacher says. While Mr. Bridges makes his blessing walk along the lockers, Matt asks Grant to drive him to his father's workplace--so that Matt can tell Neil Prater, in front of his business associate Mr. Jones (David Nixon), that from now on, what he says goes. Neil is profoundly grateful to hear his son say that--and is even more grateful to Coach Grant Taylor for bringing Matt in so Matt could say that. Friday night arrives, for the match with Westview. Grant gives one last pep talk, before letting Brock Kelley lead the team in prayer. And this time the outcome is a lot different: Shiloh beats Westview. The team has a new attitude, that carries into their studies. Teachers look twice at these former \"dumb jocks\" who are at last applying themselves to their studies as well as they apply themselves on the playing field. More games take place, with straight wins. Walker Jennings falls. Then David Childers kicks the winning field goal against another school. Next Monday afternoon, Neil Prater and his son anonymously give Grant another incredible gift: a brand-new Ford F-130 pickup truck. They even swap it out for his old blue car with the dying battery. \"Not a word to anyone,\" Neil commands his son. Grant hardly dares believe it--but the title doesn't lie. The victories keep rolling in as the season rolls on. Ivey Grove falls, 14-10. Next week Shiloh wins its fifth straight victory. And then the sixth--which sends Shiloh into the State playoffs. The day after that last win, Grant drops into Brooke's flower shop and places an order with Brooke--for flowers that he will give her when he takes her out to dinner. He has news: Dan Ryker gave him a $6,000 raise. The playoffs begin, but don't go so well. Shiloh plays the Panthers of Princeton Heights Academy--and loses, 28-10. Grant encourages his players to praise God anyway, win or lose. Matt Prater takes the lead to encourage the team to do just that. And on Monday afternoon, Stanley Shultz (Walter Burnett) of the Georgia Inter-Scholastic Athletic League calls Grant with electrifying, gotta-sit-down-for-this news. Grant summons his players to break it to them: Princeton Heights fielded two ineligible 19-year-olds. Results: Princeton Heights disqualified, and Shiloh advances to the next round--against Tucker, where Darrin had transferred. Friday night arrives, and the Eagles beat the Tucker Tigers. Putting in the game-winning score: relief kicker David Childers. Next week, Brooke tells her employer (Jackie Everson) that she has been nauseous for two mornings in a row. The employer tells her to see a doctor. Friday night arrives, and Mr. Bridges listens as the Eagles score a game-winning touchdown. Twenty-to-seventeen, and the Eagles now will face the Richland Giants in the State final. The last Friday arrives: Eagles against Giants. That morning, Brooke encourages Grant not to give in to fear--and not to worry about her, either, though she won't tell him where she will go. She goes to the gynecologist and takes yet another pregnancy test. David Childers prepares for his big night, though he is convinced he will never play, because he is still second-string. At the gynecologist's office, a heartbroken Nurse Laura (Cynthia Overvoll) gets the news from another nurse (Shelly Brown): the pregnancy test is negative--again. Laura breaks this news to Brooke. But as Brooke prepares to leave, the filing nurse (Candace Howell) discovers, with a shock, that they have mixed up the results! Brooke Taylor's results are in fact positive! The excited Laura rushes out to the parking lot to tell Brooke before she can pull out. Game time arrives, and Grant's old coach at Shiloh (Mark Richt) comes to give Grant some encouragement. Bobby Lee Duke is as cocky as ever, with his eighty-five players against only thirty-two for the Eagles. The first half goes well enough for the Giants. Fourteen-to-nothing, Giants. Grant Taylor orders: blitz on the next first down. They do--and intercept a pass and return it for a score! The half ends: fourteen to seven, Giants. Grant now orders: outsmart them, with trick plays. Second half begins, and the Eagles' tricks work. They tie the game. Then Coach Duke orders: \"Make them pay!\" A Giant player takes that literally--and clips Joshua Webster on the extra-point kick, breaking his collarbone and knocking him out of the game. So David Childers must kick from now on. Next scoring drive ends: twenty-to-fourteen Giants, as the Giants fail of their two-point conversion. Seven minutes left: the Giants get to fourth down, and kick a field goal to extend their lead. Next play: double-blitz long. It ends with another TD and one-point conversion. Score: 23-21. Next drive: the Giants close to first-and-goal. Grant tells Brock Kelley to find his strength--and Brock shouts to his defensive team, \"Stone wall!\" And so the Eagle defense, under Brock's leadership, make an incredible goal-line stand. And when Coach Duke refuses the field goal, that sets up the Eagles to cause a fumble, recover, and return the ball to the Giants' thirty-four yard line! And then, with a scant two seconds left to play, Grant issues his final order: David Childers must kick a fifty-one-yard field goal. David doubts he can do this, but Grant tells him, once again, to lay aside his fears. The sports announcers can't understand it, especially since the wind is against David. But Coach Duke makes a mistake: he calls a time-out when he doesnt' have to. And then, at the last second, the wind shifts--and when David sees his father standing up in his wheelchair, he moves in to make the kick. It is good. Final score: twenty-four to twenty-three, Eagles. In the locker room, Grant asks his players to dare tell him what's impossible with God. Answer: nothing, of course. He singles out David for his field goal, Zach for his quarterbacking, and Brock for his defensive leadership. That night, Brooke breaks to Grant some more joyous news that he hasn't heard yet: that he just \"made the Daddy team.\" Two years later, Grant Taylor, with two State championship trophies on his wall, has a year-old son (Luke Parr) who has his own model football field to play with--and Brooke obviously has another baby on the way.",
      "writers": [
         "Alex Kendrick",
         "Stephen Kendrick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0805526/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5OTg1NjI3M15BMl5BanBnXkFtZTcwNDc4MzMzMQ@@._V1_.jpg",
      "actors": ["Stars: Alex Kendrick, Shannen Fields, Jason McLeod | See full cast and crew »"],
      "reviews": [
         "The movie was well worth my time. I would encourage anyone who is looking for a good uplifting movie to check this one out. the characters are easy to relate to and the underlying story is very heartwarming. If you are having a bad day, or even if you are having a good day, this would be a great film. I left the movie feeling uplifted and full of hope!! The spirit of the movie is a bit reminiscent of \"Pay It Forward\". One word of warning, although the film does make you laugh in parts, you will need to bring your own box of tissues. After watching the film, I found out that the film was shot with only 1 camera. I honestly did not notice while watching the movie. everyone should be able to find a part of themselves in at least one of the main characters.",
         "Facing The Giants is a \"feel good\" movie. As I type those words, I can't help but think, \"OK, I've just alienated at least half the readers from seeing the movie\". A \"feel good\" movie doesn't have to translate to pure sap. Think Rocky more than Steel Magnolias. Although even that comparison is lacking, because similarities between Giants and Rocky or Rudy or for that matter any other \"come from behind\" sports movies also come up short. One thing is for sure, no one viewing Giants will miss the Christian content, and that difference alone makes the film unique. But that's not the only thing that sets this film apart. The fact that it was made mostly by volunteer amateurs from Albany, Georgia's Sherwood Baptist Church-for $100,000-is a testimony to what people can do when they passionately believe in something. That alone makes this a truly \"inspiring\" film! The story focuses on Coach Grant Taylor (played by writer, director, and Sherwood associate pastor Alex Kendrick), whose Shiloh Christian Academy football team hasn't had a winning season in six years. After losing a star player to another team, things are looking down for the Shiloh Eagles, and school board members begin to consider showing Taylor the door. The coach is having a bad year for sure. He drives a beat up car, his house smells like something died, and worst of all-he and wife discover they can't have children of their own. The Motion Picture Association of America (MPAA) board that hands out movie ratings says that it was in fact this pregnancy theme that earned Giants it's PG rating. Don't be concerned by this \"adult\" topic-it's handled very appropriately for the whole family. On the \"family\" topic: yes you can the kids. My recommendation would be ages 8 and up, only because younger children may be bored with the football and \"personal crisis\" themes. But there is no sexual content or profanity, and violence is limited to football tackles. By the way, the football action looks great, thanks to one of the paid crew members, cinematographer Bob Scott. He's worked with the amazing NFL films as well as Friday Night Lights and many others. This is a very good film for the family-I actually think that's what this movie was made for. I can see families going out to eat after the movie and discussing some of the themes (trust in God, respecting your parents). If my son was older, I would be taking him to see it for sure. The movie could truly have a positive impact on kids-as opposed to the mindless entertainment they are often subjected to. As the story unfolds, Taylor reaches a breaking point, and decides that all he can do is trust the Lord for guidance. He tells his team, \"If we win, we praise him and if we lose we praise him\". Most adults won't be too surprised where the films goes after that-however I think kids in the audience will be delighted-and maybe inspired-by the turn of events. Let me go back to the \"pure sap\" comment for a moment. Some people may think this film is the definition of \"sap\" as the story progresses. I didn't see it that way. As a Christian, I have seen God turn around impossible situations-so for me, I was thinking \"yeah, God can do that\". So does Giants show us that when the chips are down, all we have to do is pray and things change immediately? Alex Kendrick talks about this in an interview with Christianity Today: \"That's always the first negative comment we get after our test screenings. I'm not a name-it-and-claim-it guy; I think God does allow us to struggle.\" However I understand where Kendrick is coming from when he goes on to say, \"We ended up with our story for two reasons: Number one, we had seen it happen around us. And number two, it's a movie and we wanted people to leave inspired and encouraged.\" We had seen it happen around us. Giants is a reflection of that. If you're like me, you will \"feel good\" at the end of the movie. That's not a bad thing! Go see this movie-and take the kids.",
         "I was invited to preview this movie and took my family with me. Even my youngest son, who is 4, came home reciting the message of the film. If a four year old gets it, I am thrilled to think of how many lives could be changed by going to see it. My children laughed at me because I cried like a baby. It evoked so many different emotions! It has been a long time since a movie has touched me like \"Facing the Giants\" did. The message was awesome and what was more amazing were the non-paid \"servants\" that starred in this film. This movie has the ability to make an amazing impact in this world. To God be the glory!!! I have been telling everyone to go see this movie, you will not regret it.",
         "As a youth pastor I heard good things about this movie. Then I watched it. The acting wasn't the best. That's forgivable. It's the message that's not: Give Jesus your life and everything will change - you'll tackle better, make amazing catches, stop fumbling, start making touchdown passes, and even make the playoffs. All because Jesus magically turns horrible undersized weaklings into All-American athletes. I laughed out loud when a coach quoted scripture to explain to the kicker why he was missing field goals. But wait, that's not all. You'll get a brand new truck, a $6000 raise, and you and your wife's struggle with infertility will suddenly end in pregnancy - twice. THEN you'll win the state championship because God helps a weakling kick the winning field goal 12 yards further than he's ever kicked before - and into the wind, no less - all because \"God wanted him to make it.\" Then you'll win the state championship again the next year. None of this good stuff would have happened if the team hadn't chosen to follow Jesus will all their hearts. Here's what I took away from the movie: God can do anything he wants to do whenever he wants to do it - and it's all about making our lives better, easier, and more enjoyable. He chooses his favorite team and helps them win games. Which bible is this story based on? I'll bet Saint Stephen wished he'd known the keys to such a safe life before he was stoned to death. Someone should have made this movie before 10 of the 11 apostles were killed for following Jesus. It would have saved them all a lot of trouble.",
         "It was an awesome movie. I laughed. I cried. I clapped. I cheered. I smiled! At times, I was on the edge of my seat! The message is truly inspirational. Reminds me a lot of \"Remember the Titans\" but faith-based. The movie stays away from the usual Hollywood hype. It's clean.....no sidetracking on meaningless words, bad language, or other things that detract from the plot or overall movie. They don't shy away from talking about God or praying. It has down-home charm and a feel-good quality. Our family loved it and will go see it again. I recommend it to anyone who wants to be inspired! My kids are already saving to buy it!",
         "I rented this movie because I hoped it would be one the whole family would enjoy. Although the movie is family friendly, my family did not enjoy it because it gives a false view of God. If you obey God and follow Him, you are not guaranteed success. Your football team won't always win. You won't magically get better grades. Infertility isn't always cured. You won't always get a raise. Sometimes, you'll be stuck with the old car. God does not exist to meet our every whim. Rather, we were created to glorify Him. Sometimes we glorify Him most when things seem to be going bad for us. To live is Christ; to die is gain.",
         "I watched this film in youth group, where my otherwise intuitive youth leader and his wife squeed over it. Then some adult couple at a church-related Christmas party misled themselves into giving a copy of this movie to every single family in attendance, and now my household is stuck with the film (though it thankfully still remains in its shrinkwrap). I cried bitter tears over these sad events, and here's why: First off: this film has good intentions, especially if you're a Christian like me. This movie is trying to show that you should put your faith in God and that it'll make your life better. Not so bad, right? Eh. It turns out a be a problem--a big one. This movie was made by a church, so of course every single issue has to be dealt with as tastefully for Christians as possible. It is all black-and-white, no gray areas. God's grace and will in this movie is a predictable thing, and it comes instantly to all those who do His bidding. This is not the God I know. This is not the Christian life I am familiar with. The God I believe in is a powerful and trustworthy God, but He is not one that grants my every wish. I follow Him as best I can, though the going is often hard; yet the football team in this movie finds their humility and self-control a lot easier than anyone should EVER find it. I cannot relate to cardboard cutouts who flip from bad-side to good-side in the course of a few structured movie scenes. And when I DO follow His commandments as laid out in the Bible, I certainly don't find myself showered in blessing as these characters do. The largest of my immediate rewards is knowing that I have done the right thing; everything else comes with long, messy, arduous work. But take the example this movie sets: Grant Taylor coaches the football team at Shiloh Christian school, which has had 6 losing seasons in a row. He may lose his job over it, and he and his wife are low on money as it is. They want a baby, but the doctor tells him he is sterile. Oh, and his car doesn't work. And the boys on his football team are disrespectful to their parents, whiny after their million losses, and bad at kicking field goals. This is sure one rundown community here. But wait, Grant Taylor decides he's going to trust in God for everything! And he passes on his faith to his team. So far, so good. Not for long. As they begin to obey, blessing literally POUR in on them. Suddenly the students stop disrespecting their parents; the school has a big \"revival\"; the team starts winning EVERY game; they even win the grand championship against the hardest team in the league! Coach Taylor's job is reassured; the school gets him a shiny new truck as a present (which, by the way, is the epitome of shallow, fair-weather employers); he gets a raise; his wife (get this) even gets pregnant from his sterile sperm! And that skinny kid manages to kick his first darn field goal right when it really matters!! Wowzers, woot, yay, praise the Lord, etcetera, etcetera!!! ... Yipe. Just YIPE. Nobody in my church has ever experienced Christ in a such a cut-and-dry manner. Yes, there have been miracles aplenty in my family, as well as gifts and creature comforts, and I attribute them to God's grace and lovingkindness. But God isn't some faucet tap that you turn on and off by being good or bad! He is by and large a mystery; His gifts come unexpectedly, often when you think you don't need them but you really do. It's a long, hard slog to the road of fulfillment, and things NEVER turn out the way you thought they would. This movie has good intentions. But because of its supreme shallowness and total escapism, it tanks tremendously to a 1/10. The bad acting and sports movie clichés seem to be mere pimples next to the leprous falsehoods that this movie inadvertently pushes. To all you future churches planning to make a movie: don't be afraid to show REAL life, even you have to add some inconvenient truths into the mix. However much the baser populace is wowed by this cotton candy treat, nobody has learned anything substantial from it. Give us the meat, the bones, the REAL stuff! True life applies to everyone, not just Christians, and that's one aspect \"Facing the Giants\" didn't manage to grasp.",
         "Well, this movie was a shock to see and to hear. Among the thousands of mainline films I have watched over many years, this is the first I've seen with a modern-day story that was unapologetically Christian. It actually used Jesus and God's name as you would hear in a sermon in church. Of course, the fact that \"Hollywood\" didn't make this film is understandable; it was produced, directed, written, etc., by a Baptist church in Georgia. But - surprise - it's available in good quantities at the video stores and actually has the production values of a big-budget Hollywood film. In other words, this looks nice and, for the most part, is adequately acted even though amateurs do the acting. The only one I thought sounded wooden, unfortunately, was Alex Kendrick playing the main character: coach Grant Taylor, the Shiloh Christian High School football coach. Kendrik directed and wrote this film, so kudos to him for all that wonderful work....but an actor, he ain't. Real-life University of Georgia football coach Mark Richt makes a guest appearance and he sounded very relaxed and convincing, as a professional actor would sound. They should have given Richt the main role! Yes, the story is hokey, especially at the end at the last football game, but what Hollywood movie isn't? It's just a little far-fetched to anyone who knows football. At any rate, the action scenes were well-done and very realistic looking. To see a movie with this many inspirational and profound Biblical statements was a \"revelation\" and really nice to see (hear). Hokey or not, there are several moments in this film that should drive most viewers to tears. If not, check your pulse. The main message of the movie: \"All things are possible with God,\" is a good one and one everyone, including Christians, need to be reminded of periodically. Secular people who don't want to hear anything positive about God or the Bible, or who are just plain biased against Christians, will hate this film and wouldn't last 30 minutes watching it. I have a very good friend who is in that category and I couldn't recommend the film to him, because he'd be in the bathroom puking his guts out after a half hour. However, if you are more tolerant, or are a follower Of Jesus Christ, then you will find this film inspiring and emotional and worth your time.",
         "It's interesting how 90% of the high-vote reviews are all comprised of \"*random username*\" from \"United States\" (no state pride??) who all say more or less the exact same thing with the exact same grammatical style and all with the exact same complete lack of taste in movies. I would delve further into this suspicious trend, but alas, this is a review of the movie, and not the reviews themselves. Let me start by saying that I am both a Christian and a true avid movie fan. This means I have seen a great many movies, from good to bad, and can wholeheartedly claim that Facing The Giants is, in fact, NOT a good movie. It has good intentions, but fails to meet many (if any) basic standards that I associate with a quality filmgoing experience. The Acting: Mostly Terrible, Palatable At Best. Hearing that most were apparently volunteers does not at all surprise me. The Dialogue: Clumsy, cheesy, the script comes off as a long version of some cheesy skit you'd see performed in Sunday School or youth group function. The Rave Review Robots revel in the absence of \"meaningless words\", but the cold hard truth is that such words are a part of the real world, and the complete absence of it is palpable. Let's just say the mean ol' head coach of a team in a State Championship game would have a lot more to say than \"OH NO!\" when things are not going his way. The Plot: Mind-bogglingly predictable. It has been commented that this movie is \"not a Hollywood cliché\", and yet it's like it was pulled directly from Making An Underdog Sports Movie For Dummies (including the mandatory quasi-romantic subplot for the ladies) and just had a Christian-themed coat of paint slapped on it. I'm not lying or bragging when I say I had almost every major detail in both the plot and subplot pegged immediately upon their inception. Only someone who has never seen a decent sports movie in their whole life would be emotionally stirred by the story presented here. The Directing/Editing: It, too, was patterned almost exactly after the generic Underdog Sports Movie template. Still, acting aside, there weren't many noticeable goofs, so at least Facing The Giants was technically competent. The Message: Ask Jesus and He will grant all your wishes. Part of me hoped that this movie would end in the team's eventual defeat to really emphasize the whole \"If we lose, we praise You\" part, because in the Real World, you WILL fail at one point or another and it's good to be prepared for that. But in the world of Facing The Giants, if you fail, clearly someone either screwed up or is cheating. Another interesting question being, what if the Eagles came across another team that had gotten religion? Would they be caught in an endless loop of miraculous plays and last-minute saves, or would the universe simply have exploded? The Bottom Line: For the hardcore conservative Christian Parents crowd lamenting the evils of Hollywood, Facing The Giants will be another mediocre-at-best Christian film to hold up on a pedestal as the preferred model for modern film-making. For everyone else, the effects will range from boredom to a burning desire to be watching something else. And a warning: Any attempt to show this to non-Christians will lead not to conversion, but to derision. I give this two stars, one for the one scene that did not have me rolling my eyes, and another for basic technical proficiency on a low budget.",
         "This movie touched every emotion: joy, sadness, anger, confusion, peace, humor...but most of all HOPE that is found in Christ alone! People in the theater interrupted the movie with applause, MUCH laughter and most cried at some point! An incredible and exhilarating story of hope! It is incredible to realize that this first-class movie that is so well-done was birthed and produced by a church in south Georgia!! If you know someone who is struggling against the giants we face in life, or a couple who is struggling to make ends meet, or struggling to have a child, or just someone who needs to be encouraged, GET THEM TO THIS MOVIE! We need MORE movies like this! Buy some tickets and give them away...you can affect a life or a family FOREVER!!! My church has committed to buy 1,000 tickets! We are GIVING FREE tickets to every varsity football player and coach in our area! I challenge others to do the same in YOUR area. Spread the word! This film is a MUST-SEE!"
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Carmel Entertainment",
         "Destination Films",
         "Provident Films"
      ],
      "summaries": [
         "An action-packed drama about a Christian high school football coach who uses his undying faith to battle the giants of fear and failure. In six years of coaching, Grant Taylor has never led his Shiloh Eagles to a winning season. After learning that he and his wife Brooke face infertility, Grant discovers that a group of fathers are secretly organizing to have him dismissed as head coach. Devastated by his circumstances, he cries out to God in desperation. When Grant receives a message from an unexpected visitor, he searches for a stronger purpose for his football team. He dares to challenge his players to believe God for the impossible on and off the field. When faced with unbelievable odds, the Eagles must step up to their greatest test of strength and courage. What transpires is a dynamic story of the fight between faith and fear.",
         "A losing coach with an underdog football team faces their giants of fear and failure on and off the field to surprising results."
      ],
      "budget": 100000
   },
   "movielensId": 48711,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-09-29",
      "dvdReleaseDate": "2007-01-30",
      "directors": ["Alex Kendrick"],
      "runtime": 111,
      "movieId": 48711,
      "title": "Facing the Giants",
      "mpaa": "PG",
      "actors": [
         "James Blackwell",
         "Alex Kendrick",
         "Shannen Fields",
         "Chris WIllis",
         "Tracy Goode"
      ],
      "imdbMovieId": "0805526",
      "originalTitle": "Facing the Giants",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ucMh_yldxs0"],
      "plotSummary": "A losing coach with an underdog football team faces their giants of fear and failure on and off the field to surprising results.",
      "tmdbMovieId": 18925,
      "avgRating": 3.60759,
      "releaseYear": "2006",
      "numRatings": 158,
      "posterPath": "/dHh6Bw9LsUYAPv5CsSCp5JF8tHx.jpg"
   }
}