{
   "tmdb": {
      "original_language": "nl",
      "keywords": [],
      "imdb_id": "tt0209037",
      "video": false,
      "title": "Everybody's Famous!",
      "recommendations": [
         162503,
         69333,
         48523,
         167707
      ],
      "backdrop_path": "/iOsvhOimYlKhUWIxMugxn83JlWZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Jean Vereecken",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba15",
               "name": "Josse De Pauw",
               "profile_path": "/rp7vwOXLGV49LkOf8dmDTb2feo9.jpg",
               "id": 222942,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Marva Vereecken",
               "gender": 1,
               "credit_id": "52fe4978c3a36847f819ba19",
               "name": "Eva van der Gucht",
               "profile_path": "/z8Vk9ND15Eo7Cs0wqXLHKFKX6lY.jpg",
               "id": 228589,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Willy Van Outreve",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819ba1d",
               "name": "Werner De Smedt",
               "profile_path": "/eV99hTuZV81tmXkt9vLa2Tpnz27.jpg",
               "id": 92710,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe4978c3a36847f819ba21",
               "name": "Thekla Reuten",
               "profile_path": "/zC8oCopvNG2kFW2YtaGlK4ZEIe6.jpg",
               "id": 45749,
               "order": 3
            },
            {
               "cast_id": 31,
               "character": "Michael Jensen",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819ba5d",
               "name": "Victor Löw",
               "profile_path": "/2ZShNwD5taEOy7aT0DrdAU4MLrs.jpg",
               "id": 1241993,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Chantal Vereecken",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba25",
               "name": "Gert Portael",
               "profile_path": null,
               "id": 228603,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Gaby",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba29",
               "name": "Ianka Fleerackers",
               "profile_path": null,
               "id": 221652,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Lizzy",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba2d",
               "name": "Alice Reys",
               "profile_path": "/hsez7V4GovprvM3AgOWIqqzfPh3.jpg",
               "id": 145589,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Knappe man",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819ba31",
               "name": "George Arrendell",
               "profile_path": "/8pzhkIuvlzi8gabYYBrbQtbgO0k.jpg",
               "id": 228604,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "NTO directeur",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819ba35",
               "name": "François Beukelaers",
               "profile_path": "/dPjQNCKLbC0Fx3RyPzmG2zigYrh.jpg",
               "id": 76286,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Omroepster",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba39",
               "name": "Silvia Claes",
               "profile_path": null,
               "id": 228605,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Cameraman",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba3d",
               "name": "Marc Didden",
               "profile_path": "/qQX6YxUxi5IS82iO89DTDBA0nw4.jpg",
               "id": 148764,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Debbies buurvrouw",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba41",
               "name": "Sien Eggers",
               "profile_path": "/xWEfTIfkZf2SJgK4JZJTdVDlohr.jpg",
               "id": 73382,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Vriendin van Marva's moeder",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba45",
               "name": "Lut Hannes",
               "profile_path": null,
               "id": 228606,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Rik De Visser",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba49",
               "name": "Wim Opbrouck",
               "profile_path": "/2O7lhlXgxWge6zDDQ48e5YvHVH0.jpg",
               "id": 222922,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Rijkswachter",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819ba4d",
               "name": "Filip Peeters",
               "profile_path": "/sHLGYgP1RvZPFnkP2pwO0vASsL5.jpg",
               "id": 44366,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Jim Poppe",
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819ba51",
               "name": "Mathias Sercu",
               "profile_path": "/1bQa1HRyBnok5O738u6My2mLqMm.jpg",
               "id": 91718,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "Nieuwslezeres",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba55",
               "name": "Myriam Thys",
               "profile_path": null,
               "id": 228608,
               "order": 17
            },
            {
               "cast_id": 30,
               "character": "Nieuwslezer",
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba59",
               "name": "Bert Van Nieuwenhuyse",
               "profile_path": null,
               "id": 228609,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4977c3a36847f819b9d5",
               "name": "Dominique Deruddere",
               "profile_path": null,
               "id": 69912,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4977c3a36847f819b9db",
               "name": "Dominique Deruddere",
               "profile_path": null,
               "id": 69912,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4977c3a36847f819b9e1",
               "name": "Willy Stassen",
               "profile_path": null,
               "id": 13503,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4977c3a36847f819b9e7",
               "name": "Pascal Judelewicz",
               "profile_path": null,
               "id": 228581,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4977c3a36847f819b9ed",
               "name": "Loret Meus",
               "profile_path": null,
               "id": 228582,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4977c3a36847f819b9f3",
               "name": "Errol Nayci",
               "profile_path": null,
               "id": 228583,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4977c3a36847f819b9f9",
               "name": "Volkert Struycken",
               "profile_path": null,
               "id": 228584,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba05",
               "name": "Nico Leunen",
               "profile_path": null,
               "id": 54260,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4978c3a36847f819ba0b",
               "name": "Ludo Troch",
               "profile_path": null,
               "id": 19989,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4978c3a36847f819ba11",
               "name": "Elly Verduyckt",
               "profile_path": null,
               "id": 228588,
               "department": "Crew",
               "job": "Script"
            },
            {
               "gender": 0,
               "credit_id": "56045dec92514122c3005849",
               "name": "Anne-Dominique Toussaint",
               "profile_path": null,
               "id": 53433,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.220218,
      "production_countries": [{
         "iso_3166_1": "BE",
         "name": "Belgium"
      }],
      "id": 58886,
      "vote_count": 10,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "Iedereen Beroemd!",
      "runtime": 97,
      "poster_path": "/uzJ4WF2X39xJLXpnMkPZp1iE8BD.jpg",
      "spoken_languages": [{
         "name": "Nederlands",
         "iso_639_1": "nl"
      }],
      "production_companies": [],
      "release_date": "2000-04-12",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dominique Deruddere"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Dominique Deruddere"],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0209037/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxNjU5MTc5Nl5BMl5BanBnXkFtZTcwMzcxNTAyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Josse De Pauw, Eva van der Gucht, Werner De Smedt | See full cast and crew »"],
      "reviews": [
         "This film was reccomended to me by some Belgian people I talk to on the net, they said it was one of the best to come out of their country so I decided to check it out. All in all, I have to say that I really enjoyed it. It's not entirely original, but what it lacks in originality, it makes up for with it's ability to charm and entertain. I don't want to give away too much of it, but the story mainly revolves around fame and the desire to achieve it. Of course, it's always much harder for some, more so than others; mainly those who aren't blessed with the looks, or all of the talent. \"Everybody's Famous\" is one of those rare, truly \"feel good\" films that don't come around too often. Hollywood often tries to make films like this, but often fall flat by making it too cutesy. One thing I don't understand about this movie is how it ever got rated \"R\"... were the ratings board members drunk or asleep the day they rated this movie? There's no bad language in it, and only a brief amount of (non-explicit) nudity. So, if you're wondering if it's appropriate for the younger crowd, I would definately reccomend it for them; it should've been rated PG-13. The bottom line is, if you appreciate charming, feel-good flicks about the various struggles in life, then you'll love this. It was also nice to see that this film was nominated for an Academy Award in 2001 (Best Foreign Language Film).",
         "I was in a very down mood when I went out, and this film turned me right around! Sweet and silly, (but not cloying or obviously sentimental) this film is very-well built beneath its light profile. I'm very impressed with the many decisions that must have been made to result in a film this subtle, well-balanced and delightful. Plot and characters seemed familiar at first but the film almost immediately distinguished itself with well-observed, small details of character and setting; unexpected and delightfully absurd plot twists; and the excellent, natural performances by all. All the characters had charm and a subtle full-dimensionality that's particularly refreshing these days in comedies... from the central family members --Father, Marva, Mother-- down to even the smallest roles that function like seasoning (like the bartender, and the stone-faced assistant to debbie's manager.) Characters that might have been left as stereotypes in other films (like Willy, Debbie, and her manager) surprised me with more complex -- but still believable -- behavior later in the story. Unobtrusive editing and appropriately bright/naturalistic visual aesthetic and cinematography make for an easy, pleasurable viewing experience that has left me with plenty to replay in my mind. US viewers who haven't traveled in Europe may not \"get\" the pop-music industry/TV details portrayed, and I'm sure there are cultural in-jokes that I missed, but I was never less than fascinated from start to finish.",
         "Dominique Deruddere has managed to uncover the flemish spirit with 'Iedereen beroemd!'. The actors do a great job and the story is very touching. 'Iedereen beroemd!' ranks very high among my all-time favorite belgian movies! a must-see for anyone who is in the mood for a charming tale of the love between a father and a daughter and the dreams they both have. Simply brilliant!",
         "When I saw this movie in avant-première, I had never heard of it before. But it soon swept me away. At first the story develops a bit like a Flemish version of \"The Commitments\" or \"The Full Monty\", but soon, the plot thickens. The second half of the movie is a great mix of action, TV-coverage of this action and comments on this coverage that can rival with \"Natural Born Killers\". When leaving the theater you know that news doesn't happen, it's made by the media and big producers. All the while, there is still more than enough room for good character-development and humor. And by avoiding situations which are too Belgian or Dutch to be understood by others, the story can be fully enjoyed by everybody, making this a production that isn't dwarfed by big international productions.",
         "I saw this at the Seattle International Film Festival with subtitles. Anyone that has seen \"The Full Monty\" will recognize themes here. 1. Industry screws over the worker. 2. Worker hatches wacky scheme to redeem himself and save his family and hopefully make lots of money. 3. Worker recruits hapless former co-worker to help with the wacky scheme. The new twist is that the father is obsessed with his daughter becoming a singing star. To this end, he kidnaps Belgium's top pop star and as ransom demands that his new song be performed on National TV, preferably with his daughter singing it. It's a fluffy piece but thoroughly enjoyable. Just like \"The Full Monty\" you're cheering for everyone in the end.",
         "\"Iedereen beroemd\" isn't Deruddere's best movie (check out \"Crazy love\" to see that) but it was nominated for an Oscar and that already is a great historyfact in Belgian moviemaking. Deruddere is the sort of leading new wave directors over here as since decades most Belgian movies are just adaptions from old Belgian novels but with this movie Dominique can claim that he reached the brilliance of Ken Loach... What we get here is laughing with the common people... A simple father (superbly played by Josse De Pauw) believes in his overweighted daughter that one day she will be famous (the girl cant sing and at local contests she tries to imitate Madonna). We all see it's a lost case till Jean (Josse De Pauw) decides to kidnap Belgium's most fave singer...he asks no money but the manager must write a hittune for his daughter... Hilarious at times, unbelievable at others but this is great to see.",
         "\"Everybody becomes famous\" I saw this movie in a sneak preview. When its title came on the screen, I had something like 'oh no, not a Flemish movie' You bet I was surprised at the end of the movie. It was a great film with enormous charming capacities. The story is about a young girl, wanting to start a career as a singer. Pushed by her father, she tries to win one of the local soundmix-competitions. Unfortunately, she isn't that much of a beauty. When her father loses his job in the local bottle-factory, he decides to take some serious action to launch his daughter to the top of the Flemish show-business. This movie is charming, charming, charming and I really enjoyed it... A must see.",
         "Jean is an obsessed man. He insists that his daughter is talented and pushes her to enter talent contests. He also is deluded into thinking he's a song writer. He has no talent at all as a song writer and Marva is not particularly attractive or the sort to find stardom. While she has a nice voice, it's not one to make her famous and she and her father insist in her singing WAY outside her range--such as doing Madonna covers. Yet, despite losing the contests repeatedly, Jean insists on spending money he doesn't have to make her a star. When he loses his job, Jean does not tell his family but pretends to go to work. He also tells his young friend that he'll come up with a solution. And, as luck has it, he has a chance meeting with an up and coming famous singer. On the spur of the moment, he gives her sleeping pills and is going to hold her for ransom. However, it's not money he wants but a chance at fame. In many ways, this film is like a reworking of the film \"The King of Comedy\". In this film, Rupert Pupkin has deluded himself into believing he's a great comedian but when he is repeatedly rebuffed in his attempts to get on a show like \"The Tonight Show\", he and his goofy friend kidnap the host and force them to put Rupert on TV. Here, Jean has similar ideas when he kidnaps the young star--to force her agent to put his daughter on TV singing his song. Will it work out? And, what will happen when the kidnapped star falls in love with Jean's friend? And, what sort of nefarious plot is the agent hatching? Obviously there are a lot of unexpected plot twists awaiting you if you see \"Everybody's Famous!\". Fortunately, while the film is very much like \"The King of Comedy\", it offers enough differences that you can enjoy both films. About the only part of the film that I didn't like was the reaction from the police late in the film. It seemed to make little sense. Still, a cute film that is easy to like--perhaps a bit easier than \"The King of Comedy\"--though also not as original nor quite as good.",
         "... but of course it's much more than that. it's a story about family, love, and the media. and even if you think this sounds pretty horrible, it must be said that all these topics are treated in a very unique way. everything's over the top, certainly, but one still believes the characters, their problems, the way things get out of control. even though the freddie mercury impersonator really must be from another planet... the whole design of the film might be reminiscent of movies like muriel's wedding (you know the deal: ugly people + glitter= everyone is special), but it still has a soul of its own. 8/10",
         "'Iedereen beroemd' is a great movie about life's ambitions, ALTHOUGH being a Belgian makes it extra fun to watch, the general message is universal for all audiences. That the quality was observed by the selection committee for the Oscar of 'Best Foreign Film' surprised me a tiny bit. Actors and actresses are a mix of Dutch and Belgian people, quite interesting."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Canal+",
         "Eurimages",
         "Flanders Film Fund"
      ],
      "summaries": ["Jean is a family man and factory worker who dreams of becoming a songwriter. Pinning his hopes on his teenage daughter, Marva, he takes her to singing contests in which the awkward and overweight girl struggles to belt out a tune. When Jean is suddenly fired because of cut backs, he is ashamed and even more desperate to have his daughter succeed. In a chance meeting Jean kidnaps the most famous pop star in the country and holds her hostage demanding to be heard by the music industry. Catching the attention of the media and the eyes of the nation, Jean and Marva realize that the show must go on until everyone is famous."],
      "budget": 0
   },
   "movielensId": 4926,
   "movielens": {
      "languages": ["Nederlands"],
      "releaseDate": "2000-04-12",
      "dvdReleaseDate": "2001-11-13",
      "directors": ["Dominique Deruddere"],
      "runtime": 97,
      "movieId": 4926,
      "title": "Everybody's Famous!",
      "mpaa": null,
      "actors": [
         "Josse De Pauw",
         "Eva van der Gucht",
         "Werner De Smedt",
         "Thekla Reuten",
         "Victor Löw",
         "Gert Portael",
         "Ianka Fleerackers",
         "Alice Reys",
         "George Arrendell",
         "François Beukelaers",
         "Silvia Claes",
         "Marc Didden",
         "Sien Eggers",
         "Lut Hannes",
         "Wim Opbrouck",
         "Filip Peeters",
         "Mathias Sercu",
         "Myriam Thys",
         "Bert Van Nieuwenhuyse"
      ],
      "imdbMovieId": "0209037",
      "originalTitle": "Iedereen Beroemd!",
      "genres": [
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 58886,
      "avgRating": 3.18056,
      "releaseYear": "2000",
      "numRatings": 72,
      "posterPath": "/uzJ4WF2X39xJLXpnMkPZp1iE8BD.jpg"
   }
}