{
   "tmdb": {
      "original_language": "hu",
      "keywords": [
         {
            "name": "berlin",
            "id": 220
         },
         {
            "name": "berlin wall",
            "id": 292
         },
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "cold war",
            "id": 2106
         },
         {
            "name": "secret intelligence service",
            "id": 3272
         },
         {
            "name": "defection",
            "id": 155460
         },
         {
            "name": "swinging 60s",
            "id": 155762
         },
         {
            "name": "east germany",
            "id": 156026
         },
         {
            "name": "harry palmer",
            "id": 156598
         }
      ],
      "imdb_id": "tt0060437",
      "video": false,
      "title": "Funeral in Berlin",
      "recommendations": [
         4889,
         15247,
         46041,
         35201,
         21489,
         11605,
         13580,
         23518,
         4918,
         30941,
         20540,
         42541,
         42738,
         29715,
         22522,
         42668,
         12239,
         32088,
         42700,
         42703
      ],
      "backdrop_path": "/kbUwa5n0G9FDYqYEcnUdjgpvsVH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Harry Palmer",
               "gender": 2,
               "credit_id": "52fe45639251416c9103077b",
               "name": "Michael Caine",
               "profile_path": "/vvj0JMSFpOajXCE46Hy4dyqSP2U.jpg",
               "id": 3895,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Johnny Vulkan",
               "gender": 2,
               "credit_id": "52fe45639251416c9103077f",
               "name": "Paul Hubschmid",
               "profile_path": "/zjihlx3YoByIQZjAOUupIpi9Hnj.jpg",
               "id": 118861,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Colonel Stok",
               "gender": 2,
               "credit_id": "52fe45639251416c91030783",
               "name": "Oskar Homolka",
               "profile_path": "/jhKFc29QjUTfgqNMQqpAO79swQq.jpg",
               "id": 29661,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Samantha Steel",
               "gender": 0,
               "credit_id": "52fe45639251416c91030787",
               "name": "Eva Renzi",
               "profile_path": "/vDYKDyJtyX0wyjk1L48a2YUllvD.jpg",
               "id": 129431,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Ross",
               "gender": 2,
               "credit_id": "52fe45639251416c910307b5",
               "name": "Guy Doleman",
               "profile_path": "/iHIzzV6Bdk8RRB1VCROVRpFJRqZ.jpg",
               "id": 9923,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Hallam",
               "gender": 2,
               "credit_id": "52fe45639251416c910307b9",
               "name": "Hugh Burden",
               "profile_path": "/4z3dk7kMl6Ggnl9ZtAadGTxrij0.jpg",
               "id": 104658,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Aaron Levine",
               "gender": 0,
               "credit_id": "52fe45639251416c910307bd",
               "name": "Heinz Schubert",
               "profile_path": "/kwWF0PLivqPqYaIWccy5w8o3ymZ.jpg",
               "id": 17568,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Werner",
               "gender": 2,
               "credit_id": "52fe45639251416c910307c1",
               "name": "Wolfgang Völz",
               "profile_path": "/2rTiOlV1tRFt1dz6C3BRRn75IIs.jpg",
               "id": 17266,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Reinhardt",
               "gender": 2,
               "credit_id": "52fe45639251416c910307c5",
               "name": "Thomas Holtzmann",
               "profile_path": "/blpwBv01QMOSBmKq411K7wXwKIM.jpg",
               "id": 237033,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Kreutzman",
               "gender": 2,
               "credit_id": "52fe45639251416c910307c9",
               "name": "Günter Meisner",
               "profile_path": "/ratLVv6yrmsyViUECpBGWKaY78r.jpg",
               "id": 3617,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Artur",
               "gender": 2,
               "credit_id": "52fe45639251416c910307cd",
               "name": "Herbert Fux",
               "profile_path": "/eDIlDlMJ5n438aOPwmO1aTVGoNG.jpg",
               "id": 22531,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Benjamin",
               "gender": 0,
               "credit_id": "52fe45639251416c910307d1",
               "name": "Rainer Brandt",
               "profile_path": null,
               "id": 32587,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Monica",
               "gender": 0,
               "credit_id": "56bf350a925141460100263e",
               "name": "Ira Hagen",
               "profile_path": null,
               "id": 1196773,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 1,
               "credit_id": "593a8af49251411eed00c3dc",
               "name": "Marthe Keller",
               "profile_path": "/vJS0w1lz2YKyfyKd7Iz925bt5WB.jpg",
               "id": 25282,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45639251416c91030777",
               "name": "Guy Hamilton",
               "profile_path": "/nfpwznE0b2NMgoPRsgJoNkRAETD.jpg",
               "id": 9915,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45639251416c9103078d",
               "name": "Len Deighton",
               "profile_path": null,
               "id": 39811,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe45639251416c91030793",
               "name": "Evan Jones",
               "profile_path": null,
               "id": 131506,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45639251416c91030799",
               "name": "Charles D. Kasher",
               "profile_path": null,
               "id": 237031,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45639251416c9103079f",
               "name": "Harry Saltzman",
               "profile_path": null,
               "id": 9863,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45639251416c910307a5",
               "name": "Konrad Elfers",
               "profile_path": null,
               "id": 47087,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45639251416c910307ab",
               "name": "Otto Heller",
               "profile_path": null,
               "id": 29893,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45639251416c910307b1",
               "name": "John Bloom",
               "profile_path": null,
               "id": 6491,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 3.056417,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 34388,
      "vote_count": 41,
      "budget": 0,
      "overview": "Colonel Stok, a Soviet intelligence officer responsible for security at the Berlin Wall, appears to want to defect but the evidence is contradictory. Stok wants the British to handle his defection and asks for one of their agents, Harry Palmer, to smuggle him out of East Germany.",
      "similar": [
         582,
         15247,
         253,
         714,
         27576,
         646,
         657,
         708,
         341013,
         49517,
         691,
         1247,
         2502,
         954,
         213,
         658,
         667,
         668,
         699,
         296098
      ],
      "original_title": "Funeral in Berlin",
      "runtime": 102,
      "poster_path": "/mtYQLTBTMnPQ7SI1bgZtFnWU4Qd.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Lowndes Productions Limited",
            "id": 1802,
            "origin_country": ""
         }
      ],
      "release_date": "1966-12-22",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": "/zOeny02J2PgaZLSydAUDfHPVRVu.jpg",
         "name": "Harry Palmer Collection",
         "id": 89188,
         "poster_path": "/5ahb9zZaEqW4BqBoG2mKZNP1pXO.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Guy Hamilton"],
      "runtime": 102,
      "synopsis": "Berlin in the 1960s is a city divided between Cold War lines with inhabitants of the Communist East trying to escape to the West. Even with the infamous Berlin Wall these escapes are common and successful. Colonel Stok (Oskar Homolka), the head of intelligence in Russia's Berlin section and the one responsible for preventing escapes over the Wall, contacts British Intelligence and informs them that he wants to defect to the West. British spy Harry Palmer (Michael Caine) is sent to West Berlin to find out if Stok's offer is genuine and arrange his escape. Palmer was once involved in black market dealings in Berlin and was given the choice of joining British Intelligence or going to jail. Returning to the city, he is re-united with his old associate, German national Johnny Vulkan (Paul Hubschmid), who also works for Palmer's superior Colonel Ross (Guy Doleman). Vulkan arranges for Palmer to go to East Berlin to meet Colonel Stok. In exchange for his co-operation with the British, Stok requests a meagre stipend, a house in the country and his escape must be carried out by Kreutzmann (Günter Meisner), a Berlin gangster responsible for the most successful escapes. Stok claims that Kreutzmann's escapes have lead his department to be investigated and that he must get out before things turn nasty. Returning to West Berlin, Palmer is picked up by a beautiful young woman called Samantha Steel (Eva Renzi), who invites him to a party but instead takes him to her flat for drinks, dinner and presumably more as Palmer is next seen leaving her place in the morning. Not taken in by Samantha's charms, Palmer hires a burglar to search her apartment to figure out who she really is. The thief discovers a number of passports of various nationalities under different variations of her name and a little black book in her safe which lists names of men next to million-dollar figures. Returning to his hotel room, Palmer finds that it too has been ransacked. Palmer negotiates an arrangement with Kreutzmann without revealing the details of the one whom the British want to get across the Wall. As part of his payment, Kreutzmann demands a set of identity papers. Palmer tests Stok in order to determine how sincere he is about defecting. The test seems conclusive and Palmer returns to London. From Hallam (Hugh Burden), the documents manager back at MI5, Palmer receives documents in the name of Paul Louis Broum. As he places the envelope in his briefcase for return to Berlin, he notices the same name on the photocopy of Samantha's little black book, with the figure $2,000,000 next to it. Palmer returns to Samantha and makes a point of letting her see the envelope with Broum's name. Dropping all pretence, she admits that she is an Israeli agent. Broum is a Nazi war criminal who stole millions from the Jews during the war and hid it in a Swiss bank account. The Israelis need the papers in order to reclaim the money. Although she threatens to kill him, Palmer refuses to give her the documents since he needs them to pay Kreutzmann. Kreutzmann and his men murder an elderly East Berliner whose body is claimed by a relative in the West - actually someone employed by Kreutzmann. A body transfer is arranged but as the hearse makes its way from the morgue to the checkpoint, it is hijacked by Kreutzmann's men and replaced with another which contains a different coffin. The coffin is taken to West Berlin and delivered to an abandoned warehouse where Palmer and his associate Vulkan are waiting. But when the coffin in opened it is found to contain the dead body of Kreutzmann! Stok's whole defection was simply a bluff to lure Kreutzmann out and put an end to the escapes he so brilliantly organised. Although well informed, he and his men never knew in advance that Stok was the intended client. Before Palmer can get away from Kreutzmann's outraged accomplices, he is knocked unconscious by Vulkan who gets hold of the Broum documents only to be held up by Samantha and two other Israeli agents who take away the papers. Vulkan tells Palmer that he was knocked out by another of Kreutzmann's men. They then go to a safe house where British officials are waiting to debrief Stok. Stok of course is not there, meaning that a lot of valuable time and money has been wasted. Palmer's boss, Colonel Ross, is also present and Palmer tells him about the Broum documents. Ross was unaware that they were being used as part of the deal with Kreutzmann. He then reveals to Palmer that towards the end of the war, Paul Louis Broum, a guard at a concentration camp, murdered a resistance fighter called Johnny Vulkan and assumed his identity. Ross got hold of the documents and used them to blackmail Broum into working for him. Now that the documents are missing, Ross has nothing with which to keep a hold on Broum/Vulkan and cannot risk him defecting. He therefore orders Palmer to kill Broum. Palmer won't kill anyone in cold blood and allows Broum/Vulkan to get away. Back in West Berlin, Palmer meets Stok who is over for a routine meeting with his Western counterparts. The affable Russian confirms that his supposed defection was just a trap to get rid of Kreutzmann. He and Palmer even joke about the latter himself defecting to the East; Stok advises: \"If you need to get out in a hurry, ask Vulkan. He knows the way.\" Meanwhile, Broum/Vulkan goes to Samantha's flat, murders an Israeli agent and gets the documents back. He then meets Hallam, the Intelligence official who gave Palmer the Broum documents in London. However, the documents that they now have are in fact forgeries made by one of Palmer's underworld Berlin contacts. Hallam goes to Palmer, saying that he has been sent by Ross to get the real documents back. Palmer never believed Hallam's claim that he selected the Broum documents at random and forces him to admit that he is in league with Broum: they took advantage of the situation to get the documents out of London and now intend to use them in order to claim the Nazi loot that Broum deposited in the Swiss banks. Palmer and Hallam go to a quiet part of the Berlin wall through which Broum and Hallam intend to slip into the East and thus to Switzerland, but Broum kills Hallam and makes away with the documents. However he is subsequently killed by the Israeli agents who were tailing Palmer. Palmer lets them take the genuine Broum documents. When Vulkan's body is discovered, Ross is satisfied that he will just be another martyr shot while escaping to the West. Palmer however turns down Ross's offer of a bonus for his work and leaves. By the time of the next film, Billion Dollar Brain (1967), Palmer has resigned from British Intelligence.",
      "writers": [
         "Len Deighton",
         "Evan Jones"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0060437/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNjAzNjI3MV5BMl5BanBnXkFtZTcwMDc0NzQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Caine, Oskar Homolka, Paul Hubschmid | See full cast and crew »"],
      "reviews": [
         "\"The Ipcress File\" introduced us to Harry Palmer, the anti-James Bond. This movie is even better than the first. Both are based on novels by Len Deighton, who rivals John LeCarre as the most sophisticated thoughtful spy novelists. Michael Caine's Palmer has a cockney accent, avoids fights, can't afford the finer things in life, has no fancy cars or technological gimmicks. What he has is the brain to figure who's triple crossing all the double crossers in Cold War Berlin's espionage underground. It helps that all the other characters underestimate him. This movie is sharp, intelligent, and unsentimental. It ranks with the very best spy movies ever made. Outstanding.",
         "I personally think that Funeral In Berlin is a great film and far better than the previous Ipcress File which generally gets the credit as the best of Len Deighton's Harry Palmer novels to make it to the big screen. Caine is excellent as the stiff but smart east end spy. The underlying suggestion that Palmer possesses the superior intellect to his privately educated 'superiors' gives the scenes for example between Palmer and Ross the added edge of annoyance on the part of Ross and frustration and arrogance born of frustration from Palmer. The hard edged 'real life'(compared to Bond) atmosphere give the film it's sense of believability through all of it's complex plot turns. The camera work is excellent with some beautifully framed scenes that have thus far not received the credit they deserve. Homolka as Stock is a particularly excellent characterisation and the whole affect of cameras and the first appearance of Stock remind me greatly of Welles introduction as Harry Lime. The whole film is very much of it's time but as such has not lost any of it's fascination. Definitely one of my favourites.",
         "based on Len Deighton's outstanding novel, this sequel to \"The Ipcress File\" features Michael Caine once again as the the anti-James Bond British spy, Harry Palmer. Palmer wears thick glasses, dresses in a cheap rain-coat, has a cockney-accent, and cultivates an aura of being not too bright. Of course, he is the only one who can keep track of the double-, triple-, and quadruple crosses in a Berlin where Brits, Americans, Israelis, Russians, and East Germans are all pursuing different goals. Even Palmer's superiors in the Secret Service are pursuing different goals. The plot is complex, but rewards close attention. Caine is pitch-perfect as Palmer, and spy stories just don't get any more bleak and cynical. A very superior movie.",
         "This is my favourite of the three Harry Palmer films (I don't count the 90s remake.) This film is accurately done and goes at a sensible pace \u0096 however, those people looking for computerised special effects and exploding cars are watching the wrong film. The plot is really good and makes absolute sense \u0096 if you follow it closely. There is also the wonderful dry wit between Palmer and his commanding officer. Palmer: I didn't pick her up; she picked me up. Ross: Well you'd have to say that to get it on expenses. Also, you should watch this in widescreen \u0096 there are some subtle details, which are left out at the edge of the screen. Including the subtle way in which Sam first picks up Harry at the hotel. However, unlike most \"Spy\" films we are not subjected to the obligatory soft porn sequence. Listen carefully for the references to Suvorov \u0096 a Russian general, part of the priceless banter between Palmer and the Russian who wants to defect. They don't make films like this anymore \u0096 simply because they don't write books like this anymore. This was Len Deighton and it is first class.",
         "As some other reviewers have opined, this is the best of the three Harry Palmer movies set in the '60s. Michael Caine's cavalier attitude coupled with his witty, sarcastic banter is most refreshing. All the stodgy bureaucratic types get bum-rushed by Harry Palmer's rapier tongue. His self deprecating humor, especially in some of the scenes with Samantha Steele (Eva Renzi), is refreshing, since she has the pertness and sense of humor to complement those scenes deftly. Similarly, the scenes with Col. Stock show great flashes of sarcastic wit, juxtaposed with attending to the serious Cold War business at hand. But the more serious fun is the wonderfully executed plot development, interweaving the various characters such as Johnny Vulcan, Col. Stock, Hallam, Ross (the boss), Kreutsmann, Steele, etc. into a menagerie of complicated intrigue. I'll let others offer a plot synopsis: I'll just say the film keeps you guessing and wondering throughout its hour and forty-five minutes. The overall style of mixing mordant anti-establishment humor and complicated intrigue reminds me of a later film, \"The Russia House\", with Sean Connery, an equally satisfying Cold War drama. The only knock I have on this film is the sometimes obtrusive sound track, where the trumpets blare much too loudly to proclaim a given dramatic occurrence. Could have been done a little more tastefully. All in all, a \"must see\" for Cold War movie fans!",
         "There are a number of interesting spy novels involving British Agents, which were written by Len Deighton, but the most popular ones involves international spy Harry Palmer (Michael Caine) . That is because unlike 007, Harry is a 'thinking man's James Bond.' If you watch the movie, you'll see the reason for such a statement. Take for instance this offering \" A Funeral in Berlin \" is the tale of spy vs spy. During the era of the Cold War, each side (East and West) was endeavoring to gain an upper hand in the war of intrigue. The Berlin Wall or Iron Curtain separated Germany and each side sought to exploit the other side's weaknesses. Many East Germans were seeking to cross the 'wall' any way they could. To fail meant death. Harry Palmer is sent by his boss, Col. Ross (Guy Doleman) on what Harry believes is a fool's errand. A high ranking Russian Official, Colonel Stok KGB (Oskar Homolka) seeks to defect and needs Harry's help. His German friend, Johnny Vulkan (Paul Hubschmid) reassures harry of his mission as does Eva Renzi (Samantha Steel) an Isreali spy. All seems above board, but Harry is no fool and takes precautions to insure his own life. What transpires is nothing short of fine drama and the result is the foundation for Classic status. ****",
         "Funeral in Berlin, in my view, remains the best of the 3 Harry palmer films. Dispensing with the mandatory 60's 'brainwashing'and over-played 'spy' sequences of the Ipcress file. Funeral in Berlin benefits greatly from being shot on location, adding to the authenticity and nervy cold war tension of the original novel. (Actually at least 2 other sub-plots are ditched to save on running time & viewer brain fatigue)The plot, although condensed, remains coherent and totally logical. For anyone wanting explosions, car chases and all the other dreary staples of the 'spy thriller' - forget it. Harry Palmer travels to see his boss on a bus and only receives a gun (at his request) over half way through the film! Watch it for atmosphere, razor-sharp dialogue and a great in-joke regarding Lownbrau beer... Michael Caine is at his world-weary best and supported by a fine cast, all adding to arguably the most 'authentic' spy film of the 60's. as for Billion dollar brain- Have you ever seen it? Listen to the theme tune & turn off!!",
         "Questionably the best Spy Film From the '60s, undoubtedly the best of the Harry Palmer Series. Michael Caine is convincing as the reluctant hero who is only there through obligation and not pride and as a result is more believable than Bond.",
         "Reluctant spy and disgraced army sergeant Harry Palmer gets sent to Berlin to encounter a Russian general that says he wants to defect - but does he? The success (and continued success) of the Ipcress Files lead to this very solid and very good (if complicated) follow-up which seems Palmer (Michael Caine in his too-cool-for-school best form) back in a cheap raincoat and dowdy clothes on a mission that he seems sure he is going to regret. Indeed he makes clear that only being on probation (still?) causes him to go on it in the first place. The use of the real Berlin and the performance of Caine and Oskar Homolka (as Colonel Stok) keeps this film going as the plot is rather too thick for my liking. I am not someone that wants to do this much thinking with my fluff - but I caught most of it or at least the main parts. Couldn't be sure totally who the lesser characters were in bed with though or even if it was not each other. When the series returned with The Billion Dollar Brain it had got past its sell-by date and seemed to almost parody what had gone before. Like all things it has hard to judge when you have gone too far before you actually have. As a footnote Howard Hughes used to watch this film over-and-over again (as many as three times a day) when locked in his own self-made lunatic asylum. Did the film drive him mad or help drive him mad. We will never know.",
         "Though arguably not as cohesive as The Ipcress File, Funeral in Berlin still stands head and shoulders above the average 60s spy movie. The pacing could be tighter, the adaptation of Deighton's exemplary novel - one of his best - could be a little more fluid but generally the thing works well. For fans of the novels this is perhaps the most interesting of the three movies. Ipcress is a fascinating spin on the its novel's central theme, Brain is an awful adaptation of a lack-lustre book but Funeral in Berlin sticks to the original story pretty firmly until it turns on you with a very groovy twist indeed."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Jovera",
         "Lowndes Productions Limited",
         "Paramount Pictures"
      ],
      "summaries": [
         "Colonel Stok, a Soviet intelligence officer responsible for security at the Berlin Wall, appears to want to defect but the evidence is contradictory. Stok wants the British to handle his defection and asks for one of their agents, Harry Palmer, to smuggle him out of East Germany.",
         "A British agent is sent to Berlin to receive a Communist defector, but the true situation turns out to be rather more complicated."
      ],
      "budget": 0
   },
   "movielensId": 4930,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Magyar"
      ],
      "releaseDate": "1966-12-22",
      "dvdReleaseDate": "2001-08-14",
      "directors": ["Guy Hamilton"],
      "runtime": 102,
      "movieId": 4930,
      "title": "Funeral in Berlin",
      "mpaa": "",
      "actors": [
         "Michael Caine",
         "Paul Hubschmid",
         "Oskar Homolka",
         "Eva Renzi",
         "Guy Doleman",
         "Hugh Burden",
         "Heinz Schubert",
         "Wolfgang Völz",
         "Thomas Holtzmann",
         "Günter Meisner",
         "Herbert Fux",
         "Rainer Brandt",
         "Ira Hagen",
         "Marthe Keller"
      ],
      "imdbMovieId": "0060437",
      "originalTitle": "Funeral in Berlin",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [
         "xUeiTaTvgWc",
         "5cd3xuezuDo"
      ],
      "plotSummary": "Colonel Stok, a Soviet intelligence officer responsible for security at the Berlin Wall, appears to want to defect but the evidence is contradictory. Stok wants the British to handle his defection and asks for one of their agents, Harry Palmer, to smuggle him out of East Germany.",
      "tmdbMovieId": 34388,
      "avgRating": 3.67341,
      "releaseYear": "1966",
      "numRatings": 173,
      "posterPath": "/mtYQLTBTMnPQ7SI1bgZtFnWU4Qd.jpg"
   }
}