{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0080738",
      "video": false,
      "title": "The First Deadly Sin",
      "recommendations": [
         45577,
         36516,
         64925,
         29116,
         41018,
         16771
      ],
      "backdrop_path": "/l2Gi7l8Fgc7AMFPDPQRivrRFeKV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Edward X. Delaney",
               "gender": 2,
               "credit_id": "52fe45a5c3a368484e066e17",
               "name": "Frank Sinatra",
               "profile_path": "/vn9qWseEb2LspaS0LBDntH0L4Qw.jpg",
               "id": 4347,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Barbara Delaney",
               "gender": 1,
               "credit_id": "52fe45a5c3a368484e066e1b",
               "name": "Faye Dunaway",
               "profile_path": "/sq12RJZ1HTXHHI48y31YIS2qp87.jpg",
               "id": 6450,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Daniel Blank",
               "gender": 2,
               "credit_id": "52fe45a5c3a368484e066e1f",
               "name": "David Dukes",
               "profile_path": "/3mGdu1jF7TO66rUbyI6seaH5ahP.jpg",
               "id": 29792,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Bernardi",
               "gender": 2,
               "credit_id": "52fe45a5c3a368484e066e29",
               "name": "George Coe",
               "profile_path": "/2ygklxHSWcNuWg4hjZe5J9MlzNR.jpg",
               "id": 14102,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Monica Gilbert",
               "gender": 1,
               "credit_id": "52fe45a5c3a368484e066e2d",
               "name": "Brenda Vaccaro",
               "profile_path": "/cwNmZCRMRRiwtVSmkBiqP7aalyL.jpg",
               "id": 30585,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Christopher Langley",
               "gender": 2,
               "credit_id": "52fe45a5c3a368484e066e31",
               "name": "Martin Gabel",
               "profile_path": "/nkfnHSpO3c9HzLjnaMqBRzepsIu.jpg",
               "id": 6931,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Captain Broughton",
               "gender": 2,
               "credit_id": "52fe45a5c3a368484e066e35",
               "name": "Anthony Zerbe",
               "profile_path": "/ekhT4eIQP3XloHFTRr0THiVP9ve.jpg",
               "id": 2516,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Dr. Sanford Ferguson",
               "gender": 2,
               "credit_id": "5660a86892514179180042e3",
               "name": "James Whitmore",
               "profile_path": "/r1xOgXFjqhn2fonn78rlXKPZGFw.jpg",
               "id": 6577,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Man Entering Diner as Delaney Leaves (uncredited)",
               "gender": 2,
               "credit_id": "583fcb49c3a36862e4005ed9",
               "name": "Bruce Willis",
               "profile_path": "/kI1OluWhLJk3pnR19VjOfABpnTY.jpg",
               "id": 62,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Charles Lipsky",
               "gender": 2,
               "credit_id": "5a192eb40e0a264cbc028756",
               "name": "Joe Spinell",
               "profile_path": "/wzZZO8xXn9OgljCmrGGR4L6wBdg.jpg",
               "id": 16525,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a5c3a368484e066e25",
               "name": "Brian G. Hutton",
               "profile_path": "/cem8wlan7z6amIzoeKmAvC8yRZF.jpg",
               "id": 54451,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5660a847925141790a0045c5",
               "name": "Mann Rubin",
               "profile_path": null,
               "id": 100972,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5660a853925141220400343c",
               "name": "Lawrence Sanders",
               "profile_path": null,
               "id": 147013,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "59e141dbc3a3680e2500379b",
               "name": "Gordon Jenkins",
               "profile_path": null,
               "id": 1238709,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59e141e1925141728d00389f",
               "name": "Jack Priestley",
               "profile_path": null,
               "id": 1027513,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59e141e892514172b2003adc",
               "name": "Eric Albertson",
               "profile_path": null,
               "id": 50522,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59e141edc3a3680de40039d7",
               "name": "Louis DiGiaimo",
               "profile_path": null,
               "id": 949,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59e141f5c3a3680e250037b1",
               "name": "Woods Mackintosh",
               "profile_path": null,
               "id": 1329414,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "59e141fc92514172700039e0",
               "name": "Robert Drumheller",
               "profile_path": null,
               "id": 10442,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.974218,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28614,
      "vote_count": 7,
      "budget": 0,
      "overview": "A serial killer is stalking New York. Inspector Edward X. Delaney is an NYPD detective, nearing retirement, who is trying to put together the pieces of the case. Are the victims somehow linked? What does the brutal method of death signify?",
      "similar": [
         949,
         189,
         336843,
         910,
         996,
         654,
         1939,
         8834,
         10285,
         845,
         9272,
         1923,
         2163,
         223,
         9411,
         1645,
         6977,
         2252,
         1586,
         1949
      ],
      "original_title": "The First Deadly Sin",
      "runtime": 112,
      "poster_path": "/nhJJMG2hzTsSdSDK5ZBJYX2IhRu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Artanis Productions Inc.",
         "id": 69253,
         "origin_country": ""
      }],
      "release_date": "1980-10-03",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "He's searching for a killer. She's searching for a miracle .... And time is running out.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian G. Hutton"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Mann Rubin",
         "Lawrence Sanders"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080738/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzODEzMjkyOV5BMl5BanBnXkFtZTcwMzMzNDYyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Frank Sinatra, Faye Dunaway, David Dukes | See full cast and crew »"],
      "reviews": [
         "Above-average police procedural based on the excellent novel by Lawrence Sanders. The Chairman of the Board delivers a powerful performance as Sgt. Detective Edward X. Delany, and David Dukes's Daniel Blank is suitably psychotic (if a bit tamer than in the novel). Plays somewhat fast and loose with the adaption, but still does the book justice. Like the book, this is somewhat slow paced and character-driven, but Sinatra does such a good job at making Delany human and making the audience emote for him that the shortcomings seem minimal. If you are a fan of Sanders, police procedurals, or Frank Sinatra, then this film is certainly worth checking out.",
         "I have already seen \"Seven\", \"The bone collector\" and \"Copycat\", so naturally this doesn't seem to surprise me or anything like that, but I had a great time watching Frank Sinatra in his last major movie appearance and was equally shocked to see Faye Dunaway so woefully wasted on a hospital bed and not enough lines for an amateur let alone ... the screenplay is just fine and the supporting characters, esp. that old curator, hit the right notes. Sinatra's strong presence virtually lifts it out of the ordinary.",
         "Lawrence Sanders wrote a series of novels about NYPD detective Edward Delaney; popular in their day, they have not remained in print. Sanders actually gave them sequential titles: 'The First Deadly Sin', 'The Second Deadly Sin', 'The Third Deadly Sin'. The series died before Sanders ran out of sins. Frank Sinatra was occasionally an inspired actor, although always an undisciplined one. (He snagged the great lead role of Billy Bigelow in the film version of 'Carousel' -- Sinatra would have been brilliant in this part -- but then dropped it when he learnt that the film was going to be shot in two different screen ratios, and he would have been required to do all his scenes twice.) Sinatra's Academy Award for 'From Here to Eternity' was well-deserved, and in my opinion he should have got an Oscar for 'Von Ryan's Express' too, and possibly for 'Suddenly'. However, Sinatra apparently ran out of energy (and talent) before he made the movie version of 'The First Deadly Sin'. This was Sinatra's last starring performance; apparently he'd planned to develop a franchise series based on Sanders's novels, but this movie was such a clanging flop that no sequels were made. Two later friends of mine had worked (before I knew them) on the crew of this film; they've told me that the production was a nightmare, plagued by wrong-headed decisions. Delaney (Sinatra) is hunting a serial killer while Delaney's wife (Faye Dunaway) struggles with cancer. These two plots never interlink, nor does Sinatra convey any sense of a man torn between two priorities. He just shuttles (in slow motion) between police procedural sequences and hospital sequences. The killer is known to the audience, so it's no spoiler when I tell you that the murderer is Daniel Blank, a wealthy playboy who has no particular motive for killing random Manhattanites: he just kills 'em for the hell of it. With an ice axe, no less. The killer is played by David Dukes, who filmed his scenes in Manhattan concurrently while starring on Broadway in 'Bent', in which he played an inmate of a concentration camp. Dukes's head was shaved to a tight crew cut for his stage role, but this coiffure was inappropriate for his film role as a murderous playboy, so Dukes plays his scenes in a hairpiece. Which would have been fine, if the film chose not to call attention to the hairpiece. Instead, we get a stupid sequence in which Dukes's hairpiece flies off while he sinks the axe into a victim's skull. Then we get a bad dialogue scene later, explaining why the playboy has a crew cut and why he wears a wig to cover it. Hell toupee. My friends on the film crew told me that the wig fell off by accident, and then the dialogue was inserted so they wouldn't have to shoot a retake. Frankly, Dukes's performance quite fails to impress me: given the handicap of his inappropriate hairstyle, the casting agent should have chosen another actor (with more hair) instead. We get an utterly pointless scene in which Sinatra swots up evidence with two civilian volunteers, of the sort whom real police call 'cop groupies'. One of the volunteers is played by Martin Gabel, an American actor who spoke with a pronounced mid-Atlantic accent. (In real life, Gabel described himself as 'affected'.) Gabel's accent was useful in some other roles, but here it's just distracting. SPOILERS COMING. Sinatra's (very slow) race to find the killer occurs during the week before Christmas, but this has nothing to do with the plot. And the film was shot in late summer, worse luck. (The exterior scenes in this movie show very little snow.) As New Yorkers know, every year during Christmas season -- and *only* during Christmas season -- the Empire State Building's upper floors are lighted green and red. While 'The First Deadly Sin' was shooting principal photography, Sinatra's production company paid some bucks to Helmsley-Spear (the Empire State Building's landlords) to wire up the Christmas lighting a few months ahead of schedule. This *would* have been a very effective device for an exterior shot of Sinatra in midtown Manhattan at night, with the Empire State Building glowing green and red in the background. Instead, after all that trouble, we merely get one quick insert shot of the Empire State Building's upper storeys, lighted in the appropriate colour scheme but with no surroundings -- no context -- at all. This shot occurs immediately before the death scene. Ouch! The death scene. After nabbing the killer, Delaney goes to visit his wife in hospital. This scene is beyond awful. Sinatra reads aloud from an old-time children's book about two little girls named Sunny and Honey. He reads this awful text in a voice so lethargic, he seems to be on meds. Dunaway remains utterly inert through this scene, at the end of which Sinatra realises she's dead. Of boredom, most likely. Fade out. I sat through this rubbish only because I know two people who worked on the tech crew. I'll rate 'The First Deadly Sin' just one point in ten.",
         "Frank Sinatra put on a pretty decent performance here (in what's billed as his last starring performance, although he was in \"Cannonball Run II\" a few years later) as Edward X. Delaney - a New York City police detective weeks away from retirement, who gets caught up in a murder investigation that his commanding officer (for reasons I never clearly understood) would prefer him to leave alone. Sinatra's performance, though, was really the only thing that made this movie worth watching. The story of the search for the psychopathic killer wasn't all that interesting, and while the subplot revolving around the illness of Delaney's hospital-bound wife (a rather simple role played by Faye Dunaway) took up a fair amount of screen time, it also added nothing to spark the movie, except perhaps to ground Delaney as a loving husband. Delaney does come across as a sympathetic character for the most part, although he's a cop willing to go to any lengths (legal or otherwise) to get this killer. Aside from that there was one very effective scene in which the curator Langley (Martin Gabel) goes to a hardware store trying to figure out what the murder weapon was which added some welcome comedy relief to this otherwise rather poorly structured and poorly paced movie, which I would frankly have to say was one of the least exciting and least interesting murder mysteries I've ever seen.",
         "***SPOILERS*** Frank Sinatra plays the about to put in his papers and retire NYPD Sergeant Edward X Delaney who's obsessed in finding this ice pick killer who's terrorizing the city of New York. The fact that Sgt. Delaney's wife Barbara , Faye Dunaway, is in critical condition and on life support because of a blotched kidney operation doesn't make his task any more easier. It doesn't take long to see who this crazed ice pick wielding psycho is since we see him Daniel Blank, David Dukes, as soon as the film starts as he ice picks to death a total stranger who passes him in the street.It's Sgt. Delaney who later notices a pattern in a number of murders over the last three yeas in the city that fit the same MO or description and realizes they, the victims, were that of the very same killer. Meanwhil back in the hospital emergency ward Sgt. Delaney's wife Barbara is fighting for her life as her husband seems to be spending far more time looking for Daniel Blanks then with her when in the critical condition that she's in she needed him most. The film centers around the killer's weapon of choice to do in his victims a mountain climbing ice pick that he brains and murderers his victims with. It's in discovering that the killer has mountain climbing experience that narrows down the search in finding him. Sgt. Delaney finally tracks down \"Dandy Dan\" Danny Blank at his high rise apartment on Manhattan's Upper East Side and plans to arrest him but has no real concrete evidence to do it or make his arrest stick. Bending the law a bit to say the least Sgt. Delaney ends up breaking it to bring Daniel Blank to justice. And it's the fact that Sgt. Delaney worked on this case alone with no one in the NYPD to see what he did and turn him in he ended up getting away with it. ***SPOILERS*** Despite his success in offing the ice pick serial killer in the end Sgt. Delaney ended up losing the person who meant most to him his wife Barbara who died from complications from the blotch operation that was preformed on her. A more mild and mellower Frank Sinatra did make the movie interesting then it would have been in playing his age,65, and not trying to be at least 20 years younger in the role he had. As for Faye Dunaway all she did during the entire movie was go in and out of consciousness and try to look pretty, but as white as a sheet, during the entire time she was on camera. As for David Dukes as the zombie like serial killer Daniel Blank his name, Blank, fit the role he had in his zombie like actions through the entire movie. The biggest surprise is in the end when he finally opened his mouth and told the reason for his murderous actions which made as much sense as the cannibalistic and real life serial killer Jeffery Dhamer reasons for murdering his victims did.",
         "A sombre character drama crossed with an old-fashion police detective story is broken up in two parts, as a retiring NYPD Edward X. Delaney is on his last case tracking down a psychotic serial killer while also dealing with his bed-ridden wife (a warm-hearted Faye Dunaway) that's dying in the hospital from an unclear disease. How these two threads are connected isn't really garnished, other than to give the lead character more emotional weight and progressive depth. Instead it just comes across as depressing and somewhat pointless. It manages to hold you there, but not much really happens in this slow-grinding thriller as Frank Sinatra's wearily brooding performance is determined, but filled with melancholy heartache. Ambitious, but unfulfilled and too long toothed is how you can describe it. The narrative just feels incomplete, like it was aiming for something more profound (like the symbolic use of the cross) and mysterious (the killer's motive) but it came away rather puzzling and affected in its intentions. The grungy New York setting is painted with darkness, dreary atmospherics as there's a killer randomly leaving his victims with a hole in the back of their heads. A lot of the running time (and at times it does drag) has Delaney working the case, starting with very little. Putting in the hours, strenuously gathering info, seeking help outside the police force and thoroughly digging in as his personal life begins to crumble. The focus on his sick wife does very little for the story, but it takes up a fair amount of screen time. When Sinatra isn't mugging the screen, there's some able support in the cast; Martin Gabel, James Whitmore and Joe Spinell added some much needed life. David Dukes makes for an effective loony, but his icy character was just felt too one-note. An interesting, but sleepily underdone dramatic thriller.",
         "I saw someone else's user comments on this film and I can't believe that there were going to be series of films based on Frank Sinatra's character mainly because of the ending this film had. If you're thinking that gives the ending away, don't look for an obvious conclusion. To his credit, I guess Frank Sinatra did not want to end his film career with Dirty Dingus Magee. He wanted to end his film with the serious part, unfortunately The First Deadly Sin messes up the telling of a potentially good tale. Frank Sinatra is days away from his retirement as a Detective Sergeant and a strange murder has been assigned to him. A man apparently selected at random is killed with an unidentified weapon that is just driven into the top of his skull. A little good detective work and he finds their just might be a pattern of killings. It's all in identifying the weapon and it's an unusual one at that which I won't reveal. A professor in medieval history played by Martin Gabel helps with the hunt and later on he's joined by the widow of Sinatra's victim, Brenda Vaccaro to help with the hunt. They're helping because Sinatra's new captain is one total jerk played by Anthony Zerbe. Maybe I'm missing something in Zerbe's performance, but I would think that an ambitious guy like Zerbe plays would instead of pooh-poohing Sinatra's ideas would think that this guy if he is on to something with this serial killer business. And if he's right Zerbe will get all kinds of accolades for figuring this out in his precinct and even more if the doer is apprehended. It's an absolutely impossible role and poor Anthony Zerbe can't do much with it. All this while Frank's wife Faye Dunaway falls ill to a misdiagnosed kidney malady. She spends all her time in the hospital and Sinatra visits her at breaks in this case. Frank delivers a very good performance in a role similar to the one he had in The Detective. He's supported by the rest of the cast very well, except with Anthony Zerbe's impossible role. Besides who I've mentioned look for a really nice turn by Joe Spinell as the mendacious doorman where suspect David Dukes lives. His role is similarly undefined, we really never learn why he's doing these crimes.",
         "This is the worst adaptation of a novel I have seen to date. I recently started reading Sanders' novels. This was my first. I thought it would be fun to watch the movie so I got it from Netflix. What a disappointment. The screenplay artfully removed all the interesting story weaving; the jumping back and forth from killer to cop; the character development and motivation. The movie is so fragmented I doubt anyone who hadn't just read the book will have any idea what is going on. Especially so with Delaney's helpers and the approach to solving the crime. This is no doubt one of the reasons current novelists try to keep approval rights when their books are converted to screenplays. The only bright spot, if you catch it, is a young extra named Bruce Willis who walks through one scene. My advice? Don't bother with this one. Read the book.",
         "I am a huge fan of Lawrence Sanders, who wrote \"The First Deadly Sin,\" and I finally came upon the DVD, and was excited to buy it. To me the novel gives equal time to Delaney and Daniel Blank (hey, what a name for the killer), but this film focuses on Delaney and his problems. I envisioned an actor like Brian Dennehey playing Edward Delaney, a big man with a good heart, very intuitive, and with a big appetite for all kinds of weird sandwiches and always some good beer, not someone like Sinatra, a rather small man. Sanders is a brilliant writer of weird characters, and Daniel Blank was one of his best. Yet the whole film seems to focus on Delaney and the dying wife. I would have much liked to have seen the killer portrayed as he was in the book - a man with a good job, a very strange girlfriend, and brilliant in a horrible type of way. And so slow moving! Lesson learned, never see a movie after you've read the book.",
         "Frank Sinatra in his last starring role (?) plays a detective tracking a killer while caring for his illness-stricken wife, played by Faye Dunaway. Dunaway is wasted in this particular role as she just lies there. The actors who play the curator and the coroner are great in their supporting roles. Of course, it is Sinatra who carries this film. I probably wouldn't have watched it if he wasn't in it. The pacing is quite slow at the beginning but thankfully picks up about a quarter of the way through. 7/10, though I'll probably never watch this DVD again."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Artanis Productions Inc.",
         "Cinema VII"
      ],
      "summaries": [
         "A serial killer is stalking New York. Inspector Edward X. Delaney is an NYPD detective, nearing retirement, who is trying to put together the pieces of the case. Are the victims somehow linked? What does the brutal method of death signify?",
         "A police inspector, nearing retirement, tracks a serial killer who is terrorizing New York."
      ],
      "budget": 0
   },
   "movielensId": 4940,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-10-03",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["Brian G. Hutton"],
      "runtime": 112,
      "movieId": 4940,
      "title": "The First Deadly Sin",
      "mpaa": "",
      "actors": [
         "Frank Sinatra",
         "Faye Dunaway",
         "David Dukes",
         "George Coe",
         "Brenda Vaccaro",
         "Martin Gabel",
         "Anthony Zerbe",
         "James Whitmore",
         "Bruce Willis",
         "Joe Spinell"
      ],
      "imdbMovieId": "0080738",
      "originalTitle": "The First Deadly Sin",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["qEjd9ysyiX4"],
      "plotSummary": "A serial killer is stalking New York. Inspector Edward X. Delaney is an NYPD detective, nearing retirement, who is trying to put together the pieces of the case. Are the victims somehow linked? What does the brutal method of death signify?",
      "tmdbMovieId": 28614,
      "avgRating": 3.02128,
      "releaseYear": "1980",
      "numRatings": 47,
      "posterPath": "/nhJJMG2hzTsSdSDK5ZBJYX2IhRu.jpg"
   }
}