{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "christmas tree",
            "id": 5570
         },
         {
            "name": "christmas eve",
            "id": 33965
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt0488658",
      "video": false,
      "title": "Unaccompanied Minors",
      "recommendations": [
         37641,
         48375,
         73594,
         25697,
         54494,
         58918,
         97313,
         33657,
         18553,
         46737,
         21793,
         30114,
         17007,
         11388,
         24115,
         73990,
         36220,
         90926,
         17880,
         36859
      ],
      "backdrop_path": "/tDwh8ElEYPrKJuCcp7D2gvxt3s5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Oliver Porter",
               "gender": 2,
               "credit_id": "52fe47639251416c7509784f",
               "name": "Lewis Black",
               "profile_path": "/rtlzszC0uPvHZtrXzwYNT9jYPsU.jpg",
               "id": 59258,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Zach Van Bourke",
               "gender": 2,
               "credit_id": "52fe47639251416c75097853",
               "name": "Wilmer Valderrama",
               "profile_path": "/ecZiHIGL4twAFOS4RTeEUV7ccWH.jpg",
               "id": 18975,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Charlie Goldfinch",
               "gender": 2,
               "credit_id": "52fe47639251416c75097873",
               "name": "Tyler James Williams",
               "profile_path": "/AhP3h8PTolg7vsiz85wET0U99bE.jpg",
               "id": 1214870,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Spencer Davenport",
               "gender": 2,
               "credit_id": "52fe47639251416c75097857",
               "name": "Dyllan Christopher",
               "profile_path": "/qvxKtJfStz2xUsmHGao3pY4u2LU.jpg",
               "id": 167689,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Timothy 'Beef' Wellington",
               "gender": 2,
               "credit_id": "52fe47639251416c75097863",
               "name": "Brett Kelly",
               "profile_path": "/lrNCvvtopyLTtwQQUxjfu8JfIpj.jpg",
               "id": 63992,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Grace Conrad",
               "gender": 1,
               "credit_id": "52fe47639251416c7509785f",
               "name": "Gia Mantegna",
               "profile_path": "/7kyM76HV3wz8g3sXHbdJ4bJuX8E.jpg",
               "id": 137424,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Donna Malone",
               "gender": 1,
               "credit_id": "52fe47639251416c75097867",
               "name": "Quinn Shephard",
               "profile_path": "/wgOADMHJOA4VP2j31WT8ZQIOuUU.jpg",
               "id": 429728,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Sam Davenport",
               "gender": 2,
               "credit_id": "52fe47639251416c7509786b",
               "name": "Rob Corddry",
               "profile_path": "/k2zJL0V1nEZuFT08xUdOd3ucfXz.jpg",
               "id": 52997,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Valerie Davenport",
               "gender": 1,
               "credit_id": "58b916cec3a3686686006da3",
               "name": "Paget Brewster",
               "profile_path": "/4yzWN3Up7HXvAmuq8D4CBxGjtlz.jpg",
               "id": 15423,
               "order": 8
            },
            {
               "cast_id": 5,
               "character": "Katherine Davenport",
               "gender": 1,
               "credit_id": "52fe47639251416c7509785b",
               "name": "Dominique Saldaña",
               "profile_path": null,
               "id": 433243,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Cindi",
               "gender": 1,
               "credit_id": "583ec18d9251411521009753",
               "name": "Jessica Walter",
               "profile_path": "/zPHpjVlg6nTKnyXWq8rreW6q1x.jpg",
               "id": 41232,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Head Guard Hoffman",
               "gender": 2,
               "credit_id": "58b9172ec3a36866a50073d3",
               "name": "Rob Riggle",
               "profile_path": "/tWh7aVLl82jxX6U0f7tRTN7Sw3S.jpg",
               "id": 71403,
               "order": 11
            },
            {
               "cast_id": 11,
               "character": "Ernie",
               "gender": 2,
               "credit_id": "52fe47639251416c7509786f",
               "name": "David Koechner",
               "profile_path": "/fpTTe1ow3EdfRJ8PZgBJmpeghMS.jpg",
               "id": 28638,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Carole Malone",
               "gender": 1,
               "credit_id": "583ec16f925141152a009d95",
               "name": "Kristen Wiig",
               "profile_path": "/iqRX3PDxA33zFhSfKTo5BE593G4.jpg",
               "id": 41091,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Alan Davies",
               "gender": 2,
               "credit_id": "58917afd9251412dc200392c",
               "name": "Tony Hale",
               "profile_path": "/ar4uapp4w5wMkThZcqWUNMSTO8z.jpg",
               "id": 25147,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Mary Lynn",
               "gender": 0,
               "credit_id": "58b91739925141606b007f6e",
               "name": "Michelle Sandler",
               "profile_path": null,
               "id": 1768896,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Desk Attendant",
               "gender": 2,
               "credit_id": "58b9169c925141607b007ac8",
               "name": "B. J. Novak",
               "profile_path": "/aD2ewhKJymfPGYpGFS4JCzop7Lh.jpg",
               "id": 107770,
               "order": 16
            },
            {
               "cast_id": 15,
               "character": "Restaurant Hostess",
               "gender": 1,
               "credit_id": "5586ee95c3a36838530048ee",
               "name": "Mindy Kaling",
               "profile_path": "/Agpd4tJyZ95hk74RifjnfnJpn9U.jpg",
               "id": 125167,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47639251416c7509784b",
               "name": "Paul Feig",
               "profile_path": "/68XiL9p5KAKtWK9F6q435ChzpBL.jpg",
               "id": 116805,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47639251416c75097879",
               "name": "Jacob Meszaros",
               "profile_path": null,
               "id": 1282719,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47639251416c7509787f",
               "name": "Mya Stark",
               "profile_path": null,
               "id": 1282720,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.912547,
      "production_countries": [],
      "id": 18147,
      "vote_count": 94,
      "budget": 26000000,
      "overview": "Five disparate kids snowed in at the airport on Christmas Eve learn some lessons about friendship when they launch a bid to get back to their families and outsmart a disgruntled airport official who wants to keep them grounded.",
      "similar": [
         11395,
         13673,
         9479,
         10147,
         17979,
         10872,
         25842,
         9279,
         9021,
         11881,
         1581,
         1585,
         634,
         8871,
         10719,
         296100,
         13377,
         323262,
         287903,
         51052
      ],
      "original_title": "Unaccompanied Minors",
      "runtime": 90,
      "poster_path": "/wpa8QNSuvxKPBpebnVSO42vdcos.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2006-12-08",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "No plane, no parents, no problem!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Paul Feig"],
      "runtime": 90,
      "synopsis": "When Katherine and Spencer are on there way to their fathers house, a blizzard hits delaying all plane flights at Hoover International. Zach Van Bourke (Wilmer Valderrama) takes Katherine and Spencer to the UM room (Unaccompanied Minors Room) In the huge concrete room there are lots of crazy kids in there. That is where Spencer meets Donna (Quinn Shephard), Charlie (Tyler James Williams), Grace (Gena Mantegna) and Beef (Brett Kelly). The five kids decide to escape the UM room and try to find something to do. Spencer grabs a bite to eat, Grace goes to the high flyers room, Donna steals a golf cart type vehicle inside the airport, Beef goes into the safety equipment room and plays around in there and Charlie sings at Sharper Image. They are eventually caught and brought back to the UM room where they discover no one else is there. They also get a lecture from Oliver (Lewis Black), the head of the airport. All the kids, including Spencer's little sister, were brought to the Hoover International Lodge to spend the night on Christmas Eve. Spencer, Donna, Charlie, Grace and Beef are all forced to sleep in the dirty UM room. The kids find a way to trick Zach Van Bourke and they manage to escape the UM room. When they get out, Beef says that he will find a Christmas tree for Spencer's sister to make her Christmas better. Donna and Grace get into a fight after arguing over something stupid. The 4 kids eventually make a trip to distract the guards by letting a dog out of its cage. The 4 kids eventually go to the unclaimed baggage wearhouse, where they find some cool things. Charlie finds 4 walkie talkies and Spencer finds a doll. Both of those things will eventually help them. They are caught on camera and must make a run from Oliver and the guards. They eventually go to the the lodge to see Spencer's sister and deliver the doll that Spencer found for Katherine. Charlie and Donna knock on people's doors and blame it on Oliver who gets punched in the face by a man. Spencer puts the doll next to his sister as she is sleeping. Oliver catches them and Spencer tells Oliver not to wake up his sister. The 4 kids are brought back to private rooms where there are guards next to the doors. They all 4 still have walkie talkies so they manage to get out through the vents in the ceilings. They are in the vents and Charlie falls through the celing into a room with decorations. The 4 kids decorate the airport because it has no Christmas decorations. Beef comes back with the Christmas tree even though he had to go a long way to get it. Oliver doesn't like Christmas because his wife left him on Christmas a couple years back. Oliver catches them but congratulates them for escaping. Oliver decides to bring Christmas to the airport so he dresses up as Santa. They get a list of all people flying alone so they give gifts to them. Spencer meets up with Katherine and there father comes to see them. He drove to the airport all the way from Pennsylvania to meet them. His car blew up on the way so he had to use a Hummer to get there. THE END",
      "writers": [
         "Jacob Meszaros",
         "Mya Stark"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0488658/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4MDY2NDYwOV5BMl5BanBnXkFtZTcwNDc5OTYzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dyllan Christopher, Tyler James Williams, Gia Mantegna | See full cast and crew »"],
      "reviews": [
         "I just watched this movie and I really don't understand why people think this is a horrible movie. It's a good movie, I really enjoyed it! Sure, there isn't some complex plot with several twists; it's just a relaxed ride, a feel good movie. It's un-complex. As un-complex as children ARE. You remember how good live was when you were young? No worries (well, for most people that's true anyway ;). The things the kids in this movie do are things that you CAN only do when you are still young: the adults are going to forgive you. They are doing things that no adult could ever get away with, but that is exactly why it made me feel good: you just know that there won't be consequences; it's just pure adventure and fun. I see a lot of B-movies lately; were the acting is REALLY REALLY bad. The kind of movies that I turn off half way, disgusted that I wasted my time with it. Imho, THAT are the kind of movies that should fill up the bottom 250 on IMDb. The acting in this movie however, is good! The kids put down some professional acting (not perfect, but in most cases that is totally to blame on the director-- the movie doesn't need it either, this isn't a \"The Good Son (1993)\") and the adults act as adults typically act in kids movies, nothing that annoyed me. I think that any adult can enjoy this movie, if they keep an open mind, like children and still are enough of a kid in their heart to remember how (good) it was in their childhood. Don't expect anything deep - just sit back and allow yourself to enjoy a while without worries.",
         "You should know that I had decided I'd rather watch \"Minors\" than \"Santa Clause 3\" or \"Deck the Halls,\" so going into the movie I was probably more lenient with it than I might have otherwise been... But anyway, I saw this and I thought it was okay. It reminded me a little of Home Alone with more kids and antics. I thought the four main kids--the ones stuck in the airport--had good chemistry and went well together. The adults (Black, Valderrama), while they've done okay in other movies/shows, seemed to be \"acting down.\" In fact, the whole movie kind of seemed that way. These kids must be 13 or 14 but they're acting more like eight or nine. I'm sure it was as the director wanted but even the adults were talking slow and using lots of animated hand gestures. At the very beginning of the movie, one girl sits on a young, hip Santa's lap and tells him he \"hot\" and then the rest of the movie has the exaggerated and childish feeling of an episode of Blue's Clues. But, since I was ready to watch and enjoy this movie, I laughed at all the falling down, food-throwing, name-calling activity. I noticed a theme. I think this theme or message is what some parents will like about the movie and what some might decide to steer clear of: children of divorce do well on their own, perhaps even better than kids whose parents are still married. My parents divorced when I was 14 and I don't really feel like it had a huge impact on my life but today's kids are... different. Maybe \"divorce kids\" will enjoy this divorce kid fantasy more than everyone else. Parents will approve of it because, even with the happy ending, the divorced parents in the film were still divorced in the end.",
         "Well, I do give it a medium rating...not bad and not good, but if adults park their brains outside the theater before going in, they'll find it fun. Sure, you have to overlook the way the kids are smarter than the adults and the fact that firstly the security guards aren't bright enough to be working airport security and even so aren't villains but just guys trying to do their jobs. Anyway, the acting is good and the script isn't bad if you don't think too hard about it. The movie is after all targeted for a junior high level audience, but the filmmakers are skillful enough to make it enjoyable for older viewers. Sure it's a reworking and multiplication of the Home Alone theme and Christmas setting. As other reviewers mentioned, there are echos also of The Breakfast Club and The Terminal. However, it's fluffy, harmless fun and there are worse movies out there right now. BTW, how did this get down to #2 on the worst list when Deck The Halls which isn't half as good is out there?",
         "When I was first considering seeing this film was when I saw that Lewis Black was in a leading role. How ever I was skeptical about how this film would play out, and if It would be like another ones like \"Christmas with the Kranks.\" I was surprised at how funny this actually was, It had the perfect combination of adult humor and child humor which made it enjoyable for me. To those who feel that this film sucks, don't watch it to seriously. Its just supposed to be fun, so enjoy it. I'd recommend this film to almost any one, although it looks stupid its a fun and enjoyable watch. All in all I give Unaccompanied Minors a 4/5 or a 8/10 for IMDb's Sake. This is worth checking out.",
         "Hey, I've seen this film before \u0096 it's called \"The Breakfast Club.\" No, wait, that film was actually clever and funny. This rehash of every kid-left-alone movie has incredibly cute children, but very little laughs - and even with a schmaltzy ending - very little heart. Five kids from different parts of the country, normal kid Spencer (Dyllan Christopher), weakling Charlie (Tyler James'Williams), fat boy Timothy (Brett Kelly), spoiled princess Grace (Gina Mantenga) and tomboy Grace (Quinn Shephard), find themselves together at a Chicago airport. Put together in a dungeon-like basement for kids traveling without parents, they soon escape and make an effort to find Spencer's little sister, Katherine (Dominique Saldana). This takes place as grumpy security manager (comedian Lewis Black) and his three idiot guards (former Kids in the Hall players Kevin McDonald, Bruce McCulloch and Mark McKinney) pursue the indifferent and resourceful moppets. At least Black, whose acerbic tirades on \"The Daily Show\" can be hilarious; and his well-received books and stand-up specials draw much attention, is funnier here than he was in \"Man of the Year.\" All the while, we are treated to unfunny sequences featuring Spencer and Katherine's moronic, tree-hugging dad, whose vegetable oil-burning vehicle explodes while he is driving to pick them up. Luckily, a chainsaw-toting redneck cretin provides the guy with a new Hummer for the rest of the trip. Still, this devolves into another \"the kids are really smart while the adults are idiots who end up completely defeated and befuddled in the end\" kind of movies. That was all right in \"Home Alone\" but it doesn't really work when you care nothing about any of these young characters. A sappy conclusion, featuring a reformed Black and the arrival of a deadbeat father, along with everyone getting a new girl/boyfriend (except the fat kid, because we know fat people in Hollywood films do not deserve any sort of happiness), adds to the overall stupidity. Saw several critics on the Internet Movie Data Base that actually gave 10 stars to this picture. Maybe \"Unaccompanied Minors\" is just as good as \"From Here To Eternity,\" \"On the Waterfront,\" \"The Godfather,\" \"The Grapes of Wrath,\" \"Lawrence of Arabia,\" \"West Side Story\" and \"One Flew Over the Cuckoo's Nest\" to these people, but I'm afraid I'll just have to drop the bar a star or two.",
         "I saw this movie, and I really liked it a lot. It wasn't only funny, but it was entertaining. Maybe for like 40 year-olds it may seem like a waste of time, but kids under the age of 12 will probably love this movie. I'm not really a family movie fan, (some of my favorite movies are Rob Zombie's \"The Devil's Rejects\", Cannibal Holocaust, Alpha Dog, Sin City...etc.) but this movie I liked so much that right after watching it, I saw it again. That's how much I liked it. It made me look at airports in a whole different way! It's a great movie to watch with the family, or with some friends, but it may not seen so great if you watch it alone, it is about Christmas, and no one should be alone on Christmas. I liked it not for the hilarious comedy, but for the storyline, it was great overall, any way you look at it. I strongly recommend people see it, especially on Christmas.",
         "i just saw this movie.and as Christmas is one week ahead ,this movie made me glad and had all the good feelings together with clever stylish adventure and kids being intelligent.made me want to be in their group.no one is really bad in this movie,it did not have any \"bad\" characters or scenes unlike some other family movies.it was a very warm and entertaining movie.the acting was pretty good.the rhythm was proper ,not very fast ,but neither boring,keeping you happy and curious.it makes you see an airport through a child's eyes.i did not see much difference between this movie and the mega-classic home alone,except the star quality of macaulay culkin.but guess what.these kids are very likable without really trying to be,which is a great approach.all together i recommend this movie especially during the Christmas period for everyone young or old who can still feel like a little kid trying to have fun.",
         "It's not a masterpiece, it's not pretending it is, but it's fairly well written, with good characters for leads and the actors give their share, like good actors do when they're given good roles to act. It avoids almost entirely cartoonish characters, restricting them to the third or even fourth tiers. In fact the movie surprises with some unexpected depth at moments were a cheesy joke would've been easier. Very little slapstick, limited to specific scenes which call for some physical humor. And apart from some excess saccharine and cliché at moments, there's some solid story telling here, which I always appreciate. The two leading kids Gia (Gina) Mantegnia and Dylan Christopher got the looks and the talent to be going places if they just conduct themselves right. Lewis Black takes a cartoon villain and makes him human, and Paget Brewster and Teri Garr present some lovely background cartoons that complete a surprisingly nice movie.",
         "OK, so on Facebook, I do reviews of forgotten movies/TV shows/books/etc. from my childhood on Throwback Thursday (I go above and beyond), and for Christmas, this was my choice, and it was the perfect choice! Usually on TBT, I have an amazing memory with the movies, but with this movie (since I was reviewing it for Christmas, which is a special time), I decided to check it out from the library, and watch it again, and I was hit with nostalgia. I like this movie. It reminds me of my childhood, when kids movies were just about kids being kids. I miss those days. It reminds me of the days when technological things like cell phones weren't advanced (yet) and all you had was a flip phone. Yeah, before technology controlled our damn lives! This movie is a kid's dream: Just kids trapped in an airport having the time of their lives. I really like the Spencer kid, and how he's so determined to get anything done. These kids have some great chemistry together. I'm also surprised that he has a really nice sister, unlike most things like this, where the sister is an annoying brat. But there are things that I don't like about this movie, like the scenes with Spencer's dad trying to get to his kids. They're not funny, and they drag on. There's no importance to them. I think they should have put these on the deleted scenes for the DVD. The guards aren't really funny, but other than that, I really like this movie. If you're an adult reading this and you're about to watch this, go into it with the mind of a child. Just have fun with this movie. Just think back to the days when you were a kid, just the days when kids weren't focused on stuff like relationships and instead, were focused on being kids. So, with that said, pop this DVD in if you have the chance, and prepare to feel like a kid again! Don't look for Citizen Kane in this movie, just look for a good ol' fashioned kiddy good time!",
         "A bunch of teenagers get stranded at a huge airport, and then decide to take it over and have a holiday of their own. apparently a bunch of vacation plans were made,, kids get dropped off, and all of a sudden Mother Nature decides that she has other plans,, stranding all the kids without adult supervision from their parents,, all that is left to keep the peace is Airport Security.. now you have teenager run amok in the airport,, so the antics start to fly fast and heavy,, lot's of laughs and pranks along the way,, you get to learn a little bit about a few of the character in the movie and such,, and one of the children tries to help one of the adults at the airport find his family or something along those lines,, all in all not a great movie,, but not a bad movie either,, pretty much right in the middle of the road."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Village Roadshow Pictures",
         "Donners' Company"
      ],
      "summaries": [
         "Spencer and his little sister, Katherine, are flying to Pennsylvania for Christmas with their dad. While changing planes, a blizzard moves in and cancels all flights out of Hoover Airport: they must stay in a basement room with the other unaccompanied minors. Spencer and four others - a chubby boy, a non-stop-talker, a surly girl, and a rich kid - go AWOL and get in trouble with Mr. Porter, the Christmas-hating airport supervisor. The five misfits spend the night evading and enduring Porter's punishments, discovering all sorts of things in back rooms, making sure Katherine gets her visit from Santa, and finding among themselves a new kind of family.",
         "A group of unaccompanied minors bond while snowed in at the midwestern Hoover International Airport during the holiday season and ultimately create a makeshift holiday themselves."
      ],
      "budget": 26000000
   },
   "movielensId": 49642,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-12-08",
      "dvdReleaseDate": "2007-08-07",
      "directors": ["Paul Feig"],
      "runtime": 90,
      "movieId": 49642,
      "title": "Unaccompanied Minors",
      "mpaa": "PG",
      "actors": [
         "Lewis Black",
         "Wilmer Valderrama",
         "Tyler James Williams",
         "Dyllan Christopher",
         "Brett Kelly",
         "Gia Mantegna",
         "Quinn Shephard",
         "Rob Corddry",
         "Paget Brewster",
         "Dominique Saldaña",
         "Jessica Walter",
         "Rob Riggle",
         "David Koechner",
         "Kristen Wiig",
         "Tony Hale",
         "Michelle Sandler",
         "B. J. Novak",
         "Mindy Kaling"
      ],
      "imdbMovieId": "0488658",
      "originalTitle": "Unaccompanied Minors",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["9lMY2F8-iyc"],
      "plotSummary": "Five disparate kids snowed in at the airport on Christmas Eve learn some lessons about friendship when they launch a bid to get back to their families and outsmart a disgruntled airport official who wants to keep them grounded.",
      "tmdbMovieId": 18147,
      "avgRating": 2.6,
      "releaseYear": "2006",
      "numRatings": 110,
      "posterPath": "/wpa8QNSuvxKPBpebnVSO42vdcos.jpg"
   }
}