{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "image maker",
            "id": 194792
         }
      ],
      "imdb_id": "tt0091786",
      "video": false,
      "title": "Power",
      "recommendations": [
         86600,
         34732,
         66600,
         28073,
         70202,
         15186,
         32665,
         77553,
         49815,
         25767,
         54087,
         82465,
         27642,
         54494,
         109669,
         42040,
         98130,
         38792,
         35201
      ],
      "backdrop_path": "/vVuGOt5vO6Oiv7tg4dUMgjpGQmk.jpg",
      "revenue": 3800000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Pete St. John",
               "gender": 2,
               "credit_id": "52fe4717c3a36847f8122f4b",
               "name": "Richard Gere",
               "profile_path": "/hqMhNyTqIStibnhBh8SjyfpU665.jpg",
               "id": 1205,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ellen Freeman",
               "gender": 1,
               "credit_id": "52fe4717c3a36847f8122f4f",
               "name": "Julie Christie",
               "profile_path": "/8ExaneRh7VHcm2rATpau89Qwzjm.jpg",
               "id": 1666,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Wilfred Buckley",
               "gender": 2,
               "credit_id": "52fe4717c3a36847f8122f53",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sydnet Betterman",
               "gender": 1,
               "credit_id": "52fe4717c3a36847f8122f57",
               "name": "Kate Capshaw",
               "profile_path": "/fR9ZNjuM67noFAXtZP4Ov5FzRPV.jpg",
               "id": 689,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Arnold Billing",
               "gender": 2,
               "credit_id": "52fe4717c3a36847f8122f5b",
               "name": "Denzel Washington",
               "profile_path": "/semwsON3dN3np6cyzlCw7F2YDGe.jpg",
               "id": 5292,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Senator Sam Hastings, Ohio",
               "gender": 2,
               "credit_id": "52fe4717c3a36847f8122f5f",
               "name": "E.G. Marshall",
               "profile_path": "/iQnivIob2OiXuVCepECf72xS2tQ.jpg",
               "id": 5249,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Claire Hastings",
               "gender": 1,
               "credit_id": "52fe4717c3a36847f8122f63",
               "name": "Beatrice Straight",
               "profile_path": "/bN8PXaFCpG6c0qp9FRynCc98c7M.jpg",
               "id": 10083,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4717c3a36847f8122f41",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4717c3a36847f8122f47",
               "name": "David Himmelstein",
               "profile_path": null,
               "id": 71342,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.814087,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46948,
      "vote_count": 18,
      "budget": 16000000,
      "overview": "Pete St. John is a powerful and successful political consultant, with clients spread around the country. When his long-time friend and client Ohio senator Sam Hastings decides to quit politics, he is rapidly drafted to help with the campaign of the man destined to succeed him, unknown and mysterious businessman Jerome Cade...",
      "similar": [
         10139,
         77953,
         10316,
         9388,
         5125,
         8834,
         9452,
         891,
         9798,
         10200,
         582,
         665,
         2503,
         376290,
         399055,
         446354,
         3291,
         26389,
         35056,
         1369
      ],
      "original_title": "Power",
      "runtime": 111,
      "poster_path": "/o6vGfyfBzCUCTX03061kxgD52Ty.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         },
         {
            "name": "",
            "iso_639_1": "yi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lorimar Productions",
            "id": 898,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Polar Entertainment",
            "id": 17411,
            "origin_country": ""
         }
      ],
      "release_date": "1986-01-31",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "More seductive than sex... More addictive than any drug... More precious than gold. And one man can get it for you. For a price.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney Lumet"],
      "runtime": 111,
      "synopsis": null,
      "writers": ["David Himmelstein"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091786/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4ODI5Mzk0M15BMl5BanBnXkFtZTcwNTMzNjEyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Gere, Julie Christie, Gene Hackman | See full cast and crew »"],
      "reviews": [
         "Having worked in the political consulting industry, I found this film very realistic and true to form, although no one I knew had a private jet and I never got to take showers with my personal assistant. But the strategies and tactics shown in the film are a very good example of how the industry works. I enjoy watching the film every so often to remind me how much I did enjoy the business and how happy I am that I am no longer in it. The one thing they forgot to show was how difficult it was to collect our fees after the elections were over.",
         "Nearly 20 years after its initial release, Sidney Lumet's \"Power\" is more timely than ever. With the U.S.A. currently under the leadership of an individual who entered the Presidency with no democratic mandate, having lost the general election, who attained office by virtue of a de facto appointment by the United States Supreme Court, and who has since chosen to make the country the aggressor in an internationally condemned war of 'preemption', many Americans are left wondering how such a mental and political lightweight attained the highest office in the land. This film helps make clear the process by which many venal, poorly qualified candidates are able to achieve office in American politics. It portrays the power of the most adept advertising industry in the world as it is used to slickly package a political product for the voting public's consumption, and how foreign economic and political interests can play an important role in the process. With a sizable cast, it's perhaps not surprising that the quality of the performances varied as widely as they did. Richard Gere does an excellent job as Peter St. John, the packager for candidates running in several different elections through the course of the movie. Denzel Washington displays a reptilian cold-bloodedness as his antagonist, a quality he will bring to full fruition in the later \"Training Day\" (2001). J.T. Walsh, one of the best at playing villains, is also good in his limited role. Kate Capshaw and E.G. Marshall hold up their parts well, but Julie Christie and especially Gene Hackman are not at their best here. Beatrice Straight received a well-deserved Razzie nomination for Worst Supporting Actress. After her big scene, there wasn't a piece of the set that didn't have her teethmarks all over it. The cinematography, by Andrzej Bartkowiak, was terrific, and the musical score complemented the film well, particularly the repeated use of Bennie Goodman's \"Sing, sing, sing\" with its driving drum solo (by Gene Krupa in the original recording, I believe) used to symbolize St. John's ambition. Two trivia points: The television game show St. John turns on in his hotel room when he discovers his phone has been bugged is, appropriately, \"The Price is Right.\" The rock outcrop scenery for the political commercial supposedly being filmed in Chaco Canyon, New Mexico is actually part of Vasquez Rocks in southern California, a backdrop that has been used in countless movies and television shows. As political films go, \"Power\" is much better than average and well worth viewing. Rating: 7/10.",
         "The box cover and the title for the movie are wrong. This is not a movie about power, but the power of the media. The cover shows a little figure of a man (Gere) standing in the center of the title: Power. Almost as timeless as Network, Power is also the story of the media and the power it has over the world. Gere is the star of the film, but Gene Hackman and Denzel Washington carry the film with their great supporting roles. Although the plot of the South American candidate disappears somewhere in the middle of the movie, the story of the 3 other candidates in Washington, Ohio and New Mexico is what keeps the movie going. An interesting and very true look into the world of the media in politics, Power is a shelved classic that is worth the watch.",
         "Everyone involved (and the audience) should seek out \"The Candidate\" to see how good this movie could have been. What happened the South American story? What were Julie Christie and Kate Capshaw thinking to allow their roles to be cardboard cut-outs. Up to now I have liked every Gene Hackman performance and/or movie. He was either disinterested (which I can hardly believe) or dreadfully miscast. I have also liked and defended Richard Gere (and been vilified for it). But here he had no \"power\". He was never intimidating and only occasionally persuasive. All in all I was very disappointed. I really expected much more from this director and cast. If you can't find \"The Candidate\" watch \"Wag the dog\" again or even \"Bulworth\".",
         "Power was at first a dauntingly big movie to take in. Looking at it from the perspective of the lead character played by Gere (Pete St John) ... what you'll see here is a man working like a dog trying to promote a range of political candidates all over a big country. On the surface it looks like he's working only for the money. But as you dig deeper, he actually is very carefull about his work. I felt the movie was very accurate in showing us what happens in a major league PR Firm. And as it turns out the side comments Pete St John makes (Gere) and his staff show the true challenges their job entails. It's both educational and accurate. I liked the movie a lot. It has inspired me to work in the PR field. And I recommend anyone to watch it and learn from it.",
         "There is a reason this political film flies under the radar; I doubt it's up for rediscovery, either. A power cast and a power director (Sidney Lumet--director of Dog Day Afternoon and Network) should somehow add up to more than this limp media expose, but once in a while a movie is just an entertainment, and with Richard Gere in thoughtful mode (without much of a character or a script), Julie Christie as a concerned ex-spouse, and Denzel Washington cast against type, this is an OK two hours that don't demand much from the viewer, and, while predictable, certainly meant well. It was the script, Sidney, and someone should have told you. Wag The Dog is the political gem that works; The Candidate or even better, the original Manchurian Candidate with Sinatra are more persuasive--but if you like the stars, this one passes the time pleasantly.",
         "Sidney Lumet's \"Power\" makes an analysis on how political campaigns are made and the work of people behind it like Pete St. John (Richard Gere), a media consultant chosen to work for a unknown candidate for Ohio senate, the businessman Jerome Cade (J.T. Walsh) who is about to take the seat of an more experienced Senator (E.G. Marshall) longtime friend of Pete. Pete's unsure if this man will make the same good things his old friend did while as member of the Congress but he takes the challenge and accept the job. Pete will make things work out, after all he's the best man in his business, young, talented and ambitious with an enormous taste for the power (the biggest aphrodisiac of all, some might say). But, in this particular campaign he'll join forces with Arnold Billing (Denzel Washington), a unscrupulous public relations who doesn't trust Pete and vice versa, and while working on promoting the new Senator, Pete investigates Billing trying to figure out what he and his associates have to hide from him. And of course the other side will do the same and that will give something to St. John reflect on his way of living and the way he conduces things (e.g. the manipulated video campaign of a Latin politician trying to save a girl during a protest; Pete was behind everything telling how the man should act in order to get sympathy from his voters). Luckily, on his side there's old friends like his ex-wife, the journalist Ellen (Julie Christie) and his former partner in business Wilfrid (Gene Hackman), now a drunken, decadent and highly ethical man who no longer makes good campaigns for his clients. David Himmelstein's screenplay fascinates us for showing the importance of a candidate's image and how influential media consultants can be in doing marvelous (and totally manipulated) campaigns. One small thing makes a huge difference in getting elected or not. \"Power\" has a realistic view of money and power and how they work together but there's a catch in the final moments that almost ruins the film. This realism which was working quite well succumbed to a happy ending where good idealism and honesty wins over the power of corruption, lies and deceptions, quite rare back in the 1980's and even more now in the 21st century, specially when it comes to politics. The movie denied itself with this; the writer's rhetoric failed at this point but it's nothing so harmful, it's just a little contradiction. However, the script has another problem, this one concerning the motivations behind the characters, what they were fighting for, what they were up against; there's too many sides (Cade's working for powerful people like him, who seems to be dealing with oil from the Arabs; the idealist junior candidate played by Matt Salinger wants to protect the environment; and there's another one but we cannot care about him); it was all confusing, muddled, quite complicated to follow everyone and everything. To give an example of another work directed by Sidney Lumet on a similar subject of media that worked better with these side issues \"Network\" was terrific and effectively great, we all knew which character was standing for and why. Just like \"Network\" this also has big names in the casting but the performances pale in comparison. Gere is quite comfortable in the main role, even though most critics argue he wasn't a good choice; I enjoyed him playing this kind of guy who seems to be a villain but it turns out he's not that bad; Christie is good; Hackman was very underused and Beatrice Straight was quite distractive as the old Senator's wife. The movie offers a highlight to Denzel Washington playing a tough type to crack, the real antagonist even though this is not being the usual hero versus villain film. By far, Denzel is the one you can't take your eyes off for the whole thing. Highly watchable for what the story has to say, the lessons some of us can learn with elections and how illusionary they can be. \"Power\" indeed is a powerful drama. 9/10",
         "The main character in \"Power\" is Pete St. John, a highly successful media consultant. Pete is to the world of politics what a public relations consultant would be to the world of business. His job is to advise candidates for political office on the best way in which to present themselves to the media and to the electorate. The film focuses on four of Pete's clients- Roberto Cepeda, running for the Presidency of an unnamed Latin-American country, Wallace Furman, running for the Governorship of New Mexico, Andrea Stannard, the incumbent Governor of Washington State, and Jerome Cade, running for the Senate in Ohio. We are supposed to accept Pete as a ruthless and cynical individual, and he is certainly prepared to act for anyone regardless of their political beliefs. His four clients are, politically speaking, very different. Cepeda is a left-wing populist, Cade a right-wing businessman with ties to the oil industry, Stannard a social liberal and Furman another businessman but a man with few political ideas even though he is anxious for a political career. Cade is hoping to win the Senate seat being vacated by Sam Hastings, who is not merely a former client of Pete's but also a personal friend. Hastings holds environmentalist views which are diametrically opposed to Cade's pro-business opinions, and Pete suspects that his friend may have come under pressure to stand down from the Senate. Pete is forced to take a hard look at himself and to decide whether (as his ex-wife Ellen and his former partner Wilfred believe) he owes his success to a lack of principles. The film came out in 1986, a time when America was just starting to recover from the trauma of the Watergate scandal of the previous decade. Although many (principally Republicans) believed that Ronald Reagan, who had just won his second successive landslide victory, had restored the American people's faith in their political system, there were many others (not only Democrats but also many foreign observers) who felt that the American people had been the victims of a gigantic political con-trick, that they had been induced to vote for Reagan by a slick political marketing campaign. A film about a slick political marketing man therefore seemed very topical in the mid-eighties. The film was directed by Sidney Lumet, and could have been an opportunity to do for the American political system what Lumet had done for the American media in the brilliantly satirical \"Network\" around a decade earlier. Unfortunately, it never really works in the same way as \"Network\" had done, for a number of reasons. The first is the acting. \"Network\" had at its centre a towering performance from Peter Finch, well-supported by excellent contributions from William Holden and Faye Dunaway. There is nothing really comparable in \"Power\". Although Richard Gere is good in the earlier part of the film as the unscrupulous smooth operator, he seems less convincing later on when Pete rediscovers his principles. The supporting actors are not very memorable; there are some big names in the cast, but Julie Christie as Ellen, Gene Hackman as Wilfred and E. G. Marshall as Sam have all done much better things than this. Perhaps the best is Denzel Washington as Arnold Billing, Cade's ruthless public relations man. The second reason for the film's relative lack of success is that it never actually succeeds in convincing us that Pete really is all that unprincipled. He may not care very much whether his clients come from the left or right of the ideological spectrum, but we never actually see him do anything unethical until, ironically, after his supposed \"conversion\" when he supplies confidential information to his client's opponent. We see commercials he makes in support of Furman and Stannard, but both are very mild and defensive in tone. A really unscrupulous politician like Richard Nixon, notorious for his use of \"dirty tricks\" against opponents, would have sacked Pete from his campaign team for being a pussy. The third reason is that there are too many competing story lines. It would have made for a more dramatic and powerful film if Lumet and the scriptwriter David Himmelstein had concentrated on just one, preferably the Senatorial race in Ohio, which is the most important and most potentially interesting of the four stories. The Latin American storyline seems to be dropped quite early on- we never learn whether Cepeda becomes President of his country- but the Ohio story is continually interrupted as Pete jets off to Seattle or Santa Fe. \"Power\" is not altogether a bad film. The problem is that it could have been so much better. The idea of a film examining political corruption, not just the corruption of those who seek to wield power through holding political office but also the corruption of those who seek to wield power by influencing public opinion, was a good one. It could have been the occasion for a brilliant film. Unfortunately, \"Power\" tries to be that film but falls some way short of what it could have been. 6/10",
         "Richard Gere, in hypomanic mode, runs a PR firm and his job is to shape up political candidates, regardless of their party affiliation or policies, so that they win office. He makes a good deal of money doing it. If his clients object to his taking over their lives and turning them into phonies, his response is, \"After you're elected you can do whatever your heart tells you to do, but you have to get there first.\" Good, sound, pragmatic advice. The film actually fits into a minor genre -- one in which a politician must learn all about what sociologists call \"the presentation of self.\" It's the difference between perception and substance. Of course we all do it every day. It's essential that we slant our behavior in ways suitable to our audience. None of us talks to the boss the same way we talk to our spouses or our children. But it's particularly tough on politicians because they're cast as role models. The audience they have to satisfy is a great BIG one and often unforgiving. Anyway, Gere pursues his job with zeal. He loves it. He carries around a set of drum sticks and when he's relaxing he taps out some uptempo paradiddles from Benny Goodman's uptempo jazz recordings. That, I would guess, is one of the contributions of the director, Sidney Lumet, and he makes good use of that little bit of business. When Gere is finally confronted by the manager of one of his candidates and told frankly how rotten their jobs really are, Gere is later seen turning uncharacteristically pensive. He still holds the two drum sticks, but he's not tapping out a fast tune in in his head. The sticks are pressed against his cheek. But it's not an especially believable moment because the revelation -- from an almost unrecognizably youthful Denzel Washington -- should never have come as a big surprise to him. If he hasn't realized before that he has the methods and scruples of a Frito salesman he's pretty dumb. The script itself lets the movie down a bit, for a couple of reasons. The two principle weaknesses, so it seems, are that it treats the manipulation of politicians' images as revelatory. Gere advises a candidate for governor of New Mexico to shed his dark blue suit and tie and adopt a cowboy outfit and to forget about long-term goals and just spout inanities about \"America's spirit\" and \"the freedoms we hold dear\" -- and this is supposed to surprise us? US? Now? In 2011? It was all done better in \"The Candidate\" and in \"A Face In The Crowd,\" years earlier. The other major weakness in the script is that it's confusing. We see Gere handling so many candidates -- and confronting rival candidates and their managers -- and dealing with Gene Hackman as a drunken has-been -- that it's hard to keep all the threads straight. Sometimes I didn't know who was who. It would have enhanced the drama if the script had stuck with just one or two candidates and their minions. It's not a stupid movie though. It doesn't take sides. It doesn't insult our intelligence -- well, not much, anyway -- although it lacks sophistication. Lumet has directed it efficiently and the performances are all up to par, although the movie as a whole belongs strictly to Richard Gere. I suppose there really are characters like Gere's, dashing around in airplanes from city to city, jitterbug music whirling around in their heads, women falling at their feet, the shekels rolling in, ordering millionaires around. But I don't know why they don't stroke out after a year or so of this frenzied life style. I had to do a double Xanax just watching it.",
         "Perhaps this film would have hit me harder in 1986, but now, with so many movies and so much news reporting about the inner workings of politics and image-makers, I watched it on DVD (loaned by Ron and Evelyn) and came away thinking, \"so what?\" There really isn't anything new or Earth-shaking. Gere is good as the hot-shot political consultant who gets high dollars to get candidates elected to offices at various levels all over the USA and even Central and South America. He tells them, \"do what I tell you and after you get into office, you can do whatever you want.\" I got the feeling that the movie is very authentic but has no great impact when it was over. The critic Ebert has a very fair and complete review. It's median IMDb vote of '6' is about right."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Lorimar Productions",
         "Polar Entertainment"
      ],
      "summaries": ["Pete St. John is a powerful and successful political consultant, with clients spread around the country. When his long-time friend and client Ohio senator Sam Hastings decides to quit politics, he is rapidly drafted to help with the campaign of the man destined to succeed him, unknown and mysterious businessman Jerome Cade. In parallel and unaware of the potential dangers, he proceeds to unravel the mystery surrounding Hastings dropping out with the aide of his ex-wife, a prominent Washington-based journalist. But interests more powerful than local arm wrestling are at stake and things start getting awry."],
      "budget": 0
   },
   "movielensId": 49757,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-01-31",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["Sidney Lumet"],
      "runtime": 111,
      "movieId": 49757,
      "title": "Power",
      "mpaa": "",
      "actors": [
         "Richard Gere",
         "Julie Christie",
         "Gene Hackman",
         "Kate Capshaw",
         "Denzel Washington",
         "E.G. Marshall",
         "Beatrice Straight"
      ],
      "imdbMovieId": "0091786",
      "originalTitle": "Power",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["qjv6Z9QmoAw"],
      "plotSummary": "Pete St. John is a powerful and successful political consultant, with clients spread around the country. When his long-time friend and client Ohio senator Sam Hastings decides to quit politics, he is rapidly drafted to help with the campaign of the man destined to succeed him, unknown and mysterious businessman Jerome Cade...",
      "tmdbMovieId": 46948,
      "avgRating": 2.76471,
      "releaseYear": "1986",
      "numRatings": 17,
      "posterPath": "/o6vGfyfBzCUCTX03061kxgD52Ty.jpg"
   }
}