{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "islam",
            "id": 187
         },
         {
            "name": "middle east",
            "id": 539
         },
         {
            "name": "refugee",
            "id": 972
         },
         {
            "name": "afghanistan",
            "id": 3541
         },
         {
            "name": "famine",
            "id": 4337
         },
         {
            "name": "mujahid",
            "id": 5389
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "taliban",
            "id": 7955
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "red cross",
            "id": 160832
         },
         {
            "name": "iranian new wave",
            "id": 209997
         }
      ],
      "imdb_id": "tt0283431",
      "video": false,
      "title": "Kandahar",
      "recommendations": [
         49168,
         125251,
         68553,
         29933,
         43969,
         10834,
         45129,
         131836,
         42634,
         42144,
         44284,
         107035,
         198835,
         102514,
         110771,
         47113,
         117239,
         71329,
         138093,
         49650
      ],
      "backdrop_path": "/1HUHViYlTZhEUKB7CEKbguPq7GP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Naghadar",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea0b",
               "name": "Ike Ogut",
               "profile_path": null,
               "id": 99945,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nafas",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea0f",
               "name": "Nelofer Pazira",
               "profile_path": "/ep50AdRnNiaIP4s1BE6ayFHmOpZ.jpg",
               "id": 99946,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tabib Sahid",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea13",
               "name": "Hassan Tantai",
               "profile_path": null,
               "id": 99956,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Khak",
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea17",
               "name": "Sadou Teymouri",
               "profile_path": null,
               "id": 99958,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Hayat",
               "gender": 1,
               "credit_id": "52fe457ec3a368484e05ea1b",
               "name": "Hoyatala Hakimi",
               "profile_path": null,
               "id": 99959,
               "order": 4
            },
            {
               "cast_id": 27,
               "character": "Three children (voice)",
               "gender": 0,
               "credit_id": "599d7c97c3a368284801eaee",
               "name": "Noam Morgensztern",
               "profile_path": null,
               "id": 1169737,
               "order": 5
            },
            {
               "cast_id": 28,
               "character": "",
               "gender": 0,
               "credit_id": "599d7ca29251411f5101de23",
               "name": "Monica Hankievich",
               "profile_path": null,
               "id": 1875119,
               "order": 6
            },
            {
               "cast_id": 29,
               "character": "",
               "gender": 0,
               "credit_id": "599d7cacc3a368287201cff1",
               "name": "Zahra Shafahi",
               "profile_path": null,
               "id": 1875120,
               "order": 7
            },
            {
               "cast_id": 30,
               "character": "",
               "gender": 0,
               "credit_id": "599d7cb69251411f5101de38",
               "name": "Safdar Shodjai",
               "profile_path": null,
               "id": 1875121,
               "order": 8
            },
            {
               "cast_id": 31,
               "character": "",
               "gender": 0,
               "credit_id": "599d7cba9251411f3f01cfbf",
               "name": "Mollazaher Teymouri",
               "profile_path": null,
               "id": 1875122,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea21",
               "name": "Behroz Shahamat",
               "profile_path": null,
               "id": 100011,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea27",
               "name": "Faroukh Fadace",
               "profile_path": null,
               "id": 100012,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea2d",
               "name": "Mojtaba Mirtahasebi",
               "profile_path": null,
               "id": 100013,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea33",
               "name": "Kaveh Moinfar",
               "profile_path": null,
               "id": 100014,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea39",
               "name": "Akbar Meshkini",
               "profile_path": null,
               "id": 100015,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea3f",
               "name": "Hossein Amiri",
               "profile_path": null,
               "id": 100016,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea45",
               "name": "Hashem Gerami",
               "profile_path": null,
               "id": 100017,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea4b",
               "name": "Mastaneh Mohajer",
               "profile_path": null,
               "id": 100018,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea51",
               "name": "M. R. Sharifiniya",
               "profile_path": null,
               "id": 100020,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea57",
               "name": "Siamak Alagheband",
               "profile_path": null,
               "id": 100021,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea5d",
               "name": "Abbas Sagharisaz",
               "profile_path": null,
               "id": 100023,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea63",
               "name": "Mohammad Reza Darvishi",
               "profile_path": null,
               "id": 100026,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea69",
               "name": "Ebrahim Ghafori",
               "profile_path": null,
               "id": 20033,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea6f",
               "name": "Mohsen Makhmalbaf",
               "profile_path": "/pkPhuxSyPBmiVKcPZgrUXc9i41H.jpg",
               "id": 120226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea75",
               "name": "Mohsen Makhmalbaf",
               "profile_path": "/pkPhuxSyPBmiVKcPZgrUXc9i41H.jpg",
               "id": 120226,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe457ec3a368484e05ea7b",
               "name": "Mohsen Makhmalbaf",
               "profile_path": "/pkPhuxSyPBmiVKcPZgrUXc9i41H.jpg",
               "id": 120226,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.111745,
      "production_countries": [
         {
            "iso_3166_1": "IR",
            "name": "Iran"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 28171,
      "vote_count": 29,
      "budget": 0,
      "overview": "After an Afghanistan-born woman who lives in Canada receives a letter from her suicidal sister, she takes a perilous journey through Afghanistan to try to find her.",
      "similar": [
         205,
         347882,
         11675,
         26842,
         63849,
         17813,
         4723,
         9585,
         9844,
         4291,
         14448,
         347868,
         428006,
         2538,
         86997,
         2197,
         24225,
         378331,
         40898,
         119104
      ],
      "original_title": "Safar e Ghandehar",
      "runtime": 85,
      "poster_path": "/NBtNYNV2Plp3nfcbXTL3XNjeQw.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "فارسی",
            "iso_639_1": "fa"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         },
         {
            "name": "پښتو",
            "iso_639_1": "ps"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Makhmalbaf Productions",
            "id": 54377,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bac Films",
            "id": 208,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Studio Canal",
            "id": 5870,
            "origin_country": ""
         }
      ],
      "release_date": "2001-05-11",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.makhmalbaf.com/movies.php?m=10",
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mohsen Makhmalbaf"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Mohsen Makhmalbaf"],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0283431/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3NDM2NTE0MV5BMl5BanBnXkFtZTYwNzc0NDk5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Nelofer Pazira, Hassan Tantai, Ike Ogut | See full cast and crew »"],
      "reviews": [
         "The film's great success with audiences was in part due to the timing of its release, at a moment when Afghanistan had been catapulted into the headlines by the activities of the Taliban and the attacks of September 11, 2001\u0085 But the motion picture, directed by one of Iran's most prominent film artists, is much more than a story pulled out from the headlines\u0085 It stars Nelofer Pazira, a female journalist, based in Canada, playing Nafas, who is trying to get into Afghanistan to reach her sister who lives in Kandahar\u0085 Nafas's sister is threatening suicide because of the intolerable oppression of women by the Taliban\u0085 In the course of her long and dangerous journey, Nafas encounters a mixed array of Afghan people, many of them refugees\u0085 An old man agrees to take her into the country disguised as his fourth wife\u0085 Later she acquires a young boy, Khak (Sadou Teymouri), as her guide after he has been expelled from a religious school\u0085 On the way she meets Tabib Sahid, an African-American who had come to fight the Soviets but who is now practicing medicine\u0085 \"Kandahar\" mixes documentary authenticity with extraordinary moments of visual strangeness ad beauty\u0085 The Burka is an ever-present symbol of women's subjugation, yet underneath women wear varnished nails and lipstick, and their brightly-colored robes affirm their individuality\u0085 The film placed the suffering of the Afghan people, particularly the women, on an international stage\u0085",
         "When you see `Kandahar,' it's almost impossible to believe that you're watching a film set in the late 20th Century. Mohsen Makhmalbaf's film takes place in Afghanistan in the latter days of the Taliban regime, when women were not merely viewed as second class citizens, but were denied any form of education or civil rights and even had to go out in public covered from head to toe to prevent men from seeing their faces. The filmmaker takes us to the heart of this alien and frightening world and makes us see, perhaps for the first time on the big screen, just how horrific life was for women in that time and place. `Kandahar' is less a narrative film than a series of fascinating vignettes that drive home the realities of life in that part of the world. What plot there is involves the efforts of a female Canadian journalist to sneak back into her native country to prevent her desperate sister in Kandahar from committing suicide at the next solar eclipse. But that is really just a string on which to hang the individual pearls that make up the film. What is of primary interest to both the filmmaker and the audience are the various people the journalist encounters and the many experiences she undergoes. Hidden beneath her own burka, she witnesses firsthand the devastating poverty, the utter degradation and de-humanization of women, and the authoritarian oppression that defined life in that country during the Taliban rule. Along the way, she meets an American doctor who is trying his hardest to in some way relieve the misery of these people, but who finds himself waging a losing battle against the primitivism and theocratic oppression that have made life a living hell for the common citizenry of the country. She also encounters a seemingly endless group of people who have become dismembered by all the land mines left over from the Afghani war with the Russians. There is one remarkable scene wherein hordes of desperate, one-legged men hobble on crutches across the desert as Red Cross helicopters rain prosthetic limbs down onto the sands below. It is merely one among many images from the film that seer themselves into the viewer's memory. Another is a scene in which a male doctor has to examine his female patients through a hole cut out of a sheet, not even being allowed to talk to the woman directly about her symptoms but having to get his information through a male (or female child) `interpreter.' Makhmalbaf keeps the ending of the film deliberately ambiguous which might frustrate some viewers but which actually adds to the verisimilitude of the piece. In the same way, much of the acting in the film borders on the amateurish at times, but again that contributes to the pseudo-documentary aura that the film must have to be truly effective. A clear-cut narrative resolution and slick performances by obviously professional actors would likely rob the film of its much-needed sense of immediacy. `Kandahar,' by providing a voice to so many voiceless people, is a film that cries out to be seen.",
         "This is an extremely beautiful film which inhabits a visual and emotional territory somewhere between Werner Herzog and Pasolini. As others have stated, the actors are non-professionals and the plot is not the stuff of Hollywood melodrama. However the images and sounds are haunting and profound. Mahkmalbaf is truly a poet of the cinema. The film does not attempt to make a political analysis of the situation of Afghanistan in 2001, but operates on a more humanistic and emotional level, showing the human consequences, the poverty both material and spiritual of life under the Taliban and the indifference of the outside world. The \"doctor\" character, far from being implausible, is played by a real person with a very similar history. He is also a stand-in within the film for Makhmalbaf himself, who started as an Islamic fundamentalist revolutionary but has moved towards a more open-minded humanism. The film itself describes a circle, the first scene is also the last, the sun shining through a burqa onto a woman's face. Between are unforgettable images, and a transit across a surreal and nightmarish landscape. Surrender yourself and you will really feel you have been on a journey. The UK DVD also includes \"The Afghan Alphabet\" a similarly fictionalised documentary on the struggle to bring education to the three million or so Afghan refugees in Iran.",
         "The comment on the Indian music is off base - Indian music and DVDs are common in Afghanistan as the local entertainment industry is still recovering from the Taliban. Bollywood film DVDs are sold in Kabul. Pictures and posters of Indian actresses are popular here. It isn't unusual to hear recorded Sitar music here in Kabul. Afghan and Indian music was distributed secretly at great risk during the Taliban reign. There is just not enough Afghan material yet and Afghans love music, even if they don't understand Urdu. There is a scene in the movie where an instrument is seized by the Taliban before the wedding. So the soundtrack was completely appropriate for me. Hopefully we will see a feature film made inside Afghanistan someday. Its a beautiful and fascinating place and holds fascinating stories.",
         "I was moved by the beauty brought to a situation of suffering and tragedy. As our protagonist struggles to find her sister, the horrors of postwar Afghanistan are revealed through simple encounters with a variety of people with struggles of their own. The pacing, which may seem tedious to folks used to fast action, allows a lyrical visual beauty to arise where another filmmaker may have shown chaos. In turn, this lyrical beauty creates a stillness where compassion begins and grows. What was distant & abstract becomes close & personal. We're shown a perspective on war that is at once starkly simple and deeply caring. I also enjoyed the taste of Persian culture. The legacy of Hafiz, Rumi & other great Persian poets flavors the vivid poetics of Makhmalbaf's cinematography, dialog, and plot structure. Quite a taut alternative to our American viewpoint.",
         "All cultural values are in some senses relative. We make criticise, say, the Taliban regime in Afghanistan for forcing women to wear the burka; but our own society enforces different standards with regard to the male and female exposure of the chest. We might therefore say that the burka is oppressive not so much in itself but rather as part of a system that undermines the freedom of women; but this is to assume that in our sexist, and over-sexualised, society, women are in practice freer. In fact, I believe they are; but at some level it is important to acknowledge the arbitrariness of such positions at the deepest level; that they depend on prejudice (to use that word non-prejudicially), on values rather than reason. To argue that because we know nothing for certain we should therefore do nothing, think nothing is a doctrine of futile despair; but to be aware of the limitations of our own thinking, to know that for certain future generations will surely condemn us are clearly as we condemn others, is vital before we consider the values of societies other than our own, a secular equivalent of humility before God. This is not to say I would like to see a film defending the appalling Taliban. But even the most tyrannical regime is in some regards the product of the society it tyrannises: we are all both prisoners and guards. To understand that regime (and its true horrors), one needs to understand how it worked with, as well as against, the grain of traditional society; and what is good, as well as what is bad, about that. Unfortunately, this is not what we get with 'Kandahar'. It's a shame, because this film contains the potential material for exploring the ambiguity of life. Its central character is rude, arrogant and ambitious (a journalist travelling to Afghanistan to try and save her sister, she doesn't hesitate to try to try and make a story out of her ordeal at the same time). A returning exile, she might be considered as both having the right to criticise what is happening to her country and also the eyes of one who has seen enough to know what is wrong. But one could just as easily say that she has neither that in fact she has the rights to neither position. There is thus the potential to portray her with great ambivalence; but 'Kandahar' prefers the values of propaganda. So instead she is our witness, our seer and our reliable narrator; and the film is all the weaker for it. 'Kandahar' contains some great footage of a bleak but beautiful country, but at times its limited budget shows. The dialgoue is strange, the second most important character is (bizarrely) an American, and a number of the scenes sit uneasily between documentary and fiction: Michael Winterbottom did something similar in 'In This World', but that film was more convincing, because the agenda of the director was less clumsily imposed on every scene. 'Kandahar' has neither documentary truth or dramatic ambiguity; and seems to view the world with a very Western slant. Perhaps evil is like Schroedinger's cat: something that can be labelled or shown, but not both at the same time. 'Kandahar' prefers to label; but I prefer more subtlety in my films.",
         "Filmed on the Iran/Afghanistan border, KANDAHAR is a semi-documentary style movie that chronicles the perilous journey undertaken by an expatriate female journalist, Nafas, to reach the city of Kandahar, where she hopes to rescue her sister from committing suicide during an impending eclipse. However, Nafas's odyssey is really little more than a device to lift the veil on the poverty and hardship of life in Taliban-controlled Afghanistan. Through a series of vignettes, the movie succeeds beautifully in revealing insights that are both fascinating and harrowing. It is almost impossible to imagine a culture so far removed from the relatively comfortable life enjoyed by more \u0091civilised' nations. Young boys rock back and forth, reciting the Koran while learning to become Mullahs, pausing only to recite the meaning and purpose of the sabre and semi-automatic machine gun when prompted by their teacher; young girls have lessons in how to resist the temptation to pick up possibly booby-trapped dolls; a doctor treats his female patient by speaking to them via children as they sit either side of a makeshift screen, and conducts his examinations through a small hole in the screen; the threat and consequences of land-mines pervade everybody's life, and year-long waits for prosthetic legs are commonplace, so that prosthetics become a black-market currency. True, the acting is poor \u0096 most of the cast are non-professionals, many never even having seen a moving picture before appearing in this film \u0096 but, the purpose of this movie was not to dazzle us with superior acting; it was to open an eye to the hardship endured by both men and women in an oppressive regime, and, at this, it succeeds beautifully.",
         "I amazed with Hindu devotional song used in background. It reminds that all god are same one and only but we pray at differently. I have seen good movie, second to About Elly. Good movie. must watch. It pictured day to day life of Afghan women. It induce lot of inner questions like Dr. in this film. Why should all happen for that people? why they can not like others in this world? Director & lead charter in this story done marvelous work. All charter brings the really in their face. I love background music , really fantastic.",
         "I was very disappointed with this film. An excellent chance to portray the plight of the Afghan people was partially wasted. Aside from a few interesting glimpses of the culture of the Afghan refugees, this film has few redeeming qualities. The scenes are contrived, the plot is sparse, and the acting is wooden. The crew would have been much better off filming a true documentary.",
         "I do not know if anyone else over here has realised this or not. Probably, may not be, because most of the people I found here were from either the US or UK or other Westerners. If you listen to the song which they play once in a while in this movie, it will match the following lyrics: Thwannaama Keerthana Rathaah Thava Divya Naama Gaayanthi Bhakthi Rasa Paana Prahrushta Chiththaah Daathum Krupaasahitha Darshanamaashu Thebhyah Sri Sathya Sai Bhagawan Thava Suprabhatham (Meaning in English: Devotees engrossed in singing Thy Glory are happy and blissful, when they taste the nectar of devotion. Kindly shower Thy Grace by granting them Thy Darshan. O Lord Sathya Sai! Blessed by Thy wakefulness, we pray for an auspicious day.) Aadhaaya Divya Kusumaani Manoharaani Sreepaada Poojana Vidhim Bhavadanghri Mooley Karthum Mahothsukathayaa Pravishanti Bhakthaah Sri Sathya Sai Bhagawan Thava Suprabhatham (Meaning: Bringing holy flowers with captivating colors and fragrance, for worshipping Thy Lotus Feet, in the form as prescribed by the scriptures, Thy devotees are coming in, with great yearning and enthusiasm. O Lord Sathya Sai! Blessed by Thy wakefulness, we pray for an auspicious day.) This as you might see is a verse from a song in Sanskrit in praise of a Hindu god! This is not a bloody Afghani song. This does not have any connection to Afghanistan and neither does it make any sense in the situations where it has been used in this movie. This again shows the amateurishness of this movie, apart from the crappy acting, etc. There hasn't been any research done before even attempting to take such a movie and that is quite alarming! The above song btw is is called Sri Satya Sai Suprbhatham and probably almost every Hindu in India would have heard this song! I do not understand how it did find its way into an Afghani movie!! Couldn't the movie makers apply some common sense b4 stealing a song which they thought would be cool to have in the backdrop???"
      ],
      "genres": [
         "Biography",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Bac Films",
         "Makhmalbaf Productions",
         "StudioCanal"
      ],
      "summaries": [
         "Nafas is a reporter who was born in Afghanistan, but fled with her family to Canada when she was a child. However, her sister wasn't so lucky; she lost her legs to a land mine while young, and when Nafas and her family left the country, her sister was accidentally left behind. Nafas receives a letter from her sister announcing that she's decided to commit suicide during the final eclipse before the dawn of the 21st century; desperate to spare her sister's life, Nafas makes haste to Afghanistan, where she joins a caravan of refugees who, for a variety of reasons, are returning to the war-torn nation. As Nafas searches for her sister, she soon gets a clear and disturbing portrait of the toll the Taliban regime has taken upon its people.",
         "After an Afghanistan-born woman who lives in Canada receives a letter from her suicidal sister, she takes a perilous journey through Afghanistan to try to find her."
      ],
      "budget": 0
   },
   "movielensId": 4977,
   "movielens": {
      "languages": [
         "English",
         "فارسی",
         "Polski",
         "پښتو"
      ],
      "releaseDate": "2001-05-11",
      "dvdReleaseDate": "2003-05-13",
      "directors": [
         "Mojtaba Mirtahasebi",
         "Kaveh Moinfar",
         "Mohsen Makhmalbaf"
      ],
      "runtime": 85,
      "movieId": 4977,
      "title": "Kandahar",
      "mpaa": "",
      "actors": [
         "Ike Ogut",
         "Nelofer Pazira",
         "Hassan Tantai",
         "Sadou Teymouri",
         "Hoyatala Hakimi",
         "Noam Morgensztern",
         "Monica Hankievich",
         "Zahra Shafahi",
         "Safdar Shodjai",
         "Mollazaher Teymouri"
      ],
      "imdbMovieId": "0283431",
      "originalTitle": "Safar e Ghandehar",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "After an Afghanistan-born woman who lives in Canada receives a letter from her suicidal sister, she takes a perilous journey through Afghanistan to try to find her.",
      "tmdbMovieId": 28171,
      "avgRating": 3.50198,
      "releaseYear": "2001",
      "numRatings": 253,
      "posterPath": "/NBtNYNV2Plp3nfcbXTL3XNjeQw.jpg"
   }
}