{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "violin",
            "id": 4721
         },
         {
            "name": "alternate timeline",
            "id": 186760
         },
         {
            "name": "foreign occupation",
            "id": 186761
         },
         {
            "name": "1990s",
            "id": 210608
         }
      ],
      "imdb_id": "tt0381348",
      "video": false,
      "title": "The Place Promised in Our Early Days",
      "recommendations": [
         79707,
         37910,
         38142,
         14069,
         198375,
         33320,
         28874,
         18143,
         222715,
         13754,
         303560,
         15951,
         212167,
         110420,
         22520,
         10494,
         58700,
         83389,
         13398,
         115416
      ],
      "backdrop_path": "/hfsTcAenYaeKVE8nzYyGsEHWB1a.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Hiroki Fujisawa (voice)",
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2d3",
               "name": "Hidetaka Yoshioka",
               "profile_path": "/AhCASMZy5Rz6YjHaFccHfKkDxsg.jpg",
               "id": 111691,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Takuya Shirakawa (voice)",
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2d7",
               "name": "Masato Hagiwara",
               "profile_path": "/tThZReKHnIabqMLfNV0EzdxHbFf.jpg",
               "id": 116321,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Sayuri Sawatari (voice) (as Yuuka Nanri)",
               "gender": 1,
               "credit_id": "52fe452d9251416c7504e2db",
               "name": "Yuuka Nanri",
               "profile_path": "/q6kKDXT9zqiTIK3pOWlNCN1DUos.jpg",
               "id": 116322,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Okabe (voice)",
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2df",
               "name": "Unsho Ishizuka",
               "profile_path": "/msFDooyGBJLzWESwvvnjht6AnbV.jpg",
               "id": 68916,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Tomizawa (voice)",
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2e3",
               "name": "Kazuhiko Inoue",
               "profile_path": "/kjXAvvqaBI4rw8IKzz4fM9SGFSN.jpg",
               "id": 89968,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Maki Kasahara (voice)",
               "gender": 1,
               "credit_id": "52fe452d9251416c7504e2e7",
               "name": "Risa Mizuno",
               "profile_path": "/3zk9Eqv19LQOU2unCHi2bJgwxmX.jpg",
               "id": 116323,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Arisaka (voice)",
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e315",
               "name": "Hidenobu Kiuchi",
               "profile_path": null,
               "id": 225655,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Emishi Seisakujo Koin / Eki Shanai Announce / Byoin Incho (voice)",
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e319",
               "name": "Masami Iwasaki",
               "profile_path": null,
               "id": 225656,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Emishi Seisakujo Koin / TV News (voice)",
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e31d",
               "name": "Eiji Takemoto",
               "profile_path": null,
               "id": 126693,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Emishi Seisakujo Koin / Daigakuinsei (voice)",
               "gender": 0,
               "credit_id": "52fe452d9251416c7504e321",
               "name": "Takahiro Hirano",
               "profile_path": null,
               "id": 1124541,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Daigakuinsei / Radio Hoso (voice)",
               "gender": 0,
               "credit_id": "52fe452d9251416c7504e325",
               "name": "Takeshi Maeda",
               "profile_path": null,
               "id": 1124542,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Joshi Seito (voice)",
               "gender": 0,
               "credit_id": "52fe452d9251416c7504e32d",
               "name": "Yûki Nakao",
               "profile_path": null,
               "id": 1124543,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Hiroki's Girlfriend (voice)",
               "gender": 1,
               "credit_id": "59e507cbc3a36807620013c5",
               "name": "Rie Nakagawa",
               "profile_path": null,
               "id": 1251434,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2bd",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2c3",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2c9",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe452d9251416c7504e2cf",
               "name": "Steven Foster",
               "profile_path": null,
               "id": 116320,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2ed",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe452d9251416c7504e2f3",
               "name": "John Ledford",
               "profile_path": null,
               "id": 122179,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe452d9251416c7504e2f9",
               "name": "Mark Williams",
               "profile_path": null,
               "id": 206574,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e2ff",
               "name": "Tenmon",
               "profile_path": null,
               "id": 237520,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e305",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe452d9251416c7504e30b",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe452d9251416c7504e311",
               "name": "Makoto Matsuda",
               "profile_path": null,
               "id": 1124540,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.943189,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 12924,
      "vote_count": 154,
      "budget": 0,
      "overview": "The story takes place in a alternate postwar period, in 1996, where Japan is divided. Hokkaido is ruled by the \"Union\" while Honshu and other southern islands are under US authority. A tall tower was built on Hokkaido, which could even be seen from Tokyo. In the summer of 1996, three middle-school students make a promise that they'll cross the border with a self-constructed plane and unravel the tower's secret, but their project was abandoned after the girl, Sayuri Sawatari, became mysteriously ill and transferred to Tokyo. Years later on the brink of another war Hiroki Fujisawa finds out that Sayuri had been in coma since then, and he asks Takuya Shirakawa to help him finding a way to wake her up.",
      "similar": [
         1624,
         169917,
         228970,
         1372,
         334524,
         441701,
         9417,
         2133,
         183011,
         382399,
         37797,
         451945,
         11000,
         396940,
         48171,
         52371,
         11665,
         4723,
         110160,
         419700
      ],
      "original_title": "雲のむこう、約束の場所",
      "runtime": 91,
      "poster_path": "/ctwUzdQ5w7UIPx9wGhhNgVL40k9.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ADV Films",
            "id": 3465,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CoMix Wave",
            "id": 3756,
            "origin_country": ""
         }
      ],
      "release_date": "2004-11-20",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Against all odds, a promise will be kept.",
      "adult": false,
      "homepage": "http://www.kumonomukou.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Makoto Shinkai"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Makoto Shinkai",
         "Makoto Shinkai"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0381348/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5ODA4MTY1OV5BMl5BanBnXkFtZTcwODYwMzAzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Hidetaka Yoshioka, Masato Hagiwara, Yuka Nanri | See full cast and crew »"],
      "reviews": [
         "\"Kumo no mukô, yakusoku no basho\". I saw it without knowing much about the plot and it pleased me a lot. The film tells a story of fiction of three friends and of how time changes them. It is very interesting how many Japanese films (not only anime) represent in a much more realistic way how human relationships are. And this is what happens with this film: although the story is fictive, the relationships are like real ones are. This film is art. It is fantastic how the characters are drew. The ambient that you smell from the first image, the music... everything. At the end, I felt something that I've only felt very few times: it was satisfaction. I felt satisfied although I didn't comprehend the plot completely. And that feeling, that from the very first moment invades you is unpayable. I recommend it to you and... enjoy ;). I'm sure that although I don't write in English very well, and this comment didn't impressed you much, you will like this film.",
         "This is an anime movie done by a relative newcomer to films: Makoto Shinkai, whose only previous directorial work was a half-hour short called \"Voices of a Distant Star,\" in which he did all the animation himself on one laptop (even for Japan, a nation of workaholics, that was unheard of). It made him so famous that they gave him a full studio to work with for his next project, and when Makoto Shinkai doesn't have the constraints that a solo project would bring, look out. The style of the film and its sci-fi and fantasy themes is equal parts steampunk and cyberpunk, with the film taking place in an alternate timeline of post-war Japan, only a few years from now. The main differences are the division between the North and South sides of Japan, and the research into parallel universes that has sprung up, resulting in the construction of a massive tower in Ezo (Hokkaido), which understandably captures the imagination and curiosity of the surrounding world. Though the film is ostensibly a science fiction work, the plot involving a tower and alternate realities and so on plays second fiddle to the romantic drama, about three high school kids torn apart by war. The emotions blend with the fantasy elemts in a way that is handled with incredible elegance, care and sensitivity, and Makoto Shinkai's trademark poetic touch. But what is more impressive is how the film shows that drama can be achieved through implausible situations. You see, too many directors think that in order to make a film \"dramatic\" and \"touching,\" it must be about REALISTIC people in a REALISTIC setting having REALISTIC problems with REALISTIC resolutions, but Makoto Shinkai realizes a way around that, and uses a science fiction element not as a platform for action sequences, but rather as a way to achieve a kind of drama that you really couldn't get in a film that takes place in the \"real world.\" The film is aware that the sci-fi is playing second fiddle to the character drama, and doesn't waste any more time than it needs to trying to explain the film's bizarre sciences or justify the contrivances, rather leaving it up to the viewer to interpret and decipher what the fantasies of the film mean or symbolize. In other words, Shinkai wisely avoids the deathtrap of \"Movie Science,\" and instead allows the audience to take things as they come and explain them ourselves. The part about two teenagers building a plane that could get past a government-built radar system does seem a bit incredible, but this film does reflect on the incompetence of governments and how easy it is to get past them, so the required suspension of disbelief isn't really that big (I wish I found it hard to believe that a couple of teenagers could get past a bureaucratic governmental system in this day and age at all). Also, the brief violence and \"thrilling\" assault on the tower are treated with perfect sincerity. The brief fight scenes are breathtaking in their realism and how they show that when someone gets punched, they get hurt. There are no legendary martial arts techniques or complex laser-rifle technology here, this film is about how people feel about each other and what they do when they are in trouble. The ending is slightly abrupt and somewhat open-ended (although it is happy), but that is a theme in many anime. A lot is left up to the audience's interpretation and imagination, and the film only answers the questions that really matter.",
         "After seeing Voices of a Distant Star, I eagerly awaited Makoto Shinkai's next work. This movie exceeded my expectations. It is as visually captivating as Voices, contains beautiful music, and is longer and more complex. The plot (which twists and turns considerably) follows three high school kids through a period of war. There is a giant tower visible from where they live, a huge white structure that reaches up through the clouds. They all long to go to the tower one day. Over several years, they build a plane to fly to the tower, but certain complications prevent them from making their flight. The plot becomes slightly confusing in the middle, as it involves talk of parallel universes. But the movie ends triumphantly, with the three friends, separated for years, meeting again to fly to the tower. But, for reasons I will not reveal, their flight will have a deeper impact than they thought. Overall, the movie is beautiful. It is a joy to look at. Every scene, from the lighting to the vivid colors, captures a certain place and mood perfectly. The animation alternates between standard anime and fluid, computer-generated eye candy. At times the film feels like a play, with characters delivering heartfelt soliloquies that evoke feelings of loneliness and sorrow. Many of the emotions in Voices of a Distant Star are carried over to The Place Promised to Us In Our Early Days. But here, with many characters and a longer, more involved plot, the emotions resonate more deeply. Though Makoto Shinkai's style is different from most of today's anime directors, the quality of his work is comparable to Hayao Miyazaki.",
         "Makoto Shinkai came back. And this time he is not alone. 'The Place Promised in Our Early Days' is a pure and beautiful piece of work. This has probably the most beautiful visuals of all animations that I've seen ('Please Save My Earth' and some others are also beautiful but they all have different characteristics, I must say). Pictures themselves are beautiful, and it is no wonder how people call him the 'magician of light'. My overall impression of this anime is that it's like a poet but with Sci-Fi to match with it. 'Voices of a Distant Star (Hoshi no koe)' was quite boring for me honestly. But with a similar structure and image, 'The Place...' seems to deliver much better what Makoto Shinkai wanted to deliver, even though its story is slightly loose here and there. I do think, however, that it is 'too' consistent throughout - from Makoto Shinkai's authentic poetic and solitary, pure atmosphere to its story/drama, visuals (e.g. lighting), music etc (I must say that sound aspects outside music is not very well done but let's put that aside), pretty much everything. This strengthens the sense of purity this anime represents, but I really think it would be better to have more 'bandwidth' to it, so it can have more dynamics and life in it. It is great how Makoto Shinkai pulled it off gracefully knitted altogether, though. I'd say that 'The Place...' stands on its very own ground, really. I think it is something that's quite different to all the rest, and don't really think it's appropriate to judge this by typical standards. To hold it together for a much longer period of time, and to do it well, he has effectively implied editing (if I could say that) and careful laying out of the story. But the biggest difference I witnessed from 'The Place...' was how Makoto Shinkai has casted much more characters than before - though characters lack in variety as well. This enriches the story as well as adding complexity and depth to it so you don't get bored out easily. But after all, it is superb how well Makoto Shinkai has put the whole thing together so well. I was very fascinated and captured while I was watching it - which didn't happen for quite some time. I think this is one piece of work that overwhelms viewers by its beauty and sense of purity. P.S. Although I can understand how some animatings are not up to the feature animation quality, I personally think it'd be better for Makoto Shinkai to get somebody good to retouch on his characters' faces.",
         "I rarely ever watch anything more than once, but this was my 3rd time watching this today, and I had even bought the DVD.. and I still think its as great as the first time I watched it. I think I feel some nostalgic connection to it somehow, I appreciate how brilliant the boys are, actually building something like that.. successfully.. while being so young. I guess I've always wanted to accomplish something like that. I also like the attention to technical detail like soldering and UNIX command lines. Even if you aren't into the story or the characters, watch it for the animation. Some of the most beautiful scenes I think I may ever see. Especially for those you who tend to like sunsets. I can hardly think of anything I don't enjoy about it, some people have said it doesn't feel tight or whole or well put together, but I think the pacing really isn't that bad, only thing that bothers me slightly is all the fades to black that are used for scene transitions, but really I'm not sure what else would have been better, it makes it a whole lot less confusing than just cutting to scenes and having to figure out whats going on and if its a different place or time. The DVD release is decent, some good interviews (motoko shinkai seems like a real nice guy), video quality is good, audio is fine (dont know about the English voice actors, id be afraid to really watch it in English). its good.",
         "i happened to see this movie when i was browsing the library for a movie to watch, and decided to check it out on a whim. and boy, am i glad i did. the director of this movie has been called \"the next miyazaki\", and let me just say that that's no exaggeration. from the animation to the characters to the story, everything is crafted beautifully together. even the music, simple as it is, fits perfectly with the story. let me just say something about the animation: it is drop dead gorgeous. advent children was beautiful, but this movie one-ups it. from the picturesque scenes to the clearly drawn and interesting characters, i cannot find a single fault with the picture itself. and the story, like the animation, is a beautiful narrative. i have never been more engrossed by the story or its characters, and it was enough to both pain me and move me at each twist of the story. all in all, this is a terrific gem of a movie. after i watched it, i immediately went out and bought it online. and i know that if anybody else watch it, they'll do the same.",
         "Read the title a couple of times. It's lyrical, evocative, even elegiac, and yet could have been expressed in fewer words. Such is this film. Formally, it's a pure joy to behold. From sweeping countryside panoramas and old, weatherbeaten structures that somehow plumb deep-seated sparks of nostalgia, to sweetly-embellished details like a softly rattling electric fan, Shinkai creates a vibrant, human environment. The soundtrack is equally enveloping, with heart-melting violin and piano work. Beyond this is quite a decent film, with believable characters in often hard-to-fathom situations. The boyhood friendship of the two male protagonists is very real -- but their ability to engineer, fabricate, and pilot a sophisticated aircraft at age 15 is purely the stuff of anime fantasy. And yet, everything, no matter how incredible or convoluted, is wrapped in these Shinkai layers of lyricism and beauty. Through a very sensitive and even transcendent treatment, scene after scene is made to appear pivotal, even if it's not. And thus we have a film that is almost cloying in its presentation -- it's not layered with pure sugar; most of the time it feels genuine, even if it's becoming self-indulgent. But indulge it does, because the director knows how to indulge gracefully. Normally style over substance kills substance. In \"Place,\" it gently infuses it with some sort of warm, nourishing milk.",
         "Approaching this from the perspective of a sci-fi enthusiast, I was pleasantly surprised to discover that, despite the complexity of its theories on divergent realities and their harmonic coexistence with dreams, there was a far simpler coming-of-age story that centered on a childhood promise. The score is haunting. The visuals and animation are stunning and the characters are charmingly awkward. Although there are some action sequences and a pint of blood thrown in for measure, the film's pace is decidedly that of a romantic reflection on loneliness and bittersweet affection. In the end, the story telling is adequate, but viewers who were eager to be exposed to fantastic alternate universes will be disappointed.",
         "I gave 4 stars just for the art and the music, but I really got bored a lot watching this, the story makes no sense, it's all so dreamy, so epic, the author wants you to deeply feel all this emotions but to me the result it's an hollow movie with hollow character. I've never fallen asleep watching something, but with this I barely succeeded to end it. I definitively suggest not to watch it, there are so many other beautiful anime to see out there. One thing I've enjoyed is the artwork, the landscapes are really intense and make you dream, but also there sometimes there is too much over production, too many light effects, it seems like a punch in the eye. And I hate when authors use science fiction in this way, by throwing here and there some gibberish theory and then making a mess with a convoluted plot, so that people at the end can say that it leave you with the freedom to interpret it, I find this technique over abused lately, and by the way I've never seen using it so badly like in this case",
         "In the film's alternate history, Japan is partitioned between the US and the Union (presumably the post-WWII USSR). The Union side has built a giant tower on Hokkaido, so tall it's even visible from Tokyo. Two teen boys just across the straights from the island are fascinated with the mysterious Tower, want to build an airplane to visit it, and get jobs at a factory in the area. The rest of this paragraph has possible mild spoilers. They let a teen girl in on the secret, and she becomes fascinated with it too. That near-obsession with the Tower disrupts their lives in various ways, starting with strange dreams. This was a pretty strange film. The relationships between the characters are very well portrayed. We get a pretty good feel for the three teens, though a change in one of them as they grow up is less clearly defined. The boys' boss is an interesting supporting character. The plot works well as an influence on the three teens' lives, but it weakens as it steps deeper into a blend of science and philosophy. The movie works best up until the mystery of the Tower becomes fairly clearly revealed. Afterwards, the philosophical science fiction distracts from the very good character-based storytelling. However, because it's something so far from the ordinary, I recommend it quite a bit more strongly than I would a more typical movie. I saw the movie in Japanese, subtitled in English -- with the amusing exception of about three lines of English which were subtitled in Japanese."
      ],
      "genres": [
         "Animation",
         "Drama",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": ["CoMix Wave"],
      "summaries": [
         "The story takes place in a alternate postwar period, in 1996, where Japan is divided. Hokkaido is ruled by the \"Union\" while Honshu and other southern islands are under US authority. A tall tower was built on Hokkaido, which could even be seen from Tokyo. In the summer of 1996, three middle-school students make a promise that they'll cross the border with a self-constructed plane and unravel the tower's secret, but their project was abandoned after the girl, Sayuri Sawatari, became mysteriously ill and transferred to Tokyo. Years later on the brink of another war Hiroki Fujisawa finds out that Sayuri had been in coma since then, and he asks Takuya Shirakawa to help him finding a way to wake her up.",
         "In an alternate postwar timeline, Japan is divided into the Union-controlled North and the US-controlled South."
      ],
      "budget": 0
   },
   "movielensId": 49815,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2004-11-20",
      "dvdReleaseDate": "2005-07-12",
      "directors": ["Makoto Shinkai"],
      "runtime": 91,
      "movieId": 49815,
      "title": "The Place Promised in Our Early Days",
      "mpaa": null,
      "actors": [
         "Hidetaka Yoshioka",
         "Masato Hagiwara",
         "Yuuka Nanri",
         "Unsho Ishizuka",
         "Kazuhiko Inoue",
         "Risa Mizuno",
         "Hidenobu Kiuchi",
         "Masami Iwasaki",
         "Eiji Takemoto",
         "Takahiro Hirano",
         "Takeshi Maeda",
         "Yûki Nakao",
         "Rie Nakagawa"
      ],
      "imdbMovieId": "0381348",
      "originalTitle": "雲のむこう、約束の場所",
      "genres": [
         "Animation",
         "Adventure",
         "Drama",
         "Romance",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "07186dk9CPk",
         "2TfaSrWDv4s"
      ],
      "plotSummary": "The story takes place in a alternate postwar period, in 1996, where Japan is divided. Hokkaido is ruled by the \"Union\" while Honshu and other southern islands are under US authority. A tall tower was built on Hokkaido, which could even be seen from Tokyo. In the summer of 1996, three middle-school students make a promise that they'll cross the border with a self-constructed plane and unravel the tower's secret, but their project was abandoned after the girl, Sayuri Sawatari, became mysteriously ill and transferred to Tokyo. Years later on the brink of another war Hiroki Fujisawa finds out that Sayuri had been in coma since then, and he asks Takuya Shirakawa to help him finding a way to wake her up.",
      "tmdbMovieId": 12924,
      "avgRating": 3.63462,
      "releaseYear": "2004",
      "numRatings": 130,
      "posterPath": "/ctwUzdQ5w7UIPx9wGhhNgVL40k9.jpg"
   }
}