{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nun",
            "id": 745
         },
         {
            "name": "satanism",
            "id": 3099
         },
         {
            "name": "legend",
            "id": 3754
         },
         {
            "name": "young people",
            "id": 6517
         },
         {
            "name": "possession",
            "id": 9712
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "demon",
            "id": 15001
         },
         {
            "name": "monastery",
            "id": 41592
         },
         {
            "name": "school life",
            "id": 190116
         }
      ],
      "imdb_id": "tt0217331",
      "video": false,
      "title": "The Convent",
      "recommendations": [
         76450,
         79975,
         29833,
         30377,
         30236,
         29634,
         405551,
         68180,
         34734,
         17731,
         35453,
         18944,
         166161,
         68665,
         28111,
         268956,
         91292,
         27509,
         264227,
         51776
      ],
      "backdrop_path": "/zo6mj2k38qnpJQ5VJ0ErmyDnlAJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 21,
               "character": "Christine O'Malley",
               "gender": 1,
               "credit_id": "52fe451c9251416c7504c0a1",
               "name": "Adrienne Barbeau",
               "profile_path": "/vKZpJlrGLK4qFTTnWFa6LMH2FMc.jpg",
               "id": 11782,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Clorissa",
               "gender": 1,
               "credit_id": "52fe451b9251416c7504c03b",
               "name": "Joanna Canton",
               "profile_path": "/gInYKC1HfTat2r2fXYlf2S12U1X.jpg",
               "id": 73403,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Frijole",
               "gender": 2,
               "credit_id": "52fe451b9251416c7504c03f",
               "name": "Richard Trapp",
               "profile_path": null,
               "id": 73404,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mo",
               "gender": 1,
               "credit_id": "52fe451c9251416c7504c04b",
               "name": "Megahn Perry",
               "profile_path": null,
               "id": 73408,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Brant",
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c047",
               "name": "Liam Kyle Sullivan",
               "profile_path": null,
               "id": 73407,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Chad",
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c095",
               "name": "Dax Miller",
               "profile_path": null,
               "id": 100523,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Kaitlin",
               "gender": 1,
               "credit_id": "52fe451c9251416c7504c043",
               "name": "Renée Graham",
               "profile_path": null,
               "id": 73406,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Biff",
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c099",
               "name": "Jim Golden",
               "profile_path": null,
               "id": 100524,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Sapphira",
               "gender": 1,
               "credit_id": "52fe451c9251416c7504c09d",
               "name": "Chaton Anderson",
               "profile_path": "/2TcO4D4zvMV2v3TwuqbrD4ryXE6.jpg",
               "id": 73410,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Dickie-Boy",
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c0a5",
               "name": "Kelly Mantle",
               "profile_path": null,
               "id": 100525,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Saul",
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c0a9",
               "name": "David Gunn",
               "profile_path": null,
               "id": 100526,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Officer Starkey",
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c091",
               "name": "Coolio",
               "profile_path": "/kzxoKNAq2hyfC9jdlKL9uxyphUy.jpg",
               "id": 35549,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Young Christine",
               "gender": 0,
               "credit_id": "52fe451c9251416c7504c0ad",
               "name": "Oakley Stevenson",
               "profile_path": null,
               "id": 100527,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Officer Ray",
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c0b1",
               "name": "Bill Moseley",
               "profile_path": "/qUgvWEdmsLTzYzVFc71Asqxsjhi.jpg",
               "id": 27737,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Davina",
               "gender": 1,
               "credit_id": "52fe451c9251416c7504c0b5",
               "name": "Allison Dunbar",
               "profile_path": "/m1kr2Pa9xzPJekJD3AvjKByqapq.jpg",
               "id": 100528,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c051",
               "name": "Mike Mendez",
               "profile_path": null,
               "id": 73409,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe451c9251416c7504c057",
               "name": "Chaton Anderson",
               "profile_path": "/2TcO4D4zvMV2v3TwuqbrD4ryXE6.jpg",
               "id": 73410,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c05d",
               "name": "Roland Carroll",
               "profile_path": null,
               "id": 73411,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c063",
               "name": "Ryan Carroll",
               "profile_path": null,
               "id": 73412,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe451c9251416c7504c069",
               "name": "Elliot Metz",
               "profile_path": null,
               "id": 73413,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe451c9251416c7504c06f",
               "name": "Jed Nolan",
               "profile_path": null,
               "id": 73414,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe451c9251416c7504c075",
               "name": "Rene Torres",
               "profile_path": null,
               "id": 73415,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe451c9251416c7504c07b",
               "name": "Joey Bishara",
               "profile_path": null,
               "id": 73416,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c081",
               "name": "Joseph Bishara",
               "profile_path": "/jkFmkZcd16cEX2yGFNNAsNJyN5U.jpg",
               "id": 73417,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe451c9251416c7504c087",
               "name": "Jason Lowe",
               "profile_path": null,
               "id": 73418,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe451c9251416c7504c08d",
               "name": "John Rosenberg",
               "profile_path": null,
               "id": 21854,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.41022,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12724,
      "vote_count": 19,
      "budget": 0,
      "overview": "A group of college students break into an abandoned convent and become possessed by demonic spirits.",
      "similar": [
         445954,
         357096,
         2832,
         10285,
         281957,
         752,
         238636,
         588,
         984,
         28355,
         133805,
         3134,
         10651,
         4771,
         12149,
         10781,
         27770,
         2749,
         1586,
         9679
      ],
      "original_title": "The Convent",
      "runtime": 79,
      "poster_path": "/7YsmoHmjGwRab6pU6ulg46wa5Cq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Alpine Pictures",
         "id": 10397,
         "origin_country": ""
      }],
      "release_date": "2000-01-21",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Prayer will get you nowhere.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Mendez"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Chaton Anderson",
         "Chaton Anderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0217331/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1MzcwMTMzMF5BMl5BanBnXkFtZTcwNjI3OTkyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Joanna Canton, Richard Trapp, Dax Miller | See full cast and crew »"],
      "reviews": [
         "With the lack of quality horror films becoming more and more apparent, fans of the genre (and those looking to get into it) are left with nothing to lose by checking out the obscure titles found on the shelves of the non-chain video stores. Every once in a while, there is a surprise contained within. Such a surprise is the 2000 movie `The Convent'. Directed by Mike Mendez (whose previous effort, `Killers', is very hard to find), `The Convent' is an exercise in excess and situational comedy. Far too often horror movies enter the realm of comedy unintentionally. As a small film, with a pea-sized budget, `The Convent' wraps itself, and enjoys, a cloak of playfulness. The movie opens in the 1950's as a young woman decides to set nuns and priests aflame. just before laying a shotgun through them. It's an intro that needs to be seen to be believed. Unfortunately, as far as visual flare is concerned, this scene is never topped. We fast-forward to the present and meet a group of college kids heading to the long abandoned convent to spray paint fraternity letters. The mix of characters is so over the top you can't help but love them. Not a single role is taken 100% seriously and it's obvious that this movie is going to be fun. Our college friends make it to the convent. Unfortunately, they are busted by two dope-smoking cops. I want nothing more than to go into detail about this scene, but it would ruin a surprise cameo that is beyond hilarious. As the group's bad luck continues, they realize they have left their entire bag of weed at the convent and must return. From here, gore galore and hilarity ensues. The plot is simple enough and the movie is very funny (not to mention gory as all get out). We get a simply wonderful cameo from Adrienne Barbeau (whose performance in John Carpenter's `The Fog' is treasured by countless horror fans) and, generally, decent production values given the budget. My only complaint is that the movie is too short.",
         "I just saw this film for the first time and I must admit it was rather enjoyable. This movie obviously gives tribute to many films such as \"Demons\", \"Night of the Demons\", \"Evil Dead\", etc. The movie is very fast paced, filled with random gore scenes and a few familiar faces for those of you who know your horror movies. The movie starts off with a young woman walking into a church/convent and slaughtering all the nuns that she sees. 40 years later, a group of what would appear to be stereotypical dumb college frat kids who are out one night looking for a good time. Of course they go to the old convent where the massacre took place 40 years in the past. After most of them are chased away by the police (Coolio and Bill Mossely) the one that stayed behind is sacrificed by a bunch of loser wanna be goth kids. This is where the movie finally picks up as the rest of it is a blood bath mixed with humor and gore. I must say the beginning of the movie was really bad with the stereotypical college kids but if you can hold out for about 15 minutes it really is all worth the while. Now, the version of the movie I just got claims to be the full uncut version which would make sense because most of the reviews I have read say they wish the movie was more gory. This movie was plenty gory, at least enough to keep my slaughter appetite in check. Also look for Adrienne Barbou kicking serious butt in the last 15 minutes of the movie. 7/10 stars",
         "Oh come on! What do you expect? It's a trashy horror/comedy starring Adrienne Barbeau. And it's a REALLY FUNNY one at that. If you were expecting anything more...well I just can't understand how you could. It is what it is---and it's FABULOUS!",
         "Ahhh, this movie is in every way completely ridiculuous. The Actors seemed to have a good time, and so did I. It's very reminiscent of the better low-budget 80's stuff, with cheesy acting, cheesy dialog, and cheesy humor. But I love that kind of stuff. And clocking in at about 1 hour and 12 mins., it's very fast-paced. I noticed that the male characters were incredibly stupid, while most of the females were pretty smart. I thought this was hilarious and made the film kind of a parody of the aforementioned 80's flicks. If you like stuff like \"Night of the Demons\" or maybe \"Return of the Living Dead,\" \"The Convent\" is in the same spirit. You get to see lots of goofy stuff, but the monsters are pretty cool, and sort of serious, and it's got a pretty good bloodflow. And Adrienne Barbeau is a blast as the vet demon killer. My only complaint is that the ending seems a bit rushed, and poorly edited. But Mr. Mendez is one to watch.",
         "Me, my sister, and our aunt rented this and 3 other movies...I wanted a horror movie and my aunt wanted something that was current (because she's seen probably all of the 70's horror flicks) so we rented The Convent. I had a feeling that it'd be cheap and crappy and I was right. The whole movie had us laughing so hard! I don't remember the last time I laughed that hard and for that long! Also, I noticed two references to other horrors movies in there--Halloween, when the nun walks up to the little girl in the graveyard she has on the Michael Myers mask. And when the nun walks up to the girl in the desk in that flashback scene she spews green stuff on her (The Exorcist.) This movie will have you in tears laughing! (Well it did for at least me, my sister, and my aunt!) I also think it was the director's intention to make it campy fun I dunno if he intended it to be an actual horror film. Or maybe he did and knew that it'd turn out to be a crappy D horror flick so he went crazy with the budget and script! I found this extremely entertaining and gave it a 7!",
         "Hell yeah! That's pretty much the feeling the average person will have throughout this compact and action-filled piece of garbage. It's an incredibly crazy, riveting and somewhat moronic 75 minutes, it's the kind of project that defines what B-list horror should be all about. The hilarious (in a sadistic way) opening immediately drags you in, and the movie just utterly refuses to let you go after that. Demonic zombie nuns, fluorescent(!) blood, hot chicks, washed-up gangsta rapper Coolio playing a cop, I thank God for showing me all this pure uncut greatness. If all this stuff can't get your attention, I really don't know what will. The Adrienne Barbeau appearance is just icing on the cake, brilliant role. Of course this movie isn't particularly well-made or well-written, but I stopped caring roughly ten seconds in. Loads of fun.",
         "As a fan of fun horror movies like \"The Evil Dead\", \"From Beyond\", and \"Demons\" (or even \"Sleepaway Camp 2: Unhappy Campers\"), I find today's multiplexes a barren wasteland when it comes to frenzied, hilarious, gore-and-violence filled fright flicks. I'm forced to choke down pale simulacrums like \"Valentine\", \"Dracula 2000\", and \"Urban Legends: Final Cut\" in theaters, while voraciously re-watching the Herschell Gordon Lewis/Coffin Joe catalog at home. I'm a sad horror junkie aching for a fix. That's why viewing \"The Convent\" in a theater packed with like-minded gore-o-philes was a near orgasmic experience. Finally, a modern horror flick that aims for all the right targets, hitting most of them and shoveling a bucket-load of entertainment down my parched, killer-nun hungry gullet. \"The Convent\" tells the tale of some dopey fraternity types breaking into an abandoned nunnery only to encounter carnage-hungry ghouls, fey devil worshippers, and oodles of cool imagery, skin peeling, and decapitations. When's the last time they made a movie about that kind of stuff that wasn't crap? What's even more impressive is that this movie is funny- hilariously so, and on purpose. In fact, not only is \"The Coven\" better than most recent horror movies, it's funnier than most so-called comedies. I dare anyone with a sick sense of humor not to fall in love with the destined-to-be-legendary flashback scene of evil nuns running amuck through a 1950s Catholic School. The dialog is great, too (In retrospect, I can think of only one stupid line that made me cringe, concerning saving one's virginity for pasty poser Marylyn Manson) and delivered by a capable, amiable cast who turn stereotypical roles into likable characterizations. I expected to hate the stoner womanizer and the Goth chick lead, but the actors playing them were so good that I ended up loving them. There's even two characters who seem to be straight out of those \"Saturday Night Live\" Goth Talk sketches, but they are funny and I was actually looking forward to seeing more of them! Throw in Coolio and Bill Mosely (Chop-Top in \"Texas Chainsaw Massacre 2\") as dope-snatching college cops and Adrienne Barbeau as a legendary DemoNun slayer and you've got an affair to remember! Yet another thing that endeared me to this flick was the fact that it was obviously made by knowledgeable horror fans, but unlike similar (but far inferior) projects like \"The Dead Hate the Living\" or \"The Dead Next Door\" they don't chuck obvious, \"aren't-we-cool-wink-wink\" genre references at you. \"The Convent\" has got subtle references to \"The Beyond\", \"Zombie\", and others I'm sure I missed, plus, a \"Sixteen Candles\" gag! What more could you ask for? Well, I would've asked for more gore. Except for the numerous, outstanding beheadings (and subsequent squirting neck stumps), most of the demon-attacks are shot in a shaky-cam, distorted style that makes it hard to see the details. If I was prone to cliches, I might use the words \"hyper-kinetic\" or \"frenetic\" to describe the film's style, but I'm not, so I won't. Still, this movie has much more splat-sticky maulings than any other flick on the market today, and the demon make-up is unique and creative. This movie even makes day-glow colors look cool (something Joel Schumaker couldn't do despite his huge \"Batman & Robin\" budget). Another minor complaint is that the movie is almost too fast paced and seems hurried and choppy in places. The kick-ass opening scene (in which a gal blows away some pious puss-faces to the chords of Lesley's Gore's immortal \"You Don't Own Me\") is edited like a movie trailer, and the film's climax seems rushed. Instead of a slam-bang explosive finale we're treated to some indecipherable computer effects that seem to be inserted as a placeholder until real effects became available. But those are minor caveats. Sure, this is no \"Dead Alive\" or \"Re-Animator\", but it is superior to most other recent horror offerings in every department- script, cast, make-up effects, you name it. The fact that this momentous motion picture cannot find a national theatrical distributor proves how out of touch some movie studios are with horror fans. I'm sure no dime would be spared to promote another brain-dead \"I Know What You Did Last Summer\" sequel. So catch this movie wherever and whenever you can, preferably in a theater full of people. You'll be oh so glad you did.",
         "Low budget Horror films can go either way. They can either be very well done or a waste of celluloid, which is the case far too often these days. But many of the best genre films were done independently and by people who were in it for the love of making movies. 'Halloween' is one of the best loved independent Horror movies, a success in it's day, and paved the way for ones like 'The Blair Witch Project.' A low budget is both a blessing and a curse because on the one hand it limits what filmmakers can do, but on the other it brings out their creativity. If one was tired of watching the many 'Scream' imitations of the late 1990s to early 2000s they could turn to the more obscure stuff coming out, like this little number that blends modern Horror and 1980s splatter flicks to create a fun 71 minutes. Pros: Cast is game and have fun with their parts. Nicely scored and some great tunes. Great make-up and gore effects. Also a good helping of the gory goods. Made with tongue firmly planted in cheek. Swift pace. Impressive job done by director Mike Mendez, who infuses this with much style. Cons: Stereotypical characters. You've seen all of this before. Not all the humor is a slam dunk. I know this was made on a super low budget, but the CGI is really cheap looking. Final thoughts: Think 'Night of the Demons' meets 'Scream' and you've got 'The Convent.' This is pure dumb, gory, unpretentious fun at it's finest. This film has just about everything you could ask for: demons, blood, drugs, sexuality, pseudo-devil worshipers, and Adrienne Barbeau playing a tough-as-nails leather jacket wearing chick with a big gun and a mouth like a sailor. It doesn't get much more fun than that. My rating: 3.5/5",
         "The horror genre is undoubtedly more diverse than any of cinema's other genres, and while that does mean that there's a lot of different and original horrors; it also means that any good idea liable to be done more than once. This has become a big problem for the modern genre with the recent wave of remakes. The Convent isn't a remake by name; but it could easily be a remake of the eighties classic Night of the Demons as the basic plots are more or less identical - but at least enough of it has been changed to ensure that it gets away with being a different film. This is how remakes should be done! Anyway, anyone that has seen the aforementioned eighties horror will recognise this story instantly. The film begins with a cool sequence that sees a young girl brutally execute a bunch of nuns with a shotgun. Fast forward fifteen years and a bunch of school kids are planning to break into the convent where it all happened to see if it really is haunted by the dead nuns... It has to be said that this film isn't a piece of high quality film-making. The acting is largely ridiculous and the special effects are so bad that they make the majority of the cast look on par with some of the greatest performances of all time. However, the film was clearly never meant to be seen as great horror; and thankfully it does work as a fun, trashy horror comedy. There's always plenty going on and the film never really has time to get boring, which is certainly to its credit. The majority of the characters are rather dull, and this is not helped by the fact that the most interesting one is killed off towards the beginning; but the loss of her presence is somewhat made up for the appearance of a couple of bumbling 'Satanists' that provides the laughs. The film also features a few cameo appearances; we've got rapper Coolio and Bill Moseley as a couple of coppers; and even better Adrienne Barbeau as motorcycle riding demon killer. Overall, I really wouldn't recommend anyone goes out of their way to see this film; but it's fun enough for what it is and people that enjoy this sort of film surely wont be too disappointed.",
         "This film is absolutely horrific. One of the worst movies I've ever seen. The story does nearly not exist, the characters are full of stereotypes and the Special-FX only make you laugh. The only remarkable thing about this movie is the guest appearance of the Rapper Coolio as some kind of police officer. If this film was supposed to be a comedy I didn't quite get the point. If you want to watch this movie: please get yourself drunk first and then prepare for some good laughs...especially when the first Special-FX appear on the screen. But if you like trash movies made on the cheap: this film is a must-see for you."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["Alpine Pictures"],
      "summaries": ["A group of college students break into an abandoned convent and become possessed by demonic spirits."],
      "budget": 0
   },
   "movielensId": 4997,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-01-21",
      "dvdReleaseDate": "2001-12-11",
      "directors": ["Mike Mendez"],
      "runtime": 79,
      "movieId": 4997,
      "title": "The Convent",
      "mpaa": "R",
      "actors": [
         "Adrienne Barbeau",
         "Joanna Canton",
         "Richard Trapp",
         "Megahn Perry",
         "Liam Kyle Sullivan",
         "Dax Miller",
         "Renée Graham",
         "Jim Golden",
         "Chaton Anderson",
         "Kelly Mantle",
         "David Gunn",
         "Coolio",
         "Oakley Stevenson",
         "Bill Moseley",
         "Allison Dunbar"
      ],
      "imdbMovieId": "0217331",
      "originalTitle": "The Convent",
      "genres": [
         "Horror",
         "Thriller",
         "Comedy"
      ],
      "youtubeTrailerIds": ["RwO5SEXcm14"],
      "plotSummary": "A group of college students break into an abandoned convent and become possessed by demonic spirits.",
      "tmdbMovieId": 12724,
      "avgRating": 2.93258,
      "releaseYear": "2000",
      "numRatings": 89,
      "posterPath": "/7YsmoHmjGwRab6pU6ulg46wa5Cq.jpg"
   }
}