{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "midlife crisis",
            "id": 1599
         },
         {
            "name": "confidence",
            "id": 2246
         },
         {
            "name": "aging",
            "id": 4995
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "contraception",
            "id": 33358
         },
         {
            "name": "gynecologist",
            "id": 170521
         }
      ],
      "imdb_id": "tt0113041",
      "video": false,
      "title": "Father of the Bride Part II",
      "recommendations": [
         11846,
         11630,
         12154,
         10407,
         1552,
         9099,
         11982,
         10057,
         11472,
         2064,
         12120,
         11041,
         6280,
         1968,
         11584,
         10326,
         11158,
         10780,
         2928,
         11353
      ],
      "backdrop_path": "/cZs50rEk4T13qWedon0uCnbYQzW.jpg",
      "revenue": 76578911,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "George Banks",
               "gender": 2,
               "credit_id": "52fe44959251416c75039eb9",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nina Banks",
               "gender": 1,
               "credit_id": "52fe44959251416c75039ebd",
               "name": "Diane Keaton",
               "profile_path": "/fzgUMnbOkxC6E3EFcYHWHFaiKyp.jpg",
               "id": 3092,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Franck Eggelhoffer",
               "gender": 2,
               "credit_id": "52fe44959251416c75039ec1",
               "name": "Martin Short",
               "profile_path": "/oZQorXBjTxrdkTJFpoDwOcQ91ji.jpg",
               "id": 519,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Annie Banks-MacKenzie",
               "gender": 1,
               "credit_id": "52fe44959251416c75039ec5",
               "name": "Kimberly Williams-Paisley",
               "profile_path": "/nVp4F4VFqVvjh6huOULUQoiAguY.jpg",
               "id": 70696,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Bryan MacKenzie",
               "gender": 2,
               "credit_id": "52fe44959251416c75039ef3",
               "name": "George Newbern",
               "profile_path": "/kUFci5BzhMyx3ZNQEvpauRmpMyT.jpg",
               "id": 59222,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Matty Banks",
               "gender": 2,
               "credit_id": "52fe44959251416c75039ef7",
               "name": "Kieran Culkin",
               "profile_path": "/swcqQCMREeGCk6FAxIfczGpFBys.jpg",
               "id": 18793,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Howard Weinstein",
               "gender": 2,
               "credit_id": "52fe44959251416c75039efb",
               "name": "BD Wong",
               "profile_path": "/w7Hs9m6ocS2qlibvrLOvmyCKbAN.jpg",
               "id": 14592,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "John MacKenzie",
               "gender": 2,
               "credit_id": "52fe44959251416c75039eff",
               "name": "Peter Michael Goetz",
               "profile_path": "/a2hLcCidETgwlVyQnYy4kXVKUcn.jpg",
               "id": 20906,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Joanna MacKenzie",
               "gender": 1,
               "credit_id": "52fe44959251416c75039f03",
               "name": "Kate McGregor-Stewart",
               "profile_path": "/vsvdAmMZgX85AvnVFd4jigOUipZ.jpg",
               "id": 54348,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Dr. Megan Eisenberg",
               "gender": 1,
               "credit_id": "52fe44959251416c75039f07",
               "name": "Jane Adams",
               "profile_path": "/HbQfL01xmV1psnh0WvldIBzDg3.jpg",
               "id": 209,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Mr. Habib",
               "gender": 2,
               "credit_id": "52fe44959251416c75039f0b",
               "name": "Eugene Levy",
               "profile_path": "/69IBiDjU1gSqtrcGOA7PA7aEYsc.jpg",
               "id": 26510,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Wife Mrs. Habib",
               "gender": 1,
               "credit_id": "57ffa654c3a3681552000277",
               "name": "Lori Alan",
               "profile_path": "/mNfJWzuaKgkIaK7CuirXOMosd2h.jpg",
               "id": 24358,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44959251416c75039ecb",
               "name": "Nancy Meyers",
               "profile_path": "/nMPHU06dnvVxEjjcnPCPUQgQ2Mp.jpg",
               "id": 17698,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039ed1",
               "name": "Albert Hackett",
               "profile_path": null,
               "id": 26160,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039ed7",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44959251416c75039edd",
               "name": "Nancy Meyers",
               "profile_path": "/nMPHU06dnvVxEjjcnPCPUQgQ2Mp.jpg",
               "id": 17698,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039ee3",
               "name": "Adam Bernardi",
               "profile_path": null,
               "id": 68755,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039ee9",
               "name": "Elliot Davis",
               "profile_path": null,
               "id": 5506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c75039eef",
               "name": "Charles Shyer",
               "profile_path": "/hnWGd74CbmTcDCFQiJ8SYLazIXW.jpg",
               "id": 56106,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 8.558937,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11862,
      "vote_count": 212,
      "budget": 0,
      "overview": "Just when George Banks has recovered from his daughter's wedding, he receives the news that she's pregnant ... and that George's wife, Nina, is expecting too. He was planning on selling their home, but that's a plan that -- like George -- will have to change with the arrival of both a grandchild and a kid of his own.",
      "similar": [
         49519,
         8545,
         11472,
         334,
         858,
         634,
         11631,
         425,
         2539,
         433,
         2698,
         342878,
         2024,
         1164,
         14,
         95,
         142,
         745,
         2288,
         319
      ],
      "original_title": "Father of the Bride Part II",
      "runtime": 106,
      "poster_path": "/e64sOI48hQXyru7naBFyssKFxVd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sandollar Productions",
            "id": 5842,
            "origin_country": ""
         }
      ],
      "release_date": "1995-02-10",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/7qwE57OVZmMJChBpLEbJEmzUydk.jpg",
         "name": "Father of the Bride Collection",
         "id": 96871,
         "poster_path": "/nts4iOmNnq7GNicycMJ9pSAn204.jpg"
      },
      "tagline": "Just When His World Is Back To Normal... He's In For The Surprise Of His Life!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Charles Shyer"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Albert Hackett",
         "Frances Goodrich"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113041/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1NDc2MjExOF5BMl5BanBnXkFtZTcwNjU1NDAzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Martin, Diane Keaton, Martin Short | See full cast and crew »"],
      "reviews": [
         "I enjoyed this film, as I did Father of the Bride (1991), though I had to suspend my credulity a lot. This film was less realistic than the film it was based on, Father's Little Dividend (1951), with Spencer Tracy and Elizabeth Taylor. For example, it's unlikely that George Banks, a highly successful business owner who obviously must think through his decisions, would be so impetuous as to sell the house he loves and end up having to buy it back at a significant mark-up. (George and Nina decide to sell following a rainstorm that caused their kitchen ceiling to leak, even though the house had two storeys above it.) The new baby *wing* which the Banks then decide to build on to their repurchased home is equally ridiculous, since the house is already huge and only young son Matty is still at home. Between the ill-conceived house sale and repurchase, the posh baby wing and the lavish baby shower, featuring storks flown in from Austria, I don't think George Banks could possibly have spent more money. In the previous film, Father of the Bride (1991), Bryan's parents were portrayed as wealthy, but George is clearly a millionaire himself. I did enjoy this movie -- it's funny, romantic and very warm, with beautiful sets -- but I would have preferred a little less over-the-top consumerism.",
         "That is one of my favorite lines, followed by \"and pack up your things and hit the road! And don't trample the daisies!\" Or he says something like that. Anyway. I went and saw this in theaters and amazingly enough, I really liked it. One of the best Steve Martin films next to Bowfinger and Planes, Trains and Automobiles. I enjoyed the acting, I enjoyed the story and everything else about this movie that made it great. It wasn't a comedy going from one zinger to the next but something well thought out and well written. If your looking for a lite movie with some fun, I recommend seeing this movie.",
         "As much as I want to rag this movie, make fun of it, call it all kinds of names, belittle it, mock it and otherwise totally trash it, I can't and that is for one reason: Steve Martin. Mr. Martin saves this movie from cinematic oblivion, allows this movie to survive, function and prosper. He is proof that an actor can save a sorry script, can raise the level of a story, can make a movie watchable. Mr. Martin proves once again that he is arguably the finest comedy actor today. He can take the dumbest line and make it sound brilliant; he can take the most insipid scene and raise it to the level of comedy or drama. Kudos to Steve Martin for his sterling performance. As for the other star, Diane Keaton, her performance is wonderful too, but it is Mr. Martin who carries this movie and once again proves that he is the star.",
         "as sequels go,this is film isn't too bad.i didn't think ti was quite as good as the first one,but it's not a bad effort.i didn't find it as funny,and some of Steve Martin's histrionics are old and seem forced a bit too me.really,this one doesn't quite have the same sincerity as the first.through much of this movie,i was all too aware i was watching a movie,whereas with firs tone,i was drawn in,and less aware i was watching a movie with people acting.having said that,there are some bright spots.for,one,this movie is just as touching as the first.and Eugene levy has a great cameo.and there is still some fun to be had.even though this may seem too high a rating after much of what i said above,i still think Father of the Bride II is a 7/10",
         "This movie is as thin as you can get. Its' emotions are easily played. There are no surprises. It is very predictable. And I say...so what? What is wrong with that? This is an American Dream movie. Everything goes perfectly and everyone is as happy as can be. Why should it be a complicated character study? It deals with the birth of babies. There's no complex feelings that need to be dealt with in this situation. A life is being created. A family is being blessed. A baby's birth is a time for love and hope. This movie has both in spades. It's a very positive movie that shows the joy a new baby brings. Every parent-to-be should watch it. A child's birth is an emotional event with no equal. This movie knows it and milks it for all its' worth. My only complaint is it should have been called Parents of the Bride. Way too much time is spent with the relationship between Steve Martin and Diane Keaton. There should have been more attention paid to Kimberly Williams. Not only were the scenes between her and Martin the best scenes in this and the original, but Kimberly Williams is the most beautiful actress to come out of Hollywood in many years. Forget all the blond, silicone filled, bimbos that every teenage boy raves about. Ms. Williams is a natural beauty that is a true role model for all young girls. She, and her character, is beautiful, intelligent, and has a heart of gold. Had her relationship with Martin been more focused, this sequel would have surpassed the original. While it doesn't do that, it is still a perfect film for the entire family to watch. *** out of ****.",
         "A sequel to immensely likable Father of the Bride, 'Father of the Bride Part II' is A Well-Done Sequel! Its enjoyable as well as emotional! 'Father of the Bride Part II' Synopsis: George Banks must accept the reality of what his daughter's ascension from daughter to wife, and now, to mother means when placed into perspective against his own stage of life. 'Father of the Bride Part II' is worthy sequel of a wonderful prequel. The characters still appeal, the humor works & the emotional moments are heartfelt as well. Nancy Meyers & Charles Shyer's Screenplay is genuinely well-done. Charles Shyer's Direction, on the other-hand, is good. Cinematography & Editing are fair. Performance-Wise: Steve Martin is lovable. He reprises his part of a loving/possessive dad commendably. Diane Keaton is flawless, yet again. Kimberly Williams-Paisley is cute. George Newbern is sincere. Kieran Culkin is adequate. Martin Short entertains. On the whole, 'Father of the Bride Part II' is a satisfying sequel.",
         "This average sequel rehashes too many of the old \"pa can't cope\" jokes. Some of the new material works better, however comic Steve Martin and his support cast never manage to make the film feel fresh. Even frantic Martin Short is unable to inject the frivolity needed. Others returning include Diane Keaton (who never gets to do enough to show her immense talent here), Kimberley Williams and George Newbern. The show finally caves in on itself when director Charles Shyer and co-writer Nancy Myers try to cram in too many coincidences. Adapted from the \"original\" sequel \"Father's Little Dividend\". Saturday, September 5, 1998 - Video",
         "In the sequel to the brilliant Father Of The Bride, Nina Banks and her daughter Annie are both pregnant and George Banks, being his usual nervous self has to learn to get used to the idea that he's going to be a father again AND a grandfather. The whole cast including, Steve Martin, Diane Keaton, Kimberly Williams and Martin Short are all back here giving good performances. Even though Father Of The Bride Part II is not as good as the first Father Of The Bride, this is still a great movie which is enjoyable and fun all the way through and that's why I'm going to give this good sequel a 10/10.",
         "This movie is a very warm and funny family film. I enjoyed every minute of it because it was very real. Some may disagree but there are a lot of people who may of had this type of situation. I loved that Martin Short was in the Sequel because I love his comedy and he made the movie very funny. The only thing I didn't like was Eugene Levy's character, I found that his part was just put there to extend the movie a bit. I also didn't like how they used him in the second one when he was clearly the one who auditioned to be the wedding singer in the first one. All in all this is a great family film where many will enjoy and watch together.",
         "I enjoyed this movie: Diane Keaton is my favourite actress, Steve Martin always makes me laugh and Martin Short is great, but I felt really sorry for Keaton having to pretend to be pregnant. She didn't seem to be enjoying it and when the Banks were at the hospital, she actually looked rather bored, because whenever she spoke from the moment George protested about the doctor's name, she almost made it sound like she was in a maths lesson. Apart from that, it was great! I would recommend it to anyone who enjoys watching Martin, Keaton or Short in a movie or who likes to laugh. 9/10 because of the little problem, but it was great. I loved it."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Sandollar Productions",
         "Taylor-Made Productions",
         "The Meyers/Shyer Company"
      ],
      "summaries": [
         "In this sequel to \"Father of the Bride\", George Banks must accept the reality of what his daughter's ascension from daughter to wife, and now, to mother means when placed into perspective against his own stage of life. As the comfortable family unit starts to unravel in his mind, a rapid progression into mid-life crisis is in his future. His journey to regain his youth acts as a catalyst for a kind of \"rebirth\" of his attitude on life when he and his wife, Nina, find how their lives are about to change as well.",
         "Family trouble continues to plague George Banks. Having survived his daughter's marriage in the first film, he must now deal with her pregnancy. To complicate matters, his wife Nina is pregnant as well!",
         "In this sequel, George Banks deals not only with the pregnancy of his daughter, but also with the unexpected pregnancy of his wife."
      ],
      "budget": 30000000
   },
   "movielensId": 5,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-02-10",
      "dvdReleaseDate": "2000-05-09",
      "directors": ["Charles Shyer"],
      "runtime": 106,
      "movieId": 5,
      "title": "Father of the Bride Part II",
      "mpaa": "PG",
      "actors": [
         "Steve Martin",
         "Diane Keaton",
         "Martin Short",
         "Kimberly Williams-Paisley",
         "George Newbern",
         "Kieran Culkin",
         "BD Wong",
         "Peter Michael Goetz",
         "Kate McGregor-Stewart",
         "Jane Adams",
         "Eugene Levy",
         "Lori Alan"
      ],
      "imdbMovieId": "0113041",
      "originalTitle": "Father of the Bride Part II",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["ltwvKLnj1B4"],
      "plotSummary": "Just when George Banks has recovered from his daughter's wedding, he receives the news that she's pregnant ... and that George's wife, Nina, is expecting too. He was planning on selling their home, but that's a plan that -- like George -- will have to change with the arrival of both a grandchild and a kid of his own.",
      "tmdbMovieId": 11862,
      "avgRating": 3.07819,
      "releaseYear": "1995",
      "numRatings": 15405,
      "posterPath": "/e64sOI48hQXyru7naBFyssKFxVd.jpg"
   }
}