{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "love at first sight",
            "id": 699
         },
         {
            "name": "breakdance",
            "id": 1974
         },
         {
            "name": "daughter",
            "id": 5600
         }
      ],
      "imdb_id": "tt0775539",
      "video": false,
      "title": "Stomp the Yard",
      "recommendations": [
         33473,
         14114,
         109417,
         14544,
         21542,
         63710,
         16428,
         32304,
         13497,
         17186,
         64170,
         29901,
         36934,
         16222,
         10090,
         13280,
         27360,
         11345,
         16232,
         15045
      ],
      "backdrop_path": "/6EUqhJaw9bqi2E4jvit0K8CAVbh.jpg",
      "revenue": 75511123,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "DJ",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2b3",
               "name": "Columbus Short",
               "profile_path": "/9RaKHG9aODBaTOxdytmWEM8LEHa.jpg",
               "id": 31132,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "April",
               "gender": 1,
               "credit_id": "52fe4323c3a36847f803d2b7",
               "name": "Meagan Good",
               "profile_path": "/rijAxPPt2ecneJE5z4uDZbdNivQ.jpg",
               "id": 22122,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Rich Brown",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2bb",
               "name": "Ne-Yo",
               "profile_path": "/rmcR3kkxhy3QxRjyM0UFXHDxqAB.jpg",
               "id": 31133,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Grant",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2bf",
               "name": "Darrin Henson",
               "profile_path": "/cdl6kgRRrB6v3Jx5OVTxSIZEaVW.jpg",
               "id": 31134,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Noel",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2c3",
               "name": "Jermaine Williams",
               "profile_path": "/dsO65Ck4J7rO2FbvFWWU5yQlM58.jpg",
               "id": 31135,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Duron",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2c7",
               "name": "Chris Brown",
               "profile_path": "/4k8sacCMG9jI2jo7x5XVSzq2Mnt.jpg",
               "id": 31136,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Zeke",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2cb",
               "name": "Laz Alonso",
               "profile_path": "/6zqlURffzAErl4g4d8kiUWYWmoz.jpg",
               "id": 10964,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Sylvester",
               "gender": 0,
               "credit_id": "52fe4323c3a36847f803d2cf",
               "name": "Brian J. White",
               "profile_path": "/A5xkyJ0hI6F81hHRm0xBOQEYonz.jpg",
               "id": 31137,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Jackie",
               "gender": 0,
               "credit_id": "52fe4323c3a36847f803d2d3",
               "name": "Valarie Pettiford",
               "profile_path": "/zCVJ9E4pmKRhIgCmhLv5DOAgFHH.jpg",
               "id": 31138,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Dr. Palmer",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2d7",
               "name": "Allan Louis",
               "profile_path": "/kR6FwCK5BMMIl0D9LwDkxG3fum1.jpg",
               "id": 31139,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Nate",
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2db",
               "name": "Harry Lennix",
               "profile_path": "/uwpRytLjzz1IvjNanYNlplPVal9.jpg",
               "id": 9464,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Dr. Wilson",
               "gender": 2,
               "credit_id": "573a45689251415578000bad",
               "name": "Tony Vaughn",
               "profile_path": "/wYdrDgd2T8fazdXbaBYkLriOIk5.jpg",
               "id": 114850,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d26d",
               "name": "Sylvain White",
               "profile_path": "/99sxzF0USzoEkJFmcgX42p0hNWe.jpg",
               "id": 31119,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d273",
               "name": "Robert Adetuyi",
               "profile_path": null,
               "id": 31120,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d279",
               "name": "William Packer",
               "profile_path": "/PcsrTr3Vlqg2v9uAzTpuJRbEtz.jpg",
               "id": 31121,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4323c3a36847f803d27f",
               "name": "Carl Clifford",
               "profile_path": null,
               "id": 31122,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d285",
               "name": "Rob Hardy",
               "profile_path": "/pRM1FcSgeAI3kGfaFaJBTCAixaM.jpg",
               "id": 31123,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4323c3a36847f803d28b",
               "name": "Tim Boland",
               "profile_path": null,
               "id": 31124,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4323c3a36847f803d291",
               "name": "Sam Retzer",
               "profile_path": null,
               "id": 31125,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d297",
               "name": "Scott Kevan",
               "profile_path": null,
               "id": 31126,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d29d",
               "name": "David Checel",
               "profile_path": null,
               "id": 31127,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4323c3a36847f803d2a3",
               "name": "Twinkie Byrd",
               "profile_path": null,
               "id": 31128,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2a9",
               "name": "Joseph Litsch",
               "profile_path": null,
               "id": 31130,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2af",
               "name": "Keith G. Lewis",
               "profile_path": null,
               "id": 31131,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4323c3a36847f803d2e1",
               "name": "Jonathan A. Carlson",
               "profile_path": null,
               "id": 29943,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 6.944466,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1931,
      "vote_count": 118,
      "budget": 13000000,
      "overview": "After the death of his younger brother, a troubled 19-year-old street dancer from Los Angeles is able to bypass juvenile hall by enrolling in the historically black, Truth University in Atlanta, Georgia. But his efforts to get an education and woo the girl he likes are sidelined when he is courted by the top two campus fraternities, both of which want and need his fierce street-style dance moves to win the highly coveted national step show competition.",
      "similar": [
         334,
         2288,
         858,
         637,
         5123,
         8545,
         425,
         49519,
         1164,
         1374,
         2024,
         164,
         587,
         745,
         142,
         1381,
         238,
         634,
         2014,
         7972
      ],
      "original_title": "Stomp the Yard",
      "runtime": 114,
      "poster_path": "/u4EaJcyoYMC6LYAdOSsXm3DsLQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/bz6GbCQQXGNE56LTW9dwgksW0Iw.png",
            "name": "Screen Gems",
            "id": 3287,
            "origin_country": "US"
         },
         {
            "logo_path": "/gomeNeePUUHzKxqTV59L10GF2Mr.png",
            "name": "Rainforest Entertainment",
            "id": 1309,
            "origin_country": ""
         }
      ],
      "release_date": "2007-05-16",
      "vote_average": 6.1,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Stomp the Yard Collection",
         "id": 160727,
         "poster_path": "/2qAqDHlxVS4wOf1Z8mBGpTgp7PB.jpg"
      },
      "tagline": "He will challenge their traditions. Their traditions will change his life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sylvain White"],
      "runtime": 109,
      "synopsis": "DJ Williams (Columbus Short) is a krump dancer in inner-city Los Angeles. He and his younger brother Duron (Chris Brown) compete in local dance competitions as members of a crew known as the \"Goon Squad\". Primarily due to one final dynamic step from Duron, the Goon Squad win a cash-prize battle held one night at an underground krumping competition, and the losing home crew responds by ambushing DJ and his crewmates after the show. A fight breaks out, and the leader of the rival group shoots Duron and kills him. Arrested for assault, DJ is subsequently sent by his mother to live with his aunt Jackie (Valerie Pettiford) and uncle Nate (Harry J. Lennix) in Atlanta, Georgia, where he is to attend historically black Truth University. Nate, the physical plant director at Truth, aims to teach DJ responsibility, and puts the boy to work doing maintenance as part of a work-study program. While waiting in the line to register for classes, DJ meets a fellow student named April Palmer (Meagan Good), whom he is immediately attracted to. After registration, he moves into his dorm room, where he meets his new roommate Rich Brown (Ne-Yo). Rich takes DJ to a stepping competition on the green between the Truth chapters of rival fraternities Theta Nu Theta and Mu Gamma Xi. The Mu Gamma Xi crew, seven-time national stepping champions, easily steals the show until DJ sees April across the way and runs right through the Gammas' step line in an attempt to speak to her. A fight nearly breaks out between the freshman and the Gamma steppers, whose best stepper Grant (Darrin Henson) is April's boyfriend. That night, Rich and his friends go out to a local club called the Phoenix and invite DJ along. DJ takes to the dance floor, hoping to impress April and upstage Grant and the Gammas, all of whom are also in attendance. Despite the animosity between DJ and Grant, the Gammas recognize DJ's skills as a dancer, and the Gamma chapter's president Zeke (Laz Alonso) invites DJ to pledge for Mu Gamma Xi. DJ turns down both Zeke's offer as well as an offer from the Theta Nu Theta chapter's leader Sylvester (Brian White). After learning that April is a student history tutor, DJ signs himself up for tutoring so that he can spend time with her. The two slowly begin a friendship, and DJ takes April out to dinner. During their date, April discusses the importance of black fraternities and sororities with the clueless DJ, and tells him to visit Heritage Hall on the campus' Greek Row. At Heritage Hall the next day, DJ learns about the significant number of African-American historical figures and celebrities who were members of various Greek-letter organizations, and decides to pledge for the Theta chapter along with Rich and their friend Noel (Jermaine Williams). April eventually leaves Grant for DJ, angering her father, Dr. Palmer (Allan Louis), the school's Provost, Gamma brother himself, and an adversary of DJ's uncle Nate because Dr. Palmer once dated aunt Jackie. After \"crossing over\" to become official Theta members, DJ, Rich, and Noel join the Thetas' step crew. Dismissing the chapter's traditional step moves as old-fashioned, DJ teaches his frat brothers a few of his old krumping moves. DJ does not notice that, while he is practicing a few of his brother's old dance moves, one of the Gammas is secretly videotaping him so that their crew can learn DJ's steps. Sly disapproves of DJ's attempts to modernize the Thetas' steps, and challenges DJ to a battle at the Phoenix between his line brothers and DJ's; the new moves against the old. DJ's line brothers lose the competition due to DJ's show-boating, although Sly agrees to let DJ teach the crew some new moves as a compromise. A few of the Gammas run a background check on DJ, and learn about the fight in which DJ's brother was killed, and for which DJ was convicted for aggravated assault in an unfair trial. This information is forwarded the school's Ethics Committee, which suspended DJ for the remainder of the year, preventing him from stepping at the nationals. Dr. Palmer, who has the authority to overturn the Ethics Committee's decisions, later offers to reinstate DJ, with the provision that he stop seeing April, an offer DJ refuses. When April learns from her father why DJ has been suspended, she questions DJ and learns first-hand the story behind his arrest. DJ's Aunt Jackie, an old girlfriend of Dr. Palmer's, confronts Dr. Palmer and was joined by April who overheard the conversation, leading Dr. Palmer to overturn the Ethics Committee's decision. DJ, reinstated thanks to his April's help, shows up in time to take part in the final round of the nationals stepping competition, which ends in a tie between the Thetas and the Gammas, and each crew is required to choose a dancer for a head-to-head competition. The Thetas choose DJ and the Gammas, which had secretly recorded DJ's practices, choose Grant, who has learned all of DJ's steps. Going first, Grant does DJ's exact routine from the tape. After Grant finishes, DJ matches Grant move for move, tossing in something the Gammas didn't get on tape: the move Duron performed to win his last competition with the Goon Squad. The Theta Nu Theta crew is declared the winners of the competition, and DJ is mobbed by his frat brothers as April runs out to kiss him. The scene is captured in a still black and white photo, which is added to the wall at Heritage Hall. A quote of Martin Luther King appeared just before the credits. \"Intelligence plus character. That is the goal of true education.\"",
      "writers": [
         "Robert Adetuyi",
         "Gregory Ramon Anderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0775539/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NDA4NDE2Ml5BMl5BanBnXkFtZTcwNDMxMDIzMw@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Columbus Short, Meagan Good, Ne-Yo | See full cast and crew »"],
      "reviews": [
         "The real shame is that someone might come to IMDb, see that this film is rated 2.6, think it's a legitimate rating, and not see this film. This is truly a solid film. Yes, the film is predictable, and at times cliché. Most of these inspirational films aimed at young people are. But this film rises above most others. It hits it's notes very well, and the direction and choreography are on point. The performances - acting and dancing - were very good. It's a shame that so many people have such hatred in their hearts that they won't expand their own minds by learning of cultures outside of their own. It's a shame that so many people who have obviously never seen this film used their time and energy to rate this film a 1. How pathetic is that? I'm glad that this film was a financial success, despite the \"haters\". I just feel sorry for the kinds of people who would make spreading hatred a part of their lives. You can see by some of the comments made by some of the IMDb commentators, so to speak, that they never saw this film. It's also obvious that they know nothing of the subject of this film, stepping. These are the people who might want to see this film and learn of something new. I, for one, am not big fan of \"Greek\" organizations. Still, I thought that the messages in, the performances in, and the overall execution of this film was better than any in this recent group of college age/friendship genre films. I enjoy films of all types, and I can honestly say that this is a solid film for this genre. Also, it's new in subject matter, which makes it different from it's peer films. If you're on the fence about seeing this film. You should see it. It's pretty much what you think it is from the trailers, but it's a very well made version. I'd give the film a strong 7/10. For it's genre, however, it's as good as there is.",
         "I know. The idea is not really original, but yet i have to admit the characters and the acting is not bad. The moves are pretty good, too. What i really did not like was the plot points. Everything was so obvious. Especially in the end. I knew exactly what was going to happen. Yet a gread show I actually enjoyed the leading actor very much. I've seen Street Style and Step up. Whereby i think Stomp the Yard cannot keep up with Step up, it is definitely betther than Street Style. - 2 stars because it is not a genuine idea - 1 star because the plot points a very easy to foresee - 1 Star for bad dialogue sometimes ... which leaves 6 out of 10 for an enjoyable movie. If you like the genre, go see it.",
         "STOMP THE YARD comes as a pleasant surprise to those of us who have yet to be introduced to 'stepping' - a sport/dance form that is not break dancing, not hip-hop, not modern dance, not clogging, not ballet, but instead is an exhilarating display of rhythm, physical dexterity, and creative choreography that makes this little film well worth watching. The story is minimal and hackneyed and serves basically as an outline for the dance performances. DJ (the enormously talented dancer/actor Columbus Short) is sent from Los Angeles to Atlanta's Truth University after his conviction for street brawling, a fight in which his brother (Chris Brown) was killed. Once on campus DJ is works for his uncle as a gardener and is soon courted for his step dance skills by two rival fraternities. One fraternity gains DJ's attention and he pledges. Of course there is the requisite love conflict (the beautiful Meagan Good as April), who just happens to be the girlfriend of the rival fraternity step leader (Darrin Henson), and the usual undercurrent of familial dichotomies between DJ's humble background and April's influential father bring the tension to the front: the result is DJ's triumphant performance in the annual stepping competition between the two fraternities. The ending is predictable but sensitive and with a message. The real star of the film is the magnificently choreographed and executed dancing, performed by the actual cast members. Director Sylvain White and his choreographers center their attention on the big sequences and the result is very fine entertainment. In addition to the gifted Columbus Short and Darrin Henson the cast includes such fine actor/dancers as Brian J. White, Ne-Yo, Laz Alonzo, Oliver Ryan Best, Richmond Duain Martyn, Justin Hires, and many others. It is difficult to resist the excitement of the commitment of this fine cast to the introduction of step dancing to the public at large. So much talent! Grady Harp",
         "Does this movie deserve a 2? No Way. I don't know why people feel the need to preface their voting. Did you like it? Yes. Period. I wasn't expecting a lot and perhaps that's why I had so much fun enjoying the film. I'm an indie filmmaker and sometimes it's a challenge to take off my filmmaker hat and just simply enjoy a movie. I was able to do it with this film. It was exciting, beautiful to watch and I was surprised by the storyline. People who slam a movie because it has a moral to the story or an uplifting theme should check themselves to see if they have too much cynicism running through their veins. As a black man, it was nice to see a film where characters used their wits and intelligence to avoid confrontation or deal with another's blatant disrespect. *****Oh, and the cinematography for this film was CRAZY!!! Great dance sequences, great camera work. It was SICK to the Nth!!!! Solid film to watch!!!",
         "I'm often baffled at the ratings that some of the movies end up with out here. This movie is far better than a 3+. Unfortunately, I didn't catch the very beginning, but what I did see was entertaining and well-acted, just what one would usually expect from a film of any sort. Sure, the story's been told, as most stories have, but they all have something a little unique to offer. The dance sequences weren't necessarily awe-inspiring, but they also weren't drawn out so long as to bore you. All in all, I enjoyed this picture. My perspective comes from that of a middle-aged white guy, so it might be quite different from yours.",
         "I can't believe this is sitting with a 3 rating?! I found the dancing/choreography fascinating not to mention the eye candy element and just the logistics of how they do those moves? I had not seen the actor who played DJ previously but found him quite capable as was the female lead. Plot-wise vaguely reminiscent of Save the Last Dance. I don't know what people that rated this low were expecting - my thought is that \"the dance\" was the main point of the whole movie and entertainment enough in itself. The plot elements were somewhat predictable yet with a little twist I was not expecting & overall I thought the movie progressed well as opposed to movies that have long, drawn out plot development. Perfect for those of us with A.D.D. ;)",
         "I gotta tell you, I didn't expect much from something. The characters are built up really well. This is a feel-good movie. There are a few plot lines that make you think things won't turn out okay, but in the end it does, and it makes you smile. Check this movie out yourself, you won't be disappointed. Also, it's probably the only one in it's kind, that I know of anyway Can't say more else.. The camera-work was good, storyline is strong, character development as said before is good. There are some twists in the plot, which make you wanna cheer for the main character. In the end it's about who wins it all.",
         "good. a street dancer with great moves with his crew. they beet this Mexican mob of guys and they fight them and want there money back. the main dudes bro. gets killed. he goes to live with his aunt and uncle. at registratson he falls for a girl. he quickly gets in-voled with dancing. he gets in-voled and teaches a preppy squad street moves. and his new girl is fine he and her get along well. there's not a lot to say about. because it mostly training and dancing. it was entertaining. i do street dancing and after the movie i was pumped. did a couple flips and everything. nah. but it's better than a lot of other dancing movies. good soundtrack. i really liked it.",
         "When I first watched this movie, I honestly hated it. The storyline was, naturally, predictable and the acting was just alright. But I ended up watching the movie again and it grew on me. I love all the dancing and stepping, and I've learned to deal with the plot. It's really just the dancing that made this one of my now favorite movies. So Stomp the Yard doesn't have the best storyline. The good parts about this movie are the dancing, music, and might I add, all of Columbus Short and Brian White's fineness throughout, haha. If you love dancing movies as I do, then you should give this movie a chance. Don't let the poor rating fool you; for what it is, it really is a decent movie.",
         "The beginning does not feel like a teenage drama/movie about dancing at all. It feels really mature. What follows might seem like a bit of a downfall from that, but it really shouldn't be watched like that. Try to enjoy what is coming next. Especially because for a movie about dancing the story is decent enough. And I should mention that Megan Good(e) is playing in this! If you don't know her, you missed out. While she only had a minor role in \"Brick\", she alone should be reason enough (for male viewers) to watch this. Right now (2013/14) she's doing a lot of TV if I'm not mistaken, which is almost a shame, but here she has bigger role, even if she has not that much to do (unfortunately! She should've been dancing too imho)."
      ],
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": ["Rainforest Films"],
      "summaries": [
         "After the death of his brother, An expert street dancer goes to Georgia to attend Truth University. But his efforts to get an education and woo the girl he likes are sidelined when he joins in his fraternity's effort to win a step dancing competition.",
         "After the death of his younger brother, a troubled 19-year-old street dancer from Los Angeles is able to bypass juvenile hall by enrolling in the historically black, Truth University in Atlanta, Georgia. But his efforts to get an education and woo the girl he likes are sidelined when he is courted by the top two campus fraternities, both of which want and need his fierce street-style dance moves to win the highly coveted national step show competition."
      ],
      "budget": 14000000
   },
   "movielensId": 50158,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-05-16",
      "dvdReleaseDate": "2007-05-15",
      "directors": ["Sylvain White"],
      "runtime": 114,
      "movieId": 50158,
      "title": "Stomp the Yard",
      "mpaa": "PG-13",
      "actors": [
         "Columbus Short",
         "Meagan Good",
         "Ne-Yo",
         "Darrin Henson",
         "Jermaine Williams",
         "Chris Brown",
         "Laz Alonso",
         "Brian J. White",
         "Valarie Pettiford",
         "Allan Louis",
         "Harry Lennix",
         "Tony Vaughn"
      ],
      "imdbMovieId": "0775539",
      "originalTitle": "Stomp the Yard",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["RrQOMKTD4jY"],
      "plotSummary": "After the death of his younger brother, a troubled 19-year-old street dancer from Los Angeles is able to bypass juvenile hall by enrolling in the historically black, Truth University in Atlanta, Georgia. But his efforts to get an education and woo the girl he likes are sidelined when he is courted by the top two campus fraternities, both of which want and need his fierce street-style dance moves to win the highly coveted national step show competition.",
      "tmdbMovieId": 1931,
      "avgRating": 2.90933,
      "releaseYear": "2007",
      "numRatings": 193,
      "posterPath": "/u4EaJcyoYMC6LYAdOSsXm3DsLQ.jpg"
   }
}