{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "band",
            "id": 33624
         }
      ],
      "imdb_id": "tt0468795",
      "video": false,
      "title": "Linda Linda Linda",
      "recommendations": [
         37288,
         33341,
         69454,
         169749,
         68837,
         110396,
         142499,
         49556,
         104858,
         74336,
         15318,
         151285,
         41538,
         46902,
         40886,
         2015,
         273096,
         47841,
         54659,
         16447
      ],
      "backdrop_path": "/1QaSZG8mjjDYzL66MGyef96Muyo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Son",
               "gender": 1,
               "credit_id": "52fe4543c3a368484e0500c3",
               "name": "Bae Doona",
               "profile_path": "/hE9dmpQOIdgt1GGVoZObPZmVSPh.jpg",
               "id": 21688,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kyoko Yamada",
               "gender": 0,
               "credit_id": "52fe4543c3a368484e0500ad",
               "name": "Aki Maeda",
               "profile_path": "/wpRkVndISU2bjhOyM61cT6OTDs9.jpg",
               "id": 31079,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kei Tachibana",
               "gender": 1,
               "credit_id": "52fe4543c3a368484e0500b1",
               "name": "Yuu Kashii",
               "profile_path": "/iwAQLMCAietL77gSuQbnEt4abNe.jpg",
               "id": 97563,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Nozomi Shiroku",
               "gender": 0,
               "credit_id": "52fe4543c3a368484e0500b5",
               "name": "Shiori Sekine",
               "profile_path": "/3p4JkH1vppk0QP6tdhvexcYYHZ1.jpg",
               "id": 97564,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rinko",
               "gender": 1,
               "credit_id": "52fe4543c3a368484e0500b9",
               "name": "Takayo Mimura",
               "profile_path": "/y3OQGg1orqwTYaDfHkcwecbTX4C.jpg",
               "id": 97565,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Nakajima",
               "gender": 0,
               "credit_id": "54c3d074c3a36878fb00576d",
               "name": "Yuko Yamazaki",
               "profile_path": null,
               "id": 1379797,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Koyama sensei",
               "gender": 0,
               "credit_id": "54c3d07a9251412446005de5",
               "name": "Masahiro Komoto",
               "profile_path": "/r1oQSl10Tkh9iw5eDn79yALVg19.jpg",
               "id": 226829,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Makihara",
               "gender": 2,
               "credit_id": "54c3d082925141243200609d",
               "name": "Kenichi Matsuyama",
               "profile_path": "/8V1tX3womN0KOcX9FjYPLrGstKn.jpg",
               "id": 79037,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Kazuya",
               "gender": 2,
               "credit_id": "54c3d08cc3a36878d000629d",
               "name": "Katsuya Kobayashi",
               "profile_path": "/y19ra03vS3k7fbmasLUcnnjeX5u.jpg",
               "id": 146455,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Abe",
               "gender": 0,
               "credit_id": "54c3d09ac3a36878fb005774",
               "name": "Keisuke Koide",
               "profile_path": "/sUUYp4pas5922YkFbedj7NMIDDu.jpg",
               "id": 84725,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Maezono",
               "gender": 0,
               "credit_id": "54c3d0a09251412489005fbd",
               "name": "Masaki Miura",
               "profile_path": "/sMlpUfSwYMFoN8JGO9L2NxSRlLG.jpg",
               "id": 1014998,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Kei's mother",
               "gender": 0,
               "credit_id": "54c3d0a792514124ed005f08",
               "name": "Lily",
               "profile_path": "/zhjuPDMkR154NhaaiyGEZQzJD61.jpg",
               "id": 552553,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Nakayama sensei",
               "gender": 0,
               "credit_id": "54c3d0ae92514124c8005b37",
               "name": "Kaori Fujii",
               "profile_path": null,
               "id": 1053788,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "54c3d0b69251412489005fca",
               "name": "Kôen Kondô",
               "profile_path": "/4lp4YuNILdckfSV2uNnv7zmMAZJ.jpg",
               "id": 107106,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Pierre (as Piêru Taki)",
               "gender": 0,
               "credit_id": "54c3d0c892514124ed005f0c",
               "name": "Pierre Taki",
               "profile_path": "/n6LKguACBEWMM2FNCqTQVEM7Lpx.jpg",
               "id": 120434,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Studio Employee",
               "gender": 2,
               "credit_id": "54c3d10d9251416eae00eba3",
               "name": "Hiroshi Yamamoto",
               "profile_path": "/AatrFg1dgMqZAnAy3xWwNWQgsvB.jpg",
               "id": 132935,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Karaoke Employee",
               "gender": 2,
               "credit_id": "54c3d14d92514124c8005b48",
               "name": "Takeshi Yamamoto",
               "profile_path": null,
               "id": 1122581,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Ishikawa",
               "gender": 2,
               "credit_id": "54c3d20292514124320060c4",
               "name": "Akifumi Miura",
               "profile_path": null,
               "id": 107105,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "54c3d217c3a36878fb005796",
               "name": "Saori Sekino",
               "profile_path": null,
               "id": 931471,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4543c3a368484e0500bf",
               "name": "Nobuhiro Yamashita",
               "profile_path": "/3rvqnQUGdfNeiZ0pfaBkJXdPz8E.jpg",
               "id": 583881,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "59a95f9192514157c602bd8b",
               "name": "Kôsuke Mukai",
               "profile_path": null,
               "id": 1777992,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59a95f9cc3a3683c7a03084f",
               "name": "Wakako Miyashita",
               "profile_path": null,
               "id": 1880432,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59a95fa6c3a3683ce60299b0",
               "name": "Nobuhiro Yamashita",
               "profile_path": "/3rvqnQUGdfNeiZ0pfaBkJXdPz8E.jpg",
               "id": 583881,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59a967fac3a36874d50154e2",
               "name": "Ryûji Miyajima",
               "profile_path": null,
               "id": 1537406,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a0766a09251414c19002e3e",
               "name": "James Iha",
               "profile_path": null,
               "id": 87052,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a0766a8c3a36833440036cd",
               "name": "Yûji Sadai",
               "profile_path": null,
               "id": 1634160,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a0766b09251414bd200300b",
               "name": "Hiroyuki Negishi",
               "profile_path": null,
               "id": 1041473,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a0766b6c3a368341c003450",
               "name": "Yoshihiro Ikeuchi",
               "profile_path": null,
               "id": 1716881,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a0766c09251414c23003146",
               "name": "Ayako Matsuo",
               "profile_path": null,
               "id": 1681818,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.506636,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 27337,
      "vote_count": 39,
      "budget": 0,
      "overview": "A group of four high school girls decide to put together a band for their school cultural festival. Three days before they are to play the festival, the guitarist and singer quit the band. The remaining members must figure out what to do or risk canceling. They need to find a new member to be the singer, so they ask the first girl who walks by. Unfortunately, she doesn't speak Japanese very well.  Only three days before their high school festival, guitarist Kei (Yu Kashii), drummer Kyoko (Aki Maeda), and bassist Nozumi (Shiori Sekine) are forced to recruit a new lead vocalist for their band. They choose Korean exchange student Son (Bae Doo-Na), though her comprehension of Japanese is a bit rough! It’s a race against time as the group struggles to learn three tunes for the festival’s rock concert—including a classic '80s punk-pop song by the Japanese group The Blue Hearts called “Linda Linda”...",
      "similar": [
         52449,
         233063,
         437670,
         7340,
         406997,
         77949,
         1807,
         59861,
         8835,
         10830,
         20453,
         37735,
         82690,
         862,
         302699,
         269149,
         8363,
         239,
         810,
         329263
      ],
      "original_title": "リンダ リンダ リンダ",
      "runtime": 114,
      "poster_path": "/eWzp7VnHSbqB3YbFlIE4FdtHUQD.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bitters End",
            "id": 4667,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vap/Cave",
            "id": 4668,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Covers & Co.",
            "id": 4669,
            "origin_country": ""
         }
      ],
      "release_date": "2005-07-23",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nobuhiro Yamashita"],
      "runtime": 114,
      "synopsis": "The school Festival is about to begin and Kyoko (Aki Maeda), Kei (Yu Kashii), and Nozumi (Shiori Sekine) are looking for lead vocals after their band breaks up. Kei recruits Son (Du-na Bae), a Korean exchange student who is still learning Japanese. The girls choose perform three songs from The Blue Hearts, an 80s punk rock group. They choose, Linda, Linda, Linda, An Endless Song, and My Right Hand. They have several late night practice sessions while Son tries to perfect her Japanese and Kei struggles to play the guitar better. The girls each face typical high school drama. Kei has to ask an ex-boyfriend for help. Kyoko has a crush on Kazuya (Katsuya Kobayashi) and is excited when he asks for help at the crepe stand. Son is asked out by a Japanese student who tries to learn Korean to impress her. They each face different struggles while trying to master their songs for the school festival. They almost fail to arrive when they fall asleep practicing in Studio Q. On their race to get back to the school it begins to rain and they forget instruments, fall, and Kyoko almost fails to meet her crush to tell him how she feels. They finally arrive at the school festival just in time to deliver a good performance to the excited crowd.",
      "writers": [
         "Kôsuke Mukai",
         "Wakako Miyashita"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0468795/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxMTkyNDM4NF5BMl5BanBnXkFtZTcwOTI3MDg0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Doona Bae, Aki Maeda, Yû Kashii | See full cast and crew »"],
      "reviews": [
         "I just saw this film at the Toronto Film Fest and this is what Josie and The Pussycats should have been. This charming little Japanese film will have you singing the Blue Hearts title song over and over. A group of aspiring teenage girls form a band to perform for the high school rock festival, can they get it together? Kudos to Nobuhiro Yamashita for putting together such a cute and impressive cast of young women who make up the band who are all skilled actresses. This is a sweet film that will win over any teenage girl who ever thought that they could start an indie band (but also wins over an adult crowd with it's modest charm and it's humor). Fans of Japanese female bands like Shonen Knife and the 5678s will also dig this film I think. BAE Du-Na (Sympathy For Mr. Vengeance, Take Care of My Cat) as Song wins my vote as the most endearing oddball in this film who wins you over with her big eyes and teenage awkwardness (not to mention a lot of funny misunderstandings because she is a Korean exchange student who speaks little Japanese). Generally this is a movie that will be talked about a lot I think when it gets a full release. Hands down one of the best at the Toronto fest this year (2005).",
         "Describing the plot won't do it justice - it's so much more than yet another \"putting a band together\" movie. Every character is believable, and comes with a story making her or him alive. There're laughs a-plenty, and at other times I found myself sitting there with a big smile on my face, from pure joy. And yet I wouldn't call it a comedy, as the laughs are not really central to the movie. And then there's music, full of raw energy and quite memorable - many in the audience left the theater humming and whistling the title song. I guess the best thing about this film is that it is real, there's nothing contrived or false in it that I could see. Generally I have no problem suspending disbelief and accepting the (lack of) internal logic of the world created in a movie. With Linda Linda Linda there was no need for that. It was easy to embrace the world of a high school festival and enjoy every minute of the screen time. Hmmm... I think director Nobuhiro Yamashita's other films could well be worth watching.",
         "I'm happy to report that the Japanese film Linda Linda Linda, which screened tonight at NYAFF (and was the first film of the festival that I was able to go see at the ImaginAsian theater) is hands-down the best movie I've seen at the festival so far. An upbeat and joyous film about a high school girls' rock and roll band, it's practically guaranteed to go straight to the heart of anyone who believes in music, and its power to save one's soul. The plot is as straightforward as they come. Shiba High School is holding their annual Holly Festival complete with a musical talent show, and three friends - drummer Kyoko (Aki Madea, Battle Royale), keyboardist-turned-guitarist Kei (Yu Kasii, Lorelei) and bassist Nozomi (Shiori Sekine, of the real band Base Ball Bear) are struggling to get a band together. After their previous guitarist injures her finger and has to bow out, they recruit shy Korean exchange student Song (Bae Doo-Na, Sympathy for Mr. Vengeance) as their vocalist, and decide to cover three songs by the Clash-esquire 80's J-punk group The Blue Hearts. After weeks of staying up all night practicing, jamming until the wee hours (not to mention the fact that Song has to learn her lyrics phonetically), they are finally ready to play their music before their teachers and friends. Admittedly, the description above probably makes this movie sound like every other movie about a band, or a sports team, or some kind of sentimental, rah-rah \"Eye of the Tiger\" pap. Trust me - nothing could be farther from the truth. What this movie is about is the people - the four schoolgirls that are its main characters are as quirky, and as button-cute, but also as three dimensional, as anyone you'd meet in life, and the movie's long, uninterrupted takes and improv-style acting give us a fly-on-the-wall feeling of being there. Opening with a MiniDV shot of one girl giving an on-camera interview about the Holly Festival, the movie starts out depicting its characters with shy restraint, gradually revealing more and more about their personalities, foibles, their joys and sorrows, until eventually, they literally start to feel like our friends. By the end, when the group performs their songs, we've honestly forgotten that they are characters in a film. We want to stand up and applaud. I would honestly say that Linda Linda Linda is one of the greatest rock and roll films I've ever seen. Being a recent film, it doesn't have the legendary status of This Is Spinal Tap or A Hard Day's Night, but honestly, it's up there. This is rock and roll stripped down to its very core. No pretension, no decadence, no sex, drugs, limos, and all of that bullshit - just the three-chord structure of a song and its power to save lives. It's a truly beautiful thing to see and hear.",
         "Saw this yesterday at the London Film Festival, and as a fan of The Blue Hearts, I wasn't disappointed. Four schoolgirls start a covers band so they can play at the school festival, and have to overcome a tight time-limit and personal dramas before they get there. The film is beautifully acted and shot, and totally sweet from start to finish. At two hours it's a tad over-long, but some mesmeric camera-work and subtle humour helps it along nicely. The casting is superb, with every character believable and captivating. And of course the music's fantastic - the title song gets played to death but it's still a cool cover of a great Japanese punk song, and James Iha of Smashing Pumpkins does a brilliant job with the incidental music. I'm so glad this film got an English sub, and considering how quickly the tickets sold out for these two London screenings, a full release would be warmly welcomed. Highly recommended.",
         "Those few people who commented this movie is 'boring' are missing the point entirely. Perhaps it is a matter of taste, what you are looking for in a movie. If you are looking for those quick pick-me-up rock'n roll flicks, with heroes/heroines get the girl/boy and fat recording contracts after performing jaw-dropping numbers, overcoming incredible odds, then perhaps this movie is not for you. But pick you up in a bigger and more satisfying way this movie does. This movie is realistic in that it does not need artificial plot devices and major suspension of belief on the part of the audience. It just shows what ordinary teenage high school girls trying to put together a rock band in a few days for a festival would do in those precious few days of their lives. This is perhaps the last significant thing they will do before they head out to the real world (and maybe college). Kudos to the director who sets the right pace for the scenes. In my opinion, Japanese movies in general have slower pace than necessary, but for this movie it was the right one and gives the audience the feeling that they really spent those few days with them. It is time well invested and gives the viewer a big payoff. Of course Bae Doona absolutely steals all the scenes she is in. Not only she is an amazing talent, but these roles come naturally to her since she cut her tooth in a highly-acclaimed high school TV drama before taking on motion pictures. Look for her in the forthcoming 'The Host (2006)'(Korean title 'Gwoemul'). All in all, a very satisfying movie. And I just had to buy the Blue Hearts CDs. The songs just would not leave my head!",
         "Having just had a week filled with watching two Shakespearean tragedies, I was ready to be uplifted and found the perfect answer in Nobuhiro Yamashita's Linda Linda Linda. It is not only a feel-good movie, it is a feel-great movie that had the audience dancing in the aisles (figuratively, if not literally). Yamashita has managed to put together not only one of the best rock films but also one of the most truly honest films I have seen about what life is like for teenagers. It also has a very infectious song, Linda Linda Linda, arranged by former Smashing Pumpkin James Iha that will roll around forever inside your brain. The songs are not lip-synced but are actually performed by the talented actress musicians. The plot is simple and can be summarized in a paragraph or two but the strength of the film is not in its story but in its quirky humor, natural conversations, great music, and the small moments that convey the roller coaster existence of high school life. Four girls attending Shibazaki High School in Japan want to compete at the annual Holly Rock Festival but things are not going their way. With less than three days before the competition, Moe (Shione Yukawa), the lead guitarist, has just broken two fingers in an accident and is unable to play. Two members, Kei (Yu Kashii) and Rinko (Takaya Mimura) have had a falling out over Rinko's attempt to recruit a boy to play in the bandand are not on speaking terms. A patchwork solution is proposed where Kei decides to be the guitarist while Kyoko (Aki Maeda) moves to drums and Nozomi (Shiori Sekine) plays the bass. All that is left is to find a singer and a song, no small task. With days left to prepare, the girls agree to choose the first person who walks in the corridor in front of them. Since the first person was a boy, they decide to pass. They also pass on Rinko, a vocalist they used in a former band. Since Rinko doesn't want to sing the song they've chosen, they pick the next girl walking by, a Korean exchange student named Son (Bae Du-na) who agrees to sing but without much knowledge of Japanese, rehearsals are a struggle to communicate. Calling themselves the Paran Maum, the girls have to sneak around the school and rehearse at night, often falling asleep on the floor. The pace of the film is slow and the girls face challenges but they are real life events, not \"movie\" problems. Kyoko is attracted to Kazuya (Katsuya Kobayashi) but needs to find the confidence to let him know. Kei must learn to work within the confines of a group and give up some control and Son has to become comfortable enough with the language to perform. While the story may sound like a teenage soap opera, Linda Linda Linda stays away from cliché and the film is without contrived plot twists or dramatic confrontations with parents (who are mostly non-existent in the film). Along the way, however, there are some very endearing moments. One is Son's attempt to enter a karaoke club without buying a drink and her back and forth conversation with the attendant borders on the painfully hilarious. Another great scene is when a young boy tries to communicate in broken Korean to Son that he loves her but there is more than a language barrier. The acting in Linda Linda Linda is uniformly excellent, especially the performance of Bae Du-na who moves from being shy and inarticulate to front and center stage and sweeps you away with her great smile. The ending of the film is so perfect that I dare not give it away except to say that the feeling the film leaves you with is one of pure and simple joy.",
         "please ignore the other comment . this movie is simple and effective. i saw it during the festival du nouveau cinema in montreal. i just randomly picked it even if the synopsis didn't seem that interesting... set in japan, its about 4 teenage girls who form a rock band so that they can play a song at their school festival. the characters are well developed. the images are reallllly nice.(a la jim jarmusch) its like a teen movie made for people who don't usually like teen movies. the pace is a bit slower than usual teen movies but its much more mature and still ends up being funny. plus, the soundtrack, by james iha (ex-smashingpumpkins), is quite good go see it. or rent it or whatever.",
         "In most films, directors try (with varying degrees of success and failure) to capture various feelings and emotions set in times and places that will connect with the viewer. When the director fails to catch the vibe emanating from the source material the film falls apart. But every once in awhile a director gets the material and turns out a product that seamlessly captures a slice of life. The latter better describes Nobuhiro Yamashita's Linda Linda Linda, a beautifully constructed study of young love, high school politics, and of course, rock and roll. In preparation of a High School Festival due in three days, band leader Kei (Yu Kashii) forms a group to cover the works of a J-Punk band named The Blue Hearts for the festival. She quickly finds a drummer, Kyoko (Aki Maede), and a bassist, Nozomi (Shiori Sekine). After some difficulty, the group finds itself their singer; a Korean exchange student named Son (Donna Bae), who only has a basic knowledge of Japanese. The group prepares tirelessly for the coming event... but will they be ready in time? OK, (I want to get this out of the way) I have one major gripe about Linda... To be honest, the first thirty minutes are paced so slow that it borders on tedium. Some scenes (in the beginning) are totally unnecessary to the plot and could have been edited better to provide the film with a better flow. Though after that, the film magically changes itself into a beautifully endearing coming of age drama complete with cute Japanese schoolgirls and blazing punk rock. After the clumsy beginning, Linda Linda Linda does one thing that few films can boast. It does an exquisite job of capturing the awkwardness of youth, the purity of blossoming friendships, and the universal love of music. As the film progressed, I was constantly reminded of simpler times in my life. A time when friends were closer than they ever were (after which life puts you through the ringer). A time when every experience was fresh and new and exciting... basically it reminded me of how it was to be young. This is no small accomplishment and is the film's strongest point, as well (I believe) as Nobuhiro Yamashita's primary goal in making Lind Linda Linda. Other than the emotional aspect of the film, Linda also features brilliant cinematography and a great score. Much of the camera-work seemed to be aimed at casting a \"Abbey Road\" effect, as many of the film's shots could be easily mistaken for album cover artwork. Add James Iha's (Smashing Pumpkins) melodic rock soundtrack and covers of the J-Punk band The Blue Hearts, and you get some moments of intense allure (i.e. what I like to call, \"mind candy\"). And we can't forget the actresses. Everyone holds their own here, playing their roles expertly and acting how you'd expect teenage girls to act, the standout being Donna Bae as Son. Her wide eyed, naive Son clinches the film and puts it into the level of greatness. She plays the kind of girl that you'd want to befriend, both subdued and full of life at the same time. Bottom Line-This is a beautiful film that encapsulates all the emotions of youth. A bit boring and unfocused at the start but the rest of the film more than makes up for it.",
         "I saw this film at the 2005 Toronto International Film Festival. Named for a song by legendary Japanese \"punks\" The Blue Hearts, this film tells the story of four girls who form a band for an end-of-year high school festival. They decide to play covers by The Blue Hearts, and although the film only covers a few frantic days of practice, the pace is sometimes glacial. I'm not sure that this is a bad thing, though it felt like the film wanted to go in two directions. On the one hand, it was a typically sentimental Japanese film about the passing of youth, and the director gives us a few shots of each of the girls smiling wistfully while gazing off in the distance. On the other hand, it's a film about a thrown-together-for-the-hell-of-it cover band, and it could have used a bit more of that kinetic attitude. That being said, it was hugely enjoyable (though probably a good 15 minutes too long), and Bae Doo Na, who plays the gawky Korean exchange student, literally steals the film. Her transformation from gawky outsider to sassy singer, though unrealistically quick, is endearing. And only in a Japanese film would someone get to sing the lyrics, \"Like a rat, I want to be beautiful\" and make it sound heartfelt.",
         "A group of Japanese high school girls are preparing to perform at the School Rock Festival. Three days before the fest, the guitarist injures her hand, leading to an argument between the keyboardist and vocalist. Their search for a lead singer leads them to a shy Korean exchange student (Du-na Bae) who barely speaks the language and can't really carry a tune. Will they be ready in time for the fest? This was released on DVD in the US a few weeks ago and I have watched it 3 times since, yet I can't seem to get enough of it. I think it's one of the best films this decade. It's probably the best movie I've ever seen about teenage girls, and one of the best movies I've ever seen about rock'n'roll. I've read complaints that it's slow and nothing happens in the film, and I can understand that. The movie has a very subtle feminist and punk-rock aesthetic that I don't think every viewer picks up on. It doesn't pander to its audience, nor does it beat you over the head with its messages. And the music is awesome. Du-Na Bae (\"The Host,\" \"Ring Virus\") has quickly become my favorite Korean actress. She's brilliant and hilarious in this. The other actresses (including two young women from \"Battle Royale\" and a real-life j-rock star) are also excellent. \"Linda Linda Linda\" is rock 'n roll in the purist sense. Genius."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Bitters End",
         "Covers & Co.",
         "Vap/Cave"
      ],
      "summaries": ["A music group of girls need to learn to play a song before the school festival."],
      "budget": 0
   },
   "movielensId": 50583,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2005-07-23",
      "dvdReleaseDate": "2007-05-08",
      "directors": ["Nobuhiro Yamashita"],
      "runtime": 114,
      "movieId": 50583,
      "title": "Linda Linda Linda",
      "mpaa": null,
      "actors": [
         "Bae Doona",
         "Aki Maeda",
         "Yuu Kashii",
         "Shiori Sekine",
         "Takayo Mimura",
         "Yuko Yamazaki",
         "Masahiro Komoto",
         "Kenichi Matsuyama",
         "Katsuya Kobayashi",
         "Keisuke Koide",
         "Masaki Miura",
         "Lily",
         "Kaori Fujii",
         "Kôen Kondô",
         "Pierre Taki",
         "Hiroshi Yamamoto",
         "Takeshi Yamamoto",
         "Akifumi Miura",
         "Saori Sekino"
      ],
      "imdbMovieId": "0468795",
      "originalTitle": "リンダ リンダ リンダ",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["nNEeKAJQ-qY"],
      "plotSummary": "A group of four high school girls decide to put together a band for their school cultural festival. Three days before they are to play the festival, the guitarist and singer quit the band. The remaining members must figure out what to do or risk canceling. They need to find a new member to be the singer, so they ask the first girl who walks by. Unfortunately, she doesn't speak Japanese very well.  Only three days before their high school festival, guitarist Kei (Yu Kashii), drummer Kyoko (Aki Maeda), and bassist Nozumi (Shiori Sekine) are forced to recruit a new lead vocalist for their band. They choose Korean exchange student Son (Bae Doo-Na), though her comprehension of Japanese is a bit rough! It’s a race against time as the group struggles to learn three tunes for the festival’s rock concert—including a classic '80s punk-pop song by the Japanese group The Blue Hearts called “Linda Linda”...",
      "tmdbMovieId": 27337,
      "avgRating": 3.86508,
      "releaseYear": "2005",
      "numRatings": 63,
      "posterPath": "/eWzp7VnHSbqB3YbFlIE4FdtHUQD.jpg"
   }
}