{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "house",
            "id": 6095
         },
         {
            "name": "mystery",
            "id": 10092
         },
         {
            "name": "teenage girl",
            "id": 10809
         },
         {
            "name": "experimental",
            "id": 14629
         },
         {
            "name": "death",
            "id": 34079
         },
         {
            "name": "schoolgirl",
            "id": 41172
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "school life",
            "id": 190116
         }
      ],
      "imdb_id": "tt0076162",
      "video": false,
      "title": "House",
      "recommendations": [
         30959,
         40149,
         31417,
         57283,
         27632,
         16093,
         16372,
         45706,
         58129,
         28043,
         11167,
         27346,
         41428,
         31217,
         29452,
         84508,
         16672,
         40037,
         42116,
         12493
      ],
      "backdrop_path": "/htkxsqt90qwLchn266xgWOyDASJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Gorgeous / Gorgeous's mother",
               "gender": 1,
               "credit_id": "5a91bcb60e0a2616c00105bb",
               "name": "Kimiko Ikegami",
               "profile_path": "/jQkD4EmFdmvzJ3SG7AbVmadNG3L.jpg",
               "id": 132765,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Kung Fu",
               "gender": 0,
               "credit_id": "5a91bcc8c3a36824fd010c02",
               "name": "Miki Jinbo",
               "profile_path": "/bsVxbB7nusDOqAU9Fm8nUqkPVLO.jpg",
               "id": 132769,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Fantasy",
               "gender": 0,
               "credit_id": "5a91bce7c3a368251700ed21",
               "name": "Kumiko Oba",
               "profile_path": null,
               "id": 1984565,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Prof",
               "gender": 0,
               "credit_id": "5a91bd1a925141417d00f001",
               "name": "Ai Matsubara",
               "profile_path": "/ye06Lnesg55ve2aT45xfZzvb3VH.jpg",
               "id": 132768,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Mac",
               "gender": 0,
               "credit_id": "5a91bd2dc3a36824fd010c9b",
               "name": "Mieko Satoh",
               "profile_path": "/6eeAPAYr7daA53EkmJHer3rb75v.jpg",
               "id": 132771,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Melody",
               "gender": 0,
               "credit_id": "5a91bd3f0e0a2616bd00fa4b",
               "name": "Eriko Tanaka",
               "profile_path": "/zWPHqEO1shZnEPrgtCWEoN9Ndjq.jpg",
               "id": 132772,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Sweet",
               "gender": 0,
               "credit_id": "5a91bd540e0a2616bd00fa64",
               "name": "Masayo Miyako",
               "profile_path": "/twUYejxdaFVbcg5xiHhQ36ABWwZ.jpg",
               "id": 132770,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Mr. Togo",
               "gender": 0,
               "credit_id": "5a91bd6cc3a368251d00f24b",
               "name": "Kiyohiko Ozaki",
               "profile_path": null,
               "id": 1523785,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Gorgeous's father",
               "gender": 0,
               "credit_id": "5a91bd8e925141418600f1a3",
               "name": "Saho Sasazawa",
               "profile_path": null,
               "id": 1523786,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Watermelon man",
               "gender": 2,
               "credit_id": "5a91bda60e0a2616c0010710",
               "name": "Asei Kobayashi",
               "profile_path": null,
               "id": 1484347,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Auntie's fiance",
               "gender": 2,
               "credit_id": "5a91bdcac3a368250200fbac",
               "name": "Tomokazu Miura",
               "profile_path": "/lAO4PsJOPMYH08KIe8FEWaFtWyP.jpg",
               "id": 33134,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Teacher",
               "gender": 1,
               "credit_id": "5a91bde50e0a2616cf00f97a",
               "name": "Fumi Dan",
               "profile_path": "/vp5g6izBLybzyphrzdF63t78Rz2.jpg",
               "id": 1032682,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Themselves",
               "gender": 0,
               "credit_id": "5a91bdf90e0a2616bd00fb69",
               "name": "Godiego",
               "profile_path": null,
               "id": 1984576,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Ryoko Ema",
               "gender": 0,
               "credit_id": "5a91be220e0a2616c30102e6",
               "name": "Haruko Wanibuchi",
               "profile_path": "/89YNFDkpBkKy6mtjpazmrnilNCv.jpg",
               "id": 148472,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Auntie",
               "gender": 1,
               "credit_id": "5a91be34925141417700f9c5",
               "name": "Yôko Minamida",
               "profile_path": "/1SkH0gcYh5UIUUKuuumD6MUNTIM.jpg",
               "id": 132767,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44d1c3a368484e038cdf",
               "name": "Chigumi Obayashi",
               "profile_path": null,
               "id": 132306,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d1c3a368484e038ce5",
               "name": "Chiho Katsura",
               "profile_path": null,
               "id": 132307,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d2c3a368484e038d0b",
               "name": "Nobuhiko Ōbayashi",
               "profile_path": "/fyevDQtdt1QnlqvgVX8rotLKhSP.jpg",
               "id": 132305,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 4.785493,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 25623,
      "vote_count": 146,
      "budget": 0,
      "overview": "A girl invites her six friends to spend summer vacation with her at her aunt’s house in the countryside. However, the girls don’t know the aunt’s secret......",
      "similar": [
         4011,
         91586,
         49524,
         201085,
         509885,
         379149,
         428449,
         166271,
         86825,
         219,
         2655,
         10756,
         10885,
         11601,
         277685,
         19592,
         288158,
         253306,
         407389,
         36040
      ],
      "original_title": "ハウス",
      "runtime": 88,
      "poster_path": "/8PGKNySPbPepA9Pu4b9MsCMuGDA.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "PSC",
            "id": 5155,
            "origin_country": ""
         },
         {
            "logo_path": "/lYCOp17DBEjFD1UygdRor98PVWR.png",
            "name": "Toho Company",
            "id": 882,
            "origin_country": "JP"
         }
      ],
      "release_date": "1977-08-26",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nobuhiko Ôbayashi"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Chiho Katsura",
         "Chigumi Ôbayashi"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0076162/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1MDU4NDQ3MF5BMl5BanBnXkFtZTgwODkxMjg2MjE@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Kimiko Ikegami, Miki Jinbo, Kumiko Ohba | See full cast and crew »"],
      "reviews": [
         "It has been said that Hausu is like Beetlejuice as directed by Dario Argento, only about ten times better than that would be. While this description is admittedly vague, it's hard to think of one that comes any closer to being satisfactory. Nobuhiko Obayashi's film defies comparison, seamlessly blending comedy, horror, and gorgeous visuals in a way that really must be witnessed in order to be appreciated. The plot itself is nothing very new, and is a kind of supernatural take on Agatha Christie's \"Ten Little Indians\" -- Seven Japanese girls venture off to visit Grandmother in her big, spooky house, unaware that the house is in fact a demon that consumes virgins. One by one, they are killed in increasingly bizarre ways -- One is eaten by a piano, one by bedding, to go on would be giving away far too much. But the story isn't really what's important here. Suffice it to say you have never seen a film like this before -- part satire, part camp, part coming-of-age story, merged with horror that is truly disturbing. The laughs are terrific and the scares are genuine; you may often feel unsure whether to laugh or shudder, and don't be surprised to catch yourself doing both at once. As if this weren't enough, add to that Obayashi's completely unique visual flair; not a single shot goes by without astounding imagery and effects. It is impossible to adequately describe Hausu for someone who hasn't seen it. But if what I've written has made it sound even the slightest bit interesting to you, you owe it to yourself to seek it out and see for yourself. Oh, and there are no subtitles, but you don't need them. Seriously.",
         "About 2 months after obtaining this title, I've not been able to find words to describe this movie, other than strange and bizarre. Depending on your mood it's either a noble failure or a triumph in film making. I couldn't use the terms ground breaking to describe it, but there's something important about the texture of this film. Imagine John Hughes and Sam Raimi kicking back and doing some hard drugs and deciding to make a movie together. It might look like this. It spends a good amount of time before it gets anywhere, focusing on four teen girls whose names seem to support their abilities, expertise, or interests. At this point, it plays almost like an average teen rom-com. But note the campy soundtrack, dancing school girls, and some rather strange almost comic book like backgrounds. It starts getting interesting as the girls set forth to movie's namesake house. They flashback and do storytelling in the form of a silent movie. We get to see some slapstick characters which don't belong in a horror movie, and we have a roll call of our four heroines as they head off into the woods. Enter the House alluded to in the film's title. So the horror begins. But this is Sam Raimi style horror. In fact, I wouldn't be surprised if some of this inspired Evil Dead - if the film was available - who knows. There's a whole series of odd scenes. Most notable is the infamous piano scene, where a piano devours someone. But that's not all. There's an evil kitty, a clock the spills out blood ala Evil Dead, a river of blood and some kooky camera work and odd cut aways! \"Ambitious\" might be the operative word to describe this movie. When I watch it, I'm not quite sure if it all works. The effects are crude, but not in the Ed Wood \"you can see the strings\" style. For me, some of it is like reading a comic book. They're bigger than life, not meant to scare you in the classical sense. But it is unlike anything you've seen before. I guess if I have any gripe about the film, it's that it takes a good while to get really fun, but when you get there, it's an insane joyride. But it's not a normal movie viewing experience and a rating does not serve it well. Watch it for yourself - and it probably wouldn't hurt to have a drink or two while doing so.",
         "This film is impossible to describe, or review, or assign an arbitrary number out of ten. In fact, calling it a film throws up the very idea of what constitutes a film. It is filmed, yes. As far as I can tell, the actors knew they were being filmed and were probably paid (in drugs maybe), but yet I struggle to define this as a film. It just doesn't seem right. Hausu is an experience. Quite an experience. You can actually pinpoint the moment where the film-makers got bored and began ingesting large amounts of LSD. It's about the time the floating head appears, followed by the girl-eating piano, and then the malevolent cat spirit that gushes blood, and the carnivorous lamp. This, of course, assumes that the film- makers were clean to begin with. Nothing could be further from the truth. There is no doubt in my mind that the film-makers started on some type of cannabis, explaining the nonsensical edits, preeeety colours and crazy scene involving a man and a bucket. Then they moved on to something harder, perhaps skunk. That would explain the talking watermelon (at at least, I think it was a talking watermelon). By the time we get to the 'Hausu' in question, dear readers and viewers, it is clear that we are being directed by hypomanic drug fiends, so tweaked on psychoactive hallucinogens that they've lost all concept of reality, rationality and reason. The orgy of drugs that precipitates throughout the crew eventually spills on to the filmed scenarios, where our hapless (and one can only assume drug-addled) girls are being subjected to a series of criminally insane scenes of violence, comedy and epilepsy-inducing flashes of colours. The experience eventually ends, rather solemnly I must say, although after at least 20 minutes of non-stop psychotropic hallucinogenia, it acts as a welcome buffer zone as you gravitate back into reality. Hausu is an astonishing experience. I kinda want to watch it on drugs, but I value my life too much. If someone does manage to, and lives, please post a comment describing your experiences. I'm sure many will be fascinated.",
         "In the hands of experimental Japanese filmmaker Nobuhiko Obayashi, the tale of seven \"unmarried\" young high-school girls who, during a school break, travel to a spooky, remote hilltop house to visit the reclusive, mysterious Aunt of one of their fold only to be consumed one at a time by the Ghost-House/Aunt in increasingly novel ways, is escalated into a spastic, phantasmagorical confetti burst of avant-garde techniques and tonalities. Not a minute goes by without some kind of imaginative and spirited experimental visual manipulation or interjection; from kaleidoscopic color schemes, to frame and time altering collage montage, to wild, high-concept mixed media integration (animation, mattes, props, sets, etc), to mini-movie injections (lovingly parodying/mimicking everything from silent film stylistics, to romantic fantasies to obligatory action scenes). Any and all workings of the film form are here incorporatedly warped; from imagery and editing to music and sound to content and presentation. Even the sketches of characters and their respective performances by the actors are hemmed in time with the overall off-the-wall configuration. (Example: Each girl is intentionally drawn with their stock personalities (the musician, the over-weight eater, the athlete, etc) novelly paraded in gleeful iconic irreverence.) The moods and tones of the film are equally melodic in their own discordant tangential way; seamlessly walking the line between comedy, horror and the deadpan aloof. It all adds up to a whole lot of fun. Where else could you see a girl eaten by a piano, an upright Bear helping cook dinner at a roadside noodle-stand or a man turned into a pile of bananas because he doesn't like melons!? With all its packed in candy-colored confections and novel door prizes, \"Hausu\" is a cinematic surprise party all in one...just add you. Get an English Subtitled DVD at: allcluesnosolutions.com",
         "\"Mac, you sure look tasty, being round and all.\" The acronym WTF was invented for House. I was warned beforehand that this movie was off the wall, but hey, 75% of the Japanese movies I've seen have been crazy. It started off as certainly a quirky movie, with unconventional screen translations from scene to scene, wacky editing, bubbly Japanese school girls with names like Gorgeous (she's very pretty), Kung Fu (she knows Kung Fu), and Melody (in a shocking twist, she's musically inclined), and just loads of that particular kind of flavor that some Japanese movies have. Then the six main characters took a trip to visit one of their aunts at her home (the house of the title), and the horror aspect of the movie set in. What specific kind of horror? The kind that involves a severed head appearing and biting a girl on the butt, and then rubbing up against it. Stunningly, the movie only escalates from there. House is fun, but it's clearly insane. An affinity for the weird and zany is a must, or this will be a waste of time for you. This movie has creativity coming out of the wazoo. How many times have you seen someone viciously attacked by feather pillows and mattresses? The special effects are also great, especially for the seventies. This was probably the most psychedelic movie I've ever seen. Is House a frightening movie? No. But if you have the right kind of sense of humor for it, you'll have a ball getting together with like-minded friends and watching this. There's a lot of comedy, of both the intentional and unintentional varieties. It's all very tongue-in- cheek. Even the soundtrack is hilarious, if you pay attention to it.  House gets a hearty recommendation from me. It's an entertaining, inventive spin on the haunted house formula, with a lot of uniquely Japanese craziness thrown into the mix. It's worth owning, in my opinion. ",
         "Hausu is basically the most bizarre Haunted House movie I've ever seen. The story follows a group of girlfriends who head to the country for vacation. They go to one of the girl's Aunt's house to spend their time. But beknownst to all of them the Aunt isn't really who she says she is. And there's a cat named Snowflake that obviously has some issues. Girls begin experiencing the supernatural and things don't seem to be slowing up. Reading back what I just wrote kinda makes the movie seem not so interesting. Seems like just another haunted house flick. But if you pop in this flick, almost immediately you will realize you've never seen a film like this. Filmed in a lively, colorful way mixed with a fantastic soundtrack, the flick exceeds on all levels of production. Combine the production values with a children's movie feel, then combine that with some blood, violence and nudity, you get a very different hybrid genre of a flick. Hausu is a flick that all fans of unique horror or cinema for that matter should check out.",
         "Wow! Noribuki Obayashi's \"Hausu\" aka. \"House\" of 1977 is easily one of the weirdest films I ever saw and I generally generally am a fan of the bizarre. A Horror-fan and avid lover of Japanese cinema, especially from the 70s, I had high expectations for this film, and I was not disappointed, even though the film was totally different than what I had expected. Having read no reviews of the film before seeing it, I expected a pure Horror film, but it turned out to be an incomparably bizarre and experimental Horror-parody, with a delightfully macabre and grotesque humor rather than scares. The film already starts out extremely strange (in an awesome manner), and it gradually gets weirder and weirder as it goes on. The film starts off with a bunch of teenage high-school girls, all of whom have certain distinctive characteristics that are mentioned in their nicknames, who travel to the countryside to visit the aunt of one of the girls. I don't want to spoil even a tiny bit of the plot of this unique Horror-parody, and therefore won't carry with a plot description, but I can assure that fans of surrealism and weird cinema will be delighted. While \"Hausu\" is not a film I would recommend to everyone, this is an absolute must-see to all my fellow fans of Japanese film, the Horror-genre and bizarre art-house cinema. Director Obayashi uses a bizarre of editing imaginable, with grotesque cutting, totally insane effects. Sometimes the editing equals that of a (bizarre) video-clip, only to jump to an entirely different style. Yet all this strangeness never draws the viewer away from the story, which is itself just as surreal as the film's style. Overall \"Hausu\" can be described as a unique and bizarre fairy tale with a grotesque and ingenious, often macabre and always unique sense of humor. There are moments in this film at which the viewer will just stare at the screen not knowing what to think, and scenes at which one is barely able to breathe in laughter, and every second of the film is very strange. Very delightfully strange that is, as \"Hausu\" is a bizarre gem that must not be missed by lovers of the surreal. Mainstream audiences might not know what to think of this, but every fan of a more unique form of cinema should give this a try. Surreal, exceptional, and one of a kind!",
         "A weird and vibrant haunted house flick unlike anything else you'll ever see. HOUSE is revered by some as a classic of kitsch Japanese cinema; it's so outlandish, so bizarre that it avoids all attempts at pigeonholing and ends up in a genre all of its own. I guess you could call that genre \"anything goes\". HOUSE resembles THE EVIL DEAD, not in look or style, but in the pure level of inventiveness on display. It's a film that's full of imagination and energy despite the often languid pacing, and the story of a group of schoolgirls visiting a crumbling mansion in the deep countryside is only the start of it. In one of the film's bizarrest highlights, a guy is transformed into a pile of bananas. It's that kind of film. The real star is director Nobuhiko Ohbayashi, who delivers the kind of drug-crazed madness that fans of cult cinema can only dream of. Once the hauntings begin, they don't let up, and Ohbayashi delivers a non-stop roller-coaster of crude, low budget and silly special effects. There are disembodied heads, evil animated cat spirits, a carnivorous piano and much more besides. The cartoonish action on-screen is accompanied by a sublime music score, of which the central theme is the type to get in your head and stay put. I won't say anymore about the film, for fear of spoiling the effect, but if you're a fan of outré cinema then you simply have to see it.",
         "This movie is the directing debut for (the great) Nobuhiko Obayashi. He has directed commercials for television before he got into directing movies. This experience helped Obayashi learn many special effects used in TV commercials. It shows in this movie as almost every scene contains some sort of special visual effects. In the mid '70s Toho studio was looking for fresh ideas for movies that would be a box office success. They've decided to use the then relative unknown Nobuhiko Obayashi to direct a movie with fresh new approach. Many of Toho's experienced staff expressed concerns over this because Obayashi never had experience of being an assistant director. Project manager for this movie then said \"Us experienced directors aren't coming up with hit movies, so experience is not the criteria for making a successful movie. Lets allow this young director to make a movie to see if he knows more about what the audience really wants.\" The original plot of this movie was written by the then 13 year old daughter of Obayashi himself. The movie has a strange career as it was rediscovered by an Asian movie affectionado who had connections with Janus films (which is the parent company of the Criterion Collection) after being released in Japan over 30 years ago. It then made limited showings in theaters around the U.S.. Very unusual as not too many film gets a roadshow in another country 30 years after it was made. Seven girls makes a plan to go on a vacation at one of the girl's aunts house in the country side. They don't suspect that the aunt died long time ago, and what inhabits the house is the apparition of the aunt that can remain young only by devouring the bodies of others. The movie is a horror comedy with bit of erotic exploitation starring many actors who were teen idols at the time. When it was first released, Miki Jinbo who played the role of Kung Fu gathered the most votes by the young male audiences, as she kicked her way around the house wearing skimpy tank top and shorts. This movie is very original in almost every way. Visuals are unusual as expressed earlier that Obayashi used many of the special effects he's learned while making TV commercials. Color is also very surreal as is the acting, but the movie has strange charm all its own, and not boring to watch. You can almost say that this is an artistic film that's also geared to entertain the audience. In the end Toho studio got just what it was hoping to achieve - a box office smash hit. This movie also established the career of Obayashi as a bankable director. Obayashi went on to direct many other successful movies including the original \"Girl who leaped through time\".",
         "No...that's another film,all together. What I am talking about is a silly,goofy,surreal,fever dream of a (so called)\"horror\" film from Japan about a group of Japanese school girls who are invited to spend the Summer with their good friend,Gorgeous (the girls in this clique all have names that align with their personalities). When Gorgeous finds out that her father is about to re-marry,she balks at the very idea that she is going to have to share her father with a stranger,so Gorgeous & her best friends,Fantasy,Prof,Kung Fu,Sweet & Melody opt to spend the Summer at Gorgeous's auntie,who lives in a creepy old house in the middle of nowhere. Things start out fine,but get weirder & weirder as they go along (a human head is found in an old well,a piano has a malevolent life of it's own,blood pours out of pictures on the wall,and other elements). From here on, the film spins out of control(in the good way,of course),and suggests the effects of the partaking of magic mushrooms,washed down with Codine based cough syrup,with a side order of some of the brown acid left over from Woodstock (in other words,blow your mind on the psychedelic,surreal images that look something like Anime or Manga designed by the British artist,Savage Pencil,or perhaps Gerald Scarfe (Pink Floyd:The Wall--either the artwork for the record album,or the animation segments for the film),directed by (either)David Lynch, or Jean Cocteau (or even both). The cast (all very easy on the eyes)includes Kimiko Ikegami,as Gorgeous (the name truly fits),Kumiko Ohba,as Fantasy,Ai Matsubana as Prof (obviously short for professor,as she seems to be the smartest of the bunch),Miki Jinbo as Kung Fu (three guesses for what her talent is,but I bet you can get it in just one),Matsayo Miyako as Sweet,Eriko Tanaka as Melody,and Yoko Minamida as Obasan (auntie),who just explodes with creepiness from the first frame she appears in (check out her weird cat,who is almost always just within frame shot). Nobuhiko Obayashi directs from a screenplay written by Chiho Katsura,from a story by Chigumi Obayashi. The film's somewhat glitzy,cheesy,colour saturated cinematography is by Yoshitaka Sakamoto,with cross cut editing,designed to f**k with your brain,by Nobuo Ogawa. This is perfect late night film fare for those with a taste for the lovers truly bizarre or the outright deranged cinema. Spoken in Japanese with English subtitles. Not rated by the MPAA,this film serves up some nudity & some really fake looking blood & gore effects. Sit back & laugh yourself silly."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": [
         "PSC",
         "Toho Company"
      ],
      "summaries": [
         "Oshare (Gorgeous) is excited about spending summer vacation with her father, until she finds out that his beautiful, freakishly serene girlfriend Ryouko would be going as well. Oshare decides she will be going to her aunt's house in the country instead. She brings with her her friends from school - Fanta (who likes to take pictures, and daydreams a lot), KunFuu (who has very good reflexes), Gari/Prof (who is a major nerd), Sweet (who likes to clean), Mac (who eats a lot), and Melody (a musician). However, the girls are unaware that Oshare's aunt is actually dead and the house is actually haunted. When they arrive at the house, crazy events take place and the girls disappear one by one while slowly discovering the secret behind all the madness.",
         "When Oshare finds out that her Father's girlfriend is joining them on their summer trip, she and her friends decide to go to her aunt's farmhouse instead. From the moment they arrive, strange things begin to happen and the girls slowly begin to realize Oshare's Aunt may not have their best interest in mind.",
         "Seven girls on their summer trip pay a visit to a possessed house which plans to eat them in extremely bizzare and surreal ways."
      ],
      "budget": 0
   },
   "movielensId": 50641,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1977-08-26",
      "dvdReleaseDate": "2010-10-26",
      "directors": ["Nobuhiko Ōbayashi"],
      "runtime": 88,
      "movieId": 50641,
      "title": "House",
      "mpaa": "",
      "actors": [
         "Kimiko Ikegami",
         "Yôko Minamida",
         "Haruko Wanibuchi",
         "Ai Matsubara",
         "Miki Jinbo",
         "Kumiko Ohba",
         "Eriko Tanaka",
         "Masayo Miyako",
         "Mieko Satoh",
         "Kiyohiko Ozaki",
         "Saho Sasazawa",
         "Asei Kobayashi",
         "Mitsutoshi Ishigami",
         "Ippei Hara",
         "Shôichi Hirose",
         "Yasumasa Ônishi"
      ],
      "imdbMovieId": "0076162",
      "originalTitle": "ハウス",
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "WQ_Yo06kIIA",
         "P_CCV3lBjwo",
         "7-u8s49Lv28"
      ],
      "plotSummary": "A girl invites her six friends to spend summer vacation with her at her aunt’s house in the countryside. However, the girls don’t know the aunt’s secret......",
      "tmdbMovieId": 25623,
      "avgRating": 3.64706,
      "releaseYear": "1977",
      "numRatings": 238,
      "posterPath": "/6vblWscFAbIm9V5CwHC7IImgAq9.jpg"
   }
}