{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "schizophrenia",
            "id": 222
         },
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "book",
            "id": 3096
         },
         {
            "name": "psychiatrist",
            "id": 15106
         },
         {
            "name": "novelist",
            "id": 155251
         }
      ],
      "imdb_id": "tt0418004",
      "video": false,
      "title": "Neverwas",
      "recommendations": [
         45069,
         83330,
         116008,
         96600,
         18188,
         135678,
         31342,
         20457,
         58467,
         192210,
         339079,
         24936,
         40562,
         385755,
         36047,
         55950,
         39424,
         34574,
         121437,
         26976
      ],
      "backdrop_path": "/mqjrClPaK5d13pRJTivEN14HGaY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gabriel Finch",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c5b",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Zach Riley",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c5f",
               "name": "Aaron Eckhart",
               "profile_path": "/aRSofX2rMpOhPanB9Wh7veYmFn4.jpg",
               "id": 6383,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maggie Blake",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018c63",
               "name": "Brittany Murphy",
               "profile_path": "/jktbTmFE3TVaKUqPDWw8VZ5rXqc.jpg",
               "id": 328,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "T. L. Pierson",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c67",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Katherine Pierson",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018c6b",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dr. Peter Reed",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c6f",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Martin Sands",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c73",
               "name": "Bill Bellamy",
               "profile_path": "/khQmLcjaaIgVQr5d91drXVnMhzF.jpg",
               "id": 77896,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Jake",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c77",
               "name": "Alan Cumming",
               "profile_path": "/5U7rmz20snvKB099P30IJu2nmRb.jpg",
               "id": 10697,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Eleanna",
               "gender": 1,
               "credit_id": "52fe4442c3a368484e018c7b",
               "name": "Vera Farmiga",
               "profile_path": "/oWZfxv4cK0h8Jcyz1MvvT2osoAP.jpg",
               "id": 21657,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Dick",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c7f",
               "name": "Michael Moriarty",
               "profile_path": "/vWDVdQpYvCS0ez1z0zk5N9BffY9.jpg",
               "id": 21030,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Terrence",
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c83",
               "name": "Ken Roberts",
               "profile_path": null,
               "id": 92958,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c89",
               "name": "Joshua Michael Stern",
               "profile_path": "/asACKiJSAZzhF7sDO1fFXlpyCG9.jpg",
               "id": 64139,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018c8f",
               "name": "Joshua Michael Stern",
               "profile_path": "/asACKiJSAZzhF7sDO1fFXlpyCG9.jpg",
               "id": 64139,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "56bd33289251417359001541",
               "name": "Helen Jarvis",
               "profile_path": null,
               "id": 22061,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.040048,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 22473,
      "vote_count": 41,
      "budget": 0,
      "overview": "Zach Riley (Aaron Eckhart) is a psychiatrist, who leaves a job at a prestigious university, to take up a job at the privately run mental institution, 'Millwood'. What he doesnt reveal at the time of his appointment is that this was the very place where his novelist father, T.L. Pierson (Nick Nolte), spent many years of his life.",
      "similar": [
         12662,
         167,
         2832,
         956,
         267192,
         207932,
         452507,
         14869,
         3597,
         13515,
         8834,
         101299,
         25376,
         4970,
         21484,
         223,
         19959,
         27022,
         20504,
         34584
      ],
      "original_title": "Neverwas",
      "runtime": 108,
      "poster_path": "/wQn1hj1jYeOrqprvyKQaFGK66v0.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Legacy Filmworks",
            "id": 4369,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Neverwas Productions",
            "id": 4370,
            "origin_country": ""
         }
      ],
      "release_date": "2005-09-09",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Every fairy tale needs its hero.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joshua Michael Stern"],
      "runtime": 103,
      "synopsis": "Zach Riley (Aaron Eckhart) is a psychiatrist, who leaves a job at a prestigious university, to take up a job at the privately run mental institution, 'Millwood', belonging to Dr. Reed (William Hurt). What he doesnt reveal at the time of his appointment is that this was the very place where his novelist father, T.L. Pierson (Nick Nolte), spent many years of his life, and later wrote a popular childrens classic, Neverwas. Once there, he meets a schizophrenic patient, Gabriel Finch (Ian McKellen), and soon finds that more things linking him to the story, and to the book than he ever thought, and also to the recovery of the patient, who believes himself to be a character from the tale",
      "writers": ["Joshua Michael Stern"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0418004/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4MTQ0MDU0M15BMl5BanBnXkFtZTcwNjkyMjc0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Aaron Eckhart, Ian McKellen, Brittany Murphy | See full cast and crew »"],
      "reviews": [
         "This is one of those quiet little movies that you go to see one day because you have nothing better to do and the plot sounds OK but you really haven't heard much about. Then you come out of the theatre wondering why everyone else you know hasn't gone to see it yet. Ian McKellan and Aaron Eckhart both give strong performances easily pulling off the emotionalism needed for the movie, and throwing in enough humor to keep you interested. Nick Nolte, Jessica Lange, William Hurt, and Brittany Murphy all pull off great supporting roles without overshadowing the main actors. Alan Cumming, although his role is small, really pulls at the heart strings with his portrayal of a patient of the institution. Because this movie has had little (if any) publicity, I think this movie will do well based on word of mouth alone. Definitely a \"hidden gem\".",
         "When I read some of the negative comments here I almost didn't watch the movie; Now I'm glad I did! I love movies where you are drawn into the story and feel like you are actually there the whole time. I felt like that the whole duration of the movie and forgot everything else for a short period of time. The whole fairy tale versus the real-life (sad) story is wonderfully written and works in every way. Maybe it's because I experienced the same thing with my father, as Zach does, when I was young, but the emotions that Zach goes through are very real and really made me think. Missing someone so much, feeling guilty, problems sleeping, are all things I'm familiar with. And It's good to feel that you're not the only one with these kind of emotions. The acting is fantastic, involved and emotional. The whole \"autumn feel\" cinematography and melancholic music sets a great mood. Neverwas touched me. I suggest you watch it if you believe just a little bit in fairy tales and want to see something different than most productions coming out from major studios at the moment.",
         "I don't know where eabrownfield (reviewer) gets off telling people to \"stay away\" from Neverwas. This is a magical, and very touching story. An excellent premise with a superb cast and stellar performances from all involved. The scenic settings were well shot and lit, often showing the differences between the dark and lighter sides of life. I say dark, yes there are parts in this film that are hard hitting, poinient moments that really make you think and get you inside the characters being played, again i think this is down to the great acting. The flip side is the fairy tale narrative that runs through the whole film, not that it turns in to a children's film at all, as its a story I'm sure many can relate to and will enjoy being told in this fashion. I will say it probably deserves its pg13 rating, its perhaps not for the very young, despite its fairy tale like appearance. Overall go and see this film, you wont be disappointed, i had a great time.",
         "I enjoyed it immensely, not being a critic, I simply can say, I identified with the human struggle which in this story wore the garb of mental illness, and the triumph of the soul, which as usual required faith and courage. I also thoroughly enjoyed the acting. Brittany Murphy was adorable opposite Aaron Echart. Ian McKellan was a wonderful depiction of a fairy tale king. This was not a low budget film and the money wan't wasted. It's curious that films like this one are released and there is no fanfare whatsoever. I am always hoping to find a sleeper and have the surprise of a great evenings entertainment. Neverwas delivered. Enough said. And I didn't even have to mention Nick Nolte, Jessica Lange or any of the other great talent in this film.",
         "NEVERWAS, a little miracle of a movie written and directed by Joshua Michael Stern, is an allegory, a fairytale, a dissection of the impact of mental illness on parents and children, and story of compassion, believing, and blossoming of character that was created with a sterling ensemble of actors in 2005, failed to find a niche in theatrical distribution, and went straight to DVD - becoming one of those limited release films that is very elusive even in the megavideo stores. The reasons for this relative anonymity are not clear, but film lovers will do well searching out this little gem: the rewards are immediate gratification and long lasting satisfaction. Narrated by Ian McKellan who plays a major role in the film, the story concerns the return of psychiatrist Zachary Riley/Small (Aaron Eckhart) to an obsolete mental institution named Millhouse, the hospital where his author father T.L. Pierson (Nick Nolte) ended his days in suicide, having suffered from bipolar syndrome. Zach wants to discover secrets about his father, why his father's book 'Neverwas' has been so disturbing to Zach, and to offer good medical treatment to those patients living in the obscure hospital run by the kindly but enigmatic Dr. Reed (William Hurt). Zach is buoyant, greets his new job with joy, and works with various patients in group and individual therapy (the group includes well developed characters portrayed by Alan Cumming, Vera Farmiga, and Michael Moriarty, among others) and encounters the apparently mute Gabriel Finch (Ian McKellan), a delusional man who believes Zach has returned to break the curse preventing his return to his imaginary kingdom of Neverwas. Zach meets a 'grad student botantist'/reporter Ally (Brittany Murphy) who loves Zach's father's book and urges Zach to read the fairytale as a means to assuage Zach's new nightly nightmares and insomnia dealing with images of himself as a child, his father's suicide, and other strange forces. Ally's commitment to Zach's father's book, Zach's breakthrough to Gabriel Finch, together with Zach's re-evaluation of his agoraphobic mother (Jessica Lange) all intertwine to reestablish Zach's discovery of his relationship to a father whose mental illness prevented the close relationship Zach so desperately missed. In a tumbling set of events that incorporate the fairytale of the book Neverwas with the reality of Zach's father's relationship to Gabriel Finch brings the story to a heartwarming, well considered, touching conclusion. Being 'unordinary' is a goal, not a curse. In addition to the above-mentioned stellar cast, small parts are also created by Bill Bellamy, Ken Roberts, Cynthia Stevenson among others. The cinematography by Michael Grady manages to keep the audience balanced between real and fantasy and the musical score by renowned composer Philip Glass fits the story like a glove. Ian McKellan gives a multifaceted performance of a man whose delusional life is far more real than his life as a mental patient, Aaron Eckhart finesses the transformation of the lost child seeking his roots with great skill, Nick Nolte gives one of his finer interpretations as the disturbed father/author, and Brittany Murphy manages to maintain a much needed lightness to the atmosphere of the mental institution story setting. The impact of the film, while absorbing from the first images, is the ending, a reinforcement of the importance of love and nurturing that too often is relegated to little books for children instead of the manner in which we live our lives. This is a fine film well worth ferreting out from the obscurity to which it so unjustly has been assigned. Grady Harp",
         "There is absolutely no way to discuss this movie without revealing some aspects of it. On the other hand, this is not a movie that relies on the ending, but one illuminated by it. Like \"Sixth Sense\", this is a movie that means more on the second viewing. So, I will give away part of the basic structure of the movie. If you already plan on seeing the movie, there is no reason to continue. If not, you might as well read ahead; it might change your mind. SPOILER WARNING! For us the viewers, the story starts in the middle. Zach, son of a the famous author of the children's book \"Neverwas\" quits a position as a psychiatrist at a prominent college to go to a nobody's-heard-of-it institution in the community where he grew up. Zach (we learn quickly) is tormented by the suicide of this father. Like most suicide relatives, he both blames his father and himself. He has divorced himself from the fantastical world of his father's book, from all fantasy at all, from all remuneration from his father's highly successful book. For Zachary, reality is survival. He meets a delusional paranoid schizophrenic named Gabriel. What we don't get told about Gabriel until the end of the movie is his nightmarish existence as a little boy: being locked up, abused. Gabriel survived this by creating a world of his own, Neverwas. Neverwas is a world of hope and peace, a world inhabited by fairies and in which Gabriel is the benign king. Gabriel and Zach's father meet in the mental institution. Gabriel is there for his delusions, Zach's father for his bipolar-ism. The father and Gabriel become friends. Zach's father offers his belief in Neverwas. In fact, he takes Gabriel's world and turns it into his story. As each go in and out of institutions, they maintain a correspond of affection and support. Gabriel's Neverwas is on land that ultimately Zach's father purchases for him. Unfortunately, the father is not able to care for Gabriel or provide him long term security. His depressions win out and he commits suicide. The conflict/question the movie initially presents - right up until the final revelations - is what is real. The viewer is led to believe there might actually be a Neverwas. This is necessary because we need to see the world from Gabriel's eyes; and to do this we must accept him with condescension. Were we to simply see him as schizophrenic, we might feel sympathy for him, but we would never empathize with him or truly understand his needs. Unfortunately, this will lead many viewers to think this is another fantasy come true; and they will be disappointed by the \"truth.\" However, the truths that do come out are beautiful and moving; and there is certainly the fantasy of a \"happy ending\", more than one has a right to expect from reality. The true story here is how people change: How Zach comes to see the need for fantasy, to forgive his father and himself; how Gabriel out of desperation has his one moment of cold reality in which he can articulate his need for Neverwas. And the movie has its moments of humor and insight and romance. For anyone willing to think and be moved, I recommend this movie highly.",
         "this is the kind of movie u never forget ....just like \"la vida e bella\" or \"dancer in the dark\"....it made me jealous on these people that have a land of their own...that \"live as they dream\"...unbelievable how simple it is to be happy and how much we complicate our lives sometimes.....anyway....i would like to thank all the actors and the people that worked to make this movie....because , even though it made me cry at first they were happy tears.... but the truth is that by watching this carefully u get (anyways i did) an idea about what really matters in your life...your dreams, your childhood (and the importance of remaining a child forever ), family, love, friends....and the most important YOURSELF....your own happiness, your own craziness,your own pleasures in life...and if that pleasure/ happiness is to live in a world of your own with kingdoms and unbelievable characters ...SO BE IT...u are a SPECIAL person...... thank u :)",
         "In these times of violent, sex-ridden entertainment this movie was refreshing. The story is intensely acted, the soundtrack fit the scenes emotionally, the colors are intense and vibrant. Watch this and please enjoy. The story is easy to follow, even with the flashbacks. The emotions are well portrayed by each actor. The soundtrack fit the scenes and brought me on an emotional \"ride\". The scenes with the filters of light and color are quite appropriate. The storyline is unpredictable without the usual Hollywood formula that I, personally, have grown sick of. This movie makes one - anyone - feel special, despite the imperfections and ghosts that lurk beneath our emotional shields.",
         "I could extol the effectiveness of the photography, or the superiority of the acting. I could cheer for a film that has so many talented and revered actors. Also, I could urge you to give \"Neverwas\" your complete attention so that you do not miss the subtle hints or twists in the plot, or encourage you not to reject this film too early in the narrative because some parts may be too dark or puzzling with a modern psychological scrutiny that would endear any viewer who loves Hitchcock. However, I won't. This movie contains the absolute Truth about the purpose of human existence. I hope that (as a viewer) you have the insight to perceive it.",
         "The great things about films are that they are subjective, if I enjoy a film it doesn't mean that you will enjoy the film or vice versa. I loved Neverwas, the cinematography, the soundtrack, a director who believed and a cast that were wonderful. Neverwas is about a young boy (Zachary) and his father (Nick Nolte, who by the way is excellent) and their loving but dysfunctional relationship. The father writes a book about an ordinary man who rules over a fantasy land called Neverwas. In Neverwas the young boy (Zachary Small) must battle the evil Ghastly and his evil minions. But shortly after writing the book the father falls in to a deep depression, a depression which ultimately deprives him of his life. Zach grows up. A boy becomes a man and he forgets about the childhood stories his father told him, he forgets the good times and remembers the bad. The human psyche is a funny thing, it can easily grant us control of our destiny and with ease take it away. Zach takes a position at a local Mental institute, the very institute that held his father. Here he meets the eccentric schizophrenic Gabriel (played by an wonderful Ian McKellen), Gabriel tells the story of Neverwas and how he is the king of the land. He believes Zachary is there to free him from Ghastly and his minions and tells him that he has but five days before Ghastly will destroy the castle and make Neverwas a cold and harsh land. He also meets with childhood friend Maggie Blake (played by a very charming Brittany Murphy) and together they journey to find not only Neverwas, but Zachs true identity, the one left behind in his forgotten childhood memories. After some digging Zach finds out that Gabriel told about the land of Neverwas ten years before his father wrote the book. Could it be real? Should he believe? One mans dreams turns out to be one mans journey. A journey to find not only the truth, but himself. What is Neverwas? To me? To me. Neverwas is about Hope."
      ],
      "genres": [
         "Drama",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": [
         "Kingsgate Films",
         "Legacy Filmworks",
         "Neverwas Productions"
      ],
      "summaries": ["A well-educated psychiatrist leaves an academic career to work at an institution where his father, a novelist, lived before writing a renowned children's book. Acclimating to his position, he encounters a schizophrenic who helps him to discover the book's secrets and his place in the story."],
      "budget": 0
   },
   "movielensId": 50705,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "2005-09-09",
      "dvdReleaseDate": "2007-07-03",
      "directors": ["Joshua Michael Stern"],
      "runtime": 108,
      "movieId": 50705,
      "title": "Neverwas",
      "mpaa": "PG-13",
      "actors": [
         "Ian McKellen",
         "Aaron Eckhart",
         "Brittany Murphy",
         "Nick Nolte",
         "Jessica Lange",
         "William Hurt",
         "Bill Bellamy",
         "Alan Cumming",
         "Vera Farmiga",
         "Michael Moriarty",
         "Ken Roberts"
      ],
      "imdbMovieId": "0418004",
      "originalTitle": "Neverwas",
      "genres": [
         "Drama",
         "Fantasy",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "36YAKngtMzg",
         "XFEE0Nesuts"
      ],
      "plotSummary": "Zach Riley (Aaron Eckhart) is a psychiatrist, who leaves a job at a prestigious university, to take up a job at the privately run mental institution, 'Millwood'. What he doesnt reveal at the time of his appointment is that this was the very place where his novelist father, T.L. Pierson (Nick Nolte), spent many years of his life.",
      "tmdbMovieId": 22473,
      "avgRating": 3.48276,
      "releaseYear": "2005",
      "numRatings": 58,
      "posterPath": "/wQn1hj1jYeOrqprvyKQaFGK66v0.jpg"
   }
}