{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "drug abuse",
            "id": 726
         },
         {
            "name": "job interview",
            "id": 3489
         },
         {
            "name": "eavesdropping",
            "id": 3878
         },
         {
            "name": "fall",
            "id": 6201
         },
         {
            "name": "troll",
            "id": 11173
         },
         {
            "name": "cheating wife",
            "id": 11501
         },
         {
            "name": "backpack",
            "id": 160192
         },
         {
            "name": "repairman",
            "id": 171729
         }
      ],
      "imdb_id": "tt0240900",
      "video": false,
      "title": "Slackers",
      "recommendations": [
         6020,
         12770,
         9536,
         10878,
         12312,
         10642,
         16300,
         15037,
         16379,
         11857,
         10050,
         14577,
         17708,
         9308,
         13166,
         9835,
         14603,
         14429,
         15644,
         41044
      ],
      "backdrop_path": "/gyVqxiFzKlPlbtVsJSZROz0fdj0.jpg",
      "revenue": 6413915,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sam Schechter",
               "gender": 2,
               "credit_id": "52fe43d2c3a368484e00021d",
               "name": "Jason Segel",
               "profile_path": "/49zyYG6HSQm76mN1SLmCCzgIN0Y.jpg",
               "id": 41088,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dave Goodman",
               "gender": 2,
               "credit_id": "52fe43d2c3a368484e000221",
               "name": "Devon Sawa",
               "profile_path": "/jur7ijuplTyNWItmXuFhCcUffd6.jpg",
               "id": 50398,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ethan Dulles",
               "gender": 2,
               "credit_id": "52fe43d2c3a368484e000225",
               "name": "Jason Schwartzman",
               "profile_path": "/3WDQYEqcqZDp5mOhDN8XSo0NVUK.jpg",
               "id": 17881,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Angela Patton",
               "gender": 1,
               "credit_id": "52fe43d2c3a368484e000229",
               "name": "Jaime King",
               "profile_path": "/zxRIrvJly1KIZdLA8c3B024LezU.jpg",
               "id": 5915,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Cameron Diaz",
               "gender": 1,
               "credit_id": "5931f3d19251417dd4000c4a",
               "name": "Cameron Diaz",
               "profile_path": "/ahFkUN9Sm8oF1txUHE5JcJ95Ere.jpg",
               "id": 6941,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Reanna",
               "gender": 1,
               "credit_id": "52fe43d2c3a368484e00022d",
               "name": "Laura Prepon",
               "profile_path": "/7iRa28jqum5M1HuMs1yNVkTYpSY.jpg",
               "id": 18974,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Jeff Davis",
               "gender": 2,
               "credit_id": "52fe43d2c3a368484e00023d",
               "name": "Michael C. Maronna",
               "profile_path": null,
               "id": 945734,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Head T.A. Philip",
               "gender": 2,
               "credit_id": "52fe43d2c3a368484e000241",
               "name": "Jim Rash",
               "profile_path": "/cXat9HZ5ajQZsrAZ8xE4zIEVEcb.jpg",
               "id": 161932,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Bruna",
               "gender": 0,
               "credit_id": "52fe43d2c3a368484e000245",
               "name": "Retta",
               "profile_path": "/nAzpnWg7NqElhUMeHKaWIqmaEpJ.jpg",
               "id": 75318,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Japanese Proctor",
               "gender": 2,
               "credit_id": "52fe43d2c3a368484e000249",
               "name": "Gedde Watanabe",
               "profile_path": "/nyTEOm2sEMJONOp3oWFKUZuJNTv.jpg",
               "id": 16183,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Hot Twin #1",
               "gender": 1,
               "credit_id": "56e48e53c3a3685aa80041c9",
               "name": "Heidi Kramer",
               "profile_path": "/sVJBsBaJJSbq44HfsqQeNABNwta.jpg",
               "id": 1589963,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Girl at Trendy Club",
               "gender": 1,
               "credit_id": "58501e6c9251416fa100a4a0",
               "name": "Gina Gershon",
               "profile_path": "/jaUQhGVmemkSyS5O0fcRkhGTOUq.jpg",
               "id": 11150,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43d2c3a368484e000233",
               "name": "Dewey Nicks",
               "profile_path": null,
               "id": 113641,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d2c3a368484e000239",
               "name": "David H. Steinberg",
               "profile_path": null,
               "id": 113642,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "57810069925141792800301d",
               "name": "Nancy Young",
               "profile_path": "/45Ofa9fi7lCiYoe52SaC2mU6244.jpg",
               "id": 1332245,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.675762,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 20009,
      "vote_count": 72,
      "budget": 14000000,
      "overview": "Dave, Sam and Jeff are about to graduate from Holden University with honors in lying, cheating and scheming. The three roommates have proudly scammed their way through the last four years of college and now, during final exams, these big-men-on-campus are about to be busted by the most unlikely dude in school. Self-dubbed Cool Ethan, an ambitious nerd with a bad crush, enters their lives one day and everything begins to unravel.",
      "similar": [],
      "original_title": "Slackers",
      "runtime": 86,
      "poster_path": "/9W6tiYZZTB45ZyWpoceBSc4Ln9y.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/bz6GbCQQXGNE56LTW9dwgksW0Iw.png",
            "name": "Screen Gems",
            "id": 3287,
            "origin_country": "US"
         },
         {
            "logo_path": "/GagSvqWlyPdkFHMfQ3pNq6ix9P.png",
            "name": "Sony Pictures",
            "id": 34,
            "origin_country": "US"
         }
      ],
      "release_date": "2002-02-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "When all else fails... cheat.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dewey Nicks"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["David H. Steinberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0240900/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3OTYzNDA1NV5BMl5BanBnXkFtZTcwNTEyODEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Devon Sawa, Robert B. Martin Jr., Jason Segel | See full cast and crew »"],
      "reviews": [
         "Worst movie of the year? Ok...the name is SLACKERS! Not Schindlers List Part 2. Why do you people try to pull so much meaning out of these stoner flicks? What are you thinking when you rent these movies? That you'll find a diamond in the rough? A Spielbergian classic?!? I like stupid humor. Sue me. I can laugh dumb nonsense. I've shown this to a ton of people and they all found humor in it. Cool Ethan is quite possibly the craziest character ever written and what his face from Rushmore pulls it off perfectly. Plus whats his face from that Stan video is PIMP in this movie. Seriously...take notes from STAN, eminems greatest fan. My advice to you critics that downplay a stupid script in the first place is to stop watching comedy's. Stop now while you're ahead. Thank you and good day.",
         "I'm actually a huge fan of all teen films, but I think this one was vastly under-rated. Some comments give the impression that it is another gross-out teen romp with nothing new to offer. In actual fact although it may be ranked alongside films such as American Pie Road Trip etc, and though it shares common themes, it is actually a far superior film. As a result, people expect a film similar to the aforementioned, and are faced instead with one which has slightly more to offer. I found this very entertaining and surprising; quite subversive and original in actual fact, more likely to appeal to a greater intellect than that of a 13 year-old the jokes are more ironic and subtle in general, with a few obvious \"gross-out\" moments sprinkled in between. Though these as well are done with tongue firmly in cheek. I would highly recommend this film, and prepare to be presently surprised by a film that most people fobbed off as another teen movie, but which is actually a lot more than that.",
         "If you like teenage/college humor and dirty jokes, this is your movie. The whole movie is basically goofy college humor and most movies like that don't really have a well thought out movie. With this they had all of that without forgetting about what the movie was about or ruining the story at the end. I felt very sorry for Dave when Ethan lied to Angela about him. Luckily they got everything settled out. I liked some of the actors and actresses who played minor characters in the movie too like Michael McDonald, Retta and Jim Rash. I'm surprised actor Michael C. Maronna isn't as big as he is because he was funny in this movie. He should get himself into more movies like this. See this movie if you haven't seen it. If you have, see it again.",
         "Slackers is a very funny and enjoyable teen movie. Of course it's dumb, but who cares, you'll get a few laughs and feel like you did something worthwhile for two hours. Anyways, Slackers is about three friends that always cheat their way through tests and always get away with it until the psychopathic school geek ethan(Jason Schwartzman) finds out and starts blackmailing them. Unless one of the cheaters named Dave(Devon Sawa) can get the beautiful Angela(James King) to go out with Ethan, he will kick Dave and both of his friends out of the school. Jason Schwartzman was very funny and also Laura Prepon did a very funny performance. She played Angela's sex crazed roomate Reanna. Devon Sawa did also a pretty good job. If you want to see a movie that will make you laugh and just plain relax for two hours, watch slackers. I would give Slackers 6/10",
         "Just when you begin to think that the teen movie genre can't get any worse, along comes a film like `Slackers' to remind us that barrel-bottom scraping has long stood as one of Hollywood's most lucrative and time-honored traditions. `Slackers' features a trio of amoral buddies who spend most of their time devising elaborate schemes to help each other cheat their way through college. Starting from this rather dubious premise, the film proceeds to encompass every cliché from every teen comedy ever made. With few exceptions, the characters are all unlikable oafs, some of whom actually seem to be suffering from some serious cases of mental illness. It's a little difficult to laugh when you begin to see someone as a genuine threat to the safety and welfare of other people in the vicinity. As with most youth comedies, `Slackers' serves up a plethora of crude sex gags, only in this case, none of them come across as particularly witty or imaginative. In an attempt to achieve a certain `originality' the film also throws in a few `fantasy' sequences that fall flat through sheer lack of inspiration. Moreover, the college classroom scenes are all appallingly unconvincing, particularly in terms of the kinds of shenanigans that are permitted during test-taking times. And the silly, all's-forgiven ending rings as hollow as everything else in the film. `Slackers' bombed big time at the box office upon its release in early 2002. Perhaps that shows that Hollywood CAN go broke underestimating the intelligence of its audience after all. It gives one cause for hope.",
         "Well, I just ordered this on my pay-per-view at home because I was bored and needed a laugh. I have to admit, I did chuckle a few times, but I don't even remember what parts they were at. I don't understand why this movie was made. It claims to be a comedy but seriousuly, I don't find a singing penis, or a naked 70 year old woman very funny. This movie was trying to fit itself into the 'gross-out' comedies of recent years such as American Pie and Road Trip, but it just failed miserably. It was way to much gross-out then it was comedy. Also, why on earth did Cameron Diaz attach her name to this movie?!?! The only thing I liked about this movie was when Dave and Angela were in the pool. I thought it was sexy and enjoyable and well-done. Besides that, avoid this movie. 3/10",
         "It was so terrible. It wasn't fun to watch at all. Even the scene where the girl is using a vibrator, even that's not fun to watch in this movie. I say again, the scene where a girl is masturbating with a vibrator is not even fun to watch. Or maybe if that was the only part of the movie that you watched, just girl on couch using a vibrator. Maybe they should have just released that one scene in theaters, maybe then the movie would be enjoyable on a certain level. My advice, fast forward to that point, watch it, rewind the movie, watch it again, rewind, repeat. Maybe you could enjoy yourself for 2 hours that way. This movie ranks alongside I spit on your grave and Doom generation in the category of worst movies that I have ever seen.",
         "This is the worst movie I have ever seen. I was deceived into thinking it might be good because a couple of my favorite actors are in it. Now I want to punch Jason Schwartzman in the face for taking this role. I was physically ill after watching this film. I really don't understand Hollywood sometimes. There are so many people trying to break in that I'm sure you can skim off the top and get the very best. That way the worst movie you make is equivalent to Ferris Beullar instead of this sludge. The gags like the hair doll and blatantly ripping off jeans commercials added to the humorlessness of the film. Glad I avoided this film and watched it on TV. This proves that you should avoid January releases at all cost.",
         "This film looked promising but it was actually pretty bad. The premise was O.K, but the plot itself was terrible. The actors tried their best with limited material, but they could not rise above the mean spiritedness of this tacky college film. Jason Schwartzman was once again immensely irritating - even more so than in Rushmore, the rest of the cast were quite non-eventful. Scenes that should have been fun turned out to be off-putting & incredibly juvenile. Tries to be a Road Trip/American Pie but fails dismally on all levels. A total waste of everyone's time.",
         "Every once and a while a movie comes out that the critics can't stand. In fact, it seems like every other week doesn't it? Well, this week it's Slackers, the very disjointed, (but still funny), comedy Starring Devon Sawa, James King and Jason Schwartzman. Dave (Devon Sawa), Sam (Jason Segel) and Jeff (Michael C. Maronna) are the best cheaters on campus cheating their way though college with elaborate scams and cons that probably take more planning and energy than it would take to actually study hard. No, there will be no moral judgement here. It's just an observation. Besides, the scamming looks like it's more fun than cramming for finals. Luckily, it's fun for the audience as well. Things are going alright for our 3 man crew until Dave makes the mistake of taking Ethan's (Jason Schwartzman) seat during an exam. Dave also screws things up by flirting with and giving a phone number to Angela (James King). The problem isn't that Dave gave his phone number. It's that he wrote it on a teachers copy of an exam... which Angela didn't take with her. When Ethan finds this incriminating evidence he threatens to get the boys kicked out of school unless they hook him up with his dream girl, Angela. So, our \"slackers\" set out to do the impossible by finding out what makes Angela tick by visiting her dorm room and parents home, stealing her notebooks and copying e-mail files. This is all for not because the socially awkward Ethan doesn't have a chance. Especially since it's Dave that she likes and not \"Cool Ethan\". As with all teen comedies there is conflict. Some newly found trust issues temporarily break up the threesome and when Angela finds out that Dave may have seduced her only because of Ethan's blackmail scheme she breaks up with him. Eventually our cheaters figure out that their friendship is more important than a diploma. With his friends help, Dave finds the courage to finally confront Angela and tell her the truth as well as how much he loves her and how he found his true self by loving her blah, blah, blah. Nothing really new here. What is funny about \"Slackers\" are the frequent fantasy sequences and dick and fart Jokes. Some gags are very funny such as Ethan's fantasy making out with 2 girls at once and a sequence portraying the friendship of the \"slackers\". Of course some are not so funny such as Ethan groping a 70 year old Mamie Van Doren. Ugh!). The real standouts of the flick are Jason Segel and Michael C. Maronna. You may remember Segel from his guest performances as Eric, Lizzie's on again off again boyfriend on TV's Undeclared and Maronna playing a \"real\" slacker in the Ameritrade commercials. These two upstage Sawa and Schwartzman easily. It also helps that they are included in the films funnier scenes. They also seem like they had the most fun on the set. Laura Prepon (That 70's Show) has a small role as Angela's very sexual roommate. She really doesn't have much to do except masturbate on a couch and complain that the test in a woman's magazine rates her \"two points above skank\" (Go Figure). The major problem is that while many of the gags in the flick are funny on their own, many of them seem out of place and seem to be there only to break up the \"run of the mill\" love story. Also, upon closer inspection the blackmail plot is full of holes. Our heroes could have easily stolen all of the evidence back making Ethan's case very weak. So, while you shouldn't expect the worst comedy of the year, (so far, that honor goes to Kung Pow: Enter the Fist), \"Slackers\" belongs in the \"guilty pleasure\" file. It's not bad enough that you'll hate it. But, it's not good enough to recommend it without feeling embarrassed that you paid \"good money\" to see it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Alliance Atlantis Communications",
         "Destination Films",
         "Original Film"
      ],
      "summaries": [
         "Dave, Sam and Jeff are about to graduate from Holden University with Honors in lying, cheating and scheming. The three roommates have proudly scammed their way through the last four years of college and now, during the final exams, these big-men-on-campus are about to be busted by the most unlikely dude in school.",
         "Dorm mates Dave Goodman, Sam Schechter and Jeff Davis where cockily confident to graduate this year from college without doing an honest study of studying, being accomplished masters in exam (and other) fraud. Then weird, mean nerd Ethan Dulles works out their scam and threatens to have them exposed, hence expelled- unless wheeler-dealer Dave and studly charmer Sam, plus careless Jeff, help him to to hand (and he hopes heart) of foxy Angela Patton. However in that process, Dave falls in mutual love with her, incurring the wroth of Erhan and risking his mates' confidences.",
         "When geeky Ethan discovers three fellow students scamming the examination system, he blackmails them to win over the college's most popular girl."
      ],
      "budget": 11000000
   },
   "movielensId": 5080,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-02-01",
      "dvdReleaseDate": "2002-05-28",
      "directors": ["Dewey Nicks"],
      "runtime": 86,
      "movieId": 5080,
      "title": "Slackers",
      "mpaa": "R",
      "actors": [
         "Jason Segel",
         "Devon Sawa",
         "Jason Schwartzman",
         "Jaime King",
         "Cameron Diaz",
         "Laura Prepon",
         "Michael C. Maronna",
         "Jim Rash",
         "Retta",
         "Gedde Watanabe",
         "Heidi Kramer",
         "Gina Gershon"
      ],
      "imdbMovieId": "0240900",
      "originalTitle": "Slackers",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["kMiUe69TIDI"],
      "plotSummary": "Dave, Sam and Jeff are about to graduate from Holden University with honors in lying, cheating and scheming. The three roommates have proudly scammed their way through the last four years of college and now, during final exams, these big-men-on-campus are about to be busted by the most unlikely dude in school. Self-dubbed Cool Ethan, an ambitious nerd with a bad crush, enters their lives one day and everything begins to unravel.",
      "tmdbMovieId": 20009,
      "avgRating": 2.77232,
      "releaseYear": "2002",
      "numRatings": 560,
      "posterPath": "/9W6tiYZZTB45ZyWpoceBSc4Ln9y.jpg"
   }
}