{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "factory",
            "id": 1382
         },
         {
            "name": "sicilian mafia",
            "id": 155538
         }
      ],
      "imdb_id": "tt0056210",
      "video": false,
      "title": "Mafioso",
      "recommendations": [],
      "backdrop_path": "/z5Q09PMkEsh6K6PLKcxNbgh9hmN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Antonio Badalamenti",
               "gender": 2,
               "credit_id": "52fe45829251416c91034d13",
               "name": "Alberto Sordi",
               "profile_path": "/qfrgQ551SxM2i4LMIFLX7kScUc7.jpg",
               "id": 45982,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Marta",
               "gender": 1,
               "credit_id": "52fe45829251416c91034d17",
               "name": "Norma Bengell",
               "profile_path": "/mkLE5RK2BmQ9IJ9oeomHpHFdt9C.jpg",
               "id": 39157,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Don Liborio",
               "gender": 0,
               "credit_id": "52fe45829251416c91034d1b",
               "name": "Carmelo Oliviero",
               "profile_path": null,
               "id": 143344,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Rosalia",
               "gender": 1,
               "credit_id": "52fe45829251416c91034d25",
               "name": "Gabriella Conti",
               "profile_path": null,
               "id": 146794,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45829251416c91034d21",
               "name": "Alberto Lattuada",
               "profile_path": "/dR6AK20kw2VSRkOrLOnGuYzp5el.jpg",
               "id": 146793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "538f68bb0e0a262989000523",
               "name": "Rafael Azcona",
               "profile_path": "/gYOUk2TKJxe48oaoToiLiN24x9V.jpg",
               "id": 37590,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "538f68d10e0a2629820004c0",
               "name": "Bruno Caruso",
               "profile_path": null,
               "id": 1327665,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "538f68e20e0a262989000526",
               "name": "Marco Ferreri",
               "profile_path": "/ne613TRedYwJf44C6gopz1pKD8P.jpg",
               "id": 34264,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "538f68f70e0a26298c000510",
               "name": "Agenore Incrocci",
               "profile_path": "/radxkfrIVLjPDzCef9aER1aWkc4.jpg",
               "id": 5811,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "538f690a0e0a26297c00050e",
               "name": "Furio Scarpelli",
               "profile_path": null,
               "id": 5812,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "538f691f0e0a2629760004db",
               "name": "Tonino Cervi",
               "profile_path": null,
               "id": 233343,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "538f692e0e0a26297f000512",
               "name": "Dino De Laurentiis",
               "profile_path": "/l5skcaSr7QLDMOpAahznDjUW9Ec.jpg",
               "id": 5398,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "538f693f0e0a262986000588",
               "name": "Piero Piccioni",
               "profile_path": null,
               "id": 25321,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "538f69550e0a26298900053a",
               "name": "Armando Nannuzzi",
               "profile_path": null,
               "id": 24665,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "538f69670e0a26298c000523",
               "name": "Nino Baragli",
               "profile_path": null,
               "id": 4670,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.284222,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 34866,
      "vote_count": 7,
      "budget": 0,
      "overview": "When a good-natured factory supervisor living in Milan with his Northern wife returns to his native Sicily, a decades' old oath forces him to fulfill a nightmarish obligation.",
      "similar": [
         511,
         16,
         252,
         148,
         16367,
         6283,
         11444,
         4553,
         424,
         3082,
         5559,
         118,
         13698,
         274479,
         101299,
         36801,
         9828,
         239877,
         427,
         26638
      ],
      "original_title": "Mafioso",
      "runtime": 105,
      "poster_path": "/8tP6xkip7r0bCfwRF33PZsLL1EY.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dino de Laurentiis Cinematografica",
            "id": 1216,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Compagnia Cinematografica Antonio Cervi",
            "id": 41929,
            "origin_country": ""
         }
      ],
      "release_date": "1962-10-24",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alberto Lattuada"],
      "runtime": 105,
      "synopsis": "Antonio Badalamenti (Alberto Sordi) is a Sicilian from Calamo living in Milan Italy working as a foreman in an auto plant and has almost completely forgotten his roots but decides to take his northern Italian blonde wife and two blonde children back home to meet his family. Before he leaves work for the trip he is asked by his boss to pass along a gift to Don Vincenzo (Ugo Attanasio) the local mob boss in Calamo. Alberto's plain family is a shock to Alberto's wife Marta (Norma Bengell) whose blonde hair and refined features make her appear exotic in their midst. Alberto attempts to intercede in a land purchase for his father but is stonewalled until Don Vincenzo arranges the deal. Alberto is asked by Don Vincenzo to carry out a mysterious task which Alberto agrees to and he is whisked away surreptitiously in the middle of the night to meet a group of strangers and carry out a serious deed.",
      "writers": [
         "Rafael Azcona",
         "Bruno Caruso"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0056210/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMzQ1MTQxM15BMl5BanBnXkFtZTcwNzcxMzU1MQ@@._V1_.jpg",
      "actors": ["Stars: Alberto Sordi, Norma Bengell, Gabriella Conti | See full cast and crew »"],
      "reviews": [
         "Italian cultural icon and cinematic great Alberto Sordi (1920-2003) was in peak form when he starred as Antonio Badalamenti, a Sicilian who's become a successful FIAT executive and efficiency expert in Milan and goes on a two-week vacation to his hometown of Catanao in Sicily with blonde northern wife and two little blonde daughters. Laughs and thrills happen when they're welcomed back into Antonio's family \u0096 and the good graces of Mafia boss Don Vincenzo. It turns out Antonio not only owes the Don a favor for getting him the job up north, but is regarded by the local Cosa Nostra as a piciotto d'onore, a kid who distinguished himself in the ranks (maybe you could loosely translate the phrase \"good old boy\") and he also happens to be the best marksman the town has ever known. What starts out as a broad comedy and a warm social satire on the Italian south turns more serious and intense as the hero fits right in and his initially standoffish wife starts liking the family and bonding with one female member whose beauty she's able to bring out. Fine writing, direction, and use of locations add up to a seamless film. You're never bored for a minute and most of the time you're hugely entertained, so it makes sense that Mafioso is going to have a revival release in the United States. It's unseen here, not on DVD and would be worth seeing not only for the fun it provides but for the display of Alberto Sordi's range and fluency as an actor. Sordi starred in Fellini's early pair, The White Sheik and I Vitelloni. Andrew Sarris has said Lattuada is \"a grossly under-appreciated directorial talent.\" Il Mafioso shows the writing skills of Marco Ferreri and Rafael Azcona, working with the team known as Age & Scarpelli (Agenore Incrocci and Furio Scarpelli). Their screenplay may be tongue-in-cheek, but it nonetheless provides insight into the Mafia, and the film's picture of Sicilian town life (in wonderfully rich grainy black and white, high style for the time) is vivid and authentic-looking and -feeling. Music by Piero Piccioni, another mainstay of Italian cinema (Il bel Antonio, Salvatore Giuliano, Una vita violenta). Produced by Dino De Laurentis with Antonio Cervi; this can also be seen as a product that reflects the energy and spirit of Italy's postwar \"economic miracle\" period when so much was exciting culturally in the country \u0096 cinema, literature, design. Shown in a handsome new print as part of the 2006 New York Film Festival. I would give this a 9 out of ten but the overall plot somehow seems too incongruous.",
         "Albert Sordi is virtually unknown here in the United States. He's been called the Italian Peter Sellars but I think that should be reversed, Sellers was the British Sordi. Just one look at his performance in this film should cement that fact that Sordi was by far a better dramatic actor then anything I've seen Sellars do. I had the pleasure of seeing this film twice and it really improves the second time. The loud behavior is a little off-putting the first time but the second viewing revealed all the incredible subtleties in the film and the performances. The direction is extremely good. Director Lattuada is unknown here despite his extensive resume. I could see a definite influence on Sergio Leone in the camera placement and attention to detail. And the music is exceptional as well. The switch to serious drama is what makes this a great film. A lesser production would have made the mafia into clowns. If the film comes into town make a point to see it. It's better then most of the stuff being made today.",
         "(Contains spoilers!) \"Mafioso\" may be one of the finest Italian movies of the 1960s, ultimately to rank up there, in my opinion, with treasures such as Antonioni's \"L'Avventura,\" Fellini's \"La Dolce Vita\" and \"8 1/2,\" Visconti's \"The Leopard,\" Germi's \"Seduced and Abandoned,\" Pasolini's \"Accattone\" and \"Mamma Roma,\" Olmi's \"Il Posto\" and \"I Fidanzati,\" Risi's \"Il Sorpasso\", Bolognini's \"Senilità\" and \"La Viaccia,\" Bellocchio's \"Fists in the Pocket,\" Bertolucci's \"Before the Revolution,\" Rosi's \"Salvatore Giuliano.\" The name of director Alberto Lattuda is not as well known, but he has made some remarkable films, among which are \"Italiani Brava Gente\" and \"Mill on the Po.\" In \"Mafioso,\" Alberto Sordi gives one of his finest performances as a loving family man, Antonio Badalamenti, born and raised in Sicily, now living in Milan with a wife and two little daughters. He is a foreman in a factory there and honest, decent, and fair to a fault. He takes his wife and children to his native Calenzano in Sicily to meet the family they have never seen and with great pride shows them the wonders of his this region, the friendly people, the good bountiful food, the ancient traditions. Then a darker reality intervenes and turns the human comedy into a stark moral dilemma with tragic implications. It is in the form of Don Vincenzo, the local don, who may have been instrumental in obtaining the cushy Milan job for Antonio. Antonio had been asked by his Milan superior to consign a packet to him. Antonio is the messenger boy. Now it is payback time. Don Vincenzo wants a favor from Antonio, one that involves a secret mission to New York and New Jersey to act as a hit-man for the mob for one small job. It is to murder a troublesome rival gang member. Antonio can refuse. No overt threats are made. He is, after all, loved and admired by Don Vincenzo and the other friends and family of the village. But the implications should he refuse are dark and sinister. His own family and the lives of his children might be at stake. In this kind of moral dilemma, how far will a good man go to save and protect his family? The crate that will secretly fly him to America for the short mission is a symbol of the moral enclosure and claustrophobic fear that now threatens him. His wife all the while thinks he is off on a local hunting trip, and indeed, he returns with some killed rabbits. The organization has planned everything perfectly. But Antonio, now safe, now happy for the safety of his family, will live as an altered man, harboring a horrible secret he can never share with those he loves or with anyone. Back at the Milan factory he returns a pen borrowed from a worker and inadvertently not returned. He's that honest. This is the theme of the film and it is given vivid life in the details, for it is a movie replete with beautiful details. For example, Antonio's wife is a liberated woman who smokes in a society that still forbids it among women. She appears to be radical and aloof, but she is just uneasy in what is for her an alien culture. And yet she wins the hearts of her relatives through some simple gestures of good will, such as in helping a woman with a bit of hair removal to make her look prettier. There is a nice beach scene where the male locals ogle the women in a kind of pent-up libido. And I love those Sicilian male caps which everyone wears and which Antonio wears again too, symbolizing his becoming a Sicilian again. We view a society that to a great extent values conformity and mistrusts all outsiders, where \"honor\" surpasses every consideration (as in Germi's \"Seduced and Abandoned\") and where one cannot make choices based merely on intrinsic merit or on what seems to be the right thing to do. Alberto Sordi, arguably one of Italy's two or three greatest actors of all time, gives a performance that is mesmerizing and on key at all times. It is nothing short of brilliant. His is a bizarre yet believable journey through comedy and joy that comes in touch with genuine fear and terror. It is a shame that this film has not been commercially available or widely seen in the United States since it opened in 1964 (except at a few Sordi and Commedia'all'Italiana retrospectives) and has not been widely available on video or DVD outside of Italy. That failing seems about to be remedied. After a New York Film Festival retrospective showing, it will be re-released commercially and later make its way to DVD for American film enthusiasts to see once again or for the first time. They will have a great deal to look forward to.",
         "How wonderful it is to start the year and to know that you have possibly already found what is going to be your favorite movie of the year: MAFIOSO is that movie! I had never seen the film and never seen much of director's LAttuada's work either. I am Italian yet in Italy LAttuada is not really considered as one of the great directors...well it is about time this changed. We have to thank the folks at Rialto Pictures (who id re-releasing the film in the US) for rediscovering this great talent. I wish they started rediscovering him also in Italy...well, too often a country doesn't appreciate its talents! Anyway... LAttuada directs with a great sense of storytelling, every shot has its reason to be and is there to bring the story forward. His capacity of being in control and keeping all the aspects of the film together is exemplary: The cinematography is incredible, manages at the same time to create a mood and to be absolutely concentrated in serving the script. The way the film uses its musical score is super modern (I would like to mention the genius score by Piero Piccioni) The editing is exceptional, never a flaw, never a scene that lasts too log or too little. The overall feeling at the end is that of a perfectly cohesive film. And one that makes you think too...and think a lot! I am not a big mafia movie fan, but this one is different from any other I have ever seen, has a way of turning comedy into tragedy and tragedy into comedy that I have not seen too often on the screen. Alberto Sordi is one of the best actors Italy has ever had: please go and discover his talent and his genius. I say MAfioso is well worth your time, if you don't go and see it it is your big loss!",
         "I've never seen black and white film look so rich, sensuous and stunningly attractive; Cinematographer Armando Nannuzzi hit the nail on the head, creating a very rich and vibrant looking film. At times my mind naturally filled in the colors due to the crisp clarity of all the images, both of natural, rural scenes, and modern, city/industrial settings. Art director Carlo Egidi masterfully blends the surrounding background of everyday life with his set designs and costumes so that it is impossible to separate the two; truly a mirrored recreation of the day in the life of a modern Sicilian during mid-60's. Each scene is so thought out, and crafted so well that at times their is an almost alien effect, due to the deep endearing political and social dynamics which has become lost in our culture and films today in the 21st century. This effect at times appears exaggerated due to its robust social nature, yet does the job in creating a warm, stunning and beautiful feel to this film.",
         "A factory efficiency expert decides to take his family on a nostalgic vacation to the small town in Sicily where he grew up. Big mistake. He quickly becomes embroiled with the local Mafia, who see him as the perfect candidate to take care of a little job for them in America. Long before THE GODFATHER or THE SOPRANOS, Alberto Lattuada made this tragicomedy about Mob life. Between this and SEDUCED AND ABANDONED, one gets the impression that Sicily in the early sixties was an outer circle in Dante's Inferno. Shot in glorious black and white on location. A forgotten gem, recently restored. Note to foodies: there are several terrific meals in this movie. You may not live long in the Mafia, but you'll dine well.",
         "Contains Spoiler I just saw this movie which was certainly as wonderful as most of the other reviewers are saying. But one thing several of the other reviewers seemed to miss (to me, at least) was that the entire culture of his hometown was invested in his doing his little errand for the Don. The societal structure is based on doing \"favors\" for each other. The Don does a favor for his parents, his parents in turn, turn on a dime in their treatment of their Northern Italian daughter-in-law in order to get her to be willing to stay for a few extra days. His father presumably has some idea of the kind of errand he's actually going to be going on. Everything operates from a complex web of familial and social obligations, guilt and fear and he's completely trapped. Not just his wife and children but his parents and sister could all be forfeit if he doesn't do what they want him to do. He only has one skill they care about; his marksmanship. His humanity, his pride, his love for his family; none of that means anything to them. This is a scathing indictment of what brutality, not just Mafia brutality, can do to the human spirit and the acting is wonderful.",
         "Mafioso was made in 1962 and reflects a \"pre-color\" film aesthetic that includes both vivid dialog and precise black-and-white renditions of light and shade. One result of the superb craftsmanship in Mafioso is to pull the viewer, consciously or unconsciously, into the lives of characters. The strongest pull is from the Alberto Sordi character, Antonio Badalamenti, a Sicilian who migrated to Northern Italy as a young man and made good, with a job as factory foreman and a blond wife and daughters. On a vacation, he takes the family, for the first time, to Sicily, giving both Northern and Southern relatives a chance to decide what to make of one another. Mafioso's director, Alberto Lattuada, handles all of this is with a naturalness that immediately makes us accept and believe in his characters. It's a wonderful achievement. That it was possible with 1962 black-and-white technology is cause not only to appreciate Lattuada and his team's accomplishment but to reconsider assumptions on how characters in movies can be brought to life. Approach to film-making may, in the end, matter more than technology. For example, the material poverty of the Sicilian settings is calmly obvious in Mafioso in a way that is not evident in the far grander movies of the well-known Italian-American auteurs. Once in Sicily, things start to happen. Both families prove adaptable and find ways to get along but, for Antonio, there are unexpected implications. Seems he owes the local don (played by Ugo Attanasio in another wonderful, low-keyed performance) a favor. Antonio pretends to his wife and daughters that he's on a hunting trip but is packed into a shipping crate so that he can be sent to America, kill a rival gangster, and be shipped back to Sicily. Everything works. Antonio's upset about killing the stranger but is quite willing to keep the secret (and his acceptance by both Southern and Northern cultures) for the rest of his well-ordered life.",
         "I just had the opportunity to see this film in a newly restored print of the Italian original. The story concerns a manager of an auto plant (played to perfection by Italian screen idol,Alberto Sordi) in Milan who takes his family to Sicily to meet his family & his old friends, when he finds himself involved in the local Mafia Don & his ner do well cronies. The screenplay was written by it's director (Alberto Lattuada), Raphel Alzcona & Marco Ferreri (some years before he raised eyebrows with his films 'The Grand Bufet' & 'The Last Woman'). Although the films use of black & white was quite striking, I kind of wished it had been shot in Technicolor (for the panoramic shots of Sicily & it's beautiful coastline). An overlooked gem that's well worth seeking out, if it's being screened in a proper cinema,but it won't lose much on DVD either.",
         "I really liked this Italian film about the mafia because although it lacks the flash and stereotypes of this sort of film, it really manages to produce an excellent portrait of real people caught up in an ugly lifestyle. While not filmed by such Neo-realists as DeSica or Rosselini, this film sure looks a lot like this style of film that was so popular in the 40s and 50s. That's because so many of the actors appear to be real people--real people who are neither handsome nor glamorous. Heck, even one of the women in the film has a rather significant mustache! The story begins in Milan with a well-respected engineer for an Italian car manufacturer at work just before leaving for vacation in Sicily. His boss asks Antonio to give a present to Don Vincenzo who also happens to live in the same town where he's headed. Apparently, Antonio grew up there and is going back for the first time in many years to introduce his wife and kids to his extended family. However, once in Sicily, it's rather apparent that Don Vincenzo is the local Mafia boss and the town appears to be under his control. Despite Antonio seeming to be a good father and husband, as well as a decent all-around guy, eventually the Don wants him to \"do a little favor\"--and it shows how seemingly good people become pawns of organized crime. The film excels with its realism. This isn't just because of all the non-professional actors, but because the film manages to tell the story in a way that makes you connect with Antonio and understand how such a good person could do evil. Well acted, directed and written--this is a highly underrated little Italian gem."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Compagnia Cinematografica Antonio Cervi",
         "Dino de Laurentiis Cinematografica"
      ],
      "summaries": [
         "Antonio is a jolly and precise guy working for an auto factory in northern Italy. He decides to take his wife and two daughters on vacation to Sicily, so that they can finally see his hometown and meet his family. He's excited to show them around and dispel many of their negative stereotypes about Sicilians. He even dispels stereotypes about the mafia, saying that being a mafioso as a teen amounted to just being a messenger boy. But as Antonio reconnects with his past in Sicily, he finds out that there are more sides to being a Sicilian than he remembers.",
         "Antonio Badalamenti, a good-natured supervisor at the Fiat plant in Milan, is a native Sicilian who has lived in the North for a decade with his blonde wife and two beautiful daughters. Before leaving on a two week vacation back to his ancestral hometown, one of the plant managers tasks him to personally convey a mysterious gift to Don Vincenzo, the local godfather. Even though Nino's wife has misgivings about leaving the comforts of her comparatively luxurious life, she is unprepared for what she encounters. Marta undergoes culture shock when confronted by the poverty and comparatively crude customs of the provincial Sicilians, especially the Baladamenti family, who in turn view the refined blonde Northerner as a snobbish interloper. Bringing his family with him to pay respects to Don Vincenzo, the always obedient and affable Nino discovers the gift to be a beautifully jeweled heart pendant enigmatically inscribed with the names of of 9 deceased \"friends\" of the Mafioso. After the godfather's nephew Don Liborio reminds Nino of an oath of loyalty he took as an 18 year-old decades before, he becomes further indebted when the Don settles a controversial land transaction in favor of Nino's father. Feeling he has no choice, Nino agrees to honor his fealty by fulfilling a favor to the Don, a nightmarish favor which shakes Nino's safe, complacent world to its very core.",
         "When a good-natured factory supervisor living in Milan with his Northern wife returns to his native Sicily, a decades' old oath forces him to fulfill a nightmarish obligation."
      ],
      "budget": 0
   },
   "movielensId": 50949,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1962-10-24",
      "dvdReleaseDate": "2008-03-18",
      "directors": ["Alberto Lattuada"],
      "runtime": 105,
      "movieId": 50949,
      "title": "Mafioso",
      "mpaa": "",
      "actors": [
         "Alberto Sordi",
         "Norma Bengell",
         "Carmelo Oliviero",
         "Gabriella Conti"
      ],
      "imdbMovieId": "0056210",
      "originalTitle": "Mafioso",
      "genres": [
         "Crime",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When a good-natured factory supervisor living in Milan with his Northern wife returns to his native Sicily, a decades' old oath forces him to fulfill a nightmarish obligation.",
      "tmdbMovieId": 34866,
      "avgRating": 3.34,
      "releaseYear": "1962",
      "numRatings": 25,
      "posterPath": "/rDP5juBODyfpz7MXbqQ9kfiMHpv.jpg"
   }
}