{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0449121",
      "video": false,
      "title": "loudQUIETloud: A Film About the Pixies",
      "recommendations": [
         16765,
         30180
      ],
      "backdrop_path": "/5wAABwpEowZ45pdI6KMVPVr4EiU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4442c3a368484e018e7b",
               "name": "Frank Black",
               "profile_path": "/iIBL9KSwDW1RiphiUFi0aYK0TIm.jpg",
               "id": 84695,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4442c3a368484e018e7f",
               "name": "Kim Deal",
               "profile_path": "/cgIEF99Bzh2WAN3ojtBt6uVdzho.jpg",
               "id": 88828,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4442c3a368484e018e83",
               "name": "David Lovering",
               "profile_path": "/94uSQzUQQ4oawCxZtVSw8FVPL3B.jpg",
               "id": 88830,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4442c3a368484e018e87",
               "name": "Joey Santiago",
               "profile_path": "/rUGydbE5R2PNZbZxbQJrtARkrHl.jpg",
               "id": 88831,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4442c3a368484e018e6b",
               "name": "Steven Cantor",
               "profile_path": null,
               "id": 62926,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4442c3a368484e018e77",
               "name": "Matthew Galkin",
               "profile_path": "/myf5KJBZw6ZMCEAmyTKWDZ2QWZN.jpg",
               "id": 88825,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.441702,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22485,
      "vote_count": 11,
      "budget": 0,
      "overview": "When college rock darlings the Pixies broke up in 1992, their fans were shocked and dismayed. When they reunited in 2004, those same fans and legions of new listeners were ecstatic and filled with high hopes. loudQUIETloud follows the rehearsals and live shows of the band as they struggle through the reunion tour \"Sell Out\"",
      "similar": [
         3134,
         298312,
         8810,
         281,
         948,
         11564,
         133805,
         2142,
         12162,
         1359,
         4771,
         431,
         8923,
         10285,
         23483,
         101,
         205,
         141,
         562,
         261023
      ],
      "original_title": "loudQUIETloud: A Film About the Pixies",
      "runtime": 85,
      "poster_path": "/bR2quNNJgjrfpSb92EE8zqoJNqL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cactus Three",
            "id": 4099,
            "origin_country": ""
         },
         {
            "logo_path": "/rdejHBPjtBviLxJbcc2oSCBb1E0.png",
            "name": "Stick Figure Productions",
            "id": 4100,
            "origin_country": ""
         }
      ],
      "release_date": "2006-04-21",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://loudquietloud.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Steven Cantor",
         "Matthew Galkin"
      ],
      "runtime": 85,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0449121/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMDQ3ODc5Ml5BMl5BanBnXkFtZTcwMzAwMTUzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Frank Black, Kim Deal, David Lovering | See full cast and crew »"],
      "reviews": [
         "I had the pleasure of attending the NYC premier of loudQUIETloud: a Film about the Pixies, at the Tribeca Film Festival on Tuesday, May 2nd, 2006. The film documents the successful 2004 reunion of the Pixies and in the process gives the viewer a rare glimpse at the people behind the music. I am nearly 40 years old, and have been a Pixies fan for nearly half of that time. The thing that always struck me funny about being a Pixies fan is this: first, Pixies fans have an almost insane love of their music, and second, most fans have no idea of what the people in the band are like. This film does a great job in addressing both of these points. You get to watch as the band takes their first steps in the rehearsal studio, Kim Deal resorts to listening to her parts on an iPod to get the chord changes right, through their first live show in Minneapolis where the crowd goes absolutely wild. \"Did you see that? Those people were freaking out! \", said Kim during a backstage break. The film goes on to show the band members in their day-to-day lives, Joey and Charles managing their careers and young families, Kim dealing with sobriety with the help of her twin sister Kellie, and Dave coping with his father's illness and death. All in all, they seem like four ordinary people. The thing that makes them extraordinary is when they take the stage together; something happens that I can best describe as magic. The concert footage in the film is beautifully shot, and the band sounds better than ever. The Pixies are older, wiser and a little rounder, but they still know how to blow the house away. The question of \"are you going to record a new album\" was posed to the band during the film and the answers were interesting. Charles said that he was still in the song writing business, and it sounded like he was open to a new album. He then went on to say that it would probably be best if they started over from scratch, maybe change their name to the \"Vomit Squad\" and start playing small clubs again, that would be the most honest way to do it. You know what? That sounds good to me. \"I'll take four tickets for Vomit Squad's Upchuck world tour 2007, please.\"",
         "Of the several ROCK-umetaries playing at this year's ROCKDOCS festival this one is undoubtedly the best. Due in part to the power of the band being profiled (\"Pixies\") and the expansive inside look presented by the filmmakers that details the individual member's lives inside and outside the band. It was said about the Beatles that each musician was excellent in his own right but when the four of them gathered together something 'magic' happened. This also applies to the Pixies and their relationships to each other, as they are ironically the four most uncommunicative people in the world when sitting backstage, but put them in front of an audience and you get an eruption of music and lyrical poetry that stays with you long after the concert has ended. Formed in 1986 by Charles Thompson (aka 'Black Francis'), the band achieved a modicum of success until in 1992 Thompson dissolved the band due to friction with co-lead singer Kim Deal (who also fronts 'The Breeders' w/ her sister). In the intervening years the band's music inspired dozens of other bands and became a cult phenomenon. Now some 12 years leader, Thompson has decided to put the Pixies back together and see if what they once had can be duplicated. Of course, the long years between have brought about a number of changes among the members, most notably the rehabilitation of Kim Deal's alcoholic problems. Although she still drinks alcohol-'free' beers by the dozen her recollection of the Pixies concert years are a haze and now she's forced to listen to their albums to recall the parts she played. She enlists her sister Kelly to join her for the tour to segregate herself from the band and any partying on the road. Kelly also proves useful as she likes to 'interview' other band members with extremely pointed questions offering quite a bit of comic relief. In addition to Kim, each member of the band has followed a strange road since the Pixies break-up with only Deal and Thompson able sustain solo careers in the interim. The documentary successfully brings all of their varied paths together within the framework of rehearsals, warm-up tours, and the inevitable European and USA venues with fan adulation escalating from one date to the next culminating at the Hammerstein Ballroom in NYC. Most poignant of the non-band stories is the movie is that of a teenage musician's adulation of Kim Deal and her gifting of the paperback book \"Brave\" to her idol. The novelette turned her on to the Pixies after they'd disappeared from the scene, but the music inspired her to form her own band. The end credits features the Pixies-wannabe's jamming in the basement and continuing the 'Pixies' legacy. This coda completes the circle started at the beginning of the film with Kurt Cobain's quote on how the Pixies were one of the bands that inspired Nirvana. In fact, Cobain said that Nirvana was trying to BE the Pixies. As you can see, if you're not a fan of this band now, I guarantee by the end of this film you'll be making a beeline to the nearest music store (as I did). So if you only make it to one movie at this year's festival, then let this be the one!",
         "I saw this film at the SXSW Film Fest in Austin - waited in line two hours for the pleasure - and let me tell you it was worth every minute. The film is beautiful and profound and really captures the essence of the band and life on the road in general. The Pixies are one of the all-time greats of my youth, so it's a little depressing to see them all grown up and coping with their very adult and normal lives, but on stage they rock like never before (the live footage is remarkably well shot and recorded). Off stage they don't talk much to each other, but somehow the film transcends that and really captures the essence of each of the band members individually as well as the on stage chemistry that makes them tick. Pixies fan or not, Don't miss this one.",
         "The film kicks off with a quote from Nirvana's Kurt Cobain, about his famous song, Smells Like Teen Spirit: \"I was basically trying to rip off the Pixies.\" As a tribute documentary, loudQUIETloud goes on to explore the Pixies strange career and provide some clues to why they have been so influential. The Pixies established themselves musically with deep contrasts, not just in volume (as the title suggests) but by combining many strange elements, melodic and abrasive, and cryptic lyrics - they are almost like a David Lynch rock experience (one of their songs is a cover from a song in Lynch's early Eraserhead). What made them extraordinary is that they disbanded just as they approached critical acclaim (within six years) and didn't reap the benefits of their popularity until they re-formed nearly twelve years later - at which point this movie begins. Tickets for their 2004 reunion tour sold out in four minutes, but the band members are no longer young. As the film develops we see some have families with small children, but they all have outside interests, musical or otherwise, and 'being the Pixies' is hardly something they identify with beyond a sense of responsibility to make sure the live performances go well. The detachment is so great that a struggling interviewer, asking an innocuous question about whether they will make another album, is nonplussed that the band really haven't considered the question one way or the other. Lead singer Frank Black ('Black Francis') is a bulky, almost intimidating figure with a shaven head, so it's something of a revelation to see him doing positive affirmations before bed, telling himself, \"I am a nice person, people like me . . .\" Bassist Kim Deal looks with surprise at the blisters on her fingers after the first concert - Frank reassures her they'll get better in about a week. Both of them continue working on their own material while on tour, Kim for the Breeders and Frank on his solo work. The band seem to accept that it is not in their natures to talk to each other much, even when they are getting on fine, but they seem more mature than the days of early acrimony where one or the other would unilaterally make public announcements of the band's imminent break-up. The sound and camera-work throughout is first rate, so if you like the Pixies even a little bit, this is a rare opportunity to experience them at their best. For those who have never heard of them, you might recall the song, 'Where Is My Mind?' as the exit music to the film Fight Club, or sections from their records 'Gigantic' and 'Hang Wire in the United States of Leland. For fans, the song listing taken from the credits includes: Where is My Mind, Hey, Here Comes Your Man, U-Mass, Caribou, Gouge Away, Nimrod's Son, In Heaven, Wave of Mutilation, Something Against You, Bone Machine, Cactus, Vamos, Monkey Gone to Heaven and also the Breeders song Iris.",
         "I've been a Pixies music fan for years, but I never really knew much about the individual members. All I knew is that they inexplicably dropped off the face of the earth one day, and reappeared recently as middled aged people. This documentary makes it quite clear what happened. The individual band members are fragile, sensitive, flawed people, who made unbelievably unique and magical music when they were together. Unfortunately their fragility made it impossible for them to deal with their success. This film could have very easily taken the TV-style doc route with music industry producer and \"expert\" interviews, instead it just follows the band members around during their 2004 reunion tour. By showing Charles, Kim, Joe and Dave engaging in mundane everyday activities, we come to know them better than from any lecture delivered by a music \"expert\". Despite the fact that they never achieved any great commercial success during their heyday, the string of recent sold out tour dates proves that their music had a profound effect on millions of people worldwide. The Pixies now have a second chance to achieve the financial success that eluded them the first time around. Very few people in this life get a second chance at anything. I hope that they can achieve their financial goals, as well as finding the inner peace that they lacked in their younger years. I highly recommend this film to Pixie fans, new and old alike.",
         "Some people complain about this, expecting an episode of \"Behing the Music\" but none of that is forthcoming. Really this is just a live concert, but it is interesting to see the in between footage because almost nothing happens. For any other documentary this can be a hindrance but for these guys it is somewhat fitting, it is like watching a Jim Jarmusch movie or something, with those big wide open spaces of non event. It really makes you appreciate the truly great musical events on stage. They are all fantastic musicians, even if Deal is a little lacking on the technique on the bass, she has a beautiful voice and great bass lines. There's no real revelations, other than the fact that it proves my theory that band reunions are mostly about money because of all the illegal downloading (the Pixies drummer confirms this). In the case of the Pixies, this seems to be a good thing because they obviously are as good as they ever were and other than Kim Deal, don't have anything really going for them individually. I would have liked to have learned more about the band but it's obvious that these guys aren't talking much about their past, they are seem way too cool for this (except maybe the drummer, who is great but kind of nerdy). The title loudQUIETloud has double meaning, it is at one time about the movie itself, the loud on stage performances and quiet backstage areas. It is also about the grunge movement that these guys help develop, personified by Nirvana, play a quiet verse, hit a distortion pedal and then scream a chorus, then turn off the pedal for the verse (which, ironically, none of their songs do). If you think about it this way, the movie is actually quiet a profound experiment and needs to be appreciated as a gestalt and not picked apart for not revealing \"secrets\" of the band. Maybe there are no secrets.",
         "If you didn't know about the pixies, this isn't your chance to find out more and that's a good thing. Why? Well if you didn't discover their greatness on your own, which is the only way you could do it back in the day really, this film will not convince you of that, only being a fan of their music will. This review is not directed at anyone in particular's review on this film but, you're COMPLETELY missing the point if you watch this film with your arms folded, in order to be proved that this was and still is a great band in Alternative music's history. You want to know more about them? Well, that's what the internet is for and you can research any information you want. A completely necessary viewing by any Pixies fan. Lots of live footage. Candid remarks and statements by the band and in particular the band member's own views on it's later meltdown. And I love the end when they show some home movies of the band in slow motion, it looks like when they were on tour for Doolittle in 1989. The DVD contains footage not seen on TV like Kim Deal and Frank Black visiting Sigur Ros in their studio in Iceland.",
         "The Pixies are a real phenomenon in the history of rock. While they were young in the 80s and beginning of the 90s they did not enjoy too much success, and it can be said that their legend and influence started to build only at the moment when they split. Twelve years later, in 2004 they decided to get back together after a series of individual failures that seemed to bring all of them on the brink of personal and financial bankruptcy. The film tells very little about their first period of activity and focuses on Act 2 of their career. It is not that it tells too much we do not know from the music of the group. The Pixies are great musicians, decent human being and poor communicators. We do not learn from the documentary too much about the sources of their music, we do not understand why despite the success of their second career and despite of them writing music for their individual careers there was and there is no new album since they reunited. We learn something about their personal lives, but frankly speaking what we hear is not interesting or revealing. Music remains the best part of this film.",
         "This is like one of those longitudinal sociology studies. See Frank at 20 something - see Kim at 20 something - now see Frank at 41 etcetera. It seemed like during the reunion tour and all the way through the film that no band member had any real insights about what was going on. Perhaps some things are better felt than over analyzed. It was clear that lots of audiences really liked the reunion tour and that there is some \"magic pixie dust\" around the band. Even if it still seems a bit mysterious to outsiders. Music appears to be one of the few areas where you can relaunch a (product) band if they were ahead of their time / out of sync as Pixies seemed to be first time round. I enjoyed being able to check the phenomenon that was Pixies and see how things have changed / what might be different. I did see someone asking why there were no obvious outside commentators (pro & con) for the band. In my view that is what wikipedia and the web are good for and some of that can go on a DVD as a side bar. I think this film was good because it allowed us to get a glimpse into the music and the band without talking the subject to death.",
         "The film loudQUIETloud fails to be an effective documentary for several reasons. The first failure is that the filmmaker does nothing to justify the making of this documentary\u0097the film is so devoid of background information or historical context that, for someone without extensive prior knowledge of the Pixies, there is nothing to suggest that the Pixies are important or interesting enough to merit documenting their comeback. The filmmaker makes the audacious claim that the Pixies are among the most influential bands of all-time, and maybe they are\u0097but the film does nothing to prove this or show how or why they are influential. The opening quote from Nirvana's Kurt Cobain is the only time in the film where we are given a sense of the Pixies' impact on modern pop music. Where are the interviews with music historians, music critics, or other musicians that would validate and define the Pixies' influence? Where are the excerpts from Rolling Stone articles about the Pixies\u0097during their heyday, their breakup, their absence, and their reunion? Surely if the Pixies were indeed 'one of the most influential bands of all-time,' then these secondary sources would be overflowing with information that the filmmaker could have used to place in the Pixies in the context of modern music for viewers who aren't already familiar. Yet there is not ONE secondary source interview, not one article quoted\u0097the film consists entirely of interviews with band members, live concert footage, and interviews with the band's family and fans. In this way, loudQUIETloud feels like little more than a puff piece, a made-for-the-fans DVD of the tour released by the band itself. If you are looking for live concert footage of the Pixies, loudQUIETloud does just fine. If you are interested in a thought-provoking, intelligent documentary, loudQUIETloud falls flat on its face. I knew almost nothing about the Pixies before watching loudQUIETloud, and now having seen it, I still feel as though I know nothing about them. Why did the Pixies breakup? The documentary cites 'creative differences and tension,' a generic answer that could probably be used for hundreds of bands. Why did the Pixies get back together? The documentary cites money and 'it just feeling right' as the reasons for the reunion\u0097again, these reasons are painfully dull and provide none of the insight that is the purpose of a good documentary. What is the title's significance? Other than my own inference that loudQUIETloud refers to the band's path from popularity to obscurity and back to popularity, I am given no other clues as to what the title is meant to mean. Most importantly, the film fails to answer the question of why the Pixies were significant and influential, and left me angry and frustrated that I had spent 90 minutes on what, from my perspective, might as well have been some random garage band. For the hardcore Pixies fan, loudQUIETloud may be sufferable since it gives viewers ample face-time with the band members themselves. However, for those who don't particularly know or care about the Pixies already, loudQUIETloud is among the most hopelessly ineffective documentaries I have ever seen."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Cactus Three",
         "Stick Figure Productions"
      ],
      "summaries": ["An intimate portrait of the band members and their trying, tense and ultimately triumphant return as one of rock music's greatest bands."],
      "budget": 0
   },
   "movielensId": 51127,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-04-21",
      "dvdReleaseDate": "2007-02-03",
      "directors": [
         "Steven Cantor",
         "Matthew Galkin"
      ],
      "runtime": 85,
      "movieId": 51127,
      "title": "loudQUIETloud: A Film About the Pixies",
      "mpaa": "NR",
      "actors": [
         "Frank Black",
         "Kim Deal",
         "David Lovering",
         "Joey Santiago"
      ],
      "imdbMovieId": "0449121",
      "originalTitle": "loudQUIETloud: A Film About the Pixies",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When college rock darlings the Pixies broke up in 1992, their fans were shocked and dismayed. When they reunited in 2004, those same fans and legions of new listeners were ecstatic and filled with high hopes. loudQUIETloud follows the rehearsals and live shows of the band as they struggle through the reunion tour \"Sell Out\"",
      "tmdbMovieId": 22485,
      "avgRating": 3.75,
      "releaseYear": "2006",
      "numRatings": 114,
      "posterPath": "/bR2quNNJgjrfpSb92EE8zqoJNqL.jpg"
   }
}