{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "u.s. soldier",
            "id": 33564
         }
      ],
      "imdb_id": "tt0055539",
      "video": false,
      "title": "Town Without Pity",
      "recommendations": [
         43013,
         24152,
         42791,
         26186,
         49742,
         36642,
         23724,
         43037,
         39948,
         21779,
         49844,
         42407,
         40387,
         93939,
         44916
      ],
      "backdrop_path": "/qzdufewnHgUX7T1TcEwwVUqkyes.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Major Garrett",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf98d",
               "name": "Kirk Douglas",
               "profile_path": "/vIZgu07gJtS2j460jgBlI1IvkAO.jpg",
               "id": 2090,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Inge Koerner",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf991",
               "name": "Barbara Rütting",
               "profile_path": "/gWfjot9q0pyhb9BksCsPsY819QL.jpg",
               "id": 18506,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Karin Steinhof",
               "gender": 1,
               "credit_id": "52fe492b9251416c750bf995",
               "name": "Christine Kaufmann",
               "profile_path": "/5dOT16uZw2wKekuv1ogvRwS3y5U.jpg",
               "id": 3762,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Karl Steinhof",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf999",
               "name": "Hans Nielsen",
               "profile_path": "/h5SgoGm7xnCDxzYQCB47yZJv4Mn.jpg",
               "id": 28886,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Trude",
               "gender": 1,
               "credit_id": "52fe492b9251416c750bf99d",
               "name": "Ingrid van Bergen",
               "profile_path": "/q09aacmm7s0A5KwfYWkaNddTlNK.jpg",
               "id": 22633,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Corporal Jim Larkin",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9a1",
               "name": "Robert Blake",
               "profile_path": "/fA9Zg9OprSMxjy54KuH1WDiCMvq.jpg",
               "id": 9287,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Corporal Birdwell Scott",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9a5",
               "name": "Richard Jaeckel",
               "profile_path": "/pTTfCxMxjBvxkcemCBwNqEiHXce.jpg",
               "id": 58423,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Sergeant Chuck Snyder",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9a9",
               "name": "Frank Sutton",
               "profile_path": "/kkBtfAnwR4FqJYMSTO7efhWndJC.jpg",
               "id": 98796,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Frau Steinhof",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf9ad",
               "name": "Karin Hardt",
               "profile_path": null,
               "id": 50892,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Frank Borgmann",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9b1",
               "name": "Gerhart Lippert",
               "profile_path": "/xUKPcwEaKcvGcU7JAhMY3ne6Zy9.jpg",
               "id": 46208,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Private Joey Haines",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf9b5",
               "name": "Mal Sondock",
               "profile_path": null,
               "id": 998537,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "General Stafford",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf9b9",
               "name": "Alan Gifford",
               "profile_path": "/rB3wxxeKK7EuflIWIQoB7dbFk99.jpg",
               "id": 93948,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Doctor Urban",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf9bd",
               "name": "Max Haufler",
               "profile_path": "/AmWnhdaunSjIsrIao3doDMMyTm2.jpg",
               "id": 30722,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Frau Kulig",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf9c1",
               "name": "Rose Renée Roth",
               "profile_path": null,
               "id": 51562,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Frau Borgmann",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf9c5",
               "name": "Eleonore von Hoogstraten",
               "profile_path": null,
               "id": 998538,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Bürgermeister",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9c9",
               "name": "Egon von Jordan",
               "profile_path": "/gGpdI8keqhU4dD5x226pZxwSPFd.jpg",
               "id": 6262,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "Herr Schmidt",
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf9cd",
               "name": "Philo Hauser",
               "profile_path": null,
               "id": 998539,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "Colonel Pakenham",
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9dd",
               "name": "E.G. Marshall",
               "profile_path": "/iQnivIob2OiXuVCepECf72xS2tQ.jpg",
               "id": 5249,
               "order": 17
            },
            {
               "cast_id": 30,
               "character": "",
               "gender": 1,
               "credit_id": "5a86279b925141759902eda9",
               "name": "Elisabeth Neumann-Viertel",
               "profile_path": null,
               "id": 1364175,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf971",
               "name": "Eberhard Meichsner",
               "profile_path": null,
               "id": 31337,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf977",
               "name": "George Hurdalek",
               "profile_path": null,
               "id": 37970,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf97d",
               "name": "Jan Lustig",
               "profile_path": null,
               "id": 85349,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf983",
               "name": "Silvia Reinhardt",
               "profile_path": null,
               "id": 998536,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe492b9251416c750bf989",
               "name": "Manfred Gregor",
               "profile_path": null,
               "id": 36982,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9d3",
               "name": "Gottfried Reinhardt",
               "profile_path": null,
               "id": 127522,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe492b9251416c750bf9d9",
               "name": "Gottfried Reinhardt",
               "profile_path": null,
               "id": 127522,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.983851,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "AT",
            "name": "Austria"
         }
      ],
      "id": 93427,
      "vote_count": 4,
      "budget": 0,
      "overview": "Four American soldiers stationed near a German village face death in the rape of a local girl and are defended by outside counsel Major Steve Grant.",
      "similar": [
         74997,
         281957,
         3134,
         1696,
         979,
         281,
         2652,
         395834,
         357096,
         588,
         445954,
         71181,
         133805,
         994,
         11423,
         156022,
         238636,
         9093,
         4771,
         769
      ],
      "original_title": "Town Without Pity",
      "runtime": 105,
      "poster_path": "/jvrZhjIGVIjNy6VWSgpFA87cvXr.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "The Mirisch Corporation",
         "id": 219,
         "origin_country": ""
      }],
      "release_date": "1961-10-10",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The Story of What Four Men Did To a Girl... And What the Town Did To Them!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Gottfried Reinhardt"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Manfred Gregor",
         "George Hurdalek"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055539/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI3NzEzMDI0NF5BMl5BanBnXkFtZTcwOTcyMTM4NA@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Kirk Douglas, Barbara Rütting, Christine Kaufmann | See full cast and crew »"],
      "reviews": [
         "This is a very serious movie. A local teenage girl is raped by four US soldiers on a hot summer day in a little German town. Her father wants the criminals to be killed. The soldiers' lawyer (Kirk Douglas) knows he must devastate the girl's seemingly innocent image to free his clients from the death sentence. It looks like this movie never really was produced to be a huge success at the box offices at all. It treats its story with honesty and no compromises. The acting is excellent. Douglas and Marshall give very impressive performances supported by a flawless German/ American cast. Christine Kaufmann is absolutely convincing as the victim which is raped a second, this time by the legal system. Reinhardt almost tends to a documentary style, something that probably doesn't appeal to all viewers. It's exciting, well written and very depressive. A perfect movie which leaves you speechless in the end.",
         "Town Without Pity, an American-German co-production, involves the crime, trial, and aftermath of four American GIs in occupied Germany raping a teenage girl. Christine Kaufman who shortly after this film became the second Mrs. Tony Curtis, is attacked and raped by four American soldiers. The four, Frank Sutton, Richard Jaeckel, Robert Blake, and Mal Sondock, are in danger of capital punishment as prescribed by the American Code of Military Justice. As another reviewer pointed out this was taking place while Germany was still an occupied country. Allied occupation of Germany didn't officially end until 1955 when our High Commissioner to Germany, James B. Conant, became our first ambassador to the German Federal Republic. After that these four would have taken their chances in a German criminal court. The fact though that they were soldiers also meant that there was no chance for acquittal. What had to be determined was how guilty they were, even to the extent of the ultimate punishment. Kirk Douglas for the defense and E.G. Marshall for the prosecution make a good pair of adversaries. Marshall would very shortly see how the other half lived as after this film was done, he would star in the long running TV series, The Defenders. Kirk Douglas is a tiger in the courtroom as he ruthlessly puts Kaufman's own character on trial. It's his job, it's done down to the present day with victims of rape. But he's also a person with conscience, he knows exactly the character of the four men he's charged with the defense of, the character of each of them individually. Anyway there isn't a player alive who doesn't relish a good courtroom scene and Douglas made the most of his opportunity here. I don't believe Kirk got back in a courtroom until a made for TV remake of Inherit the Wind. Of the German cast and I note that several including Kaufman have had substantial careers in the German cinema, Barbara Rueting as the German reporter who narrates the film and Gerhard Lippert as Kaufman's boyfriend also stand out. Of course no discussion of Town Without Pity is complete without the title song which I remember so well blaring from the jukeboxes of 1961. This jazz/rock and roll song was very typical of what was happening in German and other foreign culture, an overwhelming Americanization of same. Gene Pitney sold a lot of records of Town Without Pity back in the day. If you've never seen the film you'll remember the song after seeing it once. And you'll also remember in terms of attitudes they really are the same. Those little minds will indeed tear you in two. It's what a Town Without Pity does.",
         "This outstanding film shows how a rape victim is brutally revictimized by the ordeal of a rape trial. It is far superior to better known films about rape such as \"The Accused.\" In this film, four American GI's stationed in Germany brutally gang rape a young girl named Karen. The incident is eerily reminiscent of the gang rape by American service men that occurred in Okinawa a year or two ago. Major Steve Garrett is assigned to defend the soldiers and he does an outstanding job of defending some disgusting clients. He gets lots of help from people in town who don't like Karen. He tries desperately to plea bargain the case because he knows that his cross-examination of Karen will be brutal, but Karen's stuffy father won't hear of it. He believes his daughter is a model of chastity and is out for vengeance. Garrett destroys Karen on cross examination and manages to avoid the death penalty for his clients. The story ends tragically as the town casts Karen out as a harlot. Thus the victim in a tragic rape case is victimized once again by the legal system.",
         "Four U.S soldiers at an army base in Germany are charged with a gang rape and the prosecutor is asking for the death penalty as demanded by public outrage and the girl's father, a leading citizen of the town. Although sure of their guilt, the defending lawyer is also sure that they do not deserve the death penalty. He wants to plea bargain, but he'll dig up dirt and tear the girl apart on the witness stand if that's what it takes to save the men. No person or event in the story is as innocent as it seems at first - not the girl, the town, the judicial process, or even the simple brutality of the four men. The movie's weaknesses, unfortunately, are in the actual realization of this excellent story. The screenplay is very uneven, over-developing some of the complexities while short-changing others. The use of a voice-over is a clever way to avoid having to subtitle the German speaking scenes, but as implemented it is a clumsy shortcut to giving us information which should have been written into the action. Most unfortunate is the poor choice of music. It blatantly attempts to force its particular mood on the viewer in total discordance with the more subtle manner in which the story is presented. On the bright side, the acting is good and the main point of the story - the brutal treatment of the girl on the witness stand and by the town - is not diluted by any of these problems, making this a movie well worth watching.",
         "When this film was released in 1961, I remember the ads saying this film was for \"Adults Only\". (The MPAA rating system didn't exist then.) A film about four soldiers stationed in Germany who gang rape a 16 year old girl and the trial that followed was pretty heavy stuff for audiences back then. I recently saw the film on Turner Classic Movies, and it still holds up very well. It is still startling and powerful, even without nudity and foul language, which should show Hollywood it can be done. You can be \"adult\" without being unnecessarily vulgar or obscene. As it stands, I would still give this film an \"R\" rating today. And, of course, there is the memorable title song, sung by Gene Pitney, which accounted for the film's only (surprisingly) Oscar nomination. Even that lost out to the syrupy \"Moon River\" from \"Breakfast at Tiffany's\". My one complaint about Turner's presentation was with the film's aspect ratio. Instead of showing a widescreen version, they showed a full-frame version with the framing \"squeezed\" so that faces were somewhat elongated and cars appeared \"stubby\" and compacted. This became very annoying. Even a pan & scan version would be better than this. Nonetheless, for sheer power, as well as excellent acting by Kirk Douglas, E.G. Marshall, Christine Kaufmann, and a very young Robert Blake, I highly recommend \"Town Without Pity\".",
         "I'm not someone who uses lots of superlatives, but \"Town without Pity\" is a movie, for which I would not mind using some of them (and only positively). I had no idea about this movie, nor I ever knew anything about it; yet I picked it up only because everytime I visited the Exposition Park Branch of the Los angeles Public Library, it was lying there in the shelf, for a long long time. Watching this movie was a very pleasant experience for me. I found this movie very \"humane\" in that it was able to successfully deal with the sensitive issue of rape. It's devoid of high drama, but rather very realistic. It involves the humane face of a ruthless defense lawyer, who knows his job, and yet is ready to spare the victim the second round of rape that occurs in the court-room during cross examination. I recommend it to anyone who wants to watch an excellent, serious movie.",
         "This was all in all a great film, with riveting performances from all the cast. My problem was the weak,ineffective score, which took a great theme song and beat it like a dead horse. The opening scene and credits placed the song well, but the frequent, unrelenting repeat of the theme both instrumental and with Gene Pitney's great vocals throughout the film in quite inappropriate places \"isn't very pretty\" at all. Very distracting to the viewer, and certainly took away some of the film's impact.The rest of the score was passable, but nothing special. I think the intended tone of the film could have been maintained or even intensified if there were no further music in the film after the song ran with the opening credits.",
         "Surprisingly this convincing drama is almost ignored by German TV stations nowadays though it features a very touching and impressive performance by Christine Kaufmann who won a Golden Globe for this one (as the first German actress ever). Kirk Douglas is very strong in the male lead having to deal with the awful job to defend four US soldiers who've gang raped a 16-years-old German beauty. Though Reinhardt's style has dated badly the movie's still worth watching. He definitely has done a good job capturing the heartless atmosphere needed for a story like this. There are some haunting moments.....and the sad realization that also more than 40 years after \"Town Without Pity\" most rape victims still are devastated twice. By the way, I've seen the German version which is half-dubbed, half-original so that you have several characters speaking with two different voices. I'd prefer a complete English or German version respectively the use of subtitles.",
         "\u0085 I have no alternative but to ask that you watch it as soon as possible. This is undoubtedly Kirk Douglas' finest performance, probably because he's playing a character somewhat like himself. But rookie actress Christine Kaufmann completely steals the show in what must have been a very difficult performance. She deserved an Oscar, not just a second-rate Golden Globe. Director Gottfried Reinhard is the son of impresario Max Reinhard, the guy who put Frank Wedekind on the stage. Although you may not have heard of him, Wedekind wrote such famous plays as Lulu and Springtime Awakening (which resembles Town Without Pity in some ways). That line \"the law is like a great wide river\" is a paraphrase of a famous line from Springtime Awakening\u0085 in fact, the movie has a ton of great quotable lines e.g. \"such a small town, and so much hate and meanness\". Besides the portrait of a small town where everyone hates everyone hates everyone else, added tension is given by this being a proud and ancient place humiliated by foreign conquest and occupation (West Germany, 1960). The many tensions reach boiling point and explode. This Swiss-American co-production goes places Hollywood would never dare, it more resembles German movies like The Lost Honour of Katharina Blum. The theme song was a smash hit in 1961, and even got an Oscar nomination; the music was written by the legendary Dimitri Tiomkin, a classically trained composer. \"No, it isn't very pretty what a town without pity can do-oo\".",
         "Probably best known today for it's unforgettable title song by Gene Pitney, which was a huge international hit and sold 3.5 million records that year, this was a courageous film to make in 1961. With dramas about rape something you can see almost every night on TV you may forget that this was almost taboo in those days. A powerful well acted drama from start to finish, my only complaint would be the totally unnecessary narration. Perhaps this isn't on the German version but the film I saw it is a horrible distraction. A female voice tells you everything your seeing as it happens, gives unnecessary explanations, and tells you what the Germans are saying in their native language. Simple subtitles would have been much better. But putting that aside you have a powerful film with an excellent cast. Christina Kaufman should have become a major star. As is, this is her best role. Don't miss it!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Mirisch Corporation, The",
         "Osweg",
         "Gloria-Film GmbH"
      ],
      "summaries": [
         "In 1960 Germany, Army lawyer Major Steve Garrett is assigned to defend four American soldiers charged with raping 16 year-old Karin Steinhof. She was swimming in a nearby river when the four of them came across her and they were soon arrested thereafter. Maj. Garrett is anything but impressed with his clients but his job is to give them the best defense possible. He tries to obtain a plea bargain but Karin's father flatly refuses and the prosecutor, Colonel Jerome Pakenham, is seeking the death penalty. In order for the death penalty to be applied, the defense attorney must have the opportunity to thoroughly examine the victim under oath. He sympathizes with Karin and does his best to convince Karin father to keep her from testifying. When he refuses, Garrett is left will little choice but to attack her on the stand.",
         "When four young American soldiers are accused of raping a girl from a German village near their camp, Major Steve Garrett is assigned the distasteful task of defending them. It soon becomes clear that the Army, the villagers, and even the girl's family are more interested in revenge than in the welfare of the distraught victim. Garrett is faced with the dilemma of destroying the girl on the witness stand in order to save the lives of his clients.",
         "Four American soldiers stationed near a German village face death in the rape of a local girl and are defended by outside counsel Major Steve Garrett."
      ],
      "budget": 0
   },
   "movielensId": 5124,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1961-10-10",
      "dvdReleaseDate": "2002-02-05",
      "directors": ["Gottfried Reinhardt"],
      "runtime": 105,
      "movieId": 5124,
      "title": "Town Without Pity",
      "mpaa": "",
      "actors": [
         "Kirk Douglas",
         "Barbara Rütting",
         "Christine Kaufmann",
         "Hans Nielsen",
         "Ingrid van Bergen",
         "Robert Blake",
         "Richard Jaeckel",
         "Frank Sutton",
         "Karin Hardt",
         "Gerhart Lippert",
         "Mal Sondock",
         "Alan Gifford",
         "Max Haufler",
         "Rose Renée Roth",
         "Eleonore von Hoogstraten",
         "Egon von Jordan",
         "Philo Hauser",
         "E.G. Marshall"
      ],
      "imdbMovieId": "0055539",
      "originalTitle": "Town Without Pity",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["Tos3dCc1J94"],
      "plotSummary": "Four American soldiers stationed near a German village face death in the rape of a local girl and are defended by outside counsel Major Steve Grant.",
      "tmdbMovieId": 93427,
      "avgRating": 3.34043,
      "releaseYear": "1961",
      "numRatings": 47,
      "posterPath": "/jvrZhjIGVIjNy6VWSgpFA87cvXr.jpg"
   }
}