{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "mockery",
            "id": 2422
         },
         {
            "name": "failure",
            "id": 3837
         },
         {
            "name": "idealist",
            "id": 9031
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "betrayal by friend",
            "id": 171854
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0386862",
      "video": false,
      "title": "The Forest for the Trees",
      "recommendations": [
         121102,
         80180,
         9653,
         33809,
         53445,
         1115,
         52251,
         162503,
         23513
      ],
      "backdrop_path": "/paPmIDzqzMgu1wFUy6thdVah4n5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Melanie Pröschle",
               "gender": 1,
               "credit_id": "53fd8e660e0a262deb0013c2",
               "name": "Eva Löbau",
               "profile_path": "/70CVxS68wiN0U4e2Vm0iadxAJlT.jpg",
               "id": 7161,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tina Schaffner",
               "gender": 1,
               "credit_id": "52fe4451c3a36847f808f0b1",
               "name": "Daniela Holtz",
               "profile_path": "/2ct0R72YRbwBs3lng9Sr9ugAc5S.jpg",
               "id": 49740,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Thorsten Rehm",
               "gender": 0,
               "credit_id": "52fe4451c3a36847f808f0b5",
               "name": "Jan Neumann",
               "profile_path": null,
               "id": 49741,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Frau Sussmann",
               "gender": 0,
               "credit_id": "52fe4451c3a36847f808f0b9",
               "name": "Ilona Schulz",
               "profile_path": null,
               "id": 49742,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tobias",
               "gender": 2,
               "credit_id": "52fe4451c3a36847f808f0bd",
               "name": "Robert Schupp",
               "profile_path": "/rVgcUaggqG7ZpmkFBy7kwJQudpR.jpg",
               "id": 49743,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Lutger Reinhardt",
               "gender": 0,
               "credit_id": "52fe4451c3a36847f808f0c1",
               "name": "Heinz Röser-Dümmig",
               "profile_path": null,
               "id": 49744,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4451c3a36847f808f0a9",
               "name": "Maren Ade",
               "profile_path": "/nOholiGROBPeCFE1CGagTvtsFpf.jpg",
               "id": 40476,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 1,
               "credit_id": "52fe4451c3a36847f808f0c7",
               "name": "Maren Ade",
               "profile_path": "/nOholiGROBPeCFE1CGagTvtsFpf.jpg",
               "id": 40476,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4451c3a36847f808f0cd",
               "name": "Janine Jackowski",
               "profile_path": null,
               "id": 40475,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4451c3a36847f808f0d3",
               "name": "Nellis Du Biel",
               "profile_path": null,
               "id": 51713,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4451c3a36847f808f0d9",
               "name": "Nikolai von Graevenitz",
               "profile_path": null,
               "id": 36565,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4451c3a36847f808f0df",
               "name": "Heike Parplies",
               "profile_path": null,
               "id": 51714,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57e46427c3a3682cb30064fc",
               "name": "Ina Siefert",
               "profile_path": null,
               "id": 44632,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57e464339251411df1006b54",
               "name": "Emrah Ertem",
               "profile_path": "/VwmqN8OfVAS1KApLCjCksyl9r4.jpg",
               "id": 124693,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "57e4643ec3a3682ce9007411",
               "name": "Claudia Schoelzel",
               "profile_path": null,
               "id": 1683614,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57e46445c3a36875a1009b45",
               "name": "Eric Ségol",
               "profile_path": null,
               "id": 1683615,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57e4644cc3a368759c00a5f1",
               "name": "Gitti Fuchs",
               "profile_path": null,
               "id": 935742,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57e464539251411dc1006bea",
               "name": "Anett Pohl",
               "profile_path": null,
               "id": 1683616,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "57e4645c925141123c0092d2",
               "name": "Maren Lüthje",
               "profile_path": null,
               "id": 1074362,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "57e4646c925141123c0092da",
               "name": "Baran bo Odar",
               "profile_path": "/3mch6S9Qm0TAi5tUYU2pkCGXXdn.jpg",
               "id": 232959,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "57e46476c3a368759c00a609",
               "name": "Sonja Heiss",
               "profile_path": null,
               "id": 36564,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "57e46480c3a368759c00a613",
               "name": "Agnes Karow",
               "profile_path": null,
               "id": 1683617,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.686687,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 6443,
      "vote_count": 11,
      "budget": 0,
      "overview": "As an awkward idealistic high school teacher begins her first job in the city, things turn out to be much tougher than she had imagined.",
      "similar": [
         35052,
         103663,
         52449,
         11564,
         858,
         8923,
         112160,
         141,
         634,
         376867,
         242224,
         9603,
         13466,
         258480,
         17130,
         43923,
         5951,
         19458,
         9276,
         37735
      ],
      "original_title": "Der Wald vor lauter Bäumen",
      "runtime": 81,
      "poster_path": "/5LHj5rVBsXGStCBCvnYwKRIldZT.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Filmförderung Baden-Württemberg (MFG)",
            "id": 81694,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "FilmFernsehFonds Bayern",
            "id": 268,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Komplizen Film",
            "id": 1618,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmförderungsanstalt (FFA)",
            "id": 4247,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rat Pack Filmproduktion",
            "id": 5754,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Südwestrundfunk (SWR)",
            "id": 16110,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hochschule für Fernsehen und Film München (HFF)",
            "id": 19677,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hochschule für Gestaltung Karlsruhe",
            "id": 75860,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "KaufmannWöbke GbR",
            "id": 81693,
            "origin_country": ""
         }
      ],
      "release_date": "2004-09-16",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Maren Ade"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Maren Ade"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0386862/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTY1ODkxODI1OV5BMl5BanBnXkFtZTgwNzkxMDY0MDE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Eva Löbau, Daniela Holtz, Jan Neumann | See full cast and crew »"],
      "reviews": [
         "Eva Loebau plays Melanie, an almost socially retarded young teacher who moves to Karlsruhe to begin her career. Her shyness and painfully embarrassing inability to read people makes for one social and career error after another. She awkwardly befriends a hip and attractive neighbor and then, with her pathetic neediness and constant visits (not to mention her failure to understand subtle interpersonal cues) drives the neighbor to hate her. This, coupled with her legion of problems at work, precipitates Melanie's mental breakdown. The subject matter, direction, and Loebau's acting makes the film VIBRATE with unease and tension which makes parts of the film almost impossible to watch. Add to this the fact that it was shot on video, giving it a \"you are there\" realism, and you may need a shot of homemade schnapps to keep from squirming. A.",
         "The first few minutes of the film, i couldn't get over the 30fps video hand-held format. I was thinking, \"are they crazy? at least shoot 24p...\" But soon enough, the story sucked me into Melanie's plight settling into a new environment, struggling with loneliness, desperation, and upholding her facade of \"everything is fine,\" when everyone knows that she is physically and emotionally deteriorating. I thought that the acting was superb. Not once did I feel like the actors were acting, but the video format and the emotions elicited conveyed a painful sense of realism. This film touches upon a universal struggle of the human condition in such a realistic, frustrating, and true-to-life approach. Her inner tug of war is something that all of us have experienced at one point or another to some degree of severity. It is truly a touching story. I haven't felt such pity, frustration, empathy, and genuine identification with the protagonist in a long time. Find this film and go see it.",
         "Melanie is, simply and unalterably, who she is and has always been. She cannot effectively assert herself. She cannot control other people's impression of her. She cannot draw people close to her, or even get them on her side. This applies to her out-of-view family (we know them only from overhearing her end of unrewarding telephone conversations with them), her students, her staff peers and her neighbors and would-be friends. Emotional isolation has never felt so completely real on film. Nothing is over-dramatized. No scenery chewing here, Thank God. No dishonest cutaways to a colorful fantasy world inside the main character's head. No Hollywood situations or developments. What happens throughout feels inevitable, and thus real. I was turned off, in the beginning, by the shot-on-video character of this film, because by default it seemed to mean a dispensing with classic film language, and a less articulate camera. --And there are times I thought a score would have helped. But eventually the deliberately flattened style (call it Bressonian) grew on me. I realized the film wasn't an over-hyped thriller (as the video box more or less lead me to believe) that needed or invited a lot of flash style in the telling. Directness is the best decision the makers could have made in a vehicle built to carry emotional truth. I recommend this film for people who want something emotionally naked, at times painful to watch, with a psychological preoccupation. If you look at Melanie and see some piece of yourself in real life, this film will probably bring you down. On the other hand, it might also broaden your view of yourself and the world, and impress you again with the fact that no one is weird; people simply are.",
         "\"The Forest For the Trees\" tells the story of Melanie, a young woman who sets off for a job as a teacher in the big city. She is idealistic and thinks (as most new teachers do)that she knows more than the experienced teachers because she has just come from college and she knows \"new\" techniques, when experience is the ONLY teacher. But I digress...Eva Loebau does a marvelous job portraying Melanie, who can constantly be counted on to say the wrong thing, both in her professional and in her personal life! We watched and cringed as Melanie made faux pas after faux pas, never seeming to learn, and being too proud to ask for help! As to the ending, the director (we saw this at a Sundance screening, and the director came up on stage for Q and A afterward) said that the end was meant to be more symbolic than literal. I didn't really think there would be another credible way to end the story, and thought that the director did an awesome job in this, her first film.",
         "I watched the movie at a local festival for foreign films and it was obvious that the audience had a hard time to understand the movie or to sympathize with Melanie, the central character of the film. The average American just has a hard time to understand that getting rid of a few bags of trash may become an almost insurmountable problem, that finding new friends among your neighbors or colleagues at work can be so difficult. Of course, our heroine makes one mistake after another, but shouldn't somebody around her see how lonely she is? Ridiculously, she brings home-warming presents to people in her apartment building when she moves in. Doesn't anybody see this as a cry for help? Despite her best intentions, Melanie fails miserably as schoolteacher - why doesn't anyone of her colleagues or the principal rush in to help? The only other young teacher at the school, a guy, senses that she is in trouble, but she can't get herself to open up to him. Melanie tries to win the friendship of the owner of a fashion boutique by buying expensive clothing that she probably can't afford, helps her with cleaning up her apartment, only to get coldly rejected when due to a misunderstanding she dis-invites the boutique owner's boyfriend. Eva Lobau does a fantastic job playing the young schoolteacher who doesn't seem to fit in.",
         "This is certainly an interesting film. I discovered this film by accident at my local blockbuster store.At first as another viewer had mentioned found it difficult to get used to the camera format at first. The movie experience was almost like getting sucked into a novel possibly a modern day Camus perhaps.The story also perhaps was focusing on the lack of a social support structure in modern societies. The alienation and loneliness is realized through the character of Melanie in depth. The ending was open to interpretation by the viewer and i am guessing that she is moving on from her teaching position to one which might be more fulfilling. Overall a good job.",
         "I thought this film was very well made given what was probably a very small budget. The acting was very fine, and the story was painfully realistic in many ways. I got it from the local library because it was about a young teacher. My wife teaches so I thought she might like it. Fortunately I watched it on my own first, and decided that she would probably find it very disturbing because of the realities depicted, but frustrating because of the inability of the young teacher to do what was necessary to help herself. I found myself very moved by the young teacher, and had the feeling that I'd like to help her through her difficulties...difficulties revealed to the viewer, but ones she was unwilling to admit or express to those who might have helped her in the film.",
         "(Note: Brief plot description ahead that could be seen as a spoiler) Shot on DV by student filmmakers, this harrowing, heartbreaking story of a socially isolated young schoolteacher's gradual breakdown has an amazing, complex central performance, as well as strong supporting work, and intelligent writing. A major case of substance triumphing over form, lack of money, and lack of experience. Far more thought provoking and incisive than about 99% of what is being made currently. A film that takes you into the heart of loneliness and isolation. Not easy or fun to watch, but very rewarding",
         "Excellent film. Not for everybody for sure, but I found this film one of the best I have seen in years. The director has lots of courage to take such an enormous risk. The film leaves many questions open and is not easy to forget. The acting is absolutely superb, so natural and the film avoids simplicity. Highly recommend for people who hate sugar coating. This is film is truly tough, psychologically tough. The main actress is just amazing,but all supporting actors are good as well. The true subject of the film, I think, is actually survival and friendship. Female friendship rarely gets analyzed so closely and accurately. In general films focus too much on romance and not enough on friendships, which are just as complex and complicated.",
         "I think that this movie would have gotten the highest rating from me if it wasn't so painful to watch after moving to San Diego from Portland two years ago and only finally feeling that I have a real friend locally a month ago. However, I voted it as high as I did because it really sucks you into the movie. The reason it was so painful is that as a person with undiagnosed Asperger's, but one who recognizes most of the symptoms of social alienation and ineptness within myself, and I see the main character Melanie having a psychological condition of something like that and can see myself falling into her trap, if I let myself. One viewer suggested she is a sociopath while railing against people like her for being stalkerish. However, beyond empathy - I feel nothing but sympathy for Melanie and her obviously malformed coping mechanisms for extreme isolation which I could see leading one to eventually go down that road in desperation. She and the Science Teacher coworker would have made a good match if only he had not come on so strong (like she does later with her \"friend\") and she would have seen that he was actually a good person and if she simply looked beyond his baldness and personality flaws. However, that is the problem with being socially inept, it is almost harder to be friends with other socially inept people who are most likely to sympathize with you. The fact she has no one to go to on break, friends or family, indicates she has always been very hard to get along with for any person, including her parents. However, it is disappointing to see no one tries too hard to really get to know or intervene and in the end she likewise never really opens up, escapes and takes the easy way out, a thought I frequently have to fight against when things seem to be too tough, instead of facing her problems in an honest manner. I would say this is a very good film for someone who wants to understand how a un-neurotypical mind works but it might be a little too much for those un-neurotypicals who struggle like this every day to some degree, unless they can learn something from it without becoming too depressed from watching their own struggles on screen. It really is a perfect storm of malformed psychological intensity causing maximum damage in the protagonist's life. Regardless, it made me think about things like no other film ever has and viewing it resulted in my first film review so that I could understand the film and my reactions to it better."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Komplizen Film",
         "Südwestrundfunk (SWR)",
         "KaufmannWöbke GbR"
      ],
      "summaries": ["As an awkward idealistic high school teacher begins her first job in the city, things turn out to be much tougher than she had imagined."],
      "budget": 0
   },
   "movielensId": 51402,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2004-09-16",
      "dvdReleaseDate": "2007-10-02",
      "directors": ["Maren Ade"],
      "runtime": 81,
      "movieId": 51402,
      "title": "The Forest for the Trees",
      "mpaa": "",
      "actors": [
         "Eva Löbau",
         "Daniela Holtz",
         "Jan Neumann",
         "Ilona Schulz",
         "Robert Schupp",
         "Heinz Röser-Dümmig"
      ],
      "imdbMovieId": "0386862",
      "originalTitle": "Der Wald vor lauter Bäumen",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "As an awkward idealistic high school teacher begins her first job in the city, things turn out to be much tougher than she had imagined.",
      "tmdbMovieId": 6443,
      "avgRating": 3.66667,
      "releaseYear": "2004",
      "numRatings": 15,
      "posterPath": "/5LHj5rVBsXGStCBCvnYwKRIldZT.jpg"
   }
}