{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "shark",
            "id": 15097
         },
         {
            "name": "tropical island",
            "id": 157524
         },
         {
            "name": "video nasty",
            "id": 189921
         }
      ],
      "imdb_id": "tt0080057",
      "video": false,
      "title": "Zombie Flesh Eaters",
      "recommendations": [
         24920,
         19204,
         28794,
         14029,
         27813,
         27814,
         15762,
         27346,
         10925,
         8691,
         30874,
         26554,
         1694,
         16395,
         8408,
         24274,
         13555,
         16288,
         9964,
         22172
      ],
      "backdrop_path": "/rz6bEvDbkchDu8EKJSXRRUhpxuy.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "52780cc019c295600b06e08c",
         "content": "Fulci’s Feral Food Feast.\r\n \r\nBeing of a “certain” age and being British, I was firmly around at the time of the ridiculous “video nasty” mania that swept the UK in the early 1980s. Films that usually involved cannibals, either ferox, holocaust or zombified, and torture porn revengers et al, were banned, prosecuted or given a Viking burial at sea. One such film was Zombie Flesh Eaters (the best title the film has of the few it is known by), it became like the Holy Grail of video nasties, where to see it uncut would be like witnessing the last miracle performed by Christ. I never did get to see it back then, and as my horror leanings waned over the years I let it drift from my conscious. But now I’m here in my middle age and finding a new appetite for horror, I have finally managed to see the fabled shocker from Lucio Fulci.\r\n \r\nIn many ways it’s a disappointment, I mean I understand that to view it now is never going to impact in the way that it did (could) in 1979, but casting aside for a moment the gore scenes, which I will get to, it’s a bad film awash with badness, and not in a horror bad ass way. Much like the other Fulci film I viewed recently, The House By The Cemetery, ZFE is a series of blood and guts scenes strung together by amateurish filler. Be it bad acting, bad dubbing, hopeless dialogue and half hearted attempts at something cranial. However, if judging this particular Fulci film on its key horror scenes? Then it’s got brains, imagination and style to burn. Marking it out as by definition a mixed bag genius disaster!\r\n \r\nThe zombies themselves are brilliant creations, all dripping with rotting flesh, caked in earth and having mother nature’s insect creatures wriggling around their ravaged bodies. They shuffle along in classic Romero mode, and feast on flesh with carefree abandon. They are also perpetrators of some of zombie cinema’s best moments, such as fighting a shark on the ocean bed, pulling a hapless female victim onto a wooden splinter – eye first! And one scene where they collectively rise slowly from the earth is atmospherically as creepy as it is stunning in its execution. It is these things that of course helped to make it a legendary part of the Italian Exploitation era, and it’s these things that make it watchable still today, but let it not be said there is anything else worthwhile, because the rest is simply awful. 6.5/10",
         "url": "https://www.themoviedb.org/review/52780cc019c295600b06e08c"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anne Bowles",
               "gender": 1,
               "credit_id": "52fe4474c3a36847f8096ef1",
               "name": "Tisa Farrow",
               "profile_path": "/rNEcsJlvXbD6IBcZrT8GH0OKzyt.jpg",
               "id": 43203,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Peter West",
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096ef5",
               "name": "Ian McCulloch",
               "profile_path": "/4Z567gJwOFExnNgFWjJ17UYQCEs.jpg",
               "id": 45473,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. David Menard",
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096ef9",
               "name": "Richard Johnson",
               "profile_path": "/miDA5sN3ijfED6M4oRZ0NTdBfBR.jpg",
               "id": 20510,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Paola Menard",
               "gender": 1,
               "credit_id": "52fe4474c3a36847f8096efd",
               "name": "Olga Karlatos",
               "profile_path": "/6f9S4wKxnBx4n5HRx8mY7n1a6s3.jpg",
               "id": 50744,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Brian Hull",
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f01",
               "name": "Al Cliver",
               "profile_path": "/lQTPaWTC4yjVDzMGvBj9Nl2k73w.jpg",
               "id": 52063,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Susan Barrett",
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f05",
               "name": "Auretta Gay",
               "profile_path": "/jBroSgr9thAg2zjGXpNPgB5l4dO.jpg",
               "id": 52064,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Menard's Nurse",
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f39",
               "name": "Stefania D'Amario",
               "profile_path": "/jr0QtBAZedPGTDMcp9vGnd1IpVJ.jpg",
               "id": 100411,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Ann's Father (uncredited)",
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f3d",
               "name": "Ugo Bologna",
               "profile_path": "/wtJeAQOwHGqVvGKfGFHxXluolWM.jpg",
               "id": 41153,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Zombie (uncredited)",
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096f41",
               "name": "Omero Capanna",
               "profile_path": "/kM9AC6ZSU1q2RIdgDJWKFvuAAbd.jpg",
               "id": 119370,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Newspaper Editor (uncredited)",
               "gender": 2,
               "credit_id": "536022390e0a260901000014",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Matthias (uncredited)",
               "gender": 2,
               "credit_id": "58be512c92514132a200c778",
               "name": "Franco Fantasia",
               "profile_path": "/gLHZjZMJszAokXgTNQ2EdBKSyOm.jpg",
               "id": 33820,
               "order": 10
            },
            {
               "cast_id": 31,
               "character": "Boat Zombie (uncredited)",
               "gender": 2,
               "credit_id": "5a32ac199251415475018de8",
               "name": "Captain Haggerty",
               "profile_path": "/hDxB1z6p5AjbdpPWASNHNdL0Q5r.jpg",
               "id": 104442,
               "order": 11
            },
            {
               "cast_id": 32,
               "character": "Worm-Eye Zombie (uncredited)",
               "gender": 2,
               "credit_id": "5a32ac29925141547e018e99",
               "name": "Ottaviano Dell'Acqua",
               "profile_path": "/sZcBEm4CeZgqughAzlNNpMw11wo.jpg",
               "id": 68330,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096eed",
               "name": "Lucio Fulci",
               "profile_path": "/n0T4dgUSvp5HXdyncyDLmJaDZi6.jpg",
               "id": 29433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f11",
               "name": "Ugo Tucci",
               "profile_path": null,
               "id": 53195,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096f17",
               "name": "Sergio Salvati",
               "profile_path": "/7L2BcidnkV8LcNvYgpGtivv5r2n.jpg",
               "id": 53196,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096f1d",
               "name": "Vincenzo Tomassi",
               "profile_path": null,
               "id": 53197,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096f23",
               "name": "Walter Patriarca",
               "profile_path": "/kIPI06rvhzk0IeSoPhggc2RKFNs.jpg",
               "id": 38917,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096f29",
               "name": "Walter Patriarca",
               "profile_path": "/kIPI06rvhzk0IeSoPhggc2RKFNs.jpg",
               "id": 38917,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4474c3a36847f8096f47",
               "name": "Fabio Frizzi",
               "profile_path": "/6MGkjsEpKSxwOasSd5xpc93Gfmw.jpg",
               "id": 59366,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f4d",
               "name": "Giorgio Cascio",
               "profile_path": null,
               "id": 119371,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f53",
               "name": "Paolo Curto",
               "profile_path": null,
               "id": 119372,
               "department": "Camera",
               "job": "Underwater Camera"
            },
            {
               "gender": 0,
               "credit_id": "52fe4474c3a36847f8096f59",
               "name": "Fabrizio De Angelis",
               "profile_path": null,
               "id": 53188,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58b9e4e7925141609b00e3b3",
               "name": "Dardano Sacchetti",
               "profile_path": "/gAOsap6fh6S9WBTR6iSX0jSLIxX.jpg",
               "id": 44957,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "58b9e502c3a368668600d603",
               "name": "Elisa Briganti",
               "profile_path": null,
               "id": 53193,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58b9e537c3a368664d00ea41",
               "name": "Gianfranco Couyoumdjian",
               "profile_path": null,
               "id": 53187,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "58b9e568c3a368663000dd96",
               "name": "Giannetto De Rossi",
               "profile_path": null,
               "id": 16597,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "58b9e5b5c3a368668600d65d",
               "name": "Maurizio Guarini",
               "profile_path": null,
               "id": 1769439,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 7.332584,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 7219,
      "vote_count": 169,
      "budget": 0,
      "overview": "A zombie is found aboard a boat off the New York coast which belongs to a famous scientist. A journalist travels to the Antilles with the daughter of the scientist. They discover a terrifying disease which is turning the islanders into horrifying zombies, who devour human flesh and seem indestructible....",
      "similar": [
         19204,
         434873,
         341006,
         9373,
         10781,
         15762,
         19908,
         381288,
         588,
         9538,
         16288,
         301846,
         74997,
         923,
         21484,
         5486,
         12662,
         11429,
         273477,
         10185
      ],
      "original_title": "Zombi 2",
      "runtime": 91,
      "poster_path": "/wP6FyRrK5PNsyEwDFrrG8Pi9G8n.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Variety Film Production",
         "id": 2187,
         "origin_country": ""
      }],
      "release_date": "1979-08-25",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": "/thmNPh9FbKrkVcKhDmVWhw92s86.jpg",
         "name": "Zombi Collection",
         "id": 133923,
         "poster_path": "/m3fDT3Pk9GwwOzNRgaT0UDeAL6e.jpg"
      },
      "tagline": "We are going to eat you!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "ITL ",
      "directors": ["Lucio Fulci"],
      "runtime": 89,
      "synopsis": "A man fires a bullet into the head of a body wrapped in a sheet. He says to an off screen person, \"The boat can leave now. Tell the crew.\" Several days later, an apparently abandoned sailboat sails into New York harbor. Two officers of the harbor patrol board the boat to investigate and find the living quarters in squalor and disarray. They are suddenly attacked by a rotting, bloated zombie ( Captain Haggerty) which bursts from the hold, gorily killing one officer by biting his throat out, before being shot and propelled overboard by the second officer. A local reporter named Peter West ( Ian McCulloch) is assigned by his hard-nosed editor (director Lucio Fulci) to the case. That evening he meets up with Anne Bowles ( Tisa Farrow) the daughter of the boat's missing owner. Anne has informed the police that she has not seen her father for the past three months since he traveled to the Antilles. Meanwhile at the morgue, the pathologist and his assistant are preparing to perform an autopsy on the dead police officer, when unknown to them, the dead body begins stirring... The next morning, Peter and Anne fly to the Dominican Republic and meet an American tourist couple named Brian Hull ( Al Cliver) and Susan Barrett ( Auretta Gay) who are about to embark on a sailing tour of the Caribbean. Peter and Anne ask them to help them get to the island of Matul, where Anne's father was last heard from. Despite Brian's claim about warnings from the superstitious locals about Matul, the four of them agree to set off together for the island. On Matul, tensions between Dr. David Menard ( Richard Johnson) and his contemptuous, highly strung-out wife Paola ( Olga Karlatos) are running high. She wants to leave island, terrified about reports of zombie attacks. He insists on staying to conduct research into the phenomenon, despite the fact that his medical mission is falling apart. Leaving her alone to drink her fears away at their isolated beach house, Menard drives in his jeep to his hospital, which is a ramshackle converted church buzzing with flies. Menard's superstitious Haitian assistant Lucas ( Dakar) insists that they leave, for all of the villagers of the nearby town are fleeing in fear of the rising of the dead. Menard scoffs at all this. At sea, Susan goes on a scuba dive where she gets attacked, first by a shark, then by a strange aquatic zombie. Susan gets away, leaving the zombie to fight against the shark. That evening, Paola Menard is alone in the house where she takes a shower to cool off in the hot and humid weather, when she hears a noise. Investigating, she is attacked by a marauding cadaver (unseen except for a rotting, outstretched hand). As she struggles to barricade herself into her bedroom, the zombie smashes its arm through the door and grabs her by her hair. Her head is slowly pulled onto the shattered doorframe, and she dies a horrible death as her right eye is impaled on a spike of slatted wood as she's pulled out the door. The next morning, Anne, Peter, Brian, and Susan arrive off the coast of Matul where they find out that their boat has been damaged by the shark attack. They anchor in a bay off the island and send up distress flares. Menard answers their distress call as Luca and Menard's personal nurse ( Stefania D'Amario) bury more dead bodies, victims of a mysterious virus that's killing the islands residents and resurrecting them as zombies. The survivors are forced to shoot each corpse in the head to prevent them from reviving before burying them. On the drive back to the hospital, Menard tells his four visitors that Anne's father ( Ugo Bologna) died three months earlier from the strange disease plaguing the island. Menard also tells the disbelieving visitors that the zombie epidemic, so far on the other side of the island, is blamed by the locals on the voodoo curses of a evil witch doctor. When they arrive at the hospital, Menard's nurse informs him that a friend has been taken ill. Menard then asks Peter, Anne, Brian, and Susan to drive over his house and check on the safety of his wife. Menard looks at his friend, Fritz, who claims he was bitten by a zombie in the village. Menard orders Lucas to lock all the doors and windows, now aware that the zombies are approaching this end of the island. Meanwhile, Peter, Anne, Brian, and Susan arrive without incident at the Menard cottage and upon entering they make a horrific discovery. The dead body of Mrs. Menard is sprawled out outside the bedroom door, half-eaten, surrounded by a small group of zombies who are gorging on her remains. Revolted, they fight their way past a group of slow-moving, staggering zombies and drive back to the hospital. But on the road, a zombie wonders into their path, and the jeep is damaged as they swerve into the dense tropical undergrowth. Peter's left ankle is broken upon the impact, but the group decide they must make it back to the hospital. A little later, the group stops for a rest in a small jungle clearing which they see is an old cemetery for the Spanish Conquistatordes. As Peter and Anne lie down on the ground for a rest, the buried Conquistadors emerge from the soil. One of them grabs Anne by her hair while another grabs Peter by his broken ankle. The two of them break free, but Susan is not so lucky. Frozen in terror by the sight of a large, worm-faced cadaver ( Ottaviano Dell'Acqua), she dies as it bites her throat out before it's dispatched by Peter and Brian, who bash the creature's head in. The three survivors are now obliged to make the journey back to the hospital as the living dead erupt from their tombs all over the island, as well as stalk the deserted shanty village nearby. At nightfall, Anne, Peter, and Brian finally arrive back at the hospital. Dr. Menard tends to Peter's broken ankle, while Brian helps Lucas and the nurse barricade the doors and windows. Menard is informed to his wife's fate, but does not comment on it. Instead, he raves about his failed efforts to find a scientific explanation for the walking dead and their instinct to feed on human flesh. Suddenly, a large group of the tottering, implacable creatures try to batter down the boarded up front door. Menard and the group begin to construct barricades as well as make Molotov cocktails from the kerosene tanks. However, the hospital's sick patients are dying and coming back as zombies, making the hospital under attack from inside and out. Menard is the first to go when he gets his face ripped off by the zombie Fritz, before it's killed by Brian with a gunshot to the head, the only way of killing the reanimated zombies. Lucas is next when he gets part of his arm bitten off by another zombie. The nurse is then killed by the zombie Lucas, who then attacks Anne but gets shot dead by Peter. The mob of zombies finally breaks down the front door, and a climactic battle between the three survivors and the foul creatures begins, with fire apparently the only effective weapon against the slow moving, walking stiffs. With the hospital now on fire from the exploding Molotov cocktails, Anne, Peter, and Brian are forced to flee from the burning building out the back door. But outside, Brian comes face to face with the walking corpse of the resurrected Susan. He succumbs to emotion and gets badly bitten on his arm as a result. The zombie Susan is immediately shot and killed by Peter, and the trio run for the beach with some zombies not far behind. As dawn breaks, the jerry-rigged boat limps back out to sea. Brian sinks into unconsciousness, terminally sick from the zombie bite, and soon dies. Peter and Anne lock the dead Brian up in the boat's cabin, for Peter wants the dead Brian as proof to the authorities that the whole experience happened. Turning on the radio, Peter and Anne listen in disbelief as a radio announcer explains about a zombie epidemic gripping New York City apparently brought on the by zombie from the opening scene. Down in the cabin, Brian's re-animated copse frantically tries to get out of the hold it is locked up in. In New York City, a long line of freshly dead zombies are seen, slowly marching across the Brooklyn Bridge into Manhattan.",
      "writers": ["Elisa Briganti"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080057/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzAxMTI2NDgyOV5BMl5BanBnXkFtZTcwMjkxNjI5Ng@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Tisa Farrow, Ian McCulloch, Richard Johnson | See full cast and crew »"],
      "reviews": [
         "Now this is how a zombie film should be made! Whilst Lucio Fuci never had the creative genius of Dario Argento in Profondo Rosso, Tenebrae and Suspiria, he certainly knew how to make a good old fashioned zombie/gore movie. In Zombi 2 or Zombie Flesh Eaters (what a title!) as it was known in the UK, a ship drifts into New York with a very large, hungry zombie on board. This leads to two investigative journalists, including gore stalwart Ian McCulloch, with two holiday makers going to the Island of Matul. After meeting a shark wrestling zombie en route, they arrive at Matul where things are not going well. The hospital run by Dr. Menard has turned into a morgue where daily zombie killing has become the routine. Things go from bad to worse as the zombies grow in number and various dismemberment, eye gouging, jugular bites etc ensue. What makes this film so good are various factors. Apart from being one of the first gore films I ever saw, it has no social commentary or hidden meaning and does not try to be a comedy (although some may argue with this). It is a good, honest gore film. The special effects are nice and gruesome, with fantastic zombie make up, great zombie attacks and loads of maggots and worms. The crazy underwater battle between zombie and shark is totally original and not surprisingly has never been tried since. The infamous eye scene whilst a bit creaky still makes the viewer cringe. The acting and dubbing are dodgy but don't detract from the zombie mayhem, the music is great with calypso music to greet the heroes and throbbing effects to welcome the zombies. I cannot recommend this highly enough for good old fashioned zombie related thrills. Also look out for The Beyond and City of the Living Dead in a similar vein.",
         "This was my first ever video nasty, originally viewed in the mid 80's, and for that reason it shall always have a special place in my heart. The first thing that struck me was that the budget must have been relatively high. Fulci was never a great one for narrative coherence (this is probably his most conventional film) and typically for the Italian films of the time this must have been pitched as a sequence of set-pieces (the shark battle, the fiery finale, and of course, the infamous eyeball scene). Unfortunately for the most part these are fairly flatly directed and fall short of their potential for tension. The earlier expository scenes are especially protracted, and throughout Fulci has a tendency to leave shots hanging well past their sell-by date. That said, the film is not completely artless, and whereas it lacks suspense, it does have a degree of atmosphere about it. After the political correctness of the 80's and the 'post-Modernist' knowingness of the 90's, Zombie Flesheaters, with its excessive gore and its leering nudity, its risible dubbed dialog and its a complete lack of humour, with its simplistic plotting and comic-book characterisation, is probably most interesting if viewed from the perspective that firstly, that there was ever a market for this sort of thing and secondly, that people thought that films like this needed suppressing. Yes it's true, they don't make them like this anymore!",
         "#1 - Getting reception for New York City radio stations is easier than you'd think on the island of Matool. #2 - Molotov cocktails are easy to ignite, but the flames they produce rarely stay lit if you're throwing more than one at a time. #3 - Dr. Menard likes his booze and laying, fully clothed, in the sun (in that order.) #4 - If a shark with no teeth decides to get into a ridiculous scuffle with an underwater zombie, chances are it's going to end in a draw. #5 - NYC harbor patrol boats often fly French flags. #6 - The perfect remedy for having a busted ankle while being chased by legions of undead assailants is a good 'ole fashioned jungle makeout session. #7 - A dozen zombies shuffling into a door will (eventually and without any explanation) smash any barricade. #8 - Apparently, there are many different ways to scuba dive I've yet to try. #9 - Hospitals that look like churches are often well stocked in the ammo department (why not?) #10 - Splinters make eyeballs go \"ouch!\" #11 - The simple act of bribing a cabbie equals instant zombie adventure. You can't account for personal taste, because it's all subjective, so I'm going to steer clear of any and all \"this movie is great and you suck if you don't like it and I'll kick you twice in the rear if you do and, um... your momma and your dog and here's 15 reasons why I love being a film student\" silliness that seems to be an IMDb staple. What I will say is that this film is amazing. The zombies are great looking, the plot is ridiculous and full of holes, the music is stunning in its' elevator-esqueness, and Ian McCullough's combover is the stuff that dreams are made of. I read somewhere on IMDb that this film \"wouldn't gain any converts to the genre,\" but I strongly disagree. This film firmly cemented my lifelong love of all things horror and is, in my humble and worthless opinion, most likely the greatest film ever made - so take that \"Mom and Dad Save the World!\"",
         "Lucio Fulci's \"Zombi 2\" is by far his most famous contribution to the genre.The make-up effects by Gianetto de Rossi are amazing and the direction by maestro Fulci creates unremitting vile monsters and a real sense of decay,horror and hopelessness.The gore in some parts is extreme(I love especially the scene when Auretta Gay has her throat torn out),but this is not the goriest Italian zombie flick ever made.Andrea Bianchi's \"Burial Ground\" is much more gorier.However I must agree with Trooper8-2 that mainstream American zombie flicks like \"Return of the Living Dead\" or similar politically correct garbage are nowhere near as explicit as Italian gorefests.The plot is simple:Tisa Farrow and Ian MacCulloch travel to the island of Matool in search of her missing father.Unfortunately for them and their two companions(Al Cliver and Auretta Gay)they are thrown into a nightmare of undead.Many people say that \"Zombi 2\" is a \"Dawn of the Dead\" rip-off,I absolutely disagree because other than the presence of the zombies there is nothing in common between the two.Check it out if you're an Euro-horror fan,but if you like American trendy \"horror flicks\" like \"Scream\" then stay away.Highly recommended.",
         "Surely the best film Fulci has ever directed, involving several zombies on a Caribbean island. As with all Fulci films, the movie suffers from rather bad dubbing, but all Fulci films seem to have this problem, so it`s almost a hallmark for the director. The gore is graphic & over-the-top, but when you`ve seen a zombie deep in the ocean fighting with a shark, nothing is over the top. A few memorable scenes, (the eye scene has to be the highlight) but this is movie is all about escapism. If you can handle the explicit gore (and if you`re watching Fulci, you better had!) this is a definite `lads night in movie`. Just don`t try to find too many subtexts in it`s, ahem, plot. (7 out of 10)",
         "A sail boat arrives in New York without a living soul but a zombie that attacks two guards from the Coast Guard. The daughter of the owner of the ship, Anne Bowles (Tisa Farrow), requests information about her missing father that was in the Antilles to the detectives that are investigating the crime without success. She meets the journalist Peter West (Ian McCulloch) and they decide to investigate what might have happened to her father. They travel to Matul Island with Brian Hull (Al Cliver) and Susan Barrett (Auretta Gay) in their boat. Once in the tropical island, they meet Dr. David Menard (Richard Johnson), who is trying to find a cure to a disease that brings dead back to life, turning them into zombies that eat human flesh. \"Zombie 2\" is a horror classic of Lucio Fulci with a simple, but interesting screenplay. The unforgettable story begins like Nosferatu, with an empty boat arriving in a harbor with a zombie instead of a vampire; shows the naked body of two beautiful actresses, Auretta Gay and Olga Karlatos; is very gore, with a death that slightly recalls the famous scene of Buñuel in \"Un Chien Andalou\", when the zombie perforates the eye of Paola Menard; and has a very scary and impressive make-up, with zombies eating human flesh and biting and killing people. The sister of Mia Farrow, Tisa Farrow, has a good performance in this cult-movie. My vote is eight. Title (Brazil): \"Zombie \u0096 O Retorno dos Mortos\" (\"Zombie \u0096 The Return of the Dead\")",
         "'Zombie Flesh-Eaters' is the movie that put Lucio Fulci on the map, after a career of over twenty years. Initially presented as a sequel to Romero's (superior) 'Dawn Of The Dead' there is actually no connection between the two, and is best regarded as a stand alone horror movie. Unfortunately I watched the Australian cut from several years back which is missing a lot of the most explicit violence and gore, but even so I recommend this for lovers of Zombie movies. The plot here is pretty simplistic, the acting variable but usually above average (including a few familiar horror veterans and Tisa Farrow of 'Fingers'), but after a fairly dull first half hour it picks up the pace. Fulci and his special effects crew must be congratulated for creating such realistic and repulsive looking zombies on such a low budget. They really are something to see, and arguably better than Romero's. And 'Zombie Flesh-Eaters' features an extraordinary sequence involving an underwater zombie/shark fight, which must be one of the highlights of any zombie movie, Romero or otherwise. Fulci went on to more spectacular and original movies ('The Beyond' is highly recommended), but this is still a very credible effort, and essential viewing for horror fans.",
         "Zombi 2 (Zombie, Zombie Flesh Eaters) is a classic gore filled zombie film, in Italy it's classed as a sequel to George A Romero's Dawn of The Dead since in Italy it's called Zombi. But in other parts of the world they classed it as a separate film and named it something else like Zombie and Zombie Flesh Eaters. But sequel or not this film has some of the most realistic gore effects going for a zombie film, the infamous eye in the wood scene is one example. The zombie VS shark is another interesting scene. The music is good and sets the tone, the dubbing is kind of bad but that isn't a problem. A Classic Zombie film that zombie fans or gore fans would love to see but make sure it's the Un Rated version. 10/10",
         "Zombie is right up there with Romero's films in terms of quality. You don't have to be a zombie fan to like this film. Directed by Lucio Fulci, this movie is one of the best Italian horror films ever made. It's a shame it's not as famous as Romero's series. The visuals are creepy and outstanding. The way the light and shadows reflect add so much to the movie. The gore is outstanding and will make any normal person want to turn away. Make sure you see this on DVD as I saw it on an old VHS and the dialog did not sync very will with the picture. The style is absolutely amazing from the visuals to the synthesized soundtrack. I normally hate 70's sounding electronic music but this soundtrack really emphasizes the feeling of dread in this movie. The final shots are hypnotizing and (as with all other zombie movies) even though the acting could have been better, the suspense of the finale makes this a movie I would recommend to any horror fan.",
         "It has to be said that \"Zombie\" is a classic, although not for any traditional reason. The script is inept, the logic non-existent, but the bravura of the whole thing is mind-boggling. It's like a comic book come to life, and even though it's stupid, it is rarely flat-out boring. Part of the fun is picking apart the silly plot. It gives you something to do while the characters recite dialogue to one another between the \"good\" parts. For instance: - When people are fleeing from zombies, why don't they realize that a graveyard is probably a bad place to rest and catch your breath? - Would two people really decide to give up their vacation to cart two strangers to a remote island...especially one supposed to be \"bad news\"? - If zombies have such a hard time moving on land, how could one actually swim underwater, and even be nimble enough to launch an attack on a passing shark? Furthermore, why would a zombie have air bubbles coming out of its nose? - If a woman were being pulled by her hair into a large shard of wood that was about to pierce her eyeball, why wouldn't she at least move the wood out of the way with one of her free hands? - If a body were buried in the earth for hundreds of years, like the Spanish conquistadors were, would there really be enough of the body left to be reanimated during a zombie epidemic? Even if there were, would it be enough to do any real damage to a human being? - Why is it that in films such as \"Zombie\", women are portrayed as being too stupid to even run from a slowly approaching zombie, opting instead to stand rooted to the spot and scream, even helping matters along by exposing the soft part of the throat? - What absence of laws in Italy would allow a production company not associated with an original film to market another film and title it so that it would appear to be a sequel? - Would a person really instantly collapse and die if a single bite were taken from their throat? (This applies to any movie in existence. It seems as if on celluloid, all it takes is a quick cut across the throat to cause all signs of life to cease). - Are there really people somewhere in the world with teeth as big as the skeletal zombies in this film? - Why is it that, on a remote Caribbean island, most of the corpses appear to be of a Caucasian persuasion? These questions and others are raised by the thought-provoking \"Zombie\", which could be Lucio Fulci's best film. See it, but with a strong stomach, please. PS: Best line? It's a toss up. You can either pick any line of dialogue recited by Olga Karlatos, who plays the mad doctor's booze-soaked wife, or you can opt for the closing radio broadcast in which an increasingly frantic newscaster informs us: \"Ladies and gentlemen, I've just been informed there are zombies in the building...they're at the door...they're coming in....AAAIIIIIIIIIIIIIIIIIIIII!!!!\""
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Variety Film Production"],
      "summaries": [
         "A zombie is found aboard a boat off the New York coast which belongs to do a famous scientist. Peter West, a journalist, travels to the Antilles with Ann, the daughter of the scientist. On the way, they meet with with Brian, a ethnologist, and Susan. When they arrive at Matul Island, they find Dr. Menard, and discover a terrifying disease which is turning the islanders into horrifying zombies which devour human flesh and seem indestructible....",
         "A sail boat arrives in New York without a living soul but a zombie that attacks two guards from the Coast Guard. The daughter of the owner of the ship, Anne Bowles, requests information about her missing father that was in the Antilles to the detectives that are investigating the crime without success. She meets the journalist Peter West and they decide to investigate what might have happened to her father. They travel to Matul Island with Brian Hull and Susan Barrett in their boat. Once in the tropical island, they meet Dr. David Menard, who is trying to find a cure to a disease that brings dead back to life, turning them into zombies that eat human flesh, increasing the menace against the group.",
         "A young woman wants to search for her father who is missing since he made an expidition to the antilles. She starts the search together with her friends and a reporter. They arrive at an island where they get confronted with zombies. The zombies long eagerly for human flesh. In spite of desperate defence the situation becomes hopeless. More and more undead corpses crawl up and walk arround looking for flesh...",
         "Girl seeking lost father turns up on Caribbean island aided by journalist and two locals, where they meet an English doctor, trying desperately to cure a plague which brings the dead back to life!",
         "Strangers looking for a woman's father arrive at a tropical island where a doctor desperately searches for the cause and cure of a recent epidemic of the undead."
      ],
      "budget": 410000000
   },
   "movielensId": 5165,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1979-08-25",
      "dvdReleaseDate": "2004-07-27",
      "directors": ["Lucio Fulci"],
      "runtime": 91,
      "movieId": 5165,
      "title": "Zombie Flesh Eaters",
      "mpaa": "",
      "actors": [
         "Tisa Farrow",
         "Ian McCulloch",
         "Richard Johnson",
         "Olga Karlatos",
         "Al Cliver",
         "Auretta Gay",
         "Stefania D'Amario",
         "Ugo Bologna",
         "Omero Capanna",
         "Lucio Fulci",
         "Franco Fantasia",
         "Captain Haggerty",
         "Ottaviano Dell'Acqua"
      ],
      "imdbMovieId": "0080057",
      "originalTitle": "Zombi 2",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "2UYvhyzugtA",
         "ViXN7D3E7aI",
         "s96Xzz9O9Qo"
      ],
      "plotSummary": "A zombie is found aboard a boat off the New York coast which belongs to a famous scientist. A journalist travels to the Antilles with the daughter of the scientist. They discover a terrifying disease which is turning the islanders into horrifying zombies, who devour human flesh and seem indestructible....",
      "tmdbMovieId": 7219,
      "avgRating": 3.26738,
      "releaseYear": "1979",
      "numRatings": 374,
      "posterPath": "/wP6FyRrK5PNsyEwDFrrG8Pi9G8n.jpg"
   }
}