{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "cover-up",
            "id": 9665
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "terrorism",
            "id": 13015
         },
         {
            "name": "parade",
            "id": 15275
         },
         {
            "name": "irish rebellion",
            "id": 154787
         }
      ],
      "imdb_id": "tt0099768",
      "video": false,
      "title": "Hidden Agenda",
      "recommendations": [
         105910,
         89681,
         60792,
         42134,
         17875,
         32547,
         132144,
         132150,
         132148,
         511,
         240636,
         88052,
         70635,
         42481,
         27441,
         6366,
         96419,
         85926,
         16046,
         42011
      ],
      "backdrop_path": "/2iYjbQOgu6Yvz83ZNjNEiRlwL9x.jpg",
      "revenue": 1030938,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ingrid Jessner",
               "gender": 1,
               "credit_id": "52fe474bc3a36847f812d841",
               "name": "Frances McDormand",
               "profile_path": "/jodV4NuQAvxQWIHxqnop1jUX77N.jpg",
               "id": 3910,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Kerrigan",
               "gender": 2,
               "credit_id": "52fe474bc3a36847f812d845",
               "name": "Brian Cox",
               "profile_path": "/m15C58NWii5WCIg57Llr7hejnfy.jpg",
               "id": 1248,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Paul Sullivan",
               "gender": 2,
               "credit_id": "52fe474bc3a36847f812d849",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Moa",
               "gender": 1,
               "credit_id": "52fe474bc3a36847f812d84d",
               "name": "Mai Zetterling",
               "profile_path": "/2Ap4dJLZLOSlrYWlj5XRoi9KNjO.jpg",
               "id": 55156,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sir Robert Neil",
               "gender": 2,
               "credit_id": "52fe474bc3a36847f812d851",
               "name": "Bernard Archard",
               "profile_path": "/q72Xm6o0O6rr72rrIfMWW1co4HA.jpg",
               "id": 12819,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Teresa Doyle",
               "gender": 1,
               "credit_id": "52fe474bc3a36847f812d85d",
               "name": "Michelle Fairley",
               "profile_path": "/j8lQfEPHCKWV2QCiJJuH97CnoBX.jpg",
               "id": 20057,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Harris",
               "gender": 2,
               "credit_id": "57880c7392514138d0000283",
               "name": "Maurice Roeves",
               "profile_path": "/qXYjnIHClkey4QQxPG5D5JD7Y74.jpg",
               "id": 54,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Brodie",
               "gender": 2,
               "credit_id": "57880c9f92514138df00028f",
               "name": "Jim Norton",
               "profile_path": "/s6HeAK1mnqTiy3V12jRxnw1jxcw.jpg",
               "id": 14950,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Maxwell",
               "gender": 2,
               "credit_id": "57880cad92514138d0000293",
               "name": "John Benfield",
               "profile_path": "/wbafChQB1kZkOgnFrmAHV4s1QST.jpg",
               "id": 42642,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Henri",
               "gender": 2,
               "credit_id": "57880cba9251410f54000c24",
               "name": "Bernard Bloch",
               "profile_path": "/jaHWM6MTjNTiJ6lfiNKPpjkrGuN.jpg",
               "id": 32948,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Sgt  Kennedy",
               "gender": 0,
               "credit_id": "57880cd9c3a3683329000cd3",
               "name": "Des McAleer",
               "profile_path": null,
               "id": 102980,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Jack Cunnigham",
               "gender": 2,
               "credit_id": "57880ce9c3a3686a160002e2",
               "name": "Ian McElhinney",
               "profile_path": "/33RGircMDTbdvD6LUp8sLmQKWvA.jpg",
               "id": 43138,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Molloy",
               "gender": 0,
               "credit_id": "57880d6a92514131bd00268b",
               "name": "Brian McCann",
               "profile_path": null,
               "id": 1237236,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Alec Nevin",
               "gender": 0,
               "credit_id": "57880da7c3a3683919002a24",
               "name": "Patrick Kavanagh",
               "profile_path": "/uSgsKTLRMdxrvAUMbAfJNeMX07K.jpg",
               "id": 188457,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Det Sgt Hughes",
               "gender": 0,
               "credit_id": "57880dbd92514131c20025d7",
               "name": "John Keegan",
               "profile_path": null,
               "id": 213805,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Supt. Fraser",
               "gender": 0,
               "credit_id": "57880df7c3a3683329000d34",
               "name": "Oliver Maguire",
               "profile_path": null,
               "id": 1221792,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Ian Logan",
               "gender": 2,
               "credit_id": "57880e25c3a36869ad0002e4",
               "name": "Robert Patterson",
               "profile_path": null,
               "id": 1083344,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "Journalist",
               "gender": 0,
               "credit_id": "57880e48c3a3683930002780",
               "name": "Paul Moriarty",
               "profile_path": null,
               "id": 1229473,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe474bc3a36847f812d83d",
               "name": "Ken Loach",
               "profile_path": "/vGtkrPgNeK3xkbbKTQ4vWD1VsEm.jpg",
               "id": 15488,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "595180a99251412b31012722",
               "name": "Jim Allen",
               "profile_path": null,
               "id": 181945,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.620598,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 47869,
      "vote_count": 33,
      "budget": 0,
      "overview": "In Ireland, American lawyer Ingrid Jessner and her activist partner, Paul Sullivan, struggle to uncover atrocities committed by the British government against the Northern Irish during the \"Troubles.\" But when Sullivan is assassinated in the streets, Jessner teams up with Peter Kerrigan, a British investigator acting against the will of his own government, and struggles to uncover a conspiracy that may even implicate one of Kerrigan's colleagues.",
      "similar": [
         8834,
         5125,
         752,
         9388,
         2652,
         49026,
         588,
         4723,
         17295,
         3291,
         2721,
         16995,
         2275,
         24395,
         5336,
         10139,
         77953,
         1696,
         8090,
         10781
      ],
      "original_title": "Hidden Agenda",
      "runtime": 108,
      "poster_path": "/tIZXy9tCxJwVi3BaQVVnN0FPAIo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Initial (II)",
            "id": 37358,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hemdale Film",
            "id": 3952,
            "origin_country": ""
         }
      ],
      "release_date": "1990-11-21",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Every government has one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Loach"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Jim Allen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099768/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMDc5NjQ3M15BMl5BanBnXkFtZTcwNTA4MDIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Frances McDormand, Brian Cox, Brad Dourif | See full cast and crew »"],
      "reviews": [
         "Just great political drama. It takes place in 1987 Belfast. A human rights activist (Frances McDormand) investigating British brutality against the Irish, and a police inspector (Brian Cox) are investigating the murder of one of her colleagues. They find a huge conspiracy that leads to the highest people in government. I know only the basics of the conflict in Northern Ireland, but I was able to follow the story. They shot on location and the accents are, at times, incomprehensible, but it actually adds to the movie. The movie looks grimy and bleak...as it should. The movie is VERY critical of England. McDormand and Cox are superb and the movie is very realistic...especially the ending. Sadly, this movie bombed big in America. It came out before McDormand hit it big with \"Fargo\" and Cox before \"In the Name of the Father\". Still, this is well worth seeing. Don't miss it!",
         "Hidden Agenda has long been on my list of films to see. As a fan of the political thriller genre I was intrigued by its premise. Now, having finally found it and had the opportunity to see it I was presently surprised. The film surpassed my expectations and easily ranks amongst the best political thrillers I've seen. The performances are the staring point of this phenomenal film. Frances McDormand gives a marvelous performance as American civil rights activist Ingrid Jessner as Brian Cox as Kerrigan, the top investigator investigating the death of Jessner's boyfriend. The result is that, together and separately, they give two highly watchable performances that keep your attention focused on the screen. There's also the supporting cast including Brad Dourif as the murdered boyfriend, Maurice Roëves as the mysterious army officer Harris who has all the secrets plus Bernard Archard and Patrick Kavanagh as two politicians at the heart of the film's conspiracy. The film is, if nothing else, a conspiracy thriller. What may seem like an odd murder in Northern Ireland soon turns out to be mired in the politics of Thatcher era Britain. The film, while fictional, seems to be far too real for comfort. Writer Jim Allen has crafted a thriller that blends fact and fiction together and so well that the fine line between the two is blurred when it comes to the issues of 1980's Northern Ireland, how Thatcher got herself elected and how governments deal with terrorism. Of even greater surprise is that the plot doesn't overwhelm the dialogue. Unlike some political thrillers, in this film scenes come alive not just from the performances of the actors but from the words on the pages themselves. While it deals with 1980's Northern Ireland one can't help but see the relevant issues ever present in the film nearly twenty years on. On top of the script there's the documentary like approach that makes the film too realistic for comfort. Clive Tickner's cinematography is the main reason this succeeds so well in that it never feels like a Hollywood film. The result is that (thankfully) one gets the feeling of being a fly on the wall for many of the scenes which makes the blurring of fact and fiction even more successful. Add on the realistic costume and production design along with the tight editing of Jonathon Morris and the result is an all too realistic thriller. Hidden Agenda is what a political thriller should be. With its combination of fantastic performances, well written script, its realistic design work and especially its documentary like cinematography make it too realistic to be ignored. While it may deal with 1980's Britain in Northern Ireland it's a thriller with a message too strong to be ignored. It's a first rate and a must see for fans of the genre of the political thriller.",
         "Whooaa! Slow down, sol1218 from Brooklyn NY. The political scene in the U.K. looked like this: Edward Heath, bachelor leader of the Conservatives, won the election in 1970. He took Britain into the then Common Market in 1973, but called an election in February 1974 when the miners forced him to declare a three-day week. The Tory slogan for the election was: Who governs Britain? The result was confused, but the message was fairly clear: Not you, matey. Labour under Harold Wilson took office with a slim majority. Wilson called a second election in October, which he won narrowly, increasing his majority slightly. He held a referendum on the Common Market in 1975, which he won by sidelining the extremists of both Left and Right. He ruled until 1976 when he resigned from politics, for reasons which were obscure at the time, but probably because he had been diagnosed with Parkinson's. It is certainly true that the Right plotted endlessly against him. Jim Callaghan, who had been Chancellor, Home Secretary and Foreign Secretary, took over as P.M. and called an election after his full five-year term. (In the U.K. governments normally call elections after four years.) In fact Callaghan was forced to do so because of a move by the Scottish Nationalists. Had he called the election just a year earlier, he stood a good chance of winning, say many pundits. Meanwhile, the Conservatives had deposed Edward Heath who had lost them two elections, and Maggie Thatcher replaced him as leader. She swept to power in 1979, and as we all know, won the next two elections. Economic chaos was the watchword of the day and there were many strikes. The situation in Northern Ireland, which had started simmering with the Civil Rights movement of 1968, gradually deteriorated. The assassinated politician of the film whose name is Nevin, may well represent Airey Neave, a war hero who had escaped from the high-security Colditz Castle, a German-speaking lawyer who had attended the Nuremberg Trials and a hardline Conservative with military and security connections, who was a close adviser of Thatcher. He was blown up outside the House of Commons on March 30, 1979, by the INLA a few weeks before the election. Ken Loach has never made any secret of his sympathies for the Irish cause. His powerful film \"Wind that shakes the barley\", which apparently did not make much money in the U.K., had Conservative politicians fulminating about treason and lack of patriotism because of his portrayal of the brutal Black and Tans. The name was given to the ex-British army personnel and (inaccurately) also to the auxiliaries who were sent to Ireland between 1920 and 1921 to crush the IRA and Sinn Fein, but who also attacked and killed civilians. Historians agree, however, that Loach was pretty accurate in his historical recreation. The film also shows the ruthlessness of Irish-on-Irish killings in the Civil War afterwards.",
         "When a police investigator is called in to determine the facts behind the murder/execution of an American civil rights lawyer in Northern Ireland, he discovers not only an extensive cover-up of that event, but also a giant political conspiracy as well. Set in Northern Ireland, the film is a critical look at the response by the British government and military to the IRA. Not only is the response brutal and deadly, the so-called threat the IRA poses to order and stability is capitalized on by Tory political masterminds in Margaret Thatcher's administration, as well as the CIA, in a devious attempt to permanently keep the progressive Labor opposition from ever taking power again. Directed by Ken Loach, the film has a noticeable political angle, though he holds a steady hand on the action and the investigation, with sharply written and acted interrogation scenes and meetings with reclusive IRA people, as well as bringing in the political elites, to make it fast moving and constantly interesting.",
         "\"Hidden Agenda\" - another in a long list of films about the conflict in Northern Ireland - focuses on the investigation by British detective Kerrigan (Cox) of the assassination of an American civil liberties investigator. The film gets down to business quickly as it shows the pervasive and deeply rooted divisive sentiments of Ireland with a straight forward, no frills approach and a whodunnit type plot. A well made location shoot with no frills, \"HA\" will most likely be appreciated by those with some understanding of the Irish conflict.",
         "Ken Loach is one of the greatest filmmakers in the world. This is one of his finest films. Journalist/police procedural combined, with terrific performances, esp. Brian Cox, Frances McDormand and Jim Norton. Cover-ups, intractable positions, a frightening police state in Belfast, a top-notch script, a fast moving story - my only quarrel with these films (The Constant Gardener and The Ghost Writer come quickly to mind) is their downbeat endings - I would prefer for positive endings, even if they are \"unrealistic\" at this time, it becomes demoralizing for the bad guys to win again and again in these type of films - we need to see the good guys winning because it can become a prophecy of getting people to think outside of their pre-programmed thinking (they are taught incorrectly). This movie is infuriating, which is what it should be. Definitely worth watching!!! (:",
         "Ken Loach has made a career out of directing movies about politically charged topics. A lot of his movies have addressed class issues in the United Kingdom, but he has also looked at foreign policy. One example is \"Hidden Agenda\", about an investigation into the murder of a human rights lawyer in Belfast. Loach not only indicts the British occupation, but also finds time to take a swipe at Margaret Thatcher's government.* While I was watching the movie I assumed that it was based on the murder of solicitor Pat Finucane. It turns out that the movie is a fictional story, but it still makes sure to show the sorts of things that had become commonplace in Northern Ireland. I read that Loach had the cast members meet with people who had gotten abused by British forces to give them an idea of what the movie was dealing with. Ken Loach also looked at Ireland in \"The Wind that Shakes the Barley\", about Ireland's war for independence in the early 20th century. Both movies take unflinching looks at what the English did to the Irish for over 800 years. To be certain, \"Hidden Agenda\" features a scene that should give people pause in the era of the so called war on terrorism: a man sings a song that has the line \"you take our land and call us terrorists for resisting\". I recommend the movie. Other movies focusing on Northern Ireland that I recommend are \"In the Name of the Father\", \"Bloody Sunday\" and \"Breakfast on Pluto\". *After Thatcher died, Loach proposed that her funeral should be privatized, since she would've wanted it that way.",
         "\"Hidden Agenda\" was an enjoyable political thriller. The story was a somewhat typical Irish against the bloody English set in the late 1980's. The strength of the movie was in the fine acting by Frances McDormand, as usual, Brian Cox and many others. The ending some may find unsatisfactory. It tends to be open ended. I thought it provided much speculation on what Frances McDormand would do. I also thought it to be true to life.",
         "Here's a film guaranteed to satisfy even the most demanding fan of political intrigue, following a massive conspiracy uncovered by a routine investigation into the death of an American civil liberties lawyer in Northern Ireland. Director Ken Loach makes no secret of his anti-occupation bias, but he also takes care to approach the subject with an eye for authenticity rarely seen outside the most unsparing documentary. This is strictly a no-frills thriller: tough, intelligent, complex and all too plausible, combining the best elements of a police procedural with all the compelling ambiguity of an espionage caper. The villains may be cardboard cutouts, and the conspiracy itself perhaps too deeply rooted in classic left-wing paranoia, but the real issue at stake is how otherwise honest defenders of law and order are forced to confront the truth, or not, as the case may be. Stewart Copland's unassuming music score adds just the right touch.",
         "Not top-drawer Ken Loach; the \"thriller\" elements are well-done, but the warmth and depth Loach brings to his working-class stories has no place here. There's a structural flaw in the script, too--it presents itself as a film about Northern Ireland but then jumps headlong into something equally involving but quite different. It is, all the same, a well-crafted, atmospheric film that never lacks excitement and raises some substantial issues. More importantly, the entire film is sadly prescient. The opening torture narratives could have been translated from accounts of Abu Ghraib prison. Change a couple of proper names and the scenery, and this would be the best film around on the U.S. occupation of Iraq. Even the second half of the story (no spoiler warning, so I give no details) rings truer and truer as time goes by. Richly deserves reissue."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Hemdale Film",
         "Initial (II)"
      ],
      "summaries": ["When an American human rights lawyer is assassinated in Belfast, it remains for the man's girlfriend, as well as a tough, no nonsense, police detective to find the truth... which they soon discover to be contained in an audio tape which the man had with him, exposing political manipulations at the highest levels of government. But such underlying agendas require careful considerations to avoid worse things than murder."],
      "budget": 0
   },
   "movielensId": 5175,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-11-21",
      "dvdReleaseDate": "2002-04-16",
      "directors": ["Ken Loach"],
      "runtime": 108,
      "movieId": 5175,
      "title": "Hidden Agenda",
      "mpaa": "R",
      "actors": [
         "Frances McDormand",
         "Brian Cox",
         "Brad Dourif",
         "Mai Zetterling",
         "Bernard Archard",
         "Michelle Fairley",
         "Maurice Roeves",
         "Jim Norton",
         "John Benfield",
         "Bernard Bloch",
         "Des McAleer",
         "Ian McElhinney",
         "Brian McCann",
         "Patrick Kavanagh",
         "John Keegan",
         "Oliver Maguire",
         "Robert Patterson",
         "Paul Moriarty"
      ],
      "imdbMovieId": "0099768",
      "originalTitle": "Hidden Agenda",
      "genres": [
         "Mystery",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "Vz_e09WBGl8",
         "Nz-7OpkRoMs"
      ],
      "plotSummary": "In Ireland, American lawyer Ingrid Jessner and her activist partner, Paul Sullivan, struggle to uncover atrocities committed by the British government against the Northern Irish during the \"Troubles.\" But when Sullivan is assassinated in the streets, Jessner teams up with Peter Kerrigan, a British investigator acting against the will of his own government, and struggles to uncover a conspiracy that may even implicate one of Kerrigan's colleagues.",
      "tmdbMovieId": 47869,
      "avgRating": 3.27049,
      "releaseYear": "1990",
      "numRatings": 61,
      "posterPath": "/tIZXy9tCxJwVi3BaQVVnN0FPAIo.jpg"
   }
}