{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "crime fighter",
            "id": 853
         },
         {
            "name": "superhero",
            "id": 9715
         }
      ],
      "imdb_id": "tt0080863",
      "video": false,
      "title": "Hero at Large",
      "recommendations": [
         47070,
         55950,
         24908,
         40772,
         21332,
         18517,
         20545,
         11403,
         1793,
         15513,
         52741,
         24073,
         17175,
         38554,
         23943,
         45675,
         32274,
         21879
      ],
      "backdrop_path": "/2wFUR6kz2ZKoqHwU1pJNXwfNFs9.jpg",
      "revenue": 15934737,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Steve Nichols",
               "gender": 2,
               "credit_id": "52fe4670c3a36847f80ff3d3",
               "name": "John Ritter",
               "profile_path": "/2WIkWe5UASXpZgLQ1pMTtHNJKJX.jpg",
               "id": 27772,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "J. Marsh",
               "gender": 1,
               "credit_id": "52fe4670c3a36847f80ff3e3",
               "name": "Anne Archer",
               "profile_path": "/1dEu7fqOSogHivUjnXRFnnaOJNR.jpg",
               "id": 10427,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Walter Reeves",
               "gender": 2,
               "credit_id": "52fe4670c3a36847f80ff3e7",
               "name": "Bert Convy",
               "profile_path": "/56uVr94mVcQbYHCmmEDUB1UJFo9.jpg",
               "id": 40401,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Calvin Donnelly",
               "gender": 2,
               "credit_id": "52fe4671c3a36847f80ff3eb",
               "name": "Kevin McCarthy",
               "profile_path": "/kNEsGIBVMsKXB8qN6W2pFt4Wh8S.jpg",
               "id": 34597,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "2nd Teenager",
               "gender": 2,
               "credit_id": "594599b49251413fc2016361",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4670c3a36847f80ff3d9",
               "name": "Martin Davidson",
               "profile_path": "/ktW24P562eETSImtgeabVBVHG0m.jpg",
               "id": 89373,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4670c3a36847f80ff3df",
               "name": "AJ Carothers",
               "profile_path": null,
               "id": 37877,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.56926,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44004,
      "vote_count": 12,
      "budget": 0,
      "overview": "An idealistic but struggling actor finds his life unexpectedly complicated when he stops a robbery while wearing the costume of Captain Avenger, a superhero character of a film he is hired to to promote. He decides to dabble at being a superhero only to find that it is more difficult and dangerous than he ever imagined.",
      "similar": [
         155,
         364,
         1924,
         272,
         1452,
         268,
         49026,
         415,
         8536,
         9531,
         40662,
         13640,
         414,
         141052,
         49521,
         209112,
         297762,
         17074,
         30061,
         382322
      ],
      "original_title": "Hero at Large",
      "runtime": 98,
      "poster_path": "/hTIXWjZwWQlAhB3uEVoF3ytWilD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kings Road Entertainment",
            "id": 4255,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1980-02-08",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Help is on the way!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martin Davidson"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["AJ Carothers"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080863/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NjYyNzI3N15BMl5BanBnXkFtZTcwNDYyMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Ritter, Anne Archer, Bert Convy | See full cast and crew »"],
      "reviews": [
         "This role is one of Ritters' best performances in a highly acclaimed career. His portrayal of a really nice and well-meaning guy, who has to make a tough ethical decision to help him pay his bills, is thoughtful and funny at the same time without being over-the-top Jack Tripper funny. Ritter and the Director give a great real-world look at super-heroes. How does he get to crime scenes? Can he dodge bullets? Where does a super hero get medical attention? In a way it's sort of a misnomer to call him a super hero since he doesn't actually have any super powers, but his willingness to put himself in danger to help others is the core value that all super heroes must have. The fact that he goes out and tries to stop crimes anyway, without super powers, makes him even more courageous than a true comic book hero in a way. Before movies like Unbreakable and Spiderman came along I called this movie the best super hero movie ever made. No special effects other than a few fires. No flying through the air. Just a real guy showing that courage and caring are what's really important. One of the best feel-good endings of any movie ever made.",
         "I love this movie. John Ritter portrays a classic good guy. - He's a struggling actor who was wearing a Captain Avenger costume to promote its film along with over 20 other actors throughout New york City. After doing the promotion, He was still wearing the costume under his coat while a shopping at a corner grocery store when it gets robbed. He removes his coat and prevents the robbery. The media gets word of a person wearing a Captain Avenger costume stopping a crime and wonders if he will reappear. John Ritter's character feels good about what he did and decides he wants to more. He prevents another crime and gets injured. He also gets locked out of his apartment for not paying his rent, so woman across the hall to gives him a place to stay while he heals. Politics get involved before the suspenseful ending -- This is a feel good movie with romance and a great suspenseful ending.",
         "John Ritter playes a real life costumed hero. This movie starts out a little slow but gets better quickly. This is a wonderful romantic adventure film about caring and helping others. It also has possibly the best ending to any movie.",
         "John Ritter is charming in his role as Steve Nichols. This movie is great, a cute comedy/drama that is sure to win your heart. John's character's charm is reminiscent of that of Jack Tripper. The character of Steve Nichols is sure to capture your heart while the story itself leaves a good feelings. Comical yet there's some real feeling in it. A story about a wannabe actor turned hero, what's better than that. I was a little worried about the whole Captain Avenger thing but its played out very well. And there are some very funny moments in this movie. Definitely a good movie to watch on a rainy day! And if you have seen it, but not in a long time, it's worth picking up again!",
         "Those three words alone summarize the heroic spirit in all of us, and that is what this movie is really about. Those of you who have seen the film know what I am talking about. Those of you who have not, for God's sake, go buy it and see if the moment when Gerry Black speaks those three words don't move you to tears. In so many ways, those words are a precursor to the words of real life heroes when on the darkest of days the bravest among us demonstrated their American spirit with the words, \"Let's roll!\" Yes, this is a great John Ritter movie, but as the other famous line in the movie declares, \"It does not matter who it is.\" Watch it! And believe!",
         "A 2 bit actor turns his part time job of hyping a movie into becoming a public defender, of sorts. His daring exploits unite the community and provide the mayor with a political boost. Plus, the hero finds love along the way. Nice, easy little production.",
         "John Ritter plays a starving actor, whom is signed to portray a movie superhero at a theater promotion. On the way home, while dressed in costume, he foils a robbery. Discovering he enjoys helping to protect people, Ritter begins fighting crime dressed as the costumed superhero. Ann Archer does a wonderful job as Ritter's love interest. Bert Convey is suitably oily as the PR man who uses Ritter for his own personal gain. The movie has a great, rousing score, and a genuinely poignant climax. A worthy view",
         "There's a lot going on with \"Hero At Large.\" Notably, this is a film that was, for the bulk of it, made on location in NYC, circa 1979. That fact alone would be enough to recommend it, because it gives you a glimpse into what the city was about at that time, how it looked, what was playing at local movie houses and on Broadway, and what was important to its residents. But this film goes well beyond the basics of the setting. And that's due to a meaningful script by A.J. Carothers and a truly remarkable performance by John Ritter. In some ways, Ritter's character here is in a similar situation to Dustin Hoffman's character in 1982's \"Tootsie.\" He plays an out of work actor who is desperate to get a part in a play, or even a commercial just to make the rent. When he books the role of Captain Avenger, a comic book hero who is the star of a cheesy live action film, he's not the motion picture actor, he's the stooge signing 8 x 10s outside of the theater dressed in the character's costume, one of dozens of actors playing the part all over town! But on the way home from his gig, when his local grocer gets held up at knife-point, he uses that costume to thwart the street toughs and saves the day! His interest in his next door neighbor, J. (Anne Archer) helps to fuel his heroics, and he finds himself starting to take chances to help people and win her attention and affection, and to make a statement about what's really important. A surprise is Bert Convy, who was known for his \"nice guy\" image, here goes against type as the sleazy PR manager, who was in charge of both the Captain Avenger film and the Mayoral Campaign of the incumbent, who sees a way of tying the two together, based on the genuine heroics of the actor, that regular guy trying to make people think about a bigger idea(l). This is a New York movie, through and through, but it's the heart of the film that makes it special and that's due to John Ritter. His performance is always genuine, never hits a wrong note and is a tribute to the actor himself. It's those elements that take this film to soaring heights! Plus there are cameos by some of the city's longtime television reporters: Who knew that Penny Crone had brown hair at one time? Hero At Large may not be the greatest superhero film ever, but it's better than many that are longer on special effects and much shorter on story.",
         "You might want to compare this film with a film called Hero, staring Dustin Hoffman. Both films are about ordinary people who perform extraordinary actions, thereby becoming \"heroes\". In Hoffman's film the main character is a sleaze who's philosophy is do unto other before they get a chance to do unto you. Ritter, on the other hand is a nice guy who is seduced by the glory of being heroic. Hoffman spends most of the movie trying to avoid recognition for his heroic acts while Ritter becomes caught up in a scheme to capitalize on people's need for heroes. Both men's lives are held up as evidence that all of us have the capacity to be a hero under the right circumstances. Both films are inspiring with important things to say. Hero At Large however is a small film while Hero is a big budget film with major actors. I thoroughly enjoyed both but by comparison, Hero beats you over the head with its message. I can't help liking Hero At Large just a little better.",
         "This is a movie that was perfect for John Ritter. He plays Steve Nicoles, a nice guy who becomes a fantasy super hero. Fantasy because, he has no super powers, he has no super weapons, he fights no super villains. He doesn't even own his super-suit. What isn't fantasy is the hero part. He does want to save people and do good. Nicoles desire to do good usurps his ability to earn a living or pay his rent, causing him problems in the long run. His deeds go viral in the media and he falls victim to others with political ambitions. Don't expect car chases, exciting CGI, fast-paced banter, just enjoy a simple, entertaining movie."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Kings Road Entertainment",
         "Metro-Goldwyn-Mayer (MGM)"
      ],
      "summaries": ["An idealistic but struggling actor finds his life unexpectedly complicated when he stops a robbery while wearing the costume of Captain Avenger, a superhero character of a film he is hired to to promote. He decides to dabble at being a superhero only to find that it is more difficult and dangerous than he ever imagined."],
      "budget": 0
   },
   "movielensId": 5185,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-02-08",
      "dvdReleaseDate": "2005-08-30",
      "directors": ["Martin Davidson"],
      "runtime": 98,
      "movieId": 5185,
      "title": "Hero at Large",
      "mpaa": "PG",
      "actors": [
         "John Ritter",
         "Anne Archer",
         "Bert Convy",
         "Kevin McCarthy",
         "Kevin Bacon"
      ],
      "imdbMovieId": "0080863",
      "originalTitle": "Hero at Large",
      "genres": [
         "Action",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["75EXgcE3EMs"],
      "plotSummary": "An idealistic but struggling actor finds his life unexpectedly complicated when he stops a robbery while wearing the costume of Captain Avenger, a superhero character of a film he is hired to to promote. He decides to dabble at being a superhero only to find that it is more difficult and dangerous than he ever imagined.",
      "tmdbMovieId": 44004,
      "avgRating": 2.65254,
      "releaseYear": "1980",
      "numRatings": 59,
      "posterPath": "/hTIXWjZwWQlAhB3uEVoF3ytWilD.jpg"
   }
}