{
   "tmdb": {
      "original_language": "fa",
      "keywords": [{
         "name": "family drama",
         "id": 12279
      }],
      "imdb_id": "tt0152438",
      "video": false,
      "title": "The Silence",
      "recommendations": [
         47100,
         80098,
         164328,
         128042,
         48601
      ],
      "backdrop_path": "/wZbM6kq8n4OmAUOP5QctciardzZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Khorshid",
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fec9b",
               "name": "Tahmineh Normatova",
               "profile_path": null,
               "id": 588858,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Nadareh",
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fec9f",
               "name": "Nadereh Abdelahyeva",
               "profile_path": null,
               "id": 588859,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Khorshid's Mother",
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80feca3",
               "name": "Goibibi Ziadolahyeva",
               "profile_path": null,
               "id": 588860,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fec91",
               "name": "Mohsen Makhmalbaf",
               "profile_path": "/pkPhuxSyPBmiVKcPZgrUXc9i41H.jpg",
               "id": 120226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fec97",
               "name": "Mohsen Makhmalbaf",
               "profile_path": "/pkPhuxSyPBmiVKcPZgrUXc9i41H.jpg",
               "id": 120226,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59035dcdc3a3683bb80003be",
               "name": "Ebrahim Ghafori",
               "profile_path": null,
               "id": 20033,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "59035de892514177fb00042d",
               "name": "Marin Karmitz",
               "profile_path": "/t9KgqeBerwxwnSkvkvlapJ8gcSS.jpg",
               "id": 1134,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.418949,
      "production_countries": [
         {
            "iso_3166_1": "IR",
            "name": "Iran"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "TJ",
            "name": "Tajikistan"
         }
      ],
      "id": 43974,
      "vote_count": 5,
      "budget": 0,
      "overview": "Khorshid lives with his mom in a house near a river somewhere in Tajikistan. Th landlord comes around every morning to ask for the rent. Khorshid has to provide the money or else they'll have to leave. His blindness has given him an amazing skill in tuning musical instruments which gets him a job at an instrument making workshop. But the problem is That Khorshid is mesmerized by sonorous music all the time; whenever he hears a great musician play, he loses track of time and place. For this, he always gets lost and gets to work late. How is he going to make a balance between his love of music and his task as a breadwinner?",
      "similar": [
         263281,
         36691,
         326198,
         460571,
         220620,
         44972,
         507839,
         366104,
         62972,
         387536,
         193473,
         125360,
         62975,
         295712,
         213914,
         15913,
         241180,
         223365,
         47089,
         505192
      ],
      "original_title": "سکوت",
      "runtime": 76,
      "poster_path": "/of8W0b6hkyGLkD3SCjleAVcE9BK.jpg",
      "spoken_languages": [
         {
            "name": "فارسی",
            "iso_639_1": "fa"
         },
         {
            "name": "",
            "iso_639_1": "tg"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Makhmalbaf Productions",
            "id": 54377,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MK2 Productions",
            "id": 6274,
            "origin_country": "FR"
         }
      ],
      "release_date": "1998-09-06",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mohsen Makhmalbaf"],
      "runtime": 76,
      "synopsis": null,
      "writers": ["Mohsen Makhmalbaf"],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0152438/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTQ4MDUwMTE3MF5BMl5BanBnXkFtZTcwMzY0OTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tahmineh Normatova, Nadereh Abdelahyeva, Goibibi Ziadolahyeva | See full cast and crew »"],
      "reviews": [
         "\"The Silence\" is not an ordinary movie even though it looks simple. It is the story of a blind boy Hursit who is trying to make both his and mother's living by tuning instruments in local traditional instrument shop.His father has apparently left his family to Russia and Hursit and the mother is having a hard time because they can't pay the rent and they are faced with the dancer of being thrown to the street. The movie uses Beethoven's 5th Symphony in the final scene. The scenery of bazaars,the local imagery of an Eastern town,the local instrument builders and vendors add so much to the atmosphere to the movie. And a little note for those who have just recognized the Iranian movie..Before the Islamic revolution in Iran, the director of the movie was a political activist and because of that he was jailed for more than 4 years, and was let out of jail only after the revolution. After the revolution he abandoned politics, because he had believed that the chief problem in Iran was the cultural one. The movie was also banned in Iran.If you like simple real stories about real life I suggest you see the movie.",
         "A little blind Tajik boy each day comes late to his job. The reason is his joy of life: The voice of around. He likes to listen to the music of nature, he likes to be as other people to see it. Unfortunately it costs high in his life. He loses his job, just because he loves music. The owner of the house where boy and his mother live tell them to free the apartment and they remain without anything. But boy continues to enjoy the life... The movie makes hearts ache. The song which I liked in this movie so much was \"Charo hargiz namepursi?\" (Why you never ask?) of Daler Nazarov which performed very well by Oleg Fezov. I recommend this movie to watch for all those who love the life!",
         "Subtitled in English, this story of a 10-year old blind boy's experiences is visually and aurally intertwined. Filled with striking scenes and hypnotic music, the production is unique and riveting. The camera wanders through the bazaars and shops of Tajikistan providing a glimpse into a culture not well known to Westerners. The interplay between the boy and the beautiful young woman who acts as his eyes is touching, filled with humor, and played with a simple elegance. The distractions encountered by the boy on his way from home to work are a delight. Supporting roles are well played. The harmonies of the music, the city, and everyday life produce a funny and profound film well worth watching.",
         "The boy Khorshid has to earn a living tuning instruments. He's blind. He does an excellent job, but his boss doesn't think so. Khorshid's mother won't be able to pay the rent if her son gets fired. What can be done? This film both shows the hard life of a blind boy and his mother in Azerbaijan as well as beautiful images -- and lots of music, of course! if you wanna hear Beethoven's 5th, recently spiced up inna hip hop stylee by A+, in a Oriental style, then you gotta check out this beautiful film by Iran's leading filmmaker Mohsen Mahmalbaf. Additionally, _Sokhout_ is social commentary both on life in Eastern countries as well as the relationship between East and West...it is not a coincidence that Makhmalbaf chose Beethoven instead of Classical Persian music.",
         "This is simply the most beautiful movie I've ever seen. It revitalized all my senses. It helps to have some information about the cultural background of the movie. The fact that it takes place in Tajikistan an X-soviet republic, of Iranian ethnicity and Persian language etc.",
         "I saw this film when it was released, more than a decade ago, and I haven't seen it since. So I don't recall all the details. Directed by the famous Iranian filmmaker Mohsen Makhmalbaf, the movie is set in the little known republic of Tajikistan. A former Soviet republic in Central Asia, Tajikistan became independent in 1991 and suffered greatly from poverty and civil war in the first years of independence (in one moving scene in the film, an elderly Russian resident of Tajikistan laments, to the point of almost crying, his economic troubles). The Tajiks are ethnically very close to the Iranians; some say that the Tajik language is just a dialect of Farsi. As shown in the film, Tajikistan seems almost frozen in time, while the movie is set in the late 1990s, a lot of the buildings and cars seem to belong to perhaps the 1950s or 1960s, the floor of most of the houses seems to be made of earth, and the factory where part of the action takes place has an abacus and an old telephone line, but not a computer (I hope that in the time since this film was made, Tajikistan has modernized a bit). The busy bazaars and narrow alleys add to the feeling of a strange place to a western viewer. The protagonist is a blind 10 year old boy, who relates to the world through sounds (the first chords of Beethoven's fifth symphony are a motif throughout the film). Coming from a very poor family, he works in a dilapidated factory tuning the instruments made there (I suppose being blind makes him more able to concentrate on the sounds). A beautiful little girl, who wears tresses and dresses in traditional multicolored Tajik clothes, seems to be his only friend. There is not much else in the movie in terms of action, I suppose that to appreciate this film you just have to sit back and enjoy what you are seeing. The amazingly beautiful color photography certainly helps. It is a poetic movie, but in a good way, unlike in other art movies, this film never feels forced or pretentious."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Makhmalbaf Productions",
         "MK2 Productions"
      ],
      "summaries": [
         "Because of his special gift in identifying objects by the sounds they make, a blind young boy is employed as a string instrument tuner in a small village in Tajikistan. He may be blind but that does not mean he cannot see. On his way to work, he could tell the quality of the bread the young girls along the streets are peddling by simply touching their ware. His world is made more colorful and quaint because of his sensitivity to his surroundings. The only problem is that he is easily \"tempted\" by street musicians' performances and arrives late at work.",
         "Everyday, 10-year old Khorsid takes the bus to his work at an instrument maker's shop and everyday something unexpected happens."
      ],
      "budget": 0
   },
   "movielensId": 52106,
   "movielens": {
      "languages": [
         "فارسی",
         ""
      ],
      "releaseDate": "1998-09-06",
      "dvdReleaseDate": "2005-07-19",
      "directors": ["Mohsen Makhmalbaf"],
      "runtime": 76,
      "movieId": 52106,
      "title": "The Silence",
      "mpaa": "",
      "actors": [
         "Tahmineh Normatova",
         "Nadereh Abdelahyeva",
         "Goibibi Ziadolahyeva"
      ],
      "imdbMovieId": "0152438",
      "originalTitle": "سکوت",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Khorshid lives with his mom in a house near a river somewhere in Tajikistan. Th landlord comes around every morning to ask for the rent. Khorshid has to provide the money or else they'll have to leave. His blindness has given him an amazing skill in tuning musical instruments which gets him a job at an instrument making workshop. But the problem is That Khorshid is mesmerized by sonorous music all the time; whenever he hears a great musician play, he loses track of time and place. For this, he always gets lost and gets to work late. How is he going to make a balance between his love of music and his task as a breadwinner?",
      "tmdbMovieId": 43974,
      "avgRating": 3.5,
      "releaseYear": "1998",
      "numRatings": 6,
      "posterPath": "/of8W0b6hkyGLkD3SCjleAVcE9BK.jpg"
   }
}