{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay interest",
            "id": 10199
         },
         {
            "name": "wedding",
            "id": 13027
         }
      ],
      "imdb_id": "tt0125209",
      "video": false,
      "title": "I Think I Do",
      "recommendations": [
         27152,
         171229,
         49113,
         47619,
         177656,
         191476,
         158875,
         160368,
         41425,
         287855,
         70993,
         47643,
         22597,
         44497,
         201277,
         27440,
         330007
      ],
      "backdrop_path": "/5F7i24oaDfPs1fNrjQy7KZ3YJpW.jpg",
      "revenue": 344,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bob",
               "gender": 1,
               "credit_id": "52fe47f19251416c750aa987",
               "name": "Alexis Arquette",
               "profile_path": "/jNRBwGKXOZFWLI2ceff1sMUdxcE.jpg",
               "id": 19578,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sterling Scott",
               "gender": 2,
               "credit_id": "52fe47f19251416c750aa98b",
               "name": "Tuc Watkins",
               "profile_path": "/Av09pU4RA6hpDd0qyLUf6x45xTm.jpg",
               "id": 157942,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Aunt Alice",
               "gender": 1,
               "credit_id": "58cdd8bc9251415a3d013ca9",
               "name": "Marni Nixon",
               "profile_path": "/hPWlkETSB5V7OQkixZic3QDxmwq.jpg",
               "id": 187678,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Eric",
               "gender": 2,
               "credit_id": "545de750c3a368535d005ea4",
               "name": "Guillermo Díaz",
               "profile_path": "/hnWjRRud2n2rDI6NbaeSIeEOMcP.jpg",
               "id": 8695,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Carol",
               "gender": 1,
               "credit_id": "52fe47f19251416c750aa993",
               "name": "Lauren Vélez",
               "profile_path": "/xZiNlLg9E2zgRSewE1BeWUlaqYO.jpg",
               "id": 141610,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Beth",
               "gender": 1,
               "credit_id": "58cdd8d99251415a61014203",
               "name": "Maddie Corman",
               "profile_path": "/358wSv3l3FPhNTcpcalQvRVXQB4.jpg",
               "id": 121757,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Brendan",
               "gender": 0,
               "credit_id": "52fe47f19251416c750aa98f",
               "name": "Christian Maelen",
               "profile_path": "/kX5xRBMuVbDRCukWBk2XdrNw8h8.jpg",
               "id": 217510,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "58cdd91ec3a368508c01304e",
               "name": "Marianne Hagan",
               "profile_path": null,
               "id": 67838,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Celia",
               "gender": 1,
               "credit_id": "58e2fc92c3a36872f601510a",
               "name": "Elizabeth Rodriguez",
               "profile_path": "/lwJXQ7DDRY9W4pdzQzJKdeKuCFl.jpg",
               "id": 65421,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47f19251416c750aa99d",
               "name": "Brian Sloan",
               "profile_path": null,
               "id": 1066114,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47f19251416c750aa9a3",
               "name": "Brian Sloan",
               "profile_path": null,
               "id": 1066115,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.659521,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19797,
      "vote_count": 8,
      "budget": 0,
      "overview": "A screwball comedy about a gay couple at a straight couple's wedding.",
      "similar": [
         47643,
         26933,
         52799,
         413666,
         449176,
         322127,
         184352,
         428493,
         712,
         119675,
         340684,
         222918,
         380874,
         398818,
         261776,
         6557,
         26280,
         258480,
         258034,
         50124
      ],
      "original_title": "I Think I Do",
      "runtime": 90,
      "poster_path": "/8e24ZEGyZyhiolINokp5AjExsO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Danger Filmworks",
         "id": 65658,
         "origin_country": ""
      }],
      "release_date": "1998-04-10",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian Sloan"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Brian Sloan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0125209/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQyMjcwODIyOV5BMl5BanBnXkFtZTcwMjY0NDcxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Alexis Arquette, Christian Maelen, Lauren Vélez | See full cast and crew »"],
      "reviews": [
         "\"I Think I Do\" is a wonderful comedy drama about a group of college friends who are in search of love and stability. The film focuses on the complicated situation between two male roommates, who consealed their affection for each other even years after graduation. When two of the clique (boy/girl) get married, everyone reunites and gets to evaluate their own (mostly pitiful) love-life on the wedding day. From the parents of the bride (who have nothing to say to each other) to over-the-top relatives, everyone has their two cents to add, in order for \"the young ones\" to have a wonderful life. Offering laughs every minute, this film entertains throughout, climaxing with a story-book ending. The Sound Track, consisting of Partridge Family songs, is an added touch of class. Still considered \"progressive\", the film deals with the subject of homosexuality in the matter-of-fact kind of way that it should have been dealt with all along. There was no mention made at all of the fact that the bride and groom were an inter-racial couple; again, something that rightfully was treated without any big words of explanation. We've come a long way, but occasional \"outrage\" at films such as this one shows that we haven't arrived yet.",
         "This is just so charming. It's funny and sprightly and very feel-good. After decades of providing anonymous musical vocals for Hollywood actors, Marni Nixon gets an engaging supporting role here as Aunt Alice. Somehow, that's just so right for this movie. I also especially liked Lauren Velez as Carol and Tuc Watkins as Sterling, but all the actors did a fine job (some of them aren't bad looking either). What really strikes a chord with me, though, is its wish-fulfillment. This film is the ultimate revenge fantasy of anyone who's ever seen - or been - a gay man cruelly disdained by some gorgeous heterosexual object of desire. It revels in poor repentant Brendan's predicament...but it does it in the sweetest, most adoring way possible. I saw this at our local art academy, where it was apparently brought back by popular demand. The audience was laughing and hooting throughout more than for any other movie I've seen. I was as gleeful as the rest of them.",
         "A hugely enjoyable film, for gay men and all others too. It will have you on the edge of your seat to see if he does or doesn't. Some memorable one liners, and some excellent acting, this has to be up there with Beautiful Thing as an absolute essential for all gay men's dvd collections. Its all handled exceptionally well, with some hilarious set pieces. I'd recommend this to anyone as a real feel good movie, but not one that over does the sentimentality- get it now!!",
         "I like this film and was pleasantly surprised when I saw it a few years ago. Another movie I'd like to own but it's not on DVD. Why!? This is well written story about friends and being gay and trying to deal with it. I recommend this to everyone",
         "It's really too bad this film didn't get a big theatrical push. It's one of the breeziest, most enjoyable 'fluff' movies I have seen in a long time. I have had straight and gay friends equally enjoy it. The best thing about it is Tuc Watkins. His performance as the slightly dim soap star was excellent. Really, he truly deserved recognition for this fine supporting performance. The rest of the cast does great too--and the script is funny and sexy. Definitely recommended!",
         "\"I Think I Do\" has been on my mind since I saw it! It is absolutely the best feel-good movie I've ever seen...beautiful cast...fun story...to be honest, I cried! Some may call it superficial...not true! I can imagine a story like that happening everyday! It's the stuff dreams are made of!",
         "This movie is a total riot. I enjoyed the cast as an ensemble. Tuc Watkins is outstanding as the aging Soap Star, and Patricia Mauceri (who co-starred with Watkins on One Life to Live) is a total delight. The ending is a little fantasy like, but who cares, I had a great time watching it - and you will too!",
         "This is my favorite gay film. I wouldn't say its the best - Beautiful Thing or Boys In the Band - I believe have that honor, but its non stop entertainment from the first scene to the last. Alexis Arquette is brilliant as always and Tuc Watkins is a perfect supporting player for Arquette. The other actors hold their own as well. Guaranteed to please almost any audience.",
         "Geeky gay-boy ends up pursued by hunks in this gay wish-fulfillment romantic indie comedy. Which handsome dreamboat will he pick? Decisions decisions... Initially set among a group of affluent proto-yuppie college students carousing in Washington DC; then shifts to their lives about 5 years later, as they reassemble for the wedding of one of the group. Hunky Christian Maelen is more than competent in his co-starring role, and I'm suprised that he hasn't done more work in features. He has that ol' straight-guy appeal which many gay men will find irresistable. A similar film is the British \"Bedrooms and Hallways\" (1998).",
         "The annual gay romantic comedy for 1997, \"I Think I Do\" has some very clever moments. The characters are a bit broadly drawn but are still believable, and the plot stretches credibility a bit but still manages to work. The best moment, however, happened offscreen. At one point, one character consoles another by saying, \"You're trying to hard. If you just stop looking, the right guy will come along.\" To which someone in the audience yelled, \"IT'S NOT TRUE!!!!!!!!!\""
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Danger Filmworks",
         "House of Pain Productions",
         "Sauce Productions"
      ],
      "summaries": [
         "Screwball comedy with a modern twist; instead of Kate Hepburn and Cary Grant, it's Cary Grant and Jimmy Stewart. Two college roommates (victims of a mutually unrequited love) meet up again five years after school at their housemate's wedding. With the introduction of a Bellamy-esque soap star, the sparks, sexual and verbal, start to fly, as the ex-roommates try to navigate their new romance.",
         "A screwball comedy about a gay couple at a straight couple's wedding."
      ],
      "budget": 0
   },
   "movielensId": 5229,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-04-10",
      "dvdReleaseDate": "2002-03-05",
      "directors": ["Brian Sloan"],
      "runtime": 90,
      "movieId": 5229,
      "title": "I Think I Do",
      "mpaa": "",
      "actors": [
         "Alexis Arquette",
         "Tuc Watkins",
         "Marni Nixon",
         "Guillermo Díaz",
         "Lauren Vélez",
         "Maddie Corman",
         "Christian Maelen",
         "Marianne Hagan",
         "Elizabeth Rodriguez"
      ],
      "imdbMovieId": "0125209",
      "originalTitle": "I Think I Do",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A screwball comedy about a gay couple at a straight couple's wedding.",
      "tmdbMovieId": 19797,
      "avgRating": 3.14516,
      "releaseYear": "1998",
      "numRatings": 31,
      "posterPath": "/8e24ZEGyZyhiolINokp5AjExsO.jpg"
   }
}