{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "map",
            "id": 1969
         },
         {
            "name": "ship",
            "id": 3799
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "alaska",
            "id": 9880
         },
         {
            "name": "vaudeville",
            "id": 157768
         }
      ],
      "imdb_id": "tt0038032",
      "video": false,
      "title": "Road to Utopia",
      "recommendations": [
         31805,
         48276,
         210972,
         115039,
         147603,
         162749,
         100299,
         79720,
         34712,
         49455,
         148905,
         128753,
         48698,
         234817,
         100307,
         100318,
         151447,
         105560,
         145948,
         146784
      ],
      "backdrop_path": "/rbeb4SFz0OnahsoNFJsmClQncJL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Duke Johnson",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d41b",
               "name": "Bing Crosby",
               "profile_path": "/sKD1GauhPSBDIuVc9wrcNj9a9Wq.jpg",
               "id": 24937,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chester Hooton",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d41f",
               "name": "Bob Hope",
               "profile_path": "/i8F9oShrgTTLuYnVCAmmFAqRmeR.jpg",
               "id": 82388,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sal Van Hoyden",
               "gender": 1,
               "credit_id": "52fe45c2c3a368484e06d429",
               "name": "Dorothy Lamour",
               "profile_path": "/7H76LKezXlQala1wGW0iVU8qHDF.jpg",
               "id": 83400,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe45c2c3a368484e06d42d",
               "name": "Hillary Brooke",
               "profile_path": "/vsT0YQb3LSBH4nkUiWjx1ogSIXM.jpg",
               "id": 8241,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ace Larson",
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d431",
               "name": "Douglass Dumbrille",
               "profile_path": "/ggD9NRWlRDofqVhVR6XaTHvLhp4.jpg",
               "id": 34748,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "LeBec",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d435",
               "name": "Jack La Rue",
               "profile_path": "/hWOwpkNevqBwp2mrjMCrLrxvPsi.jpg",
               "id": 99347,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Sperry",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d439",
               "name": "Robert Barrat",
               "profile_path": "/hP59p1hbbBizWea0ayGoCXjY8r5.jpg",
               "id": 88672,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "McGurk",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d43d",
               "name": "Nestor Paiva",
               "profile_path": "/9QB3l3jN6npImyMvCHKWTMd7H8Y.jpg",
               "id": 56924,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d441",
               "name": "Robert Benchley",
               "profile_path": "/7G3QCdDKHmm265vuXQQvEip2BcT.jpg",
               "id": 94433,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d425",
               "name": "Hal Walker",
               "profile_path": null,
               "id": 102601,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d447",
               "name": "Norman Panama",
               "profile_path": null,
               "id": 50577,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d44d",
               "name": "Melvin Frank",
               "profile_path": null,
               "id": 50567,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d453",
               "name": "Paul Jones",
               "profile_path": null,
               "id": 30251,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d459",
               "name": "Buddy G. DeSylva",
               "profile_path": null,
               "id": 14972,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d45f",
               "name": "Leigh Harline",
               "profile_path": "/cE6Wt8ZoGfDfXjVcUgsi4TRb8ls.jpg",
               "id": 5467,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d46b",
               "name": "Roland Anderson",
               "profile_path": null,
               "id": 47077,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d471",
               "name": "Hans Dreier",
               "profile_path": "/pyVz3McZwtOFOVjx3jSqawd45Zj.jpg",
               "id": 8622,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d477",
               "name": "George Sawley",
               "profile_path": null,
               "id": 31970,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe45c2c3a368484e06d47d",
               "name": "Edith Head",
               "profile_path": "/63ZeXQOh26sGa8nTbYWntieyWrz.jpg",
               "id": 4350,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "59c1a83192514176ad000ce9",
               "name": "Lionel Lindon",
               "profile_path": null,
               "id": 14726,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.297556,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29021,
      "vote_count": 13,
      "budget": 0,
      "overview": "Duke &amp; Chester on a ship to Skagway, Alaska, find a map to a secret gold mine, which had been stolen by thugs, McGurk &amp; Sperry. Meanwhile, Sal Van Hoyden is in Alaska to try and recover her fathers map. She falls in with Ace Larson, who wants to steal the gold mine for himself. Duke &amp; Chester, McGurk &amp; Sperry, Ace, his henchmen &amp; Sal, chase each other all over the countryside, all after the map.",
      "similar": [
         872,
         11970,
         810,
         812,
         11631,
         35,
         703,
         46195,
         166426,
         196867,
         134,
         18947,
         19404,
         194662,
         254470,
         353616,
         342473,
         354912,
         224141,
         313369
      ],
      "original_title": "Road to Utopia",
      "runtime": 90,
      "poster_path": "/nASL3unRBUDjAcJmE8HPjbL665M.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1946-02-27",
      "vote_average": 6.2,
      "belongs_to_collection": {
         "backdrop_path": "/mtC7UKAlECH3NlABg8mzmDqZi0F.jpg",
         "name": "Road to Collection",
         "id": 135441,
         "poster_path": "/t293kNZnkaeqnYCHPsDXh8ZLBeQ.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Hal Walker"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Norman Panama",
         "Melvin Frank"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038032/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNTk5MDMzM15BMl5BanBnXkFtZTcwNDU0MjMyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Bing Crosby, Bob Hope, Dorothy Lamour | See full cast and crew »"],
      "reviews": [
         "Road to Utopia was one of several films made during World War II and shown to GIs before reaching the civilian public. Saratoga Trunk and The Two Mrs. Carrolls are two other examples. We have some evidence for this statement. First and foremost Robert Benchley died a year before the film had it's premier at the New York Paramount on February 27, 1946. Benchley, noted humorist and sometime film actor, provided some off and on-screen narration for the Crosby and Hope monkeyshines. He was reputed to be a big fan of both and I think he just wanted in on the fun. Also, Crosby recorded most of the songs for Road to Utopia on July 17, July, 19 and December 8, 1944 at Decca studios. The song Personality wasn't recorded by him until January 16, 1946, however in the film, Dorothy Lamour sang it. It was worth the wait for the civilian public. By now the boys had the surreal nonsense down pat. Dorothy Lamour plays Skagway Sal who's father is murdered in the first minutes of the movie by killers Sperry and McGurk. Dotty beats it up to Alaska to look up Douglass Dumbrille, her dad's best friend for assistance. As Douglass Dumbrille invariably does in these films, he's looking for the goldmine her father left for himself. The killers take the next boat with the map that they stole from Dad in hand. But they don't reckon with the sharpie and the schnook who have stowed away on the boat to Alaska. Crosby and Hope steal the map and the killer's identity. The plot I've described so far could be a melodrama, but not in any film with the title beginning \"Road to......\" Between talking bears, talking fish, and a cameo appearance by Santa Claus the laughs come fast and furious. Jimmy Van Heusen and Johnny Burke wrote the songs for this surreal madcap and gave Dotty two songs, Would You and the aforementioned Personality. Crosby got his ballad, Welcome to My Dream, and a philosophical song, It's Anybody's Spring. The last one he sang on board on a ship talent contest with Hope accompanying him on the accordion. They lost to an organ grinder and a monkey which prompted Hope to comment on the next road trip he was bringing Sinatra. And Crosby and Hope sang Goodtime Charlie which didn't make it to vinyl and Put It There Pal probably the best known of the duets they sang together in the Road pictures. Lots of dated references in the lyrics there to Crosby's horses and their respective radio sponsors. But today's audiences would still enjoy it. One interesting fact was that the Catholic Legion of Decency a very powerful group in those days made objections to suggestive lyrics in Personality. Hard to believe in this day and age, but as another songwriter a generation later put it, \"the times, they are a changin'.\" Road picture references are sometimes dated, but the laughs are eternal.",
         "'Road to Utopia' is a musical comedy starring two performers who are caught up in a conquest to find gold in Alaska. 'Road to Utopia' is a highly entertaining film, and it's easy to get caught up in the adventure. Some of the comedy elements in the film are probably a little bit dated, but those that are not dated and still very funny and witty. (These include the narrator comments directed to films, the Paramount mountain, the talking animals, and the Santa figure emerging from the Alaskan landscape with gifts for Crosby and Hope). The music is also dated in terms of what traditional audiences enjoy today, but I still thought it was done very well and played an important part in the story. 'Road to Utopia' is enjoyable, and it is highly recommended. If you're tired of all the films made in the past 20-30 years, this is a gem.",
         "This is hardly an original insight, but anyone who dismisses Bob Hope as the tiresome, unfunny comic from those dreadful '60s 'comedies' he appeared in is missing out on a real national treasure - his films up to around 1952 are hysterically funny, and his ROAD entries with cohorts Crosby and Lamour are among the best of 'em. Hope, along with the brilliant Preston Sturges, had restored Paramount to the comedy throne they'd occupied in the early 30s; from the lavish budget and attention to period detail throughout UTOPIA, it's obvious that the studio was not ungrateful. For my money, ROAD TO UTOPIA is the funniest film he ever made (though there are half-a-dozen others close on its heels). As in all ROAD movies, the engine powering the vehicle was the lightning-quick banter between the two leads; Crosby smooth as snake-oil , Hope perpetually suspicious and cowardly. And with excellent reason, as no straight man ever victimized a foil the way Bing routinely does to Bob. ROAD movies always threaded their satires of B-movie plots (this one spoofing Robert W Service-style frozen-North melodrama) with plenty of topical humor, much of it capitalizing on the fans' awareness of the stars' personal foibles (Crosby's rivalry with Sinatra, his investments in thoroughbreds, Hope's disastrous box-office returns in LET'S FACE IT), and there's a goodly amount of what later generations referred to as 'breaking the fourth wall' ( they talk directly to the audience at varying points). What elevates UTOPIA over the others is the sky-high breezy confidence of everyone involved this go-around. The cast and crew, coming off ROAD TO MOROCCO, were on a roll and knew it and they ride that momentum for all it's worth, Hope's constant kibitzing particularly hilarious from start to finish. Der Bingle gets to groan a couple of subpar songs (as opposed to MOROCCO's highlights - 'Ho Hum' and 'Moonlight Becomes You' - this outing's 'It's Anybody's Spring' and 'Welcome To My Dream' are instantly forgettable) but the team's 'Put It There, Pal' is infectious fun and Miss Lamour's 'Personality' is sexy and sprightly. A further note on Lamour - she's luxuriously beautiful here, an ice-cream sundae with curves (why she's never ranked with the decade's top screen sirens is unfathomable: she's every bit the looker that Lake, Grable, Hayworth & Sheridan were, and a better singer besides). My apologies for not quoting any of the zingers from the script, but there are just too many of them to play favorites with. ROAD TO UTOPIA is well worth the effort it'll take you to track down; get cracking.",
         "If you need some laughs, this is a movie for you. I think this is the fourth of the \"Road\" pictures that Hope and Crosby made together. \"The Road to Rio\" was good, too, but the ones that followed demonstrated a flagging of inspiration. Here, they are the crew are at their best. The plot is screwball, as usual, and not worth spelling out. What counts are the songs, the gags, and the interplay between the three principals -- Hope, Crosby, and Dorothy Lamour. Most of the Road pictures had one or two songs which wound up on the pop charts. They were usually kind of pretty and unpretentious, \"easy listening\", to coin a phrase. (Oh, bring it back, sob!) \"Moonlight Becomes You,\" \"Personality,\" \"Welcome to My World.\" And Bing did most of the singing in his smooth baritone. Nothing more than proficient and pleasant to listen to, although he belonged to, I think, a peppy vocal trio in the early 1930s whose arrangements were kind of original. The gags were usually amusing, sometimes laugh-out-loud funny. There was, inevitably the occasional clunker but everything was so good natured that they are easily forgiven. The script was by Panama and Frank, but many of the jokes were improvised on the set by the actors. Hope also brought in some gags from his platoon of writers (he was a famous radio comedian at the time), giving some of them to Crosby and Lamour as well. There was a good deal of playing with the fourth wall and a lot of in jokes too. Some of these may be lost on modern viewers. Eg., Hope is driving Crosby along on a dog sled, and he raises his arms and says, \"Look Ma, no hands.\" \"Look Ma, no teeth,\" remarks Crosby. \"Please,\" says Hope, \"my sponsor.\" His radio sponsor was Pepsodent Toothpaste. The three principal actors play off each other well. Dorothy Lamour was an unpretentious actress of modest talents who never pretended to be anything else, although she provided a very nice frame to hang a sarong on. What I like most about the relationship between Hope and Crosby is the measured equality of their stupidity and greed. Hope wasn't really subordinate to Crosby. Everything Hope said and did was within the realm of human reality. He didn't have the flapping run or squeaky voice of Jerry Lewis. He didn't get slapped around like Lou Costello. He wasn't intellectually challenged. And Crosby was much more of a participant in the goings on than a straight man would be. He's hardly less gullible than Hope, and equally cowardly. When they're about to be boiled by cannibals or hanged by vigilantes, they trade wisecracks with one another. Crosby is the promoter and Hope is the stooge, but neither is superior to the others. This really is a relaxing ride. I spent a summer doing a sociological study of Scagway. The set gives a surprisingly good suggestion of what it still looks like. It's a dramatic place overlooked by a proud glacier the color of blue glass. And the kind of Wild West atmosphere the movie evokes isn't entirely fictional. People had names like \"Soapy Smith\".",
         "At the turn of the century two vaudeville performers Chester (Bob Hope) and Duke (Bing Crosby) go to Alaska to make their fortune.On the way they run in all kind of weird and funny stuff, like talking animals. Road to Utopia from 1946 is one of the 'Road' films with Hope and Crosby and it's very good.These two worked really good together.Bing Crosby (1903-1977) does a very fine job in the lead.Bob Hope was a very funny man.This great comedian passed away last July of pneumonia.He had turned a hundred years last May.He had a great life and a great career and all the fans of Bob will miss him very much.He was one of the kind. Dorothy Lamour (1914-1996) is brilliant as Sal van Hoyden.This movie is filled with great gags.I recommend it to all comedy lovers out there.",
         "The Road to Utopia, made in 1943 but not released until 1946, was the fourth in the successful 'Road To...' film series and the only film not to be named after a real location. Told in the form of a flashback with the made-up to be elderly Hope, Crosby and Lamour featured at both beginning and end, the story tells of two vaudevillians joining forces with a damsel in distress as they are chased through Alaska by a gang of crooks and two desperate murderers as they all try and find a lost goldmine. This entry seems to pick up where Road to Morocco left off, with the fourth wall well and truly pulled down as far as Hope was concerned, as he makes endless comments to the audience, lampooning his radio sponsors and the movie studio to which he was signed, and makes more than a couple of references to Mr. Crosby's falling popularity due to young usurper Sinatra. In fact Hope is at his best in this movie managing to cram more one-liners and jokes into one minute of screen time than most comedians manage to cram into an entire career. We are also faced with more talking animals, more anarchic mayhem and more wonderful songs. Bing sings 'It's Everybody's Spring' and the wonderful, 'Welcome to my Dreams' and Lamour croons the rather racy and risqué for its day 'Personality' Hope and Crosby sing 'Good Time Charlie' and 'Put it There' perhaps the song that best sums up their great screen partnership and friendship, with the lyrics to both verse and chorus berating and insulting the other, through which the friendship still shines through. Brilliant. However, how the ending got through the censor is beyond me, when the elderly Hope and Lamour introduce the elderly Crosby to their son. When the son turns out to be played by Bing himself and after a shifty and uncomfortable look from Lamour, Hope turns to camera and tells the audience in an equally shifty way, \"We adopted him!\" For 1946 that was proper raunch. Great plot, Great gags, Great Songs and Great Fun.",
         "Duke Johnson (Bing Crosby) and Chester Hooton (Bob Hope) are struggling entertainers down on their luck who travel to Alaska. Killers Sperry and McGurk steal a vital map showing the location of a gold mine. Our two heroes manage to obtain the map and decide to impersonate Sperry and McGurk which leads them into more trouble than they could ever have imagined. Along the way they meet saloon singer Sal Van Hoyden (Dorothy Lamour) and as usual both men compete for her charms. With Sperry and McGurk hot on their trail plus other assorted villains after them Hope and Crosby get into many tight corners but they still find time for some catchy songs along the way including \"Put It There Pal\" which is a typical Hope/Crosby kind of number and Dorothy Lamour puts over \"Personality\" with her usual flair. Of all seven of the \"Road\" pictures there are four which to me are outstanding and superior to any other comedy films from that same period. The \"Road\" films have certainly stood the test of time over the years and not become dated. My four favourites are the Roads to \"Morocco\", \"Utopia\", \"Rio\" and \"Bali\". Hope and Crosby worked well together as a team and in \"Road to Utopia\" reached new comedy heights. The film is very fast moving with gag following gag, talking animals, many hilarious comedy routines and situations, and even has Robert Benchley occasionally interrupting the proceedings to give an entertaining commentary on the film. The film is told in \"flashback\" and has a brilliant pay-off line at the end (one of the best in the entire \"Road\" series). Some favourite lines from the film: Bob Hope (to Bing Crosby): \"I didn't think there was one more way to get the cops after us but you found it!\". Hope (to Crosby): \"Next time I'll bring Sinatra!\". (When Crosby loses a talent contest on board ship). Hope (to Crosby): \"It may be a mountain to you but it's bread and butter to me\". Hope (to Douglass Dumbrille): \"I'll take a lemonade .... in a dirty glass!\". Hope (to audience): \"We adopted him!\". The \"Road\" films never won any Oscars but brought an enormous amount of pleasure to a lot of people during the 40's. Hope and Crosby were a great team and made seven \"Road\" films in total. They both had very successful careers separately in movies, television, radio and on the stage and were probably two of the biggest stars to come out of Hollywood in the thirties and forties. 10/10. Clive Roberts.",
         "Bob and Bing pal through this in their breezy manner, ably assisted by Dottie Lamour and especially the dry witty commentary of humorist Robert Benchley. Students of film and lovers of movies will appreciate the quality of the production, and rejoice in the knowledge that not everything funny was created after 1990.",
         "Oh this one is funny...haven't seen it since High school, years and years ago, but I remember it well...the seen where an aged couple-including Hope, talk about their son-and then in comes Bing Crosby(!!)-where Hope sez to the camera-'We adopted him!'...oh what a riot. And then there is the great scene where they are sledding, and the Paramount stars pop up over a mtn in the background...the constant lines about how, even when they're in trouble, 'Paramount won't let anything happen to us because we're under contract for another 4 pictures' or words to that effect...very funny stuff, Benchley's narration a hoot too. ***, this one is funny and to my thinking the best of the lot.",
         "Grab that fur hat and coat. ROAD TO UTOPIA is one of the seven lucrative and popular Crosby and Hope \"road\" pictures. Duke(Crosby)and Chester(Hope) are mistaken for two murderers, Sperry(Robert Barrat)and McGurk(Nestor Paiva),after boarding a boat to Alaska. Afterall there is gold in the Klondike and Duke and Chester just happen to find a map to a goldmine. The two vaudevillians have to squire the lovely 'Skagway Sal'(Dorothy Lamour)to become three million dollars richer. The usual quota of sight gags and one-liners. The humorous banter and snow covered scenery hold this comedy together. The brightest part of the film is when Sal performs her sassy song 'Personality'. Also in the cast: Douglas Dumbrille, Hillary Brooke and Jack La Rue. Can't really go wrong with Crosby, Hope and Lamour."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Musical"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["At the turn of the century, Duke and Chester, two vaudeville performers, go to Alaska to make their fortune. On the ship to Skagway, they find a map to a secret gold mine, which had been stolen by McGurk and Sperry, a couple of thugs. They disguise themselves as McGurk and Sperry to get off the ship. Meanwhile, Sal Van Hoyden is in Alaska to try and recover the map; it had been her father's. She falls in with Ace Larson, who wants to steal the gold mine for himself. Duke and Chester, McGurk and Sperry, Ace and his henchmen, and Sal, chase each other all over the countryside, trying to get the map."],
      "budget": 0
   },
   "movielensId": 5233,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1946-02-27",
      "dvdReleaseDate": "2002-03-05",
      "directors": ["Hal Walker"],
      "runtime": 90,
      "movieId": 5233,
      "title": "Road to Utopia",
      "mpaa": "",
      "actors": [
         "Bing Crosby",
         "Bob Hope",
         "Dorothy Lamour",
         "Hillary Brooke",
         "Douglass Dumbrille",
         "Jack La Rue",
         "Robert Barrat",
         "Nestor Paiva",
         "Robert Benchley"
      ],
      "imdbMovieId": "0038032",
      "originalTitle": "Road to Utopia",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["2wmQqUfgFbQ"],
      "plotSummary": "Duke &amp; Chester on a ship to Skagway, Alaska, find a map to a secret gold mine, which had been stolen by thugs, McGurk &amp; Sperry. Meanwhile, Sal Van Hoyden is in Alaska to try and recover her fathers map. She falls in with Ace Larson, who wants to steal the gold mine for himself. Duke &amp; Chester, McGurk &amp; Sperry, Ace, his henchmen &amp; Sal, chase each other all over the countryside, all after the map.",
      "tmdbMovieId": 29021,
      "avgRating": 3.55263,
      "releaseYear": "1946",
      "numRatings": 114,
      "posterPath": "/nASL3unRBUDjAcJmE8HPjbL665M.jpg"
   }
}