{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "punk rock",
            "id": 11053
         },
         {
            "name": "music band",
            "id": 41591
         }
      ],
      "imdb_id": "tt0081441",
      "video": false,
      "title": "Rude Boy",
      "recommendations": [
         34328,
         34787,
         46781
      ],
      "backdrop_path": "/mYJUTx71C6XQt3ukqHQMS1sFnuZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Rhythm Guitarist",
               "gender": 2,
               "credit_id": "52fe456ec3a368484e05a6ed",
               "name": "Joe Strummer",
               "profile_path": "/1OnNvVlWmtyqDfjQTsQ8lQOYEo9.jpg",
               "id": 58296,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Lead Guitarist",
               "gender": 2,
               "credit_id": "52fe456ec3a368484e05a6f1",
               "name": "Mick Jones",
               "profile_path": null,
               "id": 99277,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Drummer",
               "gender": 0,
               "credit_id": "52fe456ec3a368484e05a6f5",
               "name": "Topper Headon",
               "profile_path": null,
               "id": 99278,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe456ec3a368484e05a6f9",
               "name": "Jimmy Pursey",
               "profile_path": null,
               "id": 73818,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Rude Boy",
               "gender": 0,
               "credit_id": "52fe456ec3a368484e05a6fd",
               "name": "Ray Gange",
               "profile_path": null,
               "id": 99275,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Bassist",
               "gender": 2,
               "credit_id": "52fe456ec3a368484e05a701",
               "name": "Paul Simonon",
               "profile_path": "/aSWBEeqOCwmTpg9DWBIIxWjuCpM.jpg",
               "id": 96767,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "59e605cc925141026500b7ed",
               "name": "The Clash",
               "profile_path": "/yHplm1M0l2Ubb0tIPtzdUbDIA2h.jpg",
               "id": 223503,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe456ec3a368484e05a6d7",
               "name": "Jack Hazan",
               "profile_path": null,
               "id": 99273,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe456ec3a368484e05a6dd",
               "name": "David Mingay",
               "profile_path": null,
               "id": 99274,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe456ec3a368484e05a6e3",
               "name": "Ray Gange",
               "profile_path": null,
               "id": 99275,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe456ec3a368484e05a6e9",
               "name": "David Mingay",
               "profile_path": null,
               "id": 99274,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Music",
         "id": 10402
      }],
      "popularity": 0.501918,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 27930,
      "vote_count": 5,
      "budget": 0,
      "overview": "Rude Boy is a semi-documentary, part character study, part 'rockumentary', featuring a British punk band, The Clash. The script includes the story of a fictional fan juxtposed with actual public events of the day, including political demonstrations and Clash concerts.",
      "similar": [
         1584,
         525,
         65754,
         5723,
         11031,
         10925,
         3902,
         369557,
         313922,
         11049,
         24873,
         9591,
         11564,
         342737,
         8274,
         925,
         11966,
         10330,
         5708,
         2011
      ],
      "original_title": "Rude Boy",
      "runtime": 133,
      "poster_path": "/lcgkq1uIHRXqCEHUu5BJdbuLGh4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1980-07-25",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jack Hazan",
         "David Mingay"
      ],
      "runtime": 133,
      "synopsis": "Rude Boy is part documentary and part short film centering on punk band, The Clash and one of their \"roadies\"(he's really more of a tag along as he is somewhat lazy and doesnt appear to have any technical knowledge on setting up or fixing sound or music equipment.) by the name of Ray Gange, who is actually one of the writers and directors of the film. The film takes place between the bands release of their explosive debut album and its follow up, the very underrated, \"Give 'Em Enough Rope\"(an album that has largly been cast aside solely because of its more radio friendly production brought about by Sandy Pearlman who was seen as unfit to work with a a punk band because he had previously worked with bands such as Blue Oyster Cult.) Ray the roadie plays the foil by being somewhat dim and spouting off knee jerk conservative statements to which the rest of the band, in particular, Joe Strummer, can respond and react to. The film captures the tension on the streets of London in the late 70s as economic disaster seems to loom overhead and many begin to look for scapegoats in the form of non white immigrants. The conservative political group, the National Front takes this cue to fan the fires of race war in the streets and groups like The Clash both observed and addressed these issues in their music at a time when no other bands would outside of the punk music scene. The film features live footage from some very legendary shows such as the rock against racism rally held in Victoria Park and attended by over 100,000 people. The Clash is seen on camera at its peak and the film offers some rare opportunities to see the band in a more candid setting than on stage or in a planned interview. a must see for fans of punk rock and really music in general.",
      "writers": [
         "Ray Gange",
         "David Mingay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081441/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0MTMzNjYzMl5BMl5BanBnXkFtZTcwNDc2MTYyMQ@@._V1_SY291_CR1,0,214,291_AL_.jpg",
      "actors": ["Stars: Dave Armstrong, Barry Baker, Terry Barry | See full cast and crew »"],
      "reviews": [
         "...despite copying the musicians in the studio trope, the porn-shop as symbol of capitalism and the black/white subplot. However \"Rude Boy\" perhaps deserves a little more attention than it seems to have received. As a 'proper movie' it's kind of a washout. Aiming for an improvised cinema-verite feel, it's hamstrung by a fatal lack of tension, having apparently been assembled by people with little grasp of editing, narrative or any kind of cinematic style. Despite this, the concert footage of The Clash is indispensable to anyone with an interest in the era, and shows why they were one of the all-time great rock and roll bands. We have very few 70's punk bands recorded properly on film as opposed to video and the difference in quality is striking. Also, Joe Strummer's death is still quite recent as I write and seeing him here in his prime is poignant in the extreme. In general there are very few film documents of punk. We have Jarman's \"Jubilee\" which was more of a neo-Elizabethan fantasia, \"The Great Rock and Roll Swindle\" with its McClarenite rewriting of history and come-lately nonsense like \"Breaking Glass\". \"Rude Boy\" at least doesn't fall into any narrative clichés (if only by barely having a plot) and by its very lack of creative flair may succeed best in giving a picture of the time. For example, unlike the myth-making of the likes of \"Sid and Nancy\", this shows punk gigs as they actually were - largely populated by lads with feather-cuts and tank tops. By concentrating on hanger-on Gange instead of the band itself, the filmmakers turn the story into one of the relationship between the band and its fan-base - pointed up by having Strummer sing \"All The Young Punks\" right through in the studio without the backing track to distract us from the lyric. The commentator who said this did not give a true picture of the politics of the time is surely wrong. I was there and it seems pretty accurate to me. We see the resurgent National Front, the Anti-Nazi League, the bullishness and racism of the police at the time (which would shortly lead to the Brixton riots) and the rise of Thatcherism out of the bankrupt Butskellite consensus. Ray Gange's character in the film seems intended to represent the British white working class at the time - confused, politically disengaged and borderline racist, the attitudes which led to the Thatcher victory we see at the end of the film. The left, variously represented by the SWP (bureaucratic) and Strummer (by turns tokenistic and diffident) fails to capture Gange's imagination and it is the right who seize on the desire for change and turn it to their own advantage. Rude Boy is a strange curate's egg, then. There may have been a really good film struggling to get out of this morass, but we'll never know. The special edition DVD has a \"Just Play the Clash\" function which lets you view only the concert footage and I suspect this will get a lot of use. Rating? 3/10 for the story, 10/10 for the music.",
         "One of the flattest movies I have ever seen. Mostly a collection of drab, long takes following around a young prick who joins The Clash as a roadie, does a bad job, then wanders around drunk, making tactless, muddled comments about race, the band's politics, and what he wants to do with his life. Dull, disjointed, quiet lines punctuate long silences; even the live performances of The Clash fail to give the movie much energy, due to poor sound design that cuts off absolutely all crowd noise and brings down the volume of the songs, so that most of them end up sounding like drab demo tapes. The film is mainly a plotless mess. When it does focus on the main character, all we see is a buffoon stuttering out inarticulate and unwelcome comments to roadies and band members who hate him but just try to ignore him. Whatever the character study of this guy hopes to achieve, it has absolutely nothing to do with The Clash, whose music and politics are not examined at all -- they are simply seen as some rock group the 'rude boy' is following around and who get some concert footage in the picture. In the last twenty minutes we also get meaningless cutaways to political party conferences and to a black youth who has not been in the movie before, has no connection to any of the previously seen characters, and who is undergoing criminal charges for something which is never made clear. Seeing this movie is tempting for Clash fans -- we want to see what the project is about, and we want to see the concert footage -- but it's an irrelevant, static mishmash that gives those in the audience a lot of time to scratch their heads.",
         "Rude Boy (1980) follows the life of a youth who dreams about working for his favorite band THE CLASH. The band THE CLASH co-star in this picture and some of their live performances is caught on film. This movie was made before they made it big across the pond. The band is shown working on their second album GIVE THE ENOUGH ROPE. A colleague of their's John Lydon once said that the Clash didn't know how to pace themselves, they would be tired after the first four or five songs. Well, he was right. Some of the concert footage shows, the band appeared to be sluggish and tired in some of their performances. I heard that the band wasn't happy with the way they were portrayed and neither was the young man who played the wannabe roadie. I found the band to be very interesting and I became a Joe Strummer fan after I saw this movie. The film-makers also capture the turmoil that was occurring on the streets of London during this time. Their was a lot of rioting and protesting. They also capture the collapse of the Labour Party and the rise of the Conservatives. Another one to seal in a time capsule. Interesting, recommended for Clash fans.",
         "This intriguing film blurs the line between documentary and reality much in the way 60's classics such as \"Medium Cool\" do. The story (when it's allowed to tell itself) of the drunken directionless punk is sad, charming and wild. I can see why the Clash disowned the film. It shows how they merely reflect the showbiz side of the struggles of the working class in England. When Ray attempts to tell Mick Jones how much \"Stay free\" means to him, he is shrugged off with a \" I'm watching you.\" We see Ray being consumed by his own nihilstic rage while the clash use it up to the point of making good pop music with it.",
         "Despite all the negative commentary about this hodge-podge docudrama, it really is a fine testament to the spirit if not the letter of the punkers and the politics of the 70's. With the recent death of the talented and idealistic Joe Strummer, it is the film's insight into his talent and personality, his dynamic stage presence, and his role as a driving force behind the anti-institution known as the Clash that makes this film an important cultural and musical document. I also think it's very entertaining outside the musical numbers, if appropriately depressing.",
         "Brilliant, if you forget the narrative and focus on the clash footage featured. It has the right message, punk is opposed to racism, which at the time was not always the case, there was lots of Nazi punks. I would have liked to have seen more footage of the race riots. The recent death of Joe Strummer adds a degree of poignancy to this wonderful relic of late-1970s London. Rude Boy distills the essence of the Clash in their prime. I spend hours watching the extras which feature over 20 life clash performances, including four different white riots! Any clash fan needs to own this DVD, also recommended: west-way to the world, and essential clash. D",
         "Read Marcus Gray's The Last Gang in Town.... I watched the film a couple of times, like other contributors, with many questions in my head about what it was really about, how much The Clash co-operated with it, why the film is presented in the way it is, who on Earth Ray Gange is... This book clears up those questions... The film is flawed, but as a document of the times, and especially the power of The Clash as a live band (there's not any better footage of them around - although they overdubbed the live tracks).... What a band...",
         "The Clash's Rude Boy is a misguided, exciting and overall decent attempt at capturing the band the Clash at the height of their crossover from punk pioneers (if there could legitimately be called such a thing) to full-blown rock stars in the UK. The story itself surrounding them is perhaps less great than the band itself, which might be expected considering all that can be done in integrating one character into a band through a fictional script. The movie examines an angry youth (Gange) who works in a sex shop, until he meets up with The Clash and becomes their roadie. The story of Gange (and his view of the situation in Britain at the time it was made, with the occasional communist remark or two depending on the perspective of the viewer) is a little confusing and muddled at times. Yet when the Clash take the stage, which is fairly often, the film is thriving and alive as any concert film in the history of rock movies. Maybe it may appeal more to punk fans from the 70's than the punk fans- or what bunch of posers that try and act hip from their Hot Topic gear- but it's hard not to pass it up as even a casual fan either. Performances include: I'm so Bored with the USA, White Riot, Janie Jones, White man in Hammersmith, and Police and Thieves, among others.",
         "I'll start out by saying that I own this film, and I am a big Punk fan. Despite these two factors I simply cannot give this film higher than a 6 out of 10. The story line and acting in this film is pretty lousy...which is probably why one reviewer found it \"funny\". Ray Grange (\"Rude Boy\" of the film) admitted in an interview that he didn't agree with his lines. His character is very flat and his dialog with Joe Strummer and the other members of the clash are contradictory from one scene to another. With that being said, there is another element of this movie that makes it worth viewing...more than once. The scenes with the clash were often ad libbed and these scenes play like documentary footage. The performances are from actual shows and they are amazing. There is a \"Play the Clash Only\" option that plays only these performances. I often just find myself fast forwarding through Grange's solo scenes instead. Basically, If your not a fan of Punk or the Clash...rent a different one...maybe something like \"Sid and Nancy\" or \"SLC Punk\". but if you like this film I suggest \"Westway to the World\" (a Clash Documentary).",
         "It is genuinely difficult to work out where the drama ends and the documentary takes over. When I sat down to watch it I had no idea whether Ray, the fan who becomes a roadie, was an actor or the genuine article. The stilted nature of some of the conversations, and self-conscious grins accompanying them, indicate contrivance, but it's as if real conversations are being reproduced for the camera. Only afterwards did I discover that Ray Gange was acting and had written the script. The film provides an insight into the world of punk rock in the late seventies. The Clash were more musically adept, and more politically aware, than most punk bands of the era, but the rebellious swaggers and the anger were typical enough. The concert footage is entertaining, and only marred by the fact that much is filmed from the back of the stage. It features much of the band's best material, from White Riot to Tommy Gun to London's Burning. This is a nostalgic treat for old punk rockers, and a useful introduction for those who, in the late 70s, were too young or allowed punk rock to pass them by."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Buzzy Enterprises",
         "Michael White Productions"
      ],
      "summaries": [
         "Rude Boy is a semi-documentary, part character study, part 'rockumentary', featuring a British punk band, The Clash. The script includes the story of a fictional fan juxtposed with actual public events of the day, including political demonstrations and Clash concerts. Filmed over a period of years, the written dialog takes on the appearance of improvisation.",
         "A young British punk and roadie for The Clash navigates life in socially torn 1970s England."
      ],
      "budget": 0
   },
   "movielensId": 5239,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-07-25",
      "dvdReleaseDate": "2006-08-01",
      "directors": [
         "Jack Hazan",
         "David Mingay"
      ],
      "runtime": 133,
      "movieId": 5239,
      "title": "Rude Boy",
      "mpaa": "",
      "actors": [
         "Joe Strummer",
         "Mick Jones",
         "Topper Headon",
         "Jimmy Pursey",
         "Ray Gange",
         "Paul Simonon",
         "The Clash"
      ],
      "imdbMovieId": "0081441",
      "originalTitle": "Rude Boy",
      "genres": ["Music"],
      "youtubeTrailerIds": ["d9DdJekHv3Y"],
      "plotSummary": "Rude Boy is a semi-documentary, part character study, part 'rockumentary', featuring a British punk band, The Clash. The script includes the story of a fictional fan juxtposed with actual public events of the day, including political demonstrations and Clash concerts.",
      "tmdbMovieId": 27930,
      "avgRating": 3.36,
      "releaseYear": "1980",
      "numRatings": 50,
      "posterPath": "/lcgkq1uIHRXqCEHUu5BJdbuLGh4.jpg"
   }
}