{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kung fu",
            "id": 780
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "fighter",
            "id": 6211
         }
      ],
      "imdb_id": "tt0081499",
      "video": false,
      "title": "The Young Master",
      "recommendations": [
         25074,
         11205,
         25539,
         21733,
         10753,
         18857,
         45408,
         18707,
         21519,
         10044,
         10974,
         16407,
         19274,
         11537,
         9404,
         11134,
         10975,
         21521,
         64015,
         70233
      ],
      "backdrop_path": "/28YB2SlgIkVqAqSCVtQwrsq9v67.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lung",
               "gender": 2,
               "credit_id": "52fe445a9251416c75031ccd",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Tiger/Keung",
               "gender": 0,
               "credit_id": "56b96a19c3a3681e77001290",
               "name": "Wai Pak",
               "profile_path": "/eZ9ehcxkRrCndKqVNLVxPEAJvxC.jpg",
               "id": 548617,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Number Four",
               "gender": 0,
               "credit_id": "56b96a35c3a3681e64001234",
               "name": "Yuen Biao",
               "profile_path": "/hdBQMhtzpamgodIURGPQAcKdbWC.jpg",
               "id": 62414,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Chief Sheriff Sang Kwan",
               "gender": 2,
               "credit_id": "56b96a4292514106a1001284",
               "name": "Sek Kin",
               "profile_path": "/mziDNcIsxYQCv1FHytSOju7fLYJ.jpg",
               "id": 65971,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Sang Kwan's daughter",
               "gender": 1,
               "credit_id": "56b96a4fc3a3681e5d0013d6",
               "name": "Lily Li Li-Li",
               "profile_path": "/ZLqCeA0I8voQeAMTxBIIBoqA3q.jpg",
               "id": 240169,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Master Kam",
               "gender": 0,
               "credit_id": "56b96a5ac3a3681e60001294",
               "name": "Hwang In-Shik",
               "profile_path": "/304F57Mt0Fh2aZu0Ytv4BiqhZJo.jpg",
               "id": 554622,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Master's Kam's men",
               "gender": 0,
               "credit_id": "56b96a65c3a3681e60001297",
               "name": "Lee Hoi-Sang",
               "profile_path": "/r2pLABgGwJhT3Wniyt859hjcnoS.jpg",
               "id": 1109778,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Master's Kam's men",
               "gender": 0,
               "credit_id": "56b96a72c3a3681e5d0013dd",
               "name": "Fung Hak-On",
               "profile_path": "/8ATQ99ZfDKP9cFUHnoxqeQtALzZ.jpg",
               "id": 118745,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Uncle/Ah Suk",
               "gender": 2,
               "credit_id": "56b96a81925141069f001323",
               "name": "Fung Fung",
               "profile_path": "/c4XwP26BctbUHxtY6nMlxN4PaNm.jpg",
               "id": 1191785,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Bull",
               "gender": 2,
               "credit_id": "56b96a8dc3a3681e6d00132e",
               "name": "Fan Mei-Sheng",
               "profile_path": "/jzD3y8xdLlOPIiKcwJkWaWQhhpq.jpg",
               "id": 240185,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Master Tien",
               "gender": 2,
               "credit_id": "56b96a9992514106a1001293",
               "name": "Tien Feng",
               "profile_path": "/t2EvlAPRt9DcFdzbq8dGasbUFHs.jpg",
               "id": 121394,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Ah Chan",
               "gender": 0,
               "credit_id": "56b96aa492514106b4001351",
               "name": "Bruce Tong Yim-Chaan",
               "profile_path": "/mQ5lxzXW4mmhsqmCDxvVq2chJ2f.jpg",
               "id": 1163371,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031cdb",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe445a9251416c75031ce1",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe445b9251416c75031ce7",
               "name": "King Sang Tang",
               "profile_path": null,
               "id": 69886,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe445b9251416c75031ced",
               "name": "Raymond Chow",
               "profile_path": "/zAIthSX6xZoaj1J09Uv6JzagKWP.jpg",
               "id": 46323,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe445b9251416c75031cf3",
               "name": "Leonard Horn",
               "profile_path": null,
               "id": 44932,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe445b9251416c75031cf9",
               "name": "Yao Chung Chang",
               "profile_path": null,
               "id": 57725,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 4.436863,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 11563,
      "vote_count": 47,
      "budget": 0,
      "overview": "Youthful martial arts master Lung is searching for his missing brother, when he is mistaken for a criminal on the run.  He must prove his innocence by solving the case himself, while local lawmen and merciless mercenaries are hot on his trail.",
      "similar": [
         55292,
         193893,
         140300,
         9461,
         44865,
         11713,
         11134,
         75780,
         146,
         605,
         24,
         96,
         604,
         9502,
         4638,
         2048,
         11770,
         90,
         20676,
         9604
      ],
      "original_title": "師弟出馬",
      "runtime": 101,
      "poster_path": "/fE3qMzV5VJD47BjV3nFOKWYSiCc.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [],
      "release_date": "1980-02-09",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jackie Chan"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Jackie Chan",
         "Tin-Chi Lau"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0081499/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwODkzNzkwNl5BMl5BanBnXkFtZTcwODE0MzUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jackie Chan, Pai Wei, Biao Yuen | See full cast and crew »"],
      "reviews": [
         "Jackie Chan had already established himself in Hong Kong as a box office champion with 1978's Drunken Master and 1979's Fearless Hyena, but he was not getting his fiscal due from Lo Wei Productions. So he opted out of his contract with Lo Wei and was hired by Golden Harvest. The Young Master was his first picture under that studio. The film was interrupted several times because of the contract dispute with Lo and a Triad that wanted a stake in Jackie's fortune. This was eventually settled with help by Jimmy Wang Yu whom Jackie would owe (along many other actors) several favors. Even with all this chaos, Jackie was still able to create a memorable and must-have film, though the movie is marked by continuity problems. Jackie stars as Ah Lung a mediocre student (funny he doesn't seem so in the film and that point is soon forgotten) who loses in a beautifully choreographed lion dance competition because his fellow adopted brother Jing Keung (Wei Pei), faked an injury and competed incognito for the Wei Yee school. Lung and Keung's sifu Master Tien soon finds out of this deception and this betrayal leads to Keung leaving the school. After an impassioned plea from Lung, Tien gives Lung his blessing to find his brother. Jackie takes his big white fan (important plot point.) Jing looks for work at the Wei Yee school, but is turned down when he is found to have helped the Wei Yee school win the Lion Dance competition. He is then recruited with two others, including Fung Hark-On (aka Fung Ke-An who was the martial arts consultant with Jackie) who has a large mole on his face \u0096 reminiscent of Jackie's mole in Police Woman, to free Master Kim (Hapkido expert Whang In Shik.) Jing uses his big white fan to help Kim escape. So Ah would later be mistaken for his brother and sought after by the local police inspector and his son (played by Hong Kong regulars Shih Kien and Yuen Biao.) This would lead up to an awesome fight scene between two of the Seven Little Fortunes, Yuen and Jackie. Yuen would expertly use a bench and you get to see Jackie use a pole again. Even with the continuity problems (even admitted by Jackie, including one scene where Jackie is fettered and the next he is not) and the overuse of sped-up footage and zoom shots (including one that is parodied in Kung Pow), this is a fun film to watch.. The high points of this movie are the Cantonese comedy and the sublime martial art scenes. In those fight scenes you get to see him use many props such as sword, pole, bench and even a skirt, a skill he learns from his encounter with the Police Chief's daughter played by Lily Li. The high point of the film is a showdown that involves an 18-minute plus scene between Jackie and Whang (Jackie in his autobiography \"I Am Jackie Chan\" considers this his ninth best fight scene.) I do not want to describe this sagacious scene too much, because it has to be seen. I will say that I have never seen Jackie get beat up so much in any other movie and most of it is shot with wide-angle lenses with few cuts. Even his solution to winning is unique. This movie is a must buy for Jackie Chan or Hong Kong film fans. The most important decision in buying this film on DVD is what label/version you purchase. There are many shorter versions out there, even several that are widescreen, but the scenes that are taken out are mostly from the action scenes! But, Fortune Star puts out a 106 minute version that is digitally remastered and has the Cantonese (along with dubbed version) audio. Though there is one caveat, many of the cheaper versions have a huge benefit that the Fortune Star DVD does not \u0096 Jackie Chan singing in English at the end of the film. Even without that benefit the Fortune Star release is by far the best version of an excellent Jackie Chan film.",
         "Tiger has gone astray and has defected to a rival kung0fu school who are using his skills for evil means. They end up framing Tiger for a crime he didn't commit. The younger of the two orphans, Dragon, messes up in a competition and is expelled until he can clear his brother's name. On the journey much martial arts action, mistaken identity comedy and general adventure is had on the way to a final show down. Jackie Chans first crack at directing shows he is man of many talents. This film broke every record at the Hong Kong box office and it still stands up today in the world of OTT fight scenes in every Hollywood movie you'd care to mention! The reason this film stands up so well is that it has all the basics of any Chan film. First off the fight scenes are all very good. They may not look as up to date, but they compare favourably with anything coming out of Hollywood today. The final fight is amazing and is only let down by a really bad dummy stand in at the end! Secondly, and just as importantly, the film is funny! Chan's comedy is bang on target \u0096 even 20 years later this is funny. This comedy is mixed nicely with everything else and sits well even within the final 15 minute fight scene at the end. It does have flaws in that at times the plot is confusing or lost in all the comedy and action \u0096 but the plot holds on just enough to get by. But lets be honest, we didn't come here for plot \u0096 we came for action and comedy, and it delivers both. Overall this is no classic but it has been one of my favourite Chan flicks for years, and even after 22 odd years this still stands up as a very enjoyable film with good action and comedy.",
         "This is one of those all-out classics that must be viewed at any opportunity, a HK box office smash that not only revolutionised the dated traditions of chopsocky cinema, but also assured Jackie Chan's presence as the most prominent kung fu movie maker around: his use of slapstick humour and unconventional fighting hinting at what the \u0091new wave' future was to hold. One of two orphans, Jackie plays the underdog hero, disgraced at losing his school the annual lion dance, due to his better brother Wei Pei secretly enrolling and leading the criminal rival class. The s**t hits the fan when Wei Pei's treachery is uncovered, quitting his former school to work for the baddies full time, and Jackie is made to bring him back home. Of the many delights Chan runs into, the stand outs are an infiltration on police inspector Sheck Kin's family, some nifty skirt-foot fighting and one of the best final punch-ups ever recorded \u0096 a lengthy one-on-one with criminal mastermind and super bootmaster Whang Ing Sik. As writer, director, choreographer and star, this is a landmark in Jackie Chan history - and even today stands as one of his best pictures.",
         "He really is a master in this film. I really don't know what else to say. The whole movie is beautifully choreographed and the fighting is unbelievable. He does things with chairs and tables that no one can copy. As for the story it is as usual not very deep, but who cares about that when you see Jackie Chan kicking ass with a fan?",
         "I only saw this movie two weeks ago and was pleasantly surprised by it. Its starts out a little slow but picks up as soon as Jackie's character leaves home to find his big brother. I found myself laughing out loud at various parts of the film, in particular when Yuen Biao or his father were on the screen. Jackie's character is pretty cocky and it was hilarious to see him winding the old man up. The icing on the cake is when Jackie is being attacked by him with a sword and he somehow manages to get hold of the old guy's prized pipe. I thought the humour was quite fresh and unforced unlike it sometimes tends to be in his later films. Furthermore, his making funny faces actually works here and isn't overused. Humour aside, the action sequences are good. Excluding the final fight, they may appear slow by today's standard but are still highly watchable. The final fight itself is a sight to behold. It seemed to progress by chapters and so you could say developed a story of it's own. Watch it and you'll know what I mean. Now one of my all time favourite JC movies. Highly entertaining I give it 10/10. This was based on the Cantonese version unsubtitled.",
         "This film made me into a proper fan of Chan. What a wonderfully choreographed film. The fights took months and months to perfect, and you can tell. Some of the action literally took my breath away. The film's comedy borders on the Shakespearean, with mistaken identity, circumstance, and chance encounters blending to form the backbone of a superbly conceived storyline. The sole criticism I have of the movie, is that you don't realise it is a comedy until about half an hour into it. Up to that point, it takes itself a tad too seriously, and even tries to strum the heart strings with a weepy scene where Chan thanks his Master for looking after him since he was found as a street orphan in childhood. When you get past all that, however, you're looking at possibly the greatest action film of all time. The classical fighting style in Chan's movies took a back seat after this, with the advent of movies like Project A and Police Story. Chan returned to this style with Young Master in Love (Dragon Lord) a couple of years later, but that was more of a sports movie than a kung-fu fest. In 1994, Jackie released Legend of Drunken Master, which followed in the same vain as Drunken Master (1979), and in many ways was superior. It's just such a shame that, \"Jackie don't make 'em like he used to.....\"",
         "Chan's directorial debut is a surprisingly assured piece of work, easily confirming why Chan is the most talented superstar in the world today. As you'd expect, the fight sequences are breathtaking to watch, amazingly inventive and beautifully choreographed. Similarly, the joky historical story is typical Chan: he plays a blundering fool out to find his brother who has turned to the dark side. Mistaken identity mishaps ensue. The film concludes with a gobsmacking TWELVE MINUTE one-on-one fight sequence: totally unheard of in Hollywood, yet in Chan's hands it it totally watchable and works very well. Yet another hit from the Jackie Chan fun factory.",
         "Jackie Chan's directorial debut is a highly enjoyable action comedy. The film uses comedy more than action, although when Chan mixes the comedy in with the action, it is very effective - pure nonsense and child-like but very funny in places. The storyline is basically set-pieces to show off the fighters skills, and physique especially our man Chan. Highlights include a hilarious scene involving Chan and two bank robbers, a fight with a wooden stool against \"little brother\" Yuen Baio, and an end fight scene with a new Hwang Jang Lee, this fight however is too long, and relies on the comedy too much. Like all early Chinese films the ending is rapped up very rapidly. Still, there is much to enjoy here, and is a must-see for Jackie Chan fans. ***/*****",
         "The Young Master is one of the highlights of early Eighties kung fu cinema, a hugely entertaining, fast and funny adventure with some brilliant and imaginative fighting. Personally I think Jackie Chan kinda lost his touch when he moved away from old school kung fu and more into stunt work and generalised action and humour but this film occupies a middle ground, with solid fighting to please old school fans and a good deal of ingenious weapon fighting (fans, benches etc) and oddball humour. Chan is supported by a number of other kung fu greats, such as Yuen Biao, Lily Li, and as bad guys Lee Hoi San and Fung Hak On teamed up and Wong In Sik as the ultimate bad guy, with whom Jackie has an epic fight that lasts for around 14 minutes with small breaks. This scene is truly amongst the greatest fight scenes ever filmed, with the two combatants furiously trading blows and Chan really working hard to win. The earlier fights have some great intricate choreography, especially a fight between Chan and several sword wielding gentlemen and a fan fight that apparently required 329 takes to complete. Aside from the fighting this is a slightly scrappy film. The script was unfinished when filming started and the plot is a bit insubstantial. The film flows along and seems to be constructed around the fight scenes meaning that apart from some funny lines and the odd bit of melodramatic acting at the beginning the story is forgettable. The films lacks much in the way of characterisation an the villains aren't really that hissable. Also, more fight scenes with Wong In Sik would have been great, as he has an imposing presence and his scenes are awesome highlights. Still, these are but very minor issues in a film that is overall simply majestic entertainment. Kung Fu fans should certainly check this one out, it is very unlikely to disappoint.",
         "This is my third favourite film because of the Bruce Lee films (first being Way of the Dragon, Fist of Fury and Game of Death, second being The Big Boss and Enter the Dragon) but enough about Bruce for a moment, I'll just talk about how great this film is among the classic kung-fu c**p. The two fight scenes where Whang Ing-Sik appear in have got to be two of the greatest to grace the cinema screen, much different to the classical style of choreography back then, and scenes that would please even Bruce himself. The fifteen minute fight scene at the end of the film is one of the greatest, if not the greatest, because of the way Whang kicks (using his left foot which most right-footers usually neglect to use during combat) and the hilariousness of when he flying side kicks Jackie Chan and the other guy, and the latter just flies for miles. The rest of the film is moderately funny, with the emperor's pipe scene with Shih Kien fighting Chan and the appearance of Yuen Biao with the stool. Amazing stuff all round"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Golden Harvest Company",
         "Leonard Ho Productions"
      ],
      "summaries": ["After failing his fellow students in a Lion Dance competition, Dragon (Jackie Chan) is sent away from his school in disgrace, on the condition that he must find his errant brother. Much martial arts mayhem and mistaken-identity silliness ensue."],
      "budget": 0
   },
   "movielensId": 5243,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "1980-02-09",
      "dvdReleaseDate": "2004-05-25",
      "directors": ["Jackie Chan"],
      "runtime": 101,
      "movieId": 5243,
      "title": "The Young Master",
      "mpaa": null,
      "actors": [
         "Jackie Chan",
         "Wai Pak",
         "Yuen Biao",
         "Sek Kin",
         "Lily Li Li-Li",
         "Hwang In-Shik",
         "Lee Hoi-Sang",
         "Fung Hak-On",
         "Fung Fung",
         "Fan Mei-Sheng",
         "Tien Feng",
         "Bruce Tong Yim-Chaan"
      ],
      "imdbMovieId": "0081499",
      "originalTitle": "師弟出馬",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["MiYkE_7HV2w"],
      "plotSummary": "Youthful martial arts master Lung is searching for his missing brother, when he is mistaken for a criminal on the run.  He must prove his innocence by solving the case himself, while local lawmen and merciless mercenaries are hot on his trail.",
      "tmdbMovieId": 11563,
      "avgRating": 3.34783,
      "releaseYear": "1980",
      "numRatings": 138,
      "posterPath": "/fE3qMzV5VJD47BjV3nFOKWYSiCc.jpg"
   }
}