{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "heresy",
            "id": 2976
         },
         {
            "name": "religion and supernatural",
            "id": 3684
         },
         {
            "name": "napoleon",
            "id": 4381
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "loss",
            "id": 6203
         },
         {
            "name": "unwillingly pregnant",
            "id": 8650
         },
         {
            "name": "muse",
            "id": 9304
         }
      ],
      "imdb_id": "tt0455957",
      "video": false,
      "title": "Goya's Ghosts",
      "recommendations": [
         13501,
         112,
         18408,
         33356,
         53230,
         85589,
         77855,
         65040,
         1989,
         66537,
         46278,
         21173,
         14882,
         10876,
         11331,
         67885,
         14167,
         3982,
         47963,
         142374
      ],
      "backdrop_path": "/biKlZ8ZoMswH1sxKziCOKYRpeT6.jpg",
      "revenue": 9448082,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lorenzo",
               "gender": 2,
               "credit_id": "52fe44509251416c7503050d",
               "name": "Javier Bardem",
               "profile_path": "/hbr72lORyRjm8w9ujU5OA7YDzG.jpg",
               "id": 3810,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Inés / Alicia",
               "gender": 1,
               "credit_id": "52fe44509251416c75030511",
               "name": "Natalie Portman",
               "profile_path": "/rtLTG4yrEcROXhTBGXMrbyiUEC5.jpg",
               "id": 524,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Francisco Goya",
               "gender": 2,
               "credit_id": "52fe44509251416c75030515",
               "name": "Stellan Skarsgård",
               "profile_path": "/zSCU2agleLtJEvzj98jEesVhBxa.jpg",
               "id": 1640,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "King Carlos IV",
               "gender": 2,
               "credit_id": "52fe44509251416c75030519",
               "name": "Randy Quaid",
               "profile_path": "/7rywy6gbSTG60xQWepRktD0feek.jpg",
               "id": 1811,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Tomás Bilbatúa",
               "gender": 0,
               "credit_id": "5596aeb4c3a3685896001e4f",
               "name": "José Luis Gómez",
               "profile_path": "/jctZjDA4ABINF4VTg0Q9ZUP05L4.jpg",
               "id": 72631,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Inquisitor General",
               "gender": 2,
               "credit_id": "5596aec59251417625000b08",
               "name": "Michael Lonsdale",
               "profile_path": "/pEF7YiXY9yMKUVX5n2Ly7OYH5Op.jpg",
               "id": 2369,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Queen María Luisa",
               "gender": 0,
               "credit_id": "5596aee2c3a3687be60028cf",
               "name": "Blanca Portillo",
               "profile_path": "/i07cqKKYOi1MydmthPnFNpzmkx.jpg",
               "id": 3480,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "María Isabel Bilbatúa",
               "gender": 1,
               "credit_id": "5596aef5c3a3687be60028d3",
               "name": "Mabel Rivera",
               "profile_path": "/A4MguHpfBb5yVz0MJ5EW11BxxJx.jpg",
               "id": 33409,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Ángel Bilbatúa",
               "gender": 2,
               "credit_id": "5596af05925141132f000508",
               "name": "Unax Ugalde",
               "profile_path": "/9S5cbwH6bLYItQqL81yXmcFBoOZ.jpg",
               "id": 50994,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Álvaro Bilbatúa",
               "gender": 2,
               "credit_id": "5596af13c3a36870ce004c95",
               "name": "Fernando Tielve",
               "profile_path": "/tAc6E2bpJLW6Ig4XB9NnOIXFYeq.jpg",
               "id": 17095,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Monk 1",
               "gender": 2,
               "credit_id": "5596af33925141093e001d77",
               "name": "David Calder",
               "profile_path": "/ixaxa85cJRQuyVihWjr27Dyh9Bf.jpg",
               "id": 10779,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Hooded Monk",
               "gender": 2,
               "credit_id": "5596af4fc3a36857e0001d85",
               "name": "Ramón Langa",
               "profile_path": null,
               "id": 275949,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Pyre Monk",
               "gender": 0,
               "credit_id": "5596af5d9251417625000b0f",
               "name": "Manuel de Blas",
               "profile_path": "/l1BcDsCOmc7eL0E9ZlqAvUU4GFc.jpg",
               "id": 30351,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Confiscating Monk",
               "gender": 0,
               "credit_id": "5596af6ac3a36870cc0049c5",
               "name": "Andrés Lima",
               "profile_path": null,
               "id": 225022,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44509251416c7503051f",
               "name": "Miloš Forman",
               "profile_path": "/nKnsrK9h02F1QlMetkyr9R45VGM.jpg",
               "id": 3974,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44509251416c75030525",
               "name": "Jean-Claude Carrière",
               "profile_path": "/nlJZcRlzQKo17GuZ2vSMRdag4iV.jpg",
               "id": 9747,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44509251416c7503052b",
               "name": "Miloš Forman",
               "profile_path": "/nKnsrK9h02F1QlMetkyr9R45VGM.jpg",
               "id": 3974,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44509251416c75030531",
               "name": "Adam Boome",
               "profile_path": null,
               "id": 19467,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44509251416c75030537",
               "name": "Javier Aguirresarobe",
               "profile_path": "/5KUDE1mJ9X6o8Gu9PAPHXDTuDIt.jpg",
               "id": 403,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 7.754067,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11515,
      "vote_count": 133,
      "budget": 50000000,
      "overview": "Painter Francisco Goya faces a scandal involving his muse, who is labeled a heretic by a monk.",
      "similar": [
         11202,
         462,
         640,
         979,
         769,
         5915,
         2652,
         318846,
         389015,
         407445,
         363676,
         371638,
         396371,
         324786,
         281957,
         64686,
         323677,
         228970,
         274479,
         152532
      ],
      "original_title": "Goya's Ghosts",
      "runtime": 114,
      "poster_path": "/x04CKIV43Y9K5iTD98fB25lB0F2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Xuxa Producciones S.L.",
            "id": 57206,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Saul Zaentz Company",
            "id": 5237,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kanzaman",
            "id": 4169,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Antena 3 Televisión",
            "id": 11737,
            "origin_country": ""
         }
      ],
      "release_date": "2006-11-08",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Milos Forman"],
      "runtime": 113,
      "synopsis": "During the Last Bastion of the Spanish Inquisition, 1790-1810, An Inquistador named Lorenzo (Javir Baldem) is being painted on various visits by artist Fransisco Goya when his fellows say Goya is painting whores as angels. Lorenzo tries to defend his work, saying it is those people--the whores and maimed --who the church needed to reach, to keep them from committing acts against God, not the artist just painting what he saw; then tells younger church leaders to pick up the Inquisition, search for those secretly practicing other religions. Into this hyped -up search for heathens, a rich merchant's young daughter out one evening (Natalie Portman as Inez) is said to have refused to have eaten pork , making her practicing Jewish rituals secretly...Incidently she is a model Goya used who was an angel on a church ceiling; Lorenzo displayed an interest in her by asking if long hours with such models made Goya think of other things, and what was her name. Goya ignores the last but says \"You have too acute an eye, Brother Lorenzo.\" When the girl's father comes to him and says Inez is a Church prisioner, Goya is angry but refuses to ask Lorenzo about her freedom. The father donates all his gold to the church for his daughter. Goya allows him to leave the gold , pay for the painting of the Brother, and tells Brother Lorenzo the deal. She is kept by the Catholic Church for trial, and \"put to the question\" ,which brother Lorenzo has learned for her family but believes in the sanctity of--if you were innocent, God gave you the fortitude to withstand torture and you didn't sign guilt to a lie. Lying to escape torture went against God. If you lied you were just as much a heretic as if you'd done the act. The girl has admitted she did it after extreme torture and Brother Lorenzo tries to take leave of her family when her father has his sons and servants hold him. Goya, also present, is telling the father,\" you don't treat Brother Lorenzo like that !\" when they grab him and bar the doors. They will let Goya free alone. After torture, Brother Lorenzo signs a rediculous paper that he had to be tortured pretty bad to sign. The father says he will produce it if Lorenzo does not get his daughter out. Lorenzo is next seen walking slowly down the Church's prison hall, looking into cells. He finally finds the girl, younger and dressed in rags that show her more sexual than even the artist had made her in sheer angel gowns. He tries to look away and put his overcoat on her but as she leans to him to pray with him and he watches the sharp little mind love his Lord so much and speak so fast and earnestly, he suddenly pulls her to him and says \"I do care about you, I do\" and \"that's alright\" as she struggles. His new discovery is a selfish one (it doesn't mattter if she cares about him, he hasn't asked if he can hold her tight, he is only learning that the real girl in the painting, so infatuating, was someone he also actually cared for.) He may also have meant that in matters of the flesh he had not expected to care about his target. So he'd go to her , say do you want to pray with me, at which she'd fall into his love, say \"Love me\".Obviously he did--years later he learns they had a child. Meantime the rich merchant has brought the Catholic Tribunal or whatever the signed statement and they are searching for Lorenzo, who has fled. Goya is visited by the church who takes his painting of Lorenzo away as part of a heresy trial they're working up on him. Lorenzo's signature showed the merchant and townspeople that torture did not work and was unfair; it showed church heads that people were in danger of not trusting \"The Question\" and that God gave His people fortitude to withstand torture--only bad people signed, making Lorenzo a false man of God. Although Lorenzo was alone in Inez's room with her at least several times, he never tried to help her escape, even when he ran, himself--he left her there. He ran to France where the French Revolutionaries got him into a Spanish Revolution. He comes back as a leader of the Spanish uprising., and has fun sentencing to death the old Church leader who wanted him killed. He has a nice office into which Goya comes, now fully deaf. He tells Lorenzo that Inez was finally released, after Lorenzo says he could never forget the family--they were what changed him. Lorenzo has him bring her in. She's a mess. She's just found no one waiting for her on release, walked home, and her family was dead around the stripped house. She has not combed her hair or looked in a mirror, has a \"mad\" twist to her mouth, but lights up at sight of Lorenzo and runs to him and begins to kiss his hand all over. Lorenzo kind of sits where she can't keep it up and asks gently what he can do for her. She says they took her baby. She says \"our baby.\" He tries, looking at the deaf artist, to correct her. She says he's the only man she's been with. He asks if she knows how long she was locked up. She has no idea. (The baby would be 20). She's still looking for a baby she can raise. Lorenzo has a wife he loves, he's told Goya, and children, and can make 10 paintings, his family is so big now.He tells Inez two men will take her to her baby and she leaves happily. Goya demands to know where he really sent her. \"She is out of her mind, she'll always be safe,\" Lorenzo says.\" Part of her insanity is to think he could have fathered a baby with her; Sorry she's changed to this.... Goya doesn't buy it and tracks down the baby and finds it is a hooker in a hooker park. On his own Lorenzo has already tracked babies who were born in the Catholic dungeons and found she had run from an Catholic orphanage at age 7 and has cautiously also asked if the parents' names were written anywhere and told no. He has a soft, smiling manner of asking and it doesn't seem he is collecting very important information . He fondled a young girl's head in the orphanage, whom he seemed to hope was his, asking which one in the room was her, looking at all these girls under 18. But that's when they said none; she ran off at age 7. Her given name was Alicia. Now Goya comes to see him again. He has found the daughter. Where? Lorenzo demands. Goya bitterly tells.Lorenzo says in his calm way, \" How do you know this is Inez's child?\" \"Because she looks exactly like the face I saw whenever I shut my eyes, the face that's haunted me all my life,...\" As Goya goes on Lorenzo says \"You are obsessed with Inez!\" and Goya defends himself. He's looking out for her, which Lorenzo knows in his heart he is not. Goya has seen Alicia get in a rich man's carraige and go off for the night; the old lady peddling her say Goya can have her next. What he doesn't know is that Lorenzo is on that carraige, one time we are unexpectedly happy to see actor Javier Baldem, and when Alicia (Natalie Portman, also) tries to move on him, slaps her away angrily. This is his daughter. He offers to send her to America, he wants her to leave Spain (so Goya can't force a meeting). The girl gets sassy and attacks and is out of there like a bobcat while the big heavy Lorenzo is left asking her to please come back. Later Goya tries to arrange for the two to meet, after Lorenzo warns him with deep anger that there is no way he is going to help a mother learn that her daughter is a harlot and asks why he won't leave it alone. Goya has Inez, who he bailed out of a home for the insane, in his carraige and is in the bar trying to get Alicia to come out and meet her. Alicia says\"Why would I care?\" but then a counter-revolutionary attack with the Bitish involved enters the bar and arrests the harlots, dragging Alicia away so that she looses her baby she was holding. Another girl has handed it to her while going off on a date, but we never know if it is really Alicia's or not. It is left crying under a table. Inez has gotten out of the carraige and walks upon the carnage, used to it, and picks up the baby. She later talks to the shocked Goya like it's hers. He has seen Alicia carted off. Alicia's group are freed by some handsome British , one who Alicia catches the eye of with a winking smile. Goya is in Lorenzo's office . They are accusing each other of whoring to be there. Lorenzo went from church to revolution-- -well, Goya paints for the king, paints for the new leadership when the King is deposed, paints for anyone, paints for money, Lorenzo spits. At least, maybe he didn't see the light at first, but Lorenzo has morals. Just then there is news that the British are advancing , no one is stopping them, and Lorenzo runs out and gets his wife and kids hurriedly in a coach and is following them on horse when the Brits reach him. He turns off to let the coach get away, and mobs reach him and drag him into town, where the Catholics are reinstated in power and try him instantly, find him guilty, and sentence him to death. If he repents he will be spared. He looks at them, throws their pen down. He did not pass this test last time. This time he is not going to be tortured, just have his neck cleanly broke. As he looks at a world where the man who sentenced him to death called him \"my son\", and few know him by name--Lorenzo--he can only look at a mob of strangers and see the new leadership walk out --his granddaughter now part of the inner royal circle as she stands thereon the courtly balcony with what appear to be the new King , Queen, and prince, Alicia at his side like royalty, never noticing Lorenzo as she smiled at the crowd and danced as his neck broke. But Lorenzo saw that she was doing all right for herself--that she knew how to \"whore\" through life. And that her days of abuse by men were over. Then he hears his name out of the crowd and, sweat filling his eyes with salt, just makes out the young face he'd \"cared for\", twisted and stark-raving mad, smiling broadly as she holds up a baby. He manages to give her a smile. I felt something was left out here as the baby should have confused him, made him think, oh, oh. And I felt a scene where he had to acknowledge he'd known her was in order , and should have been between all his dismissals of her as nuts while not really meeting her eyes, and this smile as if the sight of her (as she then was, out of her mind) pleased him . Only two times did it seem he cared about her--when he said \"I do care about you\" and when he said tersely that he'd never tell a mother that her daughter was a harlot. Nothing explained the kind of smile she evoked from him except if he had once loved that face while it smiled and to see it again was a present, a gift. It beat seeing her fighting for him, yelling no, getting pushed down,as he died--but her simpleton-manner, \"everything's great now, I have a baby\", would not have been enough to make me smile--I'd rather have seen her in her real mind, knowing what was going on , that I was about to die . But that out-of-it smile got him to smile as he watched the world be wrong about its need to murder him for being a heretic. In the end, children dance and sing around his body being dragged, head down , on a cart; the crazy girl joins them, picking up his hand and kissing it as Goya brings up the rear yelling \"Inez!\" You don't want to talk about anything else after it's over, and it keeps popping up as you go about the next 6 or 8 hours, heavier fare than the things you are usually involved with. You keep thinking. Was he good to her? That smile, that was the one time, that she knew of, as she had no idea he'd talked to her baby , that it had grown up.But she thought he was her love. She'd kept a candle lit for him. The smile was a gift to her. He was ultimately, finally, good to her. But never enough--for his part in creating her crazed mind, a baby raised in an orphanage, etc.He never took on that guilt, unless in trying to make the harlot daughter go away.",
      "writers": [
         "Milos Forman",
         "Jean-Claude Carrière"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0455957/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzgzMTAzODAwMF5BMl5BanBnXkFtZTcwNTUzNTc0MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Javier Bardem, Natalie Portman, Stellan Skarsgård | See full cast and crew »"],
      "reviews": [
         "There is one great flaw here that almost everyone mentions... and it's true. The accents of the non-Spanish actors clash terribly with the Spanish ones, as well as with each other. That's a real flaw, but if you can get past that, there's a great film waiting to be seen. I found I forgot all about it after the first 10 minutes. The critics just don't get this film. A lot of regular people seem to miss it too. They want a film with a typical \"leading\" role. They want their morality tales (which this certainly IS) delivered in easy shades of Black and White... no gray. They don't understand films where the title character is primarily an Observer. Sometimes that CAN be dissatisfying, but here the Observer is a genuine genius. Some people want him to be a moral giant, but he's not, he's simply an observer who has actualized the doctor's oath: First, do no harm. This is a brilliant story, and a morally complex one, too. There are some parallels to America in Iraq, though that is not the primary goal. This story illuminates the folly of any regime, liberal or conservative, as each picks its friends and foes, taking 180 degree turns from whoever was last in power. Javier Bardem gives an incredibly canny performance! Natalie Portman is totally unsentimental and totally committed to her multiple roles: just great! Stellan Skarsgard threw me off at first with the sound of his voice, but builds a performance of power and truth, in spite of it. Randy Quaid was a small revelation. And of course the film looks and sounds spectacular, with it's numerous and detailed textures, compositions and sounds. If you want to think; if you like having pat assumptions challenged; if you love people and history and art: see it!",
         "I think Goya is after all just a pretext. What Forman wanted to talk about is how people are overwhelmed by history. It's a difficult idea to be grasped for people who live in wealthy societies where nothing much happens and the biggest problems are having more money than you already have and what to do on Saturday night. But Forman manages to show you how you can be powerless and doomed when history moves fast--too fast. The real protagonist of the story is not the painter, but the former Dominican priest, whose life is totally changed--and ultimately destroyed--by the big historical events (the French Revolution, the French invasion of Spain, the English invasion of Spain, the Restoration). The same may be said for the other characters in the story. Goya is there as a witness, and as the symbolic figure of the artist who manages to create something even out of utter destruction. One could say that Goya's Ghosts are exactly those people and events Goya witnessed and can't get rid of, so that he has to turn them into drawings and paintings; but the term \"ghost\" also refers to what individuals are like in those moments when everything is changing and moving towards God knows what goal. The priest and the young girl and all the other people in the story are just pawns of history, who strut and fret on the stage and then disappear. Ghosts, because they can be annihilated in any moment. It's a sad truth, but it's truth, notwithstanding Hollywood's mythologies of super-heroes that can win against all odds. Joyce said that history is a nightmare one tries to wake up from; Forman showed us the nightmare, and the last nightmarish scene of this movie is one of those you can't forget.",
         "Masterpiece written by Jean Claude Carriere, who wrote, for example \"El discreto encanto de la burguesía\" or \"El fantasma de la libertad\" with Luis Buñuel. He also helped Buñuel writing \"Mi ultimo suspiro\", Buñuel's autobiography. This a movie not to explain, just to feel. Another great Forman movie, in my humble opinion better than \"Man on the moon\" or \"Larry Flynt\" (excellent movies anyway). Buñuel wanted to do a movie about Goya. Maybe his friend Carriere is doing a bit like a tribute to him. Buñuel would have enjoyed this incredible movie. Excellent performances by Javier Bardem, Natalie Portman, Stellan Skarsgard, Randy Quaid and everyone involved.",
         "Hollywood will have to wait for long time to see again films of such quality,films that are condemned not to have a big commercial success but films that will remain in the history of art of cinema.The \"ghosts of Goya\" is taking us back to a past time showing with incredible reality the conditions of this time,and helped by a great performance of the actors,Milos Forman gives us another sample of his rare directing talent.In the question which film i like most \"Amadeus\" or \"the ghosts of Goya\" i can't decide which is more great,Mozart-a genius of music composing,Goya-a genius of painting,aspects of their lives under the unique look of Milos Forman.When i went to see this movie,here in a small town of Greece,there were only 25 people in the cinema,while films like \"300\" were played here for 2 months with the halls full of people.What can i say?History will judge us all...",
         "I saw it yesterday on film festival. And it was great. When I was reading the description of the movie, I had some doubts. It seemed it would be yet another film about bad, intolerant catholics and good and democratic atheists. I'm just fed up with that kind of films. But it was not so. In a short - it's a great film with bad description. What it really is about, is that it doesn't matter what principles one believes in if their life is doesn't match these principles. Both inquisitors and French democrats were capable of same brutality - always, of course, in name of some noble idea - love, freedom, equality... It's not sentimental or pathetic and it doesn't try to tell you what is \"the only truth\". It simply says that its not principles and ideas that are bad - its people. Characters are very human, with many errors - but, at the same time, each of the characters, even \"villains\" have moments when you will like them. It is also because the film changes perspective several times, and those who were despots become victims. Maybe its not the best Forman's film, but it is very good.",
         "Imagine the paintings and drawings of Goya in all their darkness and beauty coming to life - this is Milos Forman's masterful film. Goya (and us)witness the folly of the Spanish royal court, the murderous sadistic perversion of the Catholic Church, the cruel inhumane madness of the Napoleonic War, along with the sensuality and beauty of life passing. This is the film's main focus: to let us experience the time and place as if seen through Francisco de Goya's eyes. As expected of a Milos Forman's film, the locales, the customs, and the overall production replicates the Spain of the late 18th century and early 19th century with the exactitude of a court painting. The cast is also excellent. As an Inquisitor turned a Napoleon's officer, Javier Bardem deserves another Oscar nomination. Stellan Skargsdar as usual does a chameleon-like transformation this time into Goya. Natalie Portman elevates herself into a higher realm of acting as the doomed, beautiful Ines. And Randy Quaid steals the screen for a few seconds as the King. Milos Forman again has given us an emotionally- and intellectually-challenging portrait of a dark era and the role of art and artist. Although some of the dramatization is slightly contrived, the film is compelling and moving and its vision lingers as Goya's art.",
         "I read someone else's comment on IMDb (much more adulatory than I would be for Goya's Ghosts), who said that it was a masterpiece not only for Milos Forman and co-writer Jean-Claude Carriere, but for Luis Bunuel too. And that intrigued me even more than I was already in anticipation for the film, merely before as a Forman fan. Upon seeing it I can understand the enthusiasm, and had a kind of private, nearly perverse pleasure in recognizing (maybe too obviously on a subjective level) little things that popped up when Carriere and Bunuel collaborated on some of the late master's best works. On the other hand, for those not too familiar with films like the Phantom of Liberty, the Milky Way or That Obscure Object of Desire, Goya's Ghosts may seem like strong, strange film-making that starts to go a little more haywire after the half-way title card \"15 Years Later\" (possibly another in-joke for Un Chien Andalou fans) pops up. But it's not only certain things regarding the line between true drama and surrealism that marks Forman's latest as something interesting. Matter of fact, it is a flawed film, notably in the casting of Stellan Skarsgaard as Goya himself. Why cast a Swedish actor, who usually isn't necessarily bad in the character-actor parts he takes on, in the role of one of the most decadent and ribald *Spanish* artists in the past 250 years of worldwide painting? Skarsgaard doesn't do too much to elevate the part outside of being the guy on the sidelines, dramatically trying to not get too much into the situations, at first, but then soon becoming like a match-maker in the second half when \"daughter\" drama happens between an ex-\"Brother\" and an ex-prisoner-of-inquisition. And yet, there is perfect casting in having Barden as the Brother Lorenzo, who doesn't change in how he tries to push aside any of the problems in his life that he doesn't want to deal with, be it questions of real faith, taking care of a certain lost woman, and his illegitimate child, even as he changes from man of the cloth to revolutionary in several years time. Seeing him in the first half in that black robe, his eyes dark and leering of Goya and even the Church to an extent, it's not wonder that he's one of the most sought-out actors of his time. And even better then that, as far as conventions go, he gets the truest kind of arc with his character. Then there's Natalie Portman who, as probably as something of both an in-joke/reversal of the tactic used in 'Obscure Object' with two actresses playing the same woman, and a sort of disintegration-of-soul aspect that Forman might be after ambivalently, embodies the crushed innocence of repressive religion. Ines is tossed into a prison following a confession- whether true or not is left nicely vague- that she's Jewish following a questioning of what she ate, and left for more than a decade. Seeing her in this section it's clear she's lucid in her presentation of a simple characterization: sweet and naive, then later torn into oblivion by insanity and a near absurd desperation to find the child she birthed while in prison. When she plays the daughter it's a little more flat and pat, as all we see of her is as a 14 year-old (yes, 14 year-old) harlot. This mixed-up matching of actors (plus a few bits with Randy Quaid as a well-played pudgy king) is set to a backdrop of Spain where society is merciless and without much compromise unless the regime changes, which is towards one way (the ultra strict Catholics) or the other (the flawed Napoleon revolution people). Meanwhile, Goya, deaf, sketches away in drawings that today seem right out of graphic novels. As mentioned, one may get some moments of random surprise as opposed to fully stark costume drama; the first appearance of Portman's daughter played by herself is a little doozy; the way the cardinal tells his choir boy to keep reading the passage even as the French soldier on horseback rides in with a decree, then shoots the boy midway through; the emergence of the British army going towards and swarming around a cart of 15 prostitutes left out in a field; the very last scene, where a cart carrying a dead man is followed by...say no more. So there is a drawback, or more than one at any rate, to Forman going for telling about the nature of the society around Goya than too much about Goya himself. It is a disappointment too to not get entirely, aside from the 'her face haunts me from that painting' logic, as to why Goya is so infatuated with Ines and her plight in the first place. There's not much to be seen into the man who drew such scandalous drawings whilst being the king's painter. What we get instead, which is intriguing and involving, if not totally successful, a story of corruption from the 'Powers-That-Be', and when it strikes at this Forman and Carriere get some good, juicy entertainment. 7.5/10",
         "A film by Milos Forman is always an event. This will probably not remain as one of the best in his career, and was surrounded by a level of controversy, not the least among critics who received it very differently. Yet, it is certainly a film to watch. The story actually does not have Goya (Stellan Skarsgård) in the center. It is rather the story of a corrupt morality policeman of the 18th century (Javier Bardem) imprisoning a young girl (Natalie Portman) on the unjust suspicion of practicing Judaism in secret. It is the story of a police state built on social injustice relying on pretended moral puritanism in order to save the system. This happens at the price of huge human suffering like the drama in the center of the story, and here is the painter as a witness, living the dilemma of becoming involved as a human or remaining a witness as an artist. We know what path Goya chose. I was not unhappy neither with the acting, nor with the story line, although it is a little bit too melo-dramatic and too much prone to coincidences. Forman is not so much focused on the drama or better say melo-drama, or even in the historical detail, although he seems to be on familiar ground getting back to the period in 'Amadeus'. What he is busy with seems to be more re-creating some of Goya's paintings and prints and tracing back the origin of inspiration of these masterpieces. In a way the film can be read as justification of the choice Goya made in life.",
         "This movie had a great storyline and kept one's attention from beginning to end, a well directed movie, I believe one of the best I've ever seen. While some period movies are overwhelmed by the attention to period detail, in this movie the background enhances and makes the movie more believable. The acting was very well performed and all the actors deserve equal mention. I would see this movie again and recommend to all. I have no doubt that this movie will garner many awards in many categories! The costumes, the backdrops and scenery were bar none and worthy of many accolades. The historical context is well worth mentioning. A terrific period in Spain's history that left a long and hideous scar on its glorious and eventful history. Enjoy and share this movie with a friend and then enjoy comparing notes of what each of you saw and felt especially attracted to!",
         "I had hesitated so much to go to see this movie \u0096 because I thought it is a period drama and I won't like the aristocracy, and I had assumed that this was a French or Spanish movie. To my surprise it is an English movie. The story is around a painter Francisco Goya (played by Stellan Skarsgard) during the turbulent times (1790-1810) when Napoleon invaded Madrid. But do not be mistaken \u0096 this is not the story of Goya. The Director (Milos Forman) uses painter Goya just to provide a canvas for two main characters to emerge\u0096the corrupt Brother Lorenzo (played brilliantly by Javier Bardem) and the innocent Ines (played outstandingly by Natalie Portman). Ines after being wrongly detained by Christian church to prison is impregnated by Lorenzo, who runs away and later joins hands with Napoleon to come back (after 15 years) as a high official to find that Ines is the mother of his child \u0096 who is now the young street prostitute. With British invading Spain, Lorenzo is publicly prosecuted and the last scene shows Ines holding the hand of the dead body of Lorenzo taken out of the town in a horse cart. Hats off to Director Milos Forman (remember One Flew over the Cuckoo's Nest and Amadeus) \u0096 who after 7 years of making movies took a sabbatical from his teaching career to make this movie. And what a marvelous movie he has made \u0096 worth the wait. The main plot is about the human race and its bigotry. The times are historic, yet significantly apply to today's world. Javier Bardem and Natalie Portman have given their award winning performances \u0096 especially Natalie Portman plays the role of the young Ines, old Ines and young prostitute daughter with such different range of get-over and acting that she astonishes us with her versatility and ease. But the movie belongs \u0096 all in all to Milos Forman. As is the class of all great directors the musical score is magnificent. The nuances of undertones of each character's thoughts are presented aptly with perfect casting. Milos always entertains us with his subtle comedy \u0096 but I would call it as a black humor (I published last week that I do not understand black humor of \"Hot Fuzz\"). Now after seeing this movie I can say that I now know and understand what is black humor perfectly well. If you like the movie do not miss the ecstatic painting displayed during the unveiling of last titles. They are masterly selected by the master crafts person Milos. If you are movie fan \u0096 and are philosophical doubter (tribute to my Guru Andreas Hensel \u0096 who is one) of everything \u0096 please go and see this wonderful movie. (Stars 8 out of 10)"
      ],
      "genres": [
         "Biography",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "The Saul Zaentz Company",
         "Kanzaman",
         "Antena 3 Televisión"
      ],
      "summaries": [
         "The painter Goya becomes involved with the Spanish Inquisition when his muse, Ines, is arrested by the church for heresy. Her father, Thomas, comes to him hoping that his connection with Brother Lorenzo, whom he is painting, can secure the release of his daughter.",
         "Painter Francisco Goya faces a scandal involving his muse, who is labeled a heretic by a monk."
      ],
      "budget": 50000000
   },
   "movielensId": 52448,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-11-08",
      "dvdReleaseDate": "2008-02-26",
      "directors": ["Miloš Forman"],
      "runtime": 114,
      "movieId": 52448,
      "title": "Goya's Ghosts",
      "mpaa": "R",
      "actors": [
         "Javier Bardem",
         "Natalie Portman",
         "Stellan Skarsgård",
         "Randy Quaid",
         "José Luis Gómez",
         "Michael Lonsdale",
         "Blanca Portillo",
         "Mabel Rivera",
         "Unax Ugalde",
         "Fernando Tielve",
         "David Calder",
         "Ramón Langa",
         "Manuel de Blas",
         "Andrés Lima"
      ],
      "imdbMovieId": "0455957",
      "originalTitle": "Goya's Ghosts",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Painter Francisco Goya faces a scandal involving his muse, who is labeled a heretic by a monk.",
      "tmdbMovieId": 11515,
      "avgRating": 3.29854,
      "releaseYear": "2006",
      "numRatings": 206,
      "posterPath": "/x04CKIV43Y9K5iTD98fB25lB0F2.jpg"
   }
}