{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt0794374",
      "video": false,
      "title": "Summer Palace",
      "recommendations": [
         12130,
         314642,
         125829,
         97943,
         118613,
         176651,
         283711,
         31185,
         86266,
         222463,
         121036,
         8943,
         41455,
         88752,
         238811,
         103875,
         292362,
         256106,
         88811,
         86267
      ],
      "backdrop_path": "/yFp0tZNVElD4KQwHmjsS1Lu5rgM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Yu Hong",
               "gender": 0,
               "credit_id": "53fb5295c3a368735e004da3",
               "name": "Hao Lei",
               "profile_path": "/u2x7OXzHeWa1u1fHjqn81VqrVaH.jpg",
               "id": 550689,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Zhou Wei",
               "gender": 2,
               "credit_id": "52fe47249251416c7508f1fb",
               "name": "Guo Xiaodong",
               "profile_path": "/9Drx4T40ASVq3IiW1sehzIeTJQ3.jpg",
               "id": 116636,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Wang Bo",
               "gender": 0,
               "credit_id": "52fe47249251416c7508f1ff",
               "name": "Xueyun Bai",
               "profile_path": null,
               "id": 936048,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Xiao Jun",
               "gender": 0,
               "credit_id": "52fe47249251416c7508f203",
               "name": "Lin Cui",
               "profile_path": null,
               "id": 74020,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tang Caoshi",
               "gender": 0,
               "credit_id": "589373f89251417ede0009d9",
               "name": "Duan Yihong",
               "profile_path": "/9neLcESBqzkjXFVn5MZJuwX6xca.jpg",
               "id": 126736,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Dongdong",
               "gender": 0,
               "credit_id": "5893741d9251417ee4000a4e",
               "name": "Meihuizi Zeng",
               "profile_path": null,
               "id": 1749258,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ruo Gu",
               "gender": 0,
               "credit_id": "5893743ac3a3684a2f0009e2",
               "name": "Xianmin Zhang",
               "profile_path": null,
               "id": 1185940,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47249251416c7508f1f3",
               "name": "Lou Ye",
               "profile_path": "/sWtD3D6PNC3xXFnexbXKk8jAIdZ.jpg",
               "id": 71056,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "589374649251417ee70009f7",
               "name": "Lou Ye",
               "profile_path": "/sWtD3D6PNC3xXFnexbXKk8jAIdZ.jpg",
               "id": 71056,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "589374889251417ed50009f9",
               "name": "Ma Yingli",
               "profile_path": null,
               "id": 1749263,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "589374d79251417ee0000a88",
               "name": "梅峰",
               "profile_path": "/bBXnro75Zsa4F7IcuR7e3c5BbBR.jpg",
               "id": 103605,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "589374f2c3a3684a22000a29",
               "name": "Lou Ye",
               "profile_path": "/sWtD3D6PNC3xXFnexbXKk8jAIdZ.jpg",
               "id": 71056,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "589374fdc3a3684a22000a34",
               "name": "Nai An",
               "profile_path": null,
               "id": 71060,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5893751a9251417ee7000a79",
               "name": "Sylvain Bursztejn",
               "profile_path": null,
               "id": 1604815,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5893752ac3a3684a160009ce",
               "name": "Fang Li",
               "profile_path": "/gIzlpd94ObD27ZMzJbgarwhXRev.jpg",
               "id": 1117481,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5893753ec3a3684a3c000ad6",
               "name": "Helge Albers",
               "profile_path": null,
               "id": 17506,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5893755a9251417ed5000a6e",
               "name": "Peyman Yazdanian",
               "profile_path": null,
               "id": 17503,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "589375729251417ee7000ac0",
               "name": "Qing Hua",
               "profile_path": null,
               "id": 1255039,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5893759f9251417ee0000b17",
               "name": "Lou Ye",
               "profile_path": "/sWtD3D6PNC3xXFnexbXKk8jAIdZ.jpg",
               "id": 71056,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "589375c1c3a3684a22000ac9",
               "name": "Zeng Jian",
               "profile_path": null,
               "id": 972483,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "589375ef9251417ee0000b5c",
               "name": "Liu Weixin",
               "profile_path": null,
               "id": 1741345,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "589375fbc3a3684a16000a78",
               "name": "Liu Weixin",
               "profile_path": null,
               "id": 1741345,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "589376179251417ee7000b49",
               "name": "Dorothee von Bodelschwingh",
               "profile_path": null,
               "id": 70924,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.06469,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 17422,
      "vote_count": 11,
      "budget": 0,
      "overview": "Country girl Yu Hong leaves her village, her family and her lover to study in Beijing. At university, she discovers an intense world of sexual freedom and forbidden pleasure. Enraptured, compulsive, she falls madly in love with fellow student Zhou Wei. Driven by obsessive passions they can neither understand nor control, their relationship becomes one of dangerous games - betrayals, recriminations, provocations - as all around them, their fellow students begin to demonstrate, demanding democracy and freedom.  Was the only Asian film selected to compete for the Palme d'Or in 2006.  In September of 2006, director Lou Ye was barred from making movies for five years because the film incorporated footage of the Tiananmen Square demonstrations and wasn't screened for Chinese officials. The Chinese government also demanded that all copies of the film be confiscated",
      "similar": [],
      "original_title": "颐和园",
      "runtime": 140,
      "poster_path": "/eVe8SnNRmCr8owFNOpB5jNu1ENQ.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [],
      "release_date": "2006-05-18",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ye Lou"],
      "runtime": 158,
      "synopsis": "Two young lovers play out their complex, erotic, love/hate relationship against a volatile backdrop of political unrest. Beautiful country girl Yu Hong (Hao Lei) leaves her village, family and lover to study at Beijing University, where she discovers a world of sexual freedom. When she falls in love with fellow student Zhou Wei (Guo Xiaodong), their relationship, driven by passions neither one can understand nor control, becomes one of dangerous games - betrayals, recriminations, provocations - as all around them, students begin to demonstrate, demanding freedom and democracy. As the protests collapse, Yu and Zhou lose each other amidst the social chaos and panicked crowds. Zhou is sent to a summer military camp, and moves to Berlin upon his release, fleeing his country and memories of Yu. In Germany, social unrest is mounting too; as the Berlin wall crashes down, Zhou, weary and still haunted by Yu, returns to China and finds her living in a small town. With their uncertain future stretched out before them, they are two changed souls in a changed world. Will they survive together or alone?",
      "writers": [
         "Ye Lou",
         "Yingli Ma"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0794374/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0NjkwMjAzOV5BMl5BanBnXkFtZTcwNzQ3Mjc1MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Lei Hao, Xiaodong Guo, Xueyun Bai | See full cast and crew »"],
      "reviews": [
         "Having watched the movie myself and reading some of the comments/reviews with regards to the movie prompted me to post something in fairness to the movie. I feel that the movie was meant to let audience have a feeling that the leads in the movies are lost. If we were to think of the backdrop of the movie, set in the late 80's, Tiananmen incident, the chant for democracy, all this would have let you understand that the China then was not a China that many could understand. The China up till the 80s was probably such a controlled and suppressed place to live in, and when these suppressed feelings and emotions were suddenly set free, it was like an explosion. The literature and external factors began influencing the way the people viewed and did things. This could explain the \"mindless\" love making scenes as the desires to love and to have sex were probably something that was not openly displayed or demonstrated. Freedom is what everyone wants, but the maturity to handle the consequence of the actions brought about by freedom might not be something that everyone can handle. The movie also explores on people who dare not love. All because they fear losing it. I personally felt the characterization was done quite well, and was aptly shown by the character Yu Hong. Love is not something that can be explained logically or defined in any one way. The insight to the characters views and actions in this movie shows that clearly. Summer Palace is a movie worth watching, but it might not be a movie that is for everyone. Keep an open mind and try and understand the time and country this movie is set in, you'd probably appreciate the movie much better that way.",
         "Lou Ye's \"Summer Palace\" (\"Yihe yuan\") has plenty of frontal nudity and a fair number of (not very attractive) sex scenes, but that's not why the movie was banned by Beijing, and Ye forbidden to work in the film industry for five years. More likely, official displeasure was incurred by the film's powerful recreation of the Tiananmen events of 1989, from the students' point of view - and, coincidentally, equaling Tolstoy's representation of the chaos of war in the Borodino scenes of \"War and Peace.\" And yet, all that is besides the point. Rather, after tonight's screening of \"Summer Palace\" in the Castro, at the 25th annual San Francisco International Asian American Film Festival, your bewildered and overwhelmed reporter is positing this central question: whither Lou Ye? After those five years (or making movies elsewhere) will Ye become the new Zhang Yimou and China's best or just an imitator of the loathsome Tsai Ming-liang, teasing and torturing the audience... just because he can? My money - and hope - is on the better scenario. However strange and convoluted and bizarre and frustrating \"Summer Palace\" may be, it appears \"sincere\" and not reaching for effect. It's a magnificent failure or a miserable masterpiece, a stupid soap opera or a splendid insight into the human condition - the choice is up to you; for me, it was all that, and more. Seen so far only at film festivals (Cannes, Toronto, Mill Valley, Pusan and Oslo), the film is due for release in France next month and not, so far, in the U.S. Lack of commercial exposure may not be a bad thing. This is a \"festival film,\" if there was ever one, and watching it on DVD may be the next best thing. If it came to theaters in this country, few people would go to see it, and of those, many would leave long before its conclusion 2 hours and 20 minutes later. And yet, and yet... The script - also by Ye, apparently heavily autobiographical - follows a group of young people from their Beijing University days in the 1980s through the present. The central character is Yu Hong, a teenager from the countryside. As played by Lei Hao - with little of Zhang Ziyi's physical charms and a hundred times her acting ability - here is a cinematic heroine for the ages: a complex, puzzling, neurotic young woman with touching aspirations and scary unpredictability. Lei Hao becomes the character in a naked, unselfconscious, totally believable way - she alone make \"Summer Palace\" a must-see film (except that you can't). Ye's way of telling the story is personal, iconoclastic, dragging here, speeding up there, taking us to Berlin (?!), unintentionally nonlinear, showing Yu Hong is similar situations time and again - and yet slowly spinning an intelligent, poetic subtext in the background. Hard as it may be to imagine, \"Summer Palace\" has something in common with Alain Resnais' \"Last Year in Marienbad,\" in its wistfulness, lack of specific believability and yet presenting a feeling that makes perfect \"sense.\" There are a hundred things \"wrong\" with Ye's work and yet it's one of the more memorable films in years.",
         "A girl leaves her home in a provincial city to attend university. She was in a sex relation; it was a good excuse to escape that. She is a poet, and her poetry seemed interesting in English translation...When she arrives in Beijing, she meets lots of people... and soon falls into a sexual relationship. She seems to be the sort of person who cannot connect to others otherwise. She gets a real boyfriend... but their relationship seems about to break up when the big demonstrations of June the second start in Beijing. While neither of the lovers has any interest in politics, the girl is obviously unhappy... her boyfriend from her home town comes to \"rescue\" her just as the police move in. If the film had ended there, it would have been excellent. The focus remained on the girl up to that point. Unfortunately, the film started to follow other characters and went on for the rest of the film discussing them. These people and their relationships were uninteresting. The film which had begun well with a clear focus ended up scattered and pointless. When the movie was over, I didn't even care about the woman who had been the focus at the beginning. I was just glad it was over with. As the first half was excellent, I gave the film 5 of 10 stars.",
         "In the late 1980's, an inexperienced young woman named Yu Hong leaves her hometown and boyfriend in the provinces to attend Beijing University. Almost immediately, she falls into a passionate love/hate relationship with a fellow student at the school. This torrid affair plays out partly against the backdrop of the student protests and subsequent massacre that occurred in Tiananmen Square in the spring of 1989. (The movie also takes place briefly in Germany, the other part of the world where significant social change was occurring in 1989). \"Summer Palace\" plays almost like the autopsy of a romantic obsession, attempting to get at the root of why we love in the way that we do. A novice at true love, Yu Hong understands neither her undying passion for Zhou Wei nor her seemingly incessant need to keep sabotaging their relationship. The closest she can come to grasping this paradox is when she says to Zhou Wei: \"I want to break up\u0085because I can't leave you.\" Love is seen almost as a form of mental illness in this film - as a debilitating, all-consuming condition that one is powerless to control or \"cure\" but which, if left unchecked, can become the single dominant force in a person's life (we rarely see Yu Hong studying, let alone going to class). One can attempt to fill the void with other loves, but the heart always comes back to the same place. \"Summer Palace\" is long and occasionally repetitious and the political aspects aren't as effectively integrated into the story as they perhaps might have been, but the movie is beautifully acted by Lei Hao and Xiaodong Guo, among others, and features incisive and sensitive direction by Ye Lou (who, along with Feng Mei and Ma Yingli, co-authored the screenplay). This is a largely impressionistic film, concentrating more on mood, imagery and emotions than on narrative. The last hour of the film - so filled with longing and regret as the characters age and attempt to come to terms with the special thing they have lost - is particularly lyrical and heartbreaking and will haunt you long after the movie is over. All told, \"Summer Palace\" is an intelligent and moving rumination on that mysterious force we call love.",
         "This Cannes Festival 2006 entry by the director of Suzhou River and Purple Butterfly (enjoyng very limited US theatrical release in early 2008) is more unwieldy but also bolder and more authentic than its predecessors, while still as moony and emotional and indebted to Wong Kar-wai and the French New Wave. You could compare this to Dr. Zhivago or Splendor in the Grass but despite its intense period flavor at times--the cluttered dorm rooms stay with you as do the rushing demonstrators, and the progression from bikes to nice cars and email is subtle but unmistakable--it hasn't got the structure or plot of the usual generation-spanning films; it's a hymn to love-longing posing as a contemporary historical epic. As such, it's poised for failure and doomed to be dismissed by many. But it's really great fun, a fluent, flowing, committed film with more to think about and respond to than much better-made and more tightly-edited work. And after it was shown at Cannes without official permission from home, it got Lou banned from film-making in China for five years. Full of intense realistic sex and frontal nudity that would be daring anywhere not to mention China , Summer Palace focuses on a passionate young woman who comes from the country to study at Beijing University just before the Tiananmen Square demonstrations and massacre of 1988, and though it brilliantly evokes the excitement, freedom, and experimentation of that period for what is essentially the director's own generation (Purple Butterfly dealt with the 1930's), and it gives a sense of the chaos and horror that follows--this extended, breathtaking Tiananmen-period sequence is a tour de force--the politics are peripheral to protagonist Yu Hong (Hao Lei) and the intense love addiction she shares with Zhu Wei (Guo Xiaodong). But when the repression comes, Xiao Jun (Cui Lin), Yu Hong's high school boyfriend, with whom she had intense sex at the film's outset, comes to rescue her and take her back to Tumen, in the country. The turbulent give and take of man-woman relationships is as intense at times as anything in D.H. Lawrence, but with a sexual explicitness Lawrence achieved only in Lady Chatterley. As played by the striking and talented Hao Lei, Yu Hong is a hell of a young woman, beautiful, alive, articulate, philosophical--her diary provides voice-over for many of the film's scenes--willful, and never satisfied with Zhou Wei, but never able till the end (fourteen years later) to let him go either. She doesn't want him, she says, but when she is with him she is happy. Any critique of the movie has to recognize that this is what it's about. It's quite true that (once again) rain is used excessively, but like many a filmmaker before him Lou Ye recognizes that rain, cigarettes, alcohol and intense sex by good looking people are enough to make a movie atmospheric and sexy and compulsively watchable. Jaunty Chinese pop songs and bursts of passionate classical strings are used with a broad hand, but they always work in context. Summer Palace is too long, and its wild abandon catches up with it in the diffuse, occasionally irrelevant sequences of the second half. When the political repression comes and Wei goes to Berlin along with Hong's best girlfriend Li Ti (Hu Lingling) and her boyfriend Ryi Gu (Zhang Ziannin), and there are details of the fall of the Berlin Wall and Perestroika that have far less urgency, the whole mood dissipates and the focus meanders. Hong, who's already caught Li Ti with the love of her life Zhou Wei, drifts or rather plunges greedily from one man to another. There's an abortion, a bike accident, adultery, a suicide, and other events, including a bittersweet reunion, but these are just blips in the long meditation on love-longing and life. Shown at Cinema Village in New York City January-February 2008.",
         "I saw this movie at the 2007 International Film Festival of Rotterdam. The director was present at the screening for a Q&A. Plot Summary (beginning only): China in the late 1980's. Yu Hong, a 17-year old girl leaves her boyfriend and father to go studying in Beijing. She befriends a girl who stays in a dorm across the hall. They go out dancing with her boyfriend and another friend, Zhou Wei. She soon knows: this is the love of her life. This is the start of a story about love, mostly from the viewpoint of Yu Hong, the girl. We get insight into her thoughts as she reads from her diary in a voice-over. The love story is set against the student protests on Tiananmen Square. The protests and riots set off a change in the lives of all the main characters. We skip through time and return with them in the late 1990's. Summer Palace has a lot to say during its 140 minutes. Becoming an adult in the 80's and 90's in China, student life, friendship, sex and most of all love. The language alternates between high-sounding diary thoughts and realistic taken-from-life dialogs. The photography varies from poetic \"print it and hang it on the wall\" quality to a grittier style, e.g. during the riots. I really liked how the director fit love making scenes so integral into the movie. In most movies, scenes suddenly stop to ensure a good MPAA-rating. Or the camera pans and zooms unnaturally to keep the 'dirty parts' out of view. Here, director Lou Ye keeps things flowing to simply tell the full story of two people during all stages of their relation. Notice for instance how Yu Hong's love making changes as the story progresses. This, and other elements such as \"defining love\" and the background of political turmoil brought back memories of Philip Kaufnan's The Unbearable Lightness of Being, based on Milan Kundera's book. I must admit that TULoB (the 1988 movie) made more impact on me when I first saw it than Summer Palace does now. But this different ranking may also be the result of my cultural background (I am European), age or maturity. This movie may speak more to the young of heart and the romantics. A bit to my surprise, the few people that I saw leaving the theater prematurely were all 50+. This movie can split audiences, I guess. Some will ravingly love it, but it may leave others unaffected. People who belong to the latter group, will probably also think that the movie is too slow or too long. I base this on comments that I have read and heard at the festival. I probably want to see this movie again. some time soon. The images and music are worth experiencing another time. Also, at times the pace of events is quite high, so it may help me to capture all of it better. I rate this movie as one of the highlights of the festival: It's probably also the best movie from China that I have seen in the last two years: 9/10. Crew Trivia: Cinematographer Qing Hua was a classmate in film school of Yu Wang, the director of photography of Suzhou River (the director's breakthrough film). Qing Hua was recommended by Yu Wang when he was unavailable. Title Trivia: Summer Palace is the name of one of the buildings at Tiananmen Square. According to the director, the events at the square mark a change in the lives of the main characters. Connection Trivia: Asked about being influenced or inspired by \"The Unbearable Lightness of Being\", director Lou Ye says that he is a big admirer of Kundera's novel, not so much the film adaptation. Screenplay Trivia: Asked about the possible difficulty of having a young woman being the center of the story, director / screenwriter Lou Ye says that it made it actually easier. With a female main character, it was more natural for him to talk about love and emotions.",
         "When I saw Summer Palace, I assumed initially that the title referred to a building near Tiananmen Square. A quick Internet search, however, showed that this is not the case. The Summer Palace (Yihe Yuan, literally The Garden of Good Health and Harmony) is an elaborate structure and garden in the hills near Beijing that was originally the emperor's summer residence. After more web searching, I discovered from a comment by Agora on the Flixster Website (http://www.flixster.com/movie/573373022) that the grounds of the Summer Palace are the location of an \"intimate bonding moment\" between the two university students who are the film's main characters. They are Yu Hong, a girl who has recently come from the country, and Zhou Wei, a more experienced member of the student intelligentsia. All the same, I like the film's French title, Une Jeunesse Chinoise (A Young Chinese Girl) better. An esoteric but appropriate alternative would be La Française (The French Girl) in reference to Jean-Luc Godard's 1967 La Chinoise (The Chinese Girl). In Godard's film, a young French woman pretends to be a Chinese cultural revolutionary. In Summer Palace, a Chinese girl learns to pose as, among other things, a French intellectual. The movie is indebted to the French New Wave in other ways as well, including use of real urban settings, choppy editing, and lots of sex. The sex is different from what we're used to. It's neither pornographic nor romantic. There are nude bodies, primarily those of the attractive Yu Hong and her sexual partners, and they perform with graphic intensity. There is, however, neither stimulation nor foreplay. The partners are undifferentiated and their positions conventional (though a shift, in later episodes, from the missionary position to sex with the woman on top may have some significance). In other ways as well, I found it hard to relate to any of the movie's characters. Though they must all have worked very hard to be admitted to an elite Beijing university, there is no indication of their academic activities. A brief sequence of documentary footage shows the Tiananmen Square demonstrations and implies the subsequent massacre but there is nothing about planning or political intent. For the characters in the movie, political action seems no more than a momentary sensation as they go about their alienated lives. Maybe this indifference is an inheritance of the Cultural Revolution. Mao went to great lengths to deprive his subjects of personal identities, including, at one point, an effort to replace names with numbers as a means of identification. It's also possible that there are things in the movie that I, as an American, just don't get. Still, I can think immediately of two memoirs, Jung Chang's Wild Swans and Anchee Min's Red Azalea, that portray individual Chinese characters in depth and with great effectiveness. These are things that director Ye Lou is not able to accomplish. These comments should not be taken as excusing the Chinese government's banning Yihe Yuan from internal distribution and prohibiting Ye Lou from making films for five years. I asked the manager of the theater in which I saw the movie whether Lou had been imprisoned. \"Not yet,\" he said. It should be kept in mind that the old men who still rule China have only been able to survive and prosper because they were once sycophants to the greatest mass murderer in human history.",
         "I received a promotional pass to see this film and went without knowing any of surrounding hype, \"controversy\" or baggage it supposedly brings with it. I have generally like most Chinese films, especially those by Zhang Yamou, so I thought I'd give it a viewing. *Warning* Many Spoilers Follow * OK, this must be made clear at the outset. If you like dim lit naked bodies and lots of sex with a Chinese twist, this movie may be worth your price of admission. But if you would like to get a bit more out of a film, be prepared to endure painfully long minutes (hours) of wordless, earnest look scenes for a few brief gems of poetic insight and genuinely interesting philosophical questions. It starts off in an interesting way with a young girl living in a small town who has just learned she has is accepted to the prestigious Beijing University. Bright lights, big city, here she comes! Cool, high-fives all around from the neighbors and a funny scene where she watches her \"boyfriend\" get drunk to cover his sadness at her leaving. Long, no, make that very very long interludes with absolutely no dialog follow, but on the up side the actors do convey quite a bit of emotion with their facial expressions. The girl and her friend end up in some out of the way place and suddenly she decides they should \"do it\" before she takes off for the big city ...cut to long scene of furious (and apparently inexperienced) humping in the dirt ....just the first of many such scenes. Fade to Beijing where the girl is now a freshman student and her friends tease her because she doesn't have a boyfriend. That soon ends when her girlfriend's fiancée just back from Germany brings a friend along. Speed through a couple of scenes of cute dancing, long walks, and earnest serious stares with absolutely no dialog .... then cut to some more furious humping. Many more incredibly long, one-take scenes follow, often with serious intended voice overs and some poetic prose, but very little action .... until, well you guessed it, more double-backed beast time. Are you starting to see the pattern here? This film drags on for nearly two and one-half hours, covers a time period of approximately 14 years from 1987 to 2001, and does so with perhaps the least amount of dialog between characters that I can remember. There are plenty of voice-over thoughts, dreams and fears expressed, just like we were reading a novel. But don't worry, if you doze off there will always be yet another steamy, rabbits-going-at-it sex scene to wake you up. Five out of ten, and I'm being kind.",
         "The only value in this over-hyped movie is in seeing how much China changes as a modern society, from the beginning of the story ( 1987 ), to the end ( 2001 ). The country is truly racing forward in that sense. The troubled, narcissistic heroine has moments on screen which are really rather touching: but she cannot seem to connect with anyone she meets at the university in Beijing. She is an emotional recluse. What is so galling is that we never, ever, get to have any clues about why she is so alienated from everything in her life. She has been plucked from a village near the border with North Korea and admitted to the very metropolitan Beijing University. She makes friends, so she is not all alone in that giant place. The only comparison which might resonate with western viewers is to think of a bright young thing from a small town in Montana who finds herself enrolled at the University of Chicago. It's a grand opportunity for her to learn and to excel, and all the leading lady can seem to do is feel depressed about her emotions, and then to \"hook up\" with an absolute Cad and Bounder. Naturally he charms her and they get into a steamy physical affair which goes absolutely no where. The leading man is a good actor but he is playing a fellow who is an out and out shark in sexual terms and not even very handsome. Near the end of this dreadful film, a woman who was friends with the leading lady -- and who has had her own fling with the \"hero\" -- drops herself off of a tall building in Berlin for no explainable reason at all !! Worse yet, many parts of the film are shot in dark hallways and with poor resolution, it felt like the director was having some kind of a mental black-out. This film cost five bucks to rent on DVD and that was precisely five bucks too many. Skip it, please, if you value your time and your own money.",
         "\"Because it is only when we make love that you understand that I'm gentle.\" That's all the character development I need. This is an ambitious film about the stalled maturation of an idealistic but troubled young woman flanked by the Tiananmen Square protests, the fall of the Berlin Wall, and the handover of Hong Kong to mainland China. The film spans a decade and a half from 1987 to 2003 so I guess the misery of Three Gorges Dam couldn't make the final cut. The direction is a little chaotic at times but it reflects the nature of the film and doesn't come off as too much of a liability. The soundtrack is impeccably chosen and the film is ultimately very sad. I was glued to this 140 minute masterpiece. Politics aside, and they are on the side, this is a remarkable film in its honest portrayal of failure, not of personal character necessarily, but of circumstance. This is another film that got its director and producer banned for five years from making films in China. Maybe it's the full-frontal nudity or the sheer quantity of sex scenes but I don't see the need for hubbub. The film is about a woman's self-reflection on why she finds comfort in the arms of different men. We see her naked inside and out. She is afraid to love out of fear, fear of something she hasn't yet experienced, but isn't that the scariest kind of fear? There are a number of things wrong with the film, perhaps, but very little could be done to improve it. Great films succeed in spite of their weaknesses. I'm not a fan of off camera narration but it works for me here. It seems additional rather than necessary. There is a maturity to the woman's voice as she narrates with entries from her diary that compliment, do not seem at odds with, the can't quite grow up activities of the woman on screen. In order to get from the Berlin Wall to the Hong Kong Handover, 1989 to 1997, we're treated to narrative on screen text to fill us in on what's happening to the characters. Ordinarily that would be a deal breaker for me, in theory at least, but again, it works. Finally, as if this were a real story about real people, after the final denouement occurs we're given updates on what happened or didn't happen to the principle characters. Frankly, as gut-wrenchingly sad but true as the final scene is I wish it would have just faded to black. But I think it's a tribute to the strength of the characters that I found myself intrigued by the postscript. Having said that, I think one could argue that from a strictly script perspective a little more fleshing out was in order ... and I don't mean that full-frontally. I think it comes down to this: if you've ever known passionate, poetic, misguided people, you know these people right away. They're part beautiful and part brutal, there's no talking them out of it. That's the point. This film doesn't set out to explain, diagnose, or change its characters. It just wants to show them to you in all their painful glory, and I think it does a very good job of it. Then again, maybe it's just a case of been there, done that."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Centre National de la Cinématographie (CNC)",
         "Dream Factory",
         "Flying Moon Filmproduktion"
      ],
      "summaries": ["Country girl Yu Hong leaves her village, her family and her lover to study in Beijing. At university, she discovers an intense world of sexual freedom and forbidden pleasure. Enraptured, compulsive, she falls madly in love with fellow student Zhou Wei. Driven by obsessive passions they can neither understand nor control, their relationship becomes one of dangerous games - betrayals, recriminations, provocations - as all around them, their fellow students begin to demonstrate, demanding democracy and freedom. Protests collapse, and Yu and Zhou lose each other amidst the social chaos and panicked crowds. Zhou Wei is sent to a summer military camp, and on his release moves to Berlin, fleeing both his country and memories of Yu. She finds a job, a lover, but can not forget Zhou. In Germany, social unrest is mounting: calls for freedom, demonstrations for democracy. A familiar story for Zhou. Weary, still haunted by Yu, he returns to China as the Berlin Wall crashes down. He finds her at last, in a small town. From evening to dawn, their future stretches before them, two changed souls in a changed world."],
      "budget": 2500000
   },
   "movielensId": 52561,
   "movielens": {
      "languages": [
         "Deutsch",
         "普通话"
      ],
      "releaseDate": "2006-05-18",
      "dvdReleaseDate": "2008-03-11",
      "directors": ["Lou Ye"],
      "runtime": 140,
      "movieId": 52561,
      "title": "Summer Palace",
      "mpaa": "",
      "actors": [
         "Hao Lei",
         "Guo Xiaodong",
         "Xueyun Bai",
         "Lin Cui",
         "Duan Yihong",
         "Meihuizi Zeng",
         "Xianmin Zhang"
      ],
      "imdbMovieId": "0794374",
      "originalTitle": "颐和园",
      "genres": [
         "Drama",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": ["D2frDPkiJmk"],
      "plotSummary": "Country girl Yu Hong leaves her village, her family and her lover to study in Beijing. At university, she discovers an intense world of sexual freedom and forbidden pleasure. Enraptured, compulsive, she falls madly in love with fellow student Zhou Wei. Driven by obsessive passions they can neither understand nor control, their relationship becomes one of dangerous games - betrayals, recriminations, provocations - as all around them, their fellow students begin to demonstrate, demanding democracy and freedom.  Was the only Asian film selected to compete for the Palme d'Or in 2006.  In September of 2006, director Lou Ye was barred from making movies for five years because the film incorporated footage of the Tiananmen Square demonstrations and wasn't screened for Chinese officials. The Chinese government also demanded that all copies of the film be confiscated",
      "tmdbMovieId": 17422,
      "avgRating": 3.30769,
      "releaseYear": "2006",
      "numRatings": 26,
      "posterPath": "/eVe8SnNRmCr8owFNOpB5jNu1ENQ.jpg"
   }
}