{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "chess",
            "id": 316
         },
         {
            "name": "hustler",
            "id": 2348
         },
         {
            "name": "child prodigy",
            "id": 5561
         },
         {
            "name": "new york city",
            "id": 14512
         }
      ],
      "imdb_id": "tt0108065",
      "video": false,
      "title": "Searching for Bobby Fischer",
      "recommendations": [
         1088,
         38718,
         8986,
         28176,
         25330,
         26748,
         13554,
         53287,
         28761,
         106143,
         10511,
         16297,
         21355,
         29193,
         10705,
         10608,
         13346,
         40634,
         11393,
         14475
      ],
      "backdrop_path": "/kNzHNqlFy2FCzwihvfcMMAQ5NbX.jpg",
      "revenue": 7266383,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Josh Waitzkin",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065df5",
               "name": "Max Pomeranc",
               "profile_path": null,
               "id": 85313,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Fred Waitzkin",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e0b",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Bonnie Waitzkin",
               "gender": 1,
               "credit_id": "52fe45e39251416c75065e0f",
               "name": "Joan Allen",
               "profile_path": "/Atg0mSjK9Dl98YBsFvBuGO8PG5m.jpg",
               "id": 11148,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Bruce Pandolfini",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e13",
               "name": "Ben Kingsley",
               "profile_path": "/2Eu3j31JDJek70ZXLY6xfeUaJoR.jpg",
               "id": 2282,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Vinnie",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e17",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Jonathan Poe",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e1b",
               "name": "Michael Nirenberg",
               "profile_path": null,
               "id": 554247,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Poe's Teacher",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e1f",
               "name": "Robert Stephens",
               "profile_path": "/q1GXvr08N9MzkTrMQjSXwDPrzRV.jpg",
               "id": 41957,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Kalev",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e23",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Morgan",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e27",
               "name": "Hal Scardino",
               "profile_path": "/q8TX9vJfLSzYDztSIDmz1ao002t.jpg",
               "id": 69301,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Russian Park Player",
               "gender": 0,
               "credit_id": "52fe45e39251416c75065e2b",
               "name": "Vasek Simek",
               "profile_path": "/rilqGvic4w4s1gTpTCTJUXNuwo6.jpg",
               "id": 554248,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Tunafish Father",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e2f",
               "name": "William H. Macy",
               "profile_path": "/cYmHYCGxkOVZgu2oDyhF6lKgfaj.jpg",
               "id": 3905,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Tournament Director",
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e33",
               "name": "Dan Hedaya",
               "profile_path": "/5E4SUVfLMUKNCiP0dMhyOv3XHVZ.jpg",
               "id": 6486,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "School Teacher",
               "gender": 1,
               "credit_id": "52fe45e39251416c75065e37",
               "name": "Laura Linney",
               "profile_path": "/unRRWITXrZsbk9iTmnjVxd6yZv9.jpg",
               "id": 350,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e39251416c75065df1",
               "name": "Steven Zaillian",
               "profile_path": "/7fPmGcUA8I0l74UrVunepIFEjMa.jpg",
               "id": 2260,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e39251416c75065dfb",
               "name": "Conrad L. Hall",
               "profile_path": "/fGWnmu9EAYqX974sP0ddkOjgVEy.jpg",
               "id": 8217,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e39251416c75065e01",
               "name": "Fred Waitzkin",
               "profile_path": null,
               "id": 554246,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e39251416c75065e07",
               "name": "Steven Zaillian",
               "profile_path": "/7fPmGcUA8I0l74UrVunepIFEjMa.jpg",
               "id": 2260,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5554b424c3a368208a002a82",
               "name": "William Horberg",
               "profile_path": null,
               "id": 15906,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5554b439c3a3682083002b8f",
               "name": "Scott Rudin",
               "profile_path": "/zR8sdlGblto6dneAr2mckTowwEl.jpg",
               "id": 2997,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5554b4849251416ddb002978",
               "name": "Tina Gerussi",
               "profile_path": null,
               "id": 42306,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5554b4959251416dd9002bb9",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "571c250e925141115f006d74",
               "name": "James Horner",
               "profile_path": "/oLOtXxXsYk8X4qq0ud4xVypXudi.jpg",
               "id": 1729,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.081072,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14291,
      "vote_count": 119,
      "budget": 0,
      "overview": "A prepubescent chess prodigy refuses to harden himself in order to become a champion like the famous but unlikable Bobby Fischer.",
      "similar": [
         11474,
         769,
         18487,
         968,
         3116,
         1771,
         772,
         1427,
         594,
         311,
         164,
         1213,
         9475,
         9428,
         101,
         242,
         334,
         284,
         1429,
         44214
      ],
      "original_title": "Searching for Bobby Fischer",
      "runtime": 110,
      "poster_path": "/ceIEEgMqm3FxHmY9OdYGGA0Jr8J.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mirage Enterprises",
         "id": 932,
         "origin_country": ""
      }],
      "release_date": "1993-08-13",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Every journey begins with a single move.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Zaillian"],
      "runtime": 109,
      "synopsis": "Searching for Bobby Fischer was inspired by the life of chess prodigy Josh Waitzkin, as written by his father Fred Waitzkin. Josh (Max Pomeranc) is a \"regular kid\" who begins evincing signs of being a genius at chess. His father (Joe Mantegna) encourages this, hoping that it won't fundamentally change his son's healthy outlook on life. But Josh is taken under the wing of cold-blooded chess instructor Bruce Pandolfini (Ben Kingsley), who indoctrinates the boy in the \"Bobby Fischer\" strategy. Unfortunately, Pandolfini emphasizes all of Fischer's negative traits, especially his contempt for his opponents. Josh is in danger throughout the film of sacrificing his essential decency, but in a rousing conclusion, the boy is able to successfully blend ruthless competition with good sportsmanship. ~ Hal Erickson, All Movie Guide",
      "writers": [
         "Fred Waitzkin",
         "Steven Zaillian"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108065/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NzY3ODg3N15BMl5BanBnXkFtZTcwNzU1NzcyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Mantegna, Ben Kingsley, Max Pomeranc | See full cast and crew »"],
      "reviews": [
         "Let me start by saying I am not a person who goes for sentimental, \"heart on your sleeve\" type big dramas that seem to be the idol of most professional critics. In fact, to put it bluntly I totally loathe them. (I prefer movies that at least try to have a cohesive plot line with a reasonably accessible story idea and some decent tight pacing; ie: something that's both informative and fun. This is my interpretation of the classic idea of \"a good story, well told\".) With that in mind, I wish to state that this movie (film, whatever) really does work, at all levels. It's a good intelligent story (apparently based on fact} about a very bright, very young kid who is discovered to be naturally good at chess and enters the serious national tournaments. During which time, there are raised issues of the concept of the winning ethos; and keeping (or losing) your humanity in the process. This cast is magnificent here. The central leads are played by Joe Mantegna and Max Pomerance as the father and son respectively. Both give very well-balanced performances. Sensitive, without being sappy. Max in particular is very good, especially in the dramatic climax of the film; which he handles with total dignity. It could have been so over the top and patronizing in lesser hands, but this time it isn't. They are ably supported by Laurence Fishburne and Ben Kingsley as two different types of coaches, from \"opposite side of the tracks\" (sorry for that old cliché). It may seem formulaic, but in this case the dramatic contrasts works surprisingly well, and both come over as intelligent representatives of their particular points of view. And there are also great character moments by David Paymer {QUIZ SHOW, MR Saturday NIGHT, etc} and Hal Scardino {THE Indian IN THE CUPBOARD} as well. Over all, I would highly commend this film as the type of story that manages to tread the fine line between intelligent ideas and an entertaining story. I recommend it to everyone. Give it half a chance and it can work for you. It really is a great example of intelligently entertaining!",
         "_Searching for Bobby Fischer_ is possessive of a certain wonderful insight; it is a film that offers no heart-warming premeses and still manages to ease the soul. The characters dwell in an utterly contemporary world; you will find no neighbors hauling in bags of money, chiming churchbells, perfect families, or million-dollar smiles anywhere in the film. At the same time, this world of this film exhibits a resilience against its crueler realities that most of the art of the twentieth century eschewed in favor of probing the darkness of existence. Yes, the main characters are prosperous, but the spectre of Fischer hangs over the world as a daunting warning of things to come. The mood of the piece, enhanced by the excellent cinematography, sets the film up to succeed wonderfully, and the actors and text deliver. One of the things I like the most about this movie, superficially, is that it does not insult the game of chess as it depicts it. The depiction of the chess world is insightful and accurate, from the sharp division between granite-hewn chess scholars and colorful tactical wizards to the truly unequaled awe and gravity accompanying the notion of the Grandmaster. Perhaps these are things that can only truly be appreciated by those who have ventured to this world, but, thankfully, the film integrates these elements seamlessly into a universal story that is original and poignant in its detail and elegance. Every actor in this film is spectacular, without exception. That is a bold statement, but it is completely justified. At no point do any of the actors miss a step; all the performances are smooth and appear to be utterly effortless. In their featured roles, Ben Kingsley and Lawrence Fishburne put in performances that match in art, craft, and intensity, if not in length, any of their more prominent film roles. Joan Allen is mind-bogglingly wonderful, considering how precise she has to be to fit such a massive character into such a truncated part in the script. This is Joe Mantena's very finest performance, and, of course, this movie contains child acting to match any film ever made. Even the bit parts are acted with intensity, depth, and elegance. A lot of this is easy to miss because, on the surface, the film is so even-handed, but repeated viewings continually bring to attention wonderful nuances of these performances. Any summary or synopsis will fail to accurately relate the \"message\" of this film; as in any great work of art, the quickest, most efficient way to word the resolution of the film's ideas and conflicts is to watch the film. This is where _Searching for Bobby Fischer_ really shines. There is no way these characters could have ended up where they are from any other sequence of events than the one that took place; this is a wonderful example of how a plot is woven into a story rather than imposed on it. The flipside of this is that there is extremely little to be found in this film that can be applied universally without reservation, and yet it still manages to be convincing. There is something mysterious about this movie that rises toward the staggering mysteries of life, and repeated viewings are really the only means toward a full understanding of these ideas. Undoubtedly, this is the best film made in the 1990s based on a true story (if you, like me, discount _Schindler's List_ from such assessments. It hardly seems fair to compare _Schindler's List_ to any other film due to its unique purpose.). If you have not seen it, I highly recommend it. It may just change your life.",
         "It's one of the toughest jobs a father faces--how hard should you push to \"make a man\" out of your young son. \"Searching for Bobby Fischer\" offers a gentle and unexpected answer: You should listen for your son to tell you how \"manly\" he wants to be. Young Max Pomeranc is letter-perfect as the chess prodigy who refuses to become ruthless despite the prodding of his father and his surrogate-father. Joe Mantegna and Ben Kingsley give moving performances as men who can be convincingly converted to the truer, sweeter morality of a young child who doesn't need to be \"tough\" in order to be good. Watch for an understated, underrated performance by Joan Allen as the mom. A beautifully photographed, beautifully paced drama that should reduce anyone with more empathy than a statue to heartfelt tears.",
         "There are few movies I would call perfect in terms of script, photography, performance, and continuity. This is one of them. I have watched this film at least 8 times, and have seen something new in it every time. This is based on a true story, and it is much more than a movie about parents demanding time, effort, and sacrifice of a child chess prodigy. This is about a seven-year-old boy who knows who he is, and resists adults attempts to make him into someone he is not. Max Pomeranc gives about the best performance I have ever seen by a child actor in the role of Joshua Waitzkin. Fortunately, Josh has a mother (played by Joan Allen) who recognizes Josh's innate goodness and protects him from those who want to change him. This movie is about a father (Joe Mangtegna) learning to respect and appreciate who his son is, instead of trying to make him into something he isn't. I had seen the movie three times before I understood the title. The adults are searching for \"the next Bobbie Fischer\" (a television reporter in the film uses those words). Josh Waitzkin asserts to his teacher \"I'm not him.\" Watch this movie with your children!",
         "This is such a great film! And there is more than one reason why I believe this. First of all, Ben Kingsley is one of my favorite actors. And this movie(along with \"Sneakers\", \"Death and the Maiden\", \"Twelfth Night\", and \"Sexy Beast\"), really helps me believe that. And I believe that this is one of his best characters, and best films. As far as Max Pomeranc's acting is concerned...wonderful. Even today I can't think of a kid who's had a better performance. Truly good acting. And sadly for his short lived career, I'd have to say he was in his prime there. The creativity in this film is awesome! My favorite scene is when Bruce(Kingsley) is teaching Josh(Pomerac) the dynamics of chess, and when the camera flips back and forth between the chess pieces, each time building up the conversation, and going up the ladder of significant pieces. Powerful scene, with powerful lessons. I also enjoy that if you don't have much of an interest in chess, that it still keeps you capitvated. I wasn't as interested in chess until I saw this movie. And I'm even more interested in film (I thought that I couldn't be more interested). And finally...the score. I love James Horner. And this is one of the reasons why. Along with \"Sneakers\", \"Braveheart\", and many other Horner scores, I find it makes the movie that much better. Truly a movie to remember always.",
         "In SEARCHING FOR BOBBY FISCHER, Steven Zaillian's is the most complete and near-flawless film-work of the 1990s. I can't say merely \"director's work\" because he also wrote the screenplay. And (I have to presume) he chose Conrad Hall as d.p., James Horner for the music, Wayne Wahrman as film-editor, and he worked with a lighting director, sound director, set director and more -- each of whom did a job worthy of the highest praise. And the cast, the supernal cast -- many of whom have had larger and more celebrated roles, but none of whom has ever nailed a role more satisfyingly -- Kingsley, Mantegna, Allen, Fishburne -- even the smaller and cameo bits are effectively faultless -- by Linney, Stephens, Shalhoub, Pendleton. And of course, Pomeranc's work is a kind of miracle. Every part of it evokes from me applause for Zaillian's imagination, sensibility, knowledgeability, intelligence, judgment. I confess I post this comment because none of the other comments I've seen on SEARCHING seems to me to realize how much Zaillian must have contributed to making this -- and I think it deserves this adjective -- GREAT movie. (I further confess I didn't first watch the movie until some three years after its debut because of its title. I was damned if I wanted to spend two hours in the presence of someone as nasty-seeming as Fischer. But the title of course was Fred Waitzkin's, the author of the source book. Fred, you cost me a few years -- but Steven Zaillian has made up for it many times over.)",
         "For chessplayers and non-chessplayers alike, this is a secret gem of a movie. Anyone who have watched Josh Waitzkin's tutorials in the Chessmaster computer-game will probably have done some research into who he is, and probably this movie will have popped up somewhere in your search. For all of you who have found the movie that way: Go rent or buy it. For all the rest: Go rent or buy it. Why?: Cause it's not really about chess at all. It's a story about a 7 year old kid, taking a very keen interest in a hobby (and being VERY, VERY good at it), and also a story of his family and teachers pressuring him. Besides a strong cast of people like Fishburn, Kingsley and Montegna, it also has some humorous moment (like the tuna-sandwich guy (William H. Macy)). All in all, very watchable for everyone, and one of the first movies I've felt like commenting on here. Only drawback: The link to Fischer was unnecessary, and doesn't add anything to the movie.",
         "***SPOILERS*** The movie \"Searching for Bobby Fischer\" parallels the lives of Grand Chess Master Bobby Fischer with that of young seven year-old chess prodigy Josh Waitzkin, Max Pomeranc. The movie does it by inserting newsreel footage of Bobby winning the World Chess Championship Tournament in Reykjavik Iceland back in 1972 against the Soviet Unions Boris Spassky. It then jumps back to when Bobby Fischer was a young boy, and man, in the 1950's and 1960's as his obsession with chess brought him the fame and glory that he sought. Yet at the same time denied him the life of a normal boy growing up in post WWII America that his night and day chess fixation cost him. Josh has lots of promise in becoming a future Bobby Fischer; he has a computer-like mind and a natural ability to foresee moves by his opponents, even before they even know that they'll make them. One thing that Josh doesn't have is that drive and determination, as well as killer-instinct, that Bobby Fisher had and as far as I know still does in playing to win and pulverizing his opponents into the ground by doing it. Josh likes all kinds of sports, besides chess, and his dad Fred Waitzkin, Joe Mantegna, is a sports writer who takes Josh along to the Yankee and New York Mets baseball games where the young boy really has as much of a good time watching the ball games as he has playing chess. Fred realizes what a whiz his young son Josh is in the game of chess and wants to have him study the finer points of the game by hiring former national chess champion Bruce Pandolfini, Ben Kingsley, to tutor him and Bruce right away realizes that Josh has the makings of another Bobby Fischer. What does bother Bruce about Josh is his playing with the local chess hustlers like Winnie, Laurence Fishburn, in Washington Square Park in Greenwich Village. Which, in Bruce's opinion, is far to fast and doesn't give young Josh time to develop his all around concentration and understanding of the game of chess. During the course of the movie Josh is driven relentlessly by Bruce in his attempt to mold him into another Bobby Fischer but Josh slowly starts to lose his interest in winning all the chess tournaments that he enters. The very fact of his invincibility makes Josh feel uneasy since it's always expected of him to win, like the sun is expected to rise in the morning, that there's no fun or excitement in it for him any more. Losing becomes more of a growing experience for Josh and even arouses his passions in making him feel more human. Josh is also too sensitive to beat down his opponents, like Bobby Fischer did. That later lost him the championship game against the likewise seven year-old chess phenomenon Jonathan Poe, Michael Nirenberg. After his defeat to Jonathan Josh is looked on as if he let down all those who believed in him and at the same time he starts to get his life back together as a young boy living a normal life and not carrying the weight of the entire world of chess on his shoulders. It's during this time that the real talent that Josh had in playing chess comes up to the surface, without him being driven relentlessly by Bruce. Those untapped talents leads him to go back to playing chess, first with his friend at the park Winnie, and then working his way back in winning a number of tournaments to his becoming a top chess champion competitor. All that finally earns Josh a re-match with Jonathan for the Junior Chess Championship of the US in Chicago at the conclusion of the film. Powerful movie and very intense for the young boys and girls in it in how they drive and push themselves to be the best at the game of chess and at the same time putting themselves in danger of sacrificing their one and only childhood to do it. Josh Waitzkin did reach the top back then when the movie \"Searching for Bobby Fischer\" was made in 1993 and is still there some ten years, and dozens of tournaments, later. He did it without losing both his childhood and his kind heart and sensitivity for his fellow man by doing it.",
         "Chess is a challenging game that hasn't been given its due in the art of cinema, so it's a pity \"Searching for Bobby Fischer\", one of the few \"chess movies\" out there, offers an unconvincing, Hollywoodized treatment of the subject. This is one of those completely conventional, crowd-pleasing entertainments that make everything look too easy (it almost argues that one doesn't need to practice or study to become really good at something, as long as he has a natural gift for it; I'm sure the real Josh Waitzkin would dismiss all that as pure baloney), and rely on a predictable \"Rocky\"-type final showdown (in this case, against a mean-spirited little chess whiz). Nonetheless, with such a splendid cast (including an excellent performance by newcomer Max Pomeranc), it would be impossible for this film not to have its interesting and affecting moments. (**1/2)",
         "But also a great movie period. The characters are well developed and I think that the reactions of the parents and the chess playing kids is a great metaphor for sports in general. The one kid (Poe) is deprived of almost everything else but chess. It's not hard to see him ending up like the guys in the café, spending their time on nothing but chess, lost to life. The ending was a bit hokey, as even I, with my low chess skills, would have recognized what was going to happen with just the two pawns left on the board but it doesn't affect my enjoyment of the movie much. The interaction between Morgan and his dad and Josh and Morgan is great, and Josh's empathy for Morgan contains lessons in sportsmanship for any parent. You should see this movie."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["Mirage Enterprises"],
      "summaries": [
         "Josh Waitzkin is just a typical American boy interested in baseball when one day he challenges his father at chess and wins. Showing unusual precocity at the outdoor matches at Washington Square in New York City, he quickly makes friends with a hustler named Vinnie who teaches him speed chess. Josh's parents hire a renowned chess coach, Bruce, who teaches Josh the usefulness of measured planning. Along the way Josh becomes tired of Bruce's system and chess in general and purposely throws a match, leaving the prospects of winning a national championship in serious jeopardy.",
         "A prepubescent chess prodigy refuses to harden himself in order to become a champion like the famous but unlikable Bobby Fischer."
      ],
      "budget": 0
   },
   "movielensId": 529,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-08-13",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Steven Zaillian"],
      "runtime": 110,
      "movieId": 529,
      "title": "Searching for Bobby Fischer",
      "mpaa": "PG",
      "actors": [
         "Max Pomeranc",
         "Joe Mantegna",
         "Joan Allen",
         "Ben Kingsley",
         "Laurence Fishburne",
         "Michael Nirenberg",
         "Robert Stephens",
         "David Paymer",
         "Hal Scardino",
         "Vasek Simek",
         "William H. Macy",
         "Dan Hedaya",
         "Laura Linney"
      ],
      "imdbMovieId": "0108065",
      "originalTitle": "Searching for Bobby Fischer",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["8khmNiamBxo"],
      "plotSummary": "A prepubescent chess prodigy refuses to harden himself in order to become a champion like the famous but unlikable Bobby Fischer.",
      "tmdbMovieId": 14291,
      "avgRating": 3.83335,
      "releaseYear": "1993",
      "numRatings": 11695,
      "posterPath": "/ceIEEgMqm3FxHmY9OdYGGA0Jr8J.jpg"
   }
}