{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "horse race",
            "id": 643
         },
         {
            "name": "horse",
            "id": 2673
         },
         {
            "name": "endurance",
            "id": 155395
         },
         {
            "name": "ex prostitute",
            "id": 160934
         },
         {
            "name": "mexican",
            "id": 163127
         }
      ],
      "imdb_id": "tt0072705",
      "video": false,
      "title": "Bite the Bullet",
      "recommendations": [
         60799,
         42500,
         64382,
         69605,
         146563,
         37923,
         15266,
         30941,
         98248,
         96337,
         42997,
         60643,
         43348,
         39435,
         49683,
         60646,
         54302,
         10786,
         43319,
         60285
      ],
      "backdrop_path": "/3hwY19LcxaH3vo0urbnQGads27I.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Sam Clayton",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f92b",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Miss Jones",
               "gender": 1,
               "credit_id": "52fe44de9251416c9101f92f",
               "name": "Candice Bergen",
               "profile_path": "/wzRihM7eZyCyAuKpgyBewCzDRWJ.jpg",
               "id": 11850,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Luke Matthews",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f933",
               "name": "James Coburn",
               "profile_path": "/sEouHlYr1hOzl3u6E4KV6gIJSPd.jpg",
               "id": 5563,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mister",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f937",
               "name": "Ben Johnson",
               "profile_path": "/yqPEXD23jLYxmCCLNWtyQ3tJ89V.jpg",
               "id": 8258,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sir Harry Norfolk",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f93b",
               "name": "Ian Bannen",
               "profile_path": "/o1M55VhFgRimGz9cNjadt8fWlXE.jpg",
               "id": 2481,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Carbo",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f93f",
               "name": "Jan-Michael Vincent",
               "profile_path": "/dZcM4xaywRFo4HC9vG23epx7kox.jpg",
               "id": 83037,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Jack Parker",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f943",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Honey",
               "gender": 1,
               "credit_id": "52fe44de9251416c9101f947",
               "name": "Sally Kirkland",
               "profile_path": "/bAjUA08z6k8FZ3bu5QWcMWWVdMQ.jpg",
               "id": 12134,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Slim",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f94b",
               "name": "Buddy Van Horn",
               "profile_path": "/i4aTK9tiPHaOXdskrpuvMXbUyLG.jpg",
               "id": 66226,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Rosie",
               "gender": 1,
               "credit_id": "52fe44de9251416c9101f94f",
               "name": "Jean Willes",
               "profile_path": "/tf8Mdg3ULobhiTK1pqikikyS9WB.jpg",
               "id": 101479,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mexican",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f953",
               "name": "Mario Arteaga",
               "profile_path": null,
               "id": 976857,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Reporter",
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f957",
               "name": "Robert Donner",
               "profile_path": "/6GXjsXEC5a0BoFwq1pad5OqJ5M9.jpg",
               "id": 13875,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f921",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44de9251416c9101f927",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5352be110e0a2656140035c7",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5352be190e0a26560e0035f2",
               "name": "Alex North",
               "profile_path": null,
               "id": 10536,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5352be210e0a26560a00369c",
               "name": "Harry Stradling Jr.",
               "profile_path": null,
               "id": 14094,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5352be290e0a26560a00369e",
               "name": "George Grenville",
               "profile_path": null,
               "id": 67894,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5352be330e0a265606003408",
               "name": "Robert F. Boyle",
               "profile_path": null,
               "id": 2657,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5352be3a0e0a26560600340b",
               "name": "Bob Signorelli",
               "profile_path": null,
               "id": 978423,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.912911,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32617,
      "vote_count": 28,
      "budget": 4000000,
      "overview": "At the beginning of the 20th century, a newspaper organizes an endurance horse race : 700 miles to run in a few days. 9 adventurers are competing, among them a woman, Miss Jones, a Mexican, an Englishman, a young cow-boy, an old one and two friends, Sam Clayton and Luke Matthews. All those individualists will learn to respect each other.",
      "similar": [
         2023,
         707,
         34584,
         2055,
         36955,
         57201,
         15092,
         9342,
         947,
         196,
         38757,
         57212,
         9277,
         565,
         142,
         452507,
         11509,
         2539,
         23047,
         2395
      ],
      "original_title": "Bite the Bullet",
      "runtime": 132,
      "poster_path": "/a5fYK94xQlvnegBTL5yULXYGYEF.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Persky-Bright Productions",
            "id": 624,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vista",
            "id": 14686,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1975-09-26",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Brooks"],
      "runtime": 132,
      "synopsis": null,
      "writers": ["Richard Brooks"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072705/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAyNDEzOTA4OTheQTJeQWpwZ15BbWU4MDA4Njg4MTEx._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Gene Hackman, Candice Bergen, James Coburn | See full cast and crew »"],
      "reviews": [
         "If \"Bite the Bullet\" sentimentalizes the independence and force of ordinary men without glamor who have to struggle for a prize in a hard, bitter, and lonely environment, it also examines the cruel or inhumane treatment often inflicted on animals\u0085 \"Bite the Bullet\" is an all-star Western about a 700-mile horse race that takes place in the middle of 'Nowhere, USA' at the turn of the last century, for a chance to win the grand prize of $2000\u0085 At the head of the line is Gene Hackman, an ex-Rough Rider who believes in caring for lame animals, and despises cruelty to horses, ladies in distress, lost kids and lost causes\u0085Hackman has got the heart, and at the film's climax, he is the sleeper\u0097the one to beat\u0085 His old-timer friend from fighting days at San Juan Hill is James Coburn, a natural-born gambler who certainly can't afford to lose\u0085 He just bet everything on this race, and got seven-to-one\u0085 Coburn and Hackman have a great chemistry together, and their friendly rivalry imposes the name of the game\u0085 Also riding: Candice Bergen, who has 'two thousand reasons' to compete in the race; Ben Johnson who desperately wants to win the prize to be a man to remember; Ian Bannen, the tough Englishman who comes 5,000 miles to beat the best; Mario Arteaga, the cool Mexican who needs the money for his loving family in spite of suffering from unbearable toothache; and Jan Michael-Vincent who brings the lower calibrations of judgment, antagonism, and rage to his interactions... This punk kid certainly has a knack of provoking a man to violence\u0085 He soon will be in his own best way to learn some life lessons from 'real' cowboys... Brooks' movie has the courage to show how beauty can flourish in our treatments for animals\u0085 He accomplished a film that is beautifully photographed and expertly put together\u0085 Brooks leaves a whole host of abiding impressions through his nine riders' true character\u0085",
         "\"Bite the Bullet\" has a lot to chew on, and boasts a fine cast held firmly under control. Hackman gives his usual unobtrusive acting lesson, Coburn twinkles but not too much, and Bergen gives the first decent acting performance of her career (after Hackman chewed her out for her lack of professional skills and she requested his help). Questions of greed, competition, teamwork, loyalty, betrayal and humanity are all given a good and non-medicinal airing. There's enough action here for the inert, and enough philosophy for the grownups. There's been discussion in these reviews of the director's use of slow-motion. Slow motion is not used here to make intellectual points, it is an instrument of emotional expression. When one character in real time passes another in slow motion, it conveys to us how they both feel at that moment, and doesn't need to carry any other freight. As an expressive device, it works. The question of animal abuse has also come up in these pages. In \"Bite the Bullet\" the horses are always photographed as heroes, often visually overwhelming their riders. Gene Hackman is shown from the beginning as a fighter of cruelty against animals, and every abuse he witnesses he then tries to remedy. The education of the Jan Michael Vincent character is a case in point. Furthermore, this picture makes you care about the animals, unlike the traditional offhand Hollywood cruelty. Dozens of horses were killed to make the last reel of the Errol Flynn \"Charge of the Light Brigade\" and the film itself couldn't care less. You can see trip wires being used wholesale as late as in \"Khartoum\", and when those horses went down, they broke legs and were immediately shot, not pretend, for real. Hollywood's excuse has always been that horses are expensive and they don't kill them thoughtlessly. Stunts are performed by circus horses, which presumably don't come to harm. We're told the only horses that get killed are old and already destined for the glue factory. Whether this justifies trip wires or not is up to you, but that's what they say. \"Bite the Bullet\" comes off as sensitive and responsible by comparison. This is no snuff film. The Oscar-winning sound design makes you really care when the horses are supposed to be in distress. A lot worse things happen to the human characters in just about every action-adventure film of the last twenty years. Is the \"yuck\" factor we're now trying to get used to more or less disgusting? All in all, \"Bite the Bullet\" is a worthwhile film with content, humor and beauty. There's thousands of worse ways to spend your time than watching this movie.",
         "By the 1970s, the western genre was virtually exhausted and many of the westerns made around that time were either cheaply-made, badly-dubbed European offerings, or depressingly violent revenge westerns (e.g The Hunting Party, The Revengers, The Deadly Trackers, The Last Hard Men, etc.) Bite The Bullet, however, is a happy exception. Not only does it resist the '70s urge to show gore and brutality, it also manages to come up with a plot that is actually quite novel. It also marks an example of the \"third-time-lucky\" adage for Gene Hackman.... for this was his third western of the '70s, and the first of real quality (his previous two - The Hunting Party and Zandy's Bride - being pretty terrible if truth be known). At the turn-of-the-century, various riders gather in a Wild West town to compete in an endurance horse race of some 700 miles or so. Among those seeking the glory and the romance are English gentleman Norfolk (Ian Bannen); young show-offy hot-head Carbo (Jan-Michael Vincent); a rugged old man in search of a final moment of honour (Ben Johnson); a poor Mexican with serious dental problems (Mario Ateaga); feisty female entrant Jones (Candice Bergen); former Rough Rider Luke Matthews (James Coburn); and introspective horse-lover Sam Clayton (Gene Hackman). As they ride through forests, deserts and mountains toward the finishing line, the riders get involved in various adventures and tragedies. Some lose their horses along the trail; others are even less fortunate and lose their lives. Bite The Bullet is a very good western, with convincing performances from its all-star cast and luscious cinematography from the great Harry Stradling Jr. The opening quarter of the film is fairly slow, with time given over to the character introductions and a little probing into the motivations of each rider. However, this proves worthwhile later as the fate of each rider gains significant power because the audience has come to understand - to know, if you like - the various characters. On the whole, the period detail and the dialogue seem impeccable. Alex North's score is good, and adds an extra dimension to the proceedings. The only flaw worth mentioning is that the film's structure - perhaps inevitably - is rather episodic.... every few minutes, the narrative jumps to another rider and follows their adventures for a scene or two before jumping again to another character. There was probably no way to avoid this, but it is occasionally tedious and frustrating for the viewer (because just as they are \"getting into\" the plight of one rider the action cuts away to the plight of another). Aside from this minor flaw, Bite The Bullet is a highly impressive film and easily earns a spot on the top-ten-westerns-of-the-'70s list.",
         "In my mind this is almost a perfect movie. Writer-Director Richard Brooks delivered in my mind his best work since his 1960 blockbusters ELMER GANTRY and THE PROFESSIONALS. We have Brook's trademark crisp dialogue driving the epic about an endurance race set in the waning days of the american west. In place of Burt Lancaster and Lee Marvin professionals we have James Coburn and Gene Hackman as the soldiers of fortune thrown into the circumstance of this race. They both give superior performances. Ably supporting them in what should have gotten him a second supporting actor Oscar is Ben Johnson. If there is any quibble at all with the film it is the casting of of Candice Bergen as the prostitute turned contestant. She simply looks too well preserved to have lived the life her character has placed before the audience. One interesting note about the film had the exchange of actors functioning in basically the same part over the course of the film. Paul Stewart who is uncredited starts the film out as the wealthy rancher Parker until about a quarter of the way through the film when with an ingenious use of a looped line Dabney Coleman appears as Parker's son taking over the character's function from that point on.I remember seeing this film in it's initial engagement at Radio City Music Hall and it is still a fresh and rewarding experience. It is a shame that the upcoming DVD release will have no special features. I know Mr Coburn recorded a commentary for THE MAGNIFICENT 7, Ms. Bergen did THE SAND PEBBLES, and Mr. Hackman did the FRENCH CONNECTION discs. It would have been great to hear stories from these fine actors about this shoot. At the very least it would be nice the have Alex North's Oscar nominated score isolated on the disc.",
         "A good cast, some nice photography and an interesting story about a 700-mile horse race make \"Bite The Bullet\" kind of underrated western. You don't hear it mentioned much in \"Favorite Westerns\" lists. The only drawbacks for me were a little too much language and that grundgy-70s feel to it that movies in that decade had to them, even in westerns. Having grown up with \"Shane,\" and a bunch of westerns on TV, I still wasn't quite used to what I heard here when this came out 30 years ago. Nowadays, this is mild stuff. This is a fairly long film at 131 minutes but it moves fast. Gene Hackman plays the tough-but-humane hero. The rest of the contestants in this race are all interesting, too. Each is given a little profile of themselves and include Candice Bergen, James Coburn, Jan-Michael Vincent, Ben Johnson and Ian Bannen. In addition, there are some memorable scenes such as a horse literally dropping dead; a man poisoned, a woman with a \"different agenda\" an old man hanging on and a bad-turned-good kid. It's a nice mixture.",
         "Bite The Bullet, a most unusual western from the pen and the direction of Richard Brooks. It concerns a rather strange camaraderie that develops between the seven participants in a horse race out west. This is not a race for speed, this is a test of endurance for seven miles through the desert in the American southwest. The seven participants are Gene Hackman, James Coburn, Ben Johnson, Candice Bergen, Jan-Michael Vincent, Ian Bannen, and Mario Artaega. All these people have their own reasons for wanting the $2000.00 prize offered by the newspaper sponsoring the event. Hackman and Coburn are old friends already and Coburn's hoping Hackman will throw the race his way because he's up over his head in bets he can't pay off should he lose. Ben Johnson's an old timer just wanting to be remembered for doing something important in his life. Ian Bannen is an English Lord who thinks it's all jolly good sport. Candice Bergen is both striking a blow for women and sending money to her jailed husband. She works for madam Jean Willes when not racing. Jan-Michael Vincent is a punk kid with something to prove and Mario Artaega is just a poor guy looking for a stake to feed his family. It's about the animals as well, this is not the Kentucky Derby for a mile and a quarter. The horses have to be looked after if they make it through a rough 700 miles. They kind of bind the characters together in a strange way. Bite The Bullet is not long on plot, but very deep in characterization and it works here just like it works in the Sam Peckinpah classic, Junior Bonner. Even those that don't endure develop wellsprings of character they never thought they had. It's a good film and the ending shows something about character and friendship.",
         "For whatever reason, critics in the 70s were quick to pronounce dead the western genre whenever a new western opened, but that didn't stop the decade from producing some of my favorites in the category. _Bite the Bullet_ is a fine example. Where other westerns of the decade seemed to pursue the avenue of re-invention, Richard Brooks' gritty movie about a turn-of-the-century horse race/endurance test opts for sweet revival. The cast of characters are the usual suspects: company men vs. real cowboys, kid-looking-for-a-reputation, ballsy hooker-with-a-heart-of-gold, tough-and-noble-oppressed Mexican, and old-hand-on-his-last-hurrah. They all combine to tell a supremely entertaining and satisfying story. As a bonus, we get the chance to consider seriously what impact America's win-win mentality has on the moral character of its people. At the heart of the picture are the splendid performances by Gene Hackman and James Coburn as old buddies from Teddy Roosevelt's Rough Riders days. The friendship between their characters is the movie's moral glue, and it is portrayed without smearing or stickiness. In these two characters we not only get all of the integrity of upright and rugged individualism inherent in the Western Code, but we get a nice dash of Butch and Sundance to boot. And I think Candice Bergen makes for a great tomboy. It actually makes her sexier.",
         "His death scene in this movie is perhaps the greatest and most poignant ever filmed, and I include all \"world masterpieces\" in this statement. It is what I shall always remember about this film, which otherwise is a good old rousing Western chase movie with a great cast, one of Richard Brooks' bullseyes. (Others were \"In Cold Blood\" and \"Deadline USA\" with Bogart, which for some inexplicable reason has never appeared on home media.) True, Johnson had received a BSA Oscar four years previously...and maybe that's why he didn't receive one for this movie: but one simply has to see this scene to believe it. Johnson is living the part; there is no other way to describe his performance here. Somehow a former champion bull roper achieved something of which the very greatest actors would be envious.There are several movies that make me weep for joy, but few that produce vicarious compassion for the tragedy of mankind. Thanks, Ben.",
         "Sensational Western excellently acted , marvelously photographed and well screen-written with fine eye by Richard Brooks . It deals with some aging riders as Hackman , Coburn and Ben Johnson who get chance redeem themselves along with a young gunslinger , a Brit lord , a Mexican and an ex-whore . The film was based on a real , endurance race at the turn of the century ; it was inspired by the 1908 , 700-mile cross-country horse race from Evanston , Wyoming to Denver , Colorado. It was sponsored by the Denver Post , which offered $2,500 prize money to the winner . At the beginning of the 20th century, a newspaper organizes a grueling horse race : 700 miles to run in a few days . A bunch of ex-rough riders and a gunfighter enter a horse race in the desert . The motley group of disparate adventurers are competing , among them a woman , ex-prostitute (Candice Bergen) , Miss Jones, a Mexican , an Englishman (Ian Bannen) , a young gunslinger (Jan-Michael Vincent) , an old one (Ben Johnson) and two friends , Sam Clayton (Gene Hackman , though Charles Bronson turned down the leading role) and Luke Matthews (James Coburn) . All those individualists learn to respect for each other and develop a grudging and growing friendship . An overlong and dangerous horse race is the subject of this stunning and grand adventure , an epic in every sense of word . Impressive and breathtaking ending with the finalists terminating the grueling race . Exciting , funny and well acted , especially by Gene Hackman and James Coburn as two tough , two-fisted riders . Special mention to Ben Johnson as a veteran rider in his last feat . Colorfully photographed in Technicolor and Panavison by Harry Stradling Jr in Valley of Fire State Park and its Coyote Pass and Deah Valley (Nevada), Chama, New Mexico , Lake Mead, Taos , Nevada, White Sands National Monument, Alamogordo, New Mexico . Exceptional and thrilling soundtrack by Alex North (Cleopatra, Spartacus) , now a classic score . Directed and screen-played with magnificent style by Richard Brooks . He was a fine writer/director so consistently mixed the good and average which it became impossible to know that to expect from him next . Firstly he worked regularly as a Hollywood screenwriter . After that , his initial experience of directing was one of his own screenplays called ¨Crisis¨. The Richard Brooks films that have the greatest impact are realized during the 50s and 60s as ¨Cat on a hot tin roof¨, ¨Something of value¨ , ¨Elmer Gantry¨, ¨Sweet bird of youth¨, ¨In cold blood¨ , ¨Lord Jim¨. Brooks was a writer and director of Chekhovian depth , who mastered the use of understatement, anticlimax and implied emotion . His films enjoyed lasting appeal and tended to be more serious than the usual mainstream productions . Richards formerly directed another good Western titled ¨The professionals ¨ also with various tough stars as Burt Lancaster , Lee Marvin , Jack Palance and Robert Ryan , including the same musician , Alex North , and similar outdoors . The ¨Bite the bullet¨ is an authentic must see , not to be missed for buffs of the genre . A magnificent movie , hardly noticed for its theatrical release ; however , being nowadays very well considered . Rating : Above average because of its awesome acting , dialog , score are world class.",
         "Westerns about the 19th and early 20th century are almost by definition American mythology, but one has the choice of a wide variety of sub-genres. Many are focused on the individuals protecting others from violence, another group centers on the brave pioneers or the abused Native-Americans, and most of the rest expand on a sensationalistic version of the West. Films in this last category include the \"Lonesome Dove\" series, all the Jesse James/Younger brothers/Billy the Kid/O.K. Corral epics and recent films like \"Unforgiven.\" The common denominator in all these films is some extraordinary circumstance that forces one individual or group of individuals to stand out in some heroic way. The few exceptions are generally family films that tell about daily life and difficulties along the way, but find a way to make you feel good about the world when all is done. \"Bite the Bullet,\" \"Monte Walsh,\" \"Ulzana's Raid,\" and films like them tell a different story where animals and people suffer, people die for no good reason, and there are no heroes. The emphasis in these films is on telling a true story with all the mundane unpleasantness left intact. \"Bite the Bullet\" is not a feel-good film, but it does offer a realistic portrayal of an endurance race by choosing an assortment of standard western types and evaluating them through the eyes of one reluctant participant. I can't fault those who criticize the movie cliches in this film, because they are there and they are annoying, but I still admire this film for showing the race itself was a worthless and destructive enterprise for all the casual participants. Considering the support given cliché-driven movies like \"Silverado\" and sensationalistic extravaganzas like \"Lonesome Dove,\" \"Bite the Bullet,\" in my opinion, deserves a larger audience and a better overall IMDB rating than it has gotten."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Western"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Persky-Bright Productions",
         "Vista"
      ],
      "summaries": [
         "At the beginning of the 20th century, a newspaper organizes an endurance horse race : 700 miles to run in a few days. 9 adventurers are competing, among them a woman, Miss Jones, a Mexican, an Englishman, a young cow-boy, an old one and two friends, Sam Clayton and Luke Matthews. All those individualists will learn to respect each other.",
         "A group of ex-rough riders, an ex-prostitute and a gunfighter enter a horse race in the desert."
      ],
      "budget": 0
   },
   "movielensId": 5301,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1975-09-26",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Richard Brooks"],
      "runtime": 132,
      "movieId": 5301,
      "title": "Bite the Bullet",
      "mpaa": "",
      "actors": [
         "Gene Hackman",
         "Candice Bergen",
         "James Coburn",
         "Ben Johnson",
         "Ian Bannen",
         "Jan-Michael Vincent",
         "Dabney Coleman",
         "Sally Kirkland",
         "Buddy Van Horn",
         "Jean Willes",
         "Mario Arteaga",
         "Robert Donner"
      ],
      "imdbMovieId": "0072705",
      "originalTitle": "Bite the Bullet",
      "genres": [
         "Action",
         "Western",
         "Adventure"
      ],
      "youtubeTrailerIds": ["FY-DQUYZAy8"],
      "plotSummary": "At the beginning of the 20th century, a newspaper organizes an endurance horse race : 700 miles to run in a few days. 9 adventurers are competing, among them a woman, Miss Jones, a Mexican, an Englishman, a young cow-boy, an old one and two friends, Sam Clayton and Luke Matthews. All those individualists will learn to respect each other.",
      "tmdbMovieId": 32617,
      "avgRating": 3.07738,
      "releaseYear": "1975",
      "numRatings": 84,
      "posterPath": "/a5fYK94xQlvnegBTL5yULXYGYEF.jpg"
   }
}