{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "destroy",
            "id": 2535
         },
         {
            "name": "radioaktivity",
            "id": 3315
         },
         {
            "name": "disaster",
            "id": 10617
         }
      ],
      "imdb_id": "tt0113187",
      "video": false,
      "title": "Godzilla vs. Destoroyah",
      "recommendations": [
         39466,
         39468,
         36679,
         39469,
         19336,
         39465,
         10643,
         12636,
         38582,
         1682,
         6593,
         15767,
         18289,
         39464,
         3115,
         36243,
         19545,
         1679,
         39264,
         39256
      ],
      "backdrop_path": "/mn8WHTtkdjTOpqvSW0uG1EVRGQv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Kensaku Ijuin",
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047a85",
               "name": "Takuro Tatsumi",
               "profile_path": null,
               "id": 72817,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Yukari Yamane",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047a89",
               "name": "Yôko Ishino",
               "profile_path": "/5CiUP3N7P6hJ1j3rxSGtFuCupru.jpg",
               "id": 72818,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kenichi Yamane",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047a8d",
               "name": "Yasufumi Hayashi",
               "profile_path": "/xqKxsXZIMkMBCfFnqH0dOkWwqCR.jpg",
               "id": 72819,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Miki Saegusa",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047a91",
               "name": "Megumi Odaka",
               "profile_path": "/bLwuMjHNCnoIQ2OV6SB2Da7TEG7.jpg",
               "id": 50655,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Meru Ozawa",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047a95",
               "name": "Sayaka Osawa",
               "profile_path": null,
               "id": 72820,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Professor Fukazawa",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047a99",
               "name": "Saburo Shinoda",
               "profile_path": null,
               "id": 72822,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Commander Takaki Aso",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047a9d",
               "name": "Akira Nakao",
               "profile_path": "/wK68o124VhedgKlygYphLOZG4WL.jpg",
               "id": 50658,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Desutoroia",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047ad7",
               "name": "Ryo Hariya",
               "profile_path": null,
               "id": 1091640,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Gojira",
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047adb",
               "name": "Kenpachiro Satsuma",
               "profile_path": null,
               "id": 82879,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Dr. Daisuke Serizawa",
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047adf",
               "name": "Akihiko Hirata",
               "profile_path": "/hfJ3M03wlP0lhXpPRejONiKXfg0.jpg",
               "id": 30568,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Emiko Yamane",
               "gender": 1,
               "credit_id": "561d00fec3a368225b00345e",
               "name": "Momoko Kôchi",
               "profile_path": "/x9mlnUigygwesUYgENgahQVIKYR.jpg",
               "id": 33768,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Aquarium Watchman",
               "gender": 0,
               "credit_id": "5a8aae209251417599071dec",
               "name": "Kôichi Ueda",
               "profile_path": "/qOWfODlgb2J8zcVnTXA90zvRMDT.jpg",
               "id": 50659,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047aa3",
               "name": "Takao Okawara",
               "profile_path": null,
               "id": 50651,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047aa9",
               "name": "Kazuki Omori",
               "profile_path": null,
               "id": 72823,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047aaf",
               "name": "Tomoyuki Tanaka",
               "profile_path": null,
               "id": 18604,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047ab5",
               "name": "Shogo Tomiyama",
               "profile_path": null,
               "id": 50661,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047abb",
               "name": "Masahiro Kishimoto",
               "profile_path": null,
               "id": 72825,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047ac1",
               "name": "Yoshinori Sekiguchi",
               "profile_path": null,
               "id": 50662,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047ac7",
               "name": "Chizuko Osada",
               "profile_path": null,
               "id": 72827,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047acd",
               "name": "Kazuo Miyauchi",
               "profile_path": null,
               "id": 1106652,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c75047ad3",
               "name": "Koichi Kawakita",
               "profile_path": null,
               "id": 115913,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fb9251416c75047ae5",
               "name": "Akira Ifukube",
               "profile_path": "/euxhNIeWxuvnFqr90qlN1VwZTKC.jpg",
               "id": 425396,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.218664,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 12561,
      "vote_count": 35,
      "budget": 0,
      "overview": "The aftermath of the Oxygen Destroyer brings forth Destoroyah, a beast intent on killing Godzilla, who is on the verge of a nuclear meltdown.",
      "similar": [
         7191,
         5876,
         124905,
         64686,
         929,
         346,
         616,
         296524,
         58857,
         1678,
         548,
         11878,
         14537,
         5919,
         551,
         39256,
         7227,
         336882,
         315011,
         246
      ],
      "original_title": "Godzilla vs Destoroyah",
      "runtime": 103,
      "poster_path": "/t28laxbteoyubkGPQZJFmrEEdGl.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Toho Pictures, Inc.",
         "id": 74807,
         "origin_country": "JP"
      }],
      "release_date": "1995-12-09",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/4Y5IXrcWuK1wA3PbeNU5y6Qd3zF.jpg",
         "name": "Godzilla (Heisei) Collection",
         "id": 374511,
         "poster_path": "/A25nYpiBlYlGdJSuAfN9oJ9Li39.jpg"
      },
      "tagline": "Get Ready for a Three-Way Monster Melee!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "JPY ",
      "directors": ["Takao Okawara"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Kazuki Ohmori"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0113187/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyOTk4MDQ4OF5BMl5BanBnXkFtZTcwNTY0NTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Takurô Tatsumi, Yôko Ishino, Yasufumi Hayashi | See full cast and crew »"],
      "reviews": [
         "The most moving and thrilling of all Godzilla films, with a solid plot, smooth acting, moving music and emotional drama. I enjoyed this movie; the final one in the Godzilla \"Heisei\" series, in which Godzilla's heart, basically like a nuclear reactor, is on a verge of a meltdown. This will result in the disintegration of the entire city. As a result, this movie is a thrilling race against time to stop Godzilla before he melts down. This G-film's story is particularly captivating and unique, exciting from start to finish. The film also includes a combination of elements that is iconic to a Godzilla film: scientists, reporters, military, Tokyo, fleeing citizens, city destruction, monster battles and Akira Ifukube's brilliant music score. And, it includes a host of actors that appeared in past Godzilla films, most notably Momoko Kochi reprising her 1954 role as Emiko Yamane. All this is a great homage to have in the final Godzilla film of the Heisei series. There is one thrilling scene in which I especially liked - the part when Yukari gets trapped in the police car with Destoroyah pursuing her. And, the part when Miki breaks down and cry when Godzilla Junior laid lifeless on the ground almost reduced me to tears - reminding you that this film is Godzilla's final bow. I really despise Destoroyah, after all the damaged he has done. Godzilla should have melted that ugly arachnid. And, I would have made the Ken and Meru characters a little less annoying. But overall, a terrific, heart-pounding film to close out the second Godzilla series. A must see for all. Grade A-",
         "When I first saw this movie, I hoped this would have more of a brooding, menacing feel to it than it did. I half expected them to return more to the tone of the 1954 GOJIRA, especially since they made so many other references to the original, like bringing back Momoko Kochi as Emiko. Instead, G. vs. Desutoroia was shot in the usual nervous style of the Heisei series, which so irritated me at first that I found myself counting seconds, to see if ANY SHOT in the whole movie would make it to ten. On repeated viewings, though, I felt the movie held together better than most of the others in the 'new' Godzilla series. As usual, the human characters seem simply to be along for the ride (the exception is G. vs. Mechagodzilla (II), where I found myself actually caring what went on between the humans). In this case, it's only natural that the Big G. takes center stage. The final moments are absolutely amazing. Akira Ifukube's classic \"the-army-mobilizes-against-Godzilla\" theme is heard for probably the last time: not as the usual march, but in a slow choral arrangement that will tear the heart out of any Godzilla fan... Godzilla may be back in the form of the new, improved Little Godzilla, but PLEASE someone reassure me that we've finally seen the last of that psychic Miki Saegusa. By the time the Heisei series was over, I knew more about Godzilla's inner life than I did about hers. IMHO the whole Psychic thing added nothing to the continuing story... give her a 900 number and an infomercial and keep her out of Godzilla Millennium!",
         "This movie is the \"last\" in the series of Godzilla movies that started with Godzilla 1985.This time around Godzilla has become a living nuclear reactor on the verge of exploding and taking the planet with him. On the print I watched there were some allusions to an atomic explosion on the island where Godzilla & Little Godzilla hung out.(But it is only mentioned in passing.Was it excised from this print?). Little Godzilla evolved due to the explosion into a teenage Godzilla.The elder Godzilla turned into a nuclear nightmare.In the beginning he lays waste to Hong Kong. In Tokyo the remnants of the Oxygen Destroyer used to kill the first Godzilla in 1956 takes a life of its own.The Destroyah takes shape in the form of a hundred or so scrabbling insects larger than a car.Naturally the Destroyah turns out to be more than the Police/Army can handle.It also turns into one of the biggest,ugliest monsters you'll ever see. Needless to say there is a titanic battle between Little Godzilla,the elder dying Godzilla and Destroyah.Tokyo is turned into a nuclear decimated wasteland as Godzilla approaches total meltdown. This isn't your father's Godzilla.He isn't a hero and he sure isn't cute.To say he is an unstoppable force of nature is more than accurate.He's mean,pi$$ed and this series has him at the most vicious. The 7 movies in this series actually had plots and some money tossed into the special effects.Sure the dubbing bites and we could do without the little psychic girl from G Force. All in all a fitting \"ending\" to the series.Now all we have to do is wait for Godzilla 2000.",
         "The epic finale of the second Godzilla series concludes with Big G himself facing his toughest challenge yet! This is my personal favorite of the entire Godzilla series after the original 1954 film, and in many ways, this film does it's best to tie back to that film as much as possible, even explicitly tying the origins of Godzilla's new foe to the fate of the original King of the Monsters. Godzilla is at his largest, most powerful, and by far the most furious that he's ever been in the entire franchise, but he will be matched up against the nightmarish Destoroyah, one of the strongest and most terrifying monsters to ever appear in any film! What follows is a fitting and powerful conclusion for the King Of The Monsters, the last dance so to speak. For Godzilla's days are numbered, as the same radioactive meltdown that is triggering his increased strength and fury is also draining him and will eventually kill him. With some of the best visual effects and creature designs of the entire franchise, and an appropriately epic score to match, G vs. D represents the best the series has to offer. If you must watch only one Godzilla movie, watch the original 1954 Japanese version. But if you watch two, then I urge you to consider Godzilla vs. Destoroyah with the original. With this film, the Heisei series decisively came to an end, and Godzilla would enjoy a well earned and fitting retirement ... that is, until an American impostor pretending to be the original King Of The Monsters would rear its ugly head in a certain 1998 Columbia/Tristar film that shall remain nameless ...",
         "I liked this movie because it had some connection with the original Godzilla movie of '54. I finally learned what happened to Shinkichi and Dr. Kyohei Yamane after the original Godzilla movie. Shinkichi got adopted by Dr. Yamane (!) What a great story line, and Shinkichi's son and daughter carries on the mantle of their father. I've read some of the comments made by other Godzilla fans for this movie and their complaint is basically what I've been saying about these movies all the time - That Toho has very bad casting. I understand that it's cheaper for them to use their in house actors, but they probably have no aspirations to improve their acting or to be a good actor because they're on salary and don't have to worry about where their pay checks are coming from. More over, they might think that nail that sticks out gets hammered and tries not to stand out. Hence, the movies made have no central focus and plot meanders. But out of all the '90s Godzilla movies, I thought this one did have better plots and better casting. Special effects was great with Godzilla appearing in places its never been seen like Hong Kong and its body spewing steam due to heat generated from within. It was also good to see Kochi Momoko reprise her role as Emiko Yamane in her last appearance before her demise in 1999 (Now if they had Akira Takarada's character in this movie too it would have been 100% better but...).",
         "When I first read about the existence of this film, I was horrified to learn that Godzilla died at the end. My first thoughts were, \"how could Godzilla die at the hands of another monster.\" As I read more about it, I learned that that wasn't the case. However, that didn't change the fact that Godzilla passes in the next world at the end. As much as I knew about the ending, I still couldn't help but feel a part of me die also. The movie takes the Heisei series full circle by connecting the origins of the monster Destroyer with Godzilla's original foe, the Oxygen Destroyer. Godzilla's offspring has grown from that rather-silly looking creature from Godzilla vs. Space Godzilla into a monster that looks like his father. Mix those elements with a Godzilla that is rapidly approaching the bring of self-nuclear destruction and you have this final blowout for the big \"G\". This movie is quite entertaining. There are some good fighting moments and the finale is quite good. The battle between Godzilla Jr. and Destroyer was exciting also. The special FX for the most part were good, with a few cheesy scenes. Destroyer was quite a formidable foe and his various incarnations were very cool-looking. I especially like the hack n' slash scene where Godzilla and his enemy are tearing each other pieces, literally. Also, there are some poignant moments in this movie. The finale left me with quite a lump in my throat. Godzilla finding Jr.'s body at the aquarium were also quite touching. Well, all in all, this is a good kaiju film. Lots of monsters. A cool opening scene. Lots of cute Japanese girls, especially Megumi Odaka. A rousing Akira Ifukube score. Great.",
         "**possible minor spoilers** My favorite Godzilla film of them all remains the movie that gives the most respect, and awe inspiring power to the King of the Monsters. Godzilla is dieing of his own powers, his heart, a nuclear reactor, is going through a meltdown that will destroy the world. Meanwhile, scientists are producing a means for future food supply. Micro-oxygen creates supplies of food or animals much bigger than their normal size, however this can also be diverted to be used as a weapon. The micro-oxygen is a direct reference to the oxygen-destroyer used to kill the first Godzilla in 1954. Micro-oxygen gets exposed to the area where the oxygen-destroyer was deployed 40 years before hand. Dormant micro creatures are awakened by the micro-oxygen, that have for 40 years been growing rapidly and absorbing the energies from the oxygen destroyer. Godzilla Jr. then appears, and is found being followed by his father who is still dieing. Once the micro creatures become big enough, they stalk the city and then form into one giant monster. (basically the oxygen-destroyer in a monster form) Since the oxygen-destroyer was the only thing to defeat Godzilla so long ago, G-Force believes the new monster Destroyah can defeat him. They lure Godzilla in by diverting Godzilla Jr.'s direction. Godzilla gets to the scene just in time to see his son slaughtered. Overpowered with energy, but still dieing Godzilla fights Destroyah, with a changing strategy of G-Force and the world at stake! The movie really is breathtaking, if not executed perfectly. This is Director Takeo Okawara's finest direction, he actually, for once, brings out performances, giving us edge to your seat suspense and build up as well as characterizing the human characters and monsters evenly. Some don't develop, and some ideas in the film are put there simply to divert attention of the audience, but it still works. The effects are the third best of the Heisei series. The Godzilla suit is so majestic and awesome you want to see more and more of it on screen! The writing is pure genius, Omori was at his best right here! Indeed this is an important film, one that will be remembered as what was suppose to be Godzilla's death, but today it remains as the film that pays the most respect to Godzilla.",
         "This was the last Godzilla film in the Heisei series, and it certainly topped all the rest. All the stops were pulled out to make this one a fantastic and explosive film that made July 4th a real firecracker. First, they are trying to develop some new chemical to kill Godzilla and they create some really neat looking creatures that look somewhat like a crab or a lobster with a long neck and a head. I really don't think Godzilla will have any trouble with these things as one spent five minutes trying to get a girl our of a car and couldn't do it before he was destroyed. But, the creatures apparently form in to one Destroyer and this one kills Baby Godzilla. Godzilla arrives to do battle and what a battle it is. The fireworks were spectacular and the sound track was marvelous. Add to the mix a space shuttle-like super jet piloted by a cross between Tom Cruise and Will Smith and these babies don't stand a chance. Since this is the end of the series, you know Godzilla will die, but you can be sure that he will likely comeback in some form in the future.",
         "Of all the Godzilla sequels that have been churned out this one relies on the 1954 film for it's source of material and even has one of the original cast members reprising their role. Story here has the island that Godzilla is on melting into the ocean from an underwater volcano and the reaction that occurs from the pure uranium where Godzilla starts to glow and smoke. Scientists figure out that when Godzilla's body temperature reaches a certain point a nuclear meltdown will occur that will destroy the earth. Meanwhile, Dr. Kensaku Ijuin (Takuro Tatsumi) has developed a device that alters micro-oxygen (which is reminiscent of the Oxygen Destroyer from the original film) and mutates microorganisms that grow into insect-like creatures that are named Destroyers. *****SPOILER ALERT***** The smaller Destroyers mutate once again and fuse together to become one larger Destroyer and Tokyo decides to lure Godzilla Jr. to combat it. Japan now has two serious problems with Destroyer and the ticking time bomb that Godzilla has become and they call in a special forces team called G-Force with a destruct proof plane named Super X III. Also helping out are Kenichi Yamane (Yasufumi Hayashi) and Yukari Yamane (Yoko Ishino) who are descendants of Professor Yamane who helped kill Godzilla in 1954. An ESP agent named Miki Saegusa (Megumi Odaka) who has spent her career watching over Godzilla Jr. is totally opposed to using him to fight Destroyer and she turns out to be correct as he ends up getting killed. This infuriates a glowing Godzilla who tries to breath life into it's offspring and than proceeds to destroy Destroyer. This film was directed by Takao Okawara who has plenty of experience in directing these types of films and this also marks the last Godzilla film that producer Tomoyuki Tanaka was involved in after working on every one since the original. This story picks up after the film \"Godzilla vs. Space Godzilla\" and all references to any of the previous films ends here. Everything made after this film makes no references to previous events in the past so this is the last of the original story lines from Toho Studios. One of the most interesting things about this film is actress Momoko Kochi who is reprising her role as Emiko Yamane from the original 1954 film which is fitting since this was her last acting effort before her death. Along with the casting of Kochi the film's story ties in the Oxygen Destroyer and has flashbacks to the 1954 film and it's characters. As far as Godzilla films go one can't help but feel some sentiment as the story reminds you of it's origins and even feel some sadness as we watch Godzilla and it's offspring die (supposedly) but it also reminds viewers that even a so-called silly franchise like this was based and inspired by something that touched a nerve in our culture.",
         "About once a year I'll tune into a goofy martial arts flick from the Seventies or one of these Godzilla films. Turns out that once a year is probably a bit too frequent. I know there's an audience for this stuff but I don't know how one manages the patience. However I do get a kick out of the pseudo-scientific babble about subjects like micro-oxygen, freezer rays and cadmium shells. What got me the most about this picture was how a Japanese teenager that looked about sixteen years old was advising the country's top scientists and military leaders. Not to mention how any time the venue changes, there was Kenichi or Yukari right in the thick of the action whether it was in a lab, on a helicopter or on the scene of Godzilla's next battle. I think I may have learned my lesson with this one, I'll just lay low and not get enticed the next time I see something like this on the cable listings."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Toho Company"],
      "summaries": [
         "Something has destroyed Birth Island, home of Godzilla and Little Godzilla and soon, it is discovered that Godzilla has developed a bright flaming glow, indicating that his nuclear energy is growing out of control. Fearing that Godzilla will soon explode, the G-Force tries to freeze him, thus cooling his temperature. But another problem arises as a horde of human sized creatures, formed from a combination of Godzilla cells, and the weapon that destroyed the original one, The Oxygen Destroyer. Now the military must try to stop these creatures and stop Godzilla from going through a nuclear meltdown that could destroy the world.",
         "The aftermath of the Oxygen Destroyer brings forth Destoroyah, a beast intent on killing Godzilla, who is on the verge of a nuclear meltdown."
      ],
      "budget": 1000000000
   },
   "movielensId": 53373,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1995-12-09",
      "dvdReleaseDate": null,
      "directors": ["Takao Okawara"],
      "runtime": 103,
      "movieId": 53373,
      "title": "Godzilla vs. Destoroyah",
      "mpaa": "NR",
      "actors": [
         "Takuro Tatsumi",
         "Yôko Ishino",
         "Yasufumi Hayashi",
         "Megumi Odaka",
         "Sayaka Osawa",
         "Saburo Shinoda",
         "Akira Nakao",
         "Ryo Hariya",
         "Kenpachiro Satsuma",
         "Akihiko Hirata",
         "Momoko Kôchi"
      ],
      "imdbMovieId": "0113187",
      "originalTitle": "ゴジラvsデストロイア",
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["vnwidGgWJzs"],
      "plotSummary": "The aftermath of the Oxygen Destroyer brings forth Destoroyah, a beast intent on killing Godzilla, who is on the verge of a nuclear meltdown.",
      "tmdbMovieId": 12561,
      "avgRating": 3.06667,
      "releaseYear": "1995",
      "numRatings": 30,
      "posterPath": "/t28laxbteoyubkGPQZJFmrEEdGl.jpg"
   }
}