{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0487092",
      "video": false,
      "title": "Who the #$&% Is Jackson Pollock?",
      "recommendations": [
         41313,
         82259,
         63622,
         73257,
         15902,
         47689,
         9977,
         17091,
         36220,
         35453,
         63146,
         129175,
         129467,
         21710,
         15901,
         91921,
         41999,
         173165,
         34600,
         50779
      ],
      "backdrop_path": "/wJ3hx99nGVd0qECa5P7M2ql6TEp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "543bb5cdc3a368199c0053a0",
            "name": "Harry Moses",
            "profile_path": null,
            "id": 1373458,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.330508,
      "production_countries": [],
      "id": 45664,
      "vote_count": 10,
      "budget": 0,
      "overview": "After semi-truck driver Teri Horton bought a large splatter painting for her friend for $5, she was forced to sell it in her own garage sale when her friend said she had no place for it. Eventually someone commented on the painting stating it might be an original Jackson Pollock. This documentary follows Teri, her son, and a forensics specialist as they attempt to prove to the world, or more specifically the art community, her painting is a true Jackson Pollock",
      "similar": [],
      "original_title": "Who the #$&% Is Jackson Pollock?",
      "runtime": 74,
      "poster_path": "/lPG9kD993EpbGu7gas2zeEU1Pok.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2006-11-09",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "An Art Film",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harry Moses"],
      "runtime": 74,
      "synopsis": "After semi-truck driver Teri Horton bought a large splatter painting for her friend for $5, she was forced to sell it in her own garage sale when her friend said she had no place for it. Eventually someone commented on the painting stating it might be an original Jackson Pollock. This documentary follows Teri, her son, and a forensics specialist as they attempt to prove to the world, or more specifically the art community, her painting is a true Jackson Pollock.",
      "writers": ["Harry Moses"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0487092/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMTQ1Mzk1OV5BMl5BanBnXkFtZTcwMDM3OTY0MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Teri Horton, Tod M. Volpe, Ben Heller | See full cast and crew »"],
      "reviews": [
         "This documentary tells the story of Teri Horton's crusade to get her $5 garage sale find certified as a genuine Jackson Pollock painting. I found myself really enjoying her feisty, earthy spirit, and contrasting it with the attitude of the \"Art\" world, which has been so dismissive of her claim, because it comes from outside their commonly held standards and beliefs. The contrast between her truck drivin', swearin', fried chicken & beer, trailer park life and the rarified \"art world\" people she was dealing with is both striking and funny. I must confess that, along with Teri, I knew very little about Jackson Pollock. Seeing this movie has impelled me to find out more about his interesting life.",
         "There's this old joke about a small town exhibit of Norman Rockwell paintings where a snobbish big city critic is trashing the art at every turn. \"We know why you don't like this art\". says a local. \"And why is that?\" asks the critic. \"Because we don't need you to tell us if it's any good!\" And thus, this film begs the question, \"Is collecting modern art about art or collecting autographs?\" This HBO documentary details the adventures of Teri Horton (Tugboat Annie of the Trailer Park and professional dumpster diver); a small town gal finding herself in possession of what might very well be an original Jackson Pollock potentially worth millions and sets out to prove its authenticity. Herein lies the rub of modern art; \"If you don't know who did it, is it any good\"? We watch as the painting is wagged from pompous art critics to curious aficionados, business persons and forensic specialists each with their own take and assessment of authenticity. Little of which has anything to do with the actual art on the canvas. Here is a fascinating look at the facade of modern art and the stuffed shirts who make cowardly proclamations regarding authenticity while avoiding the content of the painting itself. Interesting stuff whether you like modern art or not; and while Ms. Horton's rural irascibility wears mighty thin by the end of the film, there's enough fun and insight to give anyone an art lesson.",
         "This was very entertaining and quite a story. However, many of the documentary's claims about the artworld are unfounded. They interview a small handful of slightly and some totally ego-centric people and label them as \"the art world\". In fact, most of the art world would love for this story to be true, that a truck driver has miraculously discovered a Jackson Pollack in perfect condition that found its way to a yard sale the whole United states away from where it was originally painted. The documentary neglects to focus on many overwhelming amount of evidence that call the piece a fraud and instead focus on the few details tat suggest its authenticity. This in effect portrays a sense of drama that is unreal. Good film though!",
         "This film is entertaining in many ways. The people in the film cover a pretty broad range, but I think it's safe to say that most of them are quirky. Quirky in a good way, though. The story was interesting as well as the whys and hows that originated the story. Without giving too much away, let's just say that the filmmaker does a good job. The story has the ever-popular David v Goliath, Individual v Large Corporate Mentality, and Common Man v The Elite that pretty much anyone can enjoy. Knowledge of art and artists isn't necessary, and it isn't necessary for you to know the intricacies of the art world. It's all laid out for you in the film. You don't even have to be interested in art to enjoy the movie; you just have to be interested in watching a good story and letting the real-life personalities lead the way.",
         "\"Who The #$&% is Jackson Pollock?\" is a powerful indictment of the art establishment. It challenges and exposes established and esteemed art valuators and dealers as amateurs and incompetents. Forensics, the same techniques which are used to provide investigate and provide evidence for criminal prosecutions, proves the authenticity of the thrift store bought Jackson Pollock painting. Comparative analysis of paint chips, photographs, fingerprints, etc., which provided irrefutable proof of the painting's authenticity is absurdly rejected by esteemed art valuators who rely on subjective opinion and often questionable historical provenance. The pretentious Illuminati of the art world won't accept the forensic authentication of the painting because it proves that their subjective methodology of provenancing and valuating art is fraudulent.",
         "I gotta tell ya, anybody who watches this movie should understand two things: One, the art world snobs thus portrayed are typical of what you'll encounter in the art world; they are the RULE, not the exception! (I know from personal experience: I am a professional fine artist.) Two, people with common sense are often maligned because of their supposed lack of intelligence, but listen, NASA, the military, world governments, hell, even the sports world are just a few examples where communication is carried on with nomenclatures which are specific to their disciplines; now, if you don't understand NASA's nomenclature, are we then to surmise that you're an idiot?? Hell, I bet you don't even understand what in hell rappers' slang means, and you may hold that proverbial degree in rocket science! So just because a person is ignorant (not stupid, there's a vast difference) of a subject doesn't mean that they lack intelligence: I can't speak French, but I qualified for MENSA membership. Now to the spoiler...don't read it if you haven't seen the movie (It's not much of a spoiler, because if you've researched this controversy on the Internet you'll already have run across this.). At the end of the movie it's revealed that there is a third fingerprint match: one that comes from an undisputed original Jackson Pollock! So now there is a fingerprint from a bona fide Jackson Pollock painting that matches the fingerprint on the paint can from Jackson Pollock's studio that matches the fingerprint on the back of the painting in question. Enough evidence for you? It is for me!!! And if you doubt the ability of the forensic examiner, or think that the methodology used was spurious, then I suggest that you see the movie, or view it again and pay closer attention this time. And as an aside, my old man was thrown in the drunk tank a few times, just like Pollock; my dad was never fingerprinted, either.",
         "I was bothered by the anti-intellectual attitude displayed by Teri Horton and others in the film. What is this pathetic snobbery you find in ignorant people who feel their opinions should be considered simply because they admittedly know nothing about the topic they are talking about? Teri shows great smugness by her distaste towards the \"Pollock\" painting she buys at the thrift shop saying, \"Painting should look like something!\" I bet this makes her feel all-superior to those of us who like Jackson Pollock because, obviously she knows what \"painting\" is supposed to look like and we don't. Teri's claim that she was dismissed by snobbish art world types because she is a drunken, foul-mouthed, truck driver is specious. I would never say that no one in the art world was ever rude to her, but consider this, if her \"Pollock\" is genuine and worth more than $100 million, why wouldn't gallery owners and art dealers talk to her? If the painting were genuine, the gallery that represents it would get a 15% - 20% commission on the sale. The good publicity the sale would generate would be a boon to any art dealer and that would lead to even more sales for the gallery. It makes no sense that they never even bothered to return her calls. Unless you consider this, Teri says that the first art dealers she spoke to asked about the \"provenance\" of the \"Pollock\" and she didn't know what a provenance was. Much filmic hilarity ensues from the cockamamie \"provenance\" Teri fabricates. It goes like this, the painting came into being during a drunken night of painting that included James Cagney, Joan Crawford, John Wayne, a naked Broderick Crawford and ended with Jackson Pollock signing the painting with his penis. Pretend you're a gallery owner; you get a call from a woman who, while slurring her words, says she has a Jackson Pollock for sale. You ask where she got it and then she lets loose this story of alcoholic Hollywood revelry so clearly improbable it beggars the imagination. Would you call her back? Another problem is the involvement of Tod Volpe, the convicted thief, embezzler and fraud who is retained by Teri to represent her questionable \"Pollock\". Isn't that like starting a new business and then hiring Ken Lay, Jeff Skilling, Andy Fastow and the other Enron thieves to run it? Then you explain your hires to investors by reasoning since business is corrupt, and these guys are corrupt, they are the perfect management team! Isn't this lunacy? At one point, Volpe (the convicted fraud) says it is the art world's job to prove that Teri's painting is NOT a real Pollock. What? Is he an idiot as well as a liar and thief? Hey Volpe, you are asking millions for this painting, you have to prove it IS a Pollock. The burden of proof is on the people making the claim. The biggest piece of evidence for the paintings authenticity is the discovery of a partial fingerprint on the back of Teri's \"Pollock\". The film claims there are no known Jackson Pollock fingerprints in existence, so the self-proclaimed \"forensics expert\" Paul Biro goes to the Pollock/Krasner Institute and lifts a Pollock fingerprint off a paint can from his studio that he will try to match with the fingerprint found on Teri's painting. First question, if there are no known Pollock fingerprints in existence, how does Biro know that the one he got from the paint can is really Jackson Pollock's? Second question, since Pollock was arrested for being drunk and disorderly a few times, are the filmmakers really sure there are no fingerprints of his in existence? I had questions about fingerprints and the law, so I spoke with a public defender here in Philadelphia about fingerprint evidence. Teri says \"if you can send someone to the electric chair by fingerprint evidence, why can't you authenticate a painting?\" Well, in fact, you CAN'T send someone to the electric chair based solely on fingerprint evidence. Paul Biro finds three matching points on the partial print found on Teri's \"Pollock\" and the alleged Pollock fingerprint from the paint can. Is that enough? Is there a legal standard here? The answer surprisingly is NO! There is no set legal number of points that have to match for a fingerprint to be considered proof of identity, but according to my legal expert, three points would never be considered anywhere near enough. All in all, the fingerprint evidence in the film does not meet even the most minimal legal standards and that is the only solid evidence they have. But the clincher for me was when I discovered the existence of a painter named Francis Hogan Brown, who was well known for painting copies of Jackson Pollock's work that were virtually identical to Pollock. Brown says that he distributed lots of these knock-offs in the Southern California area on or around the time Teri Horton claims to have purchased her \"Pollock\". In fact, Brown says the painting in the film (which he has seen in photographs) looks just like one of his. He says that for several years now, he has repeatedly asked to see Teri Horton's \"Pollock\" up close, but that Tod Volpe and Teri Horton have refused to let him anywhere near it. Why is that? If Francis Hogan Brown can prove that the disputed \"Pollock\" Teri has is one of his own paintings, doesn't that settle this case? One final thing, the film goes to great lengths to show that the former museum director Thomas Hoving is an arrogant, know-it-all, jerk. So what? You don't have to look very hard in the art world to find a pompous ass. I am willing to bet that it would also not be difficult to find a truck driver who is also a pompous jerk. But what does that prove? Absolutely nothing.",
         "I have an extended meditation here, but the bottom line is this: the film is scientifically dumb and manipulative. The critic Hoving offers real kickers to the myth of that this junk-shop painting (owned by Ms. Horton) was made by Pollock. The director chose to repress (or was too dull to uncover) these simple, myth-busting facts. Hoving relates these in a letter in ArtNews magazine: 1) that the Horton found-in-a-junk-shop item was painted on a stock, commercially framed-and-sized canvas. Pollock never used such, but used odd-ball, idiosyncratically sized canvases; and 2) the paints in the Horton image are all acrylics (acrylics were scarcely available to Pollock, and though he used a few, he is on record as _never_ making an entire painting of _nothing but_ acrylics!). --- This film's subject, an elderly woman who begins to be convinced she found an enormous Jackson Pollock painting at a junk shop, is sometimes an amusing character; she has a compelling, hard scrabble background and can spin a fanciful yarn. But I can find such a person in most any saloon. Her stubbornness is not an unusual human trait, but the filmmaker is in awe of it, and seems to follow it as a potential guide to a painting's authenticity. But stubbornness is not equal in value to reasoned principles. The film makes occasional offers of an unbiased assessment as to whether this painting is a real Pollock or not. But its main argument remains something like \"hard-headed wishing can make it so\"--this shtick isn't non-conformist, though the filmmaker tries to sell it that way. Regardless of anybody's politics, I think this documentary curiously reflects the G. W. Bush era of feelings-over-reason in which it was made. The film's most dubious character is not Volpe, the ex-con (and admitted con-man) art dealer hired by Ms. Horton to sell her painting, but the Montreal painting analyst Biro, who claims that a smudged, partial fingerprint on the rear of the Horton canvas is a certain match to a smudge on a paint can handled by Pollock. Common sense and actual criminal science forensic fingerprint analysts (e.g., see the Fine Arts Registry website and Tom Hanley's analysis) claim that these prints are too compromised and small to be of scientific use. (Biro also seems to have placed a rubber stamp of _the same print on the Horton_ onto the back of another unsigned \"possible\" Pollock--who could find that compelling?) The film is bewilderingly short on educated, detailed responses comparing line and color in the Horton painting and actual Pollocks. This made the film seem like it had something to hide behind Biro's carny-man bluster about fingerprints. Here's an example of the kind of analysis I'd like more of: based on images of the Horton painting in the film, I judge that it is that this is a fake (not a counterfeit, but an amused homage) Pollock made in the 1970s. I offer this guess because of the colors and their proximity in the painting. The rest of my impression is based on the density of the design and the monotony of the curved shapes in the painting. Pollock often used colors (colors that strike on me as \"50s colors\") that were dark, intense, metallic or earthy. Rarely does he put colors like bright orange, turquoise, and red hard against each other. Admittedly he does use some bright colors in \"Number 5,\" but there the yellow and red are spread far apart and not densely laced on top of each other. The amounts of turquoise and orange in the Horton painting seem especially un-Pollock like, and the swirls seem too uninterrupted, repetitious, and densely layered. The stuffy, old-school curator (Thomas Hoving), brought in early in the film, tosses off the observation that the Horton painting is too compact and busy to be a Pollock--and that remains one of the few painting-literate analyses in the whole #$&%*(^ movie. Most Pollocks give the viewer a sense of receding spaces beyond the surface that the Horton painting lacks. Pollock paintings also tend to have more straight lines made by sharp, whip-like gestures of the painter's arm and hand and have areas that seem more calligraphic than just randomly swirled as the Horton painting does. If one is familiar with Pollock's pre-spatter style, which often involved calligraphic and/or vaguely figural designs, sometimes Picasso-esque, one can see more abstract but still distinct versions of such pre-spatter era designs within the Pollock spatter paintings of the late 40s and 1950s. The Horton painting seems an aggressive, monotonous collection of swirls. This is admittedly what many people claim all Pollock paintings look like. But the devil is in the details: I have yet to see a certified Pollock that looks like the Horton painting.",
         "Documentary about one Teri Horton, a 73-year-old former truck driver (with a colorful and precarious past) who bought a peculiar painting one day in a California thrift shop--only to discover it might be a lost masterwork from famed artist Jackson Pollock. Horton, eager to sell the painting and get on her feet financially, is unable to convince the skeptical art world of her treasure, with naysayers far outweighing the handful of experts who find evidence the painting is indeed a Pollock (the artist left the work unsigned, though a fingerprint on the back is an exact match to the now-deceased maestro). Elements of Pollock's life are explored and intersected with Horton's own background; she tells at one point of a suicide attempt that went amusingly wrong, and her no-nonsense manner and pithy, seen-it-all demeanor are both funny and touching. Short at 74 minutes, the documentary is entertaining, perhaps minor, though a testament to the stubborn human spirit. Offered nine million dollars at one point, Horton refused to give the painting up, wanting her share of the American dream for what it is rightfully going for on the artists market. **1/2 from ****",
         "So what is it with the truck driving woman who is the center of this documentary? She finds a painting at some second hand store that may be an original Jackson Pollock for $5.00. She later finds out that it may be worth a lot more (25,000,000 more)than the $5.00 she paid for it. She has the painting taken to a lot of art experts who can't seem to agree if it was done by Pollock himself or was just a copy by someone else. A fingerprint is found on the back of the painting at one point. No finger prints of Jackson were ever put on file so an investigator goes to Jackson's old studio (which is a museum now) to see if any of his fingerprints can be lifted from any old paint cans he may have handled. A finger print is found and does resemble the one on the back of the painting...but still no one can seem to agree. Teri Horton (The woman who found the painting) is first offered $3,000,000 for it by someone who believes it is a Jackson. She turns them down for reasons that to me at least are confusing. She stated its the principle of the thing. OK So she wants more for it if in fact it can be proved to be a real Jackson Pollock. No one in this documentary ever does conclusively prove that the painting was from him. I would think if it can't be proved for sure I would take the $3,000,000 like a bandit. The real kicker to me about this film was before the credits started rolling it was said that Teri Horton was offered $9,000,000 from another buyer, in which she turned down also. Is this women dumb or what? What bothered me most about this film was the ignorance of this woman. Is it greed? Maybe. But if a painting can't be proved to be from an artist as an original and someone offered me $9,000,000 I would take it. Why not? Any smart person would I think but she appeared to me as some redneck who has the attitude that the less she knows the better she will be. Well, in any case she should go back to driving a truck."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Hewitt Group",
         "New Line Cinema"
      ],
      "summaries": ["In this documentary, veteran filmmaker Harry Moses exposes the controversy in the world of high priced artwork. He paints a vivid picture of how art is bought and sold in America."],
      "budget": 0
   },
   "movielensId": 53498,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-11-09",
      "dvdReleaseDate": "2007-05-01",
      "directors": ["Harry Moses"],
      "runtime": 74,
      "movieId": 53498,
      "title": "Who the #$&% Is Jackson Pollock?",
      "mpaa": "PG-13",
      "actors": [""],
      "imdbMovieId": "0487092",
      "originalTitle": "Who the #$&% Is Jackson Pollock?",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["AzIbSeUyCQw"],
      "plotSummary": "After semi-truck driver Teri Horton bought a large splatter painting for her friend for $5, she was forced to sell it in her own garage sale when her friend said she had no place for it. Eventually someone commented on the painting stating it might be an original Jackson Pollock. This documentary follows Teri, her son, and a forensics specialist as they attempt to prove to the world, or more specifically the art community, her painting is a true Jackson Pollock",
      "tmdbMovieId": 45664,
      "avgRating": 3.39189,
      "releaseYear": "2006",
      "numRatings": 37,
      "posterPath": "/lPG9kD993EpbGu7gas2zeEU1Pok.jpg"
   }
}