{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "general",
            "id": 1402
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "planned murder",
            "id": 3152
         },
         {
            "name": "victim of murder",
            "id": 4942
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "philip marlowe",
            "id": 155860
         }
      ],
      "imdb_id": "tt0077234",
      "video": false,
      "title": "The Big Sleep",
      "recommendations": [
         51146,
         115039,
         29021,
         50669,
         35023,
         61095,
         95548,
         43846,
         48280,
         108266,
         24751,
         48885,
         43044,
         25900,
         39771,
         45679,
         139058,
         23189,
         37504,
         25672
      ],
      "backdrop_path": "/mC4ofm0bhp3BqcgI8WWSSjWDLV5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Philip Marlowe",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803986b",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Charlotte Sternwood",
               "gender": 1,
               "credit_id": "52fe4317c3a36847f8039873",
               "name": "Sarah Miles",
               "profile_path": "/xsGOmzW67NTLPpTMrzyegq22CQl.jpg",
               "id": 15197,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Camilla Sternwood",
               "gender": 1,
               "credit_id": "52fe4317c3a36847f803986f",
               "name": "Candy Clark",
               "profile_path": "/6pGZGgHa09ktPwEcFWNAU3PLFdi.jpg",
               "id": 12407,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Lash Cansino",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039883",
               "name": "Richard Boone",
               "profile_path": "/kmNMYGDIxSPwgfXTrwXMawhyj29.jpg",
               "id": 16420,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Agnes Lazelle",
               "gender": 1,
               "credit_id": "52fe4317c3a36847f8039867",
               "name": "Joan Collins",
               "profile_path": "/8KKTDl6jaM6RTWuRpuuXOvMsvG.jpg",
               "id": 13637,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Inspektor Carson",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039877",
               "name": "John Mills",
               "profile_path": "/5MiJRQj6irdxqCtAhX00YWqmGjZ.jpg",
               "id": 11859,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Eddie Mars",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803987b",
               "name": "Oliver Reed",
               "profile_path": "/we10IusqRV1NHRtA68ftyck2N33.jpg",
               "id": 936,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "General Sternwood",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803987f",
               "name": "James Stewart",
               "profile_path": "/aBLtt0Sl4AZVNclzFrXzbndRzux.jpg",
               "id": 854,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Joe Brody",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039887",
               "name": "Edward Fox",
               "profile_path": "/iNk3GvWMWm37PjsidHY9M6Unmwm.jpg",
               "id": 9126,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Norris",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803988b",
               "name": "Harry Andrews",
               "profile_path": "/1EJXH5DyJWDtHfX8MeqSrCrUlwD.jpg",
               "id": 19463,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Harry Jones",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803988f",
               "name": "Colin Blakely",
               "profile_path": "/jyUiKbQr3dVOXRck0weIvpYPnjC.jpg",
               "id": 13329,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Commander Barker",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039893",
               "name": "Richard Todd",
               "profile_path": "/asmQq1hLKEHiBQdQvvO4jXzfrNg.jpg",
               "id": 20393,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Lou",
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039897",
               "name": "Tom Laughlin",
               "profile_path": "/o8e43sIbLVBOewpgXyyO5IcKRkk.jpg",
               "id": 129482,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039839",
               "name": "Elliott Kastner",
               "profile_path": null,
               "id": 9169,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803983f",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039845",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803984b",
               "name": "Raymond Chandler",
               "profile_path": "/7YEDJ0u0JVcA2XETAtLHDbme2rf.jpg",
               "id": 12493,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039851",
               "name": "Robert Paynter",
               "profile_path": null,
               "id": 14456,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039857",
               "name": "Jerry Fielding",
               "profile_path": null,
               "id": 7769,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f803985d",
               "name": "Frederick Wilson",
               "profile_path": null,
               "id": 19245,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4317c3a36847f8039863",
               "name": "Michael Winner",
               "profile_path": "/jZix6y5rPSromAWQe0o774eqqa.jpg",
               "id": 19244,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 3.357903,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 1815,
      "vote_count": 16,
      "budget": 0,
      "overview": "The classic Raymond Chandler tale retold with Mitchum taking over the Bogart role.",
      "similar": [
         2024,
         1949,
         10999,
         7972,
         1580,
         49519,
         329103,
         1965,
         116711,
         12429,
         1846,
         19724,
         910,
         10779,
         9022,
         10559,
         1847,
         375012,
         8545,
         6963
      ],
      "original_title": "The Big Sleep",
      "runtime": 100,
      "poster_path": "/yQmJ9PF4IyR16rJFryUg7JXZeAH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Incorporated Television Company",
            "id": 1155,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "ITC Entertainment",
            "id": 1584,
            "origin_country": ""
         }
      ],
      "release_date": "1978-03-13",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Philip Marlowe (Robert Mitchum) Collection",
         "id": 515268,
         "poster_path": null
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Michael Winner"],
      "runtime": 99,
      "synopsis": "Rusty Regan (David Savile), former IRA- fighter and bootlegger, was in love with a Mona Grant (Diana Quick). Mona married Eddie Mars (Oliver Reed) instead, casino owner and racketeer, so Rusty married Charlotte Sternwood (Sarah Miles). Spoiled and psychic fragile Camilla Sternwood (Candy Clark), sister to Charlotte, shoots Rusty Regan who denied her advances. With help of Eddie Mars, Charlotte disposes of the body and Eddie nourishes hopes of a healthy bite in the sisters' heritage, once old man General Sternwood (James Stewart) dies. The General, of poor health, was very fond of his son- in- law Rusty. To avoid Charlotte or Eddie beeing suspected by the police, they spread rumour that Rusty left with Eddie Mars' wife. General Sternwood gets blackmailed by A. G. Geiger (John Justin) on account of Camilla. Some time earlier, Sternwood paid 5'000.- $ to Joe Brody (Edward Fox), also on account of Camilla. Sternwood hires Philip Marlowe (Robert Mitchum) to get rid of the problem. The blackmailer, Arthur Gwynn Geiger, is bisexuell and, with the fassade of an antique books store, involved in smut books and blackmailing. Owen Taylor (Martin Potter), chauffeur to the Sternwoods with a criminal record, wants to call Geiger on his machinations with Camilla, witnesses Geiger's taking nude photos of her drugged and shoots him. Takes the plate holder of the camera with him. Joe Brody, friend to Agnes Lozelle (Joan Collins), the front woman in Geiger's bookstore, was on his way to Geiger. Hears Taylor's shots, follows him and knocks him out. He takes the plate holder from him. Taylor awakenes, knocks out Brody and escapes without plate holder. Later Taylor is found killed in a Sternwood car in the harbour. According to the trivia in the Bogart/ Bacall- Version, not even Chandler knew who killed him... Karl Lundgren (Simon Fisher- Turner), Geiger's lover from his bookstore, comes to the appartment while Marlowe took the drugged Camilla to the Sternwood place. He hides the body to clear out his personal belongings. Marlowe misses the body when he returns and meets Eddie at Geiger's. Later, Lundgren, probably bitten by remorse, comes back, takes Geiger's body out of his hiding place and lays him out in state in his bed. Brody snaps the inventory of Geiger's smut library to run his own business. Marlowe gets at him and Agnes. Camilla appears and tries to shoot Brody; but Marlowe takes her gun. Brody is shot by Lundgren who thinks Brody shot Geiger. Lundgren is later turned over to the police by Marlowe. Earlier, Agnes and Brody saw Mona and Lash Canino (Richard Boome), paid killer for Eddie, by chance and followed them to their hiding place. Agnes wants to sell this information to Marlowe through Harry Jones (Colin Blakely), who gets killed by Canino in the process. Marlowe gets the information of Monas whereabouts. The place is Art Huck's garage, a hot car drop. Marlowe is done in by Huck and Canino. When these two leave, he is guarded by Mona. Marlowe is able to rouse suspicions in her about Eddie, so she lets Marlowe escape. Marlowe thinks getting oberpowered by Huck and Canino and released by Mona was a prearranged thing. Marlowe kills Canino in a shootout. General Sternwood asks Marlowe to look for the whereabouts of Rusty. On his way out he runs into Camilla and gives her her gun back. She wants shooting lessons from him. Marlowe had - unknown to her - loaded the guns with blanks which saved his life: She tries to shoot him because he refused Camilla earlier as Rusty did. Camilla is not turned over to the police, Marlowe tells Charlotte to bring her in a mental hospital.",
      "writers": [
         "Raymond Chandler",
         "Michael Winner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077234/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMzQ2ODA5M15BMl5BanBnXkFtZTYwMzIyNzU5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Mitchum, Sarah Miles, Richard Boone | See full cast and crew »"],
      "reviews": [
         "In a lot of ways, \"The Big Sleep\" must have seemed tailor-made for a remake in 1978. The first movie version, while justly famed for the chemistry between Bogie and Bacall, really didn't come close to doing justice to Raymond Chandler's original novel. A lot of that had to do with the fact that Hollywood in 1946 just couldn't show a lot of the things that Chandler did in his 1939 novel. The nudity, the drugs, the pornography, the homosexuality were all a little too strong for a mainstream movie of that time. In addition, Chandler's convoluted plot (originally derived from two or three separate short stories) didn't offer an easy screen translation, even before all the \"juicy parts\" were excised. So this must have seemed like a great idea. Robert Mitchum had successfully played Philip Marlowe a few years earlier in \"Farewell, My Lovely\", and the MPAA ratings system meant that they could be as explicit as they wanted; the filmmakers could be more faithful to Chandler's novel *and* show us Candy Clark nude! How could we go wrong? In lots of ways, unfortunately. First up, Mitchum didn't seem to fit the role of Marlowe nearly as well in this movie as he did in \"Farewell, My Lovely\". This makes me suspect that the earlier story was more deftly tailored to Mitchum's age and acting style, with lots of references to how old and tired Marlowe feels. In this case, the script sticks very closely -- basically scene-by-scene, almost line-by-line -- to the original novel, but Mitchum doesn't fit the part as well, somehow. In the book, Marlowe was very much \"in your face\", giving a hard time to everyone from the cops to Eddie Mars to the Sternwood girls. That means that in this movie, Mitchum's nonchalant style doesn't fit with many of the scenes he has to play. Bogart was \"nonchalant\" too, I guess, but in a different way. Bogie's tough guys would feign casualness, but they always seemed like they were waiting for the other guy to start something, and when Bogart dug in and got to work, he took it seriously. Mitchum just seems like he couldn't care less one way or the other. It doesn't work for this story, where the second half is driven by Marlowe's desire to find out the truth even when he isn't being paid to do so. The move from L.A. to London didn't bother me at all. It made an interesting, coincidental \"bridge\" between the classic films noir and more recent movies about London gangs like \"Snatch\". But the deepest problem with this film is that while it follows the externals of Chandler's novel much more closely in terms of the plot and (most of) the dialogue, it fails utterly to capture the real heart and soul of the novel. Of course, the earlier movie version did, too -- this novel may well be unfilmable -- but at least it had Bogie and Bacall. This one has Mitchum and Miles. And Candy Clark nude. And not much else. Take a look at the beginning of the movie. The second scene, where Marlowe visits General Sternwood in the greenhouse, is probably one of the classics of 20th century popular literature. Few other novels begin with a scene which so completely evoke their characters, and atmosphere, as Marlowe sweats, gags on the scent of orchids, and converses with a tired, bitter, old, rich man clinging to his miserable life. Chandler is hitting you hard with every trick in his bag, and his timing, dialogue and characterization are flawless. Howard Hawks' screenwriters were smart enough to leave much of his original dialogue in this scene. By contrast, in the Mitchum film, scene after scene features lines taken verbatim from the novel, but for some reason, they chose to leave out some of the best: \"How do you like your brandy, sir?\" \"Any way at all.\" or the all-time classic, \"A nice state of affairs when a man has to indulge his vices by proxy\". If the screenwriters chose to leave in lines about Pekineses and loogans, how could they possibly leave these ones out? Maybe they thought that such lines wouldn't sound right coming out of James Stewart -- they were probably right -- but that just shows what an inept choice he was for this part. General Sternwood is supposed to be incredibly bitter, yet we're given a typical Stewart performance; he almost looks perky, certainly not broken by life. He looks physically weak but hardly seems cynical or jaded enough to have produced two such screwed-up daughters. It wasn't even made clear why he was sitting out in the greenhouse, and Marlowe doesn't seem particularly uncomfortable while he's out there (although a later reference to Rusty Regan \"sweating like a pig\" is left in). It's just a mess, and does nothing at all to set us up for what follows. To cite one further example, another key scene manages to miss the point completely while still following Chandler's plot closely. The scene where Harry Jones finally approaches Marlowe in Marlowe's office is the turning point of the entire novel. The case is closed, Marlowe is literally signing the check to deposit it, and Jones walks in with the exact piece of information Marlowe's been missing the entire time. Like so many scenes in the novel, this one is simply brilliant, overflowing with great dialogue (\"She's too big for you\"), and in some ways tying together the entire story. Yet after following most of the scene very closely, the script inexplicably stops short of some of Chandler's best writing: \"'This Regan was a cockeyed sort of buzzard. He had long-range eyes. He was looking over into the next valley all the time. He wasn't scarcely around where he was. I don't think he gave a damn about dough. And coming from me, brother, that's a compliment.' \"The little man wasn't so dumb after all. A three for a quarter grifter wouldn't even think such thoughts, much less know how to express them.\" The filmmakers may have closely followed the plot of the original novel in this version, but the fact that they could leave out writing like this, while clinging almost religiously to most of the rest of the book, shows that they couldn't have been more clueless about the real \"core\" of Chandler's writing. Alas, it appears that we are still waiting for the definitive movie version; this one manages to reduce \"The Big Sleep\" to a barely-above-average TV movie-of-the-week with Candy Clark, nude.",
         "In recent years we have seen a number of Hollywood remakes of classic British crime films, such as 'Get Carter', 'The Italian Job' and, most recently, 'The Ladykillers', a phenomenon that has aroused some critical comment, especially in Britain. This film shows that, nearly thirty years ago, this same phenomenon was happening in reverse, and the British were remaking classic American crime movies. The plot broadly follows that of the 1946 film, with the striking exception that the action takes place in London rather than Los Angeles. This does not, however, mean that the original has been completely anglicised. Both Philip Marlowe and General Sternwood are American expatriates living in London rather than Englishmen, and they are played by two of Hollywood's biggest stars, Robert Mitchum and James Stewart. With the exception of Richard Boone as Canino and Candy Clark as Sternwood's younger daughter, the other main parts are all played by British actors. The film was clearly made as homage to the famous Humphrey Bogart classic, and it is inevitable that comparisons will be made between the two. In some respects, in fact, the later film is superior to, or at least as good as, the earlier one. (I have not read Raymond Chandler's novel, so I cannot say which film is closer to the original source material). The 1946 film is a fine one, but it is not perfect and has a number of weaknesses, not least its insanely complicated plot containing threads that are never developed and events that are never explained. The plot of the 1978 film, while complex enough, is somewhat easier to follow than that of its predecessor. To the purist Bogart fan there can be no substitute for the original, but to anyone else Robert Mitchum, himself a fine exponent of the film noir style during the early part of his career in the forties and fifties, seems like the best possible replacement. He is, of course, older than Bogart was when he played the role, and his portrayal of the character is perhaps less cynical and more thoughtful, but it is a perfectly acceptable interpretation. There are also good performances from Stewart in the cameo role of Sternwood, from Oliver Reed and from Joan Collins. As a whole, however, the film does not live up to the standard of the original. Certainly, not all the actors are as good as their 1946 counterparts (Sarah Miles, for example, is no Lauren Bacall), but the main reason for its comparative failure goes deeper. The Bogart movie is perhaps the quintessential film noir, a film that one watches less for its plot, or even for its acting, than for its unique atmosphere of cynicism, menace and dubious glamour. An important factor in creating that atmosphere is its dark, brooding black-and-white photography. Unfortunately, in the late seventies the use of black-and-white was generally regarded as the equivalent of hanging a sign on the cinema door saying 'Warning! Art-house Movie! Intellectuals Only!' A few established auteur directors such as Woody Allen ('Manhattan') and Martin Scorsese ('Raging Bull') could get away with using monochrome, but there was no way that the studio would allow such latitude to Michael Winner, a director generally associated with violent commercial thrillers. So colour it had to be. In fact, the photography of London and the English countryside is quite attractive, but it is no substitute for the authentic film noir look. I mentioned that the atmosphere of the earlier film was also one of dubious glamour; besides Bacall it has a large number of other strikingly beautiful but sinister women (some of them only in minor roles). The later film cannot compete in this respect. With the exception of Joan Collins (who could do sultry but sinister glamour in spades, even in her mid-forties), none of the female characters has the required touch of the femme fatale about her. As a London-based crime thriller, Winner's 'The Big Sleep' is not a bad film; it is better than most of its director's other thrillers and better than a lot of other British films from the seventies. As homage to its namesake, however, it falls some way short of its aims. 6/10",
         "You may regard the 1946 version as a classic because of the Bogart-Bacall pairing. As a literary adaptation, this version, however, is much better. First of all, the plot stays true to the novel, whereas the older version had a plot ruined by the restrictions of the Hayes code, so that it contains numerous loose ends and unexplained developments. Secondly, Robert Mitchum impersonates Marlowe much better that Humphrey Bogart. Bogart essentially recycles his role of Sam Spade in \"The Maltese Falcon\". Yet, Spade and Marlowe are very different characters. While Spade is a cynic who just barely remembers the remnants of morality (and Bogart is brilliant in that role), Marlowe is way beyond that point. He walks around people in a distanced, almost detached way. Only when he spots a glimpse of humanity in his fellow men, he is willing to engage himself (as with General Sternwood in \"The Big Sleep\"). Mitchum plays this character with great understatement, as it should be done, while Bogart makes Marlowe just another hard-boiled detective, which could be replaced by any other one. Finally, both Sarah Miles and Candy Clark (while not being necessarily great actresses) bring over the lunacy of the Sternwood daughters beautifully. While the scenes between Bacall and Bogart a great, they are out of place in this plot, in which there is no place left for romance. It might have been appropriate for the characters of Marlowe and Linda Loring in \"The Long Goodbye\", but hardly in a movie adaption of a novel, in which Marlowe remarks \"both Sternwood women were giving him hell\". So, while this movie transfers the plot to another time and another place, it is a much better adaption of the novel than the version often regarded as a classic.",
         "Chandler's novel is pushed ahead by about 40 years. His Philip Marlowe is aged about 30 years. The location is changed by the combined breadth of the United States and the Atlantic Ocean. It should come as no surprise that this doesn't work at all. The scandal from which Marlowe shields the old man was so much more significant in the period in which the book was set. (Who, for example, really would be heart-broken or even especially shocked to learn in 1978 that his daughter had been photographed in the nude? Granted, that the secrets get darker, but the point is that so much is diluted.) Mitchum is a very, very fine actor, and when he was, say, 30 to 40 years old he would have been a good choice to play Marlowe; but an important aspect of Marlowe is exactly that he is so weary of spirit while still a relatively young man; we expect the old to feel old. And...a film noir in the English country-side? I don't think so!",
         "A dream project with a dream cast and the result is a nightmare. Well, definitely not a pleasant dream. While Michael Winner was busy updating \"The Big Sleep\" why didn't he add a disco score to reflect the cultural environment of 1978? It would have made just as much sense as plopping a too well-tailored and inappropriately affluent Philip Marlowe down in modern day London. Chandler's novels were very much about the city of angels as much as they were about Marlowe and his code of honor. Winner either didn't know that or didn't care. What he gives us is a standard yet below par mystery film that has little connection with the character Robert Mitchum so memorably played three years earlier in \"Farewell, My Lovely.\" Unlike Robert Altman's \"The Long Goodbye,\" wherein Marlowe was portrayed as an anachronism in contemporary society, Winner's updates reflect nothing but his ignorance of and/or boredom with the material. But Richard Amsel's poster is great!",
         "Raymond Chandler's plots can drive you crazy. The most admirable thing about Chandler's stories is his language (\"hard boiled\") and the way he uses it to evoke a Los Angeles of the 30s and 40s that is so infected with corruption that, like a ripe pustule, we expect it to pop momentarily. And that's what makes it so difficult to transfer his works to the screen. You almost have to have a voice-over from Philip Marlowe otherwise you not only get lost in the various plot twists but you miss the adamantly low-brow tropes -- \"her hair was the color of gold in old paintings,\" or, \"she threw me a glance I could feel in my hip pocket.\" \"Chinatown,\" set in 1937 LA, was released to great critical and public acclaim in 1974. The very next year, Robert Mitchum tackled Philip Marlowe in \"Farewell, My Lovely\" and he was great, and so was the production, even if it was not the masterpiece that \"Chinatown\" was. Nobody will ever make a masterpiece out of a Chandler story because, after all, a masterpiece usually starts out with a coherent plot. So the trick is to capture on screen what Chandler's prose evokes on the written page. Style is everything. \"Farewell My Lovely\" had it. \"The Big Sleep,\" alas, doesn't. The director hasn't really done much to help things. In the 1946 version of \"The Big Sleep,\" Howard Hawks at least had some fun with the characters. (Bogart and the horn-rimmed glasses in the book shop.) Hawks also allowed some humor in the dialog. (\"She tried to sit in my lap while I was standing up.\") Philip Marlowe with his resolutely seedy presence belongs in the marginal zone of Los Angeles, not in the uptrodden neighborhoods of London. He belongs in a trench coat, wearing an older fedora, not in the powder blue suits of Saville Row. (\"I own a hat and a coat and a gun,\" he tells Nulty in \"Farewell My Lovely,\" \"and everything I touch turns to s***.\") In this film we have to put up with a confident and compassionate Marlowe, striding through the fancy decor instead of slouching, never touching a drop of alcohol. And Mitchum doesn't add much to the story besides his usual heft. As James Agee once said of him, his casual languor suggests Bing Crosby supersaturated on barbiturates. That reminds me. I couldn't help wondering, while I watched this, how much booze had gone into the production. I forget whether Chandler had quit drinking by the time he wrote this, but Mitchum himself was hardly an amateur. Olivier had kicked Cyril Cusack out of the Old Vic for showing up drunk for a performance of \"Doctor's Dilemma\" and reciting lines from another of Shaw's plays. Richard Boone was evidently immobilized during his last few years and Oliver Reed died of drink. Still, look at the actors in this thing. In support are Edward Fox, Harry Andrews, James Donald, Colin Blakely, James Stewart, and Richard Todd. And all of them are up to the task, true professionals, with not a hollow note struck. I'm tempted to call the cast \"peerless\" but I don't know if it's permitted if there's a theatrical knight among them. Richard Boone is outstanding as Canino -- a villainous wreck, hobbling about on a broken foot, cackling over his own sliminess, howling with unrestrained glee as he watches a harmless little man whom he has just poisoned crash through a glass door and die. Also notable are the locations and the art direction. It may not be sleazy Los Angeles in 1941 but London and its interiors look just fine. London has never looked less grimy. There is no rain or fog, the streets are clean, narrow and lined with classy book shops, and people tend to drive new and expensive cars. Well, the movie is done with dash and style, no doubt about that. But it's the wrong style. Marlowe belongs in the 1940s. In the 1940s pornography and dope could get you serious jail time -- just ask Mitchum. I didn't much care for it the first time I saw this. The second time was easier going because I'd lowered the bar of my expectation.",
         "Warning: This review may contain spoilers. When Michael Winner decided to remake Howard Hawks's 1946 classic version of Raymond Chandler's mystery novel \"The Big Sleep\", he must have known that comparisons to the original film would materialize and that the majority of them would not be in favor of his 1978 screen retelling. The majority was correct. This 1978 version can't compare to the Hawks original(**** out of ****) in terms of style or entertainment value. That stated, this \"Big Sleep\" does make for worthwhile viewing after one has seen the original. While I haven't yet read the book I believe Chandler fans who say this version is more faithful to the original novel despite its updating from 1940s Los Angeles to 1970s London. This version benefits from writer/director Winner's tight screenplay that makes more sense than the earlier one penned by William Faulkner, Leigh Brackett and Jules Furthman. After screening it, so many things that baffled me after even multiple viewings of Hawks' version became clearer resulting in a more coherent and intellectually satisfying viewing experience. Therefore, I recommend this one after seeing the stylish original to help better understand Chandler's complex story. Other benefits include relatively handsome production values and a good cast: Robert Mitchum(in his 2nd performance as detective Philip Marlowe), James Stewart, Sarah Miles(who unfortunately sports a very unflattering Donna Summer-style hairdo but hey it was the late '70s), Richard Boone, Joan Collins, Oliver Reed, John Mills and Richard Todd. Contrary to the advertising on the current video release, Miss Collins doesn't play the female lead. That honor goes to Miss Miles who co-starred with Mr. Mitchum previously in David Lean's \"Ryan's Daughter\"(1970). Don't expect the same playful chemistry that Humphrey Bogart and Lauren Bacall shared in the original as the Marlowe/Vivian (or rather Charlotte as the elder Sternwood daughter character is named this time around) relationship is decidedly different. Warning: parents, pay attention to the R rating. Certain subject matter only hinted at in the 1946 version is portrayed much more graphically this time around. Definitely a film for adults only. Final rating: **1/2 out of ****.",
         "...I've enjoyed this movie better than the 1946 Howard Hawks version. Before starting to bash me let me explain why: 1) The 1978 movie is much more entertaining than the 1946 one, where you couldn't realize wha'the hell was happening there, and finally you got bored (At least I did). But now you have got a plot that you can follow. 2) The characters. In the 1946 version everything was so \"cold\" that you never managed to care about any of the characters. If we were supposed to \"connect\" with Marlowe-Bogart, I didn't. Why? Because in that version he's more a proto-James Bond (that makes girls instantly fall for him -you only have to remember the Acme Book Shop scene or the Girl Taxi Driver one- while the spectators don't know really why, as he isn't the most handsome man in the world, and he doesn't even say anything to the chicks that make them like him so much, but he only mumbles cynical phrases all the time) than a film noir private dick (he played perfectly a different kind of private eye in the far superior THE MALTESE FALCON). Marlowe-Mitchum, however, is a cent-per-cent detective who only makes his job the best he can, and when we see a girl falling for him, we'll finally know the reason (the younger Sternwood girl \"falls for him\" because of the same reason she did in the earlier version, and the older Sternwood sister,... well, we'll know at the ending). I could more easily feel identified with Mitchum than with Bogart. And about the other characters: General Sternwood was almost uninsensitive in the 1946 movie while James Stewart as Sternwood now is a warm character that feels lonely. You feel more sorry for poor Harry Jones in this version than in Hawks'. The bad guys are scarier, specially Richard Boone as Canino. And the older daughter of Sternwood has a reason for her behavior. 3) The whole concept. If you're a Raymond Chandler fan, this one is the version to see. Here you'll find the \"real\" Philip Marlowe the way Chandler wanted him to be (althought a little too aged, but that's not problem for me). And you'll have a detective plot here. The 1946 movie, however, took Chandler's great novel, modified it and turned it to a love-innuendo-between-the-two-main-characters story, as a mere excuse to show on screen the \"chemistry\" that Bogey and Lauren Bacall had. And that's the most important thing: see Bogart and Bacall saying brilliantly cynical quotes that had nothing to do with the novel (as the famous dialogue about horses), or modifying the ones in the novel (which are equally brilliant and we can find them in this 1978 version). But nobody cared about the plot. And I don't mind that old \"Who killed the driver\" problem, it isn't even explained in the novel, but the whole intrigue. About Bogey and Bacall, they were a wonderful couple, and I recommend seeing them in DARK PASSAGE, a great film-noir movie who will never bore you. But The Big Sleep wasn't their best day, at least for me. 4) The ending. It makes much more sense than the one in the 1946 version (Obviously, I won't spoil it here). But there aren't only good points: I would have enjoyed this movie more if it took part in LA in the 1940s instead of in London in 1978. But I don't really care, as did the other person who posted a comment here. Every place or country is good to be the scene of a good film noir plot. And, of course, after all, Michael Winner is not Howard Hawks, and some scenes in this version aren't so well filmed as in the earlier movie (i.e. Harry Jones' death), but even that way I prefer this one. Just my opinion. What I will never do is saying that something is good just because lots of people say it.",
         "I haven't seen the Humphrey Bogart version of this Chandler remake but I enjoyed this one very much. Robert Mitchum brought great class to the role of Marlowe as few else could have done. His shady look, cool persona, and hilarious one-liners help to explain why Chandler is one of the greatest crime writers of all time. I haven't read any of the books but after seeing this film I am certainly much more interested in them. It came as a surprise to me that Michael Winner was the director for the film. A man I associate with expensive dinners at expensive restaurants. But after watching this, and Death Wish, I have a new-found respect for eating in style. This film is not a Peckinpah, but it still manages to be incredibly effective in it's delivery. I like the car Mitchum drives too, a Mercedes soft-top. The video is in widescreen by the way, requiring a screen re-adjustment or it'll look silly. Great performances from all of the actors and a superbly enjoyable plot in a film that has aged very well. Some people criticised this film for being in the English countryside and that it doesn't bear up with the film noir style. I disagree, film noir is not limited to shady city streets, as this film goes to show.",
         "I have never read the book, nor seen the Bogart version, so I came to this film with no preconceptions, and I found it well scripted, well acted all round, and most entertaining. Probably I will be disappointed by the Bogart version when I get to see it. Well worth watching."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Incorporated Television Company (ITC)",
         "Winkast Film Productions"
      ],
      "summaries": ["Set in England, rather than California, the story follows Raymond Chandler's book fairly closely otherwise. Philip Marlowe is asked by the elderly (and near death) General Sternwood to investigate an attempt at blackmail on one of his daughters. He soon finds that the attempt is half hearted at best and seems to be more connected with the disappearance of the other daughter's husband, Rusty Regan. Rusty's wife, seems unconcerned with his disappearance, further complicating the mystery. Only General Sternwood seems concerned as mobsters and hired killers continue to appear in the path of the investigation."],
      "budget": 3000000
   },
   "movielensId": 5352,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1978-03-13",
      "dvdReleaseDate": "2002-04-23",
      "directors": ["Michael Winner"],
      "runtime": 100,
      "movieId": 5352,
      "title": "The Big Sleep",
      "mpaa": "",
      "actors": [
         "Robert Mitchum",
         "Sarah Miles",
         "Candy Clark",
         "Richard Boone",
         "Joan Collins",
         "John Mills",
         "Oliver Reed",
         "James Stewart",
         "Edward Fox",
         "Harry Andrews",
         "Colin Blakely",
         "Richard Todd",
         "Tom Laughlin"
      ],
      "imdbMovieId": "0077234",
      "originalTitle": "The Big Sleep",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The classic Raymond Chandler tale retold with Mitchum taking over the Bogart role.",
      "tmdbMovieId": 1815,
      "avgRating": 3.56301,
      "releaseYear": "1978",
      "numRatings": 246,
      "posterPath": "/aXz5alyaP1VbLabDw7E5jSPYqpy.jpg"
   }
}