{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "river",
            "id": 1261
         },
         {
            "name": "expedition",
            "id": 1963
         },
         {
            "name": "nile",
            "id": 2906
         },
         {
            "name": "british empire",
            "id": 4107
         },
         {
            "name": "exploration",
            "id": 4759
         }
      ],
      "imdb_id": "tt0100196",
      "video": false,
      "title": "Mountains of the Moon",
      "recommendations": [
         47070,
         24046,
         22614,
         34615,
         47452,
         46976,
         41780,
         18389,
         9698,
         55204,
         20713,
         47870,
         42094,
         73079,
         108553,
         43691,
         38294,
         71805,
         44631,
         94671
      ],
      "backdrop_path": "/7XRKCdNoKOzKpGW6QO5nPCAsj7P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Richard Francis Burton",
               "gender": 2,
               "credit_id": "52fe45389251416c9102b677",
               "name": "Patrick Bergin",
               "profile_path": "/mxFum2Fr5YWD6kDQYb5u7EEvuva.jpg",
               "id": 29459,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Larry Oliphant",
               "gender": 2,
               "credit_id": "52fe45389251416c9102b67b",
               "name": "Richard E. Grant",
               "profile_path": "/jMnSjjPQwCOAJ1kPRXLbh0WnsPa.jpg",
               "id": 20766,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lord Murchison",
               "gender": 2,
               "credit_id": "52fe45389251416c9102b67f",
               "name": "John Savident",
               "profile_path": "/sbcvdi0JqC9KRUbyOJwZqVf0LeP.jpg",
               "id": 184881,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. David Livingstone",
               "gender": 2,
               "credit_id": "52fe45399251416c9102b683",
               "name": "Bernard Hill",
               "profile_path": "/fX9ggRFAZM7J8vPBdTWQphUNiRt.jpg",
               "id": 1369,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "John Hanning Speke",
               "gender": 2,
               "credit_id": "52fe45399251416c9102b687",
               "name": "Iain Glen",
               "profile_path": "/vYEI5xJWJ6HKjPusvO2klAvez3J.jpg",
               "id": 20508,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Isabel Arundell",
               "gender": 1,
               "credit_id": "52fe45399251416c9102b68b",
               "name": "Fiona Shaw",
               "profile_path": "/74b0OuN3xKs0dTMYBnbhDLwv8Oq.jpg",
               "id": 10981,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mr. Arundell",
               "gender": 2,
               "credit_id": "52fe45399251416c9102b68f",
               "name": "Leslie Phillips",
               "profile_path": "/A1vO83wMO5eG0AxRvBwwQwu5NCg.jpg",
               "id": 10655,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45389251416c9102b673",
               "name": "Bob Rafelson",
               "profile_path": "/6YJpKfdlyYUz2jOxYaZ5yvqueeC.jpg",
               "id": 19450,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45399251416c9102b695",
               "name": "William Harrison",
               "profile_path": null,
               "id": 69566,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45399251416c9102b69b",
               "name": "William Harrison",
               "profile_path": null,
               "id": 69566,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45399251416c9102b6a1",
               "name": "Bob Rafelson",
               "profile_path": "/6YJpKfdlyYUz2jOxYaZ5yvqueeC.jpg",
               "id": 19450,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54cd0044c3a3687f88001bde",
               "name": "Roger Deakins",
               "profile_path": "/pSCN7CfILlfQrxX43Kgqrx5mBYQ.jpg",
               "id": 151,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 1.966839,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33796,
      "vote_count": 16,
      "budget": 0,
      "overview": "The story of Captain Richard Francis Burton's and Lt. John Hanning Speke's expedition to find the source of the Nile river in the name of Queen Victoria's British Empire. The film tells the story of their meeting, their friendship emerging amidst hardship, and then dissolving after their journey.",
      "similar": [
         314095,
         10527,
         11430,
         9732,
         606,
         7350,
         14433,
         9904,
         10303,
         10603,
         14211,
         28761,
         10586,
         488,
         11385,
         161143,
         18994,
         57586,
         15587,
         18513
      ],
      "original_title": "Mountains of the Moon",
      "runtime": 136,
      "poster_path": "/7OI8DUbPh37EXmJReeRkgUwK34x.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "IndieProd Company Productions",
            "id": 959,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Carolco Pictures",
            "id": 14723,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zephyr Films",
            "id": 16923,
            "origin_country": ""
         }
      ],
      "release_date": "1990-02-16",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Two strangers made friends by a savage land. Two friends made enemies by the civilized world.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bob Rafelson"],
      "runtime": 136,
      "synopsis": null,
      "writers": [
         "William Harrison",
         "William Harrison"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100196/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1MjIyODM3Nl5BMl5BanBnXkFtZTYwNDcxMjM5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Patrick Bergin, Iain Glen, Richard E. Grant | See full cast and crew »"],
      "reviews": [
         "Every time I watch \"Mountains of the Moon,\" I grow more and more fascinated by it. An epic drama and adventure, an exploration of what makes a hero and the value of friendship... this movie is a marvel. I barely know where to begin. The acting is exceptional, of course. Patrick Bergin really makes Captain Richard Francis Burton come alive, so much so that I started reading up on Burton on my own after seeing the movie. His Burton is a man of great courage and insatiable curiosity, but also of great pride (the film only hints at Burton's infamous sexual escapades). Iain Glen brings great depth to John Hanning Speke, a man who desires greatness but cannot escape his fundamental weakness. It would have been so easy to make these two characters into square-jawed cartoons or place them in the easy Great Hero / Cowardly Villain mold, but director Bob Rafaelson, the script, and the actors wisely give us three-dimensional real people. While I was watching this movie, I felt like I was actually transported to Africa in the 1850s, when the first explorers ventured into what was truly the Dark Continent. You see Burton and Speke's expedition endure weather, illness, injury, and attacks by hostile tribesmen, bringing home the reality of how dangerous these expeditions really were. By the time the film ended, I felt I had been to Africa itself. If you want to see a real epic and a fine, exciting film, this is the one to see.",
         "Capt. Sir Richard Francis Burton and his mate, John Hanning Speke's travels to find the source of the Nile, and travails to claim the rigth to say that either of these two gentlemen adventurers discovered the source of the Nile makes for one of the biggest and best EPIC adventure films in recent memory. The performances from Patrick Bergin (better known for PATRIOT GAMES and SLEEPING WITH THE ENEMY), and Ian Glen (last seen on Broadway opposite Nicole Kidman in THE BLUE ROOM), turn in career-making perfomances as the two polar opposites who race to find the glory at the end of finding the source of the Nile. Bob Rafaelson, the man behind the camera, does not feel the need to spare the audience of any graphic details from the expeditions (including spearings, native sex, castrations, and ugly political maneuvering), and in the end, this is the best way to go since sparing us would have cheated us. Nor does he feel the need to spare us from any ticks in the characters themselves (Burton's blatant drinking and womanizing) and their questions (Is Speke gay? Who does end up with the bigger ego?). But the film's greatest achievements are: 1 - It makes you understand why these two gentlemen lived the lives they lived. 2- It makes you want to read more about them. 3- It really does make you feel like you too, got to go to see the Mountains of The Moon.",
         "This is the only movie, unless one recalls Spencer Tracy and Sir Cedric Hardwick in STANLEY AND LIVINGSTONE, that deals with the \"Golden Age\" of European exploration in Africa. It began in 1769 when James Bruce went to Ethiopia and did a remarkable job finding the source of the Blue Nile, and doing yeoman work on the anthropology of the Ethiopian people. Then there was the work of Mungo Park and the River Niger (until his death in 1806) and there were naval expeditions up the Congo (in 1819), and various internal expeditions. By far the greatest African explorer would be David Livingston, a missionary who captured the hearts of Victorian Britain. Most of Livingston's work involved Lake Nyasa, but he tried to also solve the greatest African (possibly global) geographic question: the source of the Nile River. In the 1850s two British officers from India, Richard Francis Burton and John Hanning Speke, mounted two expeditions into the interior of Africa from the island of Zanzibar. Burton was already a famous man - the first Christian to travel to Mecca and Medina. He was also a remarkable linguist. But Burton was a moody person, who could be insulting. Speke was avid to go on both journeys, but he lacked Burton's driving curiosity about the people of the continent of Africa. Speke also was extraordinarily ambitious, and wanted to find the source of the Nile. So did Burton, but he felt there was more to life than just settling a map problem. This film deals with what turned these two friends into enemies, and how a remarkable series of explorations,where Burton and Speke traveled together,and where Speke led his own exploration with James Grant, settled the mystery - but still left matters into greater confusion. On the second Burton - Speke journey, they both saw a large lake. Burton, with typical sense, named it Tanganyika, after the African languages he studied. But Burton became ill and was unable to continue circumnavigating this lake. Speke, meanwhile, had heard of another body of water to the north (Burton believed it was part of Tanganyika). Speke went on alone and saw this huge inland sea. He was convinced that he found the real source of the Nile but his proof was insufficient to Burton. Speke took advantage of Burton's illness to get back to England first, publish his findings only, and get official support from Sir Roderick Murchison and the Royal Society for his own expedition. He and Grant returned to Africa, just as Burton came home - to find himself being jeered at as having been lying on a cot while Speke was busy finding the source of the Nile. Speke came back with more details about his great discovery. He named this magnificent lake (the largest in the world) Lake Victoria. But his ego caused him to keep Grant from accompanying him on the final portion of this journey (wherein he circled the lake, and found the point it led to the Nile - which he called the Murchison Falls after the head of the Royal Society). So when he returned to England with his facts, Grant couldn't corroborate them. Burton and his friends began showing that some of Speke's observations and facts were odd to say the least (he had the Nile running up a mountain for ten miles). Soon a debate was arranged between Burton and Speke - a debate that Speke dreaded. Burton happened to be a very gifted writer and speaker and Speke was not. The debate was to occur at Bath in September 1864. It never occurred. As this film shows, Speke was killed in a hunting accident the day of the debate - whether it was a real accident or suicide has never been settled. Speke's friends blamed Burton, who was called a murderer by some of them. Burton never made a public comment again about the incident. It would not be until the late 1870s when Livingston's successor in Central Africa, Henry Morton Stanley, proved that Lake Victoria was the source of the Nile, and that Burton's Lake Tangayika was the source of the Congo. The film faithfully tells the tragic tale of how a great explorer was destroyed by his ambition, and how a close friendship was destroyed by a rivalry spurred on by a busy-body - in this case a man who was jealous of both Burton and Speke, Laurence Oliphant. Oliphant did not care who got injured. He is, in many ways, the real villain in this tragedy.",
         "\"Mountains of the Moon\" is one of my all time favorites. I saw it first when it came out in theaters and watch it three or four times every year after that. It is the true story of Richard Francis Burton and John Henning Speke, two British explorers , once were great friends and how they allowed pride and envy to destroy their relationship. The focus of the film centers around Burton (Patrick Bergin) and Speke's (Iain Glenn) quest to find the source of the Nile river in Central Africa. In the process of the journey Burton becomes quite ill and Speke goes on ahead. It is then when Speke discovers a lake and declares it as the source they have been searching for. When they return to England, however, Burton is not convinced by Speke's data and becomes convinced that a larger lake has to be the true source. Burton decides to go back, without Speke. This second expedition enrages Speke, who becomes one of Burton's bitterest rivals and critics. Also thrown into this volatile mix is Burton's devoted, strong-willed wife Isabelle (Fiona Shaw)who will stop at nothing to protect her husband's reputation.It's the complex, very human relationships of this film which makes \"Mountains of the Moon\" stand out from other period pieces. This film has everything: adventure, romance, scope, and a great performance by Patrick Bergin, playing a true-life swashbuckler whose life could be material for several screen epics. This film is the Anti-\"Titanic\", a true epic that doesn't replace character and humanity for mindless eye-candy and spectacle. James Cameron should have screened this film before he started his God-awful \"Titanic\" script. See it. You won't be disappointed.",
         "It was my good fortune to see MOUNTAINS OF THE MOON several times in its original theatrical release at New York's Ziegfeld Theatre in 1990. An article in the New York Times months earlier had alerted me to the possibility that this was my kind of movie. That easily proved to be true. MOUNTAINS OF THE MOON promptly became a great personal favorite, leading me to read two biographies of Sir Richard Francis Burton. When MOUNTAINS OF THE MOON was originally released on DVD on the Pioneer label I bought it immediately. Once again, I was lucky because the Pioneer release was in the original 1:85 theatrical ratio. The Pioneer release was withdrawn and this title was subsequently reissued on DVD on a different label. Regrettably it was in a full screen pan and scan version that spoiled this film's excellent visual compositions. MOUNTAINS OF THE MOON is superbly directed by Bob Rafelson. Although known as an excellent director of contemporary material, there is nothing in his previous body of work to prepare you for Rafelson's outstanding achievement in a period epic. It is uniformly well acted and technical credits are on a very high level. This overlooked classic deserves to be restored to it correct technical specifications on DVD. Hopefully, Bob Rafelson could do a commentary. Criterion Collection, are you listening? If you have not had the great good fortune to see this film theatrically, then let me urge you to seek out the Pioneer DVD release in the correct aspect ratio. MOUNTAINS OF THE MOON is practically the only film that I would seriously compare to LAWRENCE OF ARABIA. Each one is what you might call a thinking man's epic. Both of them succeed in asking provocative questions, without succumbing to giving the audience banal answers. Thematically, MOUNTAINS OF THE MOON is one of the relatively few films that seriously deals with male friendship gone wrong. Although the theme of toxic friendships has been well explored in so-called women's films, it's comparatively rare in films dealing with men. In order to accomplish this aim, MOUNTAINS OF THE MOON takes some license with the facts. However, it does so in order to serve a larger measure of the truth. MOUNTAINS OF THE MOON never resorts to cliché. This is a film for people who have a taste for sophisticated epic story telling and intimate character study. It has an unflinching eye for the best and the worst in it's characters. Layer by layer, Burton and Speke are revealed to be all too human. Allow me to recommend MOUNTAINS OF THE MOON to you without reservation.",
         "I have to admit that, before it was shown on television a few weeks ago, I had never heard of the movie. When I see how many people wrote a review or voted for this movie on IMDb, I guess I'm not the only one. It's clear to me that this is a movie that has never had any attention. Not from the public, the cinema's nor the festivals. Even journalist didn't pay much attention to it. Does that mean this movie isn't worth seeing? Certainly not, although the subject probably isn't very attractive to the mainstream audience. The movie tells the story of Burton and Speke, two friends and explorers who tried to find the source of the Nile in the middle of the nineteenth century. Burton was more of an anthropologist who wanted to learn more about the indigenous tribes which they encountered on their journeys, while Speke was more interested in the discovery of the source itself. Once they were back home they become enemies, because Speke tells everybody who wants to hear it that he alone discovered the source of the Nile, namely Lake Victoria. There are different things that I liked about this movie. The acting was very good, the costumes were nice, but what I really liked were the images from the African landscapes, the animals, the people... Seeing the images from England just made me look forward to the next scenes in Africa. It never felt right to see these two explorers in England, you're always left with the feeling that they belong in Africa. I guess that is where the strength of this movie lies ... It makes you feel exactly the way these men felt. I reward this little masterpiece with an 8/10.",
         "When this film came out in 1990, it disappeared from the theaters as quickly as it came. Which is a shame really, because MOUNTAINS OF THE MOON is an excellent historical drama about the search for source of the Nile. The film is beautifully photographed on real African locations. I hate to call this film an epic, because that word has bad connotations today, and the film does not suffer from \"epicitis\" like so many films dubbed \"epics\". But MOUNTAINS OF THE MOON is an epic in the positive sense of the word. The cast is uniformally good. A lot has already been written in this forum by others about the leads so I won't say anymore. Supporting player Delroy Lindo sometimes steals the show with his excellent role as the expeditions African guide. I recommend you rent this along with STANLEY AND LIVINGSTONE for a night of good viewing. Till next time...Your pal Jim.",
         "This is an excellent film, and it's unfortunate that it wasn't more widely seen. I wish I would've caught it in the theater, as I'm sure it would be magnificent there. In it, you're going to see some of the most painfully memorable scenes in cinema (that I refuse to give away), and an epic story that is most remarkably, wholly true. I loved Raiders of the Lost Ark, and before \"meeting\" Sir Richard Francis Burton, thought characters of Indy's ilk were simply figments of Steven Spielberg's imagination. However, with study you will find that Burton's experience (and that well beyond this expedition) makes him one of the most enigmatic, interesting people to have ever walked the face of the earth. As they say, truth is stranger than fiction. Slow, smart, challenging, beautiful. And highly recommended viewing.",
         "I have seen this movie several times and have enjoyed it immensely each time. The photography is beautiful and captures some incredible views of Africa. The story is of the adventure to discover the legendary source of the Nile, with the character of Richard Francis Burton(the famous 19th Century Irish Adventurer and translator of Kama Sutra and Perfumed Garden,who was fluent in many languages, and the English adventurer, John Speke. It is well worth the seeking out and watching, with the main incidents being historically accurate(such as who finally gets credit for the discoveries). It also brings into the light the prejudices of the Historical Society in the mid 1800's. An excellent movie!",
         "A great story, beautifully filmed and acted about two Victorian era explorers. Irish-born Sir Richard Francis Burton, one of the greatest explorers in history, is in search of knowledge. English-born dilletante John Hanning Speke joins Burton's quest in search of glory. Together they search for the answer to one of the most elusive geographical questions of their time - what is the Nile's source? The film accurately shows how the Royal Geographical Society and other outside interests played Burton and Speke against each other for their own gain. The film's tagline really says it all: \"Two strangers made friends by a savage world. Two friends made enemies by a civilized world.\""
      ],
      "genres": [
         "Adventure",
         "Drama",
         "History",
         "Mystery"
      ],
      "productionCompanies": [
         "Carolco Pictures",
         "IndieProd Company Productions",
         "Zephyr Films"
      ],
      "summaries": ["The story of Captain Richard Francis Burton's and Lt. John Hanning Speke's expedition to find the source of the Nile river in the name of Queen Victoria's British Empire. The film tells the story of their meeting, their friendship emerging amidst hardship, and then dissolving after their journey."],
      "budget": 0
   },
   "movielensId": 5358,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-02-16",
      "dvdReleaseDate": "2002-04-23",
      "directors": ["Bob Rafelson"],
      "runtime": 136,
      "movieId": 5358,
      "title": "Mountains of the Moon",
      "mpaa": "R",
      "actors": [
         "Patrick Bergin",
         "Richard E. Grant",
         "John Savident",
         "Bernard Hill",
         "Iain Glen",
         "Fiona Shaw",
         "Leslie Phillips"
      ],
      "imdbMovieId": "0100196",
      "originalTitle": "Mountains of the Moon",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["9ETq5HUeG1A"],
      "plotSummary": "The story of Captain Richard Francis Burton's and Lt. John Hanning Speke's expedition to find the source of the Nile river in the name of Queen Victoria's British Empire. The film tells the story of their meeting, their friendship emerging amidst hardship, and then dissolving after their journey.",
      "tmdbMovieId": 33796,
      "avgRating": 3.68182,
      "releaseYear": "1990",
      "numRatings": 187,
      "posterPath": "/7OI8DUbPh37EXmJReeRkgUwK34x.jpg"
   }
}