{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "adventure",
         "id": 4414
      }],
      "imdb_id": "tt0111701",
      "video": false,
      "title": "White Fang 2: Myth of the White Wolf",
      "recommendations": [
         36790,
         19667,
         80660,
         36087,
         78051,
         65158,
         161495,
         16110,
         40688,
         21299,
         28320,
         64868,
         35101,
         117553,
         65157,
         16790,
         24736,
         50875,
         42418,
         23916
      ],
      "backdrop_path": "/pKWjQPLyWLVGeF0UhKmWsvQK5Jw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Henry Casey",
               "gender": 2,
               "credit_id": "52fe4656c3a36847f80f99a5",
               "name": "Scott Bairstow",
               "profile_path": "/qgE0fIjyWaWySrGWUvt54OHJout.jpg",
               "id": 82519,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Lily Joseph",
               "gender": 1,
               "credit_id": "52fe4656c3a36847f80f99a9",
               "name": "Charmaine Craig",
               "profile_path": null,
               "id": 129724,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Moses Joseph",
               "gender": 2,
               "credit_id": "52fe4656c3a36847f80f99ad",
               "name": "Al Harrington",
               "profile_path": "/6LldNFBZHPr2v23Wp9NmrworQpc.jpg",
               "id": 129725,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Reverend Leland Drury",
               "gender": 2,
               "credit_id": "57b95e3f92514141e30045ed",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Katrin",
               "gender": 0,
               "credit_id": "57b95eb3c3a36860b400472a",
               "name": "Victoria Racimo",
               "profile_path": "/9ldxgpMUlCKw5QHRAJNM1PcysRX.jpg",
               "id": 136105,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4656c3a36847f80f999b",
               "name": "David Fallon",
               "profile_path": null,
               "id": 71761,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4656c3a36847f80f99a1",
               "name": "Ken Olin",
               "profile_path": "/7H4y3RIHaKQfxheKm20ChDBldDa.jpg",
               "id": 129723,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.168622,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43643,
      "vote_count": 21,
      "budget": 0,
      "overview": "A boy and his dog, White Fang, must try to save the noble Haida tribe from evil white men in turn-of-the-century Alaska.",
      "similar": [
         46195,
         62206,
         76285,
         172385,
         950,
         417859,
         44115,
         6795,
         258509,
         13600,
         10122,
         2000,
         2309,
         2669,
         9838,
         866,
         9352,
         11533,
         228970,
         26736
      ],
      "original_title": "White Fang 2: Myth of the White Wolf",
      "runtime": 106,
      "poster_path": "/bmuO33bIdTZikahvccaFbe1eB6r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1994-04-15",
      "vote_average": 5.2,
      "belongs_to_collection": {
         "backdrop_path": "/iKJOz9eUg3Exnqq77gxHQ1zNBmc.jpg",
         "name": "White Fang Collection",
         "id": 178654,
         "poster_path": "/6GyuRqvPp3IPlaAY5xCIFKQxfQw.jpg"
      },
      "tagline": "An Ancient Myth. A Land of Mystery. An Extraordinary Adventure.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Olin"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["David Fallon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111701/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyODExNjA3N15BMl5BanBnXkFtZTcwMjE0MDEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Scott Bairstow, Charmaine Craig, Al Harrington | See full cast and crew »"],
      "reviews": [
         "The picture is following-up to White Fang , in fact starts with Jack ( Ethan Hawke ) writing a letter to his friend Harry ( Scott Bairstow ) , the new starring . Then it begins the adventures of a boy and his adopted wolf-dog called White Fang for its white and sharp tooth . They survive a wild streams river because of the canoe has sunk when they are going to Dawson city . After that , they meet a Haida Indian tribe where he knows an orphan Indian ( Craig ) whose parents have dead by white men ills . Later on , Harry helps solve a caribou mystery but the tribe is starving and needs meat. He struggles a malicious reverend ( Alfred Molina ) and a villainous ( Geoffrey Lewis ). The film is loosely based on the novel by Jack London , though differs significantly from the book but this is an invented version , however remains the essential elements as the young-dog friendship , the gold rush , spectacular outdoors and locations and several moving scenes . In addition , there are a brief exploration about Native American way of life with their rites , customs , ceremonies , superstitions, mythologies and religion with their Totems and Gods . The film is set in Klondike -Yukon territory- on the end XIX century but was filmed in sensational scenarios and marvelous landscapes located in British Columbia and Colorado State . The movie is a feast for the eyes and ears that captures the adventure feeling as few others have ever done and similarly to original film . It's a correct sequel that maintains the charm and magic of the previous film but still makes for decent kiddies amusement. Evocative and stunning direction musical by John Debney ( Sin City ) . The motion picture is simply told and eloquently narrated by the director Ken Olin ( usually actor and occasional filmmaker ) . This agreeable film is entertaining , bemusing and wholesome . Rating : acceptable and passable.",
         "Ethan Hawke returns for a mute cameo before passing on the lead role to an unknown actor in this pointless film. Henry Casey is looking after Jack's claim and White Fang after Jack finally moves to San Francisco. He meets a native girl who convinces him to search for Caribou. And...that's it when it comes to plot. It's very, very slow and doesn't really build up to much. There are still some lovely views and scenery but the scope is lost, and even White Fang himself has a diminished presence and function. Overall White Fang 2 feels and looks a lot like a Disney Channel TV and not like a theatrical movie. Nothing to do with Jack London either, so I can't really recommend it to any particular fanbase the first might have had.",
         "This film is a mixed bag of positives and negatives. On the good side: The scenery is spectacular! The photography often awesome. It's a basically interesting plot. Disney is one of the few film studios that apparently knows that the only Indians in North America were not Plains Indians! On the down side: The Native American girl -- who is actually Native American -- is just a little too beautiful. They left out the part with her going to the Native American beauty salon! But the real problem here is the script. At the beginning of the film the young man with the wolf companion are menaced by a bad guy...and that has nothing to do with the rest of the film. Then the young man -- a gold miner -- goes downriver and in the rapids loses his gold. Okay, that's cool. He is rescued by an Indian princess. Cool. Who has been sent to find a wolf her father had seen in a dream that would lead the tribe to the lost caribou -- a major source of food for the tribe, without which they have fallen on hard times. Okay, so you think that's the story you are about to see -- the dog and young man will lead the Indians to the caribou. But then the evil priest is menacing the Indians, and soon we find he is an illicit gold miner who has kidnapped Indian men who had been sent to find the caribou, and they are being forced under oppressive conditions to mine gold. Wait a minute...I'm feeling like I'm in an Indiana Jones film now (and believe me...in the mine sequences it does get quite Indiana Jones-ish). So now the dog and young man have to not only find the caribou (which they do, of course), but also rescue the Indians in the mine...all while also falling in love with the Indian princess, who gets kidnapped. Will Lassie...I mean White Fang...come to the rescue??? Will a small dynamite charge blow away a ridge of rock to allow the caribou to escape? Will Roy and Dale safely jump from a runaway wagon? And of course, Old Yeller...I mean White Fang...HAS to get injured. Will he survive? Just too much unrelated story. And then, as the film comes to a conclusion, would you believe the young lovers run into each others arms...and White Fang and a white female wolf run into each others paws. I kid you now. And who do we have to blame for all of this? Director Ken Olin, who proved he can destroy a television series through his poor directorial skills (\"Brothers And Sisters\"). Having said all that, I'm not saying to not watch this film. It's fun, even if it's not very believable. And, there's some pretty good acting here...which saves the film. Scott Bairstow as quite good as the young man; Charmaine Craig quite good as the Indian princess. Al Harrington is good as the father of the princess, although why they couldn't use a real American Indian, I don't know. Anthony Ruivivar is very good as the young Indian brother, although, again, why they couldn't use a real American Indian for the role, I don't know. Alfred Molina is excellent as the bad guy. And Geoffrey Lewis -- one of the best character actors around -- is great, as always, although his role is not very substantial. So, sit back, suspend belief, and enjoy this romp...and curse Ken Olin while you're watching it...it could have been so much more.",
         "White Fang 2 is a wonderful movie filled with fun and adventure. Henry Casey was a miner who was living a bachelor life in the wild. His only companion is a wolf dog named White Fang. Later, on a trip to cash in his gold, Henry meets a Native American tribe who believes he is a wolf. In this movie, Henry finds the courage in him and learns about what is truly valuable in life. I rate this movie a seven out of ten. It is a great family movie about courage and adventure. White Fang Two will leave you sighing happily. It is a great movie that can be watched again and again.",
         "The epic movie,White Fang 2, is about a young man. This man was named Henry. Henry lived alone in the forest and mined with his best friend, a wolf named White Fang. One nice day they go fishing on the river and they get caught in the dangerous rapids. Henry is rescued by Lily, an beautiful Indian girl, who takes him to her village. Secretly Henry likes Lily, but she has been hurt by white men before. In Lily's Indian village, White Fang is very important and they hold ceremonies in honor of him. The tribe's elder named Moses thinks that Henry is the man form of White Fang and they begin to worship him. The tribe tells Henry he needs to go find the caribou to get food for the winter. I reccomend this movie for anyone who likes action, adventure movies. This movie also had a little bit of romance, but nothing to serious. I think this movie is great for kids and adults of all ages.",
         "***SPOILERS*** ***SPOILERS*** White fang 2 was a great movie. It was very touching when I saw how much Henry Casey loved White Fang and Lily. It was very adventurous. I will now review the whole story from beginning to end. It was a great love story and was nice to see. Henry Casey was a miner. He went to Alaska to mine some gold and left his home San Francisco. He brought his friend, White Fang with him. White Fang was a wolf that was very smart and protected Henry. They cared for each other very much. Henry and White Fang stayed in a small house at Alaska. There was a thief that tried to steal all of Henry' s gold. Fortunately, it was not stolen. Henry and White Fang were on the river with a small canoe. Suddenly, mighty waves hit the river. The two fell out of the canoe and were hope less in the water. It was a waterfall and they could not do anything. Henry Casey was just lying on the surface. Lilly, a Indian girl found him. Luckily, Henry had survived so Lilly carried him to her hometown. White Fang had survived but no one has yet seen him. Later, Henry woke up and he introduced himself to the Indian tribe. He became good friends with Moses and Peter. Moses was the father of Peter and he was the leader or their tribe. They were both very nice. Later on, White Fang was found and returned to Henry. Lilly and Henry fell in love. They were very passionate. White men had come to Alaska to take all of the gold mine and keep it a secret from the Indians. The Indians were starving. Henry was the hero and saved the Indians. He destroyed the white men. Later on. Lilly and Henry gets married. White Fang met a female wolf and they had babies. Unfortunately at the end, Peter dies. That was very heart breaking. This movie fabulous. It wasn't time wasting and quite nice. I hope I could see more movies like this. The author of this movie did a nice job on creating a good story like this. Disney is the best.",
         "This story is about a man that goes by the name of Henry and his wolf White Fang. They were on their way to San Francisco when they fell off their raft due to rough waters. The Indians saved him because they though that he transformed into a wolf. They didn't want to release him. They found that he wasn't a wolf a man then let him free. He then didn't want to leave because he fell in love with one of the women that lived there. This movie wasn't my type. It was a fake action movie. None of the actors were popular or that great. They need some improvements. Over all the purpose of the movie was good. It's a movie you may or may not enjoy.",
         "White Fang 2 was about a man named Henry who normally lived alone and mined for gold with his wolf, White Fang. One day they go rafting down the river and they get caught in the rapids. Henry is rescued by Lily, an Indian girl, who takes him to her village, however White Fang was never recovered.When they arrive at Lily's village, White Wolf is of great importance and they hold ceremonies in honor of him, the tribe mistakes Henry as White Wolf in white man form and begins to worship him. Moses tells him he needs to go up the mountain and find the caribou because the village was starving. In Moses' dreams he sees Lily being led to the caribou by White Fang. I think the movie was decent enough to be called a good movie. I don't think it was that great because I don't really like gold mine/adventure type of movies. Although, this movie did help me realize that gold digger movies aren't all bad.",
         "White Fang 2 is about a boy named Henry Casey. Henry prospects for gold in Alaska with his pet wolf named White Fang. He aspires to get to San Francisco after he mines enough gold. The area where he lives is inhabited by Native Americans. They are dying out because there are no caribou. Lilly, a Native American princess, has a dream about a wolf leading her to the caribou. She tells her elders about her vision and they send her off to find the wolf. Lilly sees White Fang sink in the river. She sees Henry surface, and believes that he is the wolf. Lilly brings Henry back to her tribe. White Fang turns up in the village alive. He and Henry stay with the Native Americans in the village. Henry becomes assimilated into their culture. He is given the name White Wolf. This movie was very interesting. It shows how people can change. White Fang 2 also sheds insight on the Native American culture, and what happens when their way of life and the natural code is tampered with by outsiders. This is a very good movie for young people.",
         "This story is about an adventure that a boy and his wolf, White Fang, takes to find the true meaning of life. Henry Casey finds himself stuck in an Indian tribe, and wants to leave as soon as possible. His plan later changes when he realizes what he would lose if he left the tribe. He encounters many problems and adventures, but in the end he battles all those problems and falls in love with the chief's niece, Lilly. So, in the end he learns to live a different way and be happier than when he was living his life before. White Fang 2 is an adventure story that can be for all ages. It is a great family movie for everyone to watch. It was a wonderful sequel and can be watched again and again. It teaches the spectators about life and is a great role model movie for anyone."
      ],
      "genres": [
         "Adventure",
         "Family"
      ],
      "productionCompanies": ["Walt Disney Pictures"],
      "summaries": ["In order to save one of the last Alaskin native tribes, Fang bands together with a friend of his master to stop miners from destroying a sacred land."],
      "budget": 0
   },
   "movielensId": 5362,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-04-15",
      "dvdReleaseDate": "2002-04-23",
      "directors": ["Ken Olin"],
      "runtime": 106,
      "movieId": 5362,
      "title": "White Fang 2: Myth of the White Wolf",
      "mpaa": "PG",
      "actors": [
         "Scott Bairstow",
         "Charmaine Craig",
         "Al Harrington",
         "Alfred Molina",
         "Victoria Racimo"
      ],
      "imdbMovieId": "0111701",
      "originalTitle": "White Fang 2: Myth of the White Wolf",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["miZqfo6Hn-k"],
      "plotSummary": "A boy and his dog, White Fang, must try to save the noble Haida tribe from evil white men in turn-of-the-century Alaska.",
      "tmdbMovieId": 43643,
      "avgRating": 2.50625,
      "releaseYear": "1994",
      "numRatings": 80,
      "posterPath": "/bmuO33bIdTZikahvccaFbe1eB6r.jpg"
   }
}