{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "wild bill hickok",
            "id": 180234
         },
         {
            "name": "calamity jane",
            "id": 190970
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt0045591",
      "video": false,
      "title": "Calamity Jane",
      "recommendations": [
         40894,
         42719,
         5065,
         51997,
         4952,
         85529,
         107625,
         72544,
         66488,
         250865,
         19414,
         42299,
         42455,
         87235,
         8446,
         37292,
         148820,
         51354,
         40826,
         38763
      ],
      "backdrop_path": "/sjkvBnPEkH2FqzUIhZ1XsOAQNIZ.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "58a8c703c3a36863d6002e4b",
         "content": "As fizzy as a Sarsparilla.\r\n\r\nCalamity Jane is directed by David Butler and written by James O'Hanlon. It stars Doris Day, Howard Keel, Allyn Ann McLerie, Phillip Carey & Dick Wesson. The score features music by Sammy Fain and lyrics by Paul Francis Webster. Out of Warner Brothers, the film is seen as a response to the success of MGM's production of Annie Get Your Gun in 1950, where Keel was also starring. Plot here is loosely based on the life of Wild West heroine Calamity Jane (Day) and explores the relationship between Wild Bill Hickok (Keel) and herself. \r\n\r\nI guess the first thing that should be said is that this is no biography of one Martha Jane Cannary Burke (AKA: Calamity Jane), In truth this is more a comedy musical romp built around the famous frontiers woman. And with it being very basic on narrative and direction, this really only appeals to the film fan with musical leanings. But on that score the film is delightful, with spirited lead performances from Day & Keel and a handful of truly great tunes headed by the Oscar winning \"Secret Love\". The film also earns some bonus points for giving Day the chance to play something other than the naive innocent girl next door type (it was a personal favourite role of hers). She gets to be spunky and brash without ever losing that adorable appeal that carried her throughout her career. The play on sexual stereotypes is rather humorous without being twee, something that you feel Butler was under appreciated for, and Wilfred M. Cline's colour photography enhances the playfulness of it all. \r\n\r\nSeen now as a feminist fantasy with a gay following thanks to \"Secret Love\", there's no denying the film is all very Hollywoodized; with characters so animated they could burst. But all told, if one is able to forgive and see past its flaws then it's a film guaranteed to light up the darkest of wintry days. 7/10",
         "url": "https://www.themoviedb.org/review/58a8c703c3a36863d6002e4b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Calamity Jane",
               "gender": 1,
               "credit_id": "52fe45cd9251416c75062e4d",
               "name": "Doris Day",
               "profile_path": "/wX7nvD6VYrp98SxkwszHrOLONou.jpg",
               "id": 8237,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Wild Bill Hickok",
               "gender": 2,
               "credit_id": "52fe45cd9251416c75062e51",
               "name": "Howard Keel",
               "profile_path": "/vzLs3LCtv3QkWVg0pYuXLIZp6zs.jpg",
               "id": 39601,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Katie Brown",
               "gender": 1,
               "credit_id": "52fe45cd9251416c75062e55",
               "name": "Allyn Ann McLerie",
               "profile_path": "/tVkJUSsKrPlAullwRfpit2RHfW4.jpg",
               "id": 76382,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lieutenant Danny Gilmartin",
               "gender": 2,
               "credit_id": "52fe45cd9251416c75062e59",
               "name": "Philip Carey",
               "profile_path": "/yl8Tr3k6OL1NE2DIjdJ73FcO1pP.jpg",
               "id": 45291,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Francis Fryer",
               "gender": 0,
               "credit_id": "52fe45cd9251416c75062e5d",
               "name": "Dick Wesson",
               "profile_path": "/7RSSnpDHoUS4DrFyn8EDa7CU10.jpg",
               "id": 93696,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Henry Miller",
               "gender": 0,
               "credit_id": "52fe45cd9251416c75062e61",
               "name": "Paul Harvey",
               "profile_path": "/xDk9GgK3ykYIiXeM5ybhoJUwlzg.jpg",
               "id": 34320,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Rattlesnake",
               "gender": 2,
               "credit_id": "52fe45cd9251416c75062e6b",
               "name": "Chubby Johnson",
               "profile_path": "/j4AUpZy1gWxjGbk2ysWlwiXwKWh.jpg",
               "id": 55701,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Adelaid Adams",
               "gender": 1,
               "credit_id": "52fe45cd9251416c75062e6f",
               "name": "Gale Robbins",
               "profile_path": "/dB1F4Tyzc6gz6jn2EYy2M8bMSGu.jpg",
               "id": 104411,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Chicagoan (uncredited)",
               "gender": 2,
               "credit_id": "5a307c52925141032618b187",
               "name": "Colin Kenny",
               "profile_path": null,
               "id": 120445,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Prospector",
               "gender": 2,
               "credit_id": "5a8374ef0e0a2640080050f1",
               "name": "Billy Bletcher",
               "profile_path": "/wVMoPHj7zTswZJx96VqY1yWgN8j.jpg",
               "id": 31771,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Officer's Wife in Reception Line",
               "gender": 1,
               "credit_id": "5a837533925141759f004c00",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Officer at Fort Dance",
               "gender": 2,
               "credit_id": "5a83755c0e0a26400e0056c7",
               "name": "Frank McLure",
               "profile_path": "/u6E8Ms5zQXg9LEr7lktIvhtMxjS.jpg",
               "id": 569144,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Man at Fort Dance",
               "gender": 0,
               "credit_id": "5a83758bc3a3682ddf004edb",
               "name": "Bert Stevens",
               "profile_path": null,
               "id": 1208035,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45cd9251416c75062e49",
               "name": "David Butler",
               "profile_path": "/2MivycBAyVLbLJfZAOtqyFjUCAR.jpg",
               "id": 76381,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45cd9251416c75062e67",
               "name": "James O'Hanlon",
               "profile_path": null,
               "id": 93689,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "572e319c92514165ec0036fb",
               "name": "William Jacobs",
               "profile_path": null,
               "id": 95944,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "572e31a4925141522f0001a8",
               "name": "David Buttolph",
               "profile_path": null,
               "id": 17667,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "572e31ac92514151960001c2",
               "name": "Howard Jackson",
               "profile_path": null,
               "id": 29276,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "572e31b3c3a36818d10001db",
               "name": "Wilfred M. Cline",
               "profile_path": null,
               "id": 544755,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "572e31bbc3a3684bd300080c",
               "name": "Irene Morra",
               "profile_path": "/inRLo56CE2fulcI1E0sTEPrVKGs.jpg",
               "id": 102784,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "572e31c2c3a3680f3f003089",
               "name": "John Beckman",
               "profile_path": null,
               "id": 1417674,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "572e31c8c3a36869e6001d05",
               "name": "G.W. Berntsen",
               "profile_path": null,
               "id": 1494831,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 3.9516,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14117,
      "vote_count": 54,
      "budget": 0,
      "overview": "Doris Day and Howard Keel fuss, feud and fall in love as Calamity Jane and Wild Bill Hickok. At first curvaceous Calamity is too durned busy fighting Indians and cracking a bullwhip to pay mind to such girlie what-alls as dresses and perfume. She soon changes her mind when Katie Brown arrives in town.",
      "similar": [
         872,
         82695,
         342473,
         15121,
         616,
         10020,
         33,
         3933,
         134,
         252,
         581,
         68718,
         58574,
         49529,
         72331,
         254470,
         205775,
         316029,
         281957,
         353616
      ],
      "original_title": "Calamity Jane",
      "runtime": 101,
      "poster_path": "/9csFMmDvmeTqEkXC2xC11JvdqDA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1953-11-04",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Warner Bros. sky highest, smile widest, wild and woolliest Western of 'em all!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Butler"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["James O'Hanlon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0045591/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIwMjI1OTY1NF5BMl5BanBnXkFtZTcwNjc0NTA0OQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Doris Day, Howard Keel, Allyn Ann McLerie | See full cast and crew »"],
      "reviews": [
         "Calamity Jane (Doris Day) is the tom-cowboy to end all tom-cowboys, known for her feisty attitude and tallish tales of fighting Indians. When saloon/theater owner Henry Miller (Paul Harvey) is faced with angry Deadwood residents because he tries to pass off a man in drag as the attractive New York actress he promised (he made the mistake based on the actor's name), \"Calam\" promises to go to \"Chicagee\" and bring back an actress all of the men are going gaga for because of her picture on cigarette cards. Director David Butler's Calamity Jane delivers on many ends--it's a musical featuring catchy songs, many sung by one of the greatest songstresses of her era, Doris Day, and a few incredibly choreographed; it's a frequently hilarious comedy; it's suspenseful in quite a few scenes (usually through realistic dramatic tension); it's a beautifully shot western with fantastic sets; and in the end, it's a grand romance. Day carries the film with her unusual, enjoyable, amusingly butch character. She plays Calamity Jane with boundless energy and physical aplomb--you wouldn't catch many modern film performers doing some of the stunts that Day does here. Butler usually keeps the camera close enough to Day that you can see it's her--she hasn't been supplanted with a stuntperson, and during one bit of choreography, Butler has Day jumping and flipping over bars and being taken up to a second story balcony and set back down with lots of uninterrupted takes. Most modern directors would break up the choreography into a series of relatively easy steps, creating physics defying agility through clever cutting. Day has to perform the steps as if she were doing the number on a Broadway stage. Calamity and most of the rest of Deadwood, South Dakota are funny because of their backwoods naivety. That can be a difficult thing to sell to viewers, but when Francis Fryer (Dick Wesson) almost gets away with his necessary cross-dressing shtick, it's believable. Calamity's trip to Chicago has some particularly hilarious moments. The humor also works as well as it does because the two men who are the later romantic interests, Wild Bill Hickok (Howard Keel) and Lieutenant Danny Gilmartin (Philip Carey), are the primary ones who seem to have a more objective perspective on the town's gullibility and Calamity's tall tales (although there are hints that their skepticism is not so uncommon). Many viewers are most attracted to the film because of its evolution into a romance in the last act. Day's transformation in this section is handled expertly--if you watch her closely, she never quite loses her Calamity tomboyishness, but she also makes more than just a physical transformation. But it's not just Day who is excellent--all of the performances in the film are good. For me, Calamity Jane is one of the most successful combinations of comedy and a still serious western. It's everything that Cat Ballou (1965) should have been, but mostly fell flat with. Don't miss it if you're a fan of either musicals or good-natured westerns.",
         "From her first appearance aboard the stagecoach, singing \"Deadwood Stage,\" Doris Day dominates the movie in exuberant\u0097possibly too exuberant\u0097fashion, with strong assistance from Howard Keel and his virile voice\u0085 Returning home from a visit to Chicago, Day gives her account of the \"Windy City\" in a song that suggests Oklahoma!'s \"Kansas City\" in more ways than the title\u0085 Her quarrelsome duet with Wild Bill\u0097\"I Can Do Without You\"\u0097echoes Annie Oakley's competitive duet with Frank Butler in \"Annie Get Your Gun.\" But one song is all Doris Day's\u0097and the film's\u0097very own: walking through the countryside on a beautiful morning, Calamity realizes that she loves Bill, and in a voice exuding warmth and tender feeling, she sings the Academy Award-winning song \"Secret Love.\"",
         "`Calamity Jane' is a film I love to take from the shelves when I'm feeling blue. It's so exuberant, so joyous, and so colourful that it cannot help but cheer you up! Doris Day plays the role of her career as the rambunctious `Calam', the wildcat tomboy of Deadwood City. The fun starts when Calamity is sent to the `windy city' of Chicago to find a vaudeville beauty who will perform at the local bar. Instead of the genuine article, Calamity ends up with the star's ambitious maid, Katie, who decides to make her stab at fame in the star's place. Together, the two find fun, love, and a whole lot of catchy tunes. Sure, the fascinating real-life historical figure Calamity Jane didn't look much like Doris Day - let alone Howard Keel, who is the last person you'd describe as `wild' - and Jane's transformation from independent homesteader to blushing housewife isn't what you'd call P.C., but if you're looking for reality, head to the Martin Scorsese section. This is light-as-a-feather entertainment done very well, and I can't help but love it!",
         "... who else could put across the Deadwoodstageis number like Doris Day in the opening sequences of this wonderful movie? Right through to her mushy ballad 'Secret Love' she is perfect for the role of the butch cowgirl who gets a feminine makeover and snares her shooting buddy (the excellent Howard Keel, in fine voice here). Doris was a true star, a great actress and singer, game for a laugh and a pretty blonde who transcended her rather trite public image through her talent. Calamity Jane is possibly her best work, and certainly one of the best musical movies of the 1950s (against some pretty stiff competition). They might be making musicals again, but they won't make them quite like this.",
         "I defy anyone not to like this musical and Doris Day's infectious portrayal of Calamity Jane. Even those who did not later like her later characterizations as the All American virgin have to give her musical talent it's due. When she opens up the movie with The Deadwood Stage number the viewer is immediately caught up in the whole lighthearted spirit of the movie. It was interesting that Warner Brothers got Howard Keel from MGM to play opposite Doris. After all they did have Gordon MacRae at Warners and he and Doris had done a few successful films together. Possibly the reason is to see what the public missed when Doris did not play opposite Keel in Annie Get Your Gun. She wanted the part of Annie Oakley very badly, but a deal with MGM couldn't be made. I think this might have been Jack Warner's mea culpa to her. The duet that Howard and Doris sing I Can Do Without You is certainly inspired by Irving Berlin's Anything You Can Do. Imagine Keel singing it with Doris instead of Betty Hutton. In fact Doris's whole character is ripped off from Annie Get Your Gun. But I really don't care because she does such a fabulous job. Sammy Fain's and Paul Francis Webster's score for Calamity Jane isn't as top heavy with hits as Annie Get Your Gun, but it did provide Doris with one of her best songs and biggest movie hits up to that time. Secret Love won the Oscar for Best Song of 1953 and her singing of it is primo. In the early sixties Doris Day did an album of the songs from Annie Get Your Gun with Robert Goulet playing Frank Butler and a whole ensemble for the other parts. Now that was a great album and it should have been a great flick. They really unfortunately don't make them like this any more or even a fraction as good.",
         "For a film that is fifty years old 'Calamity Jane' still entertains. It is usually compared unfavorably to 'Annie Get Your Gun' but I always enjoy this more. Doris Day dominates the film; dressed in buckskin or in frills, toting a gun or wielding a broom, belting out a song or doing a pratfall. Certainly a high point of her varied career. Her sheer energy is breath taking and it is no wonder that the rest of the cast seem subdued in comparison. Even Howard Keel is a bit wooden. The songs are great, scattered through the uncomplicated plot like jewels, from the bouncy 'Deadwood Stage' to the combative 'I Can Do Without You' to the under rated 'High As A Hawk' and climaxing with the anthemic 'Secret Love'. 'A Woman's Touch' is not proof to our modern cynicism (for good reason) but it is still jolly song. Looking back we can give other readings of the film; the cross dressing, the gay resonances, the treatment of the native Americans, the ownership of land. Which may all be true but it is basically what it is, a colourful and tuneful film that can be enjoyed time after time. It is mighty pretty and on its own terms pretty mighty.",
         "In the early fifties, Hollywood had to find a way to draw audiences who were staying home and watching television, and \"Calamity Jane\" was one of the best musical efforts to get them into the theaters. This movie's redeeming quality is its high spirits. They never let up. The Deadwood community that James O'Hanlon rustles up is a motley bunch of soldiers, scouts, prospectors and farmers, and they all have a good time giving one another a hard time--none more so than the title character played by Doris Day. Her performance probably owes something to Betty Hutton's Annie Oakley, and it looks an awful lot like what Billie Hayes and Irene Ryan had been doing years afterwards, but Day dons a buckskin suit and tears right into the role like it was a tailor's fit. I don't think I have to go into the rumor about the real Calamity Jane to point out how daring Day's work is. Hollywood might have sanitized history (or maybe not), but Day is as close to being Martha Jane Canary as anyone is likely to be in a time when drag acts were something no one ever talked about. And she is lucky to have some of the best movie music of that year (or maybe any year when you consider what now passes for good). Sammy Fain and John Francis Webster took the Oscar for best song, yet the ones that weren't in the running are every bit as good. How can you pass up a musical that delivers the deeply satisfying baritone of Howard Keel? When he bursts out with joy in \"Higher than a Hawk,\" the light from the screen surges, and you feel like you're resting on a sunlit cloud right next to his. His smile matches Day's for brightness, and as they ride through the Black Hills singing harmony, even the birds seemed to have stopped to listen. It's a beautiful pairing that I don't think ever happened again. \"Calamity Jane\" may not be everyone's cup of tea. If you're looking for history, this is not the place to go. But stop by, and Day and Keel and Dick Wesson and Allyn Ann McLerie and Paul Harvey and company will more than tickle your fancy. They'll keep you humming for days. Directed by David Butler who has given us over the years a string of felicitous moments to remember from Will Rogers in \"A Connecticut Yankee,\" to Jane Withers in \"Bright Eyes,\" to the Ritz Brothers in \"Kentucky Moonshine,\" to Bob Hope in \"Road to Morocco,\" to S.Z. Sakall in \"Lullaby of Broadway\" and on and on and on.",
         "Calamity Jane with Doris Day was my first experience with musicals. i was so entranced I talked my mother into letting me stay to watch it again. I was left with an unknown women who had come to watch the next showing. (Something unheard of in this day!) The sheer joy of the singing, dancing and innocence of a time past is something that is sorely missed today. Doris Day's Calamity Jane is a story of love between men and women and women and women during a time when this love was innocent and people did not worry that someone might look at it in a sexual way. Women could hold hands and hug to support each other in happiness as well as grief. Songs like 'Secret Love' and 'Take Me Back to the Black Hills' are beautiful even to the audiences today. this type of music will never die.",
         "This movie is a diamond. Simply shines. Doris Day is wonderful. 1953 women were treated as morons. She was ahead of her time. Thank goodness. Each song actually moves the story along. Each song has a good tune. So it is very easy to watch and enjoy. IT is uplifting. It is entertaining. What more can you ask for?? It has become a tradition on my birthday, to watch this movie. My Dad was the one who pointed out what a gem it was. Because it is a costume piece it is timeless. I have to admit I am a died in the wool Doris Day fan. Always will be. I can not even imagine who could play this part half as well now? Open to suggestions. Trust me this movie is a hoot.",
         "I saw Calamity Jane as a kid in 1963 and it immediately became one of my all time favorite movies. It has stood the test of time, and still remains among my favorites. At the time that I first saw Calamity Jane I could identify with the character because, like 'Calam', I was somewhat of a tomboy myself although I was totally in love with some of the good looking on screen cowboys of that era. Doris and Howard Keel did an excellent job in this movie and their voices were second to none! Secret Love still makes my heart sing and Deadwood Stage will always be a toe tapper for me. Even at the ripe old age of 55, Calamity Jane is still one of my favorite movies. It is a must see for people who love the romantic westerns of the 1950's. Of course it is among my collection of VHS favorites. My husband and children are also fans."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Western"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Deadwood, Dakota Territory, is largely the abode of men, where Indian scout Calamity Jane is as hard-riding, boastful, and handy with a gun as any; quite an overpowering personality. But the army lieutenant she favors doesn't really appreciate her finer qualities. One of Jane's boasts brings her to Chicago to recruit an actress for the Golden Garter stage. Arrived, the lady in question appears (at first) to be a more feminine rival for the favors of Jane's male friends...including her friendly enemy Wild Bill Hickock.",
         "It's the late nineteenth century in Deadwood, located in the Dakota Territory. Jane Canary - better known as Calamity Jane or Calam for short - is a sharp shooter who takes it upon herself to protect the area, especially the stagecoach, from the marauding Sioux. Her skill and fearlessness is matched only by Wild Bill Hickok, with whom she has a friendly rivalry, but who she still considers her best friend. Calam shows no signs of femininity, despite being in love with a soldier, Lieutenant Danny Gilmartin. Despite having been saved before by Calam, Danny only sees her as one of the guys and has no idea that she loves him. There is a dearth of females in the area, and as such, Harvey Miller or Milly for short, the proprietor of the local saloon called the Golden Garter, brings in actresses to perform whenever he can to entertain the men who are starved for female companionship. So when Milly's latest attempt to bring in an actress doesn't turn out quite the way he expects, Calam takes it upon herself to bring in the most famous Chicago actress, Adelaid Adams, to keep the peace in Deadwood. Calam's attempt to bring in Adelaid starts a series of events which make Calam examine her feminine side, and what it may take to get Danny to propose. But in doing so, Calam may ultimately realize what she really wants in life.",
         "The story of Calamity Jane, her saloon, and her romance with Wild Bill Hickok."
      ],
      "budget": 0
   },
   "movielensId": 5372,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-11-04",
      "dvdReleaseDate": "2002-04-30",
      "directors": ["David Butler"],
      "runtime": 101,
      "movieId": 5372,
      "title": "Calamity Jane",
      "mpaa": "NR",
      "actors": [
         "Doris Day",
         "Howard Keel",
         "Allyn Ann McLerie",
         "Philip Carey",
         "Dick Wesson",
         "Paul Harvey",
         "Chubby Johnson",
         "Gale Robbins",
         "Colin Kenny",
         "Billy Bletcher",
         "Bess Flowers",
         "Frank McLure",
         "Bert Stevens"
      ],
      "imdbMovieId": "0045591",
      "originalTitle": "Calamity Jane",
      "genres": [
         "Action",
         "Western",
         "Music"
      ],
      "youtubeTrailerIds": [
         "ryfd16-0YPw",
         "wKxH7aFoJn4"
      ],
      "plotSummary": "Doris Day and Howard Keel fuss, feud and fall in love as Calamity Jane and Wild Bill Hickok. At first curvaceous Calamity is too durned busy fighting Indians and cracking a bullwhip to pay mind to such girlie what-alls as dresses and perfume. She soon changes her mind when Katie Brown arrives in town.",
      "tmdbMovieId": 14117,
      "avgRating": 3.34286,
      "releaseYear": "1953",
      "numRatings": 280,
      "posterPath": "/21c7QTqetZ7Z4BZYPw0CgNnPHC4.jpg"
   }
}