{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "school",
            "id": 10873
         },
         {
            "name": "high school student",
            "id": 33910
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         },
         {
            "name": "preparatory school",
            "id": 185158
         },
         {
            "name": "boys' school",
            "id": 185413
         },
         {
            "name": "sister boy",
            "id": 194845
         }
      ],
      "imdb_id": "tt0049829",
      "video": false,
      "title": "Tea and Sympathy",
      "recommendations": [
         104301,
         37222,
         34187,
         38724,
         45247,
         27448,
         42603
      ],
      "backdrop_path": "/6WU5AFa8T7kSmdzQKXK0WBp5THr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Laura Reynolds",
               "gender": 1,
               "credit_id": "52fe469bc3a368484e09a083",
               "name": "Deborah Kerr",
               "profile_path": "/snyKI73NycIaXjU4GyxDq92ZRo5.jpg",
               "id": 20141,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Bill Reynolds",
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a087",
               "name": "Leif Erickson",
               "profile_path": "/e6jUlzMj1S0lf3M6fbDCGcq10M3.jpg",
               "id": 9865,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Herb Lee",
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a08b",
               "name": "Edward Andrews",
               "profile_path": "/naSCJGkfi7hbyohoUO122O37ROP.jpg",
               "id": 29719,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Al",
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a08f",
               "name": "Darryl Hickman",
               "profile_path": "/bRMxUW00nvYWJZf2X0k09i2tjyz.jpg",
               "id": 81481,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Ellie Martin",
               "gender": 1,
               "credit_id": "52fe469bc3a368484e09a093",
               "name": "Norma Crane",
               "profile_path": "/hDRMPoBjCGaiOswleDgizJfEDxR.jpg",
               "id": 129550,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ollie",
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a097",
               "name": "Dean Jones",
               "profile_path": "/n9eCdZR2pUylbx53VEoTZ6INuIr.jpg",
               "id": 40393,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Lilly Sears",
               "gender": 1,
               "credit_id": "52fe469bc3a368484e09a09b",
               "name": "Jacqueline deWit",
               "profile_path": "/clY6t5sOmsvXRU7dCJ4EpbY9QJw.jpg",
               "id": 105571,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Tom Robinson Lee",
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a09f",
               "name": "John Kerr",
               "profile_path": "/gjxQn0kHzR6fv0OGx8SwUvEws6H.jpg",
               "id": 62881,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a07f",
               "name": "Vincente Minnelli",
               "profile_path": "/qUV0pO7Q1Vs9Jcvq0LWcqOERQ2H.jpg",
               "id": 13980,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a0a5",
               "name": "Robert Anderson",
               "profile_path": null,
               "id": 46610,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5533bc91c3a36852de00185c",
               "name": "John Alton",
               "profile_path": "/2T1IJWguIJicQD2dw0SqzoVAYxa.jpg",
               "id": 96252,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.915634,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 63096,
      "vote_count": 11,
      "budget": 0,
      "overview": "Tom Lee is a sensitive boy of 17 whose lack of interest in the \"manly\" pursuits of sports, mountain climbing and girls labels him \"sister-boy\" at the college he is attending. Head master Bill Reynolds' wife Laura sees Tom's suffering at the hands of his school mates (and her husband), and tries to help him find himself.",
      "similar": [
         52449,
         207,
         9475,
         308369,
         9276,
         8363,
         37735,
         272693,
         233063,
         437670,
         400928,
         8841,
         1807,
         103663,
         22302,
         11887,
         9424,
         25934,
         7340,
         47559
      ],
      "original_title": "Tea and Sympathy",
      "runtime": 122,
      "poster_path": "/tpjYRGtx0u3BHhrWk5dmPbTjgli.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1956-06-06",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Where does a woman's sympathy leave off -- and her indiscretion begin?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Vincente Minnelli"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Robert Anderson",
         "Robert Anderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049829/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODA4NjYwMDg3OF5BMl5BanBnXkFtZTgwMjI0OTc5MTE@._V1_SY317_CR104,0,214,317_AL_.jpg",
      "actors": ["Stars: Deborah Kerr, John Kerr, Leif Erickson | See full cast and crew »"],
      "reviews": [
         "The movie begins and ends with an old French folk song \"plaisir d'amour\" (English translation :\"joys of love\")which was reworked as \"can't help falling in love\" for Elvis Presley.Since the movie is actually a long flashback,the infinite nostalgia this old chestnut generates fits the movie like a glove. \"Tea and sympathy\" might be the best of all Minnelli non-musicals in the fifties/sixties.We even forget that John Kerr (25 at the time) was much too old for this part of an adolescent in search of his sexual identity.John Kerr was the victim of \"the cobweb\" a couple of years before.His character in \"tea and sympathy'\" is a relative of the one I mention above as well as of the young hero of \"home from the hill\" (1960) \"Tea and sympathy \" was a courageous move for the fifties:it took a lot a nerve to show a boy at the university who refused \"normality\".What's normality anyway?Is it ,for a man ,swearing or climbing mountains? as luminous Deborah Kerr says.When you're not fond of sports,when you like the ladies' tea and sympathy,when you enjoy music and poetry ,then you are a \"sister boy\" and maybe even worse...You've got to pay attention to see what heavy things Minnelli was saying at a time it was not that much good to be DIFFERENT.Robert Anderson's play was years ahead and had (or should have had) a deep beneficial influence on mentalities.The scene where one of the \"true\" boys teaches his unfortunate pal the right way to walk had certainly a strong influence on French director Claude Miller 's \"la meilleure façon de marcher\"(1975). But the play (and Minnelli's excellent movie) are often a ruthless portrayal of the \"straights\" :the young hero's father is a really dumb man -where is his wife by the way? Is she dead? or the perfect housewife?-,a narrow-minded crude character devoid of all the qualities of the heart.The fact that he asks the virile teacher to \"make a man of his son\" proves his stupidity.This teacher (D.Kerr's husband) ,under a he-man mask actually hides a vulnerability which his sensitive wife feels.He,too , is longing for tenderness,love and affection,but as it's not worthy of a true man,his life will be an unfulfilled one. Deborah Kerr RULES.She wins over the audience with a mesmerizing performance .It's not only the \"sister boy\" who falls in love with her.Anyone who sees this wonderful film will too.",
         "Those who had the good fortune to see Deborah Kerr onstage in the Elia Kazan production of \"Tea and Sympathy,\" will attest to her unforgetable performance. Kerr not only played it on Broadway but also toured with it, a treat for all attendees. Now nearly a half century later, her performance on film, which was very much influenced by her stage style, begins to show a little wear around the edges. It must be difficult to change one's approach after having played a role so successfully night after night. In this case, her inflections, accents, phraseology, pauses, gestures and the like are essentially theatre-based, designed to play to the whole house up to the balcony. In the intimacy of film, this becomes a bit much in the long run, and results in a much more broad, deliberate and stylized Kerr than in any of her other film work. Her character tends to emerge now more as a busy-body, snooper, peeping tom than was ever intended, and certainly it did not come across that way when the film was first released. A landmark film of sorts--for a major studio to tackle a sensitive subject in a major production--\"Tea and Sympathy\" benefits from a sincerely written script by Robert Anderson, solid direction by Vincent Minnelli and a secure supporting cast. Visually Deborah Kerr is beautiful, and is totally committed to both the play and her role. During her lengthy film career, Kerr certainly contributed a wealth of finely crafted performances.",
         "\"Tea and Sympathy\" will offend many forward thinking people, but it is historically important. It provides good perspective for comparing the early twenty-first century to 1956--the time when this movie was made. The film is representative of people's sentiments during the 1950s. I came of age during this time as an effeminate lad who could not even talk with his parents about the stereotyping I experienced in grade or high school. Kids were cruel; so were many adults! Everyone needs a good dose of history, and this film provides it. Students of Gay and Lesbian Studies or film studies need to see this movie. No this is not a happy film, but neither is \"Brokeback Mountain,\" which was set in the 1960s. \"Tea and Sympathy\" will not thrill anyone who prefers to forget unpleasant eras of history.",
         "I recently watched this classic again. It's probably been 20 years since the first time that I saw it and was curious what IMDb viewers had written about it. I was a bit surprised to see the comments on this film as being objectionable. I don't think that the other reviewer was considering the time. That Tom Lee turned out to be straight despite his less manly habits was the only way that the movie could have been made in those repressed days. When I first saw this film, I was in the throes of my own coming-out. I loved it and didn't find it objectionable in the least. Here was a movie where someone (other than me) was a loner and different than the popular boys and was the hero of the story. What I had forgotten (or not picked up on at the time) were some of the supporting performances. The supportive room-mate was brave and although he did eventually give way to the pressure, how many folks today would have been as brave? I also saw the housemaster in a different light. He had always seemed to be a big bully to me, but today I really heard his wife's complaints that they had been married less than a year and that they hardly ever touched anymore. Add that to the way that he seems to spend a lot of time `playing' with bare-chested young men and that he never remarried after his wife left him and one has to wonder if he weren't in a closet of his own. I think that this movie has stood the test of time better than most and is in no way objectionable although it does describe an objectionable time. Finally Deborah Kerr's final line is one of the great gay line's of all time. Many a gay man has slept with someone and in his mind thought \"Years from now when you talk about this - and you will - be kind\"",
         "Robert Anderson was not setting out to write a manifesto for the gay rights movement, or for anyone's agenda when he wrote the original play. He has said it's not about homosexuality -- it's about love, and those who are different being persecuted by those obsessed with conformity. The play and the film are more interesting as a deconstruction of traditional gender roles, if we need to look at the political aspect of it. But this is mainly a work about two lonely, literate, gentle people who find each other at a wearisomely macho, conformist boy's prep school. Robert Anderson himself adapted his play into the screenplay, and did a good job of opening it up. Minelli does a beautiful directing job, and the original Broadway cast, reprising their roles, all do fine work. The problem is that the censors at the Hayes Office made them butcher Tea and Sympathy, as badly as with Cat on a Hot Tin Roof. In the original 1954 play, a teacher takes Tom swimming, then the teacher is fired for being gay, and the other students assume Tom is gay and begin throwing around terms like \"queer\" and \"fairy.\" The Hollywood 1956 film is reduced to implying he's \"less than manly\" because the other boys see him sewing with the faculty wives. They start calling him \"sisterboy.\" The original play makes clear that the husband of the Deborah Kerr character (played by Leif Erickson in a fine, bravely repellent performance) abets the boys in persecuting Tom because he himself is really gay and in the closet. The film of course cuts her line near the end of the play, which causes the couple to break up: \"Did it ever occur to you that you persecute in Tom, that boy up there, you persecute in him the thing you fear in yourself?\" The film would be more powerful and less dated and make more sense if Anderson and Minelli had been allowed to leave these things in. But the worst act of Hayes Office butchery does not relate to the issue of homosexuality; it has to do with the fact that the censors felt adultery must never ever seem to be endorsed on-screen. The film is given the framing device of Tom returning to the school at reunion time, and the epilogue, when it gets back to the framing device ... that's rubbish, there for the censors. It has nothing to do with the real story. Wise viewers will switch off after Deborah Kerr's line: \"Years from now, when you talk about this, and you will, be kind.\" That's where the play ends. This was Deborah Kerr's favorite role in all her years of acting, and Laura Reynolds is the character she has said she most identified with. It shows; she does a lovely, heartfelt job. I'd say she and John Kerr (no relation) have fine chemistry. I find the Ellie Martin character a bit over-done; otherwise, the performances are strong. It's interesting that the head bully in the house, Ralph, is played by Tom Laughlin, who went on to make the Billy Jack films. Perhaps he and John Kerr became buddies in the years they worked on Tea and Sympathy in various incarnations; he also plays the pilot who flies Kerr to the island at the beginning of South Pacific. There's a moment in The Trial of Billy Jack (another period piece, from a very different era!) where an Indian wise man is advising Billy Jack about how we are most hostile to the things we fear in ourselves, \"as the athletic man mocks the long-haired youth because he doubts his own masculinity.\" Something like that -- it reflects sixties and seventies arguments about long-haired hippies, but it's also right out of Tea and Sympathy, where the majority look askance at anyone without a crewcut. The macho, self-hating Bill Reynolds character is like the repressed, married dock worker in Last Exit to Brooklyn -- it's startling to find such a character in a film that was actually made right then, back in that era.",
         "It is true that this film, made in 1956, two years after it appeared on the stage, is dated. And it is true, in real 1950s style, the characters may seem very contrived, and the dialogue very scripted. But Tea and Sympathy tells a very real and poignant story and if you allow yourself simply to be swept up by that, rather than looking at the film in a sceptical and critical manner, you may actually enjoy it. John Kerr does a wonderful job of playing a teenage boy, Tom Lee, who cannot seem to fit in with those around him, and Leif Erickson does just as good a job portraying the schoolmaster Bill Reynolds, who sees being 'manly' as one of the most important things there is. And lovely, refined Deborah Kerr (no relation to John Kerr), in the role she played on stage, does an impressive job of portraying Laura Reynolds, the love-starved faculty wife who still thinks about the husband she lost in the war. And she is the one who is disturbed by the treatment Tom gets from his schoolmates, and even from her husband himself, and she is the one who takes action to try and help him. The fact that there are large references to 'out of bounds' sexual activity in the film make it rather unique and daring for the decade in which it was released. Director Vincente Minnelli does a superb job of capturing the sexual tension within the Reynolds house and makes the film that much less twee. A great film, and a must see for Deborah Kerr fans.",
         "Robert Anderson's \"Tea and Sympathy\" was a hit on the New York stage. Its subject matter was a shock to many people at the time, but alas, on second viewing, this film seems a bit dated. Of course, one has to put oneself back in the fifties, when the play opened on Broadway, it almost seems a daring attempt to speak about homosexuality back then. If you haven't seen the film, please stop reading now. Vincente Minelli made the best of the adaptation by playwright Anderson for the screen. In fact, most of the perception about Tom's homosexuality seems to be center stage, but no one really focuses on the one that really is and is trying to hide the fact: Bill Reynolds! We realize at the end of the film that Tom was a mixed up young man, rather than a gay man coming to terms with his feelings. In fact, if one watches closely, Tom seems to be terribly attracted by Laura, but he is too shy to do, or say anything that will make him be seen differently by her. Also, Laura confronts Bill toward the end of the film and confesses the way she feels about Tom, and what she almost did the night before in order for the young man to have a real sexual experience, which occurs later on. While \"Tea and Sympathy\" concentrates on the lonely Tom, it presents us a masculine Bill, who confesses he had gone through the same things Tom is experiencing now, at one time in his life, but who in reality is hiding his own homosexuality from everyone. Bill is the most dangerous individual because he will probably prey on the young men under his care and force them into satisfying his own gay urges, as has been seen in the case of Catholic priests abusing children. It is also revealing that in the last scene when Tom finds him at home, he is listening to the classical music Tom loved and Laura is has divorced him. Deborah Kerr, having played Laura on stage, brings her own interpretation of the role, which in a way works. Also the same could be said of John Kerr, who originated the role of Tom. The only thing is that one doesn't see strong chemistry between the co-starring Kerrs, in our humble opinion. Leif Erickson gives a subtle reading on Bill Reynolds. While he is not the center of the story, he looms large in the background because we realize that instead of asking the guys under him to behave he seems to be enjoying that someone else is being ridiculed as a sissy. Edward Andrews, Daryl Hickman and Norma Crane are seen in supporting roles. Being dated aside, the film shows how America dealt with this subject in that era.",
         "Deborah Kerr has always been one of the best actresses. Her beauty and wit have always gotten her pretty well rounded roles. \"Tea and Sympathy\" has done something else for her...It has made her a real human that we can all identify with and understand. She captured your attention with her every second on the screen. John Kerr, as Tom Lee, (the main character) is simply in the backdrop, carrying the story along as best he can. Within him we see a ridiculed boy whose over-femininity makes him the joke of his school. Even the teachers seem to gang up on him. Known as \"Sister-boy Lee\" he tries to 'become' a man, only to let himself down further. He is soon pitied and taken in by Laura Reynolds, the school master's wife, who is told to \"Stay out\" because she's not really \"involved\". The truth is she is deeply involved...Her husband is the main reason for this kid's pain. I don't want to spoil the ending for you so I will say this...Vincente Minnelli is a brilliant director. Deborah Kerr is a wonderful actress who's inner beauty matches her physical beauty. John Kerr really shines. This movie is worth seeing. It does skirt the topic of homophobia but it tells the story that we (when we were teens) can all tell, trying to accept who we are and not trying to be what we aren't.",
         "SPOILERS!!!!! Tom Lee (John Kerr) is an outcast at his boarding school. He stays away from the other guys, hates sports, loves poetry, knows how to sew and garden, walks funny and wants to be a--GASP--folk singer!!! The other boys torment him and call him \"Sister Boy Lee\". His roommate Al (Darryl Hickman) tries to help but it doesn't work. Kind, beautiful Laura Reynolds (Deborah Kerr) wife of the sports coach reaches out to him and \"cures\" him of his shyness. It seems he isn't gay--just shy and sensitive and needs love to have sex--which he gets from Kerr. Some gay men find this objectionable and might be angered that the gay theme is never mentioned--he's just shy and sensitive. I don't find it offensive at all. Consider when this was made--1956. They couldn't have a portrayal of a gay youth--the Hayes Code was still in effect and it would have been cut out. Look what they did with \"Cat on a Hot Tin Roof\" of the same era--all the gay sex references were censored. So you have to accept it for what era it was made in and what Hollywood was allowed to show. It's a good thing director Vincente Minnelli was bisexual--he handled it very tastefully. Actually I found all the talk that carefully skirted the subject kind of funny--it was so obviously talking about a gay stereotype and all the attempts to deny it were kind of amusing. The film is beautifully shot in wide screen and bright, brilliant color. Everybody and everything looks great. There's a nice music score and the script moves at a good pace--it never seems slow or stagy. Deborah Kerr is just fantastic as Laura Reynolds--easily one of her best performances. She's sensitive, strong and understanding. Just great. Unfortunately John Kerr (no relation) was lousy as Tom. He's supposed to be shy and sensitive--he comes across as sullen and obnoxious--it's easy to see why the guys hate him. And he says everything in the same annoying monotone voice! I really didn't care for him. Kerr carries the movie. Also Darryl Hickman has an amusing sequence when he tries to teach Tom how to be more like a man. Never dull, interesting, well-done--just don't take it as a serious study of gay men. Definitely a period piece--but a very good one. Recommended. \"When you talk about this AND you will...be kind.\"",
         "Some of the comments here puzzle me, and really point out how people can see the same film and yet see entirely different films nonetheless. Yes, Tea and Sympathy addresses homosexuality -- but there isn't a single bit of *actual* homosexuality in the film. It's not about actual homosexuality but about perceived homosexuality... and the fear thereof. It's completely obvious within five minutes that Tom Lee is completely in love with Laura, and there's nothing whatsoever in the film that suggests he might feel romantic or erotic attraction to men... nor is there anything whatsoever in the film that suggests that he's confused about whether or not he likes men (or men and women). Of course, back in the fifties, most, really all, film language that dealt with homosexuality was coded. Things *stood* for homosexuality, rather than directly displaying it. So, one could be tempted to say that Tom Lee is a coded closet case. But, far too much of the script is explicitly about the external challenge of his being seen as, or feared to be, queer; while absolutely none of it is about an internal struggle with his orientation. He struggles with the perception (his own and others) of his masculinity, but nothing in the film indicates Tom himself might think he's queer. And, again, his obvious infatuation with Laura permeates the whole film. He doesn't *stalk* her at the beginning because he needs a sympathetic ear... And when she tries to set him up on a tea date with a girl, there's no sense that she fears Tom is queer, that she must straighten him out. But she *is* horribly concerned that they keep others from thinking it. She even has one line of dialog in which she speaks to him directly of the need to \"nip this in the bud\" or somesuch. Even in a 1956 film, it wouldn't make any sense to think that this woman would think a tea date would \"straighten\" Tom out; but it does make sense that she would believe it could be part of repairing his reputation. The closest the film ever gets to suggesting the potential (much less the actuality) of Tom being queer is when Laura voices fears that Tom being treated \"not like a man\" could lead him to *become* unsure of himself as a man... If you want to infer she fears he *might* become queer because of this, there's room especially given the overall coding Hollywood demanded of such material, but, again, you've got everything else in the film to work against this interpretation. And it's an interpretation of what Tom *might* be in the future, not what he is in the timeframe of the film itself. Furthermore, even this is only the perception of another character -- not Tom himself displaying any indication that HE fears he may one day \"become\" queer. Tom's conflict revolves around his trying to navigate his way in the world as the *atypical* man he is, find his identity as a man, and be accepted as such... in a world that doesn't want to. And it's *other* people, not Tom, who clearly (altho thru coded film language) see him as queer, or fear he might be. And while I understand that Anderson's play was more forceful in suggesting that the housemaster was a repressed homosexual, it's *really* stretch to see it in the film version. The building blocks of the coding are there (yeah, he hangs out with the boys and roughhouses with them, and he neglects his wife), but the film also goes to considerable lengths to paint him as a \"typical\" man who's lost interest in his marriage once he's claimed his wife. What with that, and the context of a film in which the main character is so clearly painted as a perceived homosexual rather than as an actual one (even in potentiality), the coding is so incredibly watered down that it's really not even there at all, effectively. Tea and Sympathy is a pretty compelling film about the definitions of masculinity and gender role enforcement and homophobia. It's really upsetting to see that homophobia and misogyny and incredible pressure to conform on screen, but it is compelling. Even if Minnelli turned out to be a horrible choice for director. His avoidance of close-ups reveals him to be, in this case at least, what feels to me like a very selfish director. More than the topic, more than the writing, it's the performances of Kerr and Kerr that make this film. They are constantly having to fight Minnelli's apparent desire to keep them at a visual distance from us. I guess in a way it's a credit to both the stars and Minnelli himself that he could get such strong work from them despite the sparseness of close-ups that the film so desperately needed. It's as if Minnelli thought that he was -- or should be -- directing a pageant rather than a drama. \"Look, I can make even an intimate, human drama great in WIDESCREEN!!!\" Except that you can't, Vincent. I don't care about you in Tea and Sympathy, Mr. Minnelli, I care about Tom and Laura. Give me the characters! Matthew"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Tom Lee is a sensitive boy of 17 whose lack of interest in the \"manly\" pursuits of sports, mountain climbing and girls labels him \"sister-boy\" at the college he is attending. Head master Bill Reynold's wife Laura sees Tom's suffering at the hands of his school mates (and her husband), and tries to help him find himself.",
         "At his ten year reunion, Tom Lee reminisces about his life at Chilton, a boys' prep school. Chilton is the type of institution where generations from the same family attend, and want to attend. Tom, however, has different thoughts. He was perceived as different than the other boys, who called him sister-boy. He doesn't join in the group sporting activities except tennis, a sport he plays with finesse rather than power; he knows how to sew and cook; he knows all about gardening; he wants to be a folk musician; he's only accepted into the dramatic club if he plays the women's roles; and he even doesn't walk or style his hair like the others. The only one of his classmates who tries to understand him is his roommate, Al Thompson, who feels he can only do so much as one person against the masses. Tom knows that he embarrasses his alumnus father, Herb Lee, who is worried the Lee name will now be forever tainted at Chilton. At Chilton, Tom's favorite times are spent with Laura Reynolds, the relatively recent bride of his dormitory house master, the overtly masculine Bill Reynolds who also attended Chilton as a student at the same time as Herb Lee. Seeing the torment he is facing from all sides, Laura wants to help Tom in any way she can. As time goes on and things don't get any better for Tom, Laura comes to the realization of why she is trying so desperately to help him and what she needs to do both to accomplish that task and be true to herself."
      ],
      "budget": 0
   },
   "movielensId": 53916,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-06-06",
      "dvdReleaseDate": null,
      "directors": ["Vincente Minnelli"],
      "runtime": 122,
      "movieId": 53916,
      "title": "Tea and Sympathy",
      "mpaa": "",
      "actors": [
         "Deborah Kerr",
         "Leif Erickson",
         "Edward Andrews",
         "Darryl Hickman",
         "Norma Crane",
         "Dean Jones",
         "Jacqueline deWit",
         "John Kerr"
      ],
      "imdbMovieId": "0049829",
      "originalTitle": "Tea and Sympathy",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["3nPIvXomwq4"],
      "plotSummary": "Tom Lee is a sensitive boy of 17 whose lack of interest in the \"manly\" pursuits of sports, mountain climbing and girls labels him \"sister-boy\" at the college he is attending. Head master Bill Reynolds' wife Laura sees Tom's suffering at the hands of his school mates (and her husband), and tries to help him find himself.",
      "tmdbMovieId": 63096,
      "avgRating": 3.5,
      "releaseYear": "1956",
      "numRatings": 17,
      "posterPath": "/tpjYRGtx0u3BHhrWk5dmPbTjgli.jpg"
   }
}