{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "green beret",
            "id": 10403
         },
         {
            "name": "mobster",
            "id": 11578
         },
         {
            "name": "buddy cop",
            "id": 167316
         }
      ],
      "imdb_id": "tt0109195",
      "video": false,
      "title": "Back in Action",
      "recommendations": [],
      "backdrop_path": "/5OKo9LcOmUWd2fyHeH2jNPKYRdR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frank Rossi",
               "gender": 2,
               "credit_id": "52fe441a9251416c91004f15",
               "name": "Roddy Piper",
               "profile_path": "/e5u4cqQS1X0ow9PJdTECIGgm0Ii.jpg",
               "id": 44240,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Billy",
               "gender": 2,
               "credit_id": "52fe441a9251416c91004f19",
               "name": "Billy Blanks",
               "profile_path": "/g9HvNvwPQrTKcbWDAkHXdGmviZz.jpg",
               "id": 128191,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Helen Lewinsky",
               "gender": 1,
               "credit_id": "52fe441a9251416c91004f1d",
               "name": "Bobbie Phillips",
               "profile_path": "/61hE0Cwh66fcWrsG30zmxkMJWiG.jpg",
               "id": 42657,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tara",
               "gender": 1,
               "credit_id": "52fe441a9251416c91004f21",
               "name": "Kai Soremekun",
               "profile_path": null,
               "id": 218094,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Chakka",
               "gender": 2,
               "credit_id": "52fe441a9251416c91004f25",
               "name": "Matt Birman",
               "profile_path": "/mUff9ZYWDo4e9AkojnRXq9l15RT.jpg",
               "id": 72117,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Kasajian",
               "gender": 2,
               "credit_id": "52fe441a9251416c91004f29",
               "name": "Nigel Bennett",
               "profile_path": "/wx1zmmpMi9luYFGzikSBIvwyDdR.jpg",
               "id": 44208,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Gantry",
               "gender": 2,
               "credit_id": "52fe441a9251416c91004f2d",
               "name": "Damon D'Oliveira",
               "profile_path": null,
               "id": 111817,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "533d8f37925141760b00300c",
               "name": "Martin McNamara",
               "profile_path": null,
               "id": 1149317,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "533d8f4792514175fa002f19",
               "name": "Michael McNamara",
               "profile_path": null,
               "id": 939711,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe441a9251416c91004f33",
               "name": "Steve DiMarco",
               "profile_path": null,
               "id": 137894,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe441a9251416c91004f39",
               "name": "Paul Ziller",
               "profile_path": null,
               "id": 82518,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe441a9251416c91004f3f",
               "name": "Karl Schiffman",
               "profile_path": null,
               "id": 1033696,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 0.786898,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 30443,
      "vote_count": 6,
      "budget": 0,
      "overview": "Two men have different motivations but the same goal when they team up and mount an assault on a powerful drug gang.",
      "similar": [
         9366,
         1422,
         8012,
         64689,
         37645,
         769,
         59,
         96,
         319,
         9798,
         240,
         8961,
         23483,
         203801,
         154400,
         169917,
         238,
         941,
         942,
         64688
      ],
      "original_title": "Back in Action",
      "runtime": 93,
      "poster_path": "/5jurCt1kmGPMKS0JjFm1CzZvsbK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shapiro-Glickenhaus Entertainment",
            "id": 16636,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Performance Pictures Inc.",
            "id": 61386,
            "origin_country": ""
         }
      ],
      "release_date": "1993-01-01",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "A two man force of destruction, set to destroy the illegal establishment.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Steve DiMarco",
         "Paul Ziller"
      ],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Karl Schiffman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109195/",
      "coverLink": null,
      "actors": ["Stars: Billy Blanks, Roddy Piper, Bobbie Phillips | See full cast and crew »"],
      "reviews": [
         "Back in Action (1994) was another direct-to-video-movie that starred two of the biggest players in the rising rental market. Billy Blanks plays a former decorated solider who's sister is mixed up with a local gangster. He knows that he's no good and she'll end up in trouble or worse. Roddy Piper co-stars as a hung over drunken cop who crosses paths with the enraged Billy. How will theses two be able to help each other out? Roddy wants to bust the mobster and Billy wants to put them six feet under. Will these two hot heads be able to work together and take a bite out of organized crime? Roddy Piper and Billy Blanks found new careers in making low budget direct-to-video-action-films. This was a few years before Mr. Blanjs struck gold with the Tai-Bo gimmick and no longer needed to play in these cheesy films. Another underrated action duo. Blanks and Piper made a very interesting team. Recommended.",
         "Rowdy Roddy Piper stars as tough guy police officer who joins forces with martial arts expert/vigilante Billy Blanks to bring down mobsters, who have kidnapped Piper's journalist squeeze(Bobbie Phillips) and Blanks's sister much action and karate chops fly. Billy Blanks and Roddy Piper's charisma (notice I didn't say acting) lifts what would be just another throwaway action flick which consists off the team up two tough guys with different styles, however as expected Back In Action features tons of admittedly spectacular action sequences which always offers a big bodycount. Admittedly all of this is silly, most of it predictable and derivative but Back In Action certainly lives up to its title and fans of the genre will enjoy the big bodycount which compensates for all the shortcomings Back In Action contains. * *1/2 out of 4-(Pretty good)",
         "This is an excellent \"B\" movie. Blanks and Piper work really well together. The story is decent. But story doesn't count, action does. And there is more than enough action to keep people happy. Blanks and Piper are good in the numerous fight scenes. Overall a really good movie that any action fan should check out.",
         "RODDY PIPER is a cop & BILLY BLANKS is a vigilante, who team up to take down a series of bad guys for different reasons, Piper because his partner was killed by these sleaze balls during an undercover operation & Blanks because his sister has been abducted by the group, now naturally like in pretty much all the buddy action flicks, they hate each others guts at first, but soon realize that they need each other in order to take these bad guys out & keep themselves alive. I heard lots about this movie from action fans & I was eager to see it, but I could not find a video store that carried it for rental, finally this baby came on TV & let me tell you something, unlike most direct to video action flicks, this one is worth tracking down, if you can find a copy of it, unlike most Hollywood action films that seem to have more talk than action, BACK IN ACTION is loaded with fights, chases, shoot outs etc. The villains were so well written & Blanks & Piper made for some likable hero's, they acted well together & it's such a shame that a sequel has not been done on this movie, the action scenes are exciting & the plot keeps you interested right to the end & there's never a dull moment. Highly recommended for action fans! **** stars",
         "For a movie that is largely sold (on posters, taglines, etc.) on the strength of the Billy Blanks - \"Rowdy\" Roddy Piper teaming, \"Back In Action\" doesn't really feature as much of their teamwork as you might expect - it's only in the last half hour that they join forces to go after the same targets. It's a bit of a shame, too, as these two do have some strong chemistry (in their first scene together, they fight each other, and it's amusing to see Blanks' kickboxing vs. Piper's brawling), and the rest of the \"plot\" is far too weak to hold your interest in other ways. The action in general is nothing really special in quality, but it's hard to complain about the quantity at least. The two women in the film, Bobbie Phillips and Kai Soremekun, are gorgeous, but it seems a bit of a waste to cast Phillips in a martial arts actioner and give her only about 10 seconds of fighting in total, considering how much a$$ she kicked in the same year's \"TC 2000\" (also with Blanks). Also be warned: this is an extremely violent film. I wasn't surprised to read on IMDb that it was originally rated NC-17 in the USA, and banned (!) in the UK. ** out of 4.",
         "A very good action film. What made this one original was the difference in fighting style between the 2 leads first lead: roddy piper, who does the wrestling style. Second lead, blank who does the martial arts style It makes the fight scenes so cool, and original, especially the fight between piper and blank. The story, from what I can remember is good enough. It's not a brilliant story. But the story doesn't make or break the film. It's the real excellent fights that make this film. Obviously, this is not a film that girls would like. Girl tend not to appreciate a witty fight scene, girls would prefer it if the wit was in the story, which they won't get in this film. Hence this film wasn't rated higher (females gave it low ratings - see the statistics) But I am a man, so I loved this film :)",
         "Both piper and blanks were great in this B movie action flick.While the rest of the cast was laughable as far as serious acting was concerned,but these 2 carried the movie,and the fighting did also.Its not a joke when i say piper is a good actor...he fits the action scene perfectly and deserves a bigscreen movie...this was one movie that should have been in at least some theatres...better then many of the theatrical released action movies out there today,and is a good night of entertainments worth for action fans,not the kinda movie u can watch everyday though...5/10",
         "Just a minor note: some have said Back in Action was a direct-to-video release in the U.S. which isn't accurate. It was released for a brief run in the Southwest in 1993, playing at United Artists theaters including the University Quartet in Little Rock. Based on my memory, however, the lure of the 35mm prints did not attract huge audiences although I think it made a second week of release at one location as a split run. While Shaprio-Glickenhaus Entertainment did handle the Foreign Distribution Sales, it arranged with United International Pictures (UIP) for the domestic theatrical run in the U.S., probably just for the video store campaign as much as anything.",
         "Action lovers are in for a treat with this low budget outing that features more action than in just about any film I can recall. This film is solely catered for those who enjoy watching shoot-outs, car chases, martial arts battles and stuff exploding, because it's absolutely chock full of all of those different elements. The plot itself is as thin as anything, doing little more than setting out the various elements of the movie: the good guys and their girlfriends, the bad guys and their henchmen. The two heroes in this film have the kind of buddy-buddy partnership that involves them fighting each other for a bit before teaming up to battle the bad guys. The central pairing of Billy Blanks and Roddy Piper was a good one, the classic racial partnership of toughness and talk back. I like the way Blanks always looks like a psycho when he's kicking ass, even when he's a good guy, like here. With his muscles bulging through his jacket (he's ripped the sleeves off to look extra tough), he's the kind of guy you definitely wouldn't want to go up against. Piper has more comedy as the usual tough-guy-cop character and, although he's the worst actor in the film, he's oddly charismatic too. The action comes thick and fast, as I mentioned, but I found the majority of it entertaining. Some of the choreography is quite poor, especially all those kicks to the face that Blanks performs that never go anywhere near the opponent. There are a couple of bloody shootings and a gory murder that opens the film, along with people being kneed, punched, kicked in the head and beaten up. Some scenes, like the one where Blanks beats the hell out of two guys in leotards and horrible snow tiger print pants, are the pinnacle of so-bad-it's-good filmmaking. I also noticed a lot of scenes ripped off from other films like RESERVOIR DOGS, DOUBLE IMPACT, and COBRA. The ending involves our heroes storming a ship and the editing goes crazy, just featuring a ton of random explosions and people running around shooting machine guns at each other. It's messy, cheap and cheesy, but there's not much to dislike here; I had a ball with it.",
         "At first, I actually had no idea that Billy Blanks was an actor, but after seeing the poster for this film, my interest had been captured. I was treated to a really amazing beat 'em up fest. Billy Blanks and Roddy Piper sure know how to kick some butt. The movie centers around veteran police office Frank Rossi, played by Piper, who after his partner Wallace is brutally gutted by a ruthless drug gang, becomes bent on avenging his partner's death. Meanwhile, Billy (Played by Billy Blanks), an ex-Special Forces agent, is trying to protect his sister from the same gang, lead by Kasajian, played brilliantly by Nigel Bennett. Rossi and Billy eventually team up after a number of confrontations when Billy's sister and Rossi's reporter girlfriend Helen (Played by Bobbie Phillips) are kidnapped by Kasajian's gang. This movie really knows how to deliver. It's sad that there is really not that large of a following, but we can always hope that it will gain more cult recognition in the future. I hope Universal considers releasing a DVD of this movie someday, in widescreen. Highly recommended. EXTRAS: The tape contains a trailer for Mr. Write (1994) before the movie starts."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": [
         "Performance Pictures Inc.",
         "Shapiro-Glickenhaus Entertainment"
      ],
      "summaries": ["The sister of a former U.S. Green Beret, is involved in a love affair with a mobster, endangering seriously her life. His brother will make his best efforts to save her from her boyfriend and his friends, fighting with or without external help. But perhaps this tough cop, Rossi, could help him... or stop him..."],
      "budget": 0
   },
   "movielensId": 54056,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Steve DiMarco",
         "Paul Ziller"
      ],
      "runtime": 93,
      "movieId": 54056,
      "title": "Back in Action",
      "mpaa": "NC-17",
      "actors": [
         "Roddy Piper",
         "Billy Blanks",
         "Bobbie Phillips",
         "Kai Soremekun",
         "Matt Birman",
         "Nigel Bennett",
         "Damon D'Oliveira",
         "Martin McNamara",
         "Michael McNamara"
      ],
      "imdbMovieId": "0109195",
      "originalTitle": "Back in Action",
      "genres": [
         "Action",
         "Crime"
      ],
      "youtubeTrailerIds": ["JxdBv0Emg_k"],
      "plotSummary": "Two men have different motivations but the same goal when they team up and mount an assault on a powerful drug gang.",
      "tmdbMovieId": 30443,
      "avgRating": 2,
      "releaseYear": "1993",
      "numRatings": 4,
      "posterPath": "/5jurCt1kmGPMKS0JjFm1CzZvsbK.jpg"
   }
}