{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "house arrest",
            "id": 9790
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "outcast",
            "id": 10216
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "police officer",
            "id": 15090
         },
         {
            "name": "lonely man",
            "id": 207972
         }
      ],
      "imdb_id": "tt0298798",
      "video": false,
      "title": "Cherish",
      "recommendations": [
         49733,
         23817,
         91930,
         14167,
         82520,
         44546,
         241432,
         38986,
         91018,
         39497,
         31911,
         181756,
         16405,
         80919,
         77469,
         31016,
         22958,
         68174,
         106135,
         63848
      ],
      "backdrop_path": "/k1IPXtLFcYa3D6aepcYxorXguDb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "52fe47799251416c7509aa8b",
               "name": "Robin Tunney",
               "profile_path": "/oQGr5vfYbkarmJQmhGmSpIhSapL.jpg",
               "id": 17346,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "D.J.",
               "gender": 2,
               "credit_id": "52fe47799251416c7509aa8f",
               "name": "Brad Hunt",
               "profile_path": "/5VP0Rn0cKsktqrvo60olV3cpcCe.jpg",
               "id": 65732,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Brynn",
               "gender": 0,
               "credit_id": "52fe47799251416c7509aa93",
               "name": "Liz Phair",
               "profile_path": "/86FvEyZfeAfwEfv882rFPD2Wswv.jpg",
               "id": 7539,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Daly",
               "gender": 2,
               "credit_id": "52fe47799251416c7509aa97",
               "name": "Tim Blake Nelson",
               "profile_path": "/tWHHEnnoEU6aNaiFRvl1WLfNTvB.jpg",
               "id": 1462,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Therapist",
               "gender": 1,
               "credit_id": "539eea6d0e0a26039f001f27",
               "name": "Lindsay Crouse",
               "profile_path": "/mAZTWVbtfmC0R4R6TZ3rjhJSW0b.jpg",
               "id": 32225,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Officer Yee",
               "gender": 2,
               "credit_id": "539eea7a0e0a2603bc001faf",
               "name": "Kelvin Han Yee",
               "profile_path": "/qTLQx8LDGKSeGfDdFxidsMpFAGv.jpg",
               "id": 19980,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Andrew",
               "gender": 2,
               "credit_id": "539eea840e0a263da4000062",
               "name": "Jason Priestley",
               "profile_path": "/skXfFcbZWPOBomGBSTMfiyzgi6q.jpg",
               "id": 19143,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Woman in Bar",
               "gender": 0,
               "credit_id": "539eeaa20e0a263d2b00007e",
               "name": "Karena Davis",
               "profile_path": null,
               "id": 1331146,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Officer Ruiz",
               "gender": 0,
               "credit_id": "539eeaad0e0a263da400006c",
               "name": "Scott Breitenstein",
               "profile_path": null,
               "id": 1331147,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Officer Griffin",
               "gender": 2,
               "credit_id": "539eeabc0e0a2603b8001f74",
               "name": "Tim Griffin",
               "profile_path": "/hwGjdnFT8MAowE4oYsIGQovqUsD.jpg",
               "id": 27031,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Head Prison Guard",
               "gender": 0,
               "credit_id": "539eeac90e0a2603bc001fc7",
               "name": "Kathleen Stefano",
               "profile_path": null,
               "id": 1331148,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Joyce",
               "gender": 2,
               "credit_id": "539eeaf60e0a2603b8001f82",
               "name": "Stephen Polk",
               "profile_path": null,
               "id": 616377,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Bell",
               "gender": 1,
               "credit_id": "539eeb000e0a2603b4001fcc",
               "name": "Nora Dunn",
               "profile_path": "/wX89q3KHGOe0z47LU6UmukgEdo7.jpg",
               "id": 4496,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Max",
               "gender": 2,
               "credit_id": "539eeb0d0e0a263dd000005b",
               "name": "Ricardo Gil",
               "profile_path": null,
               "id": 228789,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Yung",
               "gender": 0,
               "credit_id": "539eeb170e0a2603bc001fd5",
               "name": "Kenny Kwong",
               "profile_path": null,
               "id": 1331149,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Yoga Instructor",
               "gender": 2,
               "credit_id": "539eeb300e0a263da4000085",
               "name": "Phil LaMarr",
               "profile_path": "/2rYa0M1bOSAATGbF5oe5pmoNeDn.jpg",
               "id": 31549,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47799251416c7509aa9d",
               "name": "Finn Taylor",
               "profile_path": "/hqY8XApmegYI32F6pD64A3alK5e.jpg",
               "id": 84692,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47799251416c7509aaa3",
               "name": "Finn Taylor",
               "profile_path": "/hqY8XApmegYI32F6pD64A3alK5e.jpg",
               "id": 84692,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.26308,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18408,
      "vote_count": 13,
      "budget": 0,
      "overview": "After a martini-induced rampage, a fantasy-prone young woman is placed under house arrest.",
      "similar": [
         11564,
         445954,
         3134,
         948,
         8810,
         298312,
         141,
         431,
         59,
         101,
         949,
         793,
         4771,
         241,
         281,
         339692,
         281957,
         395834,
         11826,
         2142
      ],
      "original_title": "Cherish",
      "runtime": 99,
      "poster_path": "/hTNAKGnqi8v4FRPEjm9Wl5S5yMz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Outpost Studios",
            "id": 25886,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "3 Ring Circus Films",
            "id": 36175,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Concrete Pictures",
            "id": 36176,
            "origin_country": ""
         }
      ],
      "release_date": "2002-01-17",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "She'd get out more if it wasn't a felony.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Finn Taylor"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Finn Taylor"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0298798/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3MDkzMDY4Ml5BMl5BanBnXkFtZTcwNDIxMzEzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Robin Tunney, Tim Blake Nelson, Brad Hunt | See full cast and crew »"],
      "reviews": [
         "A young woman,Zoe,is placed under electronic house arrest for a crime she did not commit. The eccentric and energetic `Cherish, ' written and directed by Finn Taylor (`Dream with the Fishes') has the virtues of romance and thriller with a good dose of odd love. It is by far superior to any other in its multi-genre this year. Robin Tunney plays Zoe as a cross between Frankie Potente in `Run, Lola, Run' and an updated Audrey Hepburn in `Breakfast at Tiffany's.' She indeed runs for her life, in a sequence clearly influenced by `Lola,' and she hangs out on an apartment terrace wistfully looking at life as Audrey did almost a half a century ago. Tunney is natural and attractive dealing with the loneliness of exile and a possible romance with the rep for the electronic imprisoning device. Her antagonist is a male version of Clint Eastwood's nemesis in `Play Misty for Me'-a cunning loner whose affection for music and Zoe is pathological. This insanity allows for an eclectic soundtrack rich with the songs of the \u009150's and 60's and an emphasis on the eccentric contemporary Noe Venable, perfectly suited to the situation. And the music is a star-the pop lyrics give meaning and nostalgia in a world where Zoe is confined by four walls but liberated by her imagination to become a passably good roller skater and lovable neighborhood oddity. Association hit \"Cherish\" is the titular song whose demented lyrics reflect the antagonist's sick obsession with a girl he can never have. Confinement has released her imagination. Finally, an intelligent movie this summer to share the spotlight with Hugh grant's `About a Boy.'",
         "\"Cherish\", directed by Finn Taylor, is worth a look because it's much better than some other more pretentious movies that fared much better, be it because hype, or wider distribution. The talent gathered here is young and wonderful and the great sound track, mostly from the 80s works extremely well. We first meet Zoe, an insecure young person, as she comes to work in an office where she sticks out like a sore thumb. Zoe is an original in her own way, but she tries too hard to fit in. Her mostly sophisticated coworkers reject her on the basis of looks. Zoe is heavily into music. We see her dialing her local radio station to ask the D.J. to play favorites, which he always has ready. Her 'radio' name is Natasha! Something horrible happens to Zoe after a party. A policeman is killed and all points out to Zoe being the culprit. Thus begins a house arrest in which Zoe is made to wear an ankle strap that will monitor her movements. Daly, the police department in charge of this operation, becomes fascinated by this young woman. Suddenly, this man will be seeing things differently as he falls for Zoe in a no-win situation. The viewer is in for a treat because of the immensely winning performance of Robin Tunney. She is a fantastic presence as Zoe. We get a feeling of claustrophobia as we watch her confined to a seedy loft for a crime she has nothing to do with. Tim Blake Nelson, who we have seen on plays in the New York stage, makes an incredible contribution to this story that is set in the Bay area. \"Cherish\" will win anyone with an open heart.",
         "In San Francisco, Zoe (Robin Tunney) is a shy and outcast in her working place that adores the love songs she listens to the radio. Zoe goes to a bar with her coworkers and she spends the night talking to a colleague that also like mushy songs. She drinks with him and when she goes to her car to take her cellular to call a taxi, a stalker forces her to drive away. A police officer sees the intruder in her car and asks her to stop the car. However, the guy forces Zoe to run over the policeman that is hit and dies. Zoe has a car accident and the aggressor escapes. Neither the police nor her defense lawyer believes on her words and Zoe is arrested for murdering the policeman. She is confined at home with an ankle bracelet under the surveillance of Daly (Tim Blake Nelson), a lonely man that falls in love with Zoe. She tries to find a way to leave the spot to chase the criminal and prove her innocence. I bought \"Cherish\" on DVD a long time ago, and only today I have watched it. It was a pleasant surprise, since Robin Tunney and the music score with wonderful songs from the 60's, 70's and 80's make this good low- budget film also delightful. The conclusion is satisfactory but could be better and better. My vote is seven. Title (Brazil): \"No Lugar e na Hora Errada\" (\"In the Wrong Place and Time\")",
         "I thoroughly enjoyed this movie. It's the type of flick that you want to see again, and real soon, because you have the sense you missed a lot the first time around. The use of music is huge in this movie. Although completely different, I am drawing up memories of High Fidelity. Both movies feature music as its own entity or major theme in the story, not just as a backdrop to help tell the story. As a music lover, I just dig this. Robin Tunney was phenomenal as Zoe. I think even if I didn't enjoy the other characters and the plot so much, this movie would be worth seeing just for her performance. She did an excellent job of portraying Zoe's journey. Her performance never felt pushed or strained; she just WAS Zoe, from the first scene to the last. Of course, this is what actors are paid for! I just felt she did an extraordinary job of capturing the character. I love the way this movie was presented. It didn't abuse, or rely on, special effects. Rather, they were used at just the right time to help tell the story. This movie has just enough of everything you want in a movie to make it suitable for all the types of moods you might be in when you see it!",
         "A fine exploration of love and obsession and a woman's journey for identity wrapped in an implausible plot, 'Cherish' is an admirable film full of well-rounded, comedic performances by a mostly unsung cast. Robin Tunney, who some of you may know from the remake of 'The In-Laws', stars as Zoe, a ditzy, confused young woman at the beginning of the film. She defines herself by her pitiful relationships with men, which through plot circumstances I won't reveal, result in her being confined to a seedy apartment somewhere in San Francisco, awaiting trial for a crime she didn't commit. Gradually, she discovers her strength as a woman, both physically and emotionally, through her relationships with her apartment mates, local neighbors, and most significantly with Tim Blake Daly, who portrays the cop who monitors her confinement. Great musical score that comments on the movie's themes, some great comic bits by the supporting cast and excellent direction by Finn Taylor. San Franciscans will snicker at the journey Zoe takes through the city to return to her apartment when she is allowed a day of escape, and some folks may scoff at the rather absurd plot, but I found this to be a very adorable film and recommend it to any film buffs who have grown bored by the usual Hollywood mush.",
         "Fine breakthrough performance by Robin Tunney (\"The Craft\") and 80's soundtrack drives this independent sleeper. Tunney plays a computer animator named Zoe who likes to fantasize and listen to 80's pop music. One night, Zoe's life changes for the worse after a stranger hops in her car and makes her run over a police officer by accident and he gets away. As a result, she finds herself under house arrest with an electronic bracelet uncomfortably attached to her ankle and limited to 57 feet of space in a run-down apartment until her trial. While dealing with confinement and solitude she tries to improvise. A parole officer (Tim Blake Nelson) checks up on Zoe quite frequently and even tries to help her find the assailant responsible. And yes, there's chemistry between the two. Want more info? You'll have to see this movie for yourself. What makes \"Cherish\" entertaining is that this movie revolves around Zoe. Writer/director Finn Taylor wants us to identify with Zoe. We shouldn't laugh at her, but with her and to sympathize with her. She uses music as a tool, a way to overcome misery. In fact, just about every character uses music in their own way. For those who love music are in for a treat. The soundtrack contains songs by Hall & Oates, Soft Cell, Modern English and Tom Petty to name a few. If you're tired of summer blockbusters and want to see something different and entertaining, this is the movie to track down for the whole family. That is, if it's playing in your area. My evaluation: *** out of ****.",
         "Robin Tunney plays Zoe, a woman who finds herself trapped in her own home through the home arrest program after being falsely accused as a cop-killer. Tim Blake Nelson plays the home arrest worker who often visits to check on the equipment. The new film by Finn Taylor works like a romantic comedy, but also contains elements of a thriller. Cherish could easily have become buried in pretense or a messy mixture of genres, but it succeeds though, primarily by focusing on the complex character created by Tunney. Most of the film takes place inside the loft apartment Zoe has been confined to. Gradually, she finds ways to expand her circle of territory, which mirrors her personal growth. The irony is that when she was free Zoe never connected with anyone, but when under arrest she is able to reach out and develop friendships. Tunney does a great job of playing an intelligent, but obviously flawed character. Tim Blake Nelson has a much smaller role, but he does a lot with it. When he becomes obsessed with Zoe he shows it in small ways, staring at a photo, buying her a radio. It's the kind of behavior I think we've all experienced when someone captures our attention. Other cast members that pop up in small but memorable roles include Jason Priestley (rather unrecognizable as a smarmy co-worker), Liz Phair, Nora Dunn and Brad Hunt as a stalker. But special mention should be made of Ricardo Gil, an amateur actor (he regularly works as a photographer) who plays Zoe's neighbor, a gay Jewish short person. Seems a bit extreme when writing it, but the nice thing is that Gil plays the part well never delving into pathos or caricature. The soundtrack is fun with several cheesy pop songs from the 70's and 80's, which often are played for comedic effect like when our stalker dances around to Hall and Oates's `Private Eyes'. What Taylor is aiming for though, is showing us people who want to use pop songs as a means of expression. It's a great twist to the usual method of just inserting an appropriate tune.",
         "This is one of my favorite independent films. Yeah, the storyline may not be original, but Robin Tunney and Tim Blake Nelson do such a good job that you just love their characters (at least I did) and you want everything to turn out well for them. When I saw this in the theater originally, I loved the soundtrack, as it fit the storyline so well. The 80s songs featured are so cheesy and they fit the stalker theme. This film is so obviously low budget, but the actors involved made the story interesting, and I got so wrapped up in the story that I didn't care about the \"little things.\" The DVD is well made, with an entertaining commentary track and an interesting \"making of\" featurette. What more could a film geek want?",
         "I liked this movie! A lot of problems with new indie films is that they try to be too artsy (with rapid cuts or industrial music) or too dark where you wind up loathing all of the characters. This movie was neither. The soundtrack was ecclectic and quirky. You were able to sympathize with all the characters. Nelson and Tunney had great chemistry and were fun to watch together. The genres (comedy/drama/thriller) meshed very well together to make a cohesive, entertaining piece. Good job :-)",
         "Oh this movie had so much potential and I still recommend it as the soundtrack rocks and Robbin and Tim are both beautiful and so lovely to watch, but....this is an example, to me, of a good movie just made too fast or something, I was bummed because it just has such great potential, there were just way way way too many inconsistencies and unbelievable situations... i.e. the whole attic/shoot thing she was always jumping around in, the lovers never catching on, the new red cordless at the end of the movie, the wood plank suddenly not on the door just after she placed it there moments before....and the ending? (Spoiler Alert) actually just before the ending the fight with Mr. Psycho...it just didn't seem truthful, but I do like the fact that she took off and didn't get \"saved\" by her cute man and yet the emailing alludes to the possibility of them hooking up, even if at first he seemed creepy....so what I'm saying, rent it, but don't expect truthfulness to the situation..."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": [
         "3 Ring Circus Films",
         "Concrete Pictures",
         "Outpost Studios"
      ],
      "summaries": [
         "In San Francisco, Zoe is a shy and outcast in her working place that adores the love songs she listens to the radio. Zoe goes to a bar with her coworkers and she spends the night talking to a colleague that also like mushy songs. She drinks with him and when she goes to her car to take her cellular to call a taxi, a stalker forces her to drive away. A police officer sees the intruder in her car and asks her to stop the car. However, the guy forces Zoe to run over the policeman that is hit and dies. Zoe has a car accident and the aggressor escapes. Neither the police nor her defense lawyer believes on her words and Zoe is arrested for murdering the policeman. She is confined at home with an ankle bracelet under the surveillance of Daly, a lonely man that falls in love with Zoe. She tries to find a way to leave the spot to chase the criminal and prove her innocence.",
         "Shy San Franciscan Zoe is a twenty-something love-starved animator who spends countless hours listening to KXCH Cherish radio, losing herself in a syrupy romantic fantasy of '70s and '80s pop songs. Her mushy world is shattered, however, when a policman is hit and killed in a mysterious car accident, the assailant flees the scene and Zoe is unfairly left facing a vehicular homicide charge. While awaiting trial, Zoe is confined to house arrest, where she alternates falling in love with her frequent visitor and parole officer, Daly, and trying to prove her innocence to regain her life and freedom.",
         "After a martini-induced rampage, a fantasy-prone young woman is placed under house arrest."
      ],
      "budget": 1500000
   },
   "movielensId": 5416,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-01-17",
      "dvdReleaseDate": "2002-12-10",
      "directors": ["Finn Taylor"],
      "runtime": 99,
      "movieId": 5416,
      "title": "Cherish",
      "mpaa": "",
      "actors": [
         "Robin Tunney",
         "Brad Hunt",
         "Liz Phair",
         "Tim Blake Nelson",
         "Lindsay Crouse",
         "Kelvin Han Yee",
         "Jason Priestley",
         "Karena Davis",
         "Scott Breitenstein",
         "Tim Griffin",
         "Kathleen Stefano",
         "Stephen Polk",
         "Nora Dunn",
         "Ricardo Gil",
         "Kenny Kwong",
         "Phil LaMarr"
      ],
      "imdbMovieId": "0298798",
      "originalTitle": "Cherish",
      "genres": [
         "Comedy",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["m_1qRpBF7KM"],
      "plotSummary": "After a martini-induced rampage, a fantasy-prone young woman is placed under house arrest.",
      "tmdbMovieId": 18408,
      "avgRating": 3.39051,
      "releaseYear": "2002",
      "numRatings": 137,
      "posterPath": "/hTNAKGnqi8v4FRPEjm9Wl5S5yMz.jpg"
   }
}