{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0020815",
      "video": false,
      "title": "The Dawn Patrol",
      "recommendations": [],
      "backdrop_path": "/Xvi7kVi1l6cSvf3mJvYVJ8mOYT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dick Courtney",
               "gender": 2,
               "credit_id": "52fe482e9251416c9108318f",
               "name": "Richard Barthelmess",
               "profile_path": "/sZVQW3SyQvNIctH0svsVU4M7WHb.jpg",
               "id": 13789,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Douglas 'Doug' Scot",
               "gender": 2,
               "credit_id": "52fe482e9251416c91083193",
               "name": "Douglas Fairbanks Jr.",
               "profile_path": "/A8hI3VdDpt40pFQqljlc6WidrJv.jpg",
               "id": 51762,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Maj. Brand",
               "gender": 2,
               "credit_id": "52fe482e9251416c9108319d",
               "name": "Neil Hamilton",
               "profile_path": "/zbSm4kPqVZM2JB6ph7eQsZVsnQP.jpg",
               "id": 27733,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Flaherty",
               "gender": 2,
               "credit_id": "52fe482e9251416c910831a1",
               "name": "Frank McHugh",
               "profile_path": "/oSBztLH3U3TctJnuJm0U9600fSq.jpg",
               "id": 74875,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Bott",
               "gender": 2,
               "credit_id": "57ecc1099251410c5b00d08a",
               "name": "Clyde Cook",
               "profile_path": "/loYiy4EW1S0p29cLrP9Fxg5ogrU.jpg",
               "id": 13557,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Field Sergeant",
               "gender": 2,
               "credit_id": "57ecc115c3a3683a99003dd7",
               "name": "James Finlayson",
               "profile_path": "/jKWkZTPmipR9LWI97wwjCK4Oq8d.jpg",
               "id": 131386,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "German Pilot (uncredited)",
               "gender": 0,
               "credit_id": "594ba07fc3a36832ca00f260",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Pilot (uncredited)",
               "gender": 2,
               "credit_id": "594ba092c3a36832ad00f00a",
               "name": "Dave O'Brien",
               "profile_path": "/2LVRGnrd1vHwgrJxCaJCvMliduy.jpg",
               "id": 118633,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe482e9251416c91083199",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57ecc05dc3a3683afa003dbf",
               "name": "John Monk Saunders",
               "profile_path": null,
               "id": 102503,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "57ecc062c3a3683a7000609b",
               "name": "Dan Totheroh",
               "profile_path": null,
               "id": 103893,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "57ecc06dc3a3683a85003772",
               "name": "Howard Hawks",
               "profile_path": "/yekSHa7JRzGMg0M7X4HP530GeyV.jpg",
               "id": 11435,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "57ecc0759251411a4a003e77",
               "name": "Seton I. Miller",
               "profile_path": null,
               "id": 67428,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "57ecc07f9251416aef004de6",
               "name": "Robert North",
               "profile_path": null,
               "id": 1020761,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57ecc09bc3a3687dcf0043a2",
               "name": "Rex Dunn",
               "profile_path": null,
               "id": 1102134,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57ecc0ab9251411a4a003e8b",
               "name": "Ernest Haller",
               "profile_path": null,
               "id": 2774,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57ecc0bf9251411a58003f70",
               "name": "Ray Curtiss",
               "profile_path": null,
               "id": 103497,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57ecc0c792514151df0057c6",
               "name": "Jack Okey",
               "profile_path": null,
               "id": 17763,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "57ecc0d092514151df0057c9",
               "name": "Ray Moyer",
               "profile_path": null,
               "id": 7688,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.275925,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 81847,
      "vote_count": 5,
      "budget": 0,
      "overview": "World War I ace Dick Courtney derides the leadership of his superior officer, but Courtney is soon promoted to squadron commander and learns harsh lessons about sending subordinates to their deaths.",
      "similar": [],
      "original_title": "The Dawn Patrol",
      "runtime": 108,
      "poster_path": "/s5gdwXu4ZBlLGqTG6I1qRp75zSj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "First National Pictures",
         "id": 3245,
         "origin_country": ""
      }],
      "release_date": "1930-08-20",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Howard Hawks"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "John Monk Saunders",
         "Dan Totheroh"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0020815/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NTU5MjM3N15BMl5BanBnXkFtZTgwNjI2ODAyMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Richard Barthelmess, Douglas Fairbanks Jr., Neil Hamilton | See full cast and crew »"],
      "reviews": [
         "This fine movie directed by Howard Hawks is more potent for its absolutely dazzling aerial photography and filming, one of the best I've ever seen - much better than the eighties Top Gun. First, let me say the late twenties to late thirties was the height of what is known as the Aviator movie. Many hits were scored using this genre including this one which was a blockbuster in 1930. The thirties aviator movies in their flight sequences have a certain feeling to them. They are so realistic in look, and this is achieved without music being used, but just the whirring of the engines gaggling, give it a prescient omniprescence that advances in movie technology, Digital imagery and CGI can't duplicate. I mean, any of the thirties aviator pictures sparkle in their flight segments. It must be the way they were shot. I wonder what technique was used. The story for this movie which won an Oscar was written by John Monk Saunders who obviously knew the genre well. He also wrote Wings, the first Academy award winner, Legion of the Condemned, an even bigger hit than Wings with Gary Cooper, Devil Dogs of the Air and West Point of the Air. The leads are Richard Barthelmess and Doug Fairbanks jr. Barthelmess gives the real performance here while Fairbanks gives the movie star performance. They are involved in WWI and are ace pilots and best of friends. The film has a pandemic tone and regurgitating pace that feeds the ennui of war. Like the pilots of Top Gun, they tend to go against orders given by their boss, silent screen leading man, Neil Hamilton who has the tough job of sending men on their missions, missions in which lives will surely be lost. He doesn't like it but he has to follow orders. That is the theme of the movie, obeying and serving your job because it is necessary. Life is hard and fulfilling your function/role against all odds is rote. Tough choices have to be made for the greater good. Cliche but true. That is the irony of war and when one falls, another must takes his place. Barthelmess eventually takes Hamilton's job and in his shoes feels the pressures the man felt and the toughness of following necessary orders. It is not an anti-war movie, more than it is a WAR IS HELL! but heaven is only one more day of hell away. Slow because of early talkie cameras which needed absolute silence to be recorded and were static without any movement, but sets are highly believable and bombing raids uncharacteristically realistic. Dialogue though is a bit pedestrian with certain heavy-handed moments, in today's glare, and performances not up to par in certain areas but overall, a fine movie.",
         "Terrific war film starring Richard Barthelmess as a veteran British pilot in France whose job is to make raids behind enemy lines in what are basically suicide runs. He complains to his commander (Neil Hamilton) about the green kids he gets, but of course war is hell and there's nothing anyone can do. It seems like every day they send out 5 or 6 planes and 2 or 3 come back. The guys drink heavily to hide their anguish. Barthelmess and Hamilton fight constantly until Hamilton is promoted and Barthelmess gets his desk job. Now it's his job to send out the fliers. His best friend (Douglas Fairbanks, Jr.) becomes the squad leader as the green kids keep showing up for duty. Then Fairbanks' kid brother arrives. What follows breaks up the friendship between Barthelmess and Fairbanks, but the war drones on. Excellent cinematography of aerial fights and bombing raids. The ending is simply superb, one full of heroism and irony. Barthelmess and Fairbanks are excellent, and Hamilton is also good. Supporting cast includes Frank McHugh, William Janney, James Finlayson, Clyde Cook, and Gardner James.",
         "The original John Monk Saunders story to this film deservedly won an Oscar. The remake has all the polish this early talkie does not, but fails to impress emotionally. The acting here is uniformly excellent and the special effects are impressive as well. It is directed at a slower pace than modern audiences are used to - this was the early talkie era after all, but despite the slow spots and the lack of background music (sometimes the silence is more than palpable), it adds up to a strong emotional drama that is rather unforgettable.",
         "Although William Wellman is the Hollywood director most associated with air films, not counting of course the self indulgent Howard Hughes, Howard Hawks with The Dawn Patrol and with Air Circus and Only Angels Have Wings can certainly hold is own against the formidable Mr. Wellman on his own turf. This may have been Howard Hawks's first sound feature and he debuted magnificently with a story about a group of fliers from the United Kingdom's Royal Flying Corps of World War I. John Monk Saunders wrote the original story for the screen that netted The Dawn Patrol an Academy Award for that category. The story centers on three men. Group commander Neil Hamilton who has to send his men up against some of Germany's best fliers and two of his senior pilots, Richard Barthelmess and Douglas Fairbanks, Jr. Hamilton is a troubled man indeed, having to send barely trained kid pilots and he hears about it from Barthelmess and Fairbanks. One fine day, oddly enough to do a daring assault that Barthelmess and Fairbanks pull off, Hamilton gets a promotion up to the staff headquarters. In a curious bit of poetic vengeance he names Barthelmess his replacement. Of course when Barthelmess now is seeing the war from Hamilton's point of view, he starts to behave differently. What he does and the choices he makes are the basis for the rest of this story about some of the United Kingdom's most gallant generation lost in the first terrible total war of the last century. As Fairbanks and Barthelmess criticize Hamilton in what he does, I do wonder about when they were the fresh recruits. They became the veterans more than likely by sheer chance that they did survive. Yet that never plays a part in their thinking. The aerial combat sequences are excellently staged, Howard Hughes and William Wellman could hardly have done better. They were so good that they got used again in the 1938 remake of this film. The Dawn Patrol also marked the film debut of Frank McHugh who graced Warner Brothers films for the next 20 years. I've said in many comments and on their respective pages that it could almost not be a Warner Brothers film without either Frank McHugh or Alan Hale or both in a given feature, they appeared so often. The brothers Warner, got their work out of those two. The 1938 remake with Errol Flynn, David Niven, and Basil Rathbone is the one most are familiar with. Still this one is the real deal.",
         "This is what film-making is all about! The Vitaphone audio recording process challenges itself almost continuously in this early talkie. You aurally count the number of planes coming in (off-camera) while watching the reaction of the principals inside the office. You even get the correct fidelity of the wind-up gramophone as characters talk over it. Meanwhile, you watch aerial dogfights that switch seamlessly from soundstage re-creations to actual footage made by a camera mounted at the front of an aeroplane, without any jarring sense of displacement. The melodrama remains palpable with very little over-acting. I'm taking one point off for that occasional over-acting, and for the really dumb use of Southern California semi-desert topography in which the planes take off and land. It wouldn't have been that hard to find a location with a few more trees and more grass. Oh, well. The movie still must have knocked the original audiences' socks off.",
         "This is an early talkie starring Richard Barthelmess as Dick Courtney and Douglas Fairbanks Jr. as Doug Scott, a couple of World War I aces and the best of friends, at least at the beginning of the film. Neil Hamilton (police commissioner Gordon in the 60's Batman TV series) is Major Brand, in charge of handing out commands and assignments among his group of fliers. One day Courtney and Scott pull off a daring air raid that they have been ordered not to do by Brand. When they return, their success causes Brand to be promoted just as he is about to punish Courtney, and now Barthelmess' Dick Courtney is named as replacement and the new commander of the unit. Now instead of risking death himself, Courtney is the one ordering others into harm's way, and it is cracking him up as he turns more and more to drink. However, he still has Scott's friendship until a new recruit arrives and is ordered into a fatal battle. Now it is Scott who not only has no use for Courtney, but no use for life itself, and it is up to Courtney to make sure that Scott doesn't throw his life away. This film, like many early talkies, is long on talk but short on the kind of aerial action you'd probably expect in a film about World War I fliers. Only towards the last third of the film do you see much in the way of dogfights. The focus is mainly on the fliers themselves and the futility of war. Barthelmess gives a great and poignant performance as Dick Courtney, and he lasted longer in talking pictures than most silent film actors due to his great skill. Also remember that most of the films made about World War I during this time were essentially anti-war films. By the beginning of the depression, WWI seemed a wasted effort in both money and manpower, and these early talking picture war films reflected that attitude. The version of this film starring Errol Flynn is what most people remember. It's too bad this version didn't at least rate as an extra feature on that DVD. It makes for an interesting comparison.",
         "Many on this board have compared this movie to TOP GUN which is a good movie but lacks Dawn Patrol's depth. The early version of DAWN PATROL tells a complex tale of leadership and command best illustrated by the scene in which the commanding officer is promoted out of the unit and command falls into the hands of his highly critical, hot dog, second in command. I don't remember exactly was the CO said when he opened the orders relieving him. I believe the line goes, \"Now see what you can do now that you can't do everything you want.\" The tension between the commander and his second is what find to be the most interesting part of the movie. Top Gun simply lacks that type of insight. Top Gun is more of an adventure story of a hot dog pilot. Movies comparable to Dawn Patrol in the military war genre which attain the understanding of the conflict at the top.are Major Dundee, Twelve O'Clock High and surprisingly the John Wayne film Flying Leathernecks. This film was remade in 1938 with Errol Flynn in the lead role. I'm told that it was so gripping that French spies on the Luxembourg border went to see it and missed the onset of the German invasion.",
         "In France for World War I service, British pilots Richard Barthelmess (as Dick Courtney) and Douglas Fairbanks Jr. (as Doug \"Scotty\" Scott) clash with commander Neil Hamilton (as Drake Brand) over his decisions to send young fliers out on suicide missions in rickety planes. But, with the Germans active nearby, Mr. Hamilton has limited options. Taking the lead, Mr. Barthelmess decides to go over Hamilton's head, completing a dangerous mission with Mr. Fairbanks co-piloting. Hamilton threatens to have him court-martialed, but a worse fate awaits Barthelmess - he is promoted to commander of the \"Flight Squadron\"... Now in charge, Barthelmess must order young fliers out on suicide missions in rickety planes. Responding to his own superiors, Barthelmess includes his pal's bright-eyed young brother William Janney (as Gordon \"Donny\" Scott) on \"The Dawn Patrol\" - although it could lead to tragedy. To ease war pain, the men drink. There are few surprises in this story, which illustrates the inevitable. A little theatrical by today's standards, Barthelmess and the men perform exceptionally well. The command post scenes are vivid and the aviation exciting, with director Howard Hawks performing double duty as the dreaded \"Von Richter\". ******* The Dawn Patrol (7/10/30) Howard Hawks ~ Richard Barthelmess, Douglas Fairbanks Jr., Neil Hamilton, William Janney",
         "Pretty good story of airmen in the First World War, flying desperate missions against German troops and superior German airplanes and pilots, including the dreaded Baron von Richter. It's bloody suicide. Yet there is gallantry in the air and on the ground. Pilots who are going down in flames salute the enemy pilot who has brought them to this sorry state. There was little of that gallantry left in World War II, except in one instance in which an American P-47 pilot damaged an enemy fighter. The pilot bailed out and sailed past the American's canopy, upright and in full salute. The British pilots we see -- almost all of them American -- are jovial enough in their day room or whatever it is. If someone is shot down, the loss is overcome by an excess of booze and song. The gramophone plays a scratchy \"Poor Butterfly\" (how apt) and the men drink and sing \"The world is made up of lies/ So hurrah for the next man who dies.\" The pilots are in good shape, pretty chipper, compared to their commander, who is filled with guilt and rapidly becoming a neural shambles. He snaps at the men, barks out orders, and has no sense of humor. The men can't understand this until one of them, Douglas Fairbanks, Jr., is promoted to Flight Commander and takes his place. The film is an early talky. There is no underscore: we hear only the men singing and the gramophone playing. And it's stagy. There aren't many outdoor scenes; the men swill booze and argue and play cards in the day room. The message itself is overstated. But, ah, the scenes of flight. Great whirling masses of biplanes, some spinning down and trailing smoke. Lots of stunts with airplanes too. It's more like a comic book than like reality but, well, consider the period. The special effects aren't bad. More realism and a more complex message can be found in a relatively recent movie like \"The Blue Max.\" Howard Hawks is uncredited but listed as a German pilot. Well, there is only one German pilot we get to see anything of. He's a victim of one of the fliers on our side and has been brought to the day room for a bash before being taken off to the Gefängnis, where he must have woken up with a terrible hangover. He looks nothing like a young Howard Hawks. True, Hawks was trained as a flier in the Army but somebody is pulling the wool over somebody's eyes around here.",
         "Great WW1 flying drama. A very gritty and accurate look at life, and death, in a Royal Flying Corps (RFC) fighter squadron. Details fairly well the burden of command, of sending pilots to almost certain death. Incredibly good flying action scenes, especially for 1930. Great cinematography, for the time. The non-action scenes are good too, filled with drama and the realities of living with a Sword of Damocles over one's head. Reasonably good performances all round. No real stand-outs. Pity that American actors had to be used for some parts, as it ruins the authenticity somewhat. For some reason the movie was remade 8 years later, also as The Dawn Patrol, and with Errol Flynn in the lead role. Copied the plot to the letter and didn't add much, so not sure why it was made. Was still a good movie though."
      ],
      "genres": [
         "War",
         "Drama",
         "Action"
      ],
      "productionCompanies": ["First National Pictures"],
      "summaries": [
         "During the First World War, British combat pilot Dick Courtney mocks his commanding officer Major Brand for being too cautious, unaware that Brand is tormented by the requirement of his command that he send young men to their likely deaths in substandard aircraft and with insufficient training. When Brand is transferred, Courtney becomes the commanding officer and quickly realizes the burden Brand labored under. When Courtney's best friend, Douglas Scott, asks him to spare his newly arrived and inexperienced brother Gordon Scott from combat duty, Courtney cannot justify doing so. A rift grows between the friends as Courtney realizes the tragic demands of his job.",
         "World War I ace Dick Courtney derides the leadership of his superior officer, but Courtney is soon promoted to squadron commander and learns harsh lessons about sending subordinates to their deaths."
      ],
      "budget": 611722
   },
   "movielensId": 54239,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1930-08-20",
      "dvdReleaseDate": null,
      "directors": ["Howard Hawks"],
      "runtime": 108,
      "movieId": 54239,
      "title": "The Dawn Patrol",
      "mpaa": "",
      "actors": [
         "Richard Barthelmess",
         "Douglas Fairbanks Jr.",
         "Neil Hamilton",
         "Frank McHugh",
         "Clyde Cook",
         "James Finlayson",
         "Howard Hawks",
         "Dave O'Brien"
      ],
      "imdbMovieId": "0020815",
      "originalTitle": "The Dawn Patrol",
      "genres": [
         "Action",
         "War",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "World War I ace Dick Courtney derides the leadership of his superior officer, but Courtney is soon promoted to squadron commander and learns harsh lessons about sending subordinates to their deaths.",
      "tmdbMovieId": 81847,
      "avgRating": 3.71429,
      "releaseYear": "1930",
      "numRatings": 7,
      "posterPath": "/s5gdwXu4ZBlLGqTG6I1qRp75zSj.jpg"
   }
}