{
   "tmdb": {
      "original_language": "nl",
      "keywords": [
         {
            "name": "sexual identity",
            "id": 566
         },
         {
            "name": "dance performance",
            "id": 1346
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "first time",
            "id": 2201
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "lgbt",
            "id": 158718
         }
      ],
      "imdb_id": "tt0108504",
      "video": false,
      "title": "For a Lost Soldier",
      "recommendations": [
         78441,
         158947,
         108768,
         64509,
         341544,
         327175,
         39517,
         12453,
         306547,
         215739,
         192623,
         127862,
         4676,
         13617,
         83651,
         80269,
         60428,
         144421,
         40428,
         34835
      ],
      "backdrop_path": "/zfdXIvLznm9qypmEOX0gPEWnBtM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jeroen Boman",
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf33",
               "name": "Maarten Smit",
               "profile_path": null,
               "id": 96843,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jeroen Boman (adult)",
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf37",
               "name": "Jeroen Krabbé",
               "profile_path": "/A5Mks6zi6Xzt9A8fxBWc3wdlvhx.jpg",
               "id": 1924,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Walt Cook",
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf3b",
               "name": "Andrew Kelley",
               "profile_path": null,
               "id": 96844,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hait",
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf3f",
               "name": "Freark Smink",
               "profile_path": null,
               "id": 96845,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mem",
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf43",
               "name": "Elsje de Wijn",
               "profile_path": null,
               "id": 96846,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jan",
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf47",
               "name": "Derk-Jan Kroon",
               "profile_path": null,
               "id": 96847,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Henk",
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf4b",
               "name": "Wiendelt Hooijer",
               "profile_path": null,
               "id": 96848,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf2f",
               "name": "Roeland Kerbosch",
               "profile_path": null,
               "id": 96842,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe452ac3a368484e04bf5d",
               "name": "Rudi van Dantzig",
               "profile_path": null,
               "id": 1170553,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "541c608dc3a36801c3004477",
               "name": "Roeland Kerbosch",
               "profile_path": null,
               "id": 96842,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "541c60950e0a26124600461c",
               "name": "Don Bloch",
               "profile_path": null,
               "id": 1170552,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 2.639104,
      "production_countries": [{
         "iso_3166_1": "NL",
         "name": "Netherlands"
      }],
      "id": 27052,
      "vote_count": 20,
      "budget": 0,
      "overview": "The story of a romantic relationship between a Canadian soldier and a child set in the Netherlands near the end of WWII. Told in flashback from the present day, the child, now a man, is still seeking his lost soldier.",
      "similar": [
         423,
         424,
         205596,
         324786,
         449176,
         289222,
         351339,
         1654,
         16869,
         5925,
         2253,
         613,
         637,
         14574,
         11202,
         227306,
         228150,
         374720,
         399404,
         376867
      ],
      "original_title": "Voor een Verloren Soldaat",
      "runtime": 92,
      "poster_path": "/qEuZhNnG3fPkDleW3aZQTyf31uX.jpg",
      "spoken_languages": [{
         "name": "Nederlands",
         "iso_639_1": "nl"
      }],
      "production_companies": [],
      "release_date": "1992-05-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Roeland Kerbosch"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Don Bloch",
         "Rudi van Dantzig"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt0108504/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1Mjk1NDE1MV5BMl5BanBnXkFtZTcwNzM5NDAyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Maarten Smit, Andrew Kelley, Jeroen Krabbé | See full cast and crew »"],
      "reviews": [
         "VOOR EEN VERLOREN SOLDAAT (FOR A LOST SOLDIER) is a startlingly frank look at a young boy's love affair with a Canadian soldier during the last days of World War II. Thirteen-year-old Jeroen (Maarten Smit) is sent by his parents from his home in Amsterdam to the countryside because of the food shortages in the cities. He is there when the Allied troops liberate the Netherlands, effectively ending the war for the Dutch people. Jeroen meets and is immediately attracted to Walt (Andrew Kelley), one of the Canadian soldiers. The resulting love affair is handled with extraordinary sensitivity and frankness; this story would never have been filmed in the US. Despite Jeroen's being underage, there is no suggestion of child abuse; indeed, at certain points the film makes clear that the young boy is pursuing the older man. Told in flashback, this achingly romantic film has a dreamlike quality that leaves you wanting more.",
         "The Film \" For A Lost Soldier \" has established itself as a classic. Based on the autobiography of Rudi van Danzi who writes of his early experiences in war torn Europe. He shares his boyhood and how he was separated from his family, sent to the dutch countryside for safety. A lonely, shy youth, he shares the freedom of his liberated country with Canadian soldiers. One of which realizes the boy's 'special' loneliness and befriends him. In the process, the two share a brief forbidden love, establishing the later adult memories which Danzi uses to revitalizes his depleted inspiration. Seen by some, as perverted, the film is nevertheless readily accepted by many others as a heartwarming and sympathetic view of youthful homosexuality. The author, director and actors earn fulsome praise. *****",
         "Loosely based on the autobiography of Rudi van Danzi, FOR A LOST SOLIDER tells the story of a Dutch boy's emotional and sexual relationship with a young adult American solider during World War II. The film presents the relationship as a loving and often magical one--and asks the viewer to consider if such relationships are intrinsically abusive or if they might, in extraordinary instances, have validity and even integrity. It should be very obvious that the subject and issues raised are likely to provoke a knee-jerk reaction in most people--but even so, FOR A LOST SOLDIER has remarkable delicacy. The film is not explotational in any way, it is beautifully acted and filmed, and the difficult material is handled by the director, writer, and cinematographer with considerable grace. All of this said, however, the film is so careful to avoid the obvious pitfalls that in some respects it fails to make any significant statement. What ultimately emerges is a memory--the film is presented as an extended flashback--but exactly how that memory reverberates in present time is vaguely expressed at best. And while the film does not consider this particular relationship to be deliberately abusive, it begs but never answers the question of intrinsic abusive, leaving the viewer to do battle with that knotty issue entirely on their own. Those who watch FOR A LOST SOLIDER thoughtfully and with an open mind will find it forces them to define their own ideas about what is and is not abusive. This may actually be point of the film, to motivate an examination of personal values--but if so it is a point made by a very, at times almost impossibly indirect implication. Recommended for sophisticated viewers, but even they are more likely to find it more problematic than substantial. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "I was happy that I was able to see this movie. I was very moved by it, by the truth of the way the relationship between the boy and the man was shown. I was also happy to see it on the IMDb, and know that Mothers Against Drunk Drivers, etc., had not been able to get all the tapes burned. The wonderful thing about the movie is that it avoids judgment-- negative or positive--about the relationship. The relationship happened. The people involved were not bad. And yet, the fact that the boy never got over the love of that man suggests the inherent inbalance in that type of relationship. Do you think the soldier went through the rest of his life trying to find the boy? At any rate, these are just my questions. The movie is innocent, and does not make judgments, ask questions, or give answers, as befits a beautiful work of art. This movie needed to be made.",
         "I will be the first to admit that the subject matter is a bit risqué for the typical American movie goer. However, keep in mind that this is told exclusively from the viewpoint of the child. It is also done in a realistic and yet romantic way. The child is obviously longing for comfort and security, having been removed from the security of his family during WWII. In addition to being placed into a foster home, a pubescent Jeroen finds himself realizing his budding sexuality is that of one who is attracted to the same sex, which also adds to the feelings of loneliness and isolation. This film deals with a difficult topic, but does it in a way that simply tells a story with enormous feeling and sophistication. It reminds me of being a young man and wondering what it would be like to feel safe and comforted in the arms of someone older with whom I had complete trust and with whom I was enamored. Not everyone will see it this way - only the pure of heart.",
         "With all the furor over \"Lolita,\" one might think a film such as \"For a Lost Soldier,\" the story of a barely pubescent Dutch boy who has a sexual affair with a Canadian soldier in the closing days of WWII, would raise a few eyebrows as well. Perhaps there is a different standard for the relationship between an \"older\" man (albeit, in this case, an older man barely out of his teens) and a child. But, for those inclined to explore this issue on film, \"For a Lost Soldier\" does an admirable job of making such a relationship seem acceptable, and perhaps even inevitable, in view of the hysteria that accompanied the Liberation of Europe by the Allied troops. The relationship between Walt and Jaroen seems particularly idyllic when contrasted with those of Walt's comrades-in-arms with the village girls, who graduate almost overnight from schoolgirls to strumpets. If a book version exists, I look forward to reading it.",
         "The many favorable reviews hailing this film as a cinematic delight are well taken. The delicate subject matter of a brief romantic relationship between an allied WWII soldier and a young boy in the occupied Nehterlands received a beautiful treatment. Without becoming lurid or vulgar, it is implied that the innocent \"child\" and the young soldier engaged in a sex act. Many layers of sub-plots surround the story. The people in the village setting appear deeply religious, constantly learning how to be proper followers of Scriptural guidance. Sermons given to the locals, amidst the visiting soldiers are both thankful for the liberators' arrival, yet warning the \"young women\" not to be tempting these men to be lead astray. It was a subtle switch from preaching in Englsih, to the native Dutch that showed who the audience for that particular part of the sermon was. There are many references to sexual tensions. The teenage boys suddenly notice the physical beauty in teenage girls. Without doubt, there was plenty of \"fraternizing\" between soldiers and local women. The scene where the young main character is out \"exploring\" with a slightly older boy is charged with sexual innuendo. The boy's \"step father\" is quite observant about the \"goings on\", yet offers no direct objections, only indirect and vague advice. The question of whether a mere child can give consent to sexual activity with an adult remains. The picture of the soldiers who came to liberate the town is one of men who felt entitlement. They felt they had every right to \"have fun\" after saving the people from their evil oppressors. Although the young girls, and even our 12 year old main character, were willing participants in any \"affairs\", the sense that the soldiers felt entitled to receive whatever they desired in exchange for their desperately needed Military help, and the many hand-outs of Life-Savers, Gum, Cigarettes etc. changes nothing about their feeling of power over the situation. For a grown man, a love affair of a few days can hardly be considered \"love\", but for a child whose innocence is forever lost, this is an affair they will never forget. Love is something not to be trifled with. A child's innocence should be regarded with no less respect. Whatever the \"feelings\" of the heart may have been, a 12 year old does well to give it a bit more time before seeking that first love.",
         "A haunting film, sympathetically tackled from the child's perspective. It seems that there are large (and probably important) sections of the book which are not covered in the film. It is difficult, therefore, to completely understand Jeroen's feelings for his 'buddy'. Whilst the boy's distance from his parents (mother only?) as an evacuee is clear early on there would appear to be a loneliness which is not truly explored. Jeroen gains some attachment to the (father) man of the house whilst appearing alienated from the children (especially the son) and the youngsters evacuated with him. One is left with the impression that this is a genuine love and true friendship (which both protagonists need - they are both a distance from their families after all) between a boy and a young man and there is no sense of the 'darker side' of how that relationship was initiated by the older of the two - albeit the one muted sex scene would not have been shown in a UK-made film I am sure. The man does not handle his departure well. If he truly cared for the boy then he certainly did not prepare him for the loss which impacted the rest of Jeroen's life. I would like to read the book - but there appear to be only two in the world for sale at extortionate prices. This film needs a sympathetic viewing from those whose own lives may mirror some of the events in some way.",
         "I have watched this film many times and I recently viewed it again. The only really interesting part of the movie is the relationship between the young boy and the soldier. Everything else that happens in the film is really just to establish why this young man would be drawn to someone kind and caring. What I wish would have been delved into more was how the soldier came to feel the way he does about the kid. He talks a little about his past with his father and mother but never really explains himself personally. He does not look like he would have ever had a problem getting a girl, so his \"prediliction\" becomes even more a mystery. I really applaud the fact that the film maker was able to tell this story so sensitively without it being lurid. It is a shame I think that a film like this could never have been made in America, \"the land of the free\".",
         "I don't know if a boy of 12 can be attracted sexually to an adult male as was depicted in this movie. For me it raises the question of at what age does a person who is going to grow up gay become interested in someone of the same sex. It is obvious that the young soldier takes advantage of the innocence of a youngster although it is suggested too that the feelings of the soldier are more than merely sexual. The dance scene implies that there was love. The end of the movie and the title implies that the boy remembers the soldier in later years and as a mature adult with affection and perhaps longing so one is tempted to conclude that relationship with the young soldier though brief was meaningful. I was reminded of the relationship of the boy and the old man in Cinema Paradiso which although certainly not of a sexual nature was also very important to both the boy and the man. For a Lost Soldier gave me much to think about and is likely to provoke much thought in the intelligent viewer."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "Sigma Film Productions",
         "Algemene Vereniging Radio Omroep (AVRO)"
      ],
      "summaries": [
         "The story of a romantic relationship between a grown-up and a child. Set in the Netherlands near the end of WWII, the film is a flashback recalling an adolescent relationship between Jeroen and a Canadian soldier. A difficult subject handled with style and feeling.",
         "Set in The Netherlands at the end of WW II, this touching story, told in flashbacks, explores the complex and romantic relationship between an adult soldier and a displaced, lonely adolescent boy."
      ],
      "budget": 0
   },
   "movielensId": 5430,
   "movielens": {
      "languages": ["Nederlands"],
      "releaseDate": "1992-05-22",
      "dvdReleaseDate": "2002-05-28",
      "directors": ["Roeland Kerbosch"],
      "runtime": 92,
      "movieId": 5430,
      "title": "For a Lost Soldier",
      "mpaa": "",
      "actors": [
         "Maarten Smit",
         "Jeroen Krabbé",
         "Andrew Kelley",
         "Freark Smink",
         "Elsje de Wijn",
         "Derk-Jan Kroon",
         "Wiendelt Hooijer"
      ],
      "imdbMovieId": "0108504",
      "originalTitle": "Voor een Verloren Soldaat",
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of a romantic relationship between a Canadian soldier and a child set in the Netherlands near the end of WWII. Told in flashback from the present day, the child, now a man, is still seeking his lost soldier.",
      "tmdbMovieId": 27052,
      "avgRating": 3.21429,
      "releaseYear": "1992",
      "numRatings": 35,
      "posterPath": "/qEuZhNnG3fPkDleW3aZQTyf31uX.jpg"
   }
}