{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0051739",
      "video": false,
      "title": "The Horse's Mouth",
      "recommendations": [
         37198,
         193315,
         73307,
         87060,
         75637,
         27917,
         50031,
         46047,
         42744,
         37124,
         43122,
         172908,
         215032,
         47675,
         38023,
         53769,
         268159,
         42214,
         16089,
         77368
      ],
      "backdrop_path": "/38VrpWOO55HhdvnHo1T4bbKiEaS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Gulley Jimson",
               "gender": 2,
               "credit_id": "52fe462fc3a36847f80f1807",
               "name": "Alec Guinness",
               "profile_path": "/nv3ppxgUQJytFGXZNde4f9ZlshB.jpg",
               "id": 12248,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Dee Coker",
               "gender": 1,
               "credit_id": "52fe462fc3a36847f80f180b",
               "name": "Kay Walsh",
               "profile_path": "/4CmjZwzMKyAXgjxb7w12jt8Osgv.jpg",
               "id": 67615,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sara Monday",
               "gender": 1,
               "credit_id": "52fe462fc3a36847f80f180f",
               "name": "Renée Houston",
               "profile_path": "/6bOYfHbveukvbhIrW5mSC7jEx5L.jpg",
               "id": 39393,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Nosey",
               "gender": 0,
               "credit_id": "52fe462fc3a36847f80f1813",
               "name": "Mike Morgan",
               "profile_path": null,
               "id": 145271,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sir William Beeder",
               "gender": 2,
               "credit_id": "52fe462fc3a36847f80f1817",
               "name": "Robert Coote",
               "profile_path": "/erN2R5UYBvVsYfnscQi7AEEXEoP.jpg",
               "id": 92908,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Abel",
               "gender": 2,
               "credit_id": "52fe462fc3a36847f80f181b",
               "name": "Michael Gough",
               "profile_path": "/lSADK0gjUtcq4B6zKIUwB3SofSP.jpg",
               "id": 3796,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lday Beeder",
               "gender": 0,
               "credit_id": "52fe462fc3a36847f80f181f",
               "name": "Veronica Turleigh",
               "profile_path": null,
               "id": 136897,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Capt. Jones",
               "gender": 2,
               "credit_id": "52fe462fc3a36847f80f1823",
               "name": "Reginald Beckwith",
               "profile_path": "/16w2j2DPVmWRxhXlap0hoh29pqH.jpg",
               "id": 93164,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "A.W. Alabaster",
               "gender": 2,
               "credit_id": "52fe462fc3a36847f80f1827",
               "name": "Arthur Macrae",
               "profile_path": null,
               "id": 985305,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5708133dc3a3681d3a0000fa",
               "name": "Albert Fennell",
               "profile_path": null,
               "id": 68426,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "575d3c749251412b0c002b4d",
               "name": "John Bryan",
               "profile_path": null,
               "id": 1167476,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe462fc3a36847f80f17f7",
               "name": "Ronald Neame",
               "profile_path": "/6ET8GlWzxTkQu5sEH24I0UZ6IrG.jpg",
               "id": 7501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe462fc3a36847f80f17fd",
               "name": "Joyce Cary",
               "profile_path": null,
               "id": 145270,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe462fc3a36847f80f1803",
               "name": "Alec Guinness",
               "profile_path": "/nv3ppxgUQJytFGXZNde4f9ZlshB.jpg",
               "id": 12248,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "570813449251415bc3000109",
               "name": "Ronald Neame",
               "profile_path": "/6ET8GlWzxTkQu5sEH24I0UZ6IrG.jpg",
               "id": 7501,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570813659251415bcf000109",
               "name": "Kenneth V. Jones",
               "profile_path": null,
               "id": 31291,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5708136cc3a3681d3a000102",
               "name": "Arthur Ibbetson",
               "profile_path": null,
               "id": 3454,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "570813749251415bc3000111",
               "name": "Anne V. Coates",
               "profile_path": null,
               "id": 6346,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5708137cc3a3681d2c00011a",
               "name": "William C. Andrews",
               "profile_path": null,
               "id": 1078629,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57081384c3a3681d3a000106",
               "name": "Julia Squire",
               "profile_path": null,
               "id": 1295613,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5708138b9251415bc500010e",
               "name": "Harold Fletcher",
               "profile_path": null,
               "id": 108811,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "57081392c3a3681d24000123",
               "name": "Pearl Tipaldi",
               "profile_path": null,
               "id": 30763,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5708139bc3a3681d32000101",
               "name": "R.L.M. Davidson",
               "profile_path": null,
               "id": 1602840,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "570813a4c3a3681d29000136",
               "name": "Colin M. Brewer",
               "profile_path": null,
               "id": 1044184,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.803658,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 43139,
      "vote_count": 13,
      "budget": 0,
      "overview": "Gulley Jimson is a boorish aging artist recently released from prison. A swindler in search of his next art project, he hunkers down in the penthouse of would-be patrons the Beeders while they go on an extended vacation; he paints a mural on their wall, pawns their valuables and, along with the sculptor Abel, inadvertently smashes a large hole in their floor. Jimson's next project is an even larger wall in an abandoned church.",
      "similar": [],
      "original_title": "The Horse's Mouth",
      "runtime": 95,
      "poster_path": "/d51I6HuDzwEk5CWZE4E4Uegz3WF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Knightsbridge Films",
         "id": 20544,
         "origin_country": ""
      }],
      "release_date": "1958-11-11",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Smart Alec ... Sheer madness and all Guinness! The man's a genius ...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ronald Neame"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Joyce Cary",
         "Alec Guinness"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051739/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyODM5NTk3Ml5BMl5BanBnXkFtZTcwMTE0OTYxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Alec Guinness, Kay Walsh, Renee Houston | See full cast and crew »"],
      "reviews": [
         "My late wife, an artist, loved this film, and it gave me such insights into the way her mind worked. Guiness is wonderful; for once we see many levels of the character he portrays. Kay Walsh is so touching as the woman in his life, while Mike Morgan makes the perfect art groupie. It's funny to see Dr. Pastorious in old age; he has barely changed since Bride of Frankenstein. The humor is gentle and quiet except for the studio renovation scene, but it is when Gully stands in front of a canvas that the truth of this film comes out. His almost soliloquy on the human foot; the scene where he shrugs and says that was not what he was trying to say, after he has ruined the toff's wall, these are priceless and our entry into an artist's mind. When the houseboat sets sail down the Thames, to the comment about the sea by the looney who pipes Gully aboard is a bit of perfection set on celluloid. He stands there, framing a vision of another canvas on the hull of a freighter, while reciting this wonderful doggerel that I always get mixed up when I try to say it, and all the while Nosey and Sara spur him on. I've never read the book and wonder if this represents his death, but I take from it what I will. One other thought: there are certain films shot on location that should be filed away as time/place documentaries. This one is a perfect example: London 1958.",
         "One of the best movies about art ever made, `The Horse's Mouth' examines the relationships between vision and creation, between art and commerce, and \u0096 most importantly \u0096 between art and criticism; and makes us laugh at the same time. Alec Guinness is inspired (when was he ever not inspired, come to think of it) as Gully Jimson, a painter of unlimited ideas who has met with only limited success in the art marketplace \u0096 partly because he is so contemptuous of that marketplace. His search for the perfect wall on which to paint, and the subject matter he ultimately winds up painting on one of the walls found in his search, is priceless. The Joyce Cary novel, and its companions in the Jimson trilogy (`Herself Surprised' and `To Be a Pilgrim') are well worth reading, but this movie is a very British, very engaging classic. In many ways, it's the movie that `Pollack' (good though it was) should have been.",
         "Highly original and entertaining, this film explores the bizarre world of artist Gulley Jimson (Alec Guinness) whom we meet as he is released from jail. He's a scammer and a reprobate, but he's also a great artist who doesn't believe in art. Yet he is compelled to paint. With the help of maybe girl friend (Kay Walsh) they try to track down the paintings sold on the cheap to pay off the debts of his former wife (Renee Houston). The art dealer (Ernest Thesiger) is a crook and has cheated everyone by telling them the paintings are worthless. So Gulley tries to find an art patron who will support him. He finds an older couple of patrons but after they go on holiday, he moves into their apartment and trashes it while he paints a mural. Gulley is always looking for \"a big wall\" on which to paint his big paintings and finally finds the side of a building about to be demolished. His compulsion is so great, he MUST paint on this wall but has no money, so he \"sells\" sections of the wall to amateurs who combine to create a fabulous urban mural (to his design). This project seems to assuage his compulsions, but after the wall's destruction he's off to find a new horizon... or is he? This is one of Guinness' great performances. In a comic role with serious undertones, few actors were ever better than Guinness, and he grabs onto this quirky role with great gusto. Indeed, Guinness even wrote the script (based on a novel by Joyce Cary). At age 44, he's totally believable as the grizzled 60-ish artist. The great and underrated Kay Walsh turns in a ferociously funny turn as the friend he owes money to. Walsh's character lives in fury that she has been cheated and short-changed by life. Together, Walsh and Guinness burn up the screen with their acting talent. Co-stars add just the right touch. Houston and Thesiger are old pros. Michael Gough plays the obsessed sculptor. Veronica Turleigh and Robert Coote are fun as the art patrons. Gillian Vaughan is a hoot as the model. May Hallatt is funny as the scrub woman. A special word must be said for Mike Morgan who plays Nosey, the adoring and gangling young man who follows Gulley everywhere. Morgan is just terrific here with just the right blend of awkward youth and that special British eccentric comedic touch. In his late 20s, Morgan died suddenly of meningitis before the film was finished, and several of his scenes were dubbed by another actor. This is a great film.",
         "\"Horse's Mouth\" certainly stands up well in it's advanced age; at 45 years old it has remained as timeless as any of the great comedic films. One IMDb writer has tagged Gully as a \"vulgar\" painter, which goes to show that the sensitivities this film violated are still around. Pinching your loving ex's bum and tickling the rich lady's knee (shades of Groucho), though, are pretty tame today. Gully Jimson is a rich character, Chaplin-like, who single-mindedly pursues painting while disillusioning aspiring young Nosey about the artist's life. All growled on tiptoes by one of film's classic great actors. Jimson is a man who's given up all else, including health, wealth, conventional relationships, to live in a leaky houseboat with a vision. But as the story develops it, like all great literature, manages to puncture almost all of life's rationalizing balloons. Jimson is valorized as is Don Quixote, without suggesting that his hero's journey is a painless one. All is set in a colorful environment with a delightful if conventionally unpolished cast, all the improbably gleeful turns that make the Marx movies so delightful, and a director who contrives seamlessly with Guiness to create a clever and hilarious marvel that can be enjoyed over and over. Heck yeah, there's even a chase scene! And pull your socks up! The DVD version includes a short by Pennebaker that feels as fresh and contemporary, accompanied by a Duke Ellington tune, which played along with \"Horse's\" original release.",
         "This is probably my favorite movie. It may be overstatement to call a mere British comedy a timeless classic, but this outstanding movie, beneath its raucously madcap surface, has some very serious things to say about what it means to be an artist, to be driven by visions while living in a society that doesn't care. I think Guinness is the greatest actor of the century, and that his performance here as the maddening, irascible, impossible Gulley Jimson is the zenith of his movie roles. They don't make them like this anymore.",
         "Although most Americans have little knowledge of his work other than Star Wars, Alec Guinness produced an amazing body of work--particularly in the 1940s-1950s--ranging from dramas to quirky comedies. I particularly love his comedies, as they are so well-done and seem so natural and real on the screen--far different from the usual fare from Hollywood. I first saw this movie when I was about 13 or so, and didn't appreciate it very much. Years later, when I became fascinated with Guinness' comedies, I decided to give it another chance. And boy am I glad I did!! The movie concerns the life of an extremely edgy and rather nasty artist. Guinness really plays this up and creates one of the quirkiest and funniest characters I have ever seen. In essence, the man is a rascal that is driven to create his art regardless of what it takes to get it done! What I missed the first time I saw the film were the extremely catchy music and the amazing art created for this movie. I am not the biggest fan of modern art, but the second time i saw the movie I really liked most of the works done for the movie--it just was a darn shame that much of it was destroyed in the course of the movie! In addition to music and art, the performances throughout of all the actors was nearly perfect. Finally, the version of the movie I saw last was from the Criterion Collection. Get this version!!!! It had so much wonderful background information about the actual art, the making of the movie, and interesting background information--such as how they got the musical score WITHOUT having to pay royalties and the incredibly sad tale of a magnificent performance by a young supporting actor that did not live to see the finished product.",
         "It's very simple. This film has meant a lot to me. An enlightened art teacher from high school played this for us in class. I haven't been the same since. I can't say I know much of Alec Guinness's work, but I count him as a personal favorite based on this performance alone. I recommend it to anyone who wants to be creatively inspired.",
         "I love this movie; it's on my all-time (ever-growing) list of the ones I love to see again and again. Not very surprising, I also loved reading Joyce Cary's wonderful book. However fine a film version of a work of literature, there is always more in the text. One of the glories of this film is how much of Cary's book it brings to full life. I didn't know, until seeing it in someone else's comment here, that \"The Horse's Mouth\" is only one book of a trilogy about Gulley Jimson. I will seek out the others as soon as possible. To the person whose name i didn't think to write down when reading your comment: Thank you very much.",
         "Ingenious, fun, silly, playful, entertaining, strange. All of these things represent not only the movie, but of Alec Guinness' portrayal of Gully Jimson, a grainy, foul mouthed old artist, trying to make it in life through his paintings. We're introduced to him from jail, and it unfolds in the sense where learning about him is also either liking or hating what life has brought him to be. Just make sure that you're not going to be an artist, or his protégé (who takes an awful lot of bullying). This is another forgotten film in time in that it's perfect casting, and perfect direction. It's an effortless viewing movie that will bring much satisfaction to viewers of any age, who aren't familiar with Alec Guinness' work besides the obvious. His passionate, sometimes surly characterization of a brilliant painter is one that should last for the ages.",
         "Confession time, I first saw 'The Horse's Mouth' around ten or twelve years ago, one afternoon on British television and hated it. Alec's \"Gulley Jimson\" seemed to me to be very un-likable and I found myself unable to get the point of the film. However, re-watching this on DVD, I found it to be far, far better than I remembered and something of a revelation. I found myself identifying with \"Gulley\" this time around and appreciating Alec's subtle performance (to the extent that I was genuinely sad to see the film end). Guinness is backed by two astonishingly fine performances by Walsh and Houston (it's Rene's finest performance, for someone with a tendency to play 'broad' here she is remarkably subtle). All in all, a wonderful if sadly under-rated film and one equal to Alec's best Ealing work."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Knightsbridge Films"],
      "summaries": [
         "Gulley Jimson is broke, difficult, conniving, uncouth, and a welcher - but an artist. The visions in his head may not really satisfy him when realized, but the quest continues, for the perfect wall. The Beeders leave for six weeks of vacation and return to find a 7000 pound committment and the wall of their living room a national treasure, even though living with a wall mural of feet is not their cup of tea. Then - in a bombed out church scheduled for demolition - THE wall that can become his vision.",
         "A somewhat vulgar but dedicated painter searches for the perfect realization of his artistic vision, much to the chagrin of others."
      ],
      "budget": 0
   },
   "movielensId": 5436,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1958-11-11",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Ronald Neame"],
      "runtime": 95,
      "movieId": 5436,
      "title": "The Horse's Mouth",
      "mpaa": "",
      "actors": [
         "Alec Guinness",
         "Kay Walsh",
         "Renée Houston",
         "Mike Morgan",
         "Robert Coote",
         "Michael Gough",
         "Veronica Turleigh",
         "Reginald Beckwith",
         "Arthur Macrae"
      ],
      "imdbMovieId": "0051739",
      "originalTitle": "The Horse's Mouth",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["Dzt5dMoS5dA"],
      "plotSummary": "Gulley Jimson is a boorish aging artist recently released from prison. A swindler in search of his next art project, he hunkers down in the penthouse of would-be patrons the Beeders while they go on an extended vacation; he paints a mural on their wall, pawns their valuables and, along with the sculptor Abel, inadvertently smashes a large hole in their floor. Jimson's next project is an even larger wall in an abandoned church.",
      "tmdbMovieId": 43139,
      "avgRating": 3.49065,
      "releaseYear": "1958",
      "numRatings": 107,
      "posterPath": "/d51I6HuDzwEk5CWZE4E4Uegz3WF.jpg"
   }
}