{
   "tmdb": {
      "original_language": "fi",
      "keywords": [],
      "imdb_id": "tt0890882",
      "video": false,
      "title": "Man's Job",
      "recommendations": [
         22326,
         46927,
         128135,
         140036,
         38834,
         41142,
         50989,
         54764,
         39008,
         108762,
         114172,
         161456,
         20548,
         102249,
         58764,
         35009,
         51190,
         31166,
         36769
      ],
      "backdrop_path": "/jxcOTTJfmOtqIIVWmP57G3EXCt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Juha",
               "gender": 2,
               "credit_id": "52fe43dac3a368484e001fd3",
               "name": "Tommi Korpela",
               "profile_path": "/r7C2m7PTcTyLf70mQQl49BwnmQm.jpg",
               "id": 93004,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Katja",
               "gender": 0,
               "credit_id": "52fe43dac3a368484e001fd7",
               "name": "Maria Heiskanen",
               "profile_path": "/xFfZ32K310cp9IMYvzhEelQR8yp.jpg",
               "id": 16776,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Olli",
               "gender": 2,
               "credit_id": "52fe43dac3a368484e001fdb",
               "name": "Jani Volanen",
               "profile_path": "/wbERJ4e09APzsb1uppXusZGpfD2.jpg",
               "id": 88856,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jamppa",
               "gender": 0,
               "credit_id": "56e2fd3c9251416d490001c9",
               "name": "Stan Saanila",
               "profile_path": null,
               "id": 123400,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43dac3a368484e001fcf",
               "name": "Aleksi Salmenperä",
               "profile_path": "/ctFETInkAp4Yb39IdTXJR7vdyUH.jpg",
               "id": 93003,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56e2fd279251416d460001b2",
               "name": "Aleksi Salmenperä",
               "profile_path": "/ctFETInkAp4Yb39IdTXJR7vdyUH.jpg",
               "id": 93003,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.970569,
      "production_countries": [{
         "iso_3166_1": "FI",
         "name": "Finland"
      }],
      "id": 20163,
      "vote_count": 9,
      "budget": 0,
      "overview": "Juha is 38 years old and has three small children and a depressed wife. He sees himself as strong and believes a man should provide for his family. But one day Juha is fired from his job. Ashamed, he weaves a web of lies to hide the fact from his family. With the help of his friend Olli, Juha begins prostituting himself to support his wife and children. With this he makes in two hours what it took him two days to earn before. The shame and deception mushroom, but the pay from the new profession seems to offset the downside.",
      "similar": [],
      "original_title": "Miehen työ",
      "runtime": 103,
      "poster_path": "/p6GpLrvjBWpdorKnVIo7q6jKVj8.jpg",
      "spoken_languages": [{
         "name": "suomi",
         "iso_639_1": "fi"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Blind Spot Pictures Oy",
         "id": 7330,
         "origin_country": ""
      }],
      "release_date": "2007-02-23",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Finland",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Aleksi Salmenperä"],
      "runtime": 97,
      "synopsis": "Juha is 38 years old and has three small children and a depressed wife. He sees himself as strong and believes a man should provide for his family. But one day Juha is fired from his job. Ashamed, he weaves a web of lies to hide the fact from his family. With the help of his friend Olli, Juha begins prostituting himself to support his wife and children. With this he makes in two hours what it took him two days to earn before. The shame and deception mushroom, but the pay from the new profession seems to offset the downside.",
      "writers": ["Aleksi Salmenperä"],
      "originalLanguage": "Finnish",
      "imdbLink": "http://www.imdb.com/title/tt0890882/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MDMxNjQ4OF5BMl5BanBnXkFtZTcwMjk2MDg5MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Tommi Korpela, Maria Heiskanen, Jani Volanen | See full cast and crew »"],
      "reviews": [
         "Juha (Tommi Korpela) is the middle-aged father of two and the husband of a depressed wife. Too afraid to tell his depressed wife that he has lost his job as a construction worker, Juha tries to make a living by offering his services to private customers, with little success. When he's contacted by a slightly older woman who turns out to want more than just the reconstruction of her living room, Juha secretly joins the sex industry in to be able to support his family. This provides the setting for a story about the responsibilities of a family man and shame. Movies about the sex industry tend to fall into four main categories. There are moralistic tales about the depravity and dangers of the industry, exploitative movies that use the theme as an easy excuse for excessive nudity, light-hearted comedies about the liberation and empowerment through open sexuality, and realistic stories about the cruel and abusive nature of prostitution. Strangely enough, Miehen Työ doesn't really fit into any of these categories. On the contrary of what one might think after reading the summary, it's a remarkably un-erotic film. The theme of male prostitution isn't the focus of the film, but a mere extension to the net of lies Juha spins when he tries to hide his family the fact that he's unemployed. This story isn't about sex - it's about humiliation and shame that stems from Juha's failure to do what he believes is expected of him. What's a man to do when he can't even do his duty? Ultimately, the movie becomes a study of the roles of a man - or the job of a man, as the title puts it. Is it really more important for a good husband and a father to keep the money coming than to actually be there for his family when they need him the most? Overall, Miehen Työ is a bleak, bleak movie about the harsh reality of everyday life. It isn't light-hearted entertainment, but I personally enjoyed it. Tommi Korpela is fantastic in the lead role, portraying the everyman who paradoxically degrades himself to preserve his pride. I also liked Jani Volanen as Juha's troubled best friend Olli, who discreetly tries to replace Juha by spending time with his family when Juha himself is gone.",
         "I recently saw this at the 2008 Palm Springs International Film Festival. Director/Writer Aleksi Salmenperä, Producer Tero Kaukomaa and Actor Jani Volanen were on hand for a Q&A following the film. This film was Finland's official entry for Best Foreign Language Film for the Academy Award and is the second feature for Salmenperä. This is a small film but very good and features a great cast with plenty of interesting characters. Juha (Tommi Korpela) is a big, strong stone worker at a factory who has resorted to stealing company equipment to help make ends meet at home where he has three young children and a depression medicated wife Katja (Maria Heiskanen). After Juha loses his job he decides to try his luck as a handyman doing bulletin board solicited home repairs. With the help of his best friend Oli (Jani Volanen), his new job quickly evolves into that of a male prostitute for mature women with Oli serving as his secretary and chauffeur and another friend creating a website to offer his services on. Katja of course, must not find out about Juha losing his job and his new line of work so another friend covers for him at his old job should his wife call there and Juha leaves the house early every day to give the illusion of his typical job routine and changes into his old work clothes before he comes home. Since much of his work as a male call guy is at night he concocts a story that he is doing a home repair job after work for extra money that will take several months to complete. There are plenty of comic situations here but it is also a gritty drama and Salmenperä did a lot of research into the world of heterosexual male prostitutes to come up with his story which give a believability to the clientèle Juha encounters. Nicely photographed by cinematographer Tuomo Hutri, I would give this an 8.0 out of 10 and recommend it.",
         "At the time of writing IMDb advise that the UK title for this film is, 'A Man's Work' but it was shown as, 'A Man's Job' at its London Film Festival screening yesterday, which I would have thought was a better title. As for the film itself, it is rather difficult to enjoy because of all the unhappiness on display. It is an insightful and compassionate piece of work but hard to get very close to those involved. Finland sits twixt Scandinavia and the old Soviet block and have until the first world war been first part of Sweden and then Russia. We consider Scandinavians to be prone to depression, perhaps because of the cold and darkness and maybe Finns suffer more because of the added element of schizophrenia. Anyway, everybody here seems dysfunctional and when you discover that the film tells of its main character getting involved in offering services to older ladies and even a Down's syndrome sufferer, things don't get much more cheery. Its well done and for the most part, almost convincing but it is badly let down by the ending. I assume that this is intended as a happy ending and perhaps to the Finns it is but to me and my fellow, stunned into silence, cinema goers, it seemed a desperately sad end indeed.",
         "This man's job is even more burdensome as it may appear. It extends beyond giving up a man's pride and dealing with a pool of unattractive and unconventional clientele. It takes him even more to protect his loved one, to an extent that he accepts a child not of his own, conceals his anger towards a man who sleeps with and impregnates his wife, hides his worries of losing his job and changing his \"career\" from his wife to protect her from aggravated depression. This is the courage and conviction of a person who sacrifices himself to protect and please his loved one. A hilarious and entertaining film which is romantic at its heart, with a bleak ending showing the harsh reality that well-meaning sacrifice is not always reciprocated and the poor often gets poorer. Although the ending shoot in the ambulance is sweet, what happens to the family afterwards is probably less so.",
         "On the face of it this is every schoolboy fantasy in the world - to have women eager to pay you for sex. Of course those schoolboys think in terms of their peers rather than older dysfunctional women, indeed to a schoolboy 25 is 'old' so that they would quickly become disabused by the lineup here, which includes a victim of Downs' Syndrome who is also the youngest 'client' on display. If none of the women are actually ugly and some not even plain there is still a moral question which must be addressed. Juhe is both husband and father as well as being jobless and stumbles into his new 'profession' by chance although having done so he takes to it like a duck to water. The film is well made and largely sympathetic and unerotic but the question remains is this a job for a nice Finnish boy and the answer must be no."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Blind Spot Pictures Oy",
         "Finnish Film Foundation",
         "Nordisk Film- & TV-Fond"
      ],
      "summaries": [],
      "budget": 1350000
   },
   "movielensId": 54378,
   "movielens": {
      "languages": ["suomi"],
      "releaseDate": "2007-02-23",
      "dvdReleaseDate": "2007-07-04",
      "directors": ["Aleksi Salmenperä"],
      "runtime": 103,
      "movieId": 54378,
      "title": "Man's Job",
      "mpaa": "",
      "actors": [
         "Tommi Korpela",
         "Maria Heiskanen",
         "Jani Volanen",
         "Stan Saanila"
      ],
      "imdbMovieId": "0890882",
      "originalTitle": "Miehen työ",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Juha is 38 years old and has three small children and a depressed wife. He sees himself as strong and believes a man should provide for his family. But one day Juha is fired from his job. Ashamed, he weaves a web of lies to hide the fact from his family. With the help of his friend Olli, Juha begins prostituting himself to support his wife and children. With this he makes in two hours what it took him two days to earn before. The shame and deception mushroom, but the pay from the new profession seems to offset the downside.",
      "tmdbMovieId": 20163,
      "avgRating": 3.08929,
      "releaseYear": "2007",
      "numRatings": 56,
      "posterPath": "/p6GpLrvjBWpdorKnVIo7q6jKVj8.jpg"
   }
}