{
   "tmdb": {
      "original_language": "ro",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "romanian new wave",
            "id": 209983
         }
      ],
      "imdb_id": "tt0809407",
      "video": false,
      "title": "12:08 East of Bucharest",
      "recommendations": [
         42516,
         48256,
         189587,
         196396,
         194039,
         15377,
         190725,
         107426,
         179000,
         132378,
         105352,
         209677,
         46982,
         231035,
         109632,
         148791,
         195074,
         109815,
         194272,
         144442
      ],
      "backdrop_path": "/6pdkHiKxjl7drdMctOIULD27Owi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Emanoil Piscoci",
               "gender": 0,
               "credit_id": "52fe4486c3a368484e027edd",
               "name": "Mircea Andreescu",
               "profile_path": null,
               "id": 438968,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Virgil Jderescu",
               "gender": 2,
               "credit_id": "52fe4486c3a368484e027ee1",
               "name": "Teodor Corban",
               "profile_path": "/pwUTD7HMK45B8Mo9R5DyMm6HIts.jpg",
               "id": 479941,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Tiberiu Manescu",
               "gender": 2,
               "credit_id": "52fe4486c3a368484e027ee5",
               "name": "Ion Sapdaru",
               "profile_path": "/cVDA2E1lGUorM2TFi9HwgUBQuya.jpg",
               "id": 85227,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Doamna Manescu",
               "gender": 1,
               "credit_id": "52fe4486c3a368484e027ee9",
               "name": "Mirela Cioaba",
               "profile_path": null,
               "id": 429969,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Doamna Jderescu",
               "gender": 1,
               "credit_id": "5682d4aac3a368227b00ab51",
               "name": "Luminița Gheorghiu",
               "profile_path": "/obAYbjfxsY9t3pinft5vH2QzwBJ.jpg",
               "id": 39961,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Vali",
               "gender": 0,
               "credit_id": "5a0b31d4c3a368219c01deb4",
               "name": "Cristina Ciofu",
               "profile_path": null,
               "id": 1923767,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Lica",
               "gender": 0,
               "credit_id": "5a0b31dec3a368210901d78f",
               "name": "Lucian Iftime",
               "profile_path": null,
               "id": 1899149,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Vera",
               "gender": 0,
               "credit_id": "5a0b31e8925141310f01eb13",
               "name": "Annemarie Chertic",
               "profile_path": null,
               "id": 1923768,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Petrica",
               "gender": 0,
               "credit_id": "5a0b31f4c3a36820e901ded5",
               "name": "Petrica Sapdaru",
               "profile_path": null,
               "id": 1923769,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Barman",
               "gender": 2,
               "credit_id": "5a0b31ffc3a368218a022365",
               "name": "Catalin Paraschiv",
               "profile_path": null,
               "id": 1255382,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Chen",
               "gender": 0,
               "credit_id": "5a0b320c92514130ed01e881",
               "name": "George Guoqingyun",
               "profile_path": null,
               "id": 1923770,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Tibi",
               "gender": 0,
               "credit_id": "5a0b3214c3a36821280204d9",
               "name": "Constantin Diţă",
               "profile_path": null,
               "id": 1017315,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Professor",
               "gender": 0,
               "credit_id": "5a0b321e925141311801f94d",
               "name": "Daniel Badale",
               "profile_path": null,
               "id": 1426139,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Vecin",
               "gender": 0,
               "credit_id": "5a0b322892514130cd01fc42",
               "name": "Marius Rogojinski",
               "profile_path": null,
               "id": 1923771,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Maricica Dima (voice)",
               "gender": 0,
               "credit_id": "5a0b3234c3a368210901d832",
               "name": "Aurelia Tocu",
               "profile_path": null,
               "id": 1923772,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4486c3a368484e027ed9",
               "name": "Corneliu Porumboiu",
               "profile_path": "/oHz0OhFerQFZ6n1Blff5976CfoC.jpg",
               "id": 109293,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4486c3a368484e027eef",
               "name": "Corneliu Porumboiu",
               "profile_path": "/oHz0OhFerQFZ6n1Blff5976CfoC.jpg",
               "id": 109293,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "57635c0c9251417b510000f8",
               "name": "Daniel Burlac",
               "profile_path": null,
               "id": 1637147,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "57635c15c3a3680be800033e",
               "name": "Corneliu Porumboiu",
               "profile_path": "/oHz0OhFerQFZ6n1Blff5976CfoC.jpg",
               "id": 109293,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57635c20c3a3680be2000352",
               "name": "Rotaria",
               "profile_path": null,
               "id": 1637149,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57635c28c3a36816a100015f",
               "name": "Marius Panduru",
               "profile_path": null,
               "id": 931382,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57635c4a92514171d500032e",
               "name": "Roxana Szel",
               "profile_path": null,
               "id": 1637150,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57635c53c3a368181b000102",
               "name": "Daniel Raduta",
               "profile_path": null,
               "id": 1145068,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57635c5a92514171da0002fc",
               "name": "Monica Raduta",
               "profile_path": null,
               "id": 1545765,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57635c61c3a3680bee0002e1",
               "name": "Cristina Ilie",
               "profile_path": null,
               "id": 1637151,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "57635c6992514171e700033b",
               "name": "Alexandru Vitzentzatos",
               "profile_path": null,
               "id": 1637152,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.386933,
      "production_countries": [{
         "iso_3166_1": "RO",
         "name": "Romania"
      }],
      "id": 24159,
      "vote_count": 33,
      "budget": 0,
      "overview": "It's the 22nd of December. Sixteen years have passed since the revolution, and in a small town Christmas is about to come. Piscoci, an old retired man is preparing for another Christmas alone. Manescu, the history teacher, tries to keep up with his debts. Jderescu, the owner of a local television post, seems not to be so interested in the upcoming holidays. For him, the time to face history has come. Along with Manescu and Piscoci, he is trying to answer for himself a question which for 16 years has not had an answer: \"Was it or wasn't it a revolution in their town?\"",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         101,
         205,
         141,
         241,
         949,
         550
      ],
      "original_title": "A fost sau n-a fost?",
      "runtime": 89,
      "poster_path": "/59qdoIeW6gINHt6nFw6uyAUhot6.jpg",
      "spoken_languages": [{
         "name": "Română",
         "iso_639_1": "ro"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "42 Km Film",
         "id": 51274,
         "origin_country": ""
      }],
      "release_date": "2006-06-02",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Romania",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Corneliu Porumboiu"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Corneliu Porumboiu"],
      "originalLanguage": "Romanian",
      "imdbLink": "http://www.imdb.com/title/tt0809407/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MjIwMDc2M15BMl5BanBnXkFtZTcwMTUxMTI1MQ@@._V1_SY317_CR14,0,214,317_AL_.jpg",
      "actors": ["Stars: Mircea Andreescu, Teodor Corban, Ion Sapdaru | See full cast and crew »"],
      "reviews": [
         "December 22, 1989. What exactly happened that day in Bucharest? We know Romanian dictator Nicolae Ceausescu left the country bringing about the end of Communism, but, was there ever really a revolt? This might be a touchy subject for a movie to some Romanians. I mean, after all, the movie is asking questions and challenging the country's history. And there are people who are still alive who can tell us what happened. But, Corneliu Porumboiu's feature lenght directorial debut shouldn't cause any controversy. \"12:08 East of Bucharest\" is many things. First of all it is one of the best Romanian movies I have ever seen. It is also one of the best films I've seen in 2006. It is one of the funniest movies I've seen this year and was the best movie I saw at the Chicago International Film Festival this year. But the one thing it is not is a controversial film. What makes a film just as this so good is the way it weaves a serious subject with humor. Who would have thought a subject about the Romanian revolution could have been so funny? Romanians, and really most of us Eastern Europeans (I'm Hungarian) have a very sarcastic sense of humor. And that humor is shown in spades in this film. In fact the audience I saw this film with (and it was a packed house) were also in fits of laughter. I started laughing at myself for laughing. I was even trying to hold it in so I wouldn't disturb the people sitting next to me. The film mostly follows three men, Virgil Jderescu (Teodor Corban) the host of a TV show that is going to discuss the 16th anniversary of that fateful day and his two guest, both of whom claim to have been there, Mr. Manescu (Ion Sapdaru) and Mr. Piscoci (Mircea Andeescu). The first half of the movie introduces these characters to us as each gets ready for the show. The second half of the movie is the TV show itself. I've complained lately that one of the reason Romanian films don't get distributed in America is because Romanians are going away from what they know. The country has tried so hard to maintain the image it is not behind with the times and wants to impress Western society. This is a big mistake. Don't care what Western audiences will think. Just make films about your country and deal with subjects that are meaningful to you (by \"you\" I mean Romanian directors). Earlier this year we saw \"The Death of Mr. Lazarescu\". There was a film that dealt with a \"Romanian\" problem and people all over the world not only enjoyed it, but, were able to relate to it. This, I believe, would happen more often if Romanian directors followed their hearts instead of some demographic. \"12:08 East of Bucharest\" is dealing with a major part of Romanian history and the outcome is a brilliant film that all audience members should be able to relate to. The humor also helps the film by keeping the audience engaged. I hope we see more films like this. And I also hope director Corneliu Porumboiu keeps making films and hopefully they will be shown in America. p.s. I also wanted to quickly point out a similarity I found between this film and Bernardo Bertolucci's \"The Spider's Stratagem\". Both films question a time in history. Are there such things as heroes? Does fact ever get mixed with fiction? How can we separate the two? When is a lie more important than the truth, if ever? These are important things to think about.",
         "The viewer needs to understand that this is a Romanian film for Romanians. You'll catch all the inside jokes of the film if you've been there. The point of the film is that indeed the revolution was different for everyone . Even in late 1990 when I was there, the people were still scared of the Securitate, or secret police. Even during the one year anniversary of the revolution, it took courage to go and march, much less right after Ceausescu fled. The emphasis on 12;08, the reaction of the students when the teacher asked why they were so interested in the French Revolution, the interviewers emphasis on the time of the protests, and the accusatory views of the callers on the TV program, let alone the long shots of the bare dilapidated concrete buildings, all lend to the whole idea of the plot. Not only does one ask did the revolution occur in this one town, but did it occur at all? After all, Ceausescu's right hand people took over after he was gone. The people themselves ask if anything has changed. The film can seem long and tedious to some viewers, but if you've lived in Romania, you get it.",
         "A wonderfully quirky movie, rooted in the deep inner conflict experienced by many people who have to re-conciliate their Communist-era mentalities with(in) a post-Communist society. Most Romanians (and East-Europeans alike) will understand it very well, since many clichés are present here: the vain, non-professional media, the desolate streets, the people without perspectives or hope, the arrogant new-rich former secret service people, the successful immigrants coming from even lesser parts of the world... all grafted on top of a nagging general feeling of guilt and shame, emanating from the sheep-like population. Let's face it: the real (and only) Romanian heroes of 1989, \"before 12:08 on December 22\", were the several thousands of mostly young folks who defied the authorities in the streets of Timisoara and Bucharest... the rest of the country just watched and waited, much like the viewers of Jderescu's \"talk show\". PS. - To the pretentious prig from Denmark: I think you were supposed to post your \"art cinema\" commentary under the latest creation of your much-ballyhooed co-national, Lars von Trier, \"Direktøren for det hele\" (2006). Your comments fit that film to a \"T\"!!! If you have absolutely no idea what Porumboiu's minimalistic film is all about, and no respect or understanding for another culture, I think you should refrain from posting. Sadly, your inane text was at some point featured on the main page for this Romanian film, even though you - thankfully! - represent an insignificant minority of malcontents.",
         "It is surprising that the movie got good rates from viewers outside Romania. It is incredible easy, as a Romanian, to connect to every image and to every word, so it becomes quite difficult to isolate the message that one can only receive through the experience of living the last 16 years in Romania, from the more general, human background of the movie. The movie is not a comedy. There are moments when you laugh. There are even more moments that will make you smile. But a comedy does not keep you thinking of it for days. It's 22nd of December. 15 years from the Revolution. Three days until Christmas. Throughout the movies, the Christmas trees work as extensions of the characters. Manescu, the alcoholic history teacher finds in his apartment a cheap and ugly tree that he doesn't remember buying. Piscoci, the friendly retired old man (a surprise, since movies taught me that old men are lonely and isolated), takes advantage of the trip to the tiny TV studio, in the station owner's wrecked car, and stops on the way to buy a tree. Jderescu, the TV station's owner and talk-show host, a men that keeps statues of Plato and Aristotle on his bookcase, a host that starts his show with pretentious quotes from Heraclit and gets offended when his former job, as a production engineer, gets mentioned, well, Jderescu does not have a Christmas tree. So he will buy one, when Piscoci gets one. There is also o beautiful tree, shortly passing buy in the hand of an ex-student of Manescu, now working outside the country. \"No man can cross the same river\", states Jderescu in the beginning of the show. Yet Manescu, the man who protested in front of the city hall in 1989, comes cross with that original day. We see him getting more and more wrecked, closing within himself, looking sideways, hesitating before each answer, facing old enemies, as powerful now as they were then, trying not to remember the mix of courage and cowardice from 22nd of December 1989. The callers in the show argue that he was not there on that day, and he gets lost in demonstrating otherwise, increasingly rabid, aggressive, more and more outnumbered. And, meanwhile, an ignored Piscoci demonstrates, based on common sense, that the truth of each callers does not have to exclude the Manescu's truth. Close to the end of the movie, we get two great moments. The only phone call in Manescu's defense is a mirror set in front of all those who speak before, reflecting an image so hideous that can only get rejected. And then, after this purification, to fill in the remaining time of a failed show, Piscoci narrates his memories of that day. So, was it or not a revolution in their small town? Well, no big history happen in there. Just small, human stories. Ten stars, without a doubt. Just a handful of movies haunted me so many time after the end credits rolled on.",
         "There is really a lot to this movie. Even thought there is almost no evident action, except for the long television broadcast of an obnoxious talk show - even some apparently loose ends or inconclusive stories - the fact is you can ponder on days on this beautiful work of art. Acting is superb in most cases, and images of dusk and dawn in the freezing Romanian winter - so gray, so hard - are pure poetry. The reference to dogma, among other keen jokes, talks about a clever story writer, and a cultured film maker. I'm really glad I got to see this movie as a part of the \"Eurocine\" European movie showcase that visits us these days (april 08) in Bogota and the rest of Colombia. We get a chance to see the best of Romania, a country apparently so far away, yet so close to our hearts.",
         "The film premiered today 2-6-06 at Cluj 5th International Film Festival. I were there� It is not I'm a cine-freak, but I love cinema. After the triumph (Camera d'Or prize) in Cannes of a practically inexistent Romanian filmography, we all were curious about Mr. Corneliu Porumboiu. Well-done Mr. Porumboiu� I should give you a ten, for proving to our fellow -constantly complaining- European fellows that one can make a good film with just a good scenario and without billions of Euros� I have to take away one point because only Almodovar, out of the leaving ones deserves 10, and a second point because,unfortunately your beautiful scenario would not easily strike audiences unfamiliar with the average Romanian. Yet, I did enjoy it and I want to thank you. Please continue your good work�",
         "12:08 EAST OF BUCHAREST deserves all the accolades awarded it at Cannes, and Corneliu Porumboiu's amusing, entertaining and important film is a great window into the questions of the \"Romanian Revolution\". The opening shots of a Romanian city with its lights blinking off and the photography of the concrete buildings that house Romanian families created a perfect background to launch the film and story and the question of \"whether there was, or was not a Romanian Revolution\". The characters in the film were both colorful and rich, and the humor displayed was tremendous. When I look at the lives of Romanians in contrast to the vast riches of America, and I see men and women going about their lives in Bucharest and other Romanian towns, the question of the revolution almost takes a back seat to the citizens attempting to scratch out a living and survive. What Mr. Porumboiu gave to the world was a rich story, interesting characters and presenting the question of a revolution. That answer, must be seen in this wonderful film. I look forward to more Romanian films and other works from the very talented Corneliu Porumboiu.",
         "This film is set in a small Romanian city on December 22, 2005, the 16th anniversary of the downfall of the repressive communist regime of Nicolae Ceausescu, which technically occurred at 12:08, just after noon, on the same date in 1989. Virgil Jderescu (Teodor Corban), an entrepreneur who has prospered in the post-revolution free market era and now counts the local television channel among his assets, decides to devote his personal talk show today to commemorating the anniversary of the week-long revolution. His guests are an old, white maned and bearded, much beloved pensioner, Mr. Piscoci (Mircea Andreescu), known for his annual Santa Claus appearances over the years, and Professor Manescu (Ion Sapdaru), a seriously alcoholic local academic historian. Virgil poses the question for discussion: did the people of this city participate actively in the revolution or not? The answer turns on whether locals were agitating against Ceausescu by demonstrating in the town square before the announcement of his downfall, or, instead, whether people merely came out of the woodwork afterward, when it was safe, to coattail on the revolutionary triumph courageously brought about by others, in Bucharest and elsewhere in the country. The last hour of the film presents the talk show episode in real time, and it is as good as the very best of briefer political sketches in the salad years of Saturday Night Live. Virgil is the unctuous host, trying to satisfy his guests and the contentious viewers who phone in to criticize the discussants on live audio feed. Old Mr. Piscoci offhandedly, almost reluctantly, acknowledges that, yes, he was present on the scene in the square that morning, and no one challenges this. You get the sense that this fact, like everything in his life, is no big deal. In fact, he seems thoroughly bored with the proceedings and spends his time making paper boats and what look to me to be cootie catchers from notepaper on the table where the three principals sit. Prof. Manescu on the other hand, nursing an especially foul hangover, asserts with all the pride he can muster under the circumstances that he certainly was present, calling for Ceausescu's scalp, in the hours leading up to the moment of capitulation. A woman phones in to state point blank that Manescu's lying, that she personally saw him drinking in a nearby tavern until well after the moment that C. stepped down. A male caller, whom Manescu had accused on the air by name of being a member of the Securitate - Ceausescu's thug police - who hit him during a scuffle in the square, admits that while it's true that he was a Securitate agent at that time, and that he was on duty in the square, because of those very facts he can vouch for the previous woman's assertion that Manescu was nowhere to be seen until later in the day. Manescu responds by first defending himself, then trying to elope from the station during a commercial break. He's brought back and spends the latter part of the show in a silent funk. The TV station itself smacks of our familiar local cable access operations. A single staff person, an indifferent, skinny young man, runs the camera, mans the phones, helps Virgil chase after Manescu, and reaches his arm across the table at one point to sweep away Mr. Piscoci's paper boats. The whole show is steeped in dark, understated humor, with, of course, serious subtexts about false claims of political glory and the larger issue of whether anything worthy of the term revolution really occurred in Romania, or at least in their town, i.e., whether most people in Romania are better off today or not. I'd love to give the film an \"A\" grade, but it is compromised by a creaking, protracted, confusing beginning: the first half hour is devoted to scenes in which each of the three principals, in their apartments, is awakening for the day. These scenes are shadowy; it's even hard to decipher who's who for a while. However, these scenes do serve to establish the fact that life for the characters other than Virgil is not very good, perhaps little better than before the revolution, if that. This film won the Camera d'Or Award for best debut feature last year at Cannes. My grades: 8/10 (B+) (Seen on 01/31/07)",
         "A very good piece of work that seems slow when you watch it and is very effective in the end. It makes you sad and hopeful at the same time. After having gone through revolution the actors are sucked up by their daily struggles about money, love and dignity. The pictures are dark and don't make you want to go to Romania in December. Nevertheless it is a must for everybody who is interested in understanding Romanian culture. But first of all it is a contribution to the national discourse in Romania itself. I would like to see more of the process of Romanian self-reflection. Unfortunately Romanian films are hardly available on DVD outside of the country.",
         "Yes, I thought so. For the first two thirds of the movie. Then I started understanding it's so much more. If torn apart, crushed people can be amusing, then, yes, this is a comedy, and so is everything in life. Living a sordid life can be accepted as normal, and can made be fun of - and, in the end, what else is left to do? What's interesting is that all characters, no matter how decaying might look, are given the chance of rehabilitation. The depressive drunken teacher? Well, he used to be a good man. His racist words have no actual meaning for him, just as curses don't have an actual meaning for children. And he used to play guitar, sometimes.. This movie's point is just so much deep beyond the visual - and even though it tricks us into believing it focuses on facts (in Romanian, the title reads like 'Was it or was it not?'), the message I perceived was that somehow, in the end, facts don't matter, not so much, but people do. Is it a comedy? Well, yes. But it's not 'hilarious', it's not Beavis and Butthead. It's a very sad comedy. It's life."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["42 Km Film"],
      "summaries": ["It's the 22nd of December. Sixteen years have passed since the revolution, and in a small town Christmas is about to come. Piscoci, an old retired man is preparing for another Christmas alone. Manescu, the history teacher, tries to keep up with his debts. Jderescu, the owner of a local television post, seems not to be so interested in the upcoming holidays. For him, the time to face history has come. Along with Manescu and Piscoci, he is trying to answer for himself a question which for 16 years has not had an answer: \"Was it or wasn't it a revolution in their town?\""],
      "budget": 200000
   },
   "movielensId": 54426,
   "movielens": {
      "languages": ["Română"],
      "releaseDate": "2006-06-02",
      "dvdReleaseDate": "2007-10-09",
      "directors": ["Corneliu Porumboiu"],
      "runtime": 89,
      "movieId": 54426,
      "title": "12:08 East of Bucharest",
      "mpaa": "",
      "actors": [
         "Mircea Andreescu",
         "Teodor Corban",
         "Ion Sapdaru",
         "Mirela Cioaba",
         "Luminița Gheorghiu",
         "Cristina Ciofu",
         "Lucian Iftime",
         "Annemarie Chertic",
         "Petrica Sapdaru",
         "Catalin Paraschiv",
         "George Guoqingyun",
         "Constantin Diţă",
         "Daniel Badale",
         "Marius Rogojinski",
         "Aurelia Tocu"
      ],
      "imdbMovieId": "0809407",
      "originalTitle": "A fost sau n-a fost?",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "KpNnmyX5JHQ",
         "AZ7MfFB14xo"
      ],
      "plotSummary": "It's the 22nd of December. Sixteen years have passed since the revolution, and in a small town Christmas is about to come. Piscoci, an old retired man is preparing for another Christmas alone. Manescu, the history teacher, tries to keep up with his debts. Jderescu, the owner of a local television post, seems not to be so interested in the upcoming holidays. For him, the time to face history has come. Along with Manescu and Piscoci, he is trying to answer for himself a question which for 16 years has not had an answer: \"Was it or wasn't it a revolution in their town?\"",
      "tmdbMovieId": 24159,
      "avgRating": 3.41333,
      "releaseYear": "2006",
      "numRatings": 75,
      "posterPath": "/59qdoIeW6gINHt6nFw6uyAUhot6.jpg"
   }
}