{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "madrid",
            "id": 744
         },
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "formentera",
            "id": 5357
         },
         {
            "name": "unsimulated sex",
            "id": 12420
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "illegitimate son",
            "id": 183886
         }
      ],
      "imdb_id": "tt0254455",
      "video": false,
      "title": "Sex and Lucia",
      "recommendations": [
         1414,
         2441,
         1391,
         2444,
         64,
         2469,
         111708,
         56810,
         2460,
         115695,
         8088,
         102492,
         51857,
         9299,
         1902,
         267,
         1913,
         34181,
         5879,
         2266
      ],
      "backdrop_path": "/luHDb8lCciKrTMvHtfX3bipnTXe.jpg",
      "revenue": 2628241,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Lucía",
               "gender": 1,
               "credit_id": "52fe42efc3a36847f802de8f",
               "name": "Paz Vega",
               "profile_path": "/8aVfJnS3yI0n6aKaDFzxHdtn3Wt.jpg",
               "id": 3627,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Lorenzo",
               "gender": 2,
               "credit_id": "52fe42efc3a36847f802de93",
               "name": "Tristán Ulloa",
               "profile_path": "/AmiVKczdJG7zxqzX3Jh9IHYk8Yc.jpg",
               "id": 16441,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Elena",
               "gender": 1,
               "credit_id": "52fe42efc3a36847f802de97",
               "name": "Najwa Nimri",
               "profile_path": "/1HjYUf3gvfEXP26Z2ejflW2AtOi.jpg",
               "id": 16442,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Carlos/Antonio",
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802de9b",
               "name": "Daniel Freire",
               "profile_path": "/m8EKSFjFs08wWYiPXP8JBL8Me6j.jpg",
               "id": 16443,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Belén",
               "gender": 1,
               "credit_id": "52fe42efc3a36847f802de9f",
               "name": "Elena Anaya",
               "profile_path": "/67brgegoJLcIQKiu4EEGtNymaUj.jpg",
               "id": 3623,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Luna",
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802dea3",
               "name": "Silvia Llanos",
               "profile_path": null,
               "id": 16444,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Madre de Belén",
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802dea7",
               "name": "Diana Suárez",
               "profile_path": null,
               "id": 16445,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Pepe",
               "gender": 2,
               "credit_id": "52fe42efc3a36847f802deab",
               "name": "Javier Cámara",
               "profile_path": "/pG2uOSwthuTXn8LAV2MTZbyOre9.jpg",
               "id": 1610,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Jefe",
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802ded9",
               "name": "Juan Fernández",
               "profile_path": "/8wLOuVF0sV3jm6T4CvtB1H5gvni.jpg",
               "id": 1284938,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42efc3a36847f802de6d",
               "name": "Julio Médem",
               "profile_path": "/ohftr2f6JyITzMios6RTpCKS54j.jpg",
               "id": 16435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802de73",
               "name": "Kiko de la Rica",
               "profile_path": null,
               "id": 16437,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802de79",
               "name": "Iván Aledo",
               "profile_path": null,
               "id": 16438,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe42efc3a36847f802de7f",
               "name": "Sara Bilbatúa",
               "profile_path": null,
               "id": 3629,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802de85",
               "name": "Víctor Molero",
               "profile_path": null,
               "id": 16439,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802de8b",
               "name": "Estíbaliz Markiegi",
               "profile_path": null,
               "id": 16440,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe42efc3a36847f802deb1",
               "name": "Julio Médem",
               "profile_path": "/ohftr2f6JyITzMios6RTpCKS54j.jpg",
               "id": 16435,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42efc3a36847f802deb7",
               "name": "Fernando Bovaira",
               "profile_path": null,
               "id": 16941,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42efc3a36847f802debd",
               "name": "Enrique López Lavigne",
               "profile_path": null,
               "id": 17603,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802dec3",
               "name": "Anna Cassina",
               "profile_path": null,
               "id": 1125213,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42efc3a36847f802dec9",
               "name": "Luis María Reyes",
               "profile_path": null,
               "id": 1125214,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42efc3a36847f802decf",
               "name": "Alberto Iglesias",
               "profile_path": "/2PGZyiqdAAyi2S0ZpFw5V0ojCqY.jpg",
               "id": 405,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5aa653e40e0a263dd30076ea",
               "name": "Montse Ribé",
               "profile_path": "/6fWYB8dYywxfYc42Gujn1YmzfOL.jpg",
               "id": 1585448,
               "department": "Costume & Make-Up",
               "job": "Makeup Effects Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 10.372931,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 1364,
      "vote_count": 170,
      "budget": 0,
      "overview": "Various lives converge on an isolated island, all connected by an author whose novel has become inextricably entwined with his own life.",
      "similar": [
         27066,
         28468,
         164,
         858,
         1903,
         80752,
         634,
         637,
         1643,
         5123,
         9962,
         2289,
         559,
         10795,
         797,
         36630,
         9946,
         14174,
         269,
         4808
      ],
      "original_title": "Lucía y el sexo",
      "runtime": 128,
      "poster_path": "/1sXh1xMe9KVqGvA5tBqG9DrYhzn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Alicia Produce S L",
            "id": 693,
            "origin_country": ""
         },
         {
            "logo_path": "/8T8OOQe3Xei2mW0DQepwQG1IMT0.png",
            "name": "StudioCanal",
            "id": 694,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Canal+ España",
            "id": 9335,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sociedad General de Cine (SOGECINE) S.A.",
            "id": 11954,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sogepaq",
            "id": 11955,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Televisión Española TVE",
            "id": 6780,
            "origin_country": ""
         }
      ],
      "release_date": "2001-08-24",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julio Medem"],
      "runtime": 128,
      "synopsis": "Lucía (Paz Vega), a waitress, is talking on the phone with her depressed writer boyfriend Lorenzo (Tristán Ulloa) after they had a nasty argument, where-after she walks out. Since he's been in a bad 'funk' for a while now, she's worried, and goes home to console him. Finding an empty apartment, Lucía is frantic. She then receives a phone call from the police while finding a suicide note, and is so afraid of bad news that she hangs up, assuming the worst. They call back, but she is now so depressed she ignores the ringing phone, packs a bag, and flees. Looking for a new beginning, Lucía travels to the mysterious Balearic Islands that Lorenzo had always talked of, but had recently been very negative about. Six years earlier: Lorenzo is having casual sex in the ocean, on a bright moon-lit night, with a beautiful married woman he just met named Elena (Najwa Nimri). They part ways, expecting to never see each other again. She then discovers she is pregnant with his child, and attempts to find him, but not knowing much about him, Elena doesn't. Later, as Lorenzo talks with his literary agent at a restaurant, discussing his writer's block, Lucía catches his attention as he gets up from his table to get cigarettes. She asks to speak to him and he joins her. She brazenly tells him that ever since she read his latest book, she has been following him and has fallen passionately in love with him. A smitten Lorenzo immediately engages the sexy, passionate Lucía and she moves into Lorenzo's apartment. The film then interweaves the past and present, of the characters in the film, and the characters in Lorenzo's novel. As the past plays out, we see Lorenzo repeatedly stalling for time on his new book with his editor while his relationship with Lucía deepens. About six years pass. Lorenzo then learns that he has a daughter as a result of his encounter with Elena and begins to visit the child at her school, meeting her babysitter Belén (Elena Anaya). Belén tells Lorenzo her mother is a recently retired porn actress with a new hot boyfriend, and virtually seduces Lorenzo with chatter of sexual context and banter about her fantasies. Lorenzo uses these encounters and his fantasies about Belén and her mother as content for his book, and Lucía reads about it, thinking it fiction. Meanwhile, he does not disclose his fatherhood to Lucía or the child, nor even attempt to contact Elena. Belén flirts with Lorenzo and eventually invites him over to Elena's house while she babysits his daughter, Luna. Lorenzo tells Luna a bedtime story, and after she falls asleep, he and Belén begin to have sex. They are interrupted as Luna knocks at the bedroom door, and they watch in horror as the family dog, a large Rotweiler in 'protect mode' kills her. Belén is stunned into shock, and Lorenzo runs away and falls into a deep depression. Lorenzo's writing turns dark, towards depraved sex and death. He anonymously contacts Elena, who has moved to the island to find solace and recall better days, and provides her a nice story about a beautiful child that loves to swim in the sea, to cheer her spirits. But his now guilt-ridden and uncommunicative relationship with Lucía begins to collapse. Back in the present, Lucía meets a scuba diver on the island, Carlos, and through him, Elena, who runs an inn on the island. Lucía rents a room, and the women bond as friends, not knowing their intimate connection. But when Lucía mentions Lorenzo by name, and his past visit to the island long ago, Elena deduces that connection, and after Lucía then sees a picture of Luna (looking remarkably like her father) she does too. Lorenzo's editor visits him in the hospital, where he was taken after being in an 'accident' and spent several weeks in recovery. When Lorenzo asks about Lucía, the editor tells Lorenzo he thinks Lucía thinks he is dead. Lorenzo senses Lucía is on the island and has the editor take him there. After both women discover that Lorenzo isn't dead, the three characters cope with and finally understand the entanglements of their interwoven relationships.",
      "writers": ["Julio Medem"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0254455/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMTAwMDgyMV5BMl5BanBnXkFtZTcwMDE3NTgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Paz Vega, Tristán Ulloa, Najwa Nimri | See full cast and crew »"],
      "reviews": [
         ". . .and it's not really even about Lucia! Lucia y el Sexo is actually about Lorenzo, Lucia's novelist boyfriend, and the consequences of a sexual encounter he had in the past which has led to a catastrophic event in his life. It's a languid and tempestuous poem of a movie, told in a non-linear way by the extremely ambitious Julio Medem. As a novelist myself, I deeply related to Lorenzo's blurring of reality and imagination. Your characters MUST be real to you in order for them to live and breathe on the page, and so much of your own life goes into the characters that the lines of course do blur. And then there's the subconscious, which cannot differentiate between fantasy and reality. Medem understands all this very well, and his depiction of it is remarkable. The title, I believe, refers to Lorenzo's past (The Sex and what happened as a result of it), and his present (Lucia). Paz Vega and Tristan Ulloa are stunning as the two leads - Vega with her fierce intelligence and Ulloa with his tormented vulnerability. I would have given this film a 10 if it hadn't been for the fact that the most pivotal scene is shot in an incredibly vague manner, which left me confused as to what had actually happened until much later in the movie, but it is a brilliant and heartfelt experience nonetheless.",
         "This is one of the better structured movies ever put to screen. It's as complex as Lynch's Lost Highway, but that only adds to the experience. A non-linear structure (in time and space) is applied and Lucia y el Sexo blurs the line between reality and imagination. Basically, it's like Mulholland Drive: Most of what we see is a dream, imagination. Only a relatively small part did really happen. But this goes one step further: What part is in the eye of the beholder here, because little clues are given so the mystery format is only used to keep us entertained at a basic level. A writer is the center here. Some parts of his life are probably true (trouble at home, sickness), others are ambiguous, others are certainly imagined. He is in the meta-story, but also places himself in threads in the other stories that come from his imagination. His imagination is formed by applying smaller and larger events (meeting a person at a party, seeing someone in front of the house) in his personal life to his fantasies. His erotic fantasies explain the title, as sex is one of the characters of the story. One of the story lines is again about his script read on the island by one of his imagined characters. Writing the story and telling the story is done simultaneously. As he becomes sick, the characters become helpless in the story. Overall it helps a lot if you keep imagining that you're watching imagined characters being manipulated by the writer. This combines meta-story and story, real with imagination, weaving several threads in a complicated web of story lines. In the end, it is made clear that the story doesn't end but starts again halfway, giving further evidence that viewers can use their imagination at random on this and create their own story out of it. The meta-story is interesting, but by mixing it with the story itself we see the real story as what it is, a writing trick with imagined characters. That unfortunately diminishes the emotions a movie tries to convey. We're merely watching how a movie is structured, with the imagined story not having the usual dramatic impact. It's remarkable that so many people are offended about the sex scenes, as it's already in the title. Do they also complain about the presence of aliens in Alien? I found the sex scenes to be made with some honesty; and at least they didn't even shy away of male nudity.",
         "The earlier film by Julio Médem (Lovers of the Arctic Circle) is a prelude to the kind of cinematography that this Spanish film director/writer presents here. I have read most of the other comments, but they don't do justice to it, mainly because of the lack of understanding the original tongue of this film. The screenplay is excellent, full of metaphors and a rich use of very carefully chosen words. People who consider this film just an excuse for depicting sex scenes as the highlight of the movie are pretty much clueless. It is more than that, it is the complex storytelling that tangles the characters in this movie and the way that is told. Compelling and breath-taking. A must see.",
         "I found this film absolutely terrific. Ik know there's a lot of sex in it and yes, there are a lot of suspicious coincidences, but I looked past that. For starters, I loved the story, it wasn't boring at all, despite what some may say. It was a sort of twisty fairytale to me, just like 'Los Amantes del Circulo Polàr' was. I love good fairy tales! The acting was very good by most actors (I love you Najwa!), and good by the others. Even the girl that played Luna was convincing. The film has a lot of explicit scenes (sexual and non-sexual) but besides from that Médem accomplishes to put a lot of suggestion in it (sexual and non-sexual). If you watch it attentively and past merely what you see, you will notice the subtlety of the characters and story. Last of all i would like to say that the English title (Sex and Lucia) is an abomination to the original title (Lucia y el Sexo). The word are the same, but the word order has flipped, which gives the title a whole other meaning, to my opinion. The film is about Lucia and the meaning sex has in her life and the life of others. It is not about sex and the way Lucia handles with it. The meaning of film titles is often lost in translation (no pun intended). Why can't American (and other) people keep the original title? We can in Belgium. A la proxima",
         "(8/10) Refreshing, delightful, sexy. moving and thought-provoking movie from Spain. Not really porn (as the title might suggest) although there is some very artistic explicitness. It is movies like this one that remind us that European cinema can scale the emotional dilemmas and mountains of a story where other films look at a storyline in terms of physical developments. Lucia, a young waitress in Madrid, falls completely in love with a writer. After a period of blissful togetherness, something from his past pulls him in two directions. We are caught up in his moral dilemma, of not wanting to lose the wonderful gift he has found and yet not wanting to be untrue to himself. The semi-autobiographical novel he is writing pulls together the story and the emotions and hopes of the characters and introduces ideas that enable them to heal some of their hurt. A central idea is that of finding a hole (symbolically on the sandy beach) where, after reaching the end of the story, you can jump back into the middle. That way you can try an make things turn out better (\"If you give me time\", says Lorenzo, Lucia's boyfriend.) A more mature and rounded work than the Director's earlier \"Lovers of the Arctic Circle\", Sex and Lucia combines wonderful acting, a great story, innovative cinema and spine-tingly beautiful photography. One of my favourite films of the year.",
         "Films like SEX AND LUCIA are the ones that when somebody asks you to describe, you have a hard time trying not to mislead them. Imagine David Lynch telling a story of love, lust, deception, and betrayal in a sun-bathed slow atmosphere and not one dwarf in sight. It might fool you at first into thinking it's just another erotic romance where characters have sex and share their feelings for two hours, but as soon as the first plot turn grabs you, you never let go. Let's try to describe the plot in a somehow linear structure: We meet a restaurant waitress named Lucia (Paz Vega) who appears to have emotional problems with her depressed boyfriend Lorenzo (Tristian Ulloa). One night she leaves work to find their apartment empty and receives tragic news: He apparently committed suicide by throwing himself in front of a car. Immediately after hearing it, Lucia packs her bags and leaves to a Mediterranean isolated island where Lorenzo apparently had an early sexual experience with a nameless cook. Then we track back in time six years earlier when Lucia and Lorenzo first met. He was a famous writer whom she fell in love when reading his book and stalked him for days until finally confessing her obsession in a restaurant table. What follows are countless scenes where Lorenzo and Lucia interact through sex. We get cheap, gratuitous intercourse like never before in a major motion picture and it is treated quite normally with honest sensual bravery. Of course, you would only understand that from watching the uncut version. Lorenzo is currently writing a second follow-up novel and as his best friend Pepe (Javier Camara) advises: \"Put lots of sex in it, people like that!\" Now this is where I am completely lost as to how to continue to describe this plot in a linear structure. Well, Lorenzo learns he had a daughter with that cook he met in the island and she is now six years of age and named Luna. While trying to get near her, he starts having an affair with her babysitter (?) Belem (Elena Ayana). This particular sibling has an unhealthy affair with her stepfather who met her mother while working in the porn industry. Lorenzo eventually includes these characters in his novel which keeps being read aloud by Lucia. Meanwhile back at the island in what appears to be present day (?) Lucia meets a scuba diver named Carlos (Daniel Freire, who also plays Belem's stepfather) and follows him to a nice cozy guest house owned by an excellent cook named Elena (Najwa Nimri). Want a big twist now? It turns out Elena is the lady who Lorenzo had an affair with six years ago and the mother of Luna. It appears that Elena is one highly active internet girl who comforts her loneliness by surfing in the world-wide web. In there she meets an anonymous writer who keeps writing her a story with no narrative rules (sounds familiar, doesn't it?) and that person is actually Lorenzo. Did he survive the suicide attempt? It just keeps getting weirder and more confusing to the point where you can no longer tell if what is being played on screen is reality or the work of Lorenzo's novel. Director Jaime Medem was also the man behind LOVERS OF THE ARTIC CIRCLE, a 1998 film about an unusual couple composed of complete opposites (named Otto and Ana) so it makes partial sense that he was also behind SEX AND LUCIA. This is a film also about the faith of particular characters and how they all interact to each other by one key point: Lorenzo's writing. When walking out of the film, one is unable to tell weather or not the sun-drenched, paradisiacal island is real or some imaginary plot device where characters go to relax and wash away their sorrows and worries. Is it supposed to make sense? Is there a key as to how to unlock the film's nonsensical linear structure? Unfortunately, this film was not as analyzed and dissected as MULHOLLAND DRIVE, so we might never learn. What is left is not an erotic film., but a beautiful, warm, romantic tale set to Alberto Igleasias' remarkable music score and seen through the cinematography by Kiko de la Rica whose work with digital is truly remarkable where the sunlight-bathed island is so bright to a point where the image looks anemic. I think the regular audience might finish watching a movie like this and at least have an idea about what happened, and I guess that is already worth any explanation. (5/5)",
         "This movie in my view is not understandable without any notion of the 'soul', whose movements are made visible by magnificent underwater shots. The sexual scenery functions not only as entrance to the story; I think Medem really wanted to depict something like 'the ultimate sex' both as experience and as ultimate, divine ideal, something like Goethes 'eternal feminine.' As something to strive for, it can deeply affect our lives by giving it the splendour we need to keep it worthwhile, even if we fail. At the same time, it is also a power deep down, a dark shadow that haunts us. It's for us to see, to accept, and to decide: do we want to go to our island and unite the two, as Lucia does? In that case, we might see that in the end our stories come true as well, be it by breaking in in the middle. The question I asked myself after watching the movie for the third time was: where exactly is this 'middle' of it? It seems to me that it's around the scene where Elena is walking through Madrid with Luna in her baby carriage, while passing the apartment of Lucia and Lorenzo. From then on, the decisions made by the novelist - like the shivery death of his child - are such that there is no way back. Lorenzo, Lucia and their relationship are too heavily shaken up. Both have to get into a new reality which can transform their personalities; to both, this means a form of dying and leaving their old personalities behind. They surely resist this, especially Lorenzo; but also he has to put himself at risk, following the demands of his 'blood', that is, of his sex, death and rebirth. And there the story takes over the initiative from the writer, who himself is thrown into it - in the middle, where he leaves his home and runs into his 'accident'. Exactly that scene is not shown - it's the hole in the middle, through which the old reality passes into the new. For me, this movie is a small masterpiece, which shows how film and literature can work together, and how more powerful ideas about ourselves are then the circumstances we are put into. The 'form' of the persons is therefore changeable: like Lorenzo during the last Island episode has 'changed' into Carlos. As the 'transformed' Lorenzo turns up on the island, with his distress and his love for both Elena and Lucia, 'Carlos' is no longer necessary and the women can leave him behind. The fact that Elena is eventually able to weep, marks the acceptance of her loss, which 'naturally' returns her child to her from the middle of the picture again.",
         "This Spanish film has an unusual look and feel and dares to take chances in the way that it mixes fantasy and reality. The result is an interesting film, which is often confusing and frustrating. I'm sure that this was not entirely accidental and that the filmmakers wanted to keep the audience in a state of disorientation. Nevertheless, the convolutions of the story appear to serve no other purpose than to keep us off balance. The films biggest sin is the scene in the middle of the film where the daughter Luna opens the bedroom door. The following event is presented in such a way that we are left guessing as to what has just happened. There's no reason for withholding it, except the misguided idea that lack of clarity is artistically valuable. I think that despite it's flaws, this film shows a great vibrancy and energy. People talk a lot about the sex scenes. The film doesn't have much to say about sex and it certainly isn't about sex. Nevertheless, the scenes do not seem tacked on for the sake of it and, in an era when Hollywood seems to be gripped by a new puritanism, it's refreshing to see a frank depiction of what is, after all, an important aspect of the relationship between these characters.",
         "This is really one of the better constructed movies I've seen in a while. Both the storytelling and style of the movie can be called unique. It starts mixing reality with fiction and its hard to tell what really happened and what didn't. It features lots of 'what-if' themes and the story is being rewritten in the characters mind, also with lots of symbolism, mainly with the moon and the water. It doesn't make this the most accessible movie but then again, you don't ever have to watch an European movie for its accessibility. Things start off quite slow but as the story develops the story gets more and more complicated and non-linear, when the line between fiction and reality gets blurred more and more. It does make the movie hard to follow at times but it at the same time makes the movie more interesting to watch and enables everybody start to define things on their own. You of course have to be open to these sort of movies though. Also the very explicit nudity isn't just for everybody. Sex plays a key part in the movie. It helps to tell the story and plays a significant role in the story lines and help to indicate when things are truth or fiction. Never before has sex played such a key part in the storytelling of a movie. This movie is always presented as a Paz Vega but this movie it's main character is in my opinion played by Tristán Ulloa. He's the writer, were the entire movie involves around. The story is mostly set inside his head. The three main actors (Paz Vega, Tristán Ulloa, Najwa Nimri) of the movie are really good and carry the entire movie. Visually the movie is really great and impresses just as much as the storytelling of the movie. The camera-work and colors are really great and create a very unique atmosphere for the movie. It helps to make \"Lucía y el sexo\" an even bigger and more enjoyable movie to watch, visually. Those who are open for an unique, one of a kind, unusual movie experience, will surely be delighted with this magnificent beautiful looking and constructed movie. 9/10 http://bobafett1138.blogspot.com/",
         "This movie works much better for me if I believe that everything occurring up to the closing scene, in which the writer rises from his keyboard and walks over to the woman at the window, occurs inside that unnamed, unidentified writer's head. In other words, everything we see up to that point, what we think is the movie, is actually the novel that writer is working on. \"Lorenzo,\" \"Lucía,\" \"Elena,\" \"Luna,\" \"Belén,\" and even the editor \"Pepe\" are merely characters in that novel. The novel our \"Lorenzo\" is working on, the one \"Lucia\" sneak-reads, is a novel-within-a-novel. The back-and-forth time shifts are the larger novel's structure and only the movie's structure by default. The novel closes with \"Lorenzo's\" fantastical plot device of characters falling through a hole, coming back half-way into the story, and changing course: \"Elena\" and \"Luna\" reunited and playing in the piazza outside \"Lorenzo's\" flat. If this was Julio Medem's vision, then it was brilliant. If not, it's still an excellent movie. I think the naysaying commentators I've read need to watch the movie again."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Alicia Produce",
         "Canal+ España",
         "Sogecine"
      ],
      "summaries": [
         "Lucía is a young waitress in a restaurant in the centre of Madrid. After the loss of her long-time boyfriend, a writer, she seeks refuge on a quiet, secluded Mediterranean island. There, bathed in an atmosphere of fresh air and dazzling sun, Lucía begins to discover the dark corners of her past relationship, as if they were forbidden passages of a novel which the author now, from afar, allows her to read.",
         "In Madrid of the present days, the waitress Lucía leaves her job and goes to her apartment to meet her mate Lorenzo, who seems to be very depressed. When she arrives, she receives bad news about Lorenzo from the police. She moves alone to an isolated island, where she meets a stranger and lodges in a pension where he is living for the last months. The story shifts to six years ago, when Lorenzo and a woman, without knowing even the name of each other, have a magnificent sexual intercourse. The woman gets pregnant, and her daughter is raised with out a father. Meanwhile, Lorenzo is a writer that lost his creation skills and one night meets Lucia in a restaurant. She confesses to him that she is in love with him and has been stalking him for a long time. They fall in love for each other and Lucia moves to his apartment. Later, Lorenzo is informed by his friend Pepe that he has a daughter, and he meets her in a square, with her baby sitter. From this point on, Lorenzo mixes his reveries with reality.",
         "Various lives converge on an isolated island, all connected by an author whose novel has become inextricably entwined with his own life."
      ],
      "budget": 0
   },
   "movielensId": 5477,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch",
         "Español"
      ],
      "releaseDate": "2001-08-24",
      "dvdReleaseDate": "2003-03-25",
      "directors": ["Julio Médem"],
      "runtime": 128,
      "movieId": 5477,
      "title": "Sex and Lucia",
      "mpaa": "R",
      "actors": [
         "Paz Vega",
         "Tristán Ulloa",
         "Najwa Nimri",
         "Daniel Freire",
         "Elena Anaya",
         "Silvia Llanos",
         "Diana Suárez",
         "Javier Cámara",
         "Juan Fernández"
      ],
      "imdbMovieId": "0254455",
      "originalTitle": "Lucía y el sexo",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["N2JBjQVJ5Qg"],
      "plotSummary": "Various lives converge on an isolated island, all connected by an author whose novel has become inextricably entwined with his own life.",
      "tmdbMovieId": 1364,
      "avgRating": 3.67964,
      "releaseYear": "2001",
      "numRatings": 1041,
      "posterPath": "/1sXh1xMe9KVqGvA5tBqG9DrYhzn.jpg"
   }
}