{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "heist",
            "id": 10051
         },
         {
            "name": "heist movie",
            "id": 159343
         },
         {
            "name": "bank heist",
            "id": 191845
         }
      ],
      "imdb_id": "tt0074608",
      "video": false,
      "title": "Harry and Walter Go to New York",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Walter Hill",
               "gender": 2,
               "credit_id": "52fe4be79251416c7511197f",
               "name": "Elliott Gould",
               "profile_path": "/bo5jSwWyFRsKVAkELT9n7AKQqMk.jpg",
               "id": 827,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Adam Worth",
               "gender": 2,
               "credit_id": "52fe4be79251416c75111983",
               "name": "Michael Caine",
               "profile_path": "/vvj0JMSFpOajXCE46Hy4dyqSP2U.jpg",
               "id": 3895,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lissa Chestnut",
               "gender": 1,
               "credit_id": "52fe4be79251416c75111987",
               "name": "Diane Keaton",
               "profile_path": "/fzgUMnbOkxC6E3EFcYHWHFaiKyp.jpg",
               "id": 3092,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Harry Digby",
               "gender": 2,
               "credit_id": "52fe4be79251416c7511198b",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rufus T. Crisp",
               "gender": 2,
               "credit_id": "52fe4be79251416c7511198f",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gloria Fontaine",
               "gender": 1,
               "credit_id": "52fe4be79251416c75111993",
               "name": "Lesley Ann Warren",
               "profile_path": "/4I5VPyumsxYGKST9b0FL2harYRK.jpg",
               "id": 21818,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Chatsworth",
               "gender": 2,
               "credit_id": "52fe4be79251416c75111997",
               "name": "Val Avery",
               "profile_path": "/jIBEZ5xoM7I5PxG3pW62VeWwYih.jpg",
               "id": 3014,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mischa",
               "gender": 2,
               "credit_id": "52fe4be79251416c7511199b",
               "name": "Jack Gilford",
               "profile_path": "/mc8fpSHQ8Kds8MKwyHHJzrMz57I.jpg",
               "id": 64929,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Lewis",
               "gender": 2,
               "credit_id": "52fe4be79251416c7511199f",
               "name": "Dennis Dugan",
               "profile_path": "/A9Hv8qqB4fgb5IMjEESzBo8LXPZ.jpg",
               "id": 17494,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Florence",
               "gender": 1,
               "credit_id": "52fe4be79251416c751119a3",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4be79251416c751119a9",
            "name": "Mark Rydell",
            "profile_path": "/j7JuFKjL3iKeXdYVJILd6MFlVJA.jpg",
            "id": 21958,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.035161,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 149445,
      "vote_count": 5,
      "budget": 0,
      "overview": "Two hoplessly out of their class con-men attempt to pull off the largest bank heist of the l9th century. They gain the enmity of the most famous bank Robber in the world and the affection of a crusading newspaperwoman.",
      "similar": [
         949,
         9654,
         75656,
         59108,
         449443,
         353070,
         562,
         507,
         22907,
         4147,
         4771,
         9679,
         1281,
         68727,
         9277,
         2330,
         59,
         97367,
         291805,
         136400
      ],
      "original_title": "Harry and Walter Go to New York",
      "runtime": 115,
      "poster_path": "/iDaToaofJZ1GbdYoE7847DQnhyO.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1976-06-17",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "All the Digby-Hill-Chestnut gang need is two breaks... out of jail... into a safe.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Rydell"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Don Devlin",
         "John Byrum"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0074608/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MTU5MTEwM15BMl5BanBnXkFtZTcwNDk4MjkxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: James Caan, Elliott Gould, Michael Caine | See full cast and crew »"],
      "reviews": [
         "This ranks near the epitome of the comedic experience; perhaps not an intellectually provocative outing, but this is a masterpiece of physical humor. It is unusual to find a film of this nature sporting the stellar cast which appear here - Caan, Gould, Caine and Keaton enjoy a rare chemistry and display a keen sense of timing. If you haven't seen this yet, make it your next film! (Ok, after you finish Lawrence of Arabia, 2001, and West Side Story - but then, make sure you see it!)",
         "I've watched this movie several times. Each time I enjoyed it more. I have looked for it to buy but can't find it. With a cast full of wonderful actors, this movie deserves more credit than it has received. It was funny and clever.",
         "A thoroughly well-made and well-paced movie, with a wonderful score, both in the lead characters' signature song \"Nobody's Perfect\" and in the incidental music. James Caan and Elliot Gould do a great job of playing the low comedy foils of high comedy master Michael Caine. Excellent for kids, too...although there are touches of violence, romance, and illegal behavior, they are all mild, and it's got a delightfully old-fashioned morality to it.",
         "I saw this movie when it was first released, then again on television sometime in the Eighties. Why this film is largely forgotten is beyond me. For that matter, why are some of the most entertaining films of the Seventies collecting dust, while the critics continue to insist that we bow and scrape to pretentious self-absorbed WoodyBogdanovichMazurskyAltman? Anyhoo, this film is funny -- maybe not side-splitting, but certainly a lot more entertaining than many films calling themselves comedies. It's atmospheric, with that yellow/sepia look Coppola first introduced in Godfather II. It's well-acted: James Caan is a great comic actor -- let's face it, a great actor, period. Michael Caine is especially good as the kid glove villain. Almost nothing here to offend anybody, (but kids under age 10 might have trouble following it). And after all these years, I still remember the \"owls who\" joke.",
         "An earlier poster commented that it came and went in the theaters. That's because (at least in America), it was savaged by the critics. But when I saw this on cable a little while after, I actually found it to be very funny, and even taped it for my personal collection. The sequence at the end when Harry and Walter are doing what they can to extend the play so they can steal the money is very funny. When James Caan stops the play and starts singing his lines that, \"he's not the real Prince Herbert, I am!\" I thought was really great. I remember the \"owls who\" line as well, but Caan's singing his lines was what I most enjoyed in that movie. I also liked the scene where Caan and Gould go into the fancy restaurant, order fancy wine, and have no idea what to do when the sommelier tries to serve it to them.",
         "This is just a good, clean, fun movie with an excellent cast. It was shot back in the 1970's. It is amazing that the movie did not do better at the box office, because of all the stars that were cast in it. It is interesting to note that this movie was shot mostly in Mansfield, Ohio at the Mansfield Reformatory. Since then, Shawshank Redemption and Con Air were filmed there as well. The prison used for the movie has since been replaced by a new one and is now an historical site, open to the public. I think you will find some good laughs here. It is not brain surgery and a great way to experience some top stars in one package. I was an extra in this movie, playing both a prison guard and a prisoner. Chasing James Caan and Elliot Gould was a hoot. The cast and crew of this movie had a great time filming it. I might add that the director, Mark Rydell, went on to direct the movie,On Golden Pond.",
         "Made on the HELLO DOLLY set, this bumbling farce looks sensational and in some ways is actually as lush as DOLLY itself. With a spectacular cast and some very funny lines - and especially the genuinely hilarious NOBODY'S PERFECT song - H&W somehow just misses being really really good. Any opportunity to see Carol Kane on screen is a must. Barely released in 1976 this film is worth seeing in glorious widescreen, just for the visuals around the DOLLY set. It actually looks as though you will see Streisand singing somewhere in the background. It is probably the only two million dollar film with a three million dollar set. Deserving of a lavish DVD release it could easily become a collectors item for many reasons...if only the comedy was genuinely one of them. The ideas are all there and the cast and the lushness, but you just fell it is all a bit forced.",
         "more or less stuck in my hotel room on standby duty for five days during queenly coronation celebrations, i found this movie on the network and watched it over and over again. on a parr with help and the three amigos the whole thing was deliciously absurd - i couldn't believe my luck",
         "The truth about film comedy is that the best funny flicks are never recognized in their own time. For example, the Marx Bros. comedy \"Duck Soup\" (1933) was universally panned as a stinker, but today critics regard it as a classic. \"Harry and Walter Go to New York\" shares the same pedigreed. The critics savaged it in its day and audiences never warmed up to its outlandishly labored comic shenanigans. However, now that it is available in a widescreen version on DVD, today's audiences can relish what yesteryear's spectators reviled. Director Mark Rydell, who made \"The Reivers,\" \"The Rose,\" \"The River,\" \"For the Boys,\" \"On Golden Pond,\" and \"The Cowboys,\" may regret having ever helmed \"Harry and Walter Go to New York,\" but he shouldn't because the Columbia Pictures release qualifies as an entertaining, big dumb, stooge comedy that casts a likable James Caan and Elliot Gould as a couple of Keystone Criminals. The authorities arrest two woebegone vaudeville comics, Harry Dighby (James Caan of \"The Killer Elite\") and Walter Hill (Elliot Gould of \"The Long Goodbye\"), during a carnival act when Harry pinches money from the wallets of spectators participating in a routine where Harry quizzes a veiled Walter what he holds in his hand. These two cretinous clowns are shipped off to Concord Prison where they meet wealthy, urbane,debonair criminal genius Adam Worth (Michael Caine of \"The Eagle Has Landed\") and become his personal servants. Worth got sent up the river by a duplicitous banker, Rufus T. Crisp (Charles Durning of \"Sharkey's Machine\") who had been his cohort in a robbery. Cooling his elegant heels in a Massachusetts Prison, Worth obtains the plans to a new Mosler safe from one of his confederates and schemes at striking back at Crisp's bank again in revenge for Crisp selling Worth out and landing him in prison. Meantime, a crusading but small-time New York City newspaper editor, Lissa Chestnut (Diane Keaton of \"Annie Hall\") visits the prison to interview Worth and expose his regally appointed jailhouse living quarters to the outside world. At the same time, Worth has concealed the plans to the new safe behind a framed picture. Somehow, Harry discovers the blueprints, and Walter and he try to take a photograph of the plans. During the shooting process, Harry puts too much powder in the flash-burn tray to illuminate the plans. As a result, a fire breaks out and the plans are destroyed, much to Worth's horror. Furious at this sudden reversal of events, Worth demands that Warden Durgom (Burt Young of \"Rocky\") assign hapless Harry to the nitroglycerine detail where prisoners handle the unstable, volatile explosives to clear a rock quarry. Guard O'Meara (Bert Remsen of \"Thieves Like Us\"), who laughs at Harry's misfortune, demonstrates to our knuckle-headed hero how to handle the stuff. Of course, Harry shrewdly exploits his newfound talent to escape from prison with his partner-in-crime Walter and flee to New York City, obtain the photo of the plans and rob the bank before Worth's men can loot it. Our goofball heroes show up in New York and hoodwink Lissa, telling her about how they are out on parole before they learn that Walter's photograph of the plans survived intact. Worth shows up not long afterward and forces Harry to hand over the plans to the safe. The scene where Worth locks poor Walter in an airtight safe until Harry coughs up the plans establishes the antagonist's dastardly villainy. Angry at both Worth as well as Harry and Walter, Lissa dedicates herself along with Harry and Walter to beating Worth to the punch and cracking the toughest bank in America. Lissa, Harry and Walter are going into the bank from the top, while Worth and his henchmen are tunneling in from the bottom in a race to see who can get to the goods first. Never wasting a moment in advancing the action, Rydell generates some genuine suspense and hilarity when our heroes radically alter their plans and decide to blow the safe during a stage performance of Worth's mistress Gloria Fontaine (Lesley Ann Warren) before the gentleman thief can descend on the bank himself. Harry and Walter's antics to make enough time for themselves and their cohorts to stall the end of the play so that their accomplices can get into the vault are very amusing. \"Harry and Walter Go to New York\" doesn't miss a beat during its 111-minute running time. Although it flopped miserably during its short-lived theatrical release, \"Harry and Walter Go to New York\" qualifies as superficial, low-brow, but side-splitting merriment that recaptures the nostalgic era of the Gay 90s, back when 'gay' and homosexuality weren't synonymous. People remember this era for its ubiquitous handle-bar mustaches, long sideburns, derby hats, arm garters, and cravats. Sumptuously produced with exacting attention to detail, boasting a stellar cast which included Carol Kane, Jack Gilford, Lesley Ann Warren, Ted Cassidy, Brion James, and Burt Young, this heavy-handed but hilarious comedy of errors has been gorgeously lensed by ace cinematographer Laszlo Kovacs, whose credits include \"Blood of Dracula's Castle,\" \"What's Up, Doc,\" and \"New York, New York.\" Clearly, Columbia Pictures spared no expense on these period hi-jinks, while Rydell must have allowed Caan and Gould a free hand at improvising their antics. The song and dance number \"Nobody's Perfect\" that they perform at the beginning epitomizes their hopeless numb-skullduggery. Gould and Caan conjure up more than enough chemistry to pull this caper off. Caan spouts crazy ideas and Gould constantly reprimands his partner's temerity. They look like they belong in the 1890s, too. Michael Caine is a revelation as the straight-man/villain who runs afoul of our heroic buffoons. \"Harry and Walter Go to New York\" constantly refers to the haves and have-nots of society and aligns our sympathy with the low-class underdogs against the imperious upper-class.",
         "Although I think many of the best shots were left on the cutting room floor, this comedy received some bad reviews because it was a simple, funny, refreshing jaunt through the plot without sex, dark humor, and double entendre. It was just good clean fun! Unfortunately, because of that, the reviewers, steeped as they are in self-indulgent feelings of superiority, panned the film. If you like comedy that leaves you laughing and feeling good, be sure to catch this one! (And I'm not just saying that because I appear in the film for about 1/10 of a second!)"
      ],
      "genres": [
         "Crime",
         "Comedy"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Devlin-Gittes/Tony Bill"
      ],
      "summaries": [
         "Two hoplessly out of their class con-men attempt to pull off the largest bank heist of the l9th century. They gain the enmity of the most famous bank Robber in the world and the affection of a crusading newspaperwoman.",
         "It's 1892. Harry Dighby and Walter Hill are a Massachusetts based third rate vaudeville team and penny-ante con artists who pilfer money from audience members to supplement their meager income. They often feud with each other because of their differing perspectives and personalities. But they both have the same primary goal of making it big in vaudeville. Adam Worth is a renowned New York socialite and ladies man who also robs banks, the latest being the Lowell Bank and Trust. He has a standing agreement with New York bank presidents that after the robberies, he keeps the cash but returns the securities for a 15% face value fee minus a modest commission for the bank president. Harry and Walter meet Adam when they are assigned cell-mates during their incarceration for their latest crimes at Concord Prison. As Adam manages to arrange to continue living lavishly inside prison, Harry and Walter become his menservant. What Harry and Walter learn is that Adam has a copy of the blueprints for the redesigned Lowell Bank and Trust, now reported to be the most impenetrable financial institution. Adam plans to rob the bank again to satisfy his ego in that he can do it, but also to get back at the bank's president, Rufus T. Crisp, who was responsible for his capture. Much against Walter's sensibilities, Harry senses an opportunity to get a copy of the plans in order for him and Walter to rob the bank first. They manage indirectly to get a copy of the plans but destroy the originals in the process, and subsequently escape from prison. Adam finds out about the copy and does whatever he can to get the plans back from Harry and Walter. But unexpectedly on Harry and Walter's side are Lissa Chestnut, the emancipated publisher of the New York based socialist Advocate newspaper, and her associates at the newspaper. She inadvertently helped Harry and Walter get the plans, but does whatever she can to rob the bank with them in the name of the common man and to avenge an action against her and the newspaper by Adam."
      ],
      "budget": 0
   },
   "movielensId": 5487,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1976-06-17",
      "dvdReleaseDate": "2002-07-09",
      "directors": ["Mark Rydell"],
      "runtime": 115,
      "movieId": 5487,
      "title": "Harry and Walter Go To New York",
      "mpaa": "PG",
      "actors": [
         "Elliott Gould",
         "Michael Caine",
         "Diane Keaton",
         "James Caan",
         "Charles Durning",
         "Lesley Ann Warren",
         "Val Avery",
         "Jack Gilford",
         "Dennis Dugan",
         "Carol Kane"
      ],
      "imdbMovieId": "0074608",
      "originalTitle": "Harry and Walter Go To New York",
      "genres": [
         "Crime",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two hoplessly out of their class con-men attempt to pull off the largest bank heist of the l9th century. They gain the enmity of the most famous bank Robber in the world and the affection of a crusading newspaperwoman.",
      "tmdbMovieId": 149445,
      "avgRating": 2.36364,
      "releaseYear": "1976",
      "numRatings": 33,
      "posterPath": "/iDaToaofJZ1GbdYoE7847DQnhyO.jpg"
   }
}