{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "video game",
            "id": 282
         },
         {
            "name": "arcade",
            "id": 10547
         },
         {
            "name": "donkey kong",
            "id": 215968
         }
      ],
      "imdb_id": "tt0923752",
      "video": false,
      "title": "The King of Kong: A Fistful of Quarters",
      "recommendations": [
         40819,
         14242,
         18094,
         16070,
         39452,
         14285,
         14275,
         1779,
         501,
         14048,
         2260,
         11194,
         16636,
         15584,
         26564,
         15725,
         1666,
         80767,
         13020,
         1776
      ],
      "backdrop_path": "/1MEJ79NH1Fz7j1KR2qtyNvlBXGb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606c5",
               "name": "Steve Wiebe",
               "profile_path": "/x6CduU4HKFZtBs3z78xwuQXck8S.jpg",
               "id": 76112,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45ba9251416c750606c9",
               "name": "Billy Mitchell",
               "profile_path": "/wZixTLXi91IKXirDWdTUGnhRAB5.jpg",
               "id": 42386,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606cd",
               "name": "Walter Day",
               "profile_path": "/aBmw14DWVoT54SIhrTHPyWer4r.jpg",
               "id": 76113,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606d1",
               "name": "Mark Alpiger",
               "profile_path": null,
               "id": 76114,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45ba9251416c750606d5",
               "name": "Greg Bond",
               "profile_path": null,
               "id": 76115,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606d9",
               "name": "Craig Glenday",
               "profile_path": null,
               "id": 76116,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606dd",
               "name": "Brian Kuh",
               "profile_path": null,
               "id": 76117,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606e1",
               "name": "Robert Mruczek",
               "profile_path": null,
               "id": 76118,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606e5",
               "name": "Todd Rogers",
               "profile_path": null,
               "id": 76119,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606e9",
               "name": "Steve Sanders",
               "profile_path": null,
               "id": 76120,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606ed",
               "name": "Doris Self",
               "profile_path": null,
               "id": 76121,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606f1",
               "name": "Roy Shildt",
               "profile_path": null,
               "id": 76122,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45ba9251416c750606f5",
               "name": "Mike Thompson",
               "profile_path": null,
               "id": 62539,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606f9",
               "name": "Derek Wiebe",
               "profile_path": null,
               "id": 76123,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c750606fd",
               "name": "Jillian Wiebe",
               "profile_path": null,
               "id": 76124,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe45ba9251416c75060701",
               "name": "Nicole Wiebe",
               "profile_path": null,
               "id": 76125,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5a1c09dd9251410330051580",
               "name": "Adam Wood",
               "profile_path": null,
               "id": 1930666,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ba9251416c7506070b",
               "name": "Seth Gordon",
               "profile_path": "/hLUsEjvjW5nGMZ5e3gyJGkUgcF2.jpg",
               "id": 71600,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54176fd90e0a2637f40000e0",
               "name": "Seth Gordon",
               "profile_path": "/hLUsEjvjW5nGMZ5e3gyJGkUgcF2.jpg",
               "id": 71600,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5900d73092514155b500015f",
               "name": "Seth Gordon",
               "profile_path": "/hLUsEjvjW5nGMZ5e3gyJGkUgcF2.jpg",
               "id": 71600,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5900d73892514155b5000161",
               "name": "Seth Gordon",
               "profile_path": "/hLUsEjvjW5nGMZ5e3gyJGkUgcF2.jpg",
               "id": 71600,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 4.894264,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13958,
      "vote_count": 187,
      "budget": 0,
      "overview": "In this hilarious arcade showdown, a humble novice goes head-to-head against the reigning Donkey Kong champ in a confrontation that rocks the gaming world to its processors! For over 20 years, Billy Mitchell has owned the throne of the Donkey Kong world. No one could beat his top score until now. Newcomer Steve Wiebe claims to have beaten the unbeatable, but Mitchell isn't ready to relinquish his crown without a fight. Go behind the barrels as the two battle it out in a vicious war to earn the title of the true King of Kong.",
      "similar": [
         86130,
         12279,
         36670,
         1370,
         585,
         10404,
         68735,
         82690,
         62211,
         44214,
         45317,
         9472,
         101299,
         55721,
         114150,
         1124,
         353486,
         257344,
         333339,
         8328
      ],
      "original_title": "The King of Kong: A Fistful of Quarters",
      "runtime": 83,
      "poster_path": "/uypCNIyomTC0mCHpNHBiOsB4Xxl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Picturehouse",
            "id": 52005,
            "origin_country": ""
         }
      ],
      "release_date": "2007-08-17",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "Don't get chumpatized",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Seth Gordon"],
      "runtime": 79,
      "synopsis": "A middle-school science teacher and a hot sauce mogul vie for the Guinness World Record on the arcade classic, Donkey Kong. In 1982, LIFE Magazine assembled the worlds greatest gamers for a photo shoot that would become the center spread of their 1982 Year-In-Photos edition. Billy Mitchell, who would later be named the Gamer of the Century, was one of the invitees. Mitchell, the World Record holder on Centipede, had been tracking the score on Donkey Kong, and knew he could take that title as well. In front of the 20 best gamers in the world, Billy scored 874,300 points, a record many thought would never be broken. In 2003, 35 year old family man Steve Wiebe, after losing his job at Boeing, found solace in Donkey Kong. Steve stumbled upon Billy Mitchells record online, and set out to break it. He began perfecting his game every night after his wife and kids went to bed, and not only surpassed Billys record, but ended up with a thought-to-be-impossible 1,000,000 points. A tidal wave of media coverage followed, and Steve Wiebe quickly became a celebrity in his hometown of Seattle, WA. He also rediscovered his love for teaching, and regained the respect of all who once doubted him. Meanwhile, back in Hollywood, FL, Billy Mitchell hatched a plan to reclaim his fallen Donkey Kong record In the months that followed, Steve and Billy engaged in a cross-country duel to see who could set the high score that would be included in the 2007 Guinness World Records book and become The King of Kong: A Fistful of Quarters. Along the way, both men learned valuable lessons about what it means to be a father, a husband, and a true champion discovering that you dont always need to win to be a winner.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0923752/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5MzU3NTkzMl5BMl5BanBnXkFtZTcwMDQwNzE1MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Wiebe, Billy Mitchell, Mark Alpiger | See full cast and crew »"],
      "reviews": [
         "KING OF KONG is one of the greatest movies I've seen in a while - not documentaries, movies. The film-making here is nothing short of extraordinary - building suspense, creating anticipation, and playing with the archetypes like the best Hollywood movies. If you have ever played the original Donkey Kong arcade game, or on the original Nintendo, you have to see this movie. I have never beaten Level 3 on the third cycle - the spring on the elevator stage, if you know what I'm talking about, is going extremely fast. These guys get beyond 20 cycles. I don't want to give anything away...I heard they are going to make this a feature movie with actors, but I think that eliminates the main draw of this concept - these guys are in their forties, in some freak cases have wives and children, and they play Donkey Kong with as much heart as Lance Armstrong rode bikes. They are some of the strongest characters I've seen in a movie since STAR WARS. To best summarize how enjoyable this movie is, after watching the DVD for the first time, I immediately restarted it from the beginning, and watched it again.",
         "This is an incredible documentary, and as with most great documentaries the story arises as the filming happens; it is not preconceived. The film starts out as a story about a battle between two gamers who each want to hold the donkey kong high score records, but what it turns into is a story about man vs. the empire(and not in a star wars sense). It is a story about how who you know is always everything and how much harder an everyman must work to make it in a world of networks. The story of these people, especially steve's, are really inspiring and you find yourself feeling all of the twists and turns of the film along with the characters. A truly wonderful film about human beings not just donkey kong.",
         "King of Kong (or Billy vs. Steve, basically), is an excellent film about a rivalry that says a lot about competition in our culture. The movie portrays Billy, the Donkey Kong Champion, doing everything in his power to keep his record and to deny Steve Wiebe (wee-Bee) the title of world record holder in Donkey Kong. Steve is an outsider in this culture where Billy is an icon, and at first there are people within the video game community who do not want him to succeed. It becomes kind of a struggle between good and evil, as the powers that be try to hold down those not in power. Suddenly, Steve is the guy you're rooting for, if only just to beat that smart-ass Billy. It is a journey that takes you through the darker and seedier side of the video game revolution of the '80s. If it seems silly to be writing about such weighty issues of good and evil when a movie is about a video game, watch the movie: it really does the job of making you care about what happens to these odd, fascinating people.",
         "I saw this at the Traverse City Film Festival and it was probably the best film of the festival. This excellent film has everything that a movie fan loves to see: the classic hero and villain story, action, suspense, drama, and comedy. Who would have thought all of this would come out of a documentary about Donkey Kong? The story follows Steve Wiebe, a family man from Washington trying to beat the arcade juggernaut Billy Mitchell's world record score on Donkey Kong. The film is perfectly edited by introducing both characters, showing their history in the video game culture, and giving the viewers a sense of which person to root for. It's hysterical the way this simple story is made out to look like an action adventure film. Steve is the underdog, the man that has a big journey ahead of him. But to overcome the challenges and try to claim the title of Donkey Kong master, he must face the opponent Billy Mitchell and his video game minions. This film is one of the most fun times I've had in a theater in long time. The whole audience was involved, cheering on some characters, laughing at others, and applauding many times. It's so much fun to watch an underground culture and see people you didn't know existed. My favorite part in the film is probably when Steve has to show up in person and prove his ability. It's so hilarious, suspenseful, and inspiring. The King of Kong is a terrific film. It's a lot of fun, there's never a dull moment, and it really shows what a great film is supposed to be like.",
         "The best movie I've seen this year! I laughed to the point of exhaustion. I'd recommend it to anyone with a heartbeat. Must see!The only thing I can't get over is that this Billy Mitchell guy is a real person. I mean you can't make up a character like this. And Steve Weibe... how humble can you get. I mean the guy is the poster child for humility. (Okay so here is where I admit that I actually know Steve personally. Thing is, he actually IS this humble. No lie. For his recent 20 year high school reunion he listed as his proudest accomplishment: \"recieving my teacher's certificate\", no mention of Donkey Kong. Now that's the kind of hero everyone should look up to. Especially anyone with a huge ego. And lord knows there are enough of those to go around. So don't walk, RUN to the movie theater and see this movie. You won't regret it. (Just make sure you use the bathroom before the movie starts, you won't want to miss a second!)",
         "If it weren't for the sincerity of it all- or maybe because of it- King of Kong could be conceived of as a mockumentary. But there's no joking with these guys, which sometimes makes it a lot of fun to watch the competition between Billy Mitchell and Steve Weebie (right way to say the name?), where sycophants and idiosyncrasies fly on the former's self-spun empire/network and on the latter just your average suburban housewife and kids going somewhat begrudgingly along the ride. It's a saga though not just about them, but about the world of gaming, of the mind-set that pervades everyone from lawyers to 'Roy Awesome' to little old ladies competing at Qubert, and the nature of competition itself. Not since Rocky- and maybe even better in its exuberance and humility- has one seen a tale of the underdog and the king played out in odds that should seem somewhat silly. But what's so amazing is how first-time director Seth Gordon plunges the viewer into this world, and it's immediately recognizable to anyone over 18 and under, well, 55 to 100- anyone who's ever gone to play one of the \"old-school\" arcade games like Donkey Kong or Pacman/Mrs. Pacman or even Pong. We see how the players have to not just go into the games haphazardly by luck; like football, there's game-plans and strategies, and like that sport there are also some obstacles that are apart of the nature of the design of the sport. There's a whole incredible facet one takes for granted, for example, about the technology of the machines, which despite being eclipsed many times over by new systems can still be tampered with, as is the case with Steve's first machine that reaches the top score, and then discredited because of a chip possibly (or not) being replaced or implanted in to give leverage at a non-gamer store. Yet the more slippery side-stepping for players is what's even more intriguing. Characterization can be a tricky thing for the documentary director to deal with, but in King of Kong it becomes something of a controversy left by the wayside as Billy surpasses Steve's score with a game he played recorded on videotape- while Steve set his score by an official Twin Galaxies referee (Walter Day, to be exact, who's a character in and of himself)- with more than a few skips right were the score should register. Saying it skims the line of reality and mockumentary comes with the territory- after a while watching Mitchell is like watching someone who's improvising as he goes along, hiding behind his perfectionist guise as a world-class champ and purveyor of fine hot sauces with his fake-buxom wife and lackeys watching every move Steve makes. Aside from it being compelling storytelling as one sees the transformation of Steve from failed baseball pitcher and drummer to a Donkey Kong (and Donkey Kong Junior) champ, making all-time high scores while his kids cry about their poor behinds, it's one of the best kinds of sport-genre features in years. Many times one sees this played out, and it's been parodied in the likes of Dodgeball (\"Nobody makes me bleed my own blood\" came to mind once or twice looking at Mitchell, and his smart but biased cronies are like classic supporting characters), and the clichés and conventions get the better of the narrative. This time there's no pressure to push it into what's expected: we genuinely care what happens in this battle of the joystick, as Steve sheds genuine tears playing his ass off at all accounts of live events whilst Billy sulks away in his living room hearing the updates on his phone. As far as triumph-of-the-human-spirit stories go, King of Kong is hilarious entertainment, sometimes for all the strangest (Day's would-be musical career) and silliest reasons (what's so special about the Guiness book of records, Steve's daughter asks), but engrossing as documentaries should get- one of the best of the year in fact.",
         "I just got done seeing this film in Santa Monica and was so happy that it lived up to how great the trailer makes this film and the characters out to be. It was totally entertaining from start to finish and lives up to the obvious Rocky comparisons. And like Rocky this film deserves it time in the sun right now and hopefully a ticket to the Oscar dance next year. And yes the film was carefully edited to make for some dramatic moments as all films are. It is after all entertainment. But nothing so much that it taints the great story this film tells. I can think of quite a few documentaries and films in the past few years that did the same thing. Fahrenheit 9/11, An Inconvient Truth, JFK and pretty much any story you see told on the news tonight. The truth is left on the editing room floor. AlphaPepper should probably change his login ID to Sour Grapes and remove his head from... well you know. Billy Mitchell is no doubt a nice guy but is perfectly edited as the villain for this film. Steve Weibe is likewise edited to be the perfect underdog. All the other cast of characters in this film and some of their comments make this a film worth seeing. And without a doubt Steve Weibe's daughters \"from the mouth of babes like\" comment steals the whole show in the end. In the end this is just a great story about two men Steve Weibe and Billy Mitchell fighting for title of King of Kong. I hope this film gets picked up for larger distribution so more people can enjoy it like I did.",
         "Maybe the best documentary I have seen in years... A must-see for anyone who loves rooting for the underdog. King of Kong tells the story of two men competing for the highest all-time score in the arcade classic Donkey Kong. Seth Gordon skillfully explores this whole American subculture of die-hard classic video gamers. The fact that this is all real (as opposed to a Christopher Guest style mockumentary) makes it all the more hilarious, but above all this is a true story of inspiration that should appeal to anyone regardless of whether they know anything about video games. In a country dominated by politically-fused documentary/movie propaganda, we need more films like this to remind us of how wonderfully weird we can be. Michael Moore eat your heart out.",
         "I totally disagree with the characterization that Billy Mitchell is made the villain and Steve Weibe the heroic underdog. This film did a great job of just letting each person fill in the colors for themselves. At the end, when Billy Mitchell's finally turning hypocrisy inside out, there are a few shots inserted finally that show that the filmmakers notice what is going on, but that is the extent of it. This is a great film. Like the film American Movie, it is a whirlwind in which the power and depth of the material is remarkable, and yet it is incredibly compelling to watch, start to finish. Another important point is that the film is not only a great treatise on individual psychology and what our winning-obsessed culture has wrought, but a great meditation on how the various types are fostered by and then fuel their immediate relations.",
         "Though this geeky arcade fighting flick may remain an acquired taste, The King of Kong feels like one of the more entertaining documentaries to emerge in years. Even though you would think the chief demographic of forty year old virgins and basement-ridden, antisocial, hardcore, old-school gamers would flip the bill, Kong immediately offers so much more on so many different levels of psychological and sociological intrigue that anyone not self-conscious enough to feel embarrassed for investing an emotional stake into a Donkey Kong showdown, (highlighting a bittersweet anti-climax) will find themselves deep inside a world they never thought imaginable. The mock-epic tone, which so many supporting characters delightfully contribute to, feels seized by director Seth Gordon and infused into his charming take on good-vs-evil, letting this potentially inspiring metaphor stretch it's wings into a blossomed, well-rounded quirk-fest far more fun then it's rigorous gaming pedigree would suggest."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Sport"
      ],
      "productionCompanies": ["LargeLab"],
      "summaries": [
         "In the early 1980s, legendary Billy Mitchell set a Donkey Kong record that stood for almost 25 years. This documentary follows the assault on the record by Steve Wiebe, an earnest teacher from Washington who took up the game while unemployed. The top scores are monitored by a cadre of players and fans associated with Walter Day, an Iowan who runs Funspot, an annual tournament. Wiebe breaks Mitchell's record in public at Funspot, and Mitchell promptly mails a controversial video tape of himself setting a new record. So Wiebe travels to Florida hoping Mitchell will face him for the 2007 Guinness World Records. Will the mind-game-playing Mitchell engage; who will end up holding the record?",
         "Die-hard gamers compete to break world records on classic arcade games."
      ],
      "budget": 0
   },
   "movielensId": 54881,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-08-17",
      "dvdReleaseDate": "2008-01-29",
      "directors": ["Seth Gordon"],
      "runtime": 83,
      "movieId": 54881,
      "title": "The King of Kong: A Fistful of Quarters",
      "mpaa": "PG-13",
      "actors": [
         "Steve Wiebe",
         "Billy Mitchell",
         "Walter Day",
         "Mark Alpiger",
         "Greg Bond",
         "Craig Glenday",
         "Brian Kuh",
         "Robert Mruczek",
         "Todd Rogers",
         "Steve Sanders",
         "Doris Self",
         "Roy Shildt",
         "Mike Thompson",
         "Derek Wiebe",
         "Jillian Wiebe",
         "Nicole Wiebe",
         "Adam Wood"
      ],
      "imdbMovieId": "0923752",
      "originalTitle": "The King of Kong: A Fistful of Quarters",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["L5XvArGGIzk"],
      "plotSummary": "In this hilarious arcade showdown, a humble novice goes head-to-head against the reigning Donkey Kong champ in a confrontation that rocks the gaming world to its processors! For over 20 years, Billy Mitchell has owned the throne of the Donkey Kong world. No one could beat his top score until now. Newcomer Steve Wiebe claims to have beaten the unbeatable, but Mitchell isn't ready to relinquish his crown without a fight. Go behind the barrels as the two battle it out in a vicious war to earn the title of the true King of Kong.",
      "tmdbMovieId": 13958,
      "avgRating": 3.8153,
      "releaseYear": "2007",
      "numRatings": 1922,
      "posterPath": "/uypCNIyomTC0mCHpNHBiOsB4Xxl.jpg"
   }
}