{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0108328",
      "video": false,
      "title": "Thirty Two Short Films About Glenn Gould",
      "recommendations": [
         44657,
         14639,
         71439,
         85589,
         14268,
         49457,
         25099,
         133,
         85871,
         23001,
         36351,
         88953,
         32636,
         50034,
         85479,
         25939,
         61149,
         84820,
         47122,
         43984
      ],
      "backdrop_path": "/eiQ7j43zPwLS19ndXbqKtGDekeB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Glenn Gould",
               "gender": 2,
               "credit_id": "55104902c3a368487400dca3",
               "name": "Colm Feore",
               "profile_path": "/ack88BRQ7mApRMOdaiOqEUh2FDu.jpg",
               "id": 10132,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gould's Father",
               "gender": 0,
               "credit_id": "5510492d925141065c00567b",
               "name": "Derek Keurvorst",
               "profile_path": null,
               "id": 1239577,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gould's Mother",
               "gender": 0,
               "credit_id": "5510496492514146a000c92d",
               "name": "Derek Keurvorst",
               "profile_path": null,
               "id": 1239577,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Young Glenn Age 3",
               "gender": 0,
               "credit_id": "5510499592514166db00326b",
               "name": "Katya Ladan",
               "profile_path": null,
               "id": 1211071,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Young Glenn Age 8",
               "gender": 0,
               "credit_id": "551049f292514164ac0032ba",
               "name": "Joshua Greenblatt",
               "profile_path": null,
               "id": 1444473,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Young Glenn Age 12",
               "gender": 0,
               "credit_id": "55104a5c92514146a000c945",
               "name": "Sean Ryan",
               "profile_path": null,
               "id": 1444474,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4406c3a368484e00b20b",
               "name": "François Girard",
               "profile_path": "/qapy77nmB5gaFXoMZ2yKxQ4VY7s.jpg",
               "id": 78012,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "570a3291c3a3687796003ffa",
               "name": "François Girard",
               "profile_path": "/qapy77nmB5gaFXoMZ2yKxQ4VY7s.jpg",
               "id": 78012,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "570a32aac3a3687796003ffe",
               "name": "Don McKellar",
               "profile_path": "/cV1nEafG1CqIdnrce5pVw2hcaep.jpg",
               "id": 20173,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.835529,
      "production_countries": [
         {
            "iso_3166_1": "FI",
            "name": "Finland"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         },
         {
            "iso_3166_1": "PT",
            "name": "Portugal"
         }
      ],
      "id": 20967,
      "vote_count": 10,
      "budget": 0,
      "overview": "A collection of vignettes highlighting different aspects of the life, work, and character of the acclaimed Canadian classical pianist.",
      "similar": [],
      "original_title": "Thirty Two Short Films About Glenn Gould",
      "runtime": 93,
      "poster_path": "/ib8uIrU8QzoegCiKKGcMnUuCzBH.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Rhombus Media",
         "id": 164,
         "origin_country": "CA"
      }],
      "release_date": "1993-11-26",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "The sound of genius.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["François Girard"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "François Girard",
         "Don McKellar"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108328/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MTA3NjI0N15BMl5BanBnXkFtZTcwMzUxOTAwMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Colm Feore, Derek Keurvorst, Katya Ladan | See full cast and crew »"],
      "reviews": [
         "I had never heard of Glenn Gould before this movie was released, but I had heard so many good things about the film that I just had to check it out. Am I glad I did. The film is quite unconventional in that it is not a strict \"biopic\" in any sense of the word. The film -- much like the title suggests -- takes 32 vignettes that concern some aspect of GG's life. Gould, a Canadian classical pianist, was by all accounts an unusual yet charming man. A merciless hypochondriac who popped pills incessantly and wore heavy clothing even in the middle of summer, Gould was also enormously talented, both as a pianist and a producer of highly unusual radio programs. The film examines Gould's life, his passions, his obsessions, and of course his music. The soundtrack is breathtaking. Colm Feore portrays the enigmatic Gould brilliantly. If you are a fan of daring, original films -- as well as a Gould fan -- you will not want to miss this.",
         "I have never really been taken in by classical music. When I first saw this film, I thought, oh! THAT'S why people like it. So I went and bought a few Gould CD's, listened to them a few times, and went back to jazz and punk shortly thereafter. This film is an exceptional piece. The music is certainly the most important aspect of the film, but it so strongly highlights the character of Gould (who was one wacky Canuck), and the cinematography, that as a package, I found it a moving experience that superceded the music. Basically a series of vignettes, with no coherent plot, but rather snippets of docu-drama, interviews, and a couple of animated sequences (one quite good, the other detracts entirely from the whole), this is a film meant probably not for fans of classical, but an introduction to the possibilities and drama of the virtuoso for media-children. Although primarily another \"crazy genius\" film, it is truly a stunning piece overall. I strongly recommend this for any collection, no matter one's musical inclinations. Although primarily another \"crazy genious\" film, it is truly a stunning piece overall. I strongly recommend this for any collection, no matter ones musical inclinations.",
         "Girard succeeds where many have failed- he creates an intimate portrait of an artist without falling subject to the cumbersome confines of the narrative 'birth to death' storyline format. What better way to breathe life into a musician's 'story' than rhythmically assembling a collection of several recreated happenings, bits of documentary conversation, and performances of actual musical pieces (orchestrated works of Gould's) that each examine a particular instance from Glen Gould's life? By avoiding a typical diluted overview of the artist's entire timeline of events, Girard instead picks out specific happenings in Gould's life that each tells a story of a complex, confused, and brilliant man. These shorts are shown in a somewhat chronological order, so as not to completely ignore the fact that the collection of shorts aims to sculpt a more complete picture of Gould. Their consecutive placement being rhythmically conscious, the viewer is never lost in the experimental efforts or the non-narrative spectrum of the shorts, as they are closely followed by the more tangible aspects of Gould's life. Aesthetic elements from Gould's creative life are often carried over from one short to the next, which helps reinforce the unity as a whole of the 32 separate films. One of the most important aspects this structure brings to its audience is freeing them from the typical passive role. Instead of loosing yourself into a 2 hour story that tries its hardest to make it's viewer forget their lives, troubles, and identities by sweeping them into a fantasy world, the constant breathes between these short episodes remind the audience what they're seeing more resembles a diary from the artist rather than an alternate reality to 'forget oneself' in. Aside from the highly effective (and I believe far more suitable) structural effort of the film, the camera's language combined with the film's language is very conventional (aside from the sound editing in several cases). At times, the extremely literal usage of visual imagery falls a little flat, but it also works within its context in particular cases. Other innovations in the film stem from the content chosen (or even more so, what the filmmaker chooses not to show in several of the shorts). An excellent film for those who are humbled at the overwhelming confusion even the brilliant can carry.",
         "the concept works. i like how the film is composed of individual films, yet the individual films do an excellent job of telling a singular, cohesive story. the best aspect is that we don't have to deal with the boring plot proceedings- we just fill in the blanks ourselves. learning about gould's personality through the dialogue kept my interest, but looking back, it was actually the strictly instrumental pieces that really kept my interest. fortunately gould's actual performances are mesmerizing enough on their own to really supplement the visuals. a couple of favorites off the top of my head are \"man sitting in chair\" and \"a day's journal\" (sorry, not the exact titles i think). colm feore, i've seen you in about a dozen pictures, but this is the one that made me really notice your name.",
         "I saw this on DVD and enjoyed it thoroughly. The means of portraying a person - through short and disconnected vignettes - was surprisingly natural. When you think about it, this is often how we learn about people: a collection of stories, incidents, things their friends say about them, memories from childhood. Not only that, but it nicely parallels some of the music, such as the short pieces in Bach's Well-Tempered Klavier. Each has a different mood, but together they paint a complete picture. This movie is a lot of fun for anyone who is fond of classical music and willing to experiment a little bit with film.",
         "The eccentric behavior of rock and pop icons usually take center stage in the media, but here's a classical musician and virtuoso performer that literally steals the show, both in achievements and lifestyle. Glenn Gould popped pills, gave up performing live concerts because not everyone in the audience could hear the music the same way, created radio documentaries that mirrored symphonies and played the stock market like an expert. Glenn Gould was a typical hermit who only called people to talk when he was bored, he wanted to visit the arctic in the dark of winter and he donated his estate to charity. He died from a stroke at age 50, but recordings of his music have been sent into space. Glenn Gould lives on in the hearts of classical music fans and those who have seen 32 Short Films About Glenn Gould.",
         "I realize that this is a well made film, and many people, Gould fans or not, enjoyed it very much. But on the chance that someone out there is on the same wavelength as me, I'll tell you why I didn't like it. The film paints the picture of a self-absorbed, eccentric oddball... a bit arrogant and presumptuous (like when he grabs a lowly chambermaid and makes her listen to one of his records as a sort of reward for her day's work). The Glenn Gould character always speaks in a supercilious New England tone of voice (think Frazier but without the jokes). He says phrases like \"never the twain shall meet\". If you're like me, you might have a healthy mistrust of people who say \"twain\" unless they're talking about Huck Finn. Maybe you can guess the problem: unless you're already convinced that Glenn Gould is god's gift to Carnegie Hall, the film offers no motivation to like him. This could have been EASILY remedied by showing a performance to earn the audience's respect. It could have been an archival clip, or even a semi-convincing pantomime by the actor playing Gould if done convincingly would have made me take the character more seriously. But we never get that. So the result is a whole bunch of people telling us how great he is, including the Diva himself. It gets irritating. I feel like the real Glenn Gould was cheated. Here is a film, purportedly in honor of a great musician, which never shows him being a musician. Instead we get a lot of ponderous scenes of (the actor playing) Glenn as he walks across frozen lakes, or sits in a chair unmoving with an intense expression on his face, or waving his arms dramatically in the air while listening to the playback of one of his recordings. People around him are made to look like simpletons for not being on the same supernatural level as Gould. They chatter about coffee or gardening while the maestro slips further away into a lofty dreamworld that we mortals cannot dare understand. The entire film thus takes a very condescending air, telling us that Gould was a misunderstood genius yet not offering to show us what exactly was genius about him. I read that the actor playing Glenn chose not to be shown playing the piano out of respect for Mr. Gould. Could someone please explain that to me? It's OK to act like someone being a goofy oddball dancing to invisible pianos in his head, but it's somehow disrespectful to portray him actually playing one? I was not familiar with Glenn Gould before I watched this, and 90 minutes later I'm still completely clueless. Even worse, I'm not particularly inclined to learn more. I believe this film is great for people who are already fans of Gould, or perhaps casual fans of classical music as a whole. Me, I'm a hardcore classical music fan who never happened to hear Glenn Gould (there are so many amazing musicians out there, it happens). If I were to list the best musical documentaries & biopics I've seen, they would be \"Standing in the Shadows of Motown\" about the unsung studio musicians who made it happen, \"Anvil! The Story of Anvil\" a hilarious and heartfelt documentary about a bunch of aging rockers who never say die, and of course the masterpiece \"Amadeus\" which, like this film, shows the maestro as an arrogant oddball, but it shows powerful musical performances which instantly earn our respect and interest. Really, just one lousy performance would've made all the difference, but alas I can't say this movie impressed me.",
         "Let me preface this review by saying: the music of Bach permeates my existence. Over the years, I've listened to nearly every recording there is, repeatedly. That said, I had trouble watching this movie. The first time I tried, I quit after five minutes. Last evening, I made it all the way through. While at times moving, the film disturbs. For one, it does not do visual justice to the music. Bach's compositions are not about waving hands in the air, geometry animations, or men walking off into infinity. They're complex literary statements. This variety of music is akin to the best silent cinema; it says volumes, but without words. Like pantomime, it tells a nuanced story, weaving multiple plot lines together into an evocative fabric. Few of the 32 vignettes approached that ideal. Could it be that some of Bach's greatest admirers fail to grasp the deeper meaning within the music? In addition, Gould's personal faults grate on the nerves. It's clear he wasn't an ideal specimen. He mistook music for life. Music is a condiment, a catalyst perhaps. It frames life, drawing attention to worthy matters. It spices and enlivens life, making it savory. But it is not life. His mind was filled with picture frames, but no pictures. He fell in love with music in the same way that parrots sometimes mistakenly bond with their human owners. They are not parrots, and music is not a woman. One wonders how Bach might greet Gould in heaven: \"So, the bachelor thinks he understands the man with two wives and twenty children? Let's see what kind of music you'll play after we give you a well-rounded life.\"",
         "Spoilers herein The other half claim that the world is divided into two types of people. Depending on your vocabulary these are neurotics and psychotics; heads and hearts; numeralists and geometers; fatalists and cocreators and so on. Whatever terms you like to use, Gould is in the first of these, and that reflects his approach to music. Bach is also. Bach's music is highly mathematical, almost mechanically so. Stripped of emotion, it is pure in an abstract, cosmic sense. Gould's approach to music (and life -- not an incidental overlap) is neurotic, highly charged, anticipative, brilliantly logical, nimble. This mix -- together with a relatively more common virtuosity with the instrument -- makes Gould the best performer of Bach we have. His animation of the mathematics is always ahead of our own perception, so it makes the mathematics seem more alive. Not real life, but the kind of life we see in animated spheres. Contrast this with another world entirely, say Rubenstein (or Argerich!) and Chopin. This music is human, rooted not in some abstract aether, but in the soul. It is not clever, but real. It is not golden, but tearful, sweaty. It deals not with celestial mechanics, but with yearnings. Not with precision but with hesitations and local attractions. Not with planetary gravity but the emotional kind. Myself, I consider the latter to be true music, the life-altering kind. The former is brilliant decoration, also perhaps interesting technically. And that's the problem with this film: it emulates the Bach notion of little snapshot explorations. Each one is crafted to be technically brilliant; each one has some conceptual relationship with its neighbors. The sum triangulate the matter, giving a totality of external but abstract and distant probes. But the method lacks soul, and the subject here does too. We are intrigued by his eccentricities, but never invest in his being, because he doesn't have one in the musical sense. He has washed it away. For myself, I have to relegate this film to the huge stack of failed attempts to give us a film about music that has the same power, and type of power, as that music. It may be too hard an endeavor, but in this case the enterprise fails because the subject is in the wrong half of humanity.",
         "This is a fascinating documentary on a fascinating subject - eccentric Canadian pianist Glenn Gould. The film prefers snapshot technique to straight narrative, and the leading character comes alive in Colm Feore's vivid performance. This one makes you believe that art is not dead as long as the people like Gould still exist."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Rhombus Media",
         "Téléfilm Canada",
         "Ontario Film Development Corporation, The"
      ],
      "summaries": [
         "As the title suggests, this dramatised documentary about the eccentric Canadian pianist Glenn Gould is broken up into thirty-two short films (mirroring the thirty-two part structure of Bach's 'Goldberg Variations', the recording that Gould made famous), each giving us an insight into some aspect of Gould's life and career. Out of respect for the music lead actor Colm Feore is never seen playing the piano, merely reacting to Gould's own recordings, which are extensively featured",
         "A collection of vignettes highlighting different aspects of the life, work, and character of the acclaimed Canadian classical pianist."
      ],
      "budget": 0
   },
   "movielensId": 549,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1993-11-26",
      "dvdReleaseDate": "2001-02-20",
      "directors": ["François Girard"],
      "runtime": 93,
      "movieId": 549,
      "title": "Thirty Two Short Films About Glenn Gould",
      "mpaa": "",
      "actors": [
         "Colm Feore",
         "Derek Keurvorst",
         "Derek Keurvorst",
         "Katya Ladan",
         "Joshua Greenblatt",
         "Sean Ryan"
      ],
      "imdbMovieId": "0108328",
      "originalTitle": "Thirty Two Short Films About Glenn Gould",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A collection of vignettes highlighting different aspects of the life, work, and character of the acclaimed Canadian classical pianist.",
      "tmdbMovieId": 20967,
      "avgRating": 3.89187,
      "releaseYear": "1993",
      "numRatings": 1489,
      "posterPath": "/ib8uIrU8QzoegCiKKGcMnUuCzBH.jpg"
   }
}