{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "pianist",
            "id": 14743
         },
         {
            "name": "bandleader",
            "id": 171346
         }
      ],
      "imdb_id": "tt0049170",
      "video": false,
      "title": "The Eddy Duchin Story",
      "recommendations": [
         95307,
         118534,
         78256,
         2382,
         83994,
         43693,
         151431,
         53156
      ],
      "backdrop_path": "/4obt4AR0GTv3UHirv0gsn26KdgB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marjorie Oelrichs Duchin",
               "gender": 1,
               "credit_id": "52fe4633c3a36847f80f2503",
               "name": "Kim Novak",
               "profile_path": "/uTxpa6y6nKo2nfpOP4zsR6abLdi.jpg",
               "id": 5729,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eddy Duchin",
               "gender": 2,
               "credit_id": "52fe4633c3a36847f80f2507",
               "name": "Tyrone Power",
               "profile_path": "/zHKNyYKkWIQBwhqxCMNBns1eoXR.jpg",
               "id": 10922,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lou Sherwood",
               "gender": 2,
               "credit_id": "52fe4633c3a36847f80f2515",
               "name": "James Whitmore",
               "profile_path": "/r1xOgXFjqhn2fonn78rlXKPZGFw.jpg",
               "id": 6577,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Chiquita",
               "gender": 1,
               "credit_id": "52fe4633c3a36847f80f2511",
               "name": "Victoria Shaw",
               "profile_path": "/29mbub06AU0TAaRrH7hAo4ksQ8P.jpg",
               "id": 24321,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Peter Duchin, Age 12",
               "gender": 2,
               "credit_id": "52fe4633c3a36847f80f2525",
               "name": "Rex Thompson",
               "profile_path": "/mHvPiZcJYdLtTWjOGkLEkLEWhbW.jpg",
               "id": 80574,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Sherman Wadsworth",
               "gender": 2,
               "credit_id": "52fe4633c3a36847f80f2529",
               "name": "Shepperd Strudwick",
               "profile_path": "/4LH8tFZHdejNYRdJyka1Wo3a4H.jpg",
               "id": 82676,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Edith Wadsworth",
               "gender": 0,
               "credit_id": "52fe4633c3a36847f80f252d",
               "name": "Frieda Inescort",
               "profile_path": "/qzAqyCip9c5ke3d31UMSgCTkUt4.jpg",
               "id": 82383,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mrs. Duchin",
               "gender": 1,
               "credit_id": "52fe4633c3a36847f80f2531",
               "name": "Gloria Holden",
               "profile_path": "/3DsqCoOmWqVw4OKeEQWdWt4gFpm.jpg",
               "id": 100779,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Leo Reisman",
               "gender": 2,
               "credit_id": "52fe4633c3a36847f80f2535",
               "name": "Larry Keating",
               "profile_path": "/fnPWT7akYTPoLCpOlbzlFaqmIIn.jpg",
               "id": 113654,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Piano Tuner (uncredited)",
               "gender": 0,
               "credit_id": "581efdd492514125620022c7",
               "name": "Jack Albertson",
               "profile_path": "/8vmSxUnRqZ23bCWMim2Y1pOvSAD.jpg",
               "id": 3461,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Xavier Cugat (uncredited)",
               "gender": 2,
               "credit_id": "581efdeb92514127e7002188",
               "name": "Xavier Cugat",
               "profile_path": "/pZqbwaJrOK44EMrEpwKc6Dd5G9z.jpg",
               "id": 579763,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Party Guest at Central Park Casino (uncredited)",
               "gender": 1,
               "credit_id": "581efe07925141279a002306",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4633c3a36847f80f250d",
               "name": "George Sidney",
               "profile_path": "/t5NzhZ8yYL3hDMm5mGNC7t97qSk.jpg",
               "id": 21506,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4633c3a36847f80f251b",
               "name": "Samuel A. Taylor",
               "profile_path": "/1gbnU6wefpK9gMPGgTGEUAYyp2H.jpg",
               "id": 5736,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4633c3a36847f80f2521",
               "name": "Leo Katcher",
               "profile_path": null,
               "id": 233221,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "57ebf3fe9251411853000c21",
               "name": "Harry Stradling Sr.",
               "profile_path": null,
               "id": 10537,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a86d958c3a36863e703702d",
               "name": "Jerry Wald",
               "profile_path": "/f1eGCdVgtKLU9DYcwquzxWhZ86.jpg",
               "id": 29098,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a86d967925141759303ae65",
               "name": "Jonie Taps",
               "profile_path": null,
               "id": 113582,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a86d9710e0a2653db03c748",
               "name": "George Duning",
               "profile_path": null,
               "id": 16748,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5a86d97bc3a36862a70358ab",
               "name": "Viola Lawrence",
               "profile_path": "/aDkP1OYE8oS6DCkZRrxQ4OkHERf.jpg",
               "id": 34224,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a86d9859251410b010346ec",
               "name": "Jack Ogilvie",
               "profile_path": null,
               "id": 986278,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a86d9909251410aae037b31",
               "name": "Walter Holscher",
               "profile_path": null,
               "id": 34344,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5a86d997c3a36862a70358cd",
               "name": "William Kiernan",
               "profile_path": null,
               "id": 34436,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5a86d9a1c3a36863e7037070",
               "name": "Robert Priestley",
               "profile_path": null,
               "id": 3649,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5a86d9aec3a368633903b869",
               "name": "Jean Louis",
               "profile_path": "/uJ2hQZlHtrMJpcigGtM6KP7svBz.jpg",
               "id": 12145,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5a86d9bc9251410a1f0370be",
               "name": "Seymour Friedman",
               "profile_path": null,
               "id": 121396,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.198251,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43199,
      "vote_count": 10,
      "budget": 0,
      "overview": "The life story of the famous pianist and band-leader of the 1930s and 1940s.",
      "similar": [
         462,
         640,
         769,
         5915,
         11202,
         423,
         45317,
         371638,
         324786,
         363676,
         389015,
         407445,
         318846,
         396371,
         323677,
         228970,
         274479,
         152532,
         300671,
         276907
      ],
      "original_title": "The Eddy Duchin Story",
      "runtime": 123,
      "poster_path": "/sjn4cLC4b6nS0yZuBAV3FQh3AeM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1956-05-02",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Sidney"],
      "runtime": 123,
      "synopsis": null,
      "writers": [
         "Samuel A. Taylor",
         "Leo Katcher"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049170/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQ2NTk5ODMyMV5BMl5BanBnXkFtZTcwMjc0NDUxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Tyrone Power, Kim Novak, Victoria Shaw | See full cast and crew »"],
      "reviews": [
         "With the help of Marjorie Oelrichs (Kim Novak), a charming socialite he has met at New York's Central Park Casino, Eddy Duchin was part of the two piano team featured by Leo Reisman (Larry Keating) Orchestra in the late 1920's.. Duchin's distinctive playing wins him rapid fame... His measured weight of fingering ensured a balance between poetry and purpose... Every sound conceivable was possible in his artistic palette... He played wonderful music... His piano tone itself was gorgeous and versatile... He amazed audiences with his immense vigor, virtuosity and daring technique... He was soon a darling of Marjorie and high society... His love affair with Marjorie culminates in marriage... but the perfect happiness is short-lived as Marjorie fades away in child-birth on Christmas Eve... Heartbroken, Duchin declines to accept his baby blaming him for Marjorie's death and turns him over to Marjorie's uncle and aunt to be cared and raised, and embarks an overseas concert tour with his friend & manager, Lou Sherwood (James Whitmore). During World War II, while serving as Naval Lieutenant Commander in the Pacific, Duchin realizes the futility of his attitude about his son, now ten, but his attempts to reconcile with him failed because of the boy's resentment... With the help of Chiquita (Victoria Shaw) Peter's pretty nanny, he finally wins his son over and with his ability to charm as well as to thrill audiences, he proves himself as the pianist of sentiment par excellence... Nothing equaled the lightness & sweetness of his preluding on the piano... But tragedy once again overtakes Duchin's daisy fingers as he learns he is suffering from leukemia and has only a short time to live... Duchin's passing from the scene playing a \"little double piano\" with Peter is a duo-handkerchief climax... Tyrone Power won the hearts of the audience playing the pianist and bandleader Eddy Duchin... He does not interpret music, he exudes it, breathes it, compelling showmanship with great freedom, taste and intelligence... With a stupendous distribution of Duchin's fine piano, the film is predictable, handsome & sentimental...",
         "This was one of my favorite movies as a kid - not only does it have great musical sequences, but it is a real tearjerker. I read recently that this movie just about ruined the life of Peter Duchin, Eddy's son. I can't imagine what it must be like to be a character in such a popular film that shows up on AMC just before you play your next gig. George Sidney did a beautiful job of directing, and no expense was spared for this Technicolor movie filmed on location in New York. There are so many great shots of the city -- if you're familiar with New York, watching the movie is all that much more enjoyable. The film appears to follow the structure of Duchin's actual life but how much is fact and how much is fiction is hard to say. What is fact is that Carmen Cavallero does a divine job dubbing the piano, and Tyrone Power's fingerings are excellent. He apparently worked at them night and day, and the result was worth it. There are some wonderful scenes in the film, one of the best being when Duchin talks about his love for Marjorie to Chiquita, who is about to become his new wife. It's such a beautiful monologue about how you can be young and love someone the way he did Marjorie only once, watch your parents age only once etc. - needless to say, hearing that little speech today means more to me now than it did when I was 14. Another great scene is Eddy and a little boy playing chopsticks on a rickety piano in wartime; and, of course, Eddy talking to his son at the playground toward the end of the film. Tyrone Power knew Eddy Duchin personally as he knew just about everyone, and his portrayal is masterful. In the beginning, however, he's the young Eddy and it's obvious that he's way too old to be fresh out of college. Power was 41 at the time of the filming, and it wasn't the 41 of 2006 - it was a 1950s, three-pack-a-day, party all night, I fought in World War II 41 - hello. You would have thought that the lighting man and cameramen would have worked just a tad harder - we're talking about Tyrone Power here, not some nobody. A little star treatment, please. Instead, Power ends up looking younger in the second half of the film. Ridiculous. There are lots of posts about Kim Novak, who is very beautiful though vapid as Marjorie, but not much mention of the beautiful Australian actress, Victoria Shaw, who played Chiquita. Like Power and Duchin, she died young. She does an excellent job in the movie. One of the comments suggested the character of Chiquita is fictional; in fact, Duchin's widow was indeed Chiquita Wynn Duchin, and in 1947, Peter Duchin left the Harrimans to live with his father and his stepmother. Rex Thompson plays the young Peter Duchin and though he makes a game try at hiding his British accent, he sounds British. As a young adult, Thompson was a handsome and fine actor - he worked into his twenties, and then faded from view. In real life, Peter Duchin went on to marry Margaret Sullavan's daughter, Brooke Hayward. It's hard to hold back the tears during \"The Eddy Duchin Story,\" so don't try. Enjoy the romance and be enveloped in a more gentile world where people had some class, and listen to that great music.",
         "Expecting to be bored but knowing my wife would love the music, I sat through 'The Eddie Duchin Story.' I'd never heard of Duchin, except to know his son, Peter, was a fine pianist. Earlier in the evening, I'd endured 'The Passion of the Christ,' and I really wasn't in the mood for another downbeat movie. Much to my surprise, I loved every aspect of 'Duchin.' Columbia's 'Monroe,' Kim Novak got top billing, much to my surprise, since Tyrone Power was still a top matinée idol. Well, let me tell you, whatever jokes you've heard about Novak, you'll forget them when you see her a Marjorie, Duchin's doomed socialite wife. Appearing less than an hour, Novak's grace and sweetness permeates the whole movie. You'll adore Novak as much as Duchin. Power is only slightly less effective, but he has a much rougher job. Power is in his mid forties when he plays Duchin, and he must play the first hour as a man in his mid twenties. Power is so frenetic, so energetic and earnest, you fear he's going to have a heart attack. He did, three years later on 'Solomon and Sheba' and died on the spot. Anyway, back to 'Duchin.' James Whitmore is magnificent, as usual in a small role as Duchin's manager. His little bit of business putting on his hat near the end of the film perfectly captures and advance the mood of the movie. Victoria Shaw is given the thankless role of Duchin's second wife, and she hit just the right notes to make an impression without overpowering the narrative. After all, this is Duchin's story, and her part of it is a small but key part. Rex Thompson is perfect as young Peter Duchin, displaying all the emotional conflicts a child would endure with his history. He has an absolutely great scene near the end of the film, but I won't spoil by telling you what happens. Let's just say he takes of the responsibilities of manhood far younger than a child should. Warren Hsieh as the native boy, is wonderful in helping to capture the mood that is yet another turning point in Duchin's life. Producer Jerry Wald has spared no expense at recreating a era in a manner as convincing as 'Titanic'. Director George Sydney once again proves he is skilled with a camera as he is with actors. The first kiss between Powers and Novak is seen as a reflection in a puddle. Just beautiful! George Duning provides the incredible score. Carmen Cavallaro performs the great piano classics.. I don't cry in movies too often. I didn't cry once in 'The Passion of the Christ'. But I couldn't hold back tears in many scenes in 'The Eddie Duchin Story'. That's saying a lot. Sure, 'The Eddie Duchin Story' is soap. But, there are many kinds of soap. Oil of Olay leaves you feeling fresh and clean and invigorated. So does 'The Eddie Duchin Story'. I give 'The Eddie Duchin Story' a '10'.",
         "If you like to watch actors who are skilled, have on screen chemistry to die for (and they do) and enjoy cinematography that might make you want to take a stroll in Central Park, then rent, buy, borrow this CD and sit back and watch it over and over and over again. This is a well adapted screen play that moves through a life, tells the story well and makes this love story very believable and of course tragic. Watch the life of an extraordinary talent and sit back and enjoy. Tyrone Power never disappoints and if you can capture his voice and keep it in a bottle, you would And Kim Novak is stunning, sweeping and is well cast. As Marjorie Oelrich she couldn't be more perfect. Also, besides being an exceptional beauty, she, too, has a lovely voice. In a very understated way, you want her to go on and on and on. James Whitmore always delivers. All cast members are charming. You'll love the actor who plays Lou Reisman, the orchestra leader at the Central Park Casino. Enjoy folks. This one is a keeper. OHHHHHHHHHHH, you'll be amazed at how well Tyrone Power plays the piano, or seemingly appears to be playing. The music!!!! Oh, the music. Now to the truth. There are many changes to the real story of Eddy Duchin. Peter Duchin was raised by Marie (he called Ma) and Averell Harriman. Peter's mother, Marjorie Oelrichs, died in July. Not as depicted in the film after Eddy Duchin's radio show from the Central Park Casino in the Winter, Christmas. The Harriman's are portrayed as the Wadsworth's. Why? I don't know why but if you read Peter Duchin's book \"A Ghost of a Chance\", you will get more of the inside scoop. Still a wonderful film. I don't believe the young actor Rex Thompson was even close to Peter Duchin's persona. But that's my story.",
         "The fine musical scenes and Tyrone Power's excellent performance are among the highlights of THE EDDY DUCHIN STORY, filmed in spectacular CinemaScope and containing lavish production values and fine performances from its cast. It's sensitively directed by George Sidney, a veteran director of M-G-M musicals, and\u0097as one reviewer may have pointed out\u0097the film is indeed a lovely Valentine to Eddie Duchin's memory. The film is a delight to watch and is highly enjoyable yet quite tragic in places. However, there are flaws within the film due to the sentimental music score and some unbelievably saccharine and fanciful scenes. But the fine performances and direction, as well as the beautifully filmed music sequences, make up for such flaws. I felt the same way about the George Gershwin biopic, RHAPSODY IN BLUE (1945). Tyrone Power's performance as the talented and popular pianist is one of Ty's very best performances. Although Ty's looks remain middle-aged throughout the entire film, his transition from a young pianist in the 1920s to a World War II veteran battling leukemia is entirely believable. The film was a box-office hit in 1956 and was nominated for four Oscars\u0085but sadly, Tyrone Power was not nominated. I presume that it had to do with his \"pretty boy\" matinée idol roles at 20th Century-Fox in the past, which were roles that Ty hated playing and did little to enhance his reputation as an actor. THE EDDY DUCHIN STORY is well worth watching, even more so for its piano sequences. And did I mention the hauntingly gorgeous Kim Novak? She stole my heart for about a half-hour, and she and Ty have nice chemistry together...even though she and Ty did not get along very well off-camera.",
         "Eddy Duchin's music was so beautiful. He had a magic touch at the piano. Unfortunately, his real life was so tragic. Tyrone Power shines as Duchin. From his beginnings to success, Power evoked the right temperament in portraying this musician brilliantly. Kim Novak, just off an awful performance in the acclaimed \"Picnic,\" the year before, gives a wonderful supporting performance as Duchin's ill-fated first wife. Who can forget her fear of rain and thunder? Who can forget that thunder scene in the hospital as her life ends? Victoria Shaw, as Eddy's second wife, is also quite good. She brings Eddy back so that life is worth living for him and is able to reconcile him with his young son, whose birth Duchin blamed for the death of his first wife. We are fortunate to have had such a picture made and the legacy that Duchin left-his playing as well as his son, musician Peter Duchin.",
         "In the late 20's, the talkative newly graduated in pharmacy and aspirant piano player Eddy Duchin (Tyrone Power) comes from Boston to New York expecting to play with the orchestra of Leo Reisman (Larry Keating) at fancy New York's Central Park Casino. However he had misunderstood the invitation of the maestro and while leaving the place, he meets the wealthy socialite Marjorie Oelrichs (Kim Novak) that asks Leo Reisman to give a chance to Eddy. He plays in the intermission and becomes a successful piano showman. Two years later, Marjorie and Eddy get married and in the Christmas, Marjorie has a baby, Peter, but she dies after the delivery. Eddy rejects Peter blaming him for the death of Marjorie and only five years later he meets his son. With the World War II, Eddy Duchin breaks up his band and enlists to fight in the war. With the end of the war, Eddy returns to New York with the intention of getting closer to Peter but he sees the boy connected to his friend Chiquita (Victoria Shaw). When Eddy discovers that he has a terminal disease, he proposes Chiquita and they get married. When we see the biography of a personality by Hollywood, we are never sure that it is a true story or a fairy tale created by the cinema industry. Despite of that, the melodramatic \"The Eddy Duchin Story\" is a nice story of a man's life surrounded by music, beautiful ladies and tragedies. The forty-two year-old Tyrone Power has good performance and he really seems to be playing the piano, but it is funny to see him in the role of a newly graduated man. Kim Novak shines with her beauty, elegance and her sweet voice. Victoria Shaw is also gorgeous. The cinematography and the music score are awesome and deserved the nomination to the Oscar. My vote is seven. Title (Brazil): \"Melodia Immortal\" (\"Immortal Melody\")",
         "While probably not the greatest biopic to come from Hollywood, this is, at the very least, a well-paced drama with some really fine musical sequences. Power is just fine in his role, and pulls off his \"piano playing\" believably enough. Kim Novak looks stunning, of course, and does a very nice job in her role. It is a pity that she is written-out halfway through the film, but the second half does alright without her. If you enjoy a mild, soapy \"psuedo-bio\" film, then you may enjoy this one. Even better, if you enjoy the piano.",
         "I saw this movie when I was 11 years old in 1959. Although, over the years, I was hooked by the songs in the movie and bought the record and tape to listen to in my adult life, I saw the the movie again last month and it brought a real new meaning of the life of Eddie Duchin. I was seeing the movie as an adult, not as a kid. Tyrone Power, who I have admired for years, play the part of Duchin real well. His portrayal as a father trying to reach to his son was touching and realistic. Kim Novack was very good in her part as his wife. The songs especially Chopin's E flat major and Manhattan were very well played by Carmen Cavallaro. Cavallaro is a favorite artiste of mine. He plays superbly and brings out the flavor of the songs. This movie is a classic and should be highly recommended.",
         "Wow, what a mix of bad and good. The good is the music and the amazing period shots of New York. The bad... well just about anything else; its all rather poorly done. The script is particularly offensive; more about that in a moment. The acting is that goofy type which is unnatural, but not quite the unnatural stage style, more of a \"read to the camera\" style. Novak is pretty, but moves gracelessly. The story they have chosen to tell is a simple one: we learn to love a man through his ambition, gains, losses, sorrow and regaining of humanity after the war. This is about America after the war, not some pianist. Then sorrow strikes again and he handles it so wonderfully you applaud while crying. At least that's the goal and it probably worked for most viewers when this was new and America was trying to cope with post war loss. Something closer to the real story would have made a killer movie. Duchin was made famous by his recording that was the first use of the F-work in that medium. His first wife did die, but he was hardly grief-stricken \u0097 a famous womanizer. He did leave his boy with Averill Harriman's wife when he went to war. But that was because he was sleeping with her, while her husband was off in England sleeping (and finally marrying) another man's wife. The son of Winston Churchill in fact, so Harriman hardly cared about his wife's affair with a New York celebrity. Harriman was an amazing character through the period of this story. He, Dulles and Marshall shaped the world after the war in a liberal mold, essentially reforming Europe as a unit and building NATO, which for many decades was a very good thing. His presence through this movie as sort of an avuncular figure would be like having John Kennedy as a butler. The loss of the power-as-sex game and music-as-power thrust sort of waters down the whole thing. Why do I care? Because Harriman was particularly concerned about rebuilding France, a country that had humiliated itself and had no means to rebuild. It was, as now, an agricultural economy and Harriman couldn't see Americans subsidizing French farmers for decades. So he (his staff, yes Democrats) came up with the ideas of romanticizing Paris and Rome. Make them romantic cities that tourists would visit. They surely were not before the war. Paris had had its day as a center of art but never ever of romance. The plan was pulled off flawlessly, primarily through subsidies to Hollywood to make films that portrayed Paris romantically. Many of those films were from the same period of this film, an extreme irony. Extreme, you know. Harriman's first wife, the one playing with Duchin, had cheated on and left her first husband as well, an extremely wealthy fellow who just happened to be the financier of Technicolor which we find our self enjoying in this very film. Oh well, there is the music, How can you fault any film that starts with Chopin? Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "In the late 20's, the talkative newly graduated in pharmacy and aspirant piano player Eddy Duchin comes from Boston to New York expecting to play with the orchestra of Leo Reisman at fancy New York's Central Park Casino. However he had misunderstood the invitation of the maestro and while leaving the place, he meets the wealthy socialite Marjorie Oelrichs that asks Leo Reisman to give a chance to Eddy. He plays in the intermission and becomes a successful piano showman. Two years later, Marjorie and Eddy get married and in the Christmas, Marjorie has a baby, Peter, but she dies after the delivery. Eddy rejects Peter blaming him for the death of Marjorie and only five years later he meets his son. With the World War II, Eddy Duchin breaks up his band and enlists to fight in the war. With the end of the war, Eddy returns to New York with the intention of getting closer to Peter but he sees the boy connected to his friend Chiquita. When Eddy discovers that he has a terminal disease, he proposes Chiquita and they get married.",
         "In the early 1930s, Bostonian Eddy Duchin, just having graduated from pharmacy school, decides instead to go to New York City to pursue his dream of becoming a rich and famous pianist, especially as he has a standing job offer from band leader Leo Reisman to play in his band which performs at the Central Park Casino. Reisman had heard Eddy's makeshift band play while Eddy was still in college. Despite Eddy's easy-going performing style and natural charisma on stage, the job offer is not as he believes. Eddy does, however, manage to rise to professional musical renown with the help of who becomes his biggest booster, New York socialite and interior designer Marjorie Oelrichs, who works because she does not want to be beholden to easy money. But Eddy's life in New York does not end up as he wants due primarily to a personal tragedy. He runs away from everything associated with that tragedy, which he believes was his own doing. It becomes easier to do so with the onset of WWII. But when Eddy decides to embrace life again - especially one specific outcome of that tragedy - Eddy finds that it is not as easy as he would like. He may be able to understand how to find that happiness he so desires the second time around with the help of Englishwoman, \"Chiquita\" Wynn, unless...",
         "The life story of the famous pianist and band-leader of the 1930s and 1940s."
      ],
      "budget": 0
   },
   "movielensId": 5491,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-01-01",
      "dvdReleaseDate": "2002-07-16",
      "directors": ["George Sidney"],
      "runtime": 123,
      "movieId": 5491,
      "title": "The Eddy Duchin Story",
      "mpaa": "",
      "actors": [
         "Kim Novak",
         "Tyrone Power",
         "James Whitmore",
         "Victoria Shaw",
         "Rex Thompson",
         "Shepperd Strudwick",
         "Frieda Inescort",
         "Gloria Holden",
         "Larry Keating",
         "Jack Albertson",
         "Xavier Cugat",
         "Bess Flowers"
      ],
      "imdbMovieId": "0049170",
      "originalTitle": "The Eddy Duchin Story",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The life story of the famous pianist and band-leader of the 1930s and 1940s.",
      "tmdbMovieId": 43199,
      "avgRating": 3.32927,
      "releaseYear": "1956",
      "numRatings": 41,
      "posterPath": "/sjn4cLC4b6nS0yZuBAV3FQh3AeM.jpg"
   }
}