{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "derek flint",
            "id": 209777
         },
         {
            "name": "super spy",
            "id": 209778
         }
      ],
      "imdb_id": "tt0059557",
      "video": false,
      "title": "Our Man Flint",
      "recommendations": [
         24130,
         21779,
         36642,
         20238,
         3023,
         31804,
         198318,
         26879,
         27405,
         83122,
         26817,
         41279,
         217057,
         122787,
         118491,
         42786,
         90949,
         52867,
         60792,
         343977
      ],
      "backdrop_path": "/fAOM20EdOS0Fz2ezs8FhfUPLa4A.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Derek Flint",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fa3",
               "name": "James Coburn",
               "profile_path": "/sEouHlYr1hOzl3u6E4KV6gIJSPd.jpg",
               "id": 5563,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cramden",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fa7",
               "name": "Lee J. Cobb",
               "profile_path": "/535dOk8eUI97esLMunIXdG58jUu.jpg",
               "id": 5248,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gila",
               "gender": 1,
               "credit_id": "52fe4474c3a368484e023fab",
               "name": "Gila Golan",
               "profile_path": "/oD80Hx1hK6oOQtEDR09jlE7ZGXP.jpg",
               "id": 91253,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Malcolm Rodney",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023faf",
               "name": "Edward Mulhare",
               "profile_path": "/bFxVGBwUVVfNLsaxH1xInfleQaR.jpg",
               "id": 30125,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Schneider",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fb3",
               "name": "Benson Fong",
               "profile_path": "/scGvvWLDaxHwRsNVmDaOzwGAidX.jpg",
               "id": 91254,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Leslie",
               "gender": 1,
               "credit_id": "52fe4474c3a368484e023fb7",
               "name": "Shelby Grant",
               "profile_path": null,
               "id": 91255,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe4474c3a368484e023fbb",
               "name": "Sigrid Valdis",
               "profile_path": null,
               "id": 91256,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Gina",
               "gender": 1,
               "credit_id": "52fe4474c3a368484e023fbf",
               "name": "Gianna Serra",
               "profile_path": null,
               "id": 91257,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Sakito",
               "gender": 1,
               "credit_id": "52fe4474c3a368484e023fc3",
               "name": "Helen Funai",
               "profile_path": null,
               "id": 91258,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Hans Gruber",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fc7",
               "name": "Michael St. Clair",
               "profile_path": null,
               "id": 91259,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Dr. Krupov",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fcb",
               "name": "Rhys Williams",
               "profile_path": "/jaD2gAkx9AhNABqDobe9D23oexT.jpg",
               "id": 82835,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "American General",
               "gender": 0,
               "credit_id": "52fe4474c3a368484e023fcf",
               "name": "Russ Conway",
               "profile_path": "/9DVSgsiR43JwUeM8Y4XSDZURckf.jpg",
               "id": 91260,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "WAC",
               "gender": 1,
               "credit_id": "52fe4474c3a368484e023fd3",
               "name": "Ena Hartman",
               "profile_path": "/hNL0o3kvowo7kGvzuYcneuDOtw4.jpg",
               "id": 91261,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Dr. Wu",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fd7",
               "name": "Peter Brocco",
               "profile_path": "/lOpG2Gi5EkytfuixtLoP0vWTyjK.jpg",
               "id": 7074,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "American Diplomat",
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fed",
               "name": "Bill Walker",
               "profile_path": "/yHmvPGkSWsvnTTLYRDljb2WXF5H.jpg",
               "id": 103107,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fdd",
               "name": "Daniel Mann",
               "profile_path": "/7v2p42NlK1erhSfoK9KoabeHqI0.jpg",
               "id": 90522,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4474c3a368484e023fe3",
               "name": "Hal Fimberg",
               "profile_path": null,
               "id": 91250,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4474c3a368484e023fe9",
               "name": "Ben Starr",
               "profile_path": null,
               "id": 91263,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58f90c53c3a368761b00cc83",
               "name": "Saul David",
               "profile_path": null,
               "id": 22095,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58f90c5a9251415c4800d7dd",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58f90c66c3a36875bf00c38b",
               "name": "Daniel L. Fapp",
               "profile_path": "/iVQCNRHUxLnbp6Xs73kSzyXmlmV.jpg",
               "id": 5806,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58f90c6d9251415c0700cfb8",
               "name": "William Reynolds",
               "profile_path": null,
               "id": 3099,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.708137,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23728,
      "vote_count": 41,
      "budget": 0,
      "overview": "When scientists use eco-terrorism to impose their will on the world by affecting extremes in the weather, Intelligence Chief Cramden calls in top agent Derek Flint.",
      "similar": [
         9486,
         36669,
         37724,
         206647,
         646,
         954,
         818,
         207703,
         691,
         56288,
         36670,
         37834,
         253,
         36955,
         49517,
         47971,
         9255,
         10764,
         302699,
         238713
      ],
      "original_title": "Our Man Flint",
      "runtime": 108,
      "poster_path": "/2rMEYchRwPYXbvQxEdsF78kjtWN.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1966-01-16",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Our Man Flint Collection",
         "id": 167456,
         "poster_path": "/Aft6eZ6E9s0CkUWCAVnj6KBjVuT.jpg"
      },
      "tagline": "The ORIGINAL man of mystery!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Daniel Mann"],
      "runtime": 108,
      "synopsis": "Ecological catastrophes are happening in the world. Flooding, hurricaines, volcanic actives, etc. No one knows why or how. Someone must be found who can tell the experts why all this is happening and how to stop it, the leaders of the world go to their computers to find that person each one has comes up with one man named: Derek Flint. The head honcho Mr. Cramden, who was Flint's commander in the military, dismisses him as the one person who can do this task. The President, who is listening in on a bug, calls on the red phone and orders Cramden to \"Get Flint\" against Cramdens personal wishes. Cramden sends various people to bring Flint in, but they are rebuffed in the act by Flint, who wants nothing to do with things, so Cramden pays Flint a personal visit at his apartment where Flint is serviced by several women who shave him and see to his needs whispering into his ear to which Flint replies: \"Later.\" Flint, who teaches Ballet in Russia and takes on several Black Belts and wins, eventually concedes and seeks out Cramden who briefs him on the problem and offers him a briefcase that has multiple functions only Flint counters with his cigarette lighters that does even more functions. Flint sets out to find out who, what, where and when and runs into Gila, the bad girl, who eventually arranges for Flint's women to be captured as well as Flint, himself. Once on the isolated Island that houses the bad guys Flint looks around but is given away by an un-American Eagle who is trained to find Americans, which Flint terms as \"diabolical.\" Flint eventually faces the evil doers, who are scientists who have names that don't match their ethnicities. He refused to go along with them and Gila, who has taken to Flint, is sent to become a Pleasure Unit (because she is a traitor) but she quickly gives Flint back his multi-purpose Cigarette lighter so he can overcome (the evil guys). Flint then goes on a rampage and releases Gila from conditioning, along with his bounty of girl servants who have also been conditioned to serve. Flint destroys the complex and makes a high jump off a cliff into the water that, according to Mr. Cramden, has to be a world record and saves the day and gets the gorgeous girl, Gila (play by Israeli Actress Gila Golan). Bang, bang, boom, boom, the world is saved by Flint! Outstanding musical score by Jerry Goldsmith!",
      "writers": [
         "Hal Fimberg",
         "Ben Starr"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059557/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NTAxNDc4Nl5BMl5BanBnXkFtZTcwNDY3OTEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: James Coburn, Lee J. Cobb, Gila Golan | See full cast and crew »"],
      "reviews": [
         "This was the America's answer to Bond, a super agent Derek Flint, and James Coburn plays his part with an outstanding flair. Flint is more scientific in his approach when attacking problems. He's also more lavish and colorful (he's into ballet and stuffs James Bond will never be engaged in). He has more girls, and he's a millionaire to boot ! What more can you expect from this super human hero ? American spirit of independence is also evident in that he's not an \"agent\" of any government agency, but an independent \"consultant\". The colors are brighter, and actions more wild. If James Bond was Aston Martin, Derek Flint is a drag racer. There's nothing this man of iron, with science, money, and charm can't accomplish. In hind sight I can see how difficult it might have been to out Bond a Bond in this type of movie, and Saul David and Daniel Mann did a masterful job of conjuring up a secret agent a la American style. Is it just my imagination or is James Bond starting to look more like Derek Flint after 40 years with his scentific weapons and out landish story lines ? James Coburn was at top of his game, and I wished he'd done more sequels to this franchise. Colorful '60s; looking at this film really convinces you that there was something special about that era.",
         "I thought this was a clever spoof of Bond. One reviewer criticized it's depiction of women. The whole point was making fun of the Bond character's smooth way with the ladies,and the Bond film's depiction of sexy women. if that is what's bothering you.One female character (the adversary, Gila)was an assertive character and not the typically helpless female. A favorite part in the movie of mine is, when after capturing Flint and she is reading the mock J.B. novel with the character called 0008, she puts down the book and sigh's \"God, if there really was such a man!\" As for the \"dated\" comment, c'mon, this is a '66 flick. Of course it's going to be a little dated.Fashions, movie making standards,slang, etc. have come and gone and are coming back. My problem with the movies nowadays is the P.C. crap in them. Now it seems that most action movies have to have a female character be a kick boxer or some other tough character.This crap should be made fun of more too. I have nothing against tough action females, (Cynthia Rothrock's a bad ass!)it's just that now it's un-PC to have a demure soft woman lead character in a lot of action films. I thought this film was so beyond reality and this was the point of the film. As for J.B.,I hope Bond does die soon. Connery commented he'd like to be the villain to do it! That would be most excellent! Besides all that, Coburn was awesome(I bet he was chuckling making this one))and will be sorely missed. R.I.P.",
         "This movie is something of a minor masterpiece. It should be in every home library. Sure it's a little silly but so was the decade of the 1960s that spawned it. Derek Flint (James Coburn) was America's answer to the British super spy James Bond, hence the title Our Man Flint. But all the 007 and Matt Helm movies together aren't as much fun as this spy spoof. Colorful and well-directed, it doesn't take itself too seriously and throws in some good gags to keep you chuckling. Jerry Goldsmith does another excellent musical score, as good as or better than anything from the 007 genre. Our Man Flint is pure escapism and a good investment if you can find it. James Coburn is no longer with us, and like any great work of art Our Man Flint is even more valuable now that the artist has died.",
         "Okay, time to get serious: it is not an understatement to declare that Our Man Flint is one of the greatest movies ever made in the entire history of cinema! Haha! It's so much fun! Heck, how can you not love a movie in which Dick Wilson - the guy who played Mr. Whipple in the Charmin toilet paper commercials for more than 20 years - plays an agent for that evil insidious organization, Galaxy? The two-film Flint series would never have been the incredibly popular spy spoof that it was - made at the height of the 007/Man From U.N.C.L.E./Wild Wild West/Matt Helm craze - if anyone other than the great James Coburn had been cast. The man was born to play the role. It all comes together: Jerry Goldsmith's zippy spy music; beautiful babacious Gila Golan and Edward Mulhare as rotten rat Rodney and then of course, its legendary spoofing. From the LBJ impersonator, to Benson Fong's Dr. Schneider and Peter Brocco's Dr. Wu, to Flints lighter that performs 82 separate functions...83 if you want to light a cigar, Our Man Flint is just the greatest fun!",
         "If there was one film that you could pin James Coburn down to represent him at his peak, it is 'Our Man Flint'. Trained personally by Bruce Lee, he portrays a James Bond spin-off convincingly and gets all the girls at the end kissing him enviably. Because of the success of this film, he went on to appear in a mediocre sequel which did not display his talents or represent the peak of his output.",
         "The only 60's spy flick to give Bond a run for his money, albeit with more silliness and less pretentiousness. Coburn, spot on as exotic retired super agent Derek Flint, very reluctantly rejoins the service when a group of scientists attempt to conquer the world through weather control. It doesn't help their cause that they kidnap all of Flint's girlfriends, in a strategy doomed to backfire. Cobb is great in his traditional role of curmudgeon authority figure, and Golan is a very attractive femme fatale, as I'm sure the rescuer who \"inadvertently\" mishandles her at film's end would agree. Consistently entertaining from the first reel to the last.",
         "When \"FLINT\" first opened in 1966 much was made of the hero's gadgets,particularly his multi purpose cigarette lighter but the truth of the matter was that Flint needed no gadgets,he was a self made superman,able to master any art ( aesthetic or martial) that he wanted and James Coburn played him to perfection.Flint was introduced in the movie in a terrific fashion,displaying his fighting abilities against karate experts and fencers in a style that made him seem unique and skilful in a way not seen before in movies where secret agents usually felled their enemies with a firm sock to the jaw. So did Flint;but he delivered his with his feet. Any movie that climaxes with the hero alone on his adversary's secret island base using wits and kicks to fight his way out and destroy it is okay by me and GALAXY island is straight out of a 60's psychedelic nightmare with flashing lights,disintegration machines and even a trained anti-American eagle.All this and the disco from hell as well.Unlike the Bonds of the era,the girls in \"FLINT\" are a bit antiseptic and the career of the leading lady(Gila Golan)went nowhere after this.The villains are nothing special either but this doesn't matter; Coburn is the movie.He strides lithely through it with a catlike grace and cheshire cat grin knowing full well that he can overcome any obstacle put in his way.What a man! What a movie! It's a shame that after just one poor sequel,Flint retired to that great penthouse in the sky. Maybe he's ripe for a remake.",
         "OK, in retrospective, we should all know that 1960s espionage was all about cool dudes battling evil, and attracting hot babes in the process (though the latter often overshadowed the former, as Austin Powers showed). \"Our Man Flint\" is no exception. I will say that Derek Flint (James Coburn) isn't exactly James Bond, but he has his merits. The movie mostly seems like an excuse to experience that ultra-cool feeling that always emanated from the spy movies of the '60s, and they achieve that. So, even if it isn't James Bond, it's still very enjoyable. Also starring Lee J. Cobb...and a bunch of half-dressed women. So during that era, the four most important spies were James Bond, Derek Flint, Harry Palmer and Maxwell Smart.",
         "Flint was cool when it still meant something. This light-hearted spoof, along with Michael Caine as Harry Palmer and Dean Martin as Matt Helm, provided the inspiration for the increasingly juvenile Austin Powers. Flint, however, did not grow tiresome. Spoilers- When the evil Galaxy organization threatens the world with widespread natural disasters, the leaders of the free world must turn to the one man who can stop them, Derek Flint. Flint is a one man army, reminiscent of Doc Savage, as well as James Bond. He is a master of many disciplines and an object of desire for many women. Even Galaxy agent Gila cannot resist his charms. Flint is marvelous fun with Coburn obviously having fun with the role. Gila Golan has enough sizzle for a steak house and Edward Mulhare makes for a great snooty villain. Lee J. Cobb is at his cranky best, as Flint's exasperated boss. The film pokes fun at the spy genre and swings as only the 60's could. The colors are bright, the music fast, and the women are beautiful objects to be rescued and wooed. There is a nice touch with the leaders of Galaxy, three scientists whose names do not reflect their ethnicity (Dr Schneider is Asian, Dr. Wu is caucasian). Pay special attention to the end of the film, when everyone is rescued by the Navy. One of our brave fighting men cops a feel as he pulls Gila out of a barrel! Never trust a sailor.",
         "They don't make them like James Coburn any more; compared to the likes of him, modern Hollywood leading men seem like fairies suited to play nothing more than Tinkerbell in Peter Pan remakes. Here, Coburn plays the plethoric, three-doses-of-everything Derek Flint. Four girlfriends (up to five at one point as we learn in the sequel), able to stop his heart, master of combat techniques, uses two wolfhounds and a GSD to greet guests and escort them in (dog lovers, note the GSD's silver colouration, a rare combo with black in the US -- and note that a black and tan GSD is used in the sequel), forensic science genius, private jet owner, philosopher... the list goes on. This is a fun film with plenty of outright silly moments. No more or less silly than James Bond films or even The Saint, the difference being Connery and Moore's characters appear to take themselves and their work much more seriously than Coburn's Flint does -- and with good reason. His clothing, made of fibres not found in nature on this planet, is at least three sizes two small; his pantlegs are configured for an imminent flood; his hairstyle rivals that of any British Invasion band member; his attitude toward women is similar to that of Alexis Zorbas (special albeit frail creatures that must be respected and loved); his shrieks and cries during hand-to-hand combat make Bruce Lee sound like Caruso. Recommended!"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "The world's weather seems to have changed dramatically with violent storms everywhere and long dormant volcanoes suddenly erupting. No one is sure what is happening or why but when American intelligence chief Cramden loses yet another team of agents, there appears to be only one man who can do the job: Derek Flint, former super spy, incredibly rich and the ultimate ladies man. Despite Cramden's concerns, Flint is on the job and soon discovers that the Earth's weather is under the control of a secret organization known as GALAXY whose scientists are looking to pacify the world and devote humankind to scientific pursuits.",
         "When the intelligence agencies of the world find that their agents are being murdered at an alarming rate their leaders all write out the qualities an agent will need to succede against the terrible crisis they are facing. Derick Flint is the only agent with all the qualities, but his old boss refuses to work with him until ordered to by the president. Flint is the worlds greatest secret agent, worlds greatest lover, an expert on electronics and Dolphin speech and goes to Moscow for Ballet (To Teach!) When attempts on his life are made, Flint begins to search out the mad scientists who want to remake the world after taking over with the aid of their earthquake machine.",
         "When scientists use eco-terrorism to impose their will on the world by affecting extremes in the weather, Intelligence Chief Cramden calls in top agent Derek Flint."
      ],
      "budget": 3525000
   },
   "movielensId": 5497,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1966-01-16",
      "dvdReleaseDate": "2002-07-16",
      "directors": ["Daniel Mann"],
      "runtime": 108,
      "movieId": 5497,
      "title": "Our Man Flint",
      "mpaa": "NR",
      "actors": [
         "James Coburn",
         "Lee J. Cobb",
         "Gila Golan",
         "Edward Mulhare",
         "Benson Fong",
         "Shelby Grant",
         "Sigrid Valdis",
         "Gianna Serra",
         "Helen Funai",
         "Michael St. Clair",
         "Rhys Williams",
         "Russ Conway",
         "Ena Hartman",
         "Peter Brocco",
         "Bill Walker"
      ],
      "imdbMovieId": "0059557",
      "originalTitle": "Our Man Flint",
      "genres": [
         "Adventure",
         "Comedy",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["lQwJQkEh2QY"],
      "plotSummary": "When scientists use eco-terrorism to impose their will on the world by affecting extremes in the weather, Intelligence Chief Cramden calls in top agent Derek Flint.",
      "tmdbMovieId": 23728,
      "avgRating": 3.326,
      "releaseYear": "1966",
      "numRatings": 477,
      "posterPath": "/2rMEYchRwPYXbvQxEdsF78kjtWN.jpg"
   }
}