{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sanitarium",
            "id": 10482
         },
         {
            "name": "mad doctor",
            "id": 10770
         },
         {
            "name": "synthetic gland",
            "id": 239388
         },
         {
            "name": "psychiatric patients",
            "id": 239389
         },
         {
            "name": "human experiment",
            "id": 239390
         }
      ],
      "imdb_id": "tt0051134",
      "video": false,
      "title": "The Unearthly",
      "recommendations": [
         22749,
         38269,
         27625,
         61702,
         83409,
         78375,
         37579,
         31123,
         3144,
         55080,
         23125,
         60781,
         90360,
         73218,
         31258,
         84626,
         63091,
         31126,
         31118,
         90030
      ],
      "backdrop_path": "/m5Jz8bGM6DMZG60Fzs1uS0r1Ja7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dr. Charles Conway",
               "gender": 2,
               "credit_id": "52fe447a9251416c91012105",
               "name": "John Carradine",
               "profile_path": "/iv9pZ2JRddIUNe2RgYAKmUR55WO.jpg",
               "id": 8516,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mark Houston",
               "gender": 2,
               "credit_id": "52fe447a9251416c91012113",
               "name": "Myron Healey",
               "profile_path": "/stQknU1LX0YW16Bzdi4tto0r3EP.jpg",
               "id": 116845,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Grace Thomas",
               "gender": 1,
               "credit_id": "52fe447a9251416c91012109",
               "name": "Allison Hayes",
               "profile_path": "/6VoMLGGRH1ccl25cyaHJWyMapD0.jpg",
               "id": 104412,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dr. Sharon Gilchrist",
               "gender": 1,
               "credit_id": "52fe447a9251416c91012117",
               "name": "Marilyn Buferd",
               "profile_path": "/4J3qJmMAHNKZVjhemhto5Pn2G2.jpg",
               "id": 103778,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Lobo",
               "gender": 2,
               "credit_id": "52fe447a9251416c91012123",
               "name": "Tor Johnson",
               "profile_path": "/4mz1ZqXgSgtBwPKwFtpmbJqqPCH.jpg",
               "id": 100796,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Danny Green",
               "gender": 2,
               "credit_id": "52fe447a9251416c9101211b",
               "name": "Arthur Batanides",
               "profile_path": null,
               "id": 151511,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Natalie Andries",
               "gender": 0,
               "credit_id": "52fe447a9251416c9101211f",
               "name": "Sally Todd",
               "profile_path": "/w7fxhGM8tn8LPcG4ZgPtsXD2e0O.jpg",
               "id": 133569,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Harry Jedrow",
               "gender": 0,
               "credit_id": "55d5eaf1c3a3685abc002d24",
               "name": "Harry Fleer",
               "profile_path": null,
               "id": 1193325,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Dr. Loren Wright",
               "gender": 0,
               "credit_id": "55d5eab5c3a36826f5000c1c",
               "name": "Roy Gordon",
               "profile_path": "/wAnt4yusdtFLvCPrT0rq8j3gnmH.jpg",
               "id": 34211,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Police Captain George Reagan",
               "gender": 2,
               "credit_id": "55d5eac692514102cf004a8c",
               "name": "Guy Prescott",
               "profile_path": "/bADh3CY9KHqTNPRJHX7IC7ccrW.jpg",
               "id": 190752,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Police Officer Miller",
               "gender": 0,
               "credit_id": "55d5ead992514102d5004b6a",
               "name": "Raymond Guth",
               "profile_path": null,
               "id": 1221577,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Police Officer Ed",
               "gender": 0,
               "credit_id": "55d5eb0d92514102cf004a93",
               "name": "Paul McWilliams",
               "profile_path": null,
               "id": 1498628,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Screaming Woman",
               "gender": 0,
               "credit_id": "55d5eafec3a3685abc002d29",
               "name": "Gloria Petroff",
               "profile_path": null,
               "id": 1061214,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55d5ebc392514102c6004815",
               "name": "Jane Mann",
               "profile_path": null,
               "id": 117609,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe447a9251416c9101210f",
               "name": "Boris Petroff",
               "profile_path": null,
               "id": 117615,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe447a9251416c9101212f",
               "name": "Jane Mann",
               "profile_path": null,
               "id": 117609,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe447a9251416c91012135",
               "name": "John D.F. Black",
               "profile_path": null,
               "id": 160447,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55d5ec1192514102c80046af",
               "name": "Boris Petroff",
               "profile_path": null,
               "id": 117615,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55d5ec6692514102c6004826",
               "name": "Robert A. Terry",
               "profile_path": null,
               "id": 1498629,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55d5ec7192514102cf004ace",
               "name": "Henry Vars",
               "profile_path": null,
               "id": 96285,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55d5ec7d92514102cf004ad0",
               "name": "W. Merle Connell",
               "profile_path": null,
               "id": 239238,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55d5ec8c92514102cf004ad5",
               "name": "Daniel Hall",
               "profile_path": null,
               "id": 1348034,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55d5ec9892514102c30044f4",
               "name": "Mowbray Berkeley",
               "profile_path": null,
               "id": 1454981,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "55d5ecdbc3a3684d9e001ed6",
               "name": "Betty Sinclair",
               "profile_path": null,
               "id": 47379,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5925f3a8c3a36877fd012911",
               "name": "Harry Thomas",
               "profile_path": null,
               "id": 1066814,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 0.959822,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31393,
      "vote_count": 9,
      "budget": 0,
      "overview": "Mad doctor uses patients at his isolated psychiatric institute as subjects in his attempts to create longevity by surgically installing an artificial gland in their skulls, with disastrous results.",
      "similar": [
         3035,
         138,
         50037,
         9064,
         17965,
         27029,
         193612,
         28324,
         27297,
         33468,
         28425,
         28770,
         28437,
         35919,
         23303,
         43342,
         28261,
         18250,
         30787,
         35801
      ],
      "original_title": "The Unearthly",
      "runtime": 73,
      "poster_path": "/obCT7HbLwX5txSMvk0de9w9VW2u.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "AB-PT Pictures Corp.",
         "id": 14046,
         "origin_country": ""
      }],
      "release_date": "1957-06-28",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "An army of mutants on a mission from hell!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Boris Petroff"],
      "runtime": 73,
      "synopsis": "The move opens with the image of an old house. A light goes on in an upstairs window. A woman screams and we see Lobo (Tor Johnson) pawing at a young woman. Title and credits are shown over the old house. A car pulls up to the old house. A man and woman exit the car and they ring the doorbell. Lobo opens the door. Dr. Loren Wright (Roy Gordon) and Grace Thomas (Allison Hayes) enter the house and are greeted by Dr. Charles Conway (John Carradine) who is walking down the stairs. Dr. Wright introduces his patient, Grace, to Dr. Conway. They walk up to the study. Dr. Conway's assistant, Dr. Sharon Gilchrist (Marilyn Buferd) stands at the desk and welcomes Grace. Sharon dismisses herself. Grace expresses her hope she can be helped with her problem and Conway assures her she is in the best place possible. Sharon returns to the study and takes Grace to her room. Dr. Wright lets slip that he will get in touch with Grace's father to get anything else she may need for her stay. Conway is angry and asks, \"Father? What's this business about her father? Our agreement was that patients you brought to me where to have no relatives. No ties whatsoever!\" Dr. Wright calmly tells Conway, \"Grace Thomas committed suicide. Yes. Her bag and coat will be found floating in the bay.\" Sharon gets Grace settled in her room. Conway and Wright toast each other with a glass of wine. Wright tells Conway he wants to see the results of the last experiment on a man named Jedrow. The two men go down to the basement to see Harry Jedrow (Harry Fleer). Dr. Wright gasps when Conway turns on a light over the chair. A man with a streak of white hair sits motionless in a catatonic state; his body is in a state of rigor. Conway advises they wait and hope the man recovers, given sufficient time. Conway concludes the radiation must be more carefully calculated and that the subjects must be younger. Dr. Wright seems anxious to restore Jedrow. He admits that Jedrow has a living relative. Jedrow's sister showed up looking for her brother at Wright's office. Conway is very angry and leaves Wright to deal with the problem. Lobo bathes Jedrow. Conway visits Grace in her room. She explains that she is always frightened and just wants to cry. Sharon arrives with the sedative and a glass of warm milk. Conway returns to his office. Wright is preparing to leave. Sharon arrives in the office to report that Grace has been medicated. Wright is on his way out of the house, but must be reminded to take Grace's coat and bag. Dr. Wright drives off, and a man enters the grounds. He checks his revolver and hides it in some foliage. Lobo captures the man and takes him to the house. Conway questions the man. He claims to be lost and his name is Mark Houston (Myron Healey). Conway accuses him of being Frank Scott, a killer and thief wanted by the police. A detailed description had been provided by the police and a newspaper story confirmed it. Mark tries to leave but Conway offers him sanctuary in exchange for his assistance. Mark agrees to stay. Lobo escorts Mark to his room upstairs. The next morning a man and woman are at the dining room table eating breakfast. Danny Green (Arthur Batanides) complains to Natalie Andries (Sally Todd) that his meal is cold. He continues his rant to an unresponsive Natalie, who just continues to read quietly. Lobo enters with Danny's toast. Danny is outraged that the toast is cold and tells Lobo, \"You can't do anything right!\" Danny and Natalie continue to bicker when Mark walks in for his breakfast. Natalie is instantly interested in this new man. She and Mark exchange stories. Natalie thinks that she maybe going home soon. Mark tires of Danny's childish behavior and tells him. Danny gets himself more excited as Sharon enters the room. She takes Danny upstairs to see the doctor. Mark leaves the dining room. Danny is given an injection in Conway's lab. Danny settles down immediately. Mark enters Conway's office and asks if he can help. Sharon escorts Danny to his room. Mark and Conway discuss Mark's duties. Conway tells mark of his research on human glands. Lobo was one of his early test subjects on a seventeenth gland that can control aging. Conway offers Mark the chance to be the first man who can remain young forever, but mark expresses disinterest. When an appeal to vanity fails to work, Conway changes tack and threatens to turn Mark over to the authorities and a certain death in the electric chair. Conway discloses that the other patients in the house have been test subjects used to perfect the surgery. The discussion concludes and Conway swears Mark to secrecy. Outside on the grounds, Grace and Natalie get some sun and talk. Natalie excuses herself; she has an appointment with Conway. Mark introduces himself to Grace. He asks her about the place, but since they both arrived the day before she can tell him nothing. She is reluctant to tell Mark much about herself. The two walk the grounds and chat. Sharon assesses the condition of Jedrow. She reports her findings to Conway. Dr. Wright calls Conway to report Jedrow's sister insists on knowing about her brother. Conway orders Wright to make out a death certificate for Harry Jedrow. He abruptly hangs up the phone. Sharon expresses surprise, \"But he's alive!\" Conway corrects her, \"No, my dear. Jedrow is dead.\" Natalie enters the office for her appointment. Conway meets with the young lady. He tells her she has improved over the last three months. He does have one final treatment, and then she may leave in a day or two. It is dinner time, and Mark and Grace join Danny at the dining room table. Mark is turning on the charm and inquires about Natalie. Conway joins his patients and suggests music. Conway plays a work by Bach on the organ. Lobo enters with a tray and Sharon spikes the soup with a sedative for Natalie. Mark excuses himself to check on Natalie, but he is intercepted at the staircase by Sharon. Sharon explains to Mark that Natalie is having dinner in her room, a privilege all are afforded. Lobo takes Natalie, now fast asleep, to the lab and operating room. He places her on a gurney. Sharon tells Lobo to send all the remaining patients to bed. Lobo announces, \"Time for go to bed.\" Mark knocks on Natalie's door but gets no response. Conway directs Mark down to his own room. Sharon and Conway prep for surgery. Sharon administers anesthetic. Mark enters Natalie's room and finds everything normal, except Natalie is not there. Conway begins surgery. He opens his test subject's neck and calls for the gland. He retrieves an object that looks like a dark shrimp from the tray Sharon is holding. We see a flat, breakfast sausage-sized object pulsating in the doctor's hand. Mark calls on Grace in her room. He tells Grace she is in danger and that Natalie is gone. Conway finishes surgery and tells Sharon they will know if it was a success in eight hours. Mark tells Grace about Conway's plan, but she does not believe Mark. Natalie is subjected to the final part of the procedure, the carefully calibrated exposure to electricity. Sharon and Conway check on Natalie eight hours later. They are disappointed to see the results. Natalie's face is a charred mess of scar tissue. Natalie wakes and moans. Conway talks to Grace. He tells her she is improving. They talk about Natalie. Grace tells Conway that Mark is worried about her. Conway lies and tells Grace that Natalie is fine and he released her. In fact, he took her to the train himself early this morning. Conway advises Grace to avoid any further contact with Mark, \"He's a dangerous man.\" Sharon witnesses the exchange and registers a bit of jealousy. She tells Conway she loves him, but Conway assures Sharon she has nothing to worry about. Sharon suggests Grace be the next test subject. Conway assures Sharon that when the time is right she will be. Mark searches the house. He finds the basement entrance and descends the stairs. In a locked room he finds Jedrow. He turns on the light and examines the man. Mark returns to Grace's room, but she demands he leave. Lobo removes Jedrow's body, so when Mark and Grave arrive she does not believe Mark's story. They explore the basement and find Natalie's room. They both see the horror that Conway created. Grace recoils in horror. Mark and Grace return to Grace's room. Lobo carries a coffin outside. It contains Jedrow's body. Lobo places the box in a hole and starts to fill it in with dirt. The dog alerts Lobo to a stranger on the grounds, so he goes to investigate. Mark finds the coffin and opens it. Jedrow is still alive. Lobo returns and fills in the hole. Mark pays a call on Danny. Mark explains the situation and convinces Danny to join him later. All pretend to sleep. Conway checks on all his patients and then returns to his office. At the appointed time Danny joins Mark and Grace in the living room. Mark tells Danny to take Grace out of the house to safety, but before they leave, Conway joins them with Lobo and Sharon. Danny and Mark are escorted to the basement. Conway takes Grace to his office. Mark shows Danny Natalie in her room. Danny taunts Lobo and tells him a story to distract the dull-witted giant long enough to make their escape. Lobo is disabled, but not before shooting Danny. In the lab, Sharon preps Grace for surgery. Conway steps into his office and is confronted by Mark, who now has a gun. Conway now realizes that Mark is a policeman. He shuts off the lights and makes his escape. Mark calls the police and tells them to come to the house. Mark searches the grounds for Conway. Conway goes back into the house as the police arrive. Captain George Reagan (Guy Prescott) deploys his men to search for Conway. Lobo escapes his room in the basement. Conway enters the living room and encounters Jedrow. Conway is shocked to see Jedrow and tells the man, \"No. You're dead. I had you buried.\" Jedrow is holding a knife and runs the mad scientist through, killing his tormentor. Lobo disarms Jedrow just as Mark and Captain Reagan enter the room. A police officer escorts Sharon Gilchrist into the living room. She confesses that Grace is still in the lab. Lobo and Sharon are arrested. Officer Ed (Paul McWilliams) informs Reagan they've found something in the basement. Mark revives Grace. She is still on the gurney. Ed and Reagan find the body of Danny. They open the door to a freak show. Conway's other subjects are herded in a small room. They are screaming, moaning and fighting. Reagan is horrified and exclaims, \"Good Lord, what if they do live forever?\" Mark escorts Grace downstairs. Mark introduces her to Reagan. Reagan explains that the police have been dragging the bay for her body. Mark tells Reagan that Dr. Loren Wright is also involved. He had been supplying patients for Conway's experiments. Grace learns Mark is a police Lieutenant. We close with Mark and Grace sharing a kiss.",
      "writers": [
         "Jane Mann",
         "John D.F. Black"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051134/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNjQ2NjM5MF5BMl5BanBnXkFtZTcwOTE4NzkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: John Carradine, Myron Healey, Allison Hayes | See full cast and crew »"],
      "reviews": [
         "John Carradine's character, Dr. Conway, has a big problem in \"The Unearthly.\" His experiments on a newly discovered synthetic gland keep going wrong, and as a result, all his human guinea pigs have been transformed into mutant critters that are now overcrowding his basement. We get to see this mutant collection at the end of the film, and it is both the funniest and most horrifying section of this surprisingly well-done little B picture. I say \"surprising\" only because most film books downplay this movie as hopeless shlock, but I found it to be fairly entertaining. Not too many unintentional laffs, and with fairly good acting, too, especially from Carradine and cult fave Allison \"The 50 Foot Woman\" Hayes. Tor Johnson, everyone's favorite lumbering mound of monstrous blubber, is also on hand, as Carradine's imbecilic helper, and his is always a welcome presence. Surprisingly, his character's name is Lobo...the same name he sported in Ed Wood's \"Bride of the Monster\"!!! This may very well be Tor's finest film...but when your other credits include \"Plan 9 From Outer Space\" and \"The Beast of Yucca Flats,\" two of the worst ever, I suppose that's not saying too much. Compared to the other John Carradine \"mad scientist\" film that I saw recently, \"The Astro-Zombies,\" \"The Unearthly\" is a little gem of script, acting and direction. Again, I suppose that's not saying too much. But the bottom line is, I really did have fun with this one. Give it a try!",
         "More fun than a cellarful of monkeys. Carradine goes over the top as the haughty, flawed (mad) scientist. Tor Johnson is Lobo is Tor... proving his bad acting in \"Plan 9\" and \"Bride of the Monster\" was his own idea, not Ed Wood's. The three female leads are all famous beauties - Dr. Gilchrist was Miss America in 1946, Natalie was Playboy's Playmate of the Month in 1957 (the year this film was released), and B-movie giant Allison Hayes adds a sultry touch. Unfortunately, almost everyone in this film is INSANE.",
         "Acceptable scare-fare here, with two of the B movie greats, Carridine and Healy, and the prince of the C,D,E,and F movies, Tor Johnson. Not as campy as an Arch Hall Jr. or Dennis Ray Steckler effort-the production values are too good-but still some good giggles at trite dialogue and silly plot.",
         "Although made in 1957, THE UNEARTHLY is one of those throwbacks to the kinds of cheap horror pictures cranked out by minor studios in the 1940's that often starred Bela Lugosi, or George Zucco, or as in this film, John Carradine as a mad scientist. This film, with John Carradine as a mad scientist trying to create immortal beings must of seemed old and shopworn to 1957 audiences. The film is talky and plodding. Scenes are dull. The last ten minutes the film picks up speed and we get a chance to see the botched results of Carradines experiments and some fine make up work by Harry Thomas. Its the only thing from preventing me from calling this a total disaster. Oh! I almost forgot, Allison Hayes is sexy.",
         "As a new user to this site, I couldn't believe that this movie was listed as one of the worst 100 of all time. How can that be? Without wanting to be a \"spoiler\" this movie has one of the greatest last lines of all time (right up there with Some Like It Hot), one that has stayed with me forty years later. Besides, how can a site devoted to the true movie lover rate a movie so low when Myron Healy receives second billing?? Mr. Healy is one of the screens all time leading villains (he's the one who has to fish his silver dollar out of the spittoon in El Dorado), and here he gets to play the hero!!! I was also very fortunate to meet John Carradine in 1968 when he appeared at one of my college's Artist Series. I told him how much I enjoyed this movie. His reply was, \"Well, we all have bills to pay.\" So come on people, lighten up, and enjoy this movie for what it is - the dedicated scientist who tries to find eternal life for himself and his bride. And if a few of his experiments go wrong, so be it.",
         "This movie includes a number of distinguished actors playing excellent parts. John Carradine, for instance, plays a gaunt, furrow-faced scientist with a big booming authoritative scientisty voice. Myron Healy plays the mysterious Mark Houston, an average Joe who goes after the ladies with some of the lamest pick-up lines in existence (\"Grace? Hmm, pretty name for a pretty girl.\") The truly lovely Alison Hayes, she of the sensational chest, plays the aforementioned Grace, a knockout of a girl up to her eyeballs in emotional problems. Sally Todd, a beauty queen in real life, plays Natalie, a relatively well-adjusted knockout blonde who tragically gets turned into a smoked meat sculpture (not on purpose, of course). Marilyn Buferd is the cold, frustrated lady scientist who's carrying a torch for the gaunt furrow-faced scientist guy. Roy Gordon is the scientist-in-cahoots-with-the-other-scientists who looks like the guy on those Monopoly cards. Arthur Batanides is the neurotic palooka who spazzes out at the drop of a hat. Harry Fleer is Jedrow (_not_ Jethro), the hapless victim who looks like Abe Vigoda. And. of course, there's Tor Johnson, who's just his sweet, lovable, playful old self. With a cast like that, how can you go wrong?",
         "While I am sure my summary is not exactly a glowing endorsement, I do think that this bad movie isn't nearly rotten enough to merit its current listing among the \"hallowed 100\"--the 100 lowest ranked films listed on IMDb. Instead of being a 100% \"stinker\", it's actually a low-budget but watchable film....really! When the film begins, you are greeted with a house that is obviously a painting--from which the film's odd title emanates. Odd, because there is nothing \"unearthly\" about the film--no aliens at all. The first scene you are greeted to is a closeup of Tor Johnson killing someone. Seeing Tor, I knew this film would be low-budget crap--heck, he's the unofficial king of these films with his luminous performances in such dreck classics as BRIDE OF THE MONSTER, PLAN 9 and THE BEAST OF YUCCA FLATS (my vote for the worst of his films). Interestingly, in this film he's named 'Lobo'--the same name he had in NIGHT OF THE GHOULS and BRIDE OF THE MONSTER. He's back again in THE UNEARTHLY as essentially the same guy (though he does talk some in this film, unlike the others). You must assume, then, that he's a freelance henchman--willing to work not for Bela Lugosi, Kenne Duncan and here for John Carradine. I could imagine his classified ad now: \"Loyal, brutish henchman looking for a position. Ability to speak limited but hulking appearance more than makes up for shortcomings.\" It turns out that Tor is working in a weird clinic in the middle of nowhere for the evil doctor (Carradine) and his devoted assistant, Dr. Gilchrist (Marilyn Buferd). Despite Gilchrist being a bit of a 50s horror movie babe, however, Carradine seems rather immune to her advances and focuses his energies on creating and implanting a supposed \"new gland\" in his patients. Sadly, however, the gland only seems to have the side effect of turning the patients into creepy and disfigured ghouls or werewolf-like creatures. Sadly, the victims have no idea that they'll be subjected to these sick experiments and so they just wait until it's there turn. Of course, considering the clinic is in the middle of no where and the patients are not allowed outside, you'd think they might suspect SOMETHING! Into this lovely menagerie comes a wanted murderer (played by Myron Healey). Healey was a very competent and familiar supporting actor from television and so you wonder why with almost 300 performances to his credit he would have appeared in this film. His character is supposed to be a killer, but it's obvious he's more than meets the eye, as he quickly determines the doctor's true intentions as well as organizes the other patients into an escape team. When this fails, a little surprise takes place and the evil scheme unravels. Okay, so much of the plot sounds a bit familiar. Carradine has played mad scientists in at least 19,390 other cheap movies. Tor has the acting range of a sprig of spinach. Sure, the creatures look amazingly cheesy. Still, despite all this, the film is watchable and campy fun. While far from good, for lovers of bad movies, it's well worth seeing and not nearly as unwatchable as its current rating might imply.",
         "Dr. Conway (John Carradine) runs a strange medical home in a decayed and isolated mansion. How strange is it? Well, it's so strange that Lobo (Tor Johnson) works there. Ed Wood occasionally receives a writing credit for this bit of 1957 drive-in dreck; in truth his only contribution to the film is the character Lobo, which is lifted directly from Wood's 1955 BRIDE OF THE MONSTER. Even so THE UNEARTHLY, scripted by John Black and Jane Mann, is certainly bad enough to be an Ed Wood movie. Unfortunately it isn't nearly as funny. Dr. Conway's newest patient is Grace (Allison Hayes), who is unaware that the place is a front for unnatural experiments involving artificial glands. Fortunately for Grace, murder-on-the-run Mark (Myron Healey) stumbles onto the grounds and proves more than a match for the good doctor and his evil associates. Throw in Marilyn Buferd, Arthur Batanides, Sally Todd and an idea or two yanked from H.G. Wells' ISLAND OF DR. MOREAU and there you go. By this point John Carradine had been typed in mad doctor roles and he delivers a typical John Carradine mad doctor performance. Allison Hayes, a beautiful and interesting actress who never got the breaks she deserved, is an always welcome sight--and yes, it is fun to see Tor Johnson doing his slack-jawed routine again. But in a general sense THE UNEARTLY isn't so much a badly made film as it is an utterly uninteresting one. If you're among the hardcore fans of 1950s drive in fare you might enjoy it, but I'm not holding my breath on it. GFT, Amazon Reviewer",
         "Mad doctor uses patients at his isolated psychiatric institute as subjects in his attempts to create longevity by surgically installing an artificial gland in their skulls, with disastrous results. This film has a suspiciously low rating on IMDb, which I suspect can only be caused by one of two things (or both): its being shown on \"Mystery Science Theater 3000\" or its being associated with Ed Wood. Since the latter is not likely to impact it, I suspect it is the former. And that is just too bad. Despite the lampooning, this is a decent film with good effects (the gland), a better than average plot and decent acting. We have John Carradine, a legendary actor and Carradine family patriarch. And he is surrounded by actresses who had been Miss America, a Playboy Playmate (around the same time the film came out) and more... The script? From a man who went on to write some of the best episodes of \"Star Trek\". Certainly this cannot be as bad as it is made out to be. Another examination may be in order.",
         "(There are Spoilers) John Carradine in one of his many mad scientist roles as the crazed Dr. Charles Conway who's obsessed with finding the elusive secret of the legendary Fountain of Youth. Getting people to be patients at his secret medical clinic deep in the woods and miles from civilization Dr. Conway plans to experiment with them to make his subjects perpetually young like the portrait of Doren Gray. In the end he turns them into horrible and deformed mutants cursed to live forever in a cloistered sanitarium, like leapers. Never to see the light of day because of their shocking deformities that he inflicted on them . One evening an escaped convict Mark Huston, Myron Healey, is caught snooping around Dr. Conway's residence by his hulking and trusted servant Lobo, Tor Johnson. Dr. Conway sees the perfect specimen for his youth experiments with Huston in no position to run and go to the police for help since he himself is wanted for murder. Dr. Conway also has a number of other people at his place one of them Harry Jedrow, Harry Fleer, who's suffering from what the good doctor did to him by being in a totally comatose state. It's Jedrow who in the end spells the doom of Dr. Conway and his insane experiments by having his sister, whom he wasn't supposed to have, insist on having him released. This lead Dr. Conway to get Lobo to bury the poor man alive who was later rescued by Huston when Lobo took a lunch break, the big guy gotta eat, from shoveling dirt over Jedrow's coffin. Making a play for one of his patient's the beautiful Grace Thomas, Allison Hayes, has Dr. Conway's assistant the former 1946 Miss America Marilyn Buferd playing Dr. Sharon Gilchrist mad as hell and not about to take Dr. Conway's two-timing her anymore insisting that he use Miss. Thomas in his next experiment. Hoping that it will be as unsuccessful as the one he just had with Natalie Anders, Sally Todd a former Playboy Centerfold, who's face ended up looking like an over-baked pizza with extra cheese. As usual Dr. Conway's plan to bring eternal youth into the world is doomed to failure since the magical 17th gland, that looks like a pickled jalapeño pepper, that's supposed to bring on the miracle of eternal youth only makes his subjects freeze in time looking like a cross between the Munchkins in the Wizard of Oz and Lon Cheney Jr in his role as the hairy Wolf Man. With Huston now throwing off his cover and revealing himself to be police Let., not wanted escaped murderer, Mark Huston everything starts to unravel for Dr. Conway. Huston and fellow patient Danny Green, Authur Batanides, overpower the brutish Lobo with Danny losing his life in the process and the zombie-like Jedrow coming back from the grave to pay Dr. Conway back, in spades, for everything he did to him over the years. Average 1950's horror movie with the so-called brilliant Dr. Conway flopping in every one of his experiments that had you, and the movie audience, wonder what was so brilliant about the crazy and arrogant kook in the first place. Tor Johnson's Lobo for once does have a few lines of dialog, which is very rare for him, notably the movies most quoted and remembered saying \"Time Fahh Go Ta Bed\"."
      ],
      "genres": [
         "Sci-Fi",
         "Horror"
      ],
      "productionCompanies": ["AB-PT Pictures Corp."],
      "summaries": [
         "Professor Charles Conway is a mad scientist attempting to develop the proverbial fountain of youth by creating \"the 17th gland\". Ignoring all aspects of scientific ethics, his research subjects are people who have no family and are under the impression that the doctor can cure their depression. However, his research hasn't been successful and his subjects are turned into grotesque zombies. Some of Conway's patients begin to catch on to his scheme and intend to stop him.",
         "Mad doctor uses patients at his isolated psychiatric institute as subjects in his attempts to create longevity by surgically installing an artificial gland in their skulls, with disastrous results."
      ],
      "budget": 0
   },
   "movielensId": 5545,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-06-28",
      "dvdReleaseDate": "2002-08-06",
      "directors": ["Boris Petroff"],
      "runtime": 73,
      "movieId": 5545,
      "title": "The Unearthly",
      "mpaa": "",
      "actors": [
         "John Carradine",
         "Myron Healey",
         "Allison Hayes",
         "Marilyn Buferd",
         "Tor Johnson",
         "Arthur Batanides",
         "Sally Todd",
         "Harry Fleer",
         "Roy Gordon",
         "Guy Prescott",
         "Raymond Guth",
         "Paul McWilliams",
         "Gloria Petroff"
      ],
      "imdbMovieId": "0051134",
      "originalTitle": "The Unearthly",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": [
         "C5GN5_p6ti4",
         "V975fytsT0U"
      ],
      "plotSummary": "Mad doctor uses patients at his isolated psychiatric institute as subjects in his attempts to create longevity by surgically installing an artificial gland in their skulls, with disastrous results.",
      "tmdbMovieId": 31393,
      "avgRating": 1.87143,
      "releaseYear": "1957",
      "numRatings": 35,
      "posterPath": "/obCT7HbLwX5txSMvk0de9w9VW2u.jpg"
   }
}