{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "shaolin kung fu",
            "id": 14934
         }
      ],
      "imdb_id": "tt0081494",
      "video": false,
      "title": "Return to the 36th Chamber",
      "recommendations": [
         50571,
         46736,
         11841,
         37032,
         88631,
         32520,
         24784,
         13513,
         54178,
         41378,
         50569,
         139321,
         64994,
         62852,
         18812,
         49642,
         18852,
         59402,
         18857,
         43637
      ],
      "backdrop_path": "/r98laT9X7gjkkcxGfVV3TK1pkb6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Chou Chun Chi",
               "gender": 0,
               "credit_id": "52fe475ec3a36847f8131f43",
               "name": "Gordon Liu Chia-Hui",
               "profile_path": "/yTI36A27P9YdFbzrCwjpmEpDGbR.jpg",
               "id": 240171,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Hsiao Hung",
               "gender": 0,
               "credit_id": "52fe475ec3a36847f8131f2d",
               "name": "Kara Hui",
               "profile_path": "/4jGTpv7uyeHwrZLTaR0FQ7kG7Mt.jpg",
               "id": 84205,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Ah Chao",
               "gender": 0,
               "credit_id": "54c7f999c3a368700600066f",
               "name": "Hsiao Ho",
               "profile_path": "/hEIVqXfZvtsq0awa43tSMrZ6UQA.jpg",
               "id": 246385,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "54c7f99fc3a3687006000671",
               "name": "Dang Wai-Ho",
               "profile_path": "/ckZEFwKzVSioQ8XNgjTwn9jMtqa.jpg",
               "id": 544910,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Uncle Li",
               "gender": 2,
               "credit_id": "54c7f9aac3a3687006000673",
               "name": "Wong Ching-Ho",
               "profile_path": "/u09nURnh4QePg69BQJqIHiuCDTW.jpg",
               "id": 1134505,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Chou Shih Sheng",
               "gender": 0,
               "credit_id": "54c7f9b6c3a36874b7004bc7",
               "name": "Wa Lun",
               "profile_path": "/p9kIEPoYCw2WQ4dXLVQESmTdQxY.jpg",
               "id": 1419329,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Monk San Te",
               "gender": 0,
               "credit_id": "54c7fa30c3a36874b7004bd1",
               "name": "King Lee King-Chu",
               "profile_path": "/ayIpqyEbY5n7QgPIqXDGqPSxn6E.jpg",
               "id": 1193836,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Worker",
               "gender": 0,
               "credit_id": "54c7fa3cc3a36874b7004bd3",
               "name": "Yau Chui-Ling",
               "profile_path": null,
               "id": 1134752,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Ah Fen",
               "gender": 0,
               "credit_id": "54c7fa48c3a3680924000071",
               "name": "Chan Sze-Kai",
               "profile_path": "/klDPB4oinG4pvTZ2Eiq0xeSgMja.jpg",
               "id": 240154,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Boss Wang's thug",
               "gender": 0,
               "credit_id": "54c7fa53925141679c00488a",
               "name": "Sek Gong",
               "profile_path": "/3YVFlGERDqBxQCL9Z522rPRQCPZ.jpg",
               "id": 1140991,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Chuan Min",
               "gender": 0,
               "credit_id": "54c7fa5e92514157cc0006d3",
               "name": "Kwan Yung-Moon",
               "profile_path": "/1S5mfrjm6fIjZMMJvc6LmHCWcTD.jpg",
               "id": 1166563,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Boss Wang Kao Feng",
               "gender": 2,
               "credit_id": "54c7fa7392514167940047dc",
               "name": "Johnny Wang Lung-Wei",
               "profile_path": "/ktExluorH4yrX01bMWUYdkZRru1.jpg",
               "id": 240174,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Chief Ma",
               "gender": 2,
               "credit_id": "54c7fa7fc3a36870ba00069d",
               "name": "Chiang Tao",
               "profile_path": "/l5uG5TY4HRQ2Kzj51h0FhfHOJJG.jpg",
               "id": 548610,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Yuen Li Hou",
               "gender": 0,
               "credit_id": "54c7fa89925141678c0048f9",
               "name": "Chang Yi-Tao",
               "profile_path": null,
               "id": 581131,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Monk with diarrhea",
               "gender": 0,
               "credit_id": "54c7faa89251416787004737",
               "name": "San Sin",
               "profile_path": "/cjF5DUjFkaUnjT0CLZluqCVaNGO.jpg",
               "id": 1193837,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Boss Wang's thug",
               "gender": 0,
               "credit_id": "54c7fab3c3a3687006000690",
               "name": "Jackson Ng Yuk-Sue",
               "profile_path": null,
               "id": 1398251,
               "order": 16
            },
            {
               "cast_id": 31,
               "character": "Worker",
               "gender": 0,
               "credit_id": "588b4b0dc3a3681019006c1b",
               "name": "Ailen Sit",
               "profile_path": "/sA4EN7CitZa29FGNiZfIdmwrKv0.jpg",
               "id": 1277939,
               "order": 17
            },
            {
               "cast_id": 32,
               "character": "Worker",
               "gender": 2,
               "credit_id": "588b4b1d9251411ac602bac9",
               "name": "Gam Tin-Chue",
               "profile_path": "/v9zMKXExLwZsLux84HwxydRHxYD.jpg",
               "id": 1583011,
               "order": 18
            },
            {
               "cast_id": 33,
               "character": "Hsiao Ting",
               "gender": 1,
               "credit_id": "5a62dcaa9251410b21006986",
               "name": "Yeung Ching-Ching",
               "profile_path": "/vAtlvqsqUIPvl6AWHOONF2ZJjPs.jpg",
               "id": 109304,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe475ec3a36847f8131f1d",
               "name": "Ni Kuang",
               "profile_path": "/41TVqxyNekPr2HQR4IhUuIXhPzZ.jpg",
               "id": 70675,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe475ec3a36847f8131f3b",
               "name": "Liu Chia-Liang",
               "profile_path": "/zsRPoIYxsvUoVFuPRVgeRppevOy.jpg",
               "id": 26775,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "55d320c292514170bd00101a",
               "name": "Mona Fong",
               "profile_path": "/3hpmsYjWWNChzjGzu2hu5epb6Ai.jpg",
               "id": 70676,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55d5de8d925141154e003f41",
               "name": "Chiang Hsing-Lung",
               "profile_path": "/4rJVpsyq1UA2JoMQDdvGSbvzxMh.jpg",
               "id": 43913,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 4.387887,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 48301,
      "vote_count": 30,
      "budget": 0,
      "overview": "The workers of a dye factory have their pay cut by 20% when the factory owner brings in some Manchu thugs to try and increase production. Desperate to reclaim their full wages, the workers hire an actor to impersonate a priest and kung-fu expert from the temple of Shaolin. The factory owner proves the actor a fraud, and punishes all those involved. The young actor feels he has let the workers down, and promises to atone. He sets out for Shaolin, determined to be accepted as a kung-fu pupil at the elite temple.",
      "similar": [
         9053,
         11841,
         55292,
         140300,
         233361,
         9461,
         44865,
         20811,
         146,
         605,
         24,
         604,
         682,
         272,
         11770,
         98566,
         9502,
         7549,
         1498,
         2024
      ],
      "original_title": "少林搭棚大師",
      "runtime": 99,
      "poster_path": "/7hkpMm2dVKyZzFXoLQnifUqG5FZ.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [{
         "logo_path": "/nPGLMS26OKdu6T7RYakXGYVXFzK.png",
         "name": "Shaw Brothers",
         "id": 5798,
         "origin_country": ""
      }],
      "release_date": "1980-08-24",
      "vote_average": 7.1,
      "belongs_to_collection": {
         "backdrop_path": "/grC83MtaWyTbUcxndTK3khIWiMT.jpg",
         "name": "The 36th Chamber of Shaolin Collection",
         "id": 108125,
         "poster_path": "/wBjZh104nh4HKLIgvrCvdOZzXKC.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chia-Liang Liu"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Kuang Ni"],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0081494/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMTU2MDAzMF5BMl5BanBnXkFtZTcwMDY1MjQxMw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Chia-Hui Liu, Lung Wei Wang, Hou Hsiao | See full cast and crew »"],
      "reviews": [
         "This movie is one of the many \"Kung Fu\" action films made in Asia in the late '70s - early '80s, full of cheap sound effects, dubbed dialog and lightning fast martial arts action. But unlike most films of this genre it also has a decent plot and lots of great comedy. When workers of a dye factory are forced out of their jobs by Manchu bullies, they hire a con-artist (Gordon Liu) to try to scare them off. When his attempt fails miserably, he cons his way into a Shaolin temple to learn to fight for real. But instead of making him a Kung-Fu student, the Master instead orders him to build a scaffolding to cover the roofs of all 36 chambers. Well, it turns out that while he's performing these menial tasks (stacking and tying bamboo poles) that he's learning the skills to be a Kung-Fu expert! It's sort of like in Karate Kid when Mr. Miagi teaches Daniel the basics of karate by having him do routine household chores- \"Wax on, wax off\" et cetera. There's lots of great comedy from beginning to end, and plenty of action at the end when Gordon Liu once again faces his Manchu tormentors. \"This time it's not just tricks- it's the real thing!\" Liu declares, proudly thumping his chest. If you like classic Kung Fu films you don't want to miss this one!",
         "This film is absolutely awesome. I saw it with my brother when we were kids, and we found it hilarious. I'm not sure if it's supposed to be funny, but by god we were hurting by the end! Like the bit where he showing the bad guys what he's learned at the Shaolin temple, and he's working his way up from showing them a mere 50% of his new powers, to \"the full 90%\".... What happened to 100%? And the bit where, in order to show his pals what he's learned, he beats them all up! He whacks his best mate in the stomach, and his mate (who has teeth that are literally about two inches long sticking out of his mouth), bends over and exclaims; \"eeeeuuuuurgh, GREAT KUNG FUUUUUU\". It's a classic movie moment! If you have chance to see this film, do it. It's brilliant!",
         "When the Republicans- sorry: the Manchus- take over a factory and promptly strip the workers of EVERYTHING but their undies, Jen Chieh (Gordon Liu) attempts to do good by standing up to the oppressors. He's a con man and he pretends to be a kung fu master come to set things right. The workers aid in his deception, but he's found out and has his *** handed to him. Determined to make good on his promise to DO good, he sneaks into a Shaolin temple in the hopes of learning a useful trade (i.e.; kung fu). There, too, he is quickly discovered (so much for being a good con man) and is promptly charged with building a scaffold. This he does for a full year. Unlike in THE 36th CHAMBER OF SHAOLIN, where he literally walked on water after some strenuous training, Liu here learns the less demanding \"scaffolding kung fu.\" Among the techniques he masters is the use of bamboo cords (which comes in handy during the final showdown). More comedic than its predecessor, RETURN TO THE 36th CHAMBER is nonetheless worth a look.",
         "Return to the 36th Chamber is one of those classic Kung-Fu movies which Shaw produces back in the 70s and 80s, whose genre is equivalent to the spaghetti westerns of Hollywood, and the protagonist Gordon Liu, the counterpart to the western's Clint Eastwood. Digitally remastered and a new print made for the Fantastic Film Fest, this is \"Presented in Shaw Scope\", just like the good old days. This film is a simple story of good versus evil, told in 3 acts, which more or less sums up the narrative of martial arts films in that era. Act One sets up the premise. Workers in a dye-mill of a small village are unhappy with their lot, having their wages cut by 20% by incoming manchu gangsters. They can't do much about their exploitation because none of them are martial arts skilled to take on the gangsters, and their boss. At first they had a minor success in getting Liu to impersonate a highly skilled Shaolin monk (one of the best comedy sequences), but their rouse got exposed when they pushed the limit of credibility by impersonating one too many times. Act Two shows the protagonist wanting to get back at the mob. However, without real martial arts, he embarks on a journey to Shaolin Temple, to try and infiltrate and learn martial arts on the sly. After some slapstick moments, he finally gets accepted by the abbot (whom he impersonated!) but is disappointed at the teaching methods - kinda like Mr Miyagi's style in Karate Kid, but instead of painting fences, he gets to erect scaffoldings all around the temple. Nothing can keep a good man down, and he unwittingly builds strength, endurance and learns kung-fu the unorthodox way. Act Three is where the fight fest begins. With cheesy sound effects, each obvious non-contact on film is given the maximum impact treatment. But it is rather refreshing watching the fight scenes here, with its wide angled shots to highlight clarity and detail between the sparring partners, and the use of slow-motion only to showcase stunts in different angles. You may find the speed of fights a tad too slow, with some pause in between moves, but with Yuen Wo Ping and his style being used ad-nausem in Hollywood flicks, they sure don't make fight scenes like they used to! Return to the 36th chamber gets a repeat screening on Monday, so, if you're game for a nostalgic trip down memory lane, what are you waiting for?",
         "I agree with another user here and have to say that this is one of the best Kung Fu movies ever! I watched this as a kid and absolutely loved it! The scaffolding scenes are brilliant and you can really empathise with this guy because he is treated as an outcast. Nice humour and fantastic kung fu this movie rocks! If you like Kung Fu you would love this!!!",
         "The original 36th Chamber is known as one of the best Kung Fu movies of all time and I personally echo that sentiment, putting it right up there with The Master of the Flying Guillotine, Seven Grandmasters and The Invincible Armour. I was therefore worried that this movie has been tagged as sequel, knowing that it was unlikely to live up to its predecessor. It turned out to be one of the best movies I have seen in the Kung Fu/Wuxia genre. The story began in a not unfamiliar fashion, where a group of laborers are exploited by their employer who hires some Manchus to essentially frighten them into working harder for less money. They try to fight back and to go on strike but are badly beaten by the Manchus. The workers then get there friend Chao Jen-Cheh (Gordon Lu), an actor, to pretend to be a dangerous Shaolin priest so he can intimidate the Manchus and the boss into treating them fairly but he is eventually found out as a fraud and he too is beaten terribly. After this, Chao vows to go to Shaolin and learn Kung Fu for real and to return to set things straight. For the next while the movie takes a comedic turn as Chao tries many tricks to emerge himself in Shaolin's 36th Chamber (a Kung Fu training zone) and the Abbot takes pity on him, allowing him to stay at Shaolin to put together Scaffolding and fix the temple roofs. Chao does this happily as it allows him to observe the 36th Chamber and he presumes he will be taken on as a student when the roof has been mended. However, 3 years later when the work is complete, he is distraught to find that he is asked to leave the temple without have received any Kung Fu training. He goes back to the village and explains to his worker friends that he has learned nothing. They are angry at him for having learned nothing the entire time he was away and attack him, only to find that Chao has in fact picked up quite a bit simply from having observed the Shaolin students and having incorporated what he has seen into his scaffolding work. Having discovered him strength, Chao challenges the Manchu and the boss who he is now able to defeat with considerable style. The oblivious \"training\" sequences in this film are great and again they justify the use of the label \"36th Chamber\" as the original movie is well known for it fantastic training act. All great Kung Fu movies have an amazing training act and this one is no exception. Another thing which I loved about this movie was the unique \"scaffolding Kung Fu\" style which Chao learns. His time as a scaffolder means that his fighting style is one which largely consists of tying his opponents up. This is unique, amusing, entertaining, impressive and also it brought the whole story together. This is because the laborers at the start are using \"colour sticks\" to mix sheets of cloth into dye. When the Manchus are introduces, they bare their bamboo batons and declare facetiously \"these are our colour sticks\". These in the final fight scenes are reminiscent of the bamboo poles that Chao uses in scaffolding the temple and as he takes the Manchus on, he ties each of them and the batons together like scaffolding. It's brilliant the way this all ties together... The criticisms I have are only twofold and very, very minor. Firstly I found it hard to believe when Chao returns to the village completely unaware that his skills have improved...then again this is a Kung Fu movie and anything can happen. Secondly, one of the lead characters, a worker who provides some early comic relief, has enormous false teeth. This was supposed to be funny but is actually a big and unwelcome distraction.",
         "I love kung-fu and bought this movie under the name 36th chamber, I thought it was THE 36TH CHAMBER OF SHAOLIN. I paid $1 for it and the quality was horrible, so I decided to go and buy the DRAGON DYNASTY release of THE 36TH CHAMBERS OF SHAOLIN. I was going to toss the older version when I happened to notice it was Johnny Wang on the cover, so I put it in the player and sure enough it was RETURN TO THE THE 36TH CHAMBERS. Now I've gotta get a better version of this film, because the DVD I have is a VHS transfer dollar DVD and it's horrible. Anyway so Gordon Liu is back, but this time around he is playing a new character. I really loved him as San Te on the first one, it was a serious and dark Kung Fu gem. This one he plays Jen Cheh and its one of those comedy/kung-fu mixtures. I must admit I was extremely disappointed that it wasn't a real sequel to the first. I wish it had been under another name completely and still used the 36th chambers, its not like anyone could replace Gordon for the part, it just needed a different title. I hate when sequels get off from the first movie and do something like this.... NOT TO SAY THIS IS A BAD MOVIE AT ALL... Far from bad, this is a great film, unfortunately I have a horrible full screen version so I couldn't appreciate all Master Liu's direction had to offer, I know it was good for what I could tell and even in full screen it captured a lot of the beauty of the fights, especially in early scenes where Jen was pretending to be a monk. Gordon put on a lot of weight in the few years in between these movies and looked less like a kung-fu champ and more like a regular guy, which was good for his characters humble beginnings but not so good for where his character would've ended up with all that work and pseudo training. The movie has a small town's biggest economical leader (a dye shop) taken over by ruthless bosses in order to get a better assembly. They cut the pay and refuse to let workers leave, so when a beggar posing as a monk comes to town they use him to fool the bosses and scare them with his fake fighting style. Ultimately the bosses find out this monk is a liar and they beat him up. He then goes to Shaolin Temple, and unlike San Te in the first film, Cha Jen Cheh doesn't get in to train with the others, he is instead told to work and build scaffolding and repair all the roofs of all the chambers. He sets off working, and even sleeping on the roof and spends all of his time watching the other pupils train. He mocks and imitates their moves and becomes an almost acrobatic master on his scaffolding. Once he finishes the job over a year later he asks to join now that hes done the work and the monk still refuses. He goes back home to sadly tell everyone he didn't get to train and they wonder what he's been doing for over a year while he was away. He soon realizes that he is a master of kung fu simply by watching and the imitation practices he had been doing and he takes on the evil boss played by Johnny Wang in one of the best fights ever filmed. You can never go wrong with the Shaw Bros. I've said it a million times.. here brothers Gordon and Chi-Liang once again made a damn good movie... It a great film and if you love martial arts you will wanna check it out, its not a true sequel, but stands alone perfectly. My flaws was that it was super slow building up to the action, it had way too much of a comedy aspect and I gave it 6 out of 10 stars.",
         "I was disappointed my this movie. I wasn't expecting it to be better then the first one, but the comedic element definitely hindered it. Gordon Liu once again stars, but his time he plays an actor impersonating his character from the first one. It is an interesting concept. Basically the plot is the same. The manchus are oppressing a dye factory and hire someone who looks like San Te to fool the manchus. Gordon gets his butt kicked so he goes to Shaolin to actually become a shaolin master. Once he learns kung fu he goes back and frees the dye workers. Its not a bad film, but all the comedic parts got really annoying. I am a big Gordon Liu fan, but a consider this one of his weakest roles.",
         "This movie has a lot of comedy, not dark and Gordon Liu shines in this one. He displays his comical side and it was really weird seeing him get beat up. His training is \"unorthodox\" and who would've thought knot tying could be so deadly?? Lots of great stunts and choreography. Very creative! Add Johnny Wang in the mix and you've got an awesome final showdown! Don't mess with Manchu thugs; they're ruthless!",
         "I thought this would be a sequel to the original \"36th Chamber of Shaolin\" but actually it's more of a light-hearted \"sister\" to the original. Gordon Liu still stars as a would-be hero on a quest to learn kung fu to defeat those pesky Manchus... but this time around it's lighter and more comedic. The film centres around the local dye mill, where wages are cut due to the hiring of 10 new Manchurian bosses. Liu plays \"Chao\", who is able to fool the mill bosses into thinking he is a shaolin monk possessing almost magical kung fu skill. But his luck runs out, he is exposed as a fraud, and he promises the mill workers that he will go to the Shaolin monastery to learn kung fu, and return to protect them. The comedy really begins at the monastery where Chao makes several bungling attempts to get accepted. This sets up lots of really funny moments, and lots of great fight choreography. Continuing in the \"36th Chamber\" tradition we see all kinds of neat and interesting (and supremely hokey) training methods at the monastery as well as creative uses of wooden benches as weapons. Also unique and of note is the blending of kung fu and the craft of bamboo scaffold building. Chao is not accepted as a student at Shaolin but is made to build bamboo scaffolding for the \"10 year restoration\" of the monastery. On the DVD I bought there is a special on bamboo scaffold building and the inspiration that director Lau Kar-Leung drew from it. This is a craft many hundreds (perhaps thousands) of years old, and in Hong Kong scaffolding is still built of bamboo even on large high-rises, though the West exclusively uses steel tubes and clamps. As a result of his scaffolding work, Chao develops a special style of kung fu... when asked what kind it is, he hilariously replies \"scaffolding kung fu!!\" which he first tests during a dust-up with the monastery's Abbot. In the final confrontation with the Manchus, there is a dazzling array of creative uses for bamboo poles and ties. From a comedy perspective, I think it's one of the best of the kung fu genre. As a kung fu film in general, it also stands out... I recommend it to anyone!"
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": ["Shaw Brothers"],
      "summaries": [
         "The workers of a dye factory have their pay cut by 20% when the factory owner brings in some Manchu thugs to try and increase production. Desperate to reclaim their full wages, the workers hire an actor to impersonate a priest and kung-fu expert from the temple of Shaolin. The factory owner proves the actor a fraud, and punishes all those involved. The young actor feels he has let the workers down, and promises to atone. He sets out for Shaolin, determined to be accepted as a kung-fu pupil at the elite temple.",
         "This innovative follow-up to the classice The 36th Chamber of Shaolin shows the Liu brothers at their lethal best, with director Liu Chia-liang transporting Gordon Liu Chia-hui back to the Ching Dynasty with some new kung-fu tricks up his monk's sleeve."
      ],
      "budget": 0
   },
   "movielensId": 55659,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "普通话"
      ],
      "releaseDate": "1980-08-24",
      "dvdReleaseDate": "2010-03-02",
      "directors": ["Liu Chia-Liang"],
      "runtime": 99,
      "movieId": 55659,
      "title": "Return to the 36th Chamber",
      "mpaa": null,
      "actors": [
         "Gordon Liu Chia-Hui",
         "Kara Hui",
         "Hsiao Ho",
         "Dang Wai-Ho",
         "Wong Ching-Ho",
         "Wa Lun",
         "King Lee King-Chu",
         "Yau Chui-Ling",
         "Chan Sze-Kai",
         "Sek Gong",
         "Kwan Yung-Moon",
         "Johnny Wang Lung-Wei",
         "Chiang Tao",
         "Chang Yi-Tao",
         "San Sin",
         "Jackson Ng Yuk-Sue",
         "Ailen Sit",
         "Gam Tin-Chue",
         "Yeung Ching-Ching"
      ],
      "imdbMovieId": "0081494",
      "originalTitle": "少林搭棚大師",
      "genres": ["Action"],
      "youtubeTrailerIds": ["Ek5u5XIRqUg"],
      "plotSummary": "The workers of a dye factory have their pay cut by 20% when the factory owner brings in some Manchu thugs to try and increase production. Desperate to reclaim their full wages, the workers hire an actor to impersonate a priest and kung-fu expert from the temple of Shaolin. The factory owner proves the actor a fraud, and punishes all those involved. The young actor feels he has let the workers down, and promises to atone. He sets out for Shaolin, determined to be accepted as a kung-fu pupil at the elite temple.",
      "tmdbMovieId": 48301,
      "avgRating": 2.73077,
      "releaseYear": "1980",
      "numRatings": 13,
      "posterPath": "/7hkpMm2dVKyZzFXoLQnifUqG5FZ.jpg"
   }
}