{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0439123",
      "video": false,
      "title": "Azur & Asmar: The Princes' Quest",
      "recommendations": [
         65592,
         21348,
         13679,
         79000,
         75491,
         139649,
         222297,
         22624,
         22568,
         70955,
         39405,
         21788,
         1393,
         68046,
         43936,
         80015,
         22504,
         77459,
         16147,
         9992
      ],
      "backdrop_path": "/sRgZodWt7TxF0UeVsOvrxhUFHK9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "La Fée des elfes (voice)",
               "gender": 1,
               "credit_id": "57ccb67c9251415094000277",
               "name": "Sofia Boutella",
               "profile_path": "/btLeUFNIGTxG7FecTMRztSALj6L.jpg",
               "id": 568657,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jenane",
               "gender": 1,
               "credit_id": "58168a31c3a3687669013465",
               "name": "Hiam Abbass",
               "profile_path": "/rWjvzkNGt9Itt9B8MxAcNEXeaOY.jpg",
               "id": 765,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Crapoux",
               "gender": 2,
               "credit_id": "58168a5f9251415d6101276f",
               "name": "Patrick Timsit",
               "profile_path": "/p429Z97XloHvHe2a4PEZPqBZNEi.jpg",
               "id": 41526,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Azur",
               "gender": 0,
               "credit_id": "5915c325925141572301f484",
               "name": "Cyril Mourali",
               "profile_path": "/ogz9HmKkPZ8WyuqMqL4IARF2Ibf.jpg",
               "id": 113737,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Asmar",
               "gender": 0,
               "credit_id": "5915c33fc3a36842c101fa17",
               "name": "Karim M'Ribah",
               "profile_path": null,
               "id": 1815366,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b49251416c750a2a7b",
               "name": "Michel Ocelot",
               "profile_path": "/b4IkeUuA1z9wmvlqNfpe5Z3IrSc.jpg",
               "id": 87429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5730ed2ec3a36819af000574",
               "name": "Michel Ocelot",
               "profile_path": "/b4IkeUuA1z9wmvlqNfpe5Z3IrSc.jpg",
               "id": 87429,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.456675,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 19026,
      "vote_count": 131,
      "budget": 0,
      "overview": "Once upon a time there were two children nursed by same woman. Azur, a blonde, blue-eyed son of a noblewoman and Asmar, the dark skinned and dark-eyed child of the nurse. As kids, they fought and loved each other as brothers do. As grown ups, they mercilessly become rivals in the quest years later, when Azur is being haunted by memories of the legendary Djinn-fairy, and takes it upon himself to journey all the way to Asmar's homeland to seek it out. Now reunited, he finds that she has since become a successful merchant, while Asmar is now a member of the royal guard. However, Asmar also longs to find the Djinn-fairy, and only one of the two youths can be successful in their que",
      "similar": [],
      "original_title": "Azur et Asmar",
      "runtime": 99,
      "poster_path": "/wRubk6Wv4njMyglt6Tnexswg1CI.jpg",
      "spoken_languages": [{
         "name": "Dansk",
         "iso_639_1": "da"
      }],
      "production_companies": [],
      "release_date": "2006-10-25",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Michel Ocelot"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Michel Ocelot"],
      "originalLanguage": "Arabic",
      "imdbLink": "http://www.imdb.com/title/tt0439123/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNDg2NDk0NF5BMl5BanBnXkFtZTgwNjc3ODkwMzE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Cyril Mourali, Karim M'Riba, Hiam Abbass | See full cast and crew »"],
      "reviews": [
         "I saw this today as part of the London Children's Film Festival 2006 at the Barbican Centre and found it completely and utterly satisfying. Every second of screen time is mind-blowingly beautiful to the point of being painful - from the wild flowers on the field where the title characters played as boys, to the starlit silhouette of Azur and the Princess on a treetop. But don't let the sumptuous visuals make you think this film is just eye candy. The story is engaging and yet profound, the characters vivid, and the message (yes, it has a message, but what's wrong with that?) is inspirational; a quality that the English-language animated films of the last decade has completely eschewed. Ocelot's early 'Princes et Princesses' was enchanting and promising, and both his Kirikou films were endearing. But with 'Azur' he has totally ascended to a different level. It is admirable how he consistently refuses to dumb down his characters, and the delightful ending is wonderfully faux conventional in Ocelot's trade mark style. Difficult to see how popular this would be with today's kids, but a generation growing up inspired by 'Azur' would no doubt be more pacifist and tolerant.",
         "In Valladolid, Spain, the serious movie-goers with extremely high standards when they evaluate movies applauded the film in the Fifty-First International Film Week (SEMINCI 2006). It is impossible to exceed in every way: The theme and story, the incredible cartoon drawings, the luscious colors and their combinations, the endearing characters, the creativity, the stunning difficulty of the sketching and the music and sounds of the languages involved all combine to offer us a memorable film. It may seem curious but the word that I voiced when it ended was DELICIOUS. There are so many impacting images that linger even now in my mind's eye.",
         "I was moved to tears by this simple yet so aesthetically pleasing fairy tale. The moral of the story is not layered too thickly on top, but still there's no way round it: this is about respect, tolerance, prejudice and open-mindedness. The oriental influence in style, music,language........is wonderfully inspiring and is a very much needed anti-dote for the negative light in which the Mediterranean cultures are usually presented. Beautiful music (and silence!); splashes of color; a very tactile movie. Absolutely a favorite for me and my children!",
         "This movie has it all for all ages - eye-popping visuals, perfect subject independence, gorgeous music and it is chock-full of wonderful messages and story-telling for everyone. The richness in the images is equaled by the richness of the subject matter: a story rewarding curiosity, fidelity and bravery deals with the excitement of discovering little-known cultures, eras, religions, foods, habits of dress, languages, music and the other sex... The trailer and the brief description by the distributor hardly do this piece of magic justice. A must-see as soon as it becomes available near you.",
         "I have seen many great animated tales - from Wall-E, Cars, Ratatouille, Curse of the Were Rabbit, Spirited Away, Belleville Rendezvous, Princess Mononoke, to Ghost in the Shell, Aladdin, Waking Life, The Lord of the Rings and Peter and the Wolf. This is film has some great qualities of all the above. Firstly the story telling is charming, and time is spent on the characters from the beginning. The animation is more Belleville Rendezvous than Wall-E but it is an exquisitely unique experience as a result. In this film the intensity always took me by surprise. The incredible contrast of blue eyes, a silhouette frame against the night sky. The intricate detailing of eastern architectures. The vivid saturation of colours. The use of light and dark and colour in particular is possibly the most beautiful of any animation I have ever seen. It had a wonderfully natural quality to the character animation - like the older Disney films, but with striking backgrounds and detailing. Also interesting is the constant interplay between western and eastern cultures. The dialogue is at times both beautiful, quirky and thoughtful. I'd recommend this if you have an interest in other cultures, beautiful drawing and quirky storytelling.",
         "The story and setting for this French animated film, in which two childhood friends travel through a semi-mythical land on a quest to find the Djinn fairy, reminded me strongly of The Alchemist, a story written by Paolo Coelho. The tale is not quite as timeless as Coelho's novel but the film conjures a similar magic. This is in large part due to the jaw-dropping visual style, which is quite unlike anything else I have seen. The characters look superb, with luscious colours applied uniformly across clothing and intricate jewellery glinting marvellously. The range of settings is more dazzling still, ranging from green fields jam-packed with flowers and seedpods to bustling market towns to breathtakingly ornate palaces. There are innumerable wondrous images to recount and many clever visual touches such as the exaggerated proportions bestowed upon wildlife, including an enormous horse and a tiny cat. Unfortunately, I think that the translation of the film for English audiences has diluted some of the original message. This is most notable in the character of Crapoux, whose snobbery is used partly to propagate the film's message of cultural understanding. The scene where Crapoux derides foreign cookery next to that of his native country might be plausible when he is speaking in French. However, an English-speaking character deriding foreign foods against traditional English fare such as apple sauce seems rather surreal and amusing in way that the writers surely did not intend. (This is not to say that the English are strangers to cultural snobbery.) A further problem I had with the film was the ending, which was fairly predictable and therefore suffered from being so drawn-out. Nevertheless, I was greatly relieved to be spared the song-and-dance ending that typifies so many modern animations. The absence of any pop culture references was also refreshing (Pixar take note).",
         "'Azur & Asmar' is a beautifully told story of two young boys, one French,the other Arab,growing up in North Africa years ago,with the same dream of finding the Princess Djinn. When the two boys grow older, the Father of the young French boy takes his young son away from his life long friend. The young Frenchman finds himself on a desert island (or so he thinks),where he acts the part of a blind wandering beggar. Along the way,he befriends a rather crass Englishman (also a beggar),and manages to re-connect with his past (I won't spoil the rest of the plot for you). This is yet,another fine example of 3D CGI animation,done to perfection. Michel Ocelot writes & directs this charming little fairy tale,which also teaches young children about just how evil racism really is & how we should,as a people,live as one. Tagged a PG rating by the MPAA,this film does contain a few scary moments that could be a bit frightening to very young children,as well as some unpleasant moments of racism",
         "This is a great fairy tale animation, both for kids and for \"older kids\"; it's among the best animations I've seen in the last decade. (I'm surprised it's not better known in the U.S., and suspect the issue is incomplete understanding of the language options, leading to the mis-conclusion that subtitles are necessary. -see below-) It's rather like another episode of \"1001 Arabian Nights\". Like any fairy tale, it plays fast and loose with time (16th century or 20th?) and place (Arabia or Persia?). There is no gore, very little blood, no glorification of violence, no double entendre talk (well one raised eyebrow once) ...and no \"good guys\" or animals die. Although it started out a bit slow and simple, I was soon pulled in so thoroughly I couldn't even contemplate pausing the DVD while I went to the bathroom. The animation backgrounds appear to be typical 2D paintings, sometimes with multiple layers. Two things about the backgrounds stand out: First, they are highly detailed and variegated. And second, they use a lot of different strong colors at every opportunity - stained glass windows, meadow flowers, a spice market, dyed yarn, architectural tiles, geometric building decorations, etc. The magical figures appear to be 3D models, but so outrageously patterned and colored they're a feast for the eyes. The human figures also appear to be 3D models, but very simple ones, and in most cases projected as just simple flat areas of solid colors. Clothing mostly doesn't \"drape\", although flags, pennants, and sashes wave here and there. A couple effects are used especially well. One is the movement of point source lights. Walls and rooms subtly change color from one end to the other. Direct sunlight in the observatory is blinding. Fireflies light a scene. Darkened rooms gradually turn into brilliantly light ones as individual lights come on. And djinns cause showers of sparks. The other is swirling particles. Dust comes together into imagined figures (rather like seeing figures in the clouds). Fog envelops figures so thoroughly they disappear. A crystal prison shatters and the shards form an arch before disappearing. In summary, the animation doesn't attempt to do 3D model animation better than Pixar, instead going off in a completely different direction. Rather than being clever and realistic, the animation flaunts its gorgeousness and the focus is on the story line. The figures are adequate to convey the story, but without any attempt to be marvels in their own right. Another difference from typical Pixar wannabes is there are no pop culture or current events references here; rather than presenting jokes every few tens of seconds, this animation relies simply on impeccable pacing of the story itself. The \"moral\" of understanding diverse cultures and its benefits is hammered home again and again. Even the end credits call attention to the diverse cultures the animators came from. A perfectly serviceable English audio track exists; it was on the DVD I got from Netflix in late 2011. Younger viewers and others not comfortable with subtitles may find this the best way to make this animation accessible. The mismatch between mouth movements and the English audio is not distracting. This simpler view is complete and enjoyable; there's no need to understand any more. But if you want to look a little deeper, it quickly becomes apparent that characters often switch between speaking French and speaking Arabic, sometimes even to different individuals in the same scene. Some of the jokes only halfway make sense if you're not aware of the language switches. And in a couple places the language switches are even relevant to the story line itself. Unless you know either French or Arabic, or have very quick ears, you may not be able to pick out all the language switches. The best way to understand them (for me at least) was to select \"French\" as the spoken language track and \"English for the hearing impaired\" (_not_ the regular \"English\") as the subtitle track. The \"English for the hearing impaired\" subtitles not only provide the dialog itself, but also indicate what language is being spoken. In fact, these subtitles are some of the best I've ever seen at conveying multi-lingual content.",
         "I found the first fifteen minutes or so of this movie painful to watch; flat clunky animation of not much happening set against clumsy 3D backgrounds. I have nothing against slow, thoughtful movies, or less-than-state-of-the-art animation. But this was lacking any kind of spark. There was no life in it. It was like watching someone else wandering around in Second Life doing nothing in particular. The character of the father was particularly awful (the flat, \"I am delivering a line\" voice-over in the English version didn't help - not that the actor could have really done anything with the lines he was given, they were real: \"I am going to advance the plot now!\" stuff.) He wasn't even a TWO dimensional character. However, after this overly long set up, and once the action moves to the unnamed Arabian country, the movie picks up and becomes a lot more interesting, both visually and narratively and by the end, though I was not entirely blown away (the protracted 'dilemma' ending was far too long) I was happily satisfied. But then I'm not really the target audience. So, over to the target audience.... My daughter Holly (aged 7) says: \"I thought this film was really good when Azur had two keys and threw them into the two cavern door when they needed it. It was a bit scary when he didn't have the key for the slashing irons but his brother did and he used it. It was fun. The wee girl as the princess was good. It was one of the most enjoyable movies I've ever watched!\"",
         "\"Impossibly gorgeous\" animated French film AZUR & ASMAR opens in San Francisco Friday! Film director Michel Ocelot will be attending both the 4:15 and 7pm shows on Friday at the Landmark Opera Plaza Cinema. The 4:15pm show is an audience Q&A, while the 7pm show is an introduction to the film. The film has received wonderful reviews for its remarkable visual beauty and timeless story of multicultural friendship and adventure. In English - Recommended for ages 6+ Set in the Middle Ages, Azur and Asmar is the story of two boys raised as brothers. Blonde, blue-eyed, white skinned Azur and black-haired, brown-eyed, dark-skinned Asmar are lovingly cared for by Asmar's gentle mother, who tells them magical stories of her faraway homeland and of beautiful, imprisoned Fairy Djinn waiting to be set free. Time passes, and one day. Azur's father, the master of the house, provokes a brutal separation. Azur is sent away to study, while Asmar and his mother are driven out, homeless and penniless. Years later, as a young adult, Azur remains haunted by memories of the sunny land of his nanny, and sets sail south across the high seas to find the country of his dreams. Arriving as an immigrant in a strange land, Azur is rejected by everyone he meets on account of his \"unlucky\" blue eyes, until finally he resolves never to open those eyes again. The once-beautiful child clad in gold is reduced to a blind beggar. Yet, blind though he is, little by little and step by step, he discovers a beautiful and mysterious country. Meanwhile, back in her homeland, Azur's nanny has become a wealthy merchant and Asmar has grown into a dashing horseman. Reunited but now as adversaries, the two brothers set off on a dangerous quest to find and free the Fairy of the Djinns."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Nord-Ouest Productions",
         "Mac Guff Ligne",
         "Studio O"
      ],
      "summaries": [
         "Once upon a time there were two children nursed by same woman. Azur, a blonde, blue-eyed son of a noblewoman and Asmar, the dark skinned and dark-eyed child of the nurse. As kids, they fought and loved each other as brothers do. As grown ups, they mercilessly become rivals in the quest years later, when Azur is being haunted by memories of the legendary Djinn-fairy, and takes it upon himself to journey all the way to Asmar's homeland to seek it out. Now reunited, he finds that she has since become a successful merchant, while Asmar is now a member of the royal guard. However, Asmar also longs to find the Djinn-fairy, and only one of the two youths can be successful in their quest.",
         "Azure is a blond boy with blue eyes, Asmar has dark hair and dark eyes. As kids, they fought and loved each other as brothers do. As grown ups, they mercilessly become rival in the quest for the djinn's fairy, in a medieval Maghreb, full of dangers, magic spells and wonders"
      ],
      "budget": 9000000
   },
   "movielensId": 55856,
   "movielens": {
      "languages": ["Dansk"],
      "releaseDate": "2006-10-25",
      "dvdReleaseDate": "2007-04-26",
      "directors": ["Michel Ocelot"],
      "runtime": 99,
      "movieId": 55856,
      "title": "Azur & Asmar: The Princes' Quest",
      "mpaa": "",
      "actors": [
         "Sofia Boutella",
         "Hiam Abbass",
         "Patrick Timsit",
         "Cyril Mourali",
         "Karim M'Ribah"
      ],
      "imdbMovieId": "0439123",
      "originalTitle": "Azur et Asmar",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["XBgjlRipnb4"],
      "plotSummary": "Once upon a time there were two children nursed by same woman. Azur, a blonde, blue-eyed son of a noblewoman and Asmar, the dark skinned and dark-eyed child of the nurse. As kids, they fought and loved each other as brothers do. As grown ups, they mercilessly become rivals in the quest years later, when Azur is being haunted by memories of the legendary Djinn-fairy, and takes it upon himself to journey all the way to Asmar's homeland to seek it out. Now reunited, he finds that she has since become a successful merchant, while Asmar is now a member of the royal guard. However, Asmar also longs to find the Djinn-fairy, and only one of the two youths can be successful in their que",
      "tmdbMovieId": 19026,
      "avgRating": 3.37838,
      "releaseYear": "2006",
      "numRatings": 37,
      "posterPath": "/wRubk6Wv4njMyglt6Tnexswg1CI.jpg"
   }
}