{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1135489",
      "video": false,
      "title": "Endgame: Blueprint for Global Enslavement",
      "recommendations": [
         26750,
         9561,
         13175,
         44695,
         69123,
         222468,
         27922,
         64745,
         44783,
         16986,
         64378,
         4106,
         222071,
         6057,
         69321,
         17212,
         75262,
         45886,
         11871,
         83122
      ],
      "backdrop_path": "/t4WxWKzEQ4L6g86XmIy4oNqtDBi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47739251416c75099ceb",
               "name": "Alex Jones",
               "profile_path": "/pB0gZapJuw4QGhNRRiJf4qzdC92.jpg",
               "id": 57970,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58019e089251417ffd0022d1",
               "name": "Alex Jones",
               "profile_path": "/pB0gZapJuw4QGhNRRiJf4qzdC92.jpg",
               "id": 57970,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.386449,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18312,
      "vote_count": 15,
      "budget": 0,
      "overview": "For the New World Order (NWO), a world government is just the beginning. Once in place they can engage their plan to exterminate 80% of the world's population, while enabling the 'elites' to live forever with the aid of advanced technology. For the first time, crusading filmmaker Alex Jones reveals their secret plan for humanity's extermination: Operation Endgame.",
      "similar": [],
      "original_title": "Endgame: Blueprint for Global Enslavement",
      "runtime": 139,
      "poster_path": "/4NI59KbXWE0AaefHD8CG9KyuTD1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-11-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://infowars-shop.stores.yahoo.net/endgamedvd.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alex Jones"],
      "runtime": 139,
      "synopsis": "Documentary filmmaker Alex Jones chronicles the history of the global elite's bloody rise to power and reveals how they have funded dictators and financed the bloodiest wars - creating order out of chaos to pave the way for the first true world empire. Jones and his film crew track the elusive Bilderberg Group to Ottawa and Istanbul to document their secret summits, allowing you to witness global kingpins setting the world's agenda and instigating World War III. This documentary contains eyeopening information about the formation of the North America transportation control grid, which will end U.S. sovereignty forever. Discover how the practitioners of the pseudo-science eugenics have taken control of governments worldwide as a means to carry out depopulation. This film also details the progress of the coming collapse of the United States and the formation of the North American Union.",
      "writers": ["Alex Jones"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1135489/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwOTgwMjM2MV5BMl5BanBnXkFtZTcwMjI2MDU1MQ@@._V1_SY317_CR14,0,214,317_AL_.jpg",
      "actors": ["Stars: Jim Tucker, Daniel Estulin, Alex Jones | See full cast and crew »"],
      "reviews": [
         "Alex Jones is a modern day messiah. Not in a religious way, but as the voice of reason crying in the desert. He has dedicated his life trying to wake up drowsy population from its slumber and to point out real issues of today's world of hypocrisy. This courageous, provocative and controversial investigative journalist, cinematographer and radio show host, in his attempt to uncover false flag terrorism, deprivation of human and civil rights and the introduction of world government and police state in US, tries to put up all the pieces of the big picture and present it to the ignorant world. He has made a number of documentaries and short videos disclosing the complex New World Order secret societies' agenda in a very thorough and detailed way. Among those is a shocking video made in 2000, when Alex sneaked inside Bohemian Grove, a redwood forest retreat near San Francisco, where the most powerful men of the world such as presidents, prime ministers, bankers, royalty, businessmen and even actors secretly gather each year, and shot an obscure cult ceremony of sacrificing human effigy to the giant stone owl by the men dressed in devil worshippers' hoods and documented GWB's affiliation with the Yale's cult Skull and Bones. In his striking documentaries, he tries to show that today's society is under the thumb of handful of people who own and control most of the world's governments and resources, thus the wars and crisis too. They create problems so they could use their predefined solutions. This movie shows a grim prediction based on hard facts of things that may come in the near future - one world government keen on depopulating the world and enslaving what's rest of it, while the elite would live forever by taking advantage of modern science and eugenics. Taking in account that Alex have predicted 911 attacks and accused the government for it just a couple of months before the actual events took place, one may become disturbed that this premonition of his may become reality once again, for it is based on a decade of research and experience in dealing with this hidden in plain sight agenda. He is in no way clairvoyant, he just saw and realized what most of the people still can't, so he knows who is he dealing with and what they're capable of. Not because he's smarter than the rest of us, but because the large majority of people find football scores or Britney's haircut more important than any form of knowledge, especially knowledge that has been deliberately hidden from us for centuries, if not millenniums. If we all could come to our senses, we would be able to see that we are being hoaxed, robbed, controlled, deprived and debt-enslaved by the powers outside our perspective. We call it 'the system'. As long as we play along, democracy is the game in which these secret societies are bound to win, for they control the candidate, the party, and the policy predestined to win. Alex once said: \"Democracy is when two wolves and a sheep vote on what's for dinner\". My friend Dave went even further: \"No, democracy is when vultures make the wolves and sheep believe they're voting on what's for dinner\". I think this sums up what Endgame is all about. Ask yourself why this world of humane atheists, good Samaritans, merciful Muslims and meek Buddhists is the world of misery, a gloomy world in which we invade sovereign countries, kill innocent civilians, women and children, tagged as collateral damage, a world in which we spend billions on weapons and wars, not on food, a world where people die of starvation, while we're saving turtles and toads, a world we're trying to save from alleged global warming by introducing another tax, while testing nukes or dropping thousands of tons of napalm and depleted uranium. And while we just sit there and do nothing, at least Alex is out there somewhere with his bullhorn and camera. I am disappointed by the rating and the number of votes here. I'm sure we've all seen National Treasure though and gave it a good rating. Watch his films. Educate yourself. Open your eyes. Stand up for your rights.",
         "ENDGAME is quite possibly the most fundamentally disturbing multimedia presentation ever put forth for consideration by an ambulant public so habituated to having global concerns interpreted for them, not because this conspiratorial perspective hasn't been expressed before, but because it is expressed in the same highly polished and well produced emotive fashion that mainstream media delivers its perspective. Past works by Jones may well have been overwhelming to the average person due to their blizzard-like flurries of hard evidence, eyewitness testimony, governmental documents and admission, and confessions by the some of the worlds most powerful and influential people, but this film is different. This film is accessible. It does not 'ask' you to reconsider the merit of having trust and faith in the wealthiest most powerful people in the world, it demands it, by teasing you with quotes like Prince Philip's \"In the event that I am reincarnated, I would like to return as a deadly virus, in order to contribute something to solve overpopulation\". We have been conditioned to accepting undeveloped and incomplete expressions, and it would appear that Alex Jones has finally accepted this, probably at least in part due to advice from those well versed in the art of communication. This production is entertaining in the purest sense, and bypasses that 'I hate documentaries' filter may of us carry. Its tone and cadence is almost dreamy, despite its nightmarish content. In the end it is merely a perspective. The true cause of all mankind's problems is of course simply human weakness. What makes this film so special, not unlike elements of his past works, is that it lends the viewer some courage, and also leverage, towards tackling their own weakness, while baiting them towards uncovering for themselves what could be described as 'secrets'. The paradox here is that these 'secrets' have always been in plain view, but for some reason the vast majority of people down in the larger lower sections of the pyramid seemed to have been tricked into taking the perspective of those high up in the highly exclusive pyramidion. Alex Jones ENGAME is a bold effort towards reminding us all that we are in fact nearly entirely redundant and superfluous to those that hold the power, the power that we have given willingly, in exchange for a promissory note assuring us of some fairy tale trouble-free paradise on earth.",
         "This documentary is truly a masterpiece of investigative journalism. If it were not for the obstructionist policies of the global elite I am sure that it would be in the running for one, if not two or three, Pulitzer prizes. In this review I will be covering two main areas, firstly, the structure and set up of the documentary itself, before discussing the content, and my views, thoughts etc. Firstly, the documentary itself. It is obviously scrupulously researched, as is shown by the wide variety of archival, historical and even anecdotal evidence shown in this film, a snip at two hours. The number of experts is also impressive; the main guy they use (whose name I forget) has a doctorate in Forestry Science or some such, and this discipline obviously gives him a unique insight into history, economics, politics, and all kinds of things that you wouldn't have thought would be contained in a field which consists of studying the environment and suchlike. They also have a journalist called Joe Tucker or something; don't let his shaking body and voice, and his rampant alcoholism fool you, this guy is sharp. Some of the comments he makes chilled me to the bone. Also, his habit of wearing a hat in all weathers, in all environments, and even inside, is a sign of his intellect I suppose. There was an economist mentioned as well, but according to google he doesn't exist, so instead I'll discuss what I like to call the \"unnamed experts\", that Mr Jones encountered on the street. These guys knew what was up, they aren't sheep like you and I, they know the score. The filming style was also good, interspersing pictures of modern day people with greedy bankers and evil dictators was a nice touch, thus showing the inextricable links between these two groups of seemingly unrelated people. Also, the man doing the voice over should win an Oscar, the way he managed to sound so disinterested and also bland is incredible, and helped to add an air of objectivity to the proceedings. So, now on to the content. Firstly, the evidence used was an extraordinary mix. From using contemporary etchings and paintings to prove their historical interpretations, to using a fat guy who says \"I was there\". Stunning, a veritable cornucopia of positive reinforcement. In my opinion baseless assertions have been given far too little recognition in mainstream documentaries, it is about time they were given a greater role. Alex Jones is the man to do this. Why sully the affair with such vulgar things as \"facts\" and \"evidence\". These are all provided by the \"man\" anyway, and the people at Bilderberg. To conclude, this is a must see. How else will you be able to warn all your friends about the inexorable approach of the New World Order, who want to kill all but 500 million of us (the rest will have their organs harvested) because some large rocks say so.",
         "I am a fan of Alex Jones and his effort to inform the public and document the problems with our government on all levels. However, this documentary seems to lose some of the elements that gave the previous \"Terrorstorm\" documentary DVD much more impact. It is hard to put my finger on why \"Endgame\" lacks the same ability to capture attention while providing important information, but it was a little disappointing in that regard. Maybe it was the point that although things are bad in regard to the disconnect between the US Constitution, the Geneva Convention, common sense, and how government actually operates, there has been an underlying hopefulness that constitutional government and sanity could be restored. Maybe the implied message has changed with \"Endgame\", that we have reached a point of no return now having to go through a period of real depression and pain before things can start to improve. More and more patriots that I respect seem to have concluded that the American people are not going to be motivated to get the criminals out of government without a real slap in the face to wake them up from their delusions. People still accept the lies we are being presented as the \"official\" story, churches still support a corrupt government to keep their tax free income, politicians are still being bought, and tax dollars are still being used to fund special interests instead of the best interests of the people. There is no one able to overcome the mass media bias against anyone offering real solutions to ending the Establishment's grip on the levers sending us down a dangerous corrupt path. Now that bank \"bail-outs\" are used as excuses to rob Americans blind, and the two party system fails to provide solutions the end may be near, one way or another. Can these corrupt activities be reversed once the truth is finally confronted and the denial ends? It looks like one large bitter pill ahead.",
         "I have always viewed Mr. Jones' work with a little bit of skepticism. I find that I agree with 60-70% of what he has to say and of his tactics. I often wonder if he has a hidden agenda and what it might be. Also, I find that, generally, he starts to make a valid point and then meanders into mild paranoia (this may just be a result of my own mild paranoia). Don't get me wrong, Mr. Jones has opened my eyes to many things and I thank him for that and I hope that he continues to expose 'the little man behind the curtain'. What worries me most after seeing 'Endgame' is that his message is becoming one of hopelessness. He now adds environmentalists to his list of puppets to the New World Order. Mr. Jones has systematically removed everyone and everything from the column of good to his column of evil. Which makes me think, \"Perhaps, Alex Jones is part of the problem.\" Endgame offers no solutions... just envisioned results of doom and gloom for the people. It would appear that Mr. Jones' role in all of this is to make people aware of what is going on and then funnel his followers into a mass that has no option except to rise up and fight the machine. What if that is the \"Social Elite's\" plan? They have the laws, the FEMA camps and the will to exercise their power... all they need is an excuse to use them and a revolution would be that excuse. And perhaps this is where Mr. Jones' Hidden Agenda comes in... could he be a pro-gun, anti-government Anarchist (which, I'm pretty sure would fall into the category of 'Terrorist' under the Patriot Act)? Let's hope he's not that extreme but, I therefore ask that Mr. Jones not just wind up the people but, give them some solid direction and offer realistic solutions to overcome this wave of fascist tyranny that has corrupted the USA. Otherwise, he may discover, too late, that he was just another pawn of The Endgame!",
         "How do I know that Alex Jones is for real? I know this because the mainstream media here in Canada criticizes him. On average I think that Americans are friendlier than Canadians, maybe because they haven't been under British rule for a long time. Now here's the gist. This is another in a series of quite popular films by Alex Jones which attempt to reveal the plans of the globalists. Is it worth watching? You bet it is, but keep in mind that the film is meant to educate Americans. Jones is no Michael Moore when it comes to documentary filmmaking, but his films are quite good. The information he reveals, however, is much more important than what Moore talks about. In his films Moore doesn't question the official version of events but Alex Jones does. What's revealed in Endgame is sinister. If you know real history, however, it's not really surprising. As much as I like Jones's radio show he's not the only source of information that I have about the goings-on of the Western elite. One important thing that I know about Anglo-Saxons is that they're good chess players when it comes to global politics and economics. If you add to them the Jewish elite then they become one seriously cunning and formidable force. Actually, the alliance between Anglo-Saxons and Jews dates back to Queen Victoria's time. It was then that the English agreed to intermarriage between the Anglo-Saxon and Jewish elites. I'm not an anti-Semite but facts are facts. It's quite possible that the Mossad played an important role in the 9/11 attacks. When it was founded the United States used to be independent of these people. But over time, and especially during the 20th century, America came under the influence of the British. In many ways America is now the strong arm of the global elite. Their plans for a global government are quite something, but recently I've been hearing that this scheme may not actually work. Even if it doesn't work what's currently going on isn't good for America or the world. After the dissolution of the Soviet Union the Western elite don't even have to try anymore. In some ways the existence of the USSR was seriously beneficial for ordinary people in the West. But now the elite often don't conceal their intentions, with one individual saying that he'd like to be reborn as a virus that can kill most of the world's population. The Western elite, or the 1%, live in their own world, and nowadays they have nothing in common with the 99%. I like the theory of civilizations, which is explained by Carroll Quigley in his books. A world government would certainly be beneficial for the corporatocracy. These days Western capitalists just can't accumulate wealth like they used to. China certainly gave them a helping hand by becoming their workshop and creditor, and if the situation in China becomes unstable then they can move their business to India. India is, in many ways, the ideal place for exploitation because there have been very few peasant revolts there. This is because of India's caste system. India is the most fascist state in the world, and an Indian of one class has no hope of becoming a member of a higher class. Anyway, for now the plan is to reduce the world's population by 90% and to reduce the level of education so that the world would be a lot easier to govern with a global dictatorship. There will be 150-200 agglomerations where life will be sweet, and between them will be spaces where even cannibals could live. Even if this frightening scheme doesn't work then we may still get a Universal Empire in which the United States will rule most of Western Civilization.",
         "Alex Jones is an agent of British intelligence whose mission is to create his own monopoly in the 9/11 truth movement and wreck it from the inside. He's discrediting calls for independence with his manipulations and obnoxious behavior. Sending in deceiving and ranting characters is one of the most common ploys by the British propaganda machine. He's misleading his listeners and filling their heads with deceptions and half-truths. He's leading them into the wilderness where they act like useless conspiracy theorists instead of doing anything against the British and the financiers. He's closely linked to the British and he surrounds himself with anti-American characters. He's opposing progress and anyone who stands up for the American state. He's fooling millions of people while the financiers and the City of London are wrecking the American economy and the American state. He's ranting against a \"New World Order\" while in practice fully supporting the plans of the London-based oligarchy. And he's a crook. Franklin D. Roosevelt and John F. Kennedy were killed by British special-forces. The CIA is a branch of British intelligence. Allen Dulles worked with the British for decades. After World War II the British captured key positions in the United States and launched an information war to continue dominating the world.",
         "Alex Jones' documentaries are wrought with intrigue and paranoia.This is what makes them so entertaining.Once again his old enemies are afoot.The New World order are having a pow wow.The Bilderberg group,made up of major powerbrokers,bankers and leading politicians,is meeting again and Alex and his crew are picketting the meeting and reporting on those arriving at the meeting. Of course this is just a springboard for Jones'delivery of information about the global elite who control the planet and manipulate wars on the planet to accrue wealth. Top stuff if you like this sort of thing.Yes,the truth is out there and fascinating when presented by the likes of Conspiracy Celeb Alex Jones.",
         "Having just watched Endgame I thought I would share a few thoughts with you all. Firstly the doco is well made, most of Jone's work is. And it certainly covers an interesting topic. However I must confess that it failed to convince me in any way that the \"elite\" whoever \"they\" are are planning to wipe out 80% of humanity while they live on forever in paradise, it all sounds like a b-grade sci-fi horror film to me. For one thing as I pointed out earlier Jones fails to even tell us exactly who the \"New World Order\" are. He continually uses vague words like \"The Elite\" and \"Them\" and \"They\" so Its impossible to know exactly who he is talking about. He also fails to gave any evidence at all as to how exactly 80% of the worlds population is to be wiped out, how the rest are to be herded into huge cities, or how the elite are going to live forever. He just gives us a few jingles about genetics. It's hard to know if Jones is onto something or if the guy is just paranoid. I consider myself to have an open mind, however an open mind still requires facts, Jones fails to deliver. I will however continue to watch the power brokers around the world and will certainly keep an eye open for any major calamity heading our way. If Jones wants to convince free thinking informed people that Armageddon is just around the corner he is going to have to do a lot better than this.",
         "The problem with Alex Jones and other conspiracy theorists is their failure to account for multiple lines of causation and accidental trends based on human nature, which provide an Occam's Razor explanation that requires no conspiracies. Sure, there are some people plotting bad things behind the scenes, but they tend to be in scattered groups with limited power. But Jones sees conspiracies everywhere and forces disparate pieces of evidence to fit that assumption. He inserts just enough truth to hook gullible minds and fellow sufferers of the \"Dunning-Kruger effect.\" It does take a certain cleverness to invent compelling twists and turns, but it's not wise cleverness. Jones seems to be a megalomaniac who wants people to think he's got the ultimate insight. Conspiracy theorists find rational explanations boring, so he'll always have an audience. The New World Order (a phrase taken out of context from old speeches) can be explained by trends in global commerce, encouraged by economic growthism that chases dwindling natural resources and finds \"emerging markets\" as existing ones play out. It may seem like they want to control people, but they mostly want to exploit physical matter around the globe. There is no need to layer mysteries on top of the natural human tendency toward gluttony and resource pillaging. Most of it is happening in plain sight. Regarding Jones' theories on population-control, it shouldn't take a vast NWO plot to notice that Man is overloading the Earth's carrying capacity and we need to lower birthrates to replacement levels ASAP. Nature will kill off (and already is killing off) millions of people via starvation long before the \"elites\" can poison the water. It's reckless to portray the serious need for growth cessation as an evil conspiracy. Smart people should downsize voluntarily, given so much evidence of resource depletion. Does Jones propose that we keep adding 80 million more people each year to this finite planet indefinitely, with so much existing overload? Historical genocides are often linked to population pressures in poor regions, even though they get passed off as \"politics.\" Study root causes of the Rwanda massacre, for example. Jones also seems to be an evolution denier, and dismisses the science behind global warming in favor of conspiratorial plots. The notion that thousands of climate scientists have been colluding to raise taxes and control people is ludicrous (the CO2 warming effect was first noticed in the 1800s). AGW was all about physics until the lunatic Right grabbed the issue. Jones' interpretation of such things reveals his \"scientific\" thought process, which is anything but. He was at his best as an animated character in a Linklater film, and should have stuck with dark comedy."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Magnolia Management"],
      "summaries": ["For the New World Order, a world government is just the beginning. Once in place they can engage their plan to exterminate 80% of the world's population, while enabling the \"elites\" to live forever with the aid of advanced technology. For the first time, crusading filmmaker Alex Jones reveals their secret plan for humanity's extermination, Operation: ENDGAME"],
      "budget": 120000
   },
   "movielensId": 56102,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-11-01",
      "dvdReleaseDate": null,
      "directors": ["Alex Jones"],
      "runtime": 139,
      "movieId": 56102,
      "title": "Endgame: Blueprint for Global Enslavement",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1135489",
      "originalTitle": "Endgame: Blueprint for Global Enslavement",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["f20EIt4QYsI"],
      "plotSummary": "For the New World Order (NWO), a world government is just the beginning. Once in place they can engage their plan to exterminate 80% of the world's population, while enabling the 'elites' to live forever with the aid of advanced technology. For the first time, crusading filmmaker Alex Jones reveals their secret plan for humanity's extermination: Operation Endgame.",
      "tmdbMovieId": 18312,
      "avgRating": 3.8,
      "releaseYear": "2007",
      "numRatings": 5,
      "posterPath": "/4NI59KbXWE0AaefHD8CG9KyuTD1.jpg"
   }
}