{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "upper class",
            "id": 213
         },
         {
            "name": "women",
            "id": 515
         },
         {
            "name": "father murder",
            "id": 2123
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "sibling rivalry",
            "id": 11157
         },
         {
            "name": "maid",
            "id": 13097
         },
         {
            "name": "father figure",
            "id": 170652
         },
         {
            "name": "christmas",
            "id": 207317
         },
         {
            "name": "murder hunt",
            "id": 217324
         }
      ],
      "imdb_id": "tt0283832",
      "video": false,
      "title": "8 Women",
      "recommendations": [
         51447,
         302,
         1555,
         1826,
         2841,
         11444,
         649,
         4973,
         10452,
         1553,
         135281,
         10795,
         12480,
         4031,
         46761,
         2455,
         1791,
         48034,
         11876,
         2566
      ],
      "backdrop_path": "/8xuvdjMXu0vbGnY0hSEY9pMKlxe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Gaby",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e0f5",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Augustine",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e0f9",
               "name": "Isabelle Huppert",
               "profile_path": "/wGG9v1Uci3sfrbjt0bRXkLrTqjY.jpg",
               "id": 17882,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Louise",
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e0fd",
               "name": "Emmanuelle Béart",
               "profile_path": "/dICNGDe2Sgz73Febl0TJZpEKO9f.jpg",
               "id": 4885,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Pierrette",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e101",
               "name": "Fanny Ardant",
               "profile_path": "/ealXbfCd6oCubRDA3PMgKlq6xq.jpg",
               "id": 20234,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Suzon",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e105",
               "name": "Virginie Ledoyen",
               "profile_path": "/t9TdJUerLsUD766Q2dN9tJ4dRCG.jpg",
               "id": 19163,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Catherine",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e109",
               "name": "Ludivine Sagnier",
               "profile_path": "/r9D7cZXUSpOOkXfDj4MpT91x3MR.jpg",
               "id": 4390,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Madame Chanel",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e10d",
               "name": "Firmine Richard",
               "profile_path": "/jZKEoz2jeShGAEv6g9Sgt2t7REO.jpg",
               "id": 20235,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mamy",
               "gender": 1,
               "credit_id": "52fe4326c3a36847f803e117",
               "name": "Danielle Darrieux",
               "profile_path": "/4o6Wjfx4ahEr1ldLLZ0aEF3OTkP.jpg",
               "id": 236016,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Marcel, the husband",
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e11b",
               "name": "Dominique Lamure",
               "profile_path": "/mHn8SBkUWI3a7qaeYlO13ciij5Y.jpg",
               "id": 1178313,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e0eb",
               "name": "François Ozon",
               "profile_path": "/zcrMs8YX5f89Ax2mEDCtaLvwKiE.jpg",
               "id": 4387,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4326c3a36847f803e0f1",
               "name": "François Ozon",
               "profile_path": "/zcrMs8YX5f89Ax2mEDCtaLvwKiE.jpg",
               "id": 4387,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4326c3a36847f803e113",
               "name": "Robert Thomas",
               "profile_path": null,
               "id": 20236,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 6.61206,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 1958,
      "vote_count": 274,
      "budget": 8000000,
      "overview": "Eight women gather to celebrate Christmas in a snowbound cottage, only to find the family patriarch dead with a knife in his back. Trapped in the house, every woman becomes a suspect, each having her own motive and secret.",
      "similar": [
         9479,
         634,
         10147,
         772,
         338964,
         10437,
         1581,
         1585,
         11631,
         8871,
         5255,
         10719,
         10674,
         9714,
         51052,
         302,
         17979,
         11395,
         9279,
         10510
      ],
      "original_title": "8 femmes",
      "runtime": 111,
      "poster_path": "/38J3LBZT6e9xY5h043p4LhswSTk.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Fidélité Productions",
            "id": 147,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Le Studio Canal+",
            "id": 183,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Gimages 5",
            "id": 818,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mars Films",
            "id": 819,
            "origin_country": ""
         }
      ],
      "release_date": "2002-01-08",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Living in a house full of women can be murder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["François Ozon"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "François Ozon",
         "Robert Thomas"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0283832/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTI1MjE1NzY3NF5BMl5BanBnXkFtZTcwMzA4OTUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Fanny Ardant, Emmanuelle Béart, Danielle Darrieux | See full cast and crew »"],
      "reviews": [
         "'8 Women' is a rather unique film. On the surface it is the probably only entry in the genre of the grotesque whodunit-musical. But actually, it's a huge playground - for the actresses who get the chance to play with the stereotypes attached to them, and for director François Ozon to toy with the clichés of the whodunit. Here's the setup: 1950s. A beautiful mansion. A man is found lying in his bed with a knife in his back. The possible suspects: His wife, his two daughters, his sister, his mother-in-law, his sister-in-law, the chambermaid and the cook. As these eight women can't leave the estate or call the police, they try to find the murderer themselves. We know this situation from countless Agatha Christie-stories. But what Ozon makes of this situation is just incredible. It already begins with the casting: Who else could play the gentrified Gaby if not Catherine Deneuve? Is there any actress who would fit more perfectly for the role of the spinsterish sister than Isabelle Huppert? Who else would you want to walk around in that dress of a chambermaid than the most desirable Emmanuelle Béart? The actresses are eagerly playing with the stereotypes that surround them because of both, the roles they played and their private lives. Then there's the story: All whodunits have those obligatory scenes where the motives of all characters are revealed. '8 Women' takes that formula and deliberately goes over the top with it, it's characters are unfaithful, pregnant, lesbian, poisoners and many things more. And as a final twist, the film stops eight times to give each of its protagonists a chance to reveal her true character in a scene entirely devoted to them - singing and dancing. There is also another scene worth mentioning that is entirely dedicated to the actresses: A scene with a lot of dialog that entirely consists of nothing but a series of closeups - and that for about three minutes. Cinephiles can enjoy this film on even another level: The film is filled with references to beloved classics. Consider Fanny Ardant's musical number, which pays homage to Rita Hayworth's glove-strip in 'Gilda', and another Rita Hayworth-moment so wonderful I won't reveal it here. Consider Emmanuelle Béarts hairstyle that echoes Kim Novak in 'Vertigo'. Consider the fact that the late husband of the Dannielle Darrieux character was a general, reminding us of 'Madame de...'. Or consider the painting of the young Catherine Deneuve hanging in one room - a replica of a 'Belle de jour'-poster. All this is supported by the rich, colorful cinematography, the art direction and the costumes, that give the entire film a 1950s look. But attention: If you give this film a chance, don't expect it to be logically consistent. It isn't. But that doesn't matter at all. The murder mystery story is replaceable. The film is entirely devoted to its brilliant actresses and the wonderful, bitchy dialog they exchange. It's great fun and it is getting better with every viewing.",
         "1st watched 1/23/2005 - 9 out of 10(Dir-Francois Ozone): Well crafted drama/mystery/musical that is so full it's hard to critique into a summary. The basic plot is that 8 related women find themselves in the same place at approximately the same time when the lone man is presumed to be murdered, who happens to be the grandfather, father, husband, bearer of child, lover etc\u0085 of the women(not necessarily in that order). You talk about complexity of plot? Every time someone opens their mouth another twist is thrown into the mix. I think it would take at least another viewing to understand everyone's relationship with everyone else by the end of the movie. And besides this, musical numbers are thrown in to help us understand the characters that are sung by themselves and sometimes backed up by the rest of the cast(ala Bollywood). One thing I have always noticed about French movies is that they come across as a confused people but they're OK with that, instead of the American's who believe that \"they\" have the answers to everything. This makes it slightly un-comfortable for us pompous Americans to view movies like this where every \"real\" thing in life is kind of taken with a little tongue-in-cheek mentality but this is the reality of their people and it's present often in their movies. Good for them!! This is so evident in this movie where because of it's mystery plot, we think that who did the killing is what's important, but what we find out is that there is much more behind the so-called answer we're seeking which makes for a very complex experience. Thank you French cinema. Without it there would not be movies like this.",
         "In this time when it may be considered fashionable to bash the French (this is written on the eve of war - the USA against Iraq) I, for one, wish to open a bottle of the best French Champagne to toast this most marvelous film! Merci beaucoup, Monsieur Ozon! This movie is a treat on all levels - sure, it's not for everyone, but if you like musicals, and a plate full of gorgeous GREAT actresses to boot, then - have at it, and enjoy!",
         "In the simply uncategorizable French movie \"8 Women,\" successful businessman Marcel is found stabbed to death in his bed. Whodunit? Was it his wife (Catherine Deneuve) or his estranged sister (Fanny Ardant)? Or his mother-in-law (Danielle Darrieux) or his sister-in-law (Isabelle Huppert)? Or one of his daughters (Virginie Ledoyen, Ludivine Sagnier)? Or his longtime cook (Firmine Richard) or his new housemaid (Emmanuelle Béart)? The movie, however, is less concerned with the murderess's identity than with giving these 8 actresses the chance to show off, in a series of campy, funny, melodramatic scenes. To that effect, there are countless catty remarks and catfights. The revealing of progressively more outrageous family secrets. Lesbianism, twisted love triangles, chic couture wardrobes, transformations from ugly duckling to swan. And, last but not least, musical numbers. The action stops for each woman to dance and sing (usually in a breathy untrained voice) a pop song that reveals her character's emotional state. It's a bizarre mix, but you'll find yourself laughing through your incredulity. Faced with eight such talented actresses it feels rude to single out individual performers, but Huppert's portrayal of the embittered spinster Augustine steals the movie. Every one of her line readings is distinctive and hilarious, making this abrasive, histrionic character an absolute delight to watch. Almost as good is Ardant, playing a surprisingly likable free-spirited bad girl; because her character has no shame, she's at least honest when all the other women tell lies. The lesser-known Firmine Richard gets one of the best musical numbers with \"Pour ne pas vivre seul\" (\"So as not to live alone\"), and Sagnier, who was in her early twenties when she filmed the movie, very convincingly plays a bratty 16-year-old. All of the actresses' roles allow them to satirize their own or others' personas: Béart sends up the \"seductive French maid\" stereotype; Ledoyen is costumed to look like Audrey Hepburn but her character is no girlish innocent; Deneuve plays a variation on her customary chilly, glamorous bourgeois matron. Meanwhile, grande dame Darrieux cuts loose in the role of a meddling, lying grandma. \"8 Women\" is thus more than just a comedy-mystery-musical: it's a witty postmodern comment on movie genres, movie stars, and three generations of French divas. It has a healthy sense of its own absurdity (indeed, how can anyone take this Agatha-Christie-type mystery seriously anymore?) yet all of the actresses are fully committed to telling this ridiculous story. Certainly one of the strangest films I've ever seen, it also--unlike so many serious and earnest modern movies--reminds me of why I love the Technicolor screen and its great actresses in the first place.",
         "A movie launched in 2002, \"8 femmes\" was the establishing movie for François Ozon. Through his movies, from his medium-length film \"See the Sea\" (1997) to \"8 women\" (2002) to \"the criminal lovers\" (1999), he developed his own style based on surprise. In short, his aim is to surprise the spectator. With this movie, we can say that he reached his goal and it is probably his most accomplished movie. It is also a movie that confirms the originality of his cinema. First of all, \"8 women\" is a movie that surprises by its tone breaks. It means that Ozon passes from drama to comedy with great ease just like Jaco Van Dormael with \"Toto the Hero\" (1991). As for the songs, they are totally unexpected. Which other director would have included musical numbers in a detective movie? As for the influences of the movie, they are numerous. Of course, this film is an adaptation from a play that evokes the Agatha Christie universe but Ozon felt like scattering his movie with all kinds of allusions: Vincente Minelli, Douglas Sirk (the deer in the garden). These allusions are especially linked to French culture: the French TV program \"au théâtre ce soir\" but also Jacques Demy (the bright colors, the songs) and French cinema before the \"new wave\". More than allusions, they are tributes from a director who once said \"I don't care about new-wave\". François Ozon also plays with the spectator, a bit like Hergé with the Tintin album \"the Castafiore Emerald\". He holds him spellbound until the end of the film either by leading him on wrong tracks, either by giving him clues that seem to make the movie progress, and this until the final revelation that turns out to be unexpected and amazing. Besides, given the conclusion, Ozon's movie can be considered in its whole as a farce with absurd humor. The best example involves Danièle Darrieux. At the beginning of the movie, she seems to be disabled but then she stands up and walks without any difficulty for an important part of the movie! The movie is also powerful thanks to its dialogs. On this point, beware of the poster where these 8 women have a smiling countenance! These witty and sometimes ironical dialogs reveal these women's real personality that mainly rests on selfishness. Furthermore, the actresses have a spare time in the shoes of their respective character (Isabelle Huppert is particularly irresistible). Ozon also left high and dry several details that have, in the long run nothing important (and it is a compliment): we don't know at what time the movie takes place. Several points of the movie show it: the songs composed at different times. Then, certain elements of scenery and dialogs seem either dated either modern. In another extent, we never see the face of the sole man in the plot. In the end, \"8 women\" is an unrealistic, timeless and unique movie and surprise to see this movie meet commercial acclaim in France. François Ozon by imposing his style so peculiar remains more than ever a filmmaker to follow.",
         "Eight great actresses, one smart director, one look, and many surprising styles. Forget the plot, just enjoy beautiful audiovisual entertainment. ...with class. The songs were a surprise, and a pleasant one for that, they right away took the attitude of watching the film to a different dimension. To have fun, to see great and beautiful actresses and to just take things without being overly serious...8 Femmes is the ticket.",
         "Francois Ozon is a daring director who never leaves the audience indifferent... 8 Women can be seen as a mysoginist view of womanhood from the viewpoint of a gay director... However I for one saw this movie as great entertainment and excellent showpiece for France's leading screen divas. 8 Woman is a whodunnit not so far from Agatha Christie's 10 Petits Negres: 8 women each have enough reasons to kill the father, in-law, brother and master of the house. Of course I will not tell who killed the man and why, but it is not so important after all. Because 8 Women is first and foremost about womanhood: all facets of the woman exposed through the revelations, attitudes, manipulations of 8 different women: the girl, the blossoming young lady (Ledoyen), the femme fatale (fabulous Ardant), the femme repressed (hilarious Huppert), the bourgeoise (Deneuve), the old stepmother, the lesbian, the sexual and sexy maid (Beart). This film is all about the cast performance. All women have their sing-a-song moment very apropos and funny. All actors deliver stunningly, especially Ardant, Deneuve and Beart. It is very lighthearted despite the somber revelations: bright colours, golden 50's nostalgic atmosphere, nice pop tunes with fun choreography. It is great to see that French directors love their actresses whatever their age... Hollywood learn from this, we don't care much about Pamela Anderson or Jennifer Lopez-like babes... Honestly as a young French guy, the 50-something Fanny Ardant is the one who turned me on the most! Wholeheartedly, 9.5/10",
         "Beneath the plot, the acting and the singing, the movie is even more enjoyable with some references. (1) While combinations of actresses of that caliber are almost unheard of anywhere, the older actresses have intersected before - and mock their prior common roles. In particular, Darrieux played Deneuve's mother twice before; Darrieux' role as the mother in Demoiselles de Rochefort, Les (1967) parallels that played by Deneuve here. (2) The actresses each mock one of their own mannerisms and/or that of one of the other actresses. For instance, Ledoyen imitates the hand movements typical of Deneuve in the 1960s and 1970s. Look also for the pairs matched in the back-to-back dance near the end - more clues! (3) Each actress also imitates one famous star or style of American cinema of the era (that is, the 1940s-1960s). Most obviously, Béart imitates Jeanne Moreau in Journal d'une femme de chambre, Le (1964) and Ardant imitates Rita Hayworth (e.g., Gilda (1946)). (4) The linchpin between these actresses, via various directors, is Romy Schneider. The picture that Deneuve picks up from Béart's apron is Schneider's. Basically, you may enjoy the film (or not) on the first degree, but for better or for worse, it is full of references. The good news, for cinephiles, is that the references are a lot broader and a fair bit more subtle than the typical Hollywood-to-Hollywood, Cinecita-to-Cinecita or Hong Kong-to-Hong Kong navel gazing.",
         "Much like the lightweight tone that Alfred Hitchcock took with filming NORTH BY NORTHWEST after his very heavy-handed VERTIGO, Francois Ozon, a completely different film-maker who shot to international acclaim in 2000 with his introspective drama SOUS LE SABLE, decided to do a 180-degree turn and tackle a musical in the 1950's vein. 8 FEMMES begins with a montage of flowers seen up close and some very Mancini-like music in the opening credits announcing each and every one of the eight female leads, and recreates, inch by inch, a visual splendour that Douglas Sirk would have cheered. Fake snow, fake backdrops, a picturesque mansion, and the most harmless little deer this side of Bambi bring forth this atmosphere of shallow artifice, and this is only the beginning. Immediately he moves into the house and introduces the players, women who are a part of a household, who dominate the scene with their very presence. Each one of them dressed in bold, distinctive colors, with diametrically opposed tempers to match, all gathering for a night of intrigue and catfights over the state of affairs of the man whom they are all related to -- Marcel -- who has apparently been killed by a knife in the back. As the day progresses, it becomes increasingly clear that all of them, including frail old Mamy who it seems is not an invalid and can walk quite well and Pierrette, Marcel's sister who lives nearby and enters the film in with a truck load of secrets beneath her cool facade, has a motive to have killed Marcel. Agatha Christie's spirit channeled in a musical? You bet. And what a rollicking ride 8 FEMMES is! Garish and melodramatic, a product from the land of Technicolor, and boasting wacky performances that only get more complicated as things progress and layers of lies are peeled away. The cast is something concocted out of a fantasy of casting: there's Catherine Deneuve who plays Gaby, a catty snob, wife to Marcel and gets to utter a completely outrageous line to Isabelle Huppert who plays her sister Augustine: \"I am rich and beautiful, while you are ugly and poor.\" Danielle Darrieux, a grand dame of movies since the Forties, is a hoot as Mamy, and there is a hysterical scene where after a confession to Huppert's character goes horribly crazy, Deneuve whacks her on the head with a glass carafe (or bottle?). Virginie Ledoyen and Ludivine Sagnier play daughters to Deneuve who may not have the same father; Emmanuelle Beart is Louise, the quintessential exaggeration of a French maid complete with a kissable pout, Firmine Richard plays the house maid who has her own secrets and is a dead ringer to Louise Beavers in essence. Then there's the outstanding Fanny Ardant, a more smoldering, sensual incarnation of Katharine Hepburn (and looking just like Hepburn circa 1949 when she made ADAM'S RIB), who enters the movie at the right time to get things really complicated and who later on has one of the best moments on film: a catfight with none other than Deneuve herself. 8 FEMMES is an excessive movie made for film buffs who know about excess in the form of color, campy performances, and who love watching female icons getting bitchy with each other. All of the performances have their moments of high and low, but Huppert not only takes the cake -- she grabs it, runs for the nearest exit, and gobbles it whole in one gluttonous gulp and she acts like she knows it. Deneuve is quite acidic in her role -- it's been light years since she's been \"just the pretty ingénue\" from the days of THE UMBRELLAS OF CHERBOURG. Older, with sharper features, and yet still regal and cool with a \"what the hell\" attitude. But above all of them there is Ozon, someone I was not aware of until recently, and whose films I'm enjoying the more I see them, bringing this time capsule as if he himself were impersonating Vincent Minnelli or Robert Wise himself. A perfect ooh-la-la of a movie.",
         "8 Femmes is a playful mystery/musical/dark comedy that hearkens back to Jacques Demy's Parapluies de Cherbourg, which also starred Catherine Deneuve, and Demoiselles de Rochefort, in which Danielle Darrieux and Deneuve played mother and daughter. The story stars off as a classic tale of murder in a closed room of an isolated mansion, and all of the eight women become suspects. As the various clues and revealed secrets begin to pile up and become more and more absurd, however, it becomes clear that the mystery is secondary to exploring the various kinds of relationships that exist between these women and the way they have all been affected by their relationships (or lack of relationships) with men, especially the man who has been killed. The mystery is also secondary to having a good time, which everyone seems to be doing. One of the main strengths of the movie is that it doesn't take itself too seriously. The director and all of the actresses seem to be enjoying themselves so much that a sense of fun radiates throughout the film. Ozon uses laughter and black humor, however, to investigates the pain, rivalry and joy that arise between mothers and daughters, pairs of sisters, sisters-in-law, women servants and their mistresses, and women in love with other women. It's a grand buffet of fine acting and difficult to pick out the best of the bunch - all eight women are wonderful - but Isabelle Huppert steals a number of scenes (hard to do in that company) with the most over the top and unexpected performance. Each woman has great moments, however, sometimes of tenderness, sometimes of hilarious bitchiness, and once in a while, of sudden and intense emotional revelation. The songs that each one sings give a bit of insight to their characters and add to the overall fun of the film, but they also present dramatic challenges to the actresses, and all of them do well in making these musical numbers work. It's great to see Darrieux again, and she does an excellent job as the matriarch of the clan who seems to be a frail and loving old grandmother at first but then pulls one surprise after another. The funniest bit in the film, a wicked moment of black comedy, involves an argument between her and daughter Gaby (Deneuve) that ends in shocking and unladylike violence. The song chosen for Darrieux to sing at the end, a haunting and poignant piece written by French poet Louis Aragon and the great singer-songwriter Geogre Brassens, pulls the film together emotionally in an unexpected way. People expecting a straight mystery film may be disappointed in and confused by the film, and the American distributors haven't helped matters any by failing to mention on the back of the video box that 8 Femmes is a musical and a dark comedy as well. But for those viewers who have an open mind and are in the mood for a playful mystery with several great actresses, they should be greatly rewarded."
      ],
      "genres": [
         "Musical",
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "BIM",
         "Canal+",
         "Centre National de la Cinématographie (CNC)"
      ],
      "summaries": [
         "One morning at an isolated mansion in the snowy countryside of 1950s France, a family is gathered for the holiday season. But there will be no celebration at all because their beloved patriarch has been murdered! The killer can only be one of the eight women closest to the man of the house. Was it his powerful wife? His spinster sister-in-law? His miserly mother-in-law? Maybe the insolent chambermaid or the loyal housekeeper? Could it possibly have been one of his two young daughters? A surprise visit from the victim's chic sister sends the household into a tizzy, encouraging hysterics, exacerbating rivalries, and encompassing musical interludes. Comedic situations arise with the revelations of dark family secrets. Seduction dances with betrayal. The mystery of the female psyche is revealed. There are eight women and each is a suspect. Each has a motive. Each has a secret. Beautiful, tempestuous, intelligent, sensual, and dangerous...one of them is guilty. Which one is it?",
         "In a home in the snowy French countryside, an industrialist has been murdered. There are eight suspects, all women: his wife, Gaby; their two daughters, Suzon and Catherine; Gaby's neurotic sister, Augustine, and greedy mother; the industrialist's floozy sister, Pierrette; the cook, Chanel, and the new maid, Louise. The phone is dead, the car has been damaged, and the house is isolated because of a snowstorm. So it's up to these eight women to discover who among them is the murder, as well as uncover various hidden secrets from each other that include greed, jealousy, pregnancies, adultery, theft, hidden love, and, perhaps even, murder.",
         "One morning the industrialist Marcel is found stabbed in his room. Eight women are his potential murderers: His wife Gaby, his daughters Suzon and Catherine, his mother-in-law Mamy, his sister-in-law Augustine, his sister Pierette, the cook Chanel and the maid Louise. The house is isolated in a snowstorm, the phone is dead and one of them has to be the culprit. Mutual suspicions reveal the various secrets in their lives.",
         "One murdered man, eight women, each seeming to be more eager than the others to know the truth. Gimme, gimme, gimme some clues to make up my mind. And eventually enter the truth. Oh, thou cruel woman!"
      ],
      "budget": 8000000
   },
   "movielensId": 5613,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2002-01-08",
      "dvdReleaseDate": "2003-02-11",
      "directors": ["François Ozon"],
      "runtime": 111,
      "movieId": 5613,
      "title": "8 Women",
      "mpaa": "R",
      "actors": [
         "Catherine Deneuve",
         "Isabelle Huppert",
         "Emmanuelle Béart",
         "Fanny Ardant",
         "Virginie Ledoyen",
         "Ludivine Sagnier",
         "Firmine Richard",
         "Danielle Darrieux",
         "Dominique Lamure"
      ],
      "imdbMovieId": "0283832",
      "originalTitle": "8 femmes",
      "genres": [
         "Comedy",
         "Thriller",
         "Music",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["Fv8_fsEq_j0"],
      "plotSummary": "Eight women gather to celebrate Christmas in a snowbound cottage, only to find the family patriarch dead with a knife in his back. Trapped in the house, every woman becomes a suspect, each having her own motive and secret.",
      "tmdbMovieId": 1958,
      "avgRating": 3.43598,
      "releaseYear": "2002",
      "numRatings": 984,
      "posterPath": "/38J3LBZT6e9xY5h043p4LhswSTk.jpg"
   }
}