{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "free from execution",
            "id": 12659
         },
         {
            "name": "blind people",
            "id": 12660
         },
         {
            "name": "beeper ball",
            "id": 12661
         },
         {
            "name": "wrongful imprisonment",
            "id": 12662
         },
         {
            "name": "little girl",
            "id": 12663
         },
         {
            "name": "delayed execution",
            "id": 12664
         }
      ],
      "imdb_id": "tt0396190",
      "video": false,
      "title": "Return to Sender",
      "recommendations": [
         128842,
         73897,
         32248,
         42380,
         206,
         74718,
         32229,
         37850,
         32150,
         10109,
         32162,
         58679,
         285844,
         97110,
         21522,
         253775,
         35851,
         18638,
         5844,
         32151
      ],
      "backdrop_path": "/eGh5cK0SMdSOPrUJYNkSVwNYmnk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Charlotte Cory",
               "gender": 1,
               "credit_id": "52fe44c9c3a368484e036c95",
               "name": "Connie Nielsen",
               "profile_path": "/lvQypTfeH2Gn2PTbzq6XkT2PLmn.jpg",
               "id": 935,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Frank Nitzche",
               "gender": 2,
               "credit_id": "52fe44c9c3a368484e036c99",
               "name": "Aidan Quinn",
               "profile_path": "/fOiuJIBJUdiuqjQtGkffpSbRQ49.jpg",
               "id": 18992,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Susan Kennan",
               "gender": 1,
               "credit_id": "52fe44c9c3a368484e036c9d",
               "name": "Kelly Preston",
               "profile_path": "/kxTQVsfZkI3DdzBqutw4zZapRB.jpg",
               "id": 11164,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Martin North",
               "gender": 2,
               "credit_id": "52fe44c9c3a368484e036ca1",
               "name": "Tim Daly",
               "profile_path": "/eLBlqpzOv1F9oPcWSU76yiuXneU.jpg",
               "id": 68122,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Mark Schlesser",
               "gender": 2,
               "credit_id": "52fe44c9c3a368484e036ca5",
               "name": "Mark Ryan",
               "profile_path": "/mBvV09ssRRE63gNaG3ZkqaZidPh.jpg",
               "id": 19541,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Joe Charbonic",
               "gender": 2,
               "credit_id": "52fe44c9c3a368484e036ca9",
               "name": "Mark Holton",
               "profile_path": "/vQJ3iEDVhVOJX7biIbIG5R6QByq.jpg",
               "id": 44818,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Stella / Julie",
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036cad",
               "name": "Sara-Marie Maltha",
               "profile_path": null,
               "id": 121561,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Joe Hammond",
               "gender": 2,
               "credit_id": "52fe44c9c3a368484e036cb1",
               "name": "Randy Colton",
               "profile_path": null,
               "id": 121562,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mary Hammond",
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036cb5",
               "name": "Robin Brooks Sullivan",
               "profile_path": null,
               "id": 121563,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Kirstie",
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036cb9",
               "name": "Madison Mueller",
               "profile_path": null,
               "id": 121564,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c9c3a368484e036c85",
               "name": "Bille August",
               "profile_path": "/dDZuzYzmX8si2EeRXztsUkEHyTR.jpg",
               "id": 19684,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036c8b",
               "name": "Neal Purvis",
               "profile_path": "/eossmqcHU9EeV28foEiYLOpxjST.jpg",
               "id": 10782,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c9c3a368484e036c91",
               "name": "Robert Wade",
               "profile_path": "/txwb1hbBMiNuvJA8LvcvsjiIML8.jpg",
               "id": 10783,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.136304,
      "production_countries": [
         {
            "iso_3166_1": "DK",
            "name": "Denmark"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 25460,
      "vote_count": 15,
      "budget": 7800000,
      "overview": "While fighting for a woman who sits on death row, a lawyer happens upon new information which brings into question the motives of a man associated with her client",
      "similar": [
         22705,
         2149,
         11826,
         979,
         4771,
         80752,
         339692,
         445954,
         9946,
         1645,
         17494,
         9093,
         1433,
         4995,
         6075,
         2502,
         634,
         59,
         205,
         627
      ],
      "original_title": "Return to Sender",
      "runtime": 109,
      "poster_path": "/ohau02T7JZeYFiW9gLHE9UmaG71.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Audley Films LLP",
            "id": 5729,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Moviefan Scandinavia A/S",
            "id": 34337,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Number 9 Films",
            "id": 34338,
            "origin_country": ""
         }
      ],
      "release_date": "2004-09-17",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "How can you save someone, who won't save herself?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Denmark",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bille August"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Neal Purvis",
         "Robert Wade"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0396190/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NTY0ODc2NV5BMl5BanBnXkFtZTcwOTQ2ODgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Connie Nielsen, Aidan Quinn, Kelly Preston | See full cast and crew »"],
      "reviews": [
         "Charlotte Cory (Connie Nielsen) is on death row for the kidnapping and murder of a child - but did she do it? Aidan Quinn plays an ex-defense lawyer who makes money selling the last letters of condemned prisoners to the highest bidder (apparently, such letters fetch tens of thousands of dollars). Because Cory's case is so rare, he sees the chance to make half a million dollars on her last letter. He pretends to be a friend of her father's in order to get close to her, but he ends up becoming emotionally engaged in her situation, and falling in love with her. Return To Sender is a low-key character drama, extremely well-acted, realistic, touching and just generally well-rounded. I was absorbed by it throughout, and can't think of a single thing wrong with it. It keeps the suspense going right until the satisfying end. A great achievement by everyone involved.",
         "I'm just writing to alert and remind everybody what really can be done with a \"low budget\" and independent movie like I think this one is. I love this movie, it's story, the characters, the performances of the actors. It's all great. It has a fantastic ending and I recommend everyone to see this movie. I really think that this type of picture should have more support for being done. It's the \"simple\" stories like this one that demonstrate the true beauty of the cinema and not the blockbusters that the main industry continues to support. I'm not saying that those shouldn't be done, because their fun. I just think that sometimes and more often, they should support the so called low budget movies so that great, fantastic, human, and simple stories like what this movie represents could come out and be seen by all the people. The fact is that with the low advertisement that is made to this type of movies, at least in my country (I presume that in the States it shouldn't be much more), only the true cinema \"buffs\" get the chance to find out about them and see them, and not the common person, as it should be from the start. If you really love cinema, don't forget to see this movie, because it's one of those few movies that ends and makes you keep remind about them, the plot, the simultaneous complexity and simplicity of the characters, and everything else for a long time.",
         "Listed on IMDb under the primary title of Return to Sender (2004) by pretty much unknown to me Danish director, Bille August (except for The Adventures of Young Indiana Jones), is about a woman on death row who is going to let herself be executed in order to protect some one else. Excellent performances by Danish stunner, Connie Nielson (the reason I rented the movie) who never looked better than here in understated prison makeup, and Aidan Quinn (as a letters from death row inmates bounty hunter) in a tight script that starts off like it's going to be an evils of capital punishment vehicle, but turns into something else, which I can only call the value of truth without giving too much away. It was only released in the US on DVD last November, but set here and filmed here and in Denmark. There aren't any external reviews in English, and only one review on IMDb that panned it. I'd have gone to see this in the theater. 7+/10.",
         "A powerful performance by Connie Nielsen, well supported by Aidan Quinn and Kelly Preston. The plot holes don't really matter here, it's the psyche of Charlotte Cory, as revealed by Nielson, that draws one through this film. Like Quinn's character Frank, one needs to learn why this beautiful person will passively accept execution by the state rather than defend her innocence. Self-condemned, because she miserably failed her sister Stella years before, Charlotte seems to believe she can atone for her sins in a twisted kind of sacrifice. Neilsen reveals with her face and eyes the inner beauty of her character, the sadness on learning the (false?) circumstances of her father's death, the meaningfulness of her relationship with Frank, the love of her sister, the hope of a new life. Aidan Quinn provides a solid, believable Frank, the shyster turning hero, resonating with Nielsen throughout. The overwhelming impression of this film is its realism, in character portrayal, settings, musical score, it seems authentic, even when viewed through the lens of a security camera. In contrast, the fantasy sequences are whimsical and far out. The solution of the mystery is satisfying, leading to a good ending.",
         "Aidan Quinn leads a stellar cast in CONVICTED, the gripping tale of a lawyer/writer who uncovers new information regarding a woman convicted of kidnaping and killing an infant. Connie Nielson plays the convicted woman due to be executed within days, and Kelly Preston is her new attorney. Quinn becomes convinced the woman did not kill the child, and in fact no body was ever found and there is very little evidence to tie the woman to the kidnaping itself. It's a race to the finish as the clock ticks down on her execution date. The plot is nothing new, but CONVICTED plays out like a first-rate murder mystery, with lots of twists and turns -- and a truly unexpected and unforeseen ending. Tim Daly of WINGS plays a pivotal role as the convicted woman's brother-in-law, and he and Quinn, Nielson and Preston are all at the top of their game. Nielson is particularly convincing as the deeply troubled and fatalistic convict. CONVICTED plays out like a good novel, the highest compliment I can give any movie.",
         "Even though the ending was kind of deus ex machina, since anybody could have been brought forward to clear Connie Nielsen, it wasn't obvious, and there was enough tension to think that she might in fact be killed at the end. Connie did a very good job as a hardened person, and a person who had spent a great number of nights on drugs and alcohol. Aidan Quinn was good as the originally uncaring journalist who came to fall in love with her. Kelly Preston did a professional acting job, but she doesn't have any emotional depth to her. The lighting was good. The scenes were properly paced. The interaction between Connie/Aidan gave the story its emotional weight. The stupid cop wasn't necessary, and didn't provide any real relief of tension.",
         "There are many stories concerning the unlucky people arrested, Incarcerated, Convicted and often executed for crimes against the state. But what if it's an innocent woman awaiting death? In this movie directed by Bille August and written by Neal Purvis was originally called \" Convicted \", but changed to \" Return to Sender \" stars Connie Neilsen as Charlotte Cory, a former nurse, who's being prepared for execution, while reaching out to Frank Nitzche (Aidan Quinn) a man who claims to be a former friend of her father. Unknown to Cory, Frank is not who he claims to be and that secret is discovered by Susan Kennan (Kelly Preston) her attorney. However the discovery is made simultaneously with Nitzche who learns that Cory is protecting someone else. It's a race against time as both of them try to halt the execution before they bring the new evidence to the governor. Although slow to build and the subject matter is difficult to comprehend, the film nevertheless does produce a dramatic atmosphere which lends itself to an escalating climax. Quinn is incredible as the despicable former lawyer, now trying to help uncover the truth. Nielsen demonstrates a wonderful transition from ambivalent nurse to desperate victim who realizes she does care to live. ****",
         "\"Return To Sender\" aka \"Convicted\" is a first-rate drama. The plot is: Charlotte Cory (Connie Nielsen) is on death row. There's only a week until her execution. Her lawyer (Kelly Preston) is running out of options to save her. Then Frank Nitzche (Aidan Quinn) comes into the picture. He wants to prove Charlotte's innocence, but he has a lustful attraction for her that's derailing the investigation. Can Charlotte be saved? The main problem with the movie is that it feels forced to go clichéd. I say that because the mystery aspect of the film doesn't work. It overcomes that because of the acting and directing. The whole cast is great. Aidan Quinn stands out. Connie Nielsen and Kelly Preston do a fine job. There was no reason for this movie to go direct-to-video. It should've had a shot in the theaters. In the end: Watch for the actors and get annoyed that studios dump hidden gems into the video market. For more insanity, please visit: comeuppancereviews.com",
         "I agree with most of what's been said about this film, both negative and positive. Yes, there are holes, unexplained and unsupported events and motivations and frankly, the ending sucks! I mean really, after being on death row, hours from execution, and when she's finally released nobody is there to greet her and she has to take the bus to her dilapidated house where again, nobody's there. I know the news media has a short attention span but you'd think after all the hoopla some reporter would want her story. At least her lawyer would have been there or the man who proved her innocence and who eventually does meet her at her house. But enough of that. This film is worth seeing for one reason only: Connie Nielsen. I've seen her in three others, Mission to Mars, Gladiator, and One Hour Photo, and although she's good in these, here she's captivating. Essentially she carries the whole film and certainly deserves to be the headliner. The performances of Aidan Quinn and Kelly Preston were predictable but hers was captivating. That's what makes this movie worth watching and that's good because after all it centers on her character. If it hadn't been for the plot issues I would have given it a higher rating. And I should add that it left me with a sense of satisfaction, as if I had watched something worthwhile, something that will stay with me, something that made me think. Nielsen deserves much of the credit for that.",
         "**SPOILERS** Underground tabloid reporter Frank Nitzche, Aidan Quinn, has been working on the Kirstie Hammond murder/kidnap case for over a year corresponding with the person convicted of that heinous crime death row inmate Charlotte Cory, Connie Nielsen. With her execution scheduled in ten days Frank is requested to be the last person besides her lawyer Susan Kennan, Kelly Preston, to be granted an interview by Charlotte. Very impressed with his letters Charlotte feels that Frank will understand what happened that evening some eight years ago. It was then on Thanksgiving Eve when one year-old Kirstie Hammond was kidnapped and eventually murdered. As Frank hears Charlotte out he becomes very disturbed in what he's doing in trying to trick her into spilling her heart out just to get the exclusive story in the biggest kidnap case since the Baby Lindbergh kidnapping back in 1932. The case of Hall of Fame L.A Dodger baseball player Joe Hammond, Randy Calton, infant daughter's kidnapping and murder. Frank, in talking with her, soon realizes that Charlotte is holding something back that may exonerate her of the crime and that has to do with her sister Stella, Sara-Marie Maltha. Stella who had completely disappeared from sight since Charlotte's arrest may be the key to why Charlotte's so meek, even eager, to meet her fate in the Oklahoma's McAllister State Prison's execution chamber! Is Charlotte somehow covering up Stella's involvement in the crime? Slow in getting to the meat of the story the movie \"Convicted\" has sensation reporter and former defense attorney Frank Nitzche stick his neck out, and almost getting it broken, in not getting the big story by getting Charlotte to confess her crime to him but uncovering the real reasons behind it. Reasons that Charlotte had kept hidden from the police and the Hammond Family that are so shocking that if brought out would not only exonerate her but reveal just where the kidnapped and missing Kirstie final resting place really is! The film goes into a race against time scenario with Frank now not caring about the big story, worth as much as $800,000.00 to his publishers, but trying to find Charlotte's missing sister Stella. Stella who's been blind since surviving a car accident that she holds Charlotte responsible for is eventually tracked down by Frank at the Oklahoma School for the Blind where shes'a a teacher using the name Julie Smith. ***SPOILER ALERT**** It's in his talking to Stella and later seeing a number of home video tapes, that Charlotte left to him, that Frank slowly puts all the pieces together in what really happened to Kirstie Hammond. The pressing problem that Frank is now facing in saving Charlott's life is two fold. Will he be able to get Stella to reveal the truth behind Kirstie's kidnapping! And even more disturbing can Frank get Charlotte to stop trying to be a martyr in taking the truth with her about Stella's, and what turned out to be her boyfriend, involvement in the crime to her grave!"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Audley Films LLP",
         "Moviefan Scandinavia A/S",
         "Number 9 Films"
      ],
      "summaries": [
         "Charlotte Cory is a young woman convict on Death Row who has built up a friendship with Frank Nitzche through mail correspondence, whilst her attorney desperately tries to appeal the verdict before Charlotte's time runs out. With only days to spare Frank realizes that he has fallen in love with Charlotte and discovers that there is much more to the tragic circumstances of her imprisonment than he first thought - her life is now in his hands. Frank races to solve the puzzle that will reveal the truth, and tell the secrets that both he and Charlotte have been concealing, before it's too late.",
         "While fighting for a woman who sits on death row, a lawyer happens upon new information which brings into question the motives of a man associated with her client."
      ],
      "budget": 7600000
   },
   "movielensId": 56485,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-09-17",
      "dvdReleaseDate": "2005-11-01",
      "directors": ["Bille August"],
      "runtime": 109,
      "movieId": 56485,
      "title": "Return to Sender",
      "mpaa": "R",
      "actors": [
         "Connie Nielsen",
         "Aidan Quinn",
         "Kelly Preston",
         "Tim Daly",
         "Mark Ryan",
         "Mark Holton",
         "Sara-Marie Maltha",
         "Randy Colton",
         "Robin Brooks Sullivan",
         "Madison Mueller"
      ],
      "imdbMovieId": "0396190",
      "originalTitle": "Return to Sender",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "While fighting for a woman who sits on death row, a lawyer happens upon new information which brings into question the motives of a man associated with her client",
      "tmdbMovieId": 25460,
      "avgRating": 3.11364,
      "releaseYear": "2004",
      "numRatings": 22,
      "posterPath": "/ohau02T7JZeYFiW9gLHE9UmaG71.jpg"
   }
}