{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0830968",
      "video": false,
      "title": "Suicide Killers",
      "recommendations": [],
      "backdrop_path": "/8TYnmhmyMrmGbnpMxM8fO0nkLlb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "French-Iranian Author",
               "gender": 0,
               "credit_id": "52fe459c9251416c910386d9",
               "name": "Chadhoorth Djawann",
               "profile_path": null,
               "id": 574098,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Psychologist",
               "gender": 0,
               "credit_id": "52fe459c9251416c910386dd",
               "name": "Jacinto Dumbal",
               "profile_path": null,
               "id": 574099,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Director of Anti-Terror, UN",
               "gender": 0,
               "credit_id": "52fe459c9251416c910386e1",
               "name": "Judge Dumbroso",
               "profile_path": null,
               "id": 574100,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Founder of the Institute for Counter-Terrorism",
               "gender": 0,
               "credit_id": "52fe459c9251416c910386e5",
               "name": "Boaz Ganor",
               "profile_path": null,
               "id": 574101,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe459c9251416c910386d5",
            "name": "Pierre Rehov",
            "profile_path": null,
            "id": 431682,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.039204,
      "production_countries": [],
      "id": 35237,
      "vote_count": 1,
      "budget": 0,
      "overview": "A documentary that examines the psychopathology behind suicide bombers - which ultimately reveals what makes them tick!",
      "similar": [
         3134,
         298312,
         8810,
         281,
         948,
         11564,
         133805,
         2142,
         12162,
         1359,
         4771,
         431,
         8923,
         10285,
         23483,
         101,
         205,
         141,
         562,
         261023
      ],
      "original_title": "Suicide Killers",
      "runtime": 80,
      "poster_path": "/qIziJCUdV52RWip0y7Zb9ad8vpi.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2006-08-27",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.suicidekillers.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pierre Rehov"],
      "runtime": 80,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0830968/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzNjYwOTg3Ml5BMl5BanBnXkFtZTcwNDIzMDQ0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Chadhoorth Djawann, Jacinto Dumbal, Judge Dumbroso | See full cast and crew »"],
      "reviews": [
         "Firstly, every person who watches this film will have a bias towards one viewpoint or the other. Our job as viewers with this type of material is to be aware of our bias, as well as the bias of the authors of the work. I think that on the whole this is a reasonably balanced work, that points towards some of the factors that cause young men and women to throw their lives away. Not many people will \"enjoy\" watching this film, but perhaps the best attribute that it has is that it makes people think. That said, one of the more important parts of the dichotomy of the Israel/Palestinian problem that wasn't examined in any detail was the difference between the cultures and the effect that this has on the people living in either culture (though there was a small scene towards the end of the documentary with the youths dancing on the beach). I applaud the coverage of material that isn't normally presented to American audiences, particularly the voices of would-be suicide killers. Nothing presented would make me believe that what suicide killers do is the right thing, but it does present us with an insight into their thinking, and may go towards answering the question of: \"Why do they hate us so much?\" One of the descriptions of Paradise did indeed sound like life in the US! Secondly, and I think fairly importantly, with any film that has subtitles, it is important that those subtitles are accurate and show what people are saying. I speak fluent English, Spanish, French, Italian and Arabic (surprisingly all these languages were present in this documentary), and was able to spot various inaccuracies through omission that were present in the subtitles for these languages. With regards to the translation of the Arabic language (probably the most emotive parts of the film), I thought on the whole even though the subtitles don't translate all the spoken words, they are generally neutral without producing a bias through translation. In such a sensitive topic, I would have opted for more complete translation of foreign languages, but do you want your viewers to read most of the film? One of the faults of the translation that irked me was that in two cases \"Muslim\" in French was translated to \"Arab\", which is quite inaccurate. (Not all Arabs are Muslim!) I don't speak Hebrew, and can't comment on how accurate the translation was. Perhaps someone could comment on this. On the whole, I would say this was a good film. I gave 7/10 because of the problems with the translation, and a lack of coverage of the problem from the Jewish side. It doesn't change my thinking on the subject, but certainly does clarify the thinking of some of these suicide killers.",
         "The interviews during this movie were very interesting, and a clear picture emerged of blind subservience to text taken out of context. The relationship between repressed sexuality and suicide bombing, aggression and weapons was interesting, though not persuasive. Unfortunately I did not finish watching this movie with a \"new\" understanding of suicide bombers. Interviews did not elicit unique information and the academics were unable to provide evidence based theories of suicide bombing (using psychoanalytic theory in a documentary about suicide bombers is very questionable I think). Therefore, I recommend watching The Power of Nightmares and Jesus Camp with Suicide Killers, as these two documentaries put Suicide Killers into context. There was also a documentary about the London suicide bombings which was very good, I think its called July 7th Bombings, but I can't find it on the net.",
         "This movie claims to get at the root of terrorism. But it's crap, u get no understanding of what makes these people sacrifice their lives. If the movie was really honest, it'd explain Israel is the cause of most of the terrorism, only when Israel does it, it's OK. Israel has ruined the Gaza strip with its blockade, its ruined West Bank with settlements, ruined much of Arab land by building walls thru houses, the list goes on. According to this movie, Arabs woke up one day and decided to hate Israel...As Benny Morris writes, the Jews took Arab land in 40s,via violence. The Arabs didn't wake up one day and decide to hand their land over. Nothing justifies terrorism, and the suicide killers in jail belong in jail. i just wish the movie'd been more balanced...Try out that documentary on Norman Finklestien to see what's up in middle east...",
         "Moving, well documented, extremely powerful, this film should have been nominated for the Oscars. Finally, someone dares presenting terrorists the way they really are. Finally we can understand what lays behind all the pro-Arab propaganda. Finally someone gives a different slant to the middle east conflict and shows Palestinians as they really are : a People manipulated and trying to manipulate the world in order to reach their religious goal - namely the destruction of Israel. The most interesting thing is that we can read comments on this film from people who are offended because it is not presenting a politically correct point of view. Presenting Palestinians as everything but victims of Israel has became a taboo. Not in \" Suicide Killers \" though...",
         "These days I expect a documentary to be precise in the subject it pretends to approach and mostly, not boring. \"Suicide Killers\" has a good theme. Terrorism by suicide bombers is a \"trend\" this days and everyone seems to be expecting the next news flash about it. A first person view of the whole psychological side of this type of warfare, the motivations for such acts has to exist. Both politics and religion are the two subjects used in the process of explaining to the viewer what makes a suicide bomber tick. Being a martyr seems to be a good thing and every family accepts very well that they're offspring kills other people in the name of Allah becoming some kind of hero who goes to heaven. Mostly the reasons for such acts are based in matters which western society takes for granted such as the right to have sex (without offending Allah) or marry someone. Normal things that Islam society denies so many times and so many people need. People who live in poverty and among war conflicts that never seem to cease. No hope, nothing to really live for but something to die for as it seems... An oppression based on some old premises written long time ago and defy all logic. Anyway. Overall it's always nice to learn something about the subject but it lacks something. It lacks \"in your face\" graphic content for example. In my opinion this kind of documentary has to really make a point about something as bad as this. I liked the fact that most people interviewed are actually candidates to martyr status which delivers a good dosage of realism and veridical content but in the end I could have felt more the drama of the whole situation. We get to see some blood and few guts but really wanted to feel bad about it all and I can't say I did. 6/10",
         "(@ Comments made by the above people) now come on guys lets make this a little bit balanced, i mean how comes all your views on this film and other issues seems to be the same. i am a Christian but its kinda rough what the Jews are doing to the Muslims don't you think i mean instead of watching fox news open your eyes once in a while, its clear that this film is from one Narrative perspective. I mean for god sakes why make a film about understanding why suicide bombers do take up arms, when its clearly a one sided story. We as the viewers want to hear everything (truth). Everyone knows why suicide bombers do the things they do, is because anger and vengeance. Solution to these types of problems are to leave these people along stop messing with their countries let them be. See how many attacks are recorded than.",
         "It's the kind of thing the internet was made for. This would never get seen other wise. from an Israeli point of view ,but quite balanced. Obviously there will be people who are so blind that they will twist the truth ,but it is so powerful it will change a few peoples minds to the truth of things and come to think of t could possibly save lives???? Wow now if anything deserved 10 out of 10 then that does. More lines needed. I am so clever and not full of bull that i do not need to waffle on with non sense to get my point across. Is this deliberate to only allow peeps who love the sound of their own voice to complete rubbish on this thing???"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [
         "This feature documentary takes the audience on a disturbing journey deep into a culture that few can comprehend -- that of suicide bombers. Filmmaker Pierre Rehov examines the phenomenon of suicide bombers through rare and never-before-seen interviews with actual family members of terrorists, the prisoners whose bombing attempts have been thwarted, and exclusive footage of a terror bomber as he prepares for mission! This film provides a message of urgency for increasing our understanding of the psychopathological dynamics of these terrorist bombers. We finally gain insight to how these human bombs \"tick\".",
         "A documentary that examines the psychopathology behind suicide bombers - which ultimately reveals what makes them tick!"
      ],
      "budget": 0
   },
   "movielensId": 56513,
   "movielens": {
      "languages": [""],
      "releaseDate": "2006-08-27",
      "dvdReleaseDate": "2007-05-01",
      "directors": ["Pierre Rehov"],
      "runtime": 80,
      "movieId": 56513,
      "title": "Suicide Killers",
      "mpaa": "",
      "actors": [
         "Chadhoorth Djawann",
         "Jacinto Dumbal",
         "Judge Dumbroso",
         "Boaz Ganor"
      ],
      "imdbMovieId": "0830968",
      "originalTitle": "Suicide Killers",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "A documentary that examines the psychopathology behind suicide bombers - which ultimately reveals what makes them tick!",
      "tmdbMovieId": 35237,
      "avgRating": 4.5,
      "releaseYear": "2006",
      "numRatings": 1,
      "posterPath": "/qIziJCUdV52RWip0y7Zb9ad8vpi.jpg"
   }
}