{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "audio tape",
            "id": 2380
         },
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "presidential election",
            "id": 2946
         },
         {
            "name": "noises",
            "id": 3767
         },
         {
            "name": "yell",
            "id": 4881
         },
         {
            "name": "politics",
            "id": 6078
         },
         {
            "name": "faithlessness",
            "id": 6151
         }
      ],
      "imdb_id": "tt0082085",
      "video": false,
      "title": "Blow Out",
      "recommendations": [
         11033,
         11507,
         592,
         4780,
         11524,
         994,
         22307,
         3133,
         26039,
         9846,
         1847,
         11942,
         204,
         576,
         5916,
         11167,
         11368,
         8333,
         17814,
         910
      ],
      "backdrop_path": "/njiYDomW9nFmNWYZSFRU33c6hwr.jpg",
      "revenue": 12000000,
      "reviews": [{
         "author": "John Chard",
         "id": "54a945ccc3a3680c21004b3f",
         "content": "Superior entry on De Palma's CV.\r\n\r\nBrian De Palma has always gotten a bad rap for his penchant for essaying his heroes and favourite thrillers, what often gets forgotten is just how great he could be in crafting said thrillers. \r\n\r\nBlow Out has John Travolta as a sound engineer for low budget horror movies, who while out recording sounds one night witnesses a car crash and dives into the river to rescue the call girl trapped in the back seat (Nancy Allen). Upon listening back to the footage of the crash, he hears two noises which point to a gun shot being fired at the car. So with the dead man in the car turning out to be a big political mover, he quickly finds himself spun into a web of intrigue, peril, paranoia and conspiracies. Can he and the girl stay alive long enough to solve the case? \r\n\r\nBlow Out finds De Palma at the top of his game, blending the twisty plot dynamics with virtuoso technical smarts. A number of scenes are striking, both visually and in execution and the garnering of acting performances. Pino Donaggio provides an unforgettable music score to marry up to the layers of sub-plots folding together, and cinematographer Vilmos Zsigmond sharpens the primary colours to give the story a Giallo like sheen that runs concurrent with the emotional states of the major players.\r\n\r\nA sprawling and bustling Philadelphia plays host to a conspiracy sandwich, with a corking side order of the film making process. Sometimes bleak and complex, but never over stuffed, Blow Out is both thrilling and smart, while Travolta has never been better and John Lithgow is tailor made as the unstoppable crack-pot unleashed into our two protagonists' world. 8.5/10",
         "url": "https://www.themoviedb.org/review/54a945ccc3a3680c21004b3f"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Terry",
               "gender": 2,
               "credit_id": "52fe446f9251416c75034971",
               "name": "John Travolta",
               "profile_path": "/6CKR08ipxM8d2xOB26ja7OlXx7H.jpg",
               "id": 8891,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sally Badina",
               "gender": 1,
               "credit_id": "52fe446f9251416c75034975",
               "name": "Nancy Allen",
               "profile_path": "/rB8vSEB4or8GUYlyv9EBTBEC5eH.jpg",
               "id": 44038,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Burke",
               "gender": 2,
               "credit_id": "52fe446f9251416c75034979",
               "name": "John Lithgow",
               "profile_path": "/uquz3dZ0fs0lAK57lCXwxaslVkb.jpg",
               "id": 12074,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Manny Karp",
               "gender": 2,
               "credit_id": "52fe446f9251416c7503497d",
               "name": "Dennis Franz",
               "profile_path": "/oigU88Mm2YVPvyLr6cf2PehJMjW.jpg",
               "id": 11901,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe446f9251416c75034981",
               "name": "Peter Boyden",
               "profile_path": null,
               "id": 73513,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Donahue",
               "gender": 2,
               "credit_id": "52fe446f9251416c75034985",
               "name": "Curt May",
               "profile_path": null,
               "id": 73514,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Det. Mackey",
               "gender": 2,
               "credit_id": "52fe446f9251416c75034989",
               "name": "John Aquino",
               "profile_path": null,
               "id": 73515,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Lawrence Henry",
               "gender": 2,
               "credit_id": "52fe446f9251416c750349bd",
               "name": "John McMartin",
               "profile_path": "/tZBKJcaZ8iwXVWARA4D1BMPyMXF.jpg",
               "id": 13728,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Hooker",
               "gender": 1,
               "credit_id": "52fe446f9251416c750349c1",
               "name": "Deborah Everton",
               "profile_path": null,
               "id": 22107,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Detective at Hospital",
               "gender": 2,
               "credit_id": "52fe446f9251416c750349c5",
               "name": "J. Patrick McNamara",
               "profile_path": "/e0MmDICtrxAXUECYWzpOOAf2hil.jpg",
               "id": 12439,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Coed Lover",
               "gender": 0,
               "credit_id": "52fe446f9251416c750349c9",
               "name": "Missy Cleveland",
               "profile_path": null,
               "id": 1117284,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Coed Lover",
               "gender": 2,
               "credit_id": "52fe446f9251416c750349cd",
               "name": "Roger Wilson",
               "profile_path": null,
               "id": 174653,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Sue",
               "gender": 0,
               "credit_id": "52fe446f9251416c750349d1",
               "name": "Lori-Nan Engler",
               "profile_path": null,
               "id": 197399,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Girl Lover",
               "gender": 0,
               "credit_id": "53d11002c3a368776100a247",
               "name": "Barbara Sigel",
               "profile_path": null,
               "id": 1344729,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Boy Lover",
               "gender": 0,
               "credit_id": "53d11014c3a368776100a24a",
               "name": "David DeFelice",
               "profile_path": null,
               "id": 1345867,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Train Passenger",
               "gender": 2,
               "credit_id": "53d11023c3a368776a00a37b",
               "name": "Roberto Lombardi",
               "profile_path": "/bvIqGEVBYYJi7jMTXW4cFbMYTfm.jpg",
               "id": 1209900,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Dancing Coed",
               "gender": 1,
               "credit_id": "58ff85c992514161e8000796",
               "name": "Missy Crutchfield",
               "profile_path": null,
               "id": 1793542,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe446f9251416c7503498f",
               "name": "Brian De Palma",
               "profile_path": "/zTbQGFu5udsrX2i7BgmTgB0aJ1E.jpg",
               "id": 1150,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe446f9251416c75034995",
               "name": "Bill Mesce Jr.",
               "profile_path": null,
               "id": 73516,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe446f9251416c7503499b",
               "name": "Fred C. Caruso",
               "profile_path": null,
               "id": 11789,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446f9251416c750349a1",
               "name": "George Litto",
               "profile_path": null,
               "id": 67877,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446f9251416c750349a7",
               "name": "Pino Donaggio",
               "profile_path": null,
               "id": 14138,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446f9251416c750349ad",
               "name": "Vilmos Zsigmond",
               "profile_path": "/zItpdF2B0mohQSFs40E7eUg3nkL.jpg",
               "id": 12235,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe446f9251416c750349b3",
               "name": "Paul Hirsch",
               "profile_path": null,
               "id": 10766,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe446f9251416c750349b9",
               "name": "Brian De Palma",
               "profile_path": "/zTbQGFu5udsrX2i7BgmTgB0aJ1E.jpg",
               "id": 1150,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 7.658966,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11644,
      "vote_count": 306,
      "budget": 18000000,
      "overview": "Jack Terry is a master sound recordist who works on grade-B horror movies. Late one evening, he is recording sounds for use in his movies when he hears something unexpected through his sound equipment and records it. Curiosity gets the better of him when the media become involved, and he begins to unravel the pieces of a nefarious conspiracy. As he struggles to survive against his shadowy enemies and expose the truth, he does not know whom he can trust.",
      "similar": [
         9388,
         10316,
         77953,
         16995,
         586,
         10139,
         5125,
         1441,
         4723,
         9452,
         842,
         9895,
         347123,
         9776,
         56339,
         9440,
         352208,
         13191,
         10187,
         10858
      ],
      "original_title": "Blow Out",
      "runtime": 108,
      "poster_path": "/vt5d1gGPgkAKoKp127WPHjSJF3P.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cinema 77",
         "id": 1819,
         "origin_country": ""
      }],
      "release_date": "1981-07-24",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Murder has a sound all of its own!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brian De Palma"],
      "runtime": 107,
      "synopsis": "\"Blow Out\" opens with the first-person viewpoint of a psycho killer prowling a female dormitory. After spying through the windows at young ladies in various stages of undress and sexual activity, the killer attacks a nude woman taking a shower. She opens her mouth and emits a ridiculous sounding scream that deflates the entire scene. We then realize we've been watching the current film that sound engineer Jack Terry (John Travolta) has been working on. His employer, a producer of low budget horror films, orders him to find a new scream for the crucial moment of this scene. That night, Jack is standing on a bridge recording ambient sounds in a quiet park near a lake when suddenly an approaching car has a tire blow out, causing it to skid off the roadway into the water. Jack immediately dives in to help, not noticing a figure dressed in black emerging from underneath the bridge. The figure escapes while Jack tries to rescue the inhabitants of the car. Underneath the water, he finds the body of the man who was driving the car, now dead. His passenger is a young woman who is still very much alive, and Jack pulls the unconcious woman out of the wreck. Jack takes the girl to a hospital, where he learns the shocking details of what he has witnessed: the driver of the car was the governor, McRyan, who was a presidential hopeful. Detective Mackey questions Jack about the accident, and an advisor of McRyan's, Lawrence Henry, shows up at the hospital, asking Jack to forget he ever saw the girl in the car. McRyan, who was married, was apparently having some sort of illicit affair with her, and the news of her presence in the car would have caused scandal for the dead governor. Jack talks to the girl, whose name is Sally (Nancy Allen). Sally seems confused about what happened, and when the hospital cuts her loose, Jack offers to take her home. Sally instead has him take her to a motel, where Jack watches over her while she sleeps. He listens to the recording he made in the park before the accident; his equipment was running and he caught the entire incident on an audio tape. Jack is positive he hears a gunshot before the tire blows out. Meanwhile, in a dark garage after hours, a man slips into the storage area where the governor's car is being held, and swaps the shot-out tire with another. The next day, Jack wants to talk to Sally about the accident, but Sally is evasive about what she was doing with the governor that night, and she leaves in a hurry. A man emerges in the media claiming to have film footage of the accident; Manny Karp (Dennis Franz) sells his film to a magazine, and Jack buys a copy. The magazine has run a series of frames that Jack cuts apart and assembles into a crude home movie, using his own sound recording as the audio track. He sees the gunshot appear in conjunction with the sound effect, and for him, this is irrefutable proof that the accident was actually an assassination. Jack calls Sally and finds out that she's attempting to leave town; he intercepts her at the bus station and buys her a drink in the lounge in order to stall her. She reveals that Lawrence Henry gave her money to leave town for a few months. He learns that Sally has aspirations of being a makeup artist, although she struggles to support herself with low paying clerk's position. When Sally questions him about his own background, Jack reveals something painful from his past: he once worked with the police department placing a hidden recording device on an undercover informant. The incident ended horribly when the wire overheated and revealed the man as an informant, resulting in his murder. Jack is determined to prove that McRyan's death was an assassination, and he asks Sally to stay in order to help him unravel the mystery. The same man who erased the evidence of McRyan's blow out reappears, stalking a woman who appears to be Sally. He kills the woman, realizing too late that she is not Sally. Confused and upset about the implications of his mistake, he disfigures the woman's body in order to make it look like a sex crime. Through a series of phone calls, it becomes clear that this man, whose name is Burke (John Lithgow), has been hired by McRyan's political rival to stage the entire incident. However, Burke is a psychopath who takes it upon himself to disobey orders and shoot out McRyan's tire, causing the accident that resulted in his death. All he was hired to do was disgrace McRyan by taking incriminating photographs, something ties in to Manny Karp. It seems as if Karp and Sally are in cahoots with one another; together, they work as a team. Sally seduces important men, and Karp arrives to photograph them in compromising positions, at which point Sally disappears and Karp sells his photographs for profit to the highest bidder (either the victim or the victim's enemies). Jack is shocked to discover that Sally was involved in such an operation, as she seems so sweet and naive. Jack visits Mackey to reveal his suspicions about the so-called accident, but Mackey isn't interested, dismissing Jack as a crackpot with a conspiracy theory, but Jack leaves him a copy of his tape of the accident. Burke reveals to his co-conspirators that he intends to tie up all loose ends; he has erased all of Jack's audio tapes, and he intends to murder Sally, hence the reason why he attacked and killed the woman who was unfortunate enough to be her lookalike. Burke's associate disowns him, but Burke continues to act on his own, bugging Jack's phone. Jack discovers that all of his tapes have been erased, and Mackey calls him, furious that the tape he's been given is blank. Any shred of credibility with Jack had with Mackey is now gone. However, Jack is approached by a well-known TV reporter, Donahue (Curt May), who wants to put him on his high profile talk show. Jack and Sally have obtained Manny Karp's original film of the accident, which clearly demonstrates that the tire was shot out, especially when synchronized with Jack's audio recording. Donahue wants Jack to play the film on the air and discuss his experience. Unbeknownst to Jack, Burke has tapped his phone and he eavesdrops on Jack's conversations with Donahue. Burke himself calls Sally, posing as Donahue, and asks her to meet him and show him the film. Sally visits Jack because Burke has disabled his phone, making it appear busy. Jack is immediately suspicious of why Donahue would ask to meet Sally, not to mention how Donahue could have gotten Sally's phone number. Perhaps due to his desire to get Sally involved in Donahue's story, Jack agrees to let her go and meet Donahue, but only if she's wired so he can listen in on their conversation and record it as evidence. Sally agrees to meet Donahue, and Jack wires her with a listening device. Posing as Donahue, Burke has summoned Sally to the 30th Street station, and while he waits for her, he murders another woman in the public restroom, apparently planning on making Sally's murder look like the work of a serial killer. Sally parts with Jack and goes to maker her meeting, but as soon as Jack hears Burke's voice, he realizes it's not Donahue, and rushes to intercept Sally. Burke ushers Sally down into a subway and takes her to another location, with Jack listening in and trying to follow them based on audio clues. Jack loses track of Sally and panics, driving his jeep into the middle of an Independence Day parade. He crashes the jeep, and when he comes to, he can hear Sally is in danger. Burke has taken her to a nearby rooftop and secured the tape from her, immediately destroying it. Confused, Sally realizes too late she is in danger; Burke attacks her as Jack tries to reach them. He finally catches sight of Sally when she breaks away from Burke, leaning over the rooftop and emitting a terrifying scream as they make eye contact at a distance. Jack rushes up to save her, but he is too late; Burke has already killed her. Jack takes Burke by surprise, stabbing him with his own weapon, but he is anguished over the fact that Sally is dead. A denoument finds Jack now utterly despondent and broken over Sally's death, obsessed with the audio recording he made of her in the moments before her murder. In a morbid finish, Jack uses Sally's death scream as the audio in the cheap horror movie he has been working on, both Jack and his producer agree that the scream is perfect.",
      "writers": ["Brian De Palma"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082085/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4NTMzODEwMF5BMl5BanBnXkFtZTcwMzEwOTIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: John Travolta, Nancy Allen, John Lithgow | See full cast and crew »"],
      "reviews": [
         "Jack is a sound editor for small films. When he is out one evening recording background noises, he inadvertently records a car crash which kills a politician running for the US Presidency, although Jack saves a girl in the car. When pressured to say that the politician was alone, Jack finds that his recording may prove that it was murder and not an accident. However someone is cutting off the loose ends around the crime. A clever rework of Blow-Up that is given a thriller twist and visual style by De Palma. The story is quite straight forward and doesn't contain too many twists and turns. However it does have a good premise at it's core and it builds to a suitably low-key ending. De Palma works well with the material \u0096 at some points it's a little obtrusive, but he certainly can frame a shot. From his use of foreground and background focusing to the scene where Travolta realises what he has on tape \u0096 he has style to spare. He handles the ending well but perhaps feels he wants to be like Coppola a bit too much. Pre-career dip Travolta gives his best performance before Pulp Fiction \u0096 he plays the everyman really well and is totally convincing. Allen is a little too squeaky and irritating, but get past this and she's OK. Franz is on-form as a sleazy opportunist, while Lithgow is chilling as a ruthless, clinical killer. Overall it occasionally feels like there is more style than substance but everyone holds their end up and the result is a solid, enjoyable thriller that maybe pays a bit too much homage to other work.",
         "Brian DePalma was at the height of his film career when he undertook the direction of \"Blow Out\". Some comments to this forum have compared it to other distinguished films like Francis Ford Coppola's \"The Conversation\" and Michaelangelo Antonioni's \"Blow Up\", a comparison that seems to make sense, in a way, but Mr. DePalma, who wrote his own screen play, is an intelligent man who didn't need to copy anything from those masters of the cinema. In fact, \"Blow Out\" has kept its impact as a thriller mystery with its political overtones as it mixes crime with the lives of influential people that might give viewers a point of reference between the movie and actual historical facts. We are given an introduction to Jack's line of work as we watch scenes of the porno film that he is working on as a sound technician. The only thing that is needed is a real scream which the many actresses, either on the film itself, or being auditioned, can't produce. Whatever comes out of those women's throats are wimpy sounds, not a horror yell for help. Jack, who is out one night recording sounds for future ventures, captures the shot that causes the \"blow out\" and makes a car plunge into a creek. Jack abandons everything and jumps to rescue whoever he can save. He is only successful in bringing Sally out of the water. This is the beginning of Jack's involvement into the mystery behind the actual fact. Mr. DePalma's thriller is visually stylish. He photographed the movie in Philadelphia. The film has the excellent Vilmos Zsigmond behind the camera. The atmospheric music by Pino Donoggio serves the movie well. John Travolta's career was in decline when he made this movie. He gives a terrific performance as the sound effect man who stumbles in a conspiracy to eliminate the witnesses to the accident. Nancy Allen is not as effective as Sally, the young prostitute at the center of the story. Being married to the director might have helped her land the part, which with some other actress might have paid off better. John Lighgow is perfectly creepy as Burke, the evil man. Dennis Franz has the pivotal part of Karp, the man who was able to photograph the whole incident. \"Blow Out\" is a must see for all Brian DePalma's admirers.",
         "\"Banal story? Give me a break. I just watched \"Snake Eyes\" and \"Mission to Mars\" on DVD from beginning to end. They're very beautiful films. I think you missed a lot. All the critics ever talk about is the banality of my stories!\" - Brian De Palma (2002) Do not treat De Palma's films too logically. He has one agenda, and that is to enable his camera to become multiple characters. His camera, deceives, lies, lusts, stalks and mocks. When it's not adopting a character's point of view, it's literally becoming a character of it's own. There's real intelligence behind some of his films, despite their B movie roots and surface cheese. Watch the jeep scene again. See how it begins with the camera suddenly changing stance. The music booms and everything becomes operatic. The scene itself plays out like a self contained mini-opera. Of course the whole sequence is illogical, but then one of De Palma's themes throughout his career has always been reconstructing truth. In \"Snake Eyes\" and \"Black Dahlia\" it's the truth of a murder. In \"Mission Impossible\" it's reconstructing the truth of a mission gone bad. In \"Femme Fatale\" it's reconstructing the truth of a heist. In this film it's reconstructing the truth of an assassination. But what makes De Palma interesting is that this constant theme of \"finding the truth\" clashes continusouly with his artistic style. He's a formalist who's entire filmography stresses the fakery or superficiality of film. On one hand he acknowledges the lie that is film (his famous quote: \"film is 24 lies per second\"), whilst on the other, his character's constantly search for some objective truth. But back to the jeep scene. Notice how De Palma shifts to slow-motion to heighten the clues. Travolta crashes and we linger on the \"Liberty or Death?\" shop window as a plastic hang man slowly tips over. De Palma as artist and formalist has the power of deciding Travolta and Sally's fate. Like the end of \"Femme Fatalle\", he's asking his audience, teasing them, letting them know that his film isn't reality, and that only the artist as God has the power to decide the fate of characters. Do we let them die or do we let them live? He then inter-cuts this with Sally's conversation with the killer, which suddenly shifts from friendly to hostile. De Palma signifies this newfound danger by jump cutting from day to night. And so with Sally now in trouble, he literally resurrects Travolta, who of course climbs and climbs but still doesn't get there in time. Travolta's guilt and failure rings eternal as Sally's scream is immortalised in the final film-within-the-film. A film kills Sally and a film immortalises her death. A recorded sound (blow out) brings her into De Palma's world and a recorded sound (her scream) brings her out of it. There's a cinematic purity to Sally's life. 9/10- Brilliant opening, brilliant ending and some memorable scenes in the middle. The virtuoso camera work doesn't touch \"Snake Eyes\" and the purposefully cheesy acting (the porno within a film makes it clear that De Palma sees this as self conscious formalist film-making) at times detracts. Still, this is nevertheless enjoyable and one of the more accessible De Palma films.",
         "A film starring John Travolta in the early eighties was sure to attract attention, but that did not mean it would necessarily be good. A film about conspiracy, murder, and politics would not take in the best at the box office, but that did not make it bad. Well, in the world at the time \"Blow Out\" was released, John Travolta's career was beginning to fade and more people were being taken in by Science Fiction and slasher(which is noted and poked fun at in the film's opening) films and did not want to use neurons to enjoy this film. Not a wise choice. \"Blow Out\" is a psychological and poignant film about the curiosity and outcomes surrounding the death of a politician. When Jack Terry (Travolta, in what may be his best, but most underrated role to date) is out catching sounds for a film he is putting together, he records(and therefor, witnesses) a car get it's tire blown out and fall into the nearby river. Astounded, he jumps into the car and finds there to be a dead driver, but a woman, very much alive and in distress. He rescues her, and both are taken to the hospital. It is revealed that the lady's name is Sally Bedina(Nancy Allen, in one of her best roles also) and the man she was with is the man who was most likely to be the next president, Gov. McRyan. Chaos ensues when Jack finds out (through his sound recordings) that the car was not hit by a flat tire, but that someone may have shot the tire out, as an assassination. As Sally and Jack delve deeper and deeper into the mystery, someone is out there, watching them, waiting, with an agenda of his own. Cleverly written thriller, which keeps you on the edge of your seat through the entire film, never lets up, and suggests what most films(especially in today's times) will not-Conspiracy. In every sense of the word-in the government, in the working classes, in humanity in general. A take from an earlier film, Antonioni's \"Blow Up\" which was released in nineteen sixty-six, this film explores the diversity of human emotions, and motivations. All the characters are clearly developed, and all with different aspects about them. Jack, is a sound man, doesn't seem to care much about opulence, and is an all around type of guy. He is punctual and very quick to find the truth. His psychosis suggests a character which stands to morals, sharp judgment, and a very likable guy in general. John Travolta plays Jack out with sensitivity, profound genuity, and adroit intricacy. As the lead, the film rests well on his shoulders...and with the help from the rest of the fine cast as well. Sally is a naive young woman, full of choices and ambition. She is from a more darker side of history, doing odd jobs for money just to get by, and certainly has more morals than she would let on. She is a very nice and heartful person, but is also afraid of her life ending up wrong. This is where you can see a dark past, and the way Nancy Allen plays her out surely lets the audience know. Allen had passion for this role, and the role itself is not an easy role to fill, there are emotions discreet, and a lot of pain. However, Allen flourishes as she speaks with mannerisms that transcend any other role she portrayed. I learned to like Sally from the moment she opened up to the audience. A supporting turn from Dennis Franz, who is always a reliable actor, makes up for the perfect example of a good supporting role, albeit it offensive in the least. The film can much be compared to the Kennedy assassination, as a politician was killed, and the conspiracy theories were tossed and turned in the tabloids, who are seen in this film as one of the real enemies, but there are many more. One other thing this film proves is that there are Blow outs in the mind, as well as in the film. The more our two heroes find out, the more the art of this film comes clear, and their minds are toyed with, but we as an audience see this, as part of making this a terrific viewing experience. This film was not a success, as far as money goes, but this film is clearly one of De Palma's best efforts, right up there with Scarface and The Untouchables. It is a touching and central effort, with likable characters, a grandiose Pino Donaggio score(one of the maestro's finest) and an ending that will rock your mind. The political undertones are fully understood at the films end, which is something not seen at all today. This is a really good film to show to film classes, film-making classes, film appreciation classes, etc. All in all, one helluva viewing experience, and one that never gets old either, making it one of De Palma' finest hours.",
         "Jack Terri is a soundman for a B-movie studio. One night as he is out recording sounds for a film he sees an accident - a car swerves through a guard rail and into a river. Jack jumps in in effort to help and sees that the driver is dead, but he manages to save the passenger. He soon finds out that the driver was the current favorite in the presidential election and after listening to the recording he suspects that what happened was no accident. This is the type of movie many people call a rip-off as not only does it take an idea from a previous story and film ('Blow Up') it is one of DePalma's many Hitchcockian efforts. However, under his direction the film feels fresh and moves very well. It is 13 years before John Travolta made 'Pulp Fiction' but he was already a good lead actor. Dennis Franz also gives a good turn as a photographer who knows more than he is telling. However, the scene stealer, would have to be John Lithgow who stoically walks his way through the film as a ruthless killer who wants to remove Jack Terri for the evidence he has. Rarely is such a emotionless and callous role played out so well to such great effect. Then there is DePalma's direction which is the great thing that put all the good stuff together. He has a particular skill of blending shots/scenes without dissolves and that carries the movie is an interesting way. Using shadows, silhouettes, rotating camera shots he is truly a master in good form here. 9/10 Rated R: some grisly violence, and profanity",
         "Brian De Palma's ''Blow Out'' starring John Travolta, Nancy Allen and John Lithgow would go down as my favourite film (just ahead of \"Causalities of War\" and ''Dressed to Kill'') of his on-going filmography. Usually I find him to be an on-and-off director, and ''Blow Out'' was switched on. It's one of those presentations that doesn't just hold you there with its captivating sombre murder mystery (similar to Blow-Up and 'The Conversation') relating to a political conspiracy, but also De Palma's showy technical side is nothing short than exquisitely striking. Well you might say that's the case for most of his work, however on this occasion its extremely well controlled to balance the story and it isn't so much the peering camera and sharp editing (although still commendably evident and how can you go wrong with split frames) but the ingenious use of sound effects and the ironic nature of our main protagonist being an audio technician for b-grade horror movies (which within the building he works bestows some cool horror posters that fans will surely pick up on). The layered story has that old-fashion noir quality, with the momentum building upon mood and suspense constructing illuminating atmospherics and consisting of fitting performances. While the brooding plot screws around with its webby developments and taut tension, never does the suspiciously tactical script entirely pick it apart with any sort of depth or rationality. In the end its quite basic. However this made the harrowing impact of the film's conclusion even more lasting, as the emotional brunt came from De Palma's intensely slick visual work like the stirring slow-motion climax with Pino Donaggio's harrowing score (which holds a delightfully crisp and variable arrangement throughout). It's top drawer in De Palma's illustratively intimate details oozing with colour, tones and shades with it being served by some beautifully projected expressive photography and a lingering nasty current. An excellent John Travolta brings a convicted temperament to the lead and a bubbling Nancy Allen adds a perky injection. A precisely scheming performance by John Lithgow is truly menacing. Also in support is Denis Franz. An enjoyably stylish, if simple thriller.",
         "1st watched 10/03/2005 - 8 out of 10(Dir-Brian De Palma): Wonderfully written and directed story by Brian De Palma about a sound man who records an accident(we think) at a bridge while doing his job of recording sounds for a recent movie gig. We find out the accident involved a Governor who happened to be running for President of the United States and the title character(Jack played by John Travolta) just happened to rescue another person from the vehicle(who was a lady of the night played by Nancy Allen) and the Governor dies. What ensues is a major attempt to cover up some of the facts while Jack tries to piece together what he heard and saw for evidence of the foul play. He believes he heard a shot that blew out the tire of the vehicle and with an amateur photograph's pictures rigs together a pretty convincing portrait of the truth. Travolta is great in what I consider one of his best acting stints but Nancy Allen is tolerable at best. This is the only real negative to this otherwise well made and pieced together thriller that works to the very end and deserved more recognition than it received. I think everyone(audiences and critics alike) expected something different from someone who was known mainly for horror movies before this but this movie started a string of well-received movies coming from him and is definitely one",
         "BLOW OUT deserves more attention than a lot of other thrillers from the '80s, partly because it's taut with suspense most of the time and owes a lot of its chill to JOHN LITHGOW's performance as a cold-blooded psychotic killer. It's also one of JOHN TRAVOLTA's best early roles as a soundman looking for \"the perfect scream\" for one of his horror movies who accidentally shoots some film of a car careening off a bridge. He dives into the water to try saving the victims but is only able to rescue the woman (NANCY ALLEN). It turns out that the driver was a senator who was a presidential candidate (shades of Chappaquiddick). From then on, the mystery deepens as he comes to suspect there's some kind of conspiracy involved. DENNIS FRANZ is Allen's boss, a sleazy photographer, who offers to help Travolta. The whole story is filmed with all the DePalma camera tricks and touches that keep the suspense boiling until the climactic shoot-out at the climax. But it's JOHN LITHGOW who steals the film as the merciless killer with undisclosed political reasons for his murderous mission. A forgotten gem among the stylish DePalma films that deserves more recognition today. I'm not much of a Travolta fan, but this is one of his better roles.",
         "The opening of this movie must rival Bullit as cool openings go. Wonderfully shot throughout, and even though you can see how dated the film is just by Travoltas' and Allens' hair and dress sense, it doesn't affect the quality. The story is competent, but what makes the film is DePalma's treatment. The quiet scenes and the complete focus on noise, other than that of the characters talking. Visuals and backgrounds start this movie and run all the way through the major scenes, finally closing it. This is an excellent thriller, and many modern films of this genre should take notes. A great movie.",
         "I was blown away by Brian DePalma's \"Blow Out\" (1981), the Real American Classic from the 80th. Yes, of course, De Palma pays homage to both, \"Blow Up\" and \"Conversation\" but \"Blow Out\" is a vintage DePalma at his best, in his glory and brilliance. The story is great, packed with twists and turns and also lets us peek once again as in Body Double\" at the B-movies making process. John Travolta is Jack Terri, a sound technician who rescues a girl (Nancy Allen) from a car that crashes into a river after a blow out. The man who drove the car did not survive and he happened to be the next presidential candidate. Jack soon realizes that it was not just a blow out but a murder, and he's got an evidence to prove it, the tape that he made on the bridge while recording the background noises for the movie. As good as the story is, it does not forget its characters, and they are memorable and multi-dimensional. The actors are terrific. It was the time when John Travolta was both cute without being smug and compelling. Nancy Allen as Sally, was sweet and heartbreaking, Dennis Franz's character, Manny Karp, the petty blackmailer who got more than he bargained for was fun to watch, and John Lithgow made such a chilling villain that Anthony Hopkins could've learned something from him. I did not even start on Vilmos Zsigmond's camera work. Only one word comes to mind - mesmerizing. The final chase sequence on the streets of Philadelphia during the celebration of the ringing of the Liberty Bell is as well staged and shut and as exiting as the similar climatic chase on Mount Rushmore in Hitchcock's \"North By Northwest\". The movie is perfectly balanced by the last scene and the hilarious opening scene mirroring each other but this time the scream is different. It IS a good scream that came from the streets of Philadelphia."
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Cinema 77",
         "Geria Productions",
         "Filmways Pictures"
      ],
      "summaries": [
         "This stylish Brian DePalma thriller plays off the theme of the unsuspecting witness who discovers a crime and is thereby put in grave danger, but with a novel twist. Jack is a sound recordist who works on grade-B horror movies. Late one evening, he is recording sounds for use in his movies when he hears something unexpected through his sound equipment and records it. Curiosity gets the better of him when the media become involved, and he begins to unravel the pieces of a nefarious conspiracy. As he struggles to survive against his shadowy enemies and expose the truth, he doesn't know whom he can trust.",
         "A movie sound recordist accidentally records the evidence that proves that a car accident was actually murder and consequently finds himself in danger."
      ],
      "budget": 18000000
   },
   "movielensId": 5712,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-07-24",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Brian De Palma"],
      "runtime": 108,
      "movieId": 5712,
      "title": "Blow Out",
      "mpaa": "R",
      "actors": [
         "John Travolta",
         "Nancy Allen",
         "John Lithgow",
         "Dennis Franz",
         "Peter Boyden",
         "Curt May",
         "John Aquino",
         "John McMartin",
         "Deborah Everton",
         "J. Patrick McNamara",
         "Missy Cleveland",
         "Roger Wilson",
         "Lori-Nan Engler",
         "Barbara Sigel",
         "David DeFelice",
         "Roberto Lombardi",
         "Missy Crutchfield"
      ],
      "imdbMovieId": "0082085",
      "originalTitle": "Blow Out",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [
         "rDve1A5EAvk",
         "egvlvWvpzRE",
         "3NIoQ9z0VMo"
      ],
      "plotSummary": "Jack Terry is a master sound recordist who works on grade-B horror movies. Late one evening, he is recording sounds for use in his movies when he hears something unexpected through his sound equipment and records it. Curiosity gets the better of him when the media become involved, and he begins to unravel the pieces of a nefarious conspiracy. As he struggles to survive against his shadowy enemies and expose the truth, he does not know whom he can trust.",
      "tmdbMovieId": 11644,
      "avgRating": 3.5467,
      "releaseYear": "1981",
      "numRatings": 803,
      "posterPath": "/vt5d1gGPgkAKoKp127WPHjSJF3P.jpg"
   }
}