{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0462392",
      "video": false,
      "title": "LOL",
      "recommendations": [],
      "backdrop_path": "/lfKpUJYGxVpCRgbF8YKkNgktPlz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe4688c3a36847f8104475",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Greta",
               "gender": 1,
               "credit_id": "52fe4688c3a36847f8104479",
               "name": "Greta Gerwig",
               "profile_path": "/3H0xzU12GTNJyQTpGysEuI9KyiQ.jpg",
               "id": 45400,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Walter",
               "gender": 1,
               "credit_id": "52fe4688c3a36847f810447d",
               "name": "Tipper Newton",
               "profile_path": "/ebHGxviD8ZD4Rt9Y4n0rxwUIvIh.jpg",
               "id": 45422,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Chris",
               "gender": 0,
               "credit_id": "5a9db9ca0e0a2671f2004eef",
               "name": "C. Mason Wells",
               "profile_path": null,
               "id": 1063229,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Alex",
               "gender": 2,
               "credit_id": "5a9db9d60e0a267201005051",
               "name": "Kevin Bewersdorf",
               "profile_path": null,
               "id": 45425,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Ada",
               "gender": 0,
               "credit_id": "5a9db9de0e0a26720500574c",
               "name": "Brigid Reagan",
               "profile_path": null,
               "id": 1991267,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Tessa",
               "gender": 0,
               "credit_id": "5a9db9e60e0a2671f2004f07",
               "name": "Kate Winterich",
               "profile_path": null,
               "id": 589780,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4688c3a36847f8104483",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4688c3a36847f8104489",
               "name": "C. Mason Wells",
               "profile_path": null,
               "id": 1063229,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4688c3a36847f810448f",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4688c3a36847f8104495",
               "name": "Kevin Bewersdorf",
               "profile_path": null,
               "id": 1063230,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.95373,
      "production_countries": [],
      "id": 44434,
      "vote_count": 11,
      "budget": 0,
      "overview": "The relationships of three men are examined through their use of technology.",
      "similar": [
         13132,
         33833,
         13120,
         5761,
         42585,
         47440,
         18468,
         112160,
         141,
         244267,
         793,
         43923,
         1826,
         127517,
         2142,
         68924,
         147,
         527,
         5971,
         27586
      ],
      "original_title": "LOL",
      "runtime": 81,
      "poster_path": "/jopnw0wSQUVT8EuErRB4uHMlATz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2006-03-13",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joe Swanberg"],
      "runtime": 81,
      "synopsis": "Laugh out loud funny!",
      "writers": [
         "Kevin Bewersdorf",
         "Joe Swanberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0462392/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyNTAzNjY4OV5BMl5BanBnXkFtZTcwODU4Nzk0MQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Joe Swanberg, C. Mason Wells, Kevin Bewersdorf | See full cast and crew »"],
      "reviews": [
         "For a film shot entirely on standard definition video, LOL is surprisingly accessible. In fact, the low quality visuals only seem to add to the ambiance of the film, which deals with the \"youtube generation\" a group of people whose social interaction relies heavily on the internet and technology. Yes the film is slow, almost boring in parts, but this fact becomes completely forgivable when one realizes that what they are watching is a near accurate representation of real life. Standard Hollywood conventions are ignored and replaced by a truly pioneering cinematic style. The characters infuriate, in the way only real people can. It's like watching a friend self destruct after not getting their way. But how can these characters give or take all they need from relationships, when the very technology that is there to enhance communication, is in fact hindering it. There is no physical sex, the closest thing being the sending back and forth of sexual pictures between mobile phones. The film paints a grim portrait of the way social interaction is heading, becoming more and more distant as we rely more heavily on technology. Although the film is probably only relevant to a certain narrow demographic, the filmmakers certainly have their fingers on the pulse of that culture.",
         "LOL is an experimental, low budget movie about young men who are so preoccupied with the internet and their cellphone that they miss out in their social life, in particular with the ladies. It's shot on wobbly low-res video, the dialogue is improvised (or feels that way), the actors are newbies. There's a subplot where a protagonist films people making strange noises and makes \"Electronic\" songs from the samples. But that's not why this movie is somewhat difficult (tiresome) to watch. It's because the film makers make no attempt to make us want to follow the story. And the pure observations aren't that captivating to begin with. One guy constantly chats online, even when his girlfriend waits in the next room fixing to get busy. Why does he act like this? We can make up our own theories, or -- in my case -- just not care. Watch this if you're into low-budget experimental movies, or curious about the beginnings of the Mumblecore school of filmmaking.",
         "I had never seen a movie with actress Greta Gerwig but a few weeks ago I heard a radio interview with her and became immensely intrigued about her films. So right at the beginning of her film career I am starting out. This mumblecore independent (is any mumblecore film not indie?) is quite interesting in that it sucks terribly due to mega low budget... but it's quite truthful. Our addiction (in general) to technology and how it negatively affects us is at the core of all three story lines here. Their lives only briefly intersect and there's no ending because there is no resolution -- the problem goes on. It's scary to see a generation of college grads living their life this way. And kids after them are only making it worse. Technology bad, move to a cave in the middle of nowhere! 5.2 / 10 stars --Zoooma, a Kat Pirate Screener",
         "Hello guys! Its is me! I watching my favrite move name LOL and i relise the french fries make a rip off! Its is totally wortless! don't see it. It is pieces of garbage creps. If you like the move LOL with Hanna Montana, also called Milty Cyrus. You will not like this! It is one big disgrace of grete move! Why did the french fries even make their owen move!? I am so pissing of right now i cannot speak out loud! Who did even know this move have better scorings than the original? Oh god in heaven!",
         "This movie is so true of our society today with falsified internet relationships. Bravo!It \"freaking\" nails it! So many people try to use the internet as a buffer to who they really are, they want to hide, not showing their true colors. Most never realized they are chasing after a lost cause! The musical score goes perfectly with the footage. Brilliant yet subtle. Peak performances from Tipper Newton. Not a surprise, her sister is, Randi Newton, an established actress in New York and Los Angeles. It would only make sense for her to follow in her footsteps. Both Tipper and Randi shot the indie feature \"My Sister\" and \"The Baby\" in 2004, if you haven't seen it, try to grab a copy. Their other sister Cobi Newton is a reputable artist in both Kansas City and New York."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [],
      "summaries": ["The relationships of three men are examined through their use of technology."],
      "budget": 3000
   },
   "movielensId": 57236,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-03-13",
      "dvdReleaseDate": "2007-08-28",
      "directors": ["Joe Swanberg"],
      "runtime": 81,
      "movieId": 57236,
      "title": "LOL",
      "mpaa": "",
      "actors": [
         "Joe Swanberg",
         "Greta Gerwig",
         "Tipper Newton"
      ],
      "imdbMovieId": "0462392",
      "originalTitle": "LOL",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The relationships of three men are examined through their use of technology.",
      "tmdbMovieId": 44434,
      "avgRating": 3.04167,
      "releaseYear": "2006",
      "numRatings": 12,
      "posterPath": "/jopnw0wSQUVT8EuErRB4uHMlATz.jpg"
   }
}