{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "wilderness",
            "id": 3593
         },
         {
            "name": "survival",
            "id": 10349
         }
      ],
      "imdb_id": "tt0082247",
      "video": false,
      "title": "Death Hunt",
      "recommendations": [
         26173,
         19403,
         33545,
         21242,
         36191,
         130002,
         39044,
         18588,
         43010,
         50953,
         107934,
         204686,
         42088,
         27644,
         68198,
         114618,
         40797,
         19525,
         47914,
         61564
      ],
      "backdrop_path": "/m7OyQ5NREEzEemOcLjhvLSShZQH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Albert Johnson",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e0437e1",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sgt. Edgar Millen, RCMP",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e0437e5",
               "name": "Lee Marvin",
               "profile_path": "/xsXdqvZpxlo7iEm2ODMnXbfNgZM.jpg",
               "id": 18391,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Const. Alvin Adams, RCMP",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e0437e9",
               "name": "Andrew Stevens",
               "profile_path": "/jaWFCqWahZeUimpEU2GJStm6pKI.jpg",
               "id": 21479,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sundog / George Washington Lincoln Brown",
               "gender": 0,
               "credit_id": "52fe4503c3a368484e0437ed",
               "name": "Carl Weathers",
               "profile_path": "/xOpDfVa83R1EdiNkWPNITfCH67e.jpg",
               "id": 1101,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hazel",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e0437f1",
               "name": "Ed Lauter",
               "profile_path": "/3mlQucZnEpYA1R8LxxKepsd7JpO.jpg",
               "id": 21523,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Capt. Hank Tucker, RCAF (the pilot)",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e0437f5",
               "name": "Scott Hylands",
               "profile_path": "/9pnyaMxYddfdO5gft1bR0q31oge.jpg",
               "id": 27113,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Vanessa McBride",
               "gender": 1,
               "credit_id": "52fe4503c3a368484e0437f9",
               "name": "Angie Dickinson",
               "profile_path": "/tseegCkV3HvsXKIbcFuXHdzG4o2.jpg",
               "id": 4301,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Charlie Rat",
               "gender": 0,
               "credit_id": "52fe4503c3a368484e043803",
               "name": "Maurice Kowalewski",
               "profile_path": "/aLtAGGPm8bemPlSIUwhMwdAo1B8.jpg",
               "id": 1152827,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Bill Luce",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e043807",
               "name": "Henry Beckman",
               "profile_path": "/4jAiIWcrpni24jnG6I2mUr0GXYn.jpg",
               "id": 33479,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Ned Warren",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e04380b",
               "name": "William Sanderson",
               "profile_path": "/vR2EnhcPUqkIeXmHf10Sokeuw1J.jpg",
               "id": 590,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Hawkins",
               "gender": 0,
               "credit_id": "52fe4503c3a368484e04380f",
               "name": "Jon Cedar",
               "profile_path": "/jVU3Z6kG0FXfWwzbNjte3DlSv1Z.jpg",
               "id": 135189,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Hurley",
               "gender": 0,
               "credit_id": "52fe4503c3a368484e043813",
               "name": "James O'Connell",
               "profile_path": "/tUGcAH4lAkr5xW6Azmb0qKUnwra.jpg",
               "id": 167369,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Lewis",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e043817",
               "name": "Len Lesser",
               "profile_path": "/h6mL9dHhYa4sHppv4GRJIkUTqwe.jpg",
               "id": 78087,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Beeler",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e04381b",
               "name": "Richard Davalos",
               "profile_path": "/fQxCuObBh1hQ3CyTGerDHfshYFM.jpg",
               "id": 2751,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Clarence",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e04381f",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Deak De Bleargue",
               "gender": 2,
               "credit_id": "52fe4503c3a368484e043823",
               "name": "August Schellenberg",
               "profile_path": "/iZ7dQ3JMdrWoUyh4vB8vOxhqoSI.jpg",
               "id": 18260,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4503c3a368484e0437ff",
               "name": "Peter R. Hunt",
               "profile_path": null,
               "id": 9868,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4503c3a368484e043829",
               "name": "Michael Grais",
               "profile_path": null,
               "id": 10056,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4503c3a368484e04382f",
               "name": "Mark Victor",
               "profile_path": null,
               "id": 10058,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4503c3a368484e043835",
               "name": "Murray Shostak",
               "profile_path": null,
               "id": 29452,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4503c3a368484e04383b",
               "name": "Raymond Chow",
               "profile_path": "/zAIthSX6xZoaj1J09Uv6JzagKWP.jpg",
               "id": 46323,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4503c3a368484e043841",
               "name": "Albert S. Ruddy",
               "profile_path": null,
               "id": 457,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4503c3a368484e043847",
               "name": "Jerrold Immel",
               "profile_path": null,
               "id": 230125,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4503c3a368484e04384d",
               "name": "James Devis",
               "profile_path": null,
               "id": 1025920,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4503c3a368484e043853",
               "name": "John F. Burnett",
               "profile_path": null,
               "id": 8881,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4503c3a368484e043859",
               "name": "Allan Jacobs",
               "profile_path": null,
               "id": 1176925,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4503c3a368484e04385f",
               "name": "Ted Haworth",
               "profile_path": null,
               "id": 12495,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.270344,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26444,
      "vote_count": 41,
      "budget": 0,
      "overview": "Canada 1931: The unsociable trapper Johnson lives for himself in the ice-cold mountains near the Yukon river. During a visit in the town he witnesses a dog-fight. He interrupts the game and buys one of the dogs - almost dead already - for $200 against the owner's will. When the owner Hasel complains to Mountie Sergeant Millen, he refuses to take action. But then the loathing breeder and his friends accuse Johnson of murder. So Millen, although sympathetic, has to try to take him under arrest - but Johnson defends his freedom in every way possible.",
      "similar": [
         75174,
         290512,
         281957,
         22538,
         390062,
         309050,
         244316,
         238636,
         19908,
         9433,
         19898,
         1579,
         2787,
         3170,
         8358,
         9693,
         568,
         6947,
         1369,
         20766
      ],
      "original_title": "Death Hunt",
      "runtime": 97,
      "poster_path": "/8DN3GxgDYV4yMRYWGVfzBY4xQdc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Golden Harvest Company",
            "id": 2521,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Northshore Investments Ltd.",
            "id": 16379,
            "origin_country": ""
         }
      ],
      "release_date": "1981-05-22",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The Saga Of Two Rivals Who Clash As Enemies And Triumph As Heroes.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter R. Hunt"],
      "runtime": 97,
      "synopsis": "In the Yukon Territory in 1931, solitary American trapper Albert Johnson (Charles Bronson), comes across an organized dog fight. One of the dogs, a white German Shepherd, is badly injured and Johnson forcibly takes it, paying $200 to its owner, a vicious trapper named Hazel (Ed Lauter). Aggrieved by his treatment and claiming the dog was stolen from him, Hazel, leads several of his thugs to Johnson's isolated cabin. The men then attack the cabin, shooting while others create a diversion. Johnson kills one of the men, a trapper named Jimmy Tom (Denis Lacroix), after he shoots Sitka, the dog, which Johnson has nursed back to health. Once they discover that Johnson has bought 700 rounds of ammunition from the local trading post and paid in $100 bills, the trappers become convinced that Johnson is the \"mad trapper\", a possibly mythical, psychopathic, serial-killing figure who supposedly murders other trappers in the wilderness and takes their gold teeth. An old trapper, named Bill Lusk (Henry Beckman), warns Johnson that the law is coming for him. Johnson fortifies his cabin. Sergeant Edgar Millen (Lee Marvin), commander of the local Royal Canadian Mounted Police post in this region, seems a tough but humane man. He has a tracker named Sundog Brown (Carl Weathers), and a new constable named Alvin Adams (Andrew Stevens), plus a new lover in fellow mountie Vanessa McBride (Angie Dickinson). Millen leads a posse of armed mounties and trappers to the cabin. He meets with Johnson, who comes out his front door, telling him that he has a pretty good idea of what happened and if Johnson comes with him they can get it sorted out. However, before Johnson can answer, one of the trigger-happy trappers opens fire and Johnson is forced to run back inside and engages the trappers in a shootout. Several of the trappers end up killed, including one who is shot for screaming by one of his friends. The posse uses dynamite to blow up the cabin, but Johnson escapes, shooting dead a mountie, Constable Hawkins (Jon Cedar). Millen, Sundog and Adams, joined by Hazel with his tracker dogs, set off into the frozen wilderness after Johnson. The case has made front-page news across the country, so many trappers also set off after the RCMP, attracted by a $1,000 bounty that has been placed on Johnson's life. Captain Hank Tucker (Scott Hylands), a Royal Canadian Air Force pilot, is also sent by the government to join the hunt, which is causing a national embarrassment. He reveals that Johnson was a member of a United States Army special intelligence unit during World War I. Johnson utilizes a number of tracking techniques to avoid Millen's posse and the bounty hunters, living off the land in treacherous winter conditions. As the hunt continues, Millen begins to respect Johnson's uncommon abilities while growing to resent the intrusion of so many outsiders. Lusk comes across two of the trappers camping in the wilderness and shoots them both dead before pulling out their gold teeth. Lusk, so it would appear, is the real mad trapper. The pursuers catch up to Johnson. Tucker, flying his biplane, begins to carelessly machine-gun the area, killing Sundog. The enraged Millen and Adams shoot down the plane with their rifles; Tucker crashes into a canyon wall and is killed. Johnson escapes after killing Hazel. Lusk comes across Johnson and tries to kill him, presumably attracted by the reward. Johnson tricks him and captures him at gunpoint. Millen spots Johnson and opens fire; the bullet hits him in the face, rendering him unrecognisable. As they examine the body, both Millen and Adams spot the real Johnson, dressed in Lusk's clothes, on a ridge above them. The man they shot was Lusk dressed in Johnson's clothes. The mounties allow Johnson to flee into Alaska, well aware that everything he did was in self-defense. As the other pursuers appear, Adams tells them that Millen has killed Johnson. A trapper finds that the body has a pocket full of gold teeth, so they celebrate the killing of the \"mad trapper.\"",
      "writers": [
         "Michael Grais",
         "Mark Victor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082247/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MDczNjA0Ml5BMl5BanBnXkFtZTcwOTQwODcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Bronson, Lee Marvin, Andrew Stevens | See full cast and crew »"],
      "reviews": [
         "I have always been intrigued by this film, mostly because of the fantasy it suggests, and even obtained a VHS copy to look it over more closely. Using the leads posted by other readers, I have been able to glean the following facts from various Internet and library resources concerning the strange tale of The Mad Trapper of Rat River, played in Death Hunt by Charles Bronson; a] A man referring to himself as Albert Johnson [identified post mortem by associates as Albert Nelson, although that was also an assumed name] arrived in the Aklavik area and brought attention onto himself from a large purchase of ammunition, a new shotgun, and an inexplicable refusal to get himself a trapper's license. Johnson ran afoul of a Constable Edgar Millen [Lee Marvin's character] during the New Years season of 1931-32 after his apparent meddlings with the traps of some of the local types, who suggested that he had gone bonkers in the isolation of the mountains. b] Two posses did in fact make seperate trips to Johnson's handmade cabin [measuring 8 feet by 8 feet] and one of the Mounties did in fact have a brief encounter with Johnson through an open window; The first time he simply wouldn't answer their knocks, and the second time he shot a Mountie through his closed door with a .38 automatic. A third posse, with Const. Millens, then made the 80 mile dogsled trip and blew up Johnson's cabin after he again refused to acknowledge them. c] After they blew up his cabin, Johnson did indeed jump up out of a foxhole he had been hiding in, firing a sawed off shotgun and a .22 repeater with the stock removed. The Mounties retreated, and Johnson slipped away in the darkness. d] A resulting \"death hunt\" did indeed ensue, set entirely above the arctic circle, and by the first-time ever use of wireless radios by law enforcement, kept the public of Canada and America riveted with their newspaper and wire reports of the two week long manhunt that was the O.J. Simpson crime case of it's day. Johnson proved a remarkable adversary, using every trick in the book to confound his pursuers, and managed to survive the nightly -40 tempetures with little or no supplies or survival gear. They did manage to corner him on one occasion; there was a gunfight, Constable Millens was killed, and Johnson escaped by climbing a sheer cliff with his bare hands in the dead of night during a blizzard. e] A bush pilot and former WW1 air ace became involved in the pursuit, not only by resupplying the posse and flying out wounded men, but played an invaluable role in tracking Johnson after he had made his initial escape, using another wireless radio to vector in the ground pursuit in another law enforcement first. He damn near well almost escaped too, though he was finally cut down in a hail of lead after keeping the authorities at bay for 48 days. f] The whole case was dubbed \"The Mad Trapper of Rat River\" incident by the press owing to the locals' contention that Johnson had gone cabin happy. He was found to be carrying a $2400 bankroll when searched, and I have found two references to \"gold teeth\" or gold fillings; The natives of the area had a fable about \"The Trapper who steals the gold from men's teeth\" that may have been attributed to Johnson after he was found to have some gold dental work in his posession. Whether they were his or someone else's is unknown, but their presence plus all that cash led to a rumor that he got rich by prying folks' gold fillings out. This has never been substantiated, and the \"Mad Trapper\" name was pinned to him before these revelations came to light. To this very day, Johnson's actual identity remains a complete mystery, and his bid for freedom one of the most remarkable examples of man surviving the elements. NOW, with that in mind, Death Hunt's scriptwriters took a few liberties with the facts to create a more romanticized tale; - Bronson's Abert Johnson is now a decoarted war veteran trained in Special Ops, which accounts for his hardiness, comfort with weapons and wealth of survival skills. - The conflict with the locals is initiated by having Bronson break up a dog fight, making his character sympathetic when compared to the dirt bags who pick a scrap with him afterwards. - The dog is then killed to provide Bronson with an understandable motive to blow someone's head off and escalate the confrontation. Poor doggie... - William Beckamn's character of Old Bill is introduced to provide a way for Bronson's character to survive the film after Lee Marvin manages to blow Bill's face off with a single slug. Nice shootin'. - Lee Marvin's Sgt. Millens also survives and is credited with the man who killed Albert Johnson. Maybe the producers though this was a way of paying homage to Millen's memory. - The pilot is turned into a jerk to create a \"new world vs. old values\" conflict with Marvin, then provided with a machine gun equipped biplane to he can gun down Apollo Creed and reinforce the senselessness of it all. The actual pilot. a Capt. \"Wop\" May, was widely regarded as a hero for the role he played. - The film was shot during the spring and summer thaw so that characters could wander around in open jackets and sweaters. Much of the pursuing posse footage looks like it was filmed on a snowed over golf course somewhere; we never get a feel that these men are actually battling against the elements. - The one scene that Bronson and Marvin share is so strangely shot and edited as to suggest that the two actors were not on the set at the same time. Watch it closely -- you can never see both men's faces in the same shot. Yet I will always have a soft spot for Death Hunt -- it is probably the first R rated film I ever saw. It would be interesting to see a more historically accurate account of the Mad Trapper comitted to film; think of this as the fanciful and romanticized version. If you have ever dreamed of taking a pack of supplies, a rifle and a dog up into the mountains and saying To Hell With Civilization, this film was made for you.",
         "This is an almost forgotten film, a status which is undeserved. Loosely based on a true story, it is the tale of a lone, mysterious trapper who irks some thugs in the Canadian wilderness, leading to a massive manhunt by the Mounties. Bronson (virtually silent throughout and thus quite effective) is a resourceful target, at once gentle and violent. Marvin is the grizzled head of the mounted police who has the task of tracking down and capturing a man with whom he can identify. Their unspoken understanding is fascinating to see. Marvin is aided by a wet-behind-the-ears, by-the-book officer played by Stevens. It would be hard to imagine a more adorable sight than fresh-scrubbed Stevens in his red uniform entering the grungy town where the police are stationed. He is gorgeous.....and quite a fine actor. It is a shame that he wasn't able to get to a better place with his acting career. The film is peppered with a ton of familiar (if dirty) faces from old westerns of TV and film. All of the lynch mob look like people who've been guest villain on \"Bonanza\" or \"The Big Valley\". One major drawback is Dickinson. It's hard to believe that someone can be miscast in a role as tiny as this one, but she is. Her anachronistic teased hair drains what little 1930's period flavor there is from the film and she is wooden in all her scenes. Apparently, she was stunt-cast because of her previous work with Marvin, but it failed miserably. There is a bit of a connection to \"Dances with Wolves\" in this film, Maury Chaykin and Tantoo Cardinal appear in both films and Bronson even develops a similar relationship with a vicious dog as Costner does with his wolf. The film is something like \"First Blood\" + \"The Fugitive\" x snow - 40 years. It is a great example of the \"Bronson versus the world\" type of film and offers a solid Marvin performance as well. There is more going on here than one might think. The final showdown is quite dramatic and suspenseful. The scenery is also great.",
         "When you look at a lot of the action movies released today, all you can see are special effects. There is usually nothing else going on. When you look at a film like \"Death hunt\" it's something totally different. Marvin is great and Bronson is fabulous in this action movie set in North Canada in the early 30's. Besides the movie being decent when it comes to editing, directing etc,the two leading men are perfect in this hostile environment that the story is set in. . A must for every fan of a decent action flick. For Bronson fans it's obligatory!",
         "Charles Bronson has less than fifty words of dialogue in this film, since he spends most of it running through the snow on his own pursued by the mounties, but it is still one of his better films from the late seventies and early eighties era. He plays the real life character Albert Johnson, a fur trapper who killed some people in a dispute over dogs and went on the run in territory which had never been crossed during the ferocious Arctic winter. He successfully got away from them, despite the fact that they had many men, dogs and even an aeroplane to help them to track him down. This movie version is simple blood and thunder stuff, with a starry cast, some strong language and a handful of sparkling action sequences. It has weak points too, such as the wasted character played by Angie Dickinson, and a few slow patches in terms of pacing. However, when you think that Bronson was mainly working on such dross as The Evil That Men Do, Death Wish II, and Ten to Midnight at this point in his career, this is at least a slightly above-average film worthy of his rugged talents.",
         "Charles Bronson is an ex-patriot of the United States who travels to the Yukon to escape his past. He gets on the bad side of a group of trappers, kills one of them in self-defense, and is wrongfully accused of murder. Lee Marvin as a veteran Mountie, Carl Weathers, and fresh from training Mountie Andrew Stevens set out to track Bronson down as he tries to escape into Alaska. The acting in this film is sensational, the settings are true to life, and the story is riveting. A must see!",
         "A classic adventure, as aging Mountie Lee Marvin pursues aging goldminer Charles Bronson across the Arctic wilderness. Directed by the man responsible for what many people consider to be the best non-Sean Connery James Bond movie, ON HER MAJESTY'S SECRET SERVICE, and a hell of a cut above later Bronson fare like DEATH WISH 3 and THE EVIL THAT MEN DO. Frankly, one of Bronson's last decent films.",
         "From what I understand, although this film has it's story's basis in an actual crime spree and chase in 1930 Canada the details (including the deaths of the two star's historical characters) were changed. Instead, we are treated to a serious discussion on justice and survival in the Arctic circle. Charles Bronson is the \"mad\" trapper, Albert Johnson, who (in the film if not in actual history) stops a dog fight and precipitates (by this action) a rising tide of violence that aims at killing him. His actions annoy a bunch of yahoos in the Canadian frontier town who liked dog fights (or other violent or vile types of entertainment) and who are annoyed when Bronson keeps physically trouncing them. What they don't know is that he was in Canadian Special Forces in World War I, and that he has highest level defense and survival skills. In short, not only is he the man you least want to pick a fight with, but he is less likely to be easily catchable if you chase him. The local Mountie is Sgt. Edgar Millen (Lee Marvin) who appears to be unconventional. He is not seen dressed in traditional Mountie uniform - that's for Nelson Eddy in ROSE MARIE (which is set further south in Canada). A hard and rugged realist, Millen sets his police goals to bringing in his quarry for trial or for explanation of the facts. Bronson has killed a man in the confrontation over the dogfight, and the man's brutal friends (several of whom were beaten by Bronson) are sticking to a story that Bronson was the instigator of the incident. Due to small details Millen realizes that Bronson probably was the innocent party attacked by the yahoos, but he has to bring him in to explain what happened. Unfortunately Bronson does not trust the law - his father was a criminal, and recently died in a prison infirmary. Millen is accompanied by fellow Mountie Alvin Adams (Andrew Stevens) and \"Sundog\" Brown (Carl Weathers). Adams has just been assigned to the post, and has strange ideas about proper procedure and behavior for a Mountie (he'd fit in nicely next to Nelson Eddy) that Millen's realism in this environment just does not fit. Brown is a sensible type, and also represents a feature of frontier living that was not as readily available in \"civilized\" areas to the south: he's an African-Canadian, but Marvin accepts him as a sensible associate on his mission to catch Bronson. Although there are traces of racism in the film's characters, these are relatively understated in the frontier - every man proves his worth there by survival skills, not by the color of his skin. As the film progresses Bronson manages to outmaneuver all of Millen's attempts to catch him, although in some cases just barely. He also makes mincemeat out of the yahoos out to catch him for revenge or for a $1,000.00 reward posted by two individuals who wouldn't even try to go into the wilderness to catch him on their own. The irony of the title, of course, is that while the yahoos look at the hunt as the \"death\" hunt to cause Bronson's demise, in the end (as the death toll keeps rising) it is their deaths that make it a death hunt. Angie Dickinson appears in a couple of scenes as Millen's girlfriend, who wishes she could keep him home safe. I suspect her role was cut in the final film editing to concentrate on the chase sequences. Her scenes with Marvin give him a chance to show a sad adherence to duty that he could not just drop even if he wanted to. What remains helped fill out Millen's character, but I suspect more would have been filled out in other scenes with her. The actors supporting the lead roles are good, mostly playing knaves or fools of one sort or another. Henry Beckman as an ambiguous fur trapper who may or may not be helping Bronson is quite good, as is Scott Hylands as an arrogant Royal Canadian Air Force pilot who discovers (to his cost) that while he represents a mechanical future - that Millen wisely says he wants no part of - the wilderness is quite unforgiving to mechanical failure.",
         "With a lurid title like \"Death Hunt\" and lead actors like Charles Bronson and Lee Marvin, it would be easy to dismiss this film as just another shoot-'em-up run through the mill to capitalize on the marquee names (particularly Bronson). To do so, however, would be to overlook a well-made gem of an adventure film. The problem, of course, with most films of this ilk is that they offer a minimum set-up and characters and then set the guns a-blazin'. Not so here. The premise is established well, with Bronson as the noble loner and Marvin as the gruff, weary Canadian Mountie. The themes and plot devices are familiar, to be sure - the sense of honor, the anti-hero, the wet behind the ears rookie lawman, even a little bit of a love story. I had seen most of this film on cable and thought I understood it. Recently I rented it so I could finally see the first half hour and my feelings about it changed. Seeing the film from start to finish, I realized I had misjudged the intentions of the Marvin character. I thought the character was just another \"honorable to the point of dishonorable\" hero, when in fact he's a conflicted man. During the film, you can see that he knows he's as much responsible for what has happened, and he's not so much interested in \"doing the right thing\" as he is in covering his own rear end. I was surprised to see in the beginning that the film is set in 1931; it seems much like a Western. But then you realize that this was still a very isolated area and that, unlike the southwest, civilization hadn't quite caught up with this part of the world yet - particularly with lawmen like Marvin on duty. \"Death Hunt\" delivers all the goods. There is plenty of action and excitement, yet also a lot of substance as the story unfolds. It's a notch above most films of its kind. I enjoyed it so much that I'm considering adding it to my own DVD library, and I'd also like to learn more about the real story that it is based on.",
         "This Charles Bronson action vehicle isn't his best but it's not too bad either. Loosely based on a true story, Bronson plays a mountain man who, after rescuing an injured dog from a dogfight by buying it, is forced to defend himself from the previous owner and his men. After killing one of 'em, the Mounties (headed by Lee Marvin), and indeed all the men in the area (for reward of course), go on a death hunt for the guy, starting at his cabin and leading all over the snowy, mountainous terrain. Plenty of action ensues, including a great shot of Bronson rapidly firing off his pump shotgun at the guys. If you're a fan of the guy, you'll want to see this one.",
         "Death Hunt is relatively forgotten action film that was pretty entertaining even though Charles Bronson doesn't have that many lines, he really didn't have to in this movie. The great Lee Marvin and Andrew Stevens who you probably know from some Shannon Tweed films go hunting for Bronson in the biting cold Canadian winter with lots of action and overall a pretty good film, worth checking out if you can \"hunt\" it down somewhere."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Golden Harvest Company",
         "Northshore Investments Ltd."
      ],
      "summaries": ["Canada 1931: The unsociable trapper Johnson lives for himself in the ice-cold mountains near the Yukon river. During a visit in the town he witnesses a dog-fight. He interrupts the game and buys one of the dogs - almost dead already - for $200 against the owner's will. When the owner Hasel complains to Mountie Sergeant Millen, he refuses to take action. But then the loathing breeder and his friends accuse Johnson of murder. So Millen, although sympathetic, has to try to take him under arrest - but Johnson defends his freedom in every way possible."],
      "budget": 0
   },
   "movielensId": 5728,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-05-22",
      "dvdReleaseDate": "2005-01-25",
      "directors": ["Peter R. Hunt"],
      "runtime": 97,
      "movieId": 5728,
      "title": "Death Hunt",
      "mpaa": "R",
      "actors": [
         "Charles Bronson",
         "Lee Marvin",
         "Andrew Stevens",
         "Carl Weathers",
         "Ed Lauter",
         "Scott Hylands",
         "Angie Dickinson",
         "Maurice Kowalewski",
         "Henry Beckman",
         "William Sanderson",
         "Jon Cedar",
         "James O'Connell",
         "Len Lesser",
         "Richard Davalos",
         "Maury Chaykin",
         "August Schellenberg"
      ],
      "imdbMovieId": "0082247",
      "originalTitle": "Death Hunt",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "CX3gGRstwl8",
         "yzCjznfI7Ac"
      ],
      "plotSummary": "Canada 1931: The unsociable trapper Johnson lives for himself in the ice-cold mountains near the Yukon river. During a visit in the town he witnesses a dog-fight. He interrupts the game and buys one of the dogs - almost dead already - for $200 against the owner's will. When the owner Hasel complains to Mountie Sergeant Millen, he refuses to take action. But then the loathing breeder and his friends accuse Johnson of murder. So Millen, although sympathetic, has to try to take him under arrest - but Johnson defends his freedom in every way possible.",
      "tmdbMovieId": 26444,
      "avgRating": 3.15179,
      "releaseYear": "1981",
      "numRatings": 56,
      "posterPath": "/8DN3GxgDYV4yMRYWGVfzBY4xQdc.jpg"
   }
}