{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "punk",
            "id": 4470
         },
         {
            "name": "public sex",
            "id": 11512
         },
         {
            "name": "rebellious youth",
            "id": 15158
         },
         {
            "name": "girl band",
            "id": 164060
         },
         {
            "name": "female rocker",
            "id": 180201
         }
      ],
      "imdb_id": "tt0423382",
      "video": false,
      "title": "God Save the King",
      "recommendations": [
         5995,
         16076,
         52784,
         22471,
         44965,
         26436,
         11466,
         145271,
         33494,
         29822,
         35304,
         39749,
         37728,
         23654,
         29224
      ],
      "backdrop_path": "/68LVTZfDYx3qw0XuXuqduvHnnm6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Abra",
               "gender": 0,
               "credit_id": "52fe47a2c3a36847f81406a9",
               "name": "Josefin Neldén",
               "profile_path": null,
               "id": 142681,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Millan",
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406ad",
               "name": "Cecilia Wallin",
               "profile_path": null,
               "id": 142682,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Isa",
               "gender": 1,
               "credit_id": "52fe47a3c3a36847f81406b1",
               "name": "Malin Morgan",
               "profile_path": "/vn3EOwkExseW3Ry4cPf0YCTfk4z.jpg",
               "id": 142683,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Gloria",
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406f7",
               "name": "Johanna Strömberg",
               "profile_path": null,
               "id": 1089958,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Dickan",
               "gender": 2,
               "credit_id": "52fe47a3c3a36847f81406fb",
               "name": "Joel Kinnaman",
               "profile_path": "/aylKCZLLFuuT9OB5RyaTtNBr0kn.jpg",
               "id": 92404,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Lundström",
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406ff",
               "name": "Kjell Bergqvist",
               "profile_path": "/hMyP3jNP0CW5HHQOp3wJ57Bj8Oi.jpg",
               "id": 69645,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Stefan",
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f8140703",
               "name": "Morgan Alling",
               "profile_path": "/jV7pzlzwzntscnwywRE3cSB11lR.jpg",
               "id": 74928,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Leif",
               "gender": 2,
               "credit_id": "52fe47a3c3a36847f8140707",
               "name": "Ralph Carlsson",
               "profile_path": null,
               "id": 114580,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Piffen",
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f814070b",
               "name": "Markus Holmberg",
               "profile_path": null,
               "id": 1089959,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Bar-Jonny",
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f814070f",
               "name": "Fyr Thorwald",
               "profile_path": null,
               "id": 1089960,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406b7",
               "name": "Ulf Malmros",
               "profile_path": null,
               "id": 69646,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406bd",
               "name": "Britta Svensson",
               "profile_path": null,
               "id": 1089954,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406c3",
               "name": "Anna Fredriksson",
               "profile_path": null,
               "id": 569160,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406c9",
               "name": "Ulf Malmros",
               "profile_path": null,
               "id": 69646,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406cf",
               "name": "Lena Rehnberg",
               "profile_path": null,
               "id": 106653,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406d5",
               "name": "Ronald Meier",
               "profile_path": null,
               "id": 1089955,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406db",
               "name": "Mats Axby",
               "profile_path": null,
               "id": 1089956,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406e1",
               "name": "Jimmy Lagnefors",
               "profile_path": null,
               "id": 222479,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406e7",
               "name": "Ulf Malmros",
               "profile_path": null,
               "id": 69646,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406ed",
               "name": "Tomas Eskilsson",
               "profile_path": null,
               "id": 57016,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a3c3a36847f81406f3",
               "name": "Bo Thörnwall",
               "profile_path": null,
               "id": 1089957,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.214917,
      "production_countries": [{
         "iso_3166_1": "SE",
         "name": "Sweden"
      }],
      "id": 49717,
      "vote_count": 9,
      "budget": 0,
      "overview": "A story about a young girl who leaves her hometown to pursue her dream of becoming a famous punk artist.",
      "similar": [
         29657,
         191294,
         2011,
         13553,
         24616,
         75785,
         137563,
         21137,
         16018,
         514038,
         26574,
         36746,
         34380,
         266095,
         314010,
         500746,
         376084,
         453390,
         42082,
         34329
      ],
      "original_title": "Tjenare Kungen",
      "runtime": 94,
      "poster_path": "/73i1pbvmxbqadAZCNP1aXxLZ3VE.jpg",
      "spoken_languages": [{
         "name": "svenska",
         "iso_639_1": "sv"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kanal 5",
            "id": 17540,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film i Väst",
            "id": 6417,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sandrew Metronome Distribution",
            "id": 6690,
            "origin_country": ""
         }
      ],
      "release_date": "2005-09-16",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ulf Malmros"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Anna Fredriksson",
         "Ulf Malmros"
      ],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0423382/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxNzcxMTg5MF5BMl5BanBnXkFtZTcwNzYxOTI0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Josefin Neldén, Cecilia Wallin, Malin Morgan | See full cast and crew »"],
      "reviews": [
         "If you are familiar with Ulf Malmros' previous works, you know that a stylish movie about music and set in the 80s, is just up his alley. Malmros is without doubt Sweden's best director when it comes to using music to create mood. For Tjenare Kungen, he has been given an historically big budget to buy tunes for. The result is - of course - as good as anyone could have hoped. With everything from Alphaville to Thåström, Tjenare Kungen swiftly transfers us back to 1984. The entire movie is in fact an orgy in everything that made the 80s so special (?). A lot of time has been put into little - but oh so important - details like clothes and hair-cuts. As with Smala Sussie, Ulf Malmros has once again found a bunch of very talented debutants. Josefin Neldén (Abra) and Cecilia Wallin (Millan) are both extremely believable and lovable as the two girls forming a punk band. When you leave the theatre, it is impossible not to have a little crush on Abra. Tjenare Kungen is not ground-breaking in any way. It is a simple story that follows a formula proved to be good. It is not as heart-warmening as Den bästa sommaren, and the dialogue isn't as quirky and hilarious as in Smala Sussie. However, when you leave the theatre, you do it with a big smile on your lips. Knowing that you have just had one of your best cinematic moments this year.",
         "I bought this movie sight unseen and was pleasantly surprised. While it's storyline is similar to something like \"The Secret of My Success\" (small town person with ambition finds a life and success in the big city) and it's nostalgia factor is reminiscent of \"The Wedding Singer\", it manages to be warmer, more charming and ultimately more memorable than either of those films. Furthermore, the soundtrack is just great. Alphaville, Roxy Music, ELO - and new songs by the lead character's band that are good enough to coax me into sending away for the CD. It's a shame this hasn't made it to the U.S. I think it would do well here, despite the small inclusion of a few Swedish particulars that might need some quick explaining for some (particularly references to Sweden's social support system) and quick shot of a guy's weener - uptight folks can't handle that here. It also has a very American feel to it - and it's nice to see that we're one of many cultures that regrets some of its fashion choices in the past decades. Distributors! Pick this one up! It's got hit written all over it!",
         "It is 1984 and Abra is 19 years old and tired of the small village she lives in. However, events take her to the big town Gothenburg and adventures. The movie is charming and the characters sympathetic. For us who where teenagers in the mid 80's the movie is a journey back in time. All the groupings are there; punk-rockers, synthers, hard-rockers... and the soundtrack contains lots of representative music. The actors are all new faces in Swedish film and make a terrific job. Malmros has as always succeeded well with direction and camera. This is a true feel-good movie. Trivia: At the premiere in Gothenburg, the director Ulf Malmros was knocked down by a man who thought he had stood model for the nasty barman in the movie.",
         "The liberating power of rock'n'roll music has been the source of inspiration for many movies ever since its birth in the 1950s. Films like Almost Famous (2000), The School of Rock (2003) and That Thing You Do! (1996) can be named as English-language examples of rock movies but Sweden has produced its own stories on the subject as well. To name two, Ulf Malmros' 2005 punk rock tale Tjenare kungen (a.k.a. God Save the King) makes a very nice companion piece to Reza Bagher's 2004 film adaptation of the novel Populärmusik från Vittula (a.k.a. Popular Music) that also dealt with small town kids' desire to spread their wings through music. The story, based on a 2001 novel by Britta Svensson, is set in 1984. Punk rocker girl Abra (Josefin Neldén) lives in a small town and dreams of becoming a rock star but the town's narrow-minded atmosphere is hard for rebels like her. After meeting a fellow rock fan Millan (Cecilia Wallin), Abra moves to Gothenburg and starts a band called Tjenare Kungen (\"Hello King\") with her but nothing comes easy for the would-be rock stars: finding members for the band in an era when punk rock has gone out of fashion to make way for synth pop and glam rock, putting up with an uptight boss at a sausage factory, sorting out romantic feelings towards a handsome guy named Dickan (Joel Kinnaman)... It can be imagined that the project has been a nostalgic one for the director Ulf Malmros who was in his late teens during the film's era. Perhaps this is why the 1980s atmosphere is so pleasantly recreated in the story: punk, rock and pop hits of the time are constantly playing, the fashion is flashy and hairstyles are as unappealing as expected. Still, everything is photographed with sunny, warm brightness that makes the film visually very pretty and youthful. The main actresses Neldén and Wallin look so cute in their roles that they can only be loved but Johanna Strömberg and Malin Morgan do their parts decently too as the self-declared fashion designer-keyboardist Gloria and the experienced older rocker chick Isa respectively. The latter is also the only significant adult character in the story; otherwise the perspective belongs entirely to the young to whom grown-ups are nothing but dead weight. The plot is nothing strikingly original or imaginative: questions of selling out, romantic shyness, triangle drama and temporarily falling out with one's best friend are all ordinary youth flick material and would not carry the film far if it was not for the sympathetic young actors. Some scenes struck me as particularly clichéd; namely, the wedding gig (yeah, right) and the big finale (seriously, who didn't guess right away what the climax would be?). The brief saxophone jam scene was hilarious though, precisely because it was cut so short with perfect comic timing. Regarding Nordic peers of Malmros' film, an obvious comparison can be made to one of my favourite Finnish movies Pitkä kuuma kesä (1999), although TK focuses on girls instead of guys and stays more clean-cut with much less alcohol use and bad language. Anyway, all things considered, Tjenare kungen is definitely an entertaining, fun and even delightful little movie, easily worth a look especially by fans of the music and fashion of the 1980s.",
         "I liked this movie and I found the actors/actress and the plot to be great. OK, it really brings back the memories of my own youth (14 and a punk back in 1984) but yet I'm trying to be objective. Great to see new good actors/actress and I hope to see most of them in the future (well I guess that Kjell will always find his way into your living room ? ..). A movie about teenagers may easily stumble in a lot of \"klyshor\" (translate that one for me??) but I think this movie held them off in a great way. Check it out.. What? 10 lines required... huh, what, am I writing a novel or what? Well, the movies surroundings and props are correct and accurate for the 80s and its always great to see an authentic \"hocky frilla\".",
         "The plot is simple; Abra lives in a small town not to far away of Gothenburg. She has a punk band and her dream is to release a single and become famous. The band splits up after a member of the bands boyfriend abuses Abra. On a concert in her village she meets Millan a stage re-arranger (roddare). After an unfortunate event she escapes with the band and lies about that she really lives in Gothenburg. But in some miraculous way they believe in her. She lies about some other things and gets to live with Millan. They start a band together and their goal is to release a single before Christmas. The year is 1984 The movie has a great soundtrack with old Punk songs. And the camera shots are amazing. One thing that I really hated about the movie was that the movie is as Swedish as a Swedish movie can be. When something is supposed to be sexy and in sex scenes we always see one of the woman's breast and the movie has a sugar sweet ending Malmros has done a great movie but a bit to Swedish and a too simple plot.",
         "And with that I mean, I sat in a theater watching this movie, and within 10 minutes I was ready to leave, I don't know, I just couldn't relate at all with the story... The real confoundment came to me when leaving the theater (To this date, I have never walked out on a movie for better or worse) and my friends totally loved it. It was like I was watching some other movie altogether... Don't get me wrong with saying that and giving it a 3... I just think that I wasn't intended as part of the audience, because yes, it's beautifully shot. Yes it contain a bunch of exceptional characters, yes, it has some hilarious scenes and all that but the story never connected to me... I don't know, I just honestly don't know. It could be that all of the pal's that was at the theater had a background as struggling garage-bands. I didn't. You might love it... This all got to me as a surprise. I totally loved Malmros's last film, Smala Sussie, which had a wacky plot about movie-lovers/makers, a category of people that I feel included of, and I think I now can say that those that didn't love Smala Sussie probably was in the same seat as I am with this picture... I just don't get it. To me it was a movie about a struggling band with far too much Moodysson (a filmmaker that I never understood the greatness of) thrown in it... It's a shame and pity... I wanted to love it, but in the long run didn't care when the credits rolled...",
         "(r#67) Sorry, but I couldn't enjoy this... at all. The plot went on and on with no focus whatsoever. Whenever it seemed that the movie was going to end, our female lead Abra went into another fit of rage or had a mental breakdown. Ultimately this became insulting to the audience's intelligence as the plot was quite obviously deliberately drawn out and contrived. The subplot about the evil manager of the sausage company lead absolutely no where, and the acting left a *lot* to be desired. The movie is just too pointless and emotionally devoid to be memorable. It is probably not among the worst of all time, or even in the same ballpark, but it's definitely not worth spending money on. I'm going to be fair and say I enjoyed director Ulf Malmros's earlier outing, \"Den Bästa Sommaren\" from 2000, but this just wasn't up to par. Avoid.",
         "This must be one of the worst movies from 2005 in Sweden, bad actress/actors, a lousy and very predictable script makes this movie so boring I can't find words. The only good thing I found to be of a positive thing, was the music, which makes you remember the 80's, but other from that, there wasn't anything in it for me. From 10 minutes in to the movie, you've already figured out how it's going to end. I also mentioned the actresses/actors being bad, I got that feeling where you're pi*sed off at them, thinking, no, that's not how you behaved during that era plus their performances aren't convincing on any plan. No, this is not a movie I can recommend, you'll find more substance in a Chuck Norris movie than this crap, don't rent/buy this movie!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Kanal 5",
         "Sandrews"
      ],
      "summaries": ["A story about a young girl who leaves her hometown to pursue her dream of becoming a famous punk artist."],
      "budget": 0
   },
   "movielensId": 57291,
   "movielens": {
      "languages": ["svenska"],
      "releaseDate": "2005-09-16",
      "dvdReleaseDate": null,
      "directors": ["Ulf Malmros"],
      "runtime": 94,
      "movieId": 57291,
      "title": "God Save the King",
      "mpaa": null,
      "actors": [
         "Josefin Neldén",
         "Cecilia Wallin",
         "Malin Morgan",
         "Johanna Strömberg",
         "Joel Kinnaman",
         "Kjell Bergqvist",
         "Morgan Alling",
         "Ralph Carlsson",
         "Markus Holmberg",
         "Fyr Thorwald"
      ],
      "imdbMovieId": "0423382",
      "originalTitle": "Tjenare Kungen",
      "genres": [
         "Comedy",
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["eKkjeBQXcAc"],
      "plotSummary": "A story about a young girl who leaves her hometown to pursue her dream of becoming a famous punk artist.",
      "tmdbMovieId": 49717,
      "avgRating": 3,
      "releaseYear": "2005",
      "numRatings": 9,
      "posterPath": "/73i1pbvmxbqadAZCNP1aXxLZ3VE.jpg"
   }
}