{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "scotland",
            "id": 388
         },
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "allied",
            "id": 5300
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "u boat",
            "id": 156217
         }
      ],
      "imdb_id": "tt0082351",
      "video": false,
      "title": "Eye of the Needle",
      "recommendations": [
         26578,
         40630,
         19740,
         7010,
         219575,
         50425,
         30278,
         53229,
         4909,
         20540,
         22828,
         11935,
         19621,
         31618,
         4918,
         10002,
         36576,
         17657,
         48864,
         32059
      ],
      "backdrop_path": "/fc8RbiXCNlDygHuOhwa3PXVRtZp.jpg",
      "revenue": 18000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Henry Faber",
               "gender": 2,
               "credit_id": "52fe43c59251416c7501d91b",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lucy Rose",
               "gender": 1,
               "credit_id": "52fe43c69251416c7501d91f",
               "name": "Kate Nelligan",
               "profile_path": "/4GpQvniLNMKF19qtHMb0tBBgNce.jpg",
               "id": 18794,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lieutenant",
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d923",
               "name": "Stephen MacKenna",
               "profile_path": "/lmFHUUCgHZbgxgQVV1x48AbBuLc.jpg",
               "id": 67566,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "David Rose",
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d927",
               "name": "Christopher Cazenove",
               "profile_path": "/sck3PP8PepiasZ4gZ19PE5FBXQZ.jpg",
               "id": 67567,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Billy Parkin",
               "gender": 0,
               "credit_id": "52fe43c69251416c7501d943",
               "name": "Philip Martin Brown",
               "profile_path": "/624lOsRpzEdippiIUBDMijEGAx9.jpg",
               "id": 26857,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Inspector Godliman",
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d947",
               "name": "Ian Bannen",
               "profile_path": "/o1M55VhFgRimGz9cNjadt8fWlXE.jpg",
               "id": 2481,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lucy's Father",
               "gender": 0,
               "credit_id": "52fe43c69251416c7501d94b",
               "name": "George Belbin",
               "profile_path": null,
               "id": 139690,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Lucy's Mother",
               "gender": 1,
               "credit_id": "52fe43c69251416c7501d94f",
               "name": "Faith Brook",
               "profile_path": "/vKejvmwvtmuROMoflpBGHxmAWi5.jpg",
               "id": 27281,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "David's Mother",
               "gender": 0,
               "credit_id": "52fe43c69251416c7501d953",
               "name": "Barbara Graley",
               "profile_path": null,
               "id": 1203246,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Constable",
               "gender": 0,
               "credit_id": "52fe43c69251416c7501d957",
               "name": "George Lee",
               "profile_path": null,
               "id": 83078,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Peterson",
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d95b",
               "name": "Arthur Lovegrove",
               "profile_path": null,
               "id": 1203248,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Oliphant",
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d95f",
               "name": "Colin Rix",
               "profile_path": null,
               "id": 982412,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Mrs. Garden",
               "gender": 1,
               "credit_id": "52fe43c69251416c7501d963",
               "name": "Barbara Ewing",
               "profile_path": "/cBKVLle2SFM5Uk6DEZZt2PfsYGJ.jpg",
               "id": 940044,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d92d",
               "name": "Stanley Mann",
               "profile_path": null,
               "id": 58180,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d933",
               "name": "Richard Marquand",
               "profile_path": "/wuO69rNp2mMG9unvRpZhbccoAh9.jpg",
               "id": 19800,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d939",
               "name": "Alan Hume",
               "profile_path": null,
               "id": 8934,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43c69251416c7501d93f",
               "name": "Miklós Rózsa",
               "profile_path": "/1eAU1ckh7SUNMP9IZeii9qX5xa.jpg",
               "id": 7647,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "534c1a030e0a2629dd002264",
               "name": "Ken Follett",
               "profile_path": null,
               "id": 149277,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "534c1a0e0e0a2640b6003855",
               "name": "Stephen J. Friedman",
               "profile_path": null,
               "id": 66082,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "534c1a1b0e0a2640bc003368",
               "name": "Sean Barton",
               "profile_path": null,
               "id": 64876,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "534c1a230e0a2640c5003615",
               "name": "Celestia Fox",
               "profile_path": null,
               "id": 970,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "534c1a2c0e0a2640cb003894",
               "name": "Wilfred Shingleton",
               "profile_path": null,
               "id": 6605,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "534c1a340e0a2640bf0037df",
               "name": "Bert Davey",
               "profile_path": null,
               "id": 10183,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "534c1a3e0e0a2629dd00226b",
               "name": "John Hoesli",
               "profile_path": null,
               "id": 957776,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "534c1a460e0a2629dd00226e",
               "name": "Hugh Scaife",
               "profile_path": null,
               "id": 1049695,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "534c1a4f0e0a2640b600385f",
               "name": "John Bloomfield",
               "profile_path": null,
               "id": 7793,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.977126,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 10863,
      "vote_count": 61,
      "budget": 0,
      "overview": "A ruthless German spy, trying to get out of Britain with vital information about D-Day, must spend time with a young woman and her crippled husband.",
      "similar": [
         369885,
         228150,
         303,
         1771,
         16869,
         2253,
         5925,
         36669,
         49517,
         289,
         387,
         954,
         2502,
         339259,
         27576,
         1251,
         853,
         857,
         424,
         203833
      ],
      "original_title": "Eye of the Needle",
      "runtime": 112,
      "poster_path": "/qunJ4O5C4oHxfOjZUWTFKKAatlJ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Kings Road Entertainment",
         "id": 4255,
         "origin_country": ""
      }],
      "release_date": "1981-07-24",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Richard Marquand"],
      "runtime": 112,
      "synopsis": "A man calling himself Henry Faber (Donald Sutherland) is actually \"the Needle,\" a German spy in England during World War II. The Needle dropped out of sight in Germany in 1938 and now inhabits a series of drab bed-sitting-rooms in England while he spies on the British war effort. He is known as the Needle because of his trademarked way of killing people by jabbing a stiletto into their rib cages. He kills with a singular lack of passion, and will kill even the most innocent of bystanders if he thinks they might somehow threaten his objective, or just get in the way. The Needle is a very lonely man. He was raised by parents who did not love him, he was shipped off to boarding schools, and he spent parts of his childhood in America, where he learned English. Perhaps none of these experiences fully explains his isolation and ruthlessness, but maybe it's just part of being a spy. The Needle manages to remain in Britain until the eve of D-Day in 1944, when he learns that the D-Day invasion is to take place on Normandy, and he discovers phony plywood \"airplanes\" intended to look, from the air, like Patton's invasion force, but it's a ruse to throw off the Germans. Hitler has summoned Faber to come brief him about the Allied invasion plans in person. In his attempt to return to Germany with the information, the Needle travels by boat to an area off the coast of Scotland, intending to rendezvous with a German U-boat, but a fierce storm strands him on the nearby Storm Island. Storm Island is isolated and occupied only by a lighthouse-keeper and by a young married couple, a woman (Kate Nelligan), her partially paralyzed husband David (Christopher Cazenove), their son, and their shepherd, Tom. Lucy is frustrated, mired in a loveless marriage with her emotionally damaged husband. David had been a Royal Air Force commander, but he was paralyzed as a result of an automobile accident on their wedding day. The Needle pretends to be merely a lost sailor. And Lucy, frustrated by her husband's drunkenness and refusal to love, becomes attracted to him. They make love. She grows fond of him. It's not clear if he's fond of her, but he tells her things he has told to no one else. The love affair suggests there's a sympathetic personality buried somewhere inside the Nazi spy, though he remains enigmatic. Early on, we discover that he may not enjoy the hand life has dealt him. When a courier asks him about the way he lives, and \"What else can one do?\" the Needle answers, \"One can just stop.\" The Needle kills David and the lighthouse-keeper. Lucy realizes that her lover has been lying to her after she discovers David's body, and she prepares to turn him in. The Needle must get to the only radio on the island in time to report to his superiors the exact location of the D-Day invasion. Lucy is the Allies' last chance to keep the details secret. Tension mounts as the Needle races against time to make contact with the U-boat and/or stop Nelligan before she blows the whistle on him. The Needle threatens Lucy, first in a psychological way and then with violence. \"The war has come down to the two of us,\" Sutherland tells Nelligan, as they struggle with what they should do. Nelligan isn't sure if Faber is a treacherous spy or an unloved child, but in the end, she shoots him as he tries to escape in a boat.",
      "writers": [
         "Ken Follett",
         "Stanley Mann"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082351/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0ODExMDA3M15BMl5BanBnXkFtZTcwMjYyMzcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Donald Sutherland, Kate Nelligan, Stephen MacKenna | See full cast and crew »"],
      "reviews": [
         "This film about a German agent trying to escape from Britain might seem to offer limited scope for interest, but Sutherland's menacing performance and the events on the island turn it into something approaching a study in psychopathy, laden with uncertainty and fear. The vulnerability of Lucy (Kate Nelligan, a sensitive and intelligent but definitely pre-feminist woman helps to give the film an added poignancy. Sutherland's performance is such that we are always fascinated by the damaged and ruthless character he portrays. Those who dislike war films may find themselves surprised by this film.",
         "Donald Sutherland is superb as \"The Needle\", a Nazi spy pursued by the British government during World War II. Circumstances land him on Storm Island, a small, wind-swept patch of land off the English coast. There he falls in love with the sensual Kate Nelligan, the unhappy, lonely wife of a crippled war vet. The late Richard Marquand's second feature film is a gripping, suspenseful wartime drama about doomed love. The blazing glow of this film is enhanced by sizzling yet subtle scenes of lovemaking and a stunning Miklos Rosza score. The island vistas are breathtaking and Alan Hulme's pictures are rich and moody.",
         "Eye of the Needle is an oddly structured but nonetheless extremely effective film which in many ways is quite old fashioned in tone and feel,with the addition of a little 'modern'sex and violence. For almost the first half,the film is a fairly conventional but quite gripping spy thriller,as a German agent causes havoc in World War 2 England. There are few surprises,but Donald Sutherland is mesmerising to watch {even if his accent wavers} and the plot at least sounds almost plausible. The keen eyed,however,may spot mistakes in the period detail. Then Sutherland is washed up on a Scottish island inhabited by a crippled man and his frustrated wife,and the film changes into an incredibly tense mixture of romance and thrills. Sutherland and Nelligan's affair may be basically sexual,but there is real chemistry between them and a real sense of desperation,of two lonely people throwing themselves together. The last half hour is real edge-of-the-seat stuff,perhaps almost bordering on psycho-thriller,but it really works. Throughout the film Sutherland remains the villain and does do some nasty things,but it's a measure of his performance that occasionally we do come close to sympathising with him. Acting-wise though the film really belongs to Nelligan,a tragically underused and beautiful actress who has to go through the motions of loneliness and frustration,than lust,then fear,and eventually heroism,and does so superbly. Aided tremendously by the last ever score from the legendary film composer Miklos Rozsa,who provides a moving love theme and some especially thrilling music for the last section of the film,Eye of the Needle perhaps shouldn't really work as well at it does,but that's a measure of it's quality.",
         "Sutherland was never darker or slicker, Kate Nelligan was never more heroic or attractive, and the outcome of World War Two was never so thoroughly in doubt. Suspenseful all the way, this movie convinces us that the Allied-Axis struggle was determined by the violent, romantic interplay among five people on a storm-tossed British isle. See it!",
         "Director Richard Marquand and all the crew involved brought us a memorable film that keeps us on the edge of our seat from the beginning to the very last minute. The story follows a Nazi spy named Henry Faber (an extremely vicious Donald Sutherland), also known by his code name \"The Needle\", who is on to an important information about the Allies invasion plan to Europe during WW2 and might cause a disaster if he gets with that information to Berlin. Kate Nelligan gives a perfect performance as the naive Lucy who gets involved with the dangerous Henry Faber. Adopted from Ken Follet's novel, The film successfully keeps the tension on high level in just about every scene. The film is shot in a remarkably beautiful locations in Europe and really captures the alienated atmosphere during WW2. All in all this is a perfect film that shouldn't be missed by anyone who is looking for a powerful and memorable experience. This one is highly recommended 10/10.",
         "This film really does deserve more merit than it seems to get. Sutherland is a bit odd, with most of all a bizarre accent that almost seems to change from scene to scene. Whilst this is perhaps expected from an international spy in deep cover, it doesn't seem to sit well. Nelligan steals the show with a wonderful performance, but the real surprise for me was Cazenove. It doesn't take a lot of imagination to see him as the newly qualified, sparkling eyed flyboy, but his portrayal of the embittered, loveless amputee was a joy to watch - clearly a talented man. The film wraps up a great story with wonderful acting, a great collection of WW2 military hardware and breathtaking scenery. Well worth a watch.",
         "So, at first I had trouble deciding if this film was great or just another war film that would be forgotten about as the years progressed. It was a tough decision that required a day of thought. There were definitely scenes in this film that would embarrass even the most novice movie goer, yet there is something about the story and the humanistic approach to a non-human element that seeps from this film's pores. The scene that stands out the most in my mind is when Sutherland is running to the rain to catch Lucy. You can obviously tell that he is on a sound stage and water is being thrown in his face. His acting and the way that that particular scene was set up was appalling. It made me laugh instead of feel any sort of suspense or fear. It forced credibility for Sutherland's character right out the door. There were several other scenes that just didn't seem to fit in this film that made you question the theatrical release of this film or if it was a straight-to-television production. If you can get through these few lapses in the director's train of thought, then you will be able to see the powerful story that lies within. When I first saw the box to this film I didn't know what to expect. To my utter enjoyment, Eye of the Needle is one of those gems hiding in a mud puddle. After you wipe it off (look away from the DVD cover), you will begin to see the beauty of this film. As we begin our story, we see Sutherland as a normal person, but as the film advances, our idea and interpretation of his character blows our mind. When most war films simply believe in keeping you in your theater seats by showing graphic images of battle and chaos, this film goes in the completely other direction. This is a story between two people and the small battle that they fight for their beliefs. I mentioned earlier that I felt this was a very humanistic film. The reason for that statement is because we witness the human element to war. Billy is the perfect example of a man who has lost a portion of his life, yet is too depressed to see the happiness in front of him. Normally in war films this comes late story, but in Eye of the Needle it is shown right up front. Next, we hardly ever are given a very human side to the villain in these stories. Normally, they kill without remorse, but again, not in this film. What we witness are two humans caught between a hard place with nobody else to turn to. While war is being raged overseas with thousands of troopers, it is impressive to see stories like this that revolve around just two people. These two people can have the same effect on the war as a brigade of soldiers. I never saw their reaction to each other coming. I wasn't expecting a message in this film. I brief history lesson about the day to day activities surrounding this dark cloud of our world's history. Also, I wasn't expecting to see such powerful acting from Donald Sutherland and Kate Nelligan. Together they created more sparks on screen than most duos today. What they create is better and more realistic than most Hollywood jargon. It is impressive to see this in a war film. I cannot stress that enough. This film surprised me and I am normally not a huge war fan. I think the reason that it stood out was because director Richard Marquand develops two amazing characters and places them in a war torn country, only to uproot them again into a place of beauty and nature. We go from one spectrum to the next with Marquand and it works. Ken Follett, who wrote the novel that this film is based, has done a great job of taking a world that is huge and bringing it down to just these two characters. It is not often that you see that in a war film, especially one made in 1981. Overall, I flip-flopped my decision all around until I finally made a choice. This film was amazing. I can look past the low-budgeted scenes that make this film dated in the 80s, and see the amazing truth behind the characters and story. This is one of the most impressive stories that I have seen come from Hollywood. I could literally watch this film again and probably catch more that I missed the first time. This isn't your average spy film; this is instead a film about humans and the comfort we need in our lives. Also, I must end with this note, if any villain (without saying who) can use his trademark kill six times in forty minutes, you should realize that this film is going to be a great ride. Grade: **** out of *****",
         "I am satisfied with EYE OF THE NEEDLE. There are many plots and twists without great special effects or action. Anyway, the film shows a spy story set in the second World War and that is well directed. The picture and camera work is not as perfect as in today's big blockbusters but it doesn't shock because it is well compensated with historical details and facts from that war time. It's interesting seeing Donald Sutherland in this role as a lover and villain. He is for me one of the great actors that made many enjoyable thrillers. All in all a watchable movie that has a better class than these disappointing thrillers of nowadays and once again a DVD from the house of MGM that works for an entertaining Saturday evening. My wife and me vote 7/10 that matches exactly the actual vote of 7/10.",
         "Eye of the Needle is based on historical fact - the allies deceived the Germans into thinking that the D-Day invasion would take place at Calais rather than Normandy by assembling a dummy military force in Kent (not East Anglia as in the film). However, the intelligence and counter-intelligence manoeuvres that took place in maintaining this deception were rather more complex than in this simplistic movie. The best part of the film is the culminating love affair on a remote Scottish island between the murderous German spy, Faber (Donald Sutherland), and the sexually frustrated Lucy (Kate Nelligan), which is credible and convincingly portrayed. Sutherland also has a few good scenes in the earlier parts of the movie, though certainly not the opening sequence with his curious accent and ludicrously stiff one-handed cycling! But most of the other characters are cardboard stereotypes, and the dialogue would not have been out of place in a 1930s B picture. (In particular, Ian Bannen as an MI5 sleuth makes the least of some especially ludicrous lines.)",
         "This is a great WW2 movie with a sub-plot of love between an isolated woman and an enemy spy, played by Donald Sutherland. The real star of the show is the extremely beautiful Kate Nelligan who falls in love with German spy \"Die Nadel\" or \"The Needle\". he kills everything that gets in his way. In the earlier part of the film, he discovers that the equipment set up for the invasion of Calais, tanks, landing craft, jeeps etc is all fake, and must convey this to Amiral Canaris in the Abwehr. The most interesting part of the movie is that although he is totally ruthless, he will not kill Lucy, played by Kate. This is most odd since she is hell bent on killing him with shotguns, axes, revolvers, in fact anything she can get her hands on. Here is a man with the greatest secret of the war, a German patriot, who lets a small woman stop him. He could have killed her and helped the Germans defeat the Yanks in D-Day about 10 times over. Although the story is completely unbelievable, it is excellently written. The acting displays of the main cast of Casenove, Sutherland and Nelligan is very good, with Nelligan giving a convincing performance. 10/10"
      ],
      "genres": [
         "Romance",
         "Thriller",
         "War"
      ],
      "productionCompanies": ["Kings Road Entertainment"],
      "summaries": [
         "A German spy carrying information that will reveal the target of Operation Overlord becomes involved with the wife of a crippled man on an isolated island off the Scottish coast while he waits to be picked up.",
         "WWII German superspy, the Needle, who gravitates towards murder using his trusty switchblade, discovers vital evidence about the Allies D-Day invasion. He makes for the Scotish coast to escape on a U-Boat when his small boat is shipwrecked before being picked up and the Needle is washed ashore. He is saved by a man destined to never enter the war and his wife and child. The Needle quickly falls in love with the woman and both must decide between their love or country.",
         "A ruthless German spy, trying to get out of Britain with vital information about D-Day, must spend time with a young woman and her crippled husband."
      ],
      "budget": 0
   },
   "movielensId": 5732,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1981-07-24",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Richard Marquand"],
      "runtime": 112,
      "movieId": 5732,
      "title": "Eye of the Needle",
      "mpaa": "",
      "actors": [
         "Donald Sutherland",
         "Kate Nelligan",
         "Stephen MacKenna",
         "Christopher Cazenove",
         "Philip Martin Brown",
         "Ian Bannen",
         "George Belbin",
         "Faith Brook",
         "Barbara Graley",
         "George Lee",
         "Arthur Lovegrove",
         "Colin Rix",
         "Barbara Ewing"
      ],
      "imdbMovieId": "0082351",
      "originalTitle": "Eye of the Needle",
      "genres": [
         "Action",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["jVJSsRJhs5U"],
      "plotSummary": "A ruthless German spy, trying to get out of Britain with vital information about D-Day, must spend time with a young woman and her crippled husband.",
      "tmdbMovieId": 10863,
      "avgRating": 3.6875,
      "releaseYear": "1981",
      "numRatings": 416,
      "posterPath": "/qunJ4O5C4oHxfOjZUWTFKKAatlJ.jpg"
   }
}