{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "washington d.c.",
            "id": 521
         },
         {
            "name": "judge",
            "id": 934
         },
         {
            "name": "law",
            "id": 3703
         },
         {
            "name": "supreme court",
            "id": 8681
         },
         {
            "name": "judiciary",
            "id": 207968
         }
      ],
      "imdb_id": "tt0082382",
      "video": false,
      "title": "First Monday in October",
      "recommendations": [],
      "backdrop_path": "/w0MLU2GtCs59DmmFTq6T02nEAmI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dan Snow",
               "gender": 2,
               "credit_id": "52fe49229251416c910a3bdd",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ruth Loomis",
               "gender": 1,
               "credit_id": "52fe49229251416c910a3be1",
               "name": "Jill Clayburgh",
               "profile_path": "/twrfhIvbqHuJ7nXVpehvU6nyi6R.jpg",
               "id": 20362,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chief Justice James Jefferson Crawford",
               "gender": 2,
               "credit_id": "532183979251411f7e002ca3",
               "name": "Barnard Hughes",
               "profile_path": "/jvHz3TjqROc3Wixeq6dbFBas3EB.jpg",
               "id": 2549,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Christine Snow",
               "gender": 1,
               "credit_id": "532183a29251411f8c002aed",
               "name": "Jan Sterling",
               "profile_path": "/eeWVkgt1f4xjzhrei6ctkkSGdb4.jpg",
               "id": 20418,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mason Woods",
               "gender": 2,
               "credit_id": "532183af9251411f85002d4f",
               "name": "James Stephens",
               "profile_path": "/sF63niH94tbYASqzdDfFoM70ZaM.jpg",
               "id": 21376,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bill Russell",
               "gender": 2,
               "credit_id": "544a5cddc3a3680fae0040aa",
               "name": "Joshua Bryant",
               "profile_path": "/vrqljEgbLw5nZOHFQO2LOBxDUvH.jpg",
               "id": 119854,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49229251416c910a3be7",
               "name": "Ronald Neame",
               "profile_path": "/6ET8GlWzxTkQu5sEH24I0UZ6IrG.jpg",
               "id": 7501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "544a5cb10e0a26748f004002",
               "name": "Robert E. Lee",
               "profile_path": null,
               "id": 223766,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "544a5cb7c3a3680fb8004208",
               "name": "Robert E. Lee",
               "profile_path": null,
               "id": 223766,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "544a5cc70e0a26748c00405e",
               "name": "Jerome Lawrence",
               "profile_path": null,
               "id": 223765,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "544a5cccc3a3680fbb00393a",
               "name": "Jerome Lawrence",
               "profile_path": null,
               "id": 223765,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5807dc229251415a4d0038de",
               "name": "Fred J. Koenekamp",
               "profile_path": "/yxTbBWproHj24o8yrTLEjtzlF9u.jpg",
               "id": 19102,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5807dc2892514162d70074ba",
               "name": "Peter E. Berger",
               "profile_path": null,
               "id": 2033,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5807dc429251415dfb003af4",
               "name": "Philip M. Jefferies",
               "profile_path": null,
               "id": 8883,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5807dc5292514162d70074d4",
               "name": "John V. Cartwright",
               "profile_path": null,
               "id": 1696937,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.544251,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85058,
      "vote_count": 5,
      "budget": 0,
      "overview": "For the first time in history a woman is appointed to the U.S. Supreme Court, where she becomes a friendly rival to a liberal associate.",
      "similar": [
         9800,
         389,
         314365,
         392982,
         12219,
         1645,
         93,
         9798,
         50348,
         205587,
         396371,
         49049,
         10327,
         37233,
         2642,
         59,
         1574,
         1592,
         19908,
         11679
      ],
      "original_title": "First Monday in October",
      "runtime": 98,
      "poster_path": "/zuXYI2FZJwyYRMSdkhC44Z6FvTE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1981-08-21",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "In the Supreme Court, there are only eight of them against all of her.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ronald Neame"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Jerome Lawrence",
         "Jerome Lawrence"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082382/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MzYyMDg1MV5BMl5BanBnXkFtZTcwNjcxODUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Walter Matthau, Jill Clayburgh, Barnard Hughes | See full cast and crew »"],
      "reviews": [
         "Clayburgh did a fantastic job of balancing Matthau's usual strong performance. The two struck a rapport that I never expected, and they ran off with the movie. I gave it an 8 instead of a 10 mostly because the script and cast couldn't keep up with them. Also, they have some weak spots when they go for light-hearted comedy. For me, the real shining light of the entire show was the way the two managed to continue an understandable discussion of the hot issues in jurisprudence of that time -- at least fifteen minutes of viewing are justified by that historical perspective alone. In short, it's heart-warming, well-acted in the leads, and technically tighter than most viewers would realize.",
         "Walter Mathau left many wonderful performances for us to enjoy, and here is another one of them. In what could be a rehearsal for GRUMPY OLD MEN, it's great to see how he and Jill Clayburgh bounce off each other. Their characters are so different and opposite, yet they're like two pillars holding up the roof of the system. I find it difficult to fault this movie, It's enjoyable from start to finish.",
         "The first time I saw this movie I thought it was good, however, it was nothing spectacular! After seeing it again last night, I realized that this film \"First Monday In October\" had a very sensitizing identification with the American voter and movie viewer. Exploring the haunting conundrum of \"What exactly is the role of government in our lives?\". This motion picture elaborates on the necessary challenges which plague our Supreme Court Justices. The general role of the Supreme Court is to assume the role of Devil's advocate when dealing with an issue which requires a final decision. So, if it is up to nine individuals who determine the resonating outcome for the most important issues facing our nation, why then, shouldn't one of these people be a woman? Undoubtedly inspired by the appointment of Sandra Day O'Connor by President Ronald Reagan, the first woman to ever be appointed to the Supreme Court in the history of our nation, this film delves into the redefinition of a woman's role in modern American culture.Now what exactly is the big problem with having a woman on the bench of the Supreme Court anyway? Here's my interpretation: Initially, all Americans, women and men alike, garner a delicate protectiveness towards the feminine gender. Here lies the core issue: We live in a world where rough and tumble prevails, and ultimately, left handed compliments are, emphatically, the most coveted ones. If we act gingerly around women, we ultimately conceal our real feelings towards them, hence, we have manifested a patronizing demeanor towards women that winds up being one of the most heinous insults which women can be the recipients of. What becomes the scourge while being in the company of many typical females; Emotional tip toeing, a pusillanimously yielding deference which is extremely nauseating, or, worst of all, while in front of a crowd of women, men start masquerading a ludicrously childish, sans vulgarity condescension to them. These social amenities serve as a subterfuge for men to provide a proverbial and unrealistic pedestal for women. All of these charades are wry and conciliatory actions which comply with a stilted decorum towards females. Aggregately, there arises a belittlement of women which brings on an onslaught of disconcerting mannerisms. This insincere politeness towards women is a mendacity that vitiates our candid and visceral feelings which are essential in attaining a thorough communication dynamic with each other as people. Ultimately, our societal etiquette which \"reveres women\" concurrently shortchanges them as human beings. The film \"The First Monday In October\" establishes an egalitarian criterion for all citizens, such a philosophy was a harbinger of things to come for the 1980's. I found this movie to be insightful and prescient, not to mention a well-made movie with a lot of talent!! I give it a thumbs up!! By the way, I am politically conservative, however, I did concur with Walter Mathiau's contention that our government should not be like scratchy outfits that we cannot wait to take off of our bodies the first chance we get. Our government's policies should correlate to the analogy that the rules and regulations set forth by our nation should be like old clothes that are comfortable!",
         "This film is classic Mathau. The plot is a little thin, and not the most thought provoking, but it's the portrayal in the key roles that make this film great. Mathau is very believable as Justice Dan Snow. The scene with his wife and the wallpaper has got to be familiar to intellectual men everywhere. His one liners in this movie are some of my favorites... C.J. - \"Are you going to get that?\" D.S. - \"The telephone has no constitutional right to be answered. Leave it alone, it'll go away.\" ______________________________________________________________________ R.L. - \"The Dr. says you might have had a heart attack...\" D.S. - \"My heart wouldn't dare attack me!\" Over all a really well done film.",
         "Walter Matthau will always be one of my favorites from the sleazy bar-owner in King Creole to Hopscotch(another unusual pairing with Glenda Jackson)to countless other films he has appeared in... His droll comments and quick wit are hilarious.... and Jill Clayburgh does stand up to the occasion of matching him in legal argument(although scripted).... Of all the Matthau pieces, I think this is well worth the time, though I think the title(refers to the first sitting each year of the Supreme Court Judges)could have been a little more enticing to the general public... I think as a result of the title this movie has been largely overlooked... It is a funny, believable piece, well worth catching if you can!",
         "This film is probably not many people's first choice for a subject to be covered, but when writers Jerome Lawrence and Robert E. Lee wrote it they proved once again why they were one of America's top Play Writing teams: The choice of cast for this production, set against the hallowed halls of justice and in and around Washington, could not have been better. Matthau, at the very top of his game plays a William O Douglas like curmudgeonly liberal justice Daniel Snow, who has a low opinion of a certain woman circuit court judge Ruth Loomis, played by Jill Clayburgh. When a justice of the Supreme Court, Stanley Morehead dies the President names Judge Loomis to replace him. And with that the social conservative Loomis and Liberal Snow line up to do battle, with a surprising twist in this intellectual comedy. This film is rated R for some language and certain scenes not appropriate for children.",
         "You have to hand it to Walter Matthau, the older he gets, the more feisty his characters become!! This is a sorely underappreciated minor gem with two brilliant performances from Matthau and Clayburgh. Their chemistry is wonderful. All in all the film is clever, funny, original, and down right fun!!! If you happen to find this film at your local video store, check it out...its well worth discovering!",
         "The dialogue is priceless, and the physical comedy is great too, i.e., Barnard Hughes never says a word as he approaches Matthau's office where Matthau and Clayburgh are in a heated debate; it's a long shot from the office doorway as he approaches, and as soon as he is within earshot, he does a perfect \"to the rear, march\" without missing a beat! I agree wholeheartedly with the comments of bato-2 except for the \"comedy isn't much\" remark. Why such a low rating? This movie is among the many that I have taped, and I return to it often for \"pure enjoyment\".",
         "I don´t know why this movie had such a low rating!!! In fact, I would give it at least an 8. The plot is good, the acting is better, but comedy ain´t the best. Anyway this is a really good romantic movie, perhaps a little off reality, but it is still well developed. We should really raise this rating. And I mean it!!",
         "Though First Monday In October didn't last too long on Broadway, the Jerome Lawrence-Robert E. Lee play made one fine sparkling movie for Walter Matthau and Jill Clayburgh taking over the roles that Henry Fonda and Jill Alexander did on the stage. In 1978 when this was on stage, the iconoclastic William O. Douglas had been gone three years from the Supreme Court and the idea of a woman justice was yet untried. So imagine the serendipitous joy with the producers when Ronald Reagan added Sandra Day O'Connor to the court. You couldn't buy better publicity. Matthau is clearly based on William O. Douglas who was a far seeing advocate for social justice and change on the bench. Matthau if you can believe is a kinder, gentler version of Douglas. In real life Douglas was not a nice guy, in fact personally he was a swine. The banter with which you see him engage his law clerk James Stephens would never happen, he went through law clerks like he did wives. Ditto with Jan Sterling playing Mrs. Matthau. The first Mrs. Douglas had taken a hike years earlier and Douglas was on wife number 4 in her twenties at this time. He died in 1980. O'Connor replaced Potter Stewart in 1981 on the bench so in real life these two never served. Still First Monday In October you'd like to think would be how they got along with even a little romance thrown in once the two got to know each other. Douglas never got along with colleagues, especially those who had a different point of view. Still Matthau is one of his patented curmudgeons and Clayburgh do have a good cinema chemistry which makes First Monday In October a pleasant piece of viewing."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Ruth Loomis becomes the first woman appointed to the United States Supreme Court. A staunch conservative, she immediately runs into conflict with Dan Snow, the high court's resident liberal. Although, they never agree on the issues before the Court, they develop a respect and affection for one another after several comedic encounters.",
         "For the first time in history a woman is appointed to the U.S. Supreme Court, where she becomes a friendly rival to a liberal associate."
      ],
      "budget": 0
   },
   "movielensId": 5742,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-08-21",
      "dvdReleaseDate": "2004-07-06",
      "directors": ["Ronald Neame"],
      "runtime": 98,
      "movieId": 5742,
      "title": "First Monday in October",
      "mpaa": "",
      "actors": [
         "Walter Matthau",
         "Jill Clayburgh",
         "Barnard Hughes",
         "Jan Sterling",
         "James Stephens",
         "Joshua Bryant"
      ],
      "imdbMovieId": "0082382",
      "originalTitle": "First Monday in October",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["a3B7rLDIGCU"],
      "plotSummary": "For the first time in history a woman is appointed to the U.S. Supreme Court, where she becomes a friendly rival to a liberal associate.",
      "tmdbMovieId": 85058,
      "avgRating": 3.02027,
      "releaseYear": "1981",
      "numRatings": 74,
      "posterPath": "/zuXYI2FZJwyYRMSdkhC44Z6FvTE.jpg"
   }
}