{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gold",
            "id": 1321
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "dakota",
            "id": 2911
         },
         {
            "name": "sioux",
            "id": 8099
         },
         {
            "name": "outlaw",
            "id": 9503
         }
      ],
      "imdb_id": "tt0017463",
      "video": false,
      "title": "3 Bad Men",
      "recommendations": [
         113788,
         95169,
         71439,
         148168,
         214952,
         53408,
         190725,
         82576,
         209677,
         189587,
         196396,
         194039,
         42595,
         179000,
         132378,
         105352,
         98914,
         59355,
         70800,
         105552
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Dan O'Malley",
               "gender": 2,
               "credit_id": "52fe44e69251416c91020adf",
               "name": "George O'Brien",
               "profile_path": "/nBpMe3XqTKfe56VN7hdutJK64X3.jpg",
               "id": 9087,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Lee Carlton",
               "gender": 1,
               "credit_id": "52fe44e69251416c91020ae3",
               "name": "Olive Borden",
               "profile_path": "/20JdRilhqORLPQJQHnmOq6LLYVu.jpg",
               "id": 109611,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Sheriff Layne Hunter",
               "gender": 0,
               "credit_id": "52fe44e69251416c91020ae7",
               "name": "Lou Tellegen",
               "profile_path": "/fKGXafrARzVSiu96bPmoQbU6kUv.jpg",
               "id": 109612,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "'Bull' Stanley",
               "gender": 0,
               "credit_id": "52fe44e69251416c91020aeb",
               "name": "Tom Santschi",
               "profile_path": "/c03QI2Nct0P2pvxzaJJgs1CdesN.jpg",
               "id": 99466,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "'Spade' Allen",
               "gender": 0,
               "credit_id": "52fe44e69251416c91020aef",
               "name": "Frank Campeau",
               "profile_path": null,
               "id": 63383,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mike Costigan",
               "gender": 2,
               "credit_id": "52fe44e69251416c91020af3",
               "name": "J. Farrell MacDonald",
               "profile_path": "/7FFR9E9T4SsLFL27cYqLSjmzWV1.jpg",
               "id": 9091,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Millie Stanley",
               "gender": 0,
               "credit_id": "52fe44e69251416c91020af7",
               "name": "Priscilla Bonner",
               "profile_path": "/z8cvcQ5WZCCmdYN8jXoLsaQ9L9S.jpg",
               "id": 109613,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Zach Little",
               "gender": 2,
               "credit_id": "5643e65bc3a36870e8003967",
               "name": "Otis Harlan",
               "profile_path": "/dvoCiNNoupmtAh3qUfBX5zOOO1P.jpg",
               "id": 5465,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Lily",
               "gender": 1,
               "credit_id": "5643e669c3a36870dd003df8",
               "name": "Phyllis Haver",
               "profile_path": "/7sxC7nQPNwunIJDYSDd4mQx0OZf.jpg",
               "id": 1187918,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Rev. Benson",
               "gender": 2,
               "credit_id": "5643e6939251410a47003b7e",
               "name": "Alec B. Francis",
               "profile_path": "/1yVG1zlXjtTWvt4cc8Jtn5qgMTu.jpg",
               "id": 145838,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Nat Lucas",
               "gender": 0,
               "credit_id": "5643e6a6c3a36870ec0038e8",
               "name": "Jay Hunt",
               "profile_path": null,
               "id": 1156984,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Millie's Pal",
               "gender": 0,
               "credit_id": "5643e6afc3a36870e3003e4c",
               "name": "Grace Gordon",
               "profile_path": null,
               "id": 1534719,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Gen. Neville",
               "gender": 2,
               "credit_id": "5643e6b9c3a36870d6003c1c",
               "name": "George Irving",
               "profile_path": "/js2u7KGDeYSKf4eOrVQJxDPfaUP.jpg",
               "id": 13823,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Hunter's Henchman",
               "gender": 0,
               "credit_id": "5643e6c4c3a36870ec0038ee",
               "name": "Bud Osborne",
               "profile_path": "/6WIxWcUlDvnILVj8yplY61fQJyG.jpg",
               "id": 34890,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Henchman Shooting Lucas",
               "gender": 2,
               "credit_id": "5643e6cd9251410a41003a8d",
               "name": "Vester Pegg",
               "profile_path": null,
               "id": 1349871,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Pat Monahan",
               "gender": 2,
               "credit_id": "5643e6d7c3a36870ef003c69",
               "name": "Walter Perry",
               "profile_path": null,
               "id": 1126501,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e69251416c91020ac9",
               "name": "John Ford",
               "profile_path": "/dEOu7wZjE9BH4kdADWh9eTM10U.jpg",
               "id": 8500,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e69251416c91020acf",
               "name": "John Stone",
               "profile_path": null,
               "id": 109608,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e69251416c91020ad5",
               "name": "John Ford",
               "profile_path": "/dEOu7wZjE9BH4kdADWh9eTM10U.jpg",
               "id": 8500,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5385028cc3a368059b00bd24",
               "name": "George Schneiderman",
               "profile_path": null,
               "id": 109609,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5643e61a9251410a41003a66",
               "name": "Herman Whitaker",
               "profile_path": null,
               "id": 1534716,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "5643e631c3a36870db003cac",
               "name": "Edward O'Fearna",
               "profile_path": null,
               "id": 1093512,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 0.818184,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32716,
      "vote_count": 8,
      "budget": 0,
      "overview": "Three outlaws come to the aid of a young girl after her father is killed. A silent film directed by John Ford.",
      "similar": [
         581,
         429,
         57201,
         49849,
         11897,
         10530,
         196,
         281957,
         3090,
         384680,
         8584,
         818,
         9654,
         13223,
         22,
         101,
         682,
         7299,
         1572,
         3131
      ],
      "original_title": "3 Bad Men",
      "runtime": 92,
      "poster_path": "/3ciHLo1sgiRUasCBSYwlePOQRKZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fox Film Corporation",
         "id": 5488,
         "origin_country": ""
      }],
      "release_date": "1926-08-28",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Ford"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Herman Whitaker",
         "John Stone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0017463/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0MjM5OTIyNl5BMl5BanBnXkFtZTgwMDYzOTQ1MzE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: George O'Brien, Olive Borden, Lou Tellegen | See full cast and crew »"],
      "reviews": [
         "I like George O'Brien and when I saw the opportunity to own an early silent he made I took it and it was worth it, although, while he is the named star, he has a relatively small role in it and the movie really belongs to Tom Santschi who plays Bull, he is exceptional in his role. I'm not a huge fan of westerns, but, I enjoy all of John Ford's as he approaches his movies with a love of the West as it was being settled rather than the \"Cowboys 'n' Injuns\" take on things. This is the story of a girl who loses her father and is taken under the wing of the three bad men in the title, not that they are really all bad, just a bit naughty really. The real bad guy is the Sheriff who is really creepy. I don't like to give long detailed synopsises of movies, if I think a movie is good I just like to let people know that it is worth seeing and this one is. The Land rush sequence is particularly impressive and there is some very good humour, the inter titling is very well thought out. The acting is very good by all. The only downer is the quality of the available print, mine was a video from the Killiam collection and could do with a little TLC to restore it to it's former glory. This movie has absolutely everything and I cannot recommend it highly enough. It's about time more money was put into the restoration and cleaning up of the silents that were not lost or destroyed, it's a crying shame when you see movies like this and many others that end up forgotten and unloved through neglect.",
         "In 1876, an old man finds gold in the Sioux lands, provoking a gold and land rush from immigrants to Dakota. On the way to Custer, the lonely cowboy Dan O'Malley (George O'Brien) helps to fix the wheel of Mr. Carlton's wagon and flirts with his daughter Lee Carlton (Olive Borden). Later, Lee and her father are attacked by horse thieves and Mr. Carlton is murdered; however, the outlaws \"Bull\" Stanley (Tom Santschi), Mike Costigan (J. Farrell MacDonald) and \"Spade\" Allen (Frank Campeau) save her from the criminals and head with her to the camp where the pioneers are waiting for President Grant proclamation to explore the lands. In the site, the corrupt Sheriff Layne Hunter (Lou Tellegen) rules with his henchmen with horror and injustice. The trio of outlaws decides that Lee needs to get married and select Dan to be her husband. When Bull's sister Millie Stanley (Priscilla Bonner) is murdered by Hunter's right arm Nat Lucas (Jay Hunt), \"Bull\" organizes the men to chase Hunter. But it is 1877 and the gold and land race of wagons is ready to start. The melodramatic \"3 Bad Men\" is a delightfully naive silent western of the director John Ford. The cinematography is amazing, and the big land and gold race of wagons is fantastic for a 1926 silent movie, and comparable to the 1992 Ron Howard's \"Far and Away\" that uses modern cameras and equipment. The acting is top-notch, and the actors and actresses are able to transmit intense feelings using body and expressions only, despite the exaggerated acting in the death of the villain Hunter. There are funny moments, and I liked when Mike and Spade evaluate a dandy to marry Lee; or when Dan plays a romantic song in his harmonica for Lee; or the dialogs of Mike and Spade. The sequence with the baby is visibly inspired in Sergei M. Eisenstein's \"The Battleship Potemkin\" from 1925. The conclusion is corny and moralist, but absolutely inside the context of the moral and ethical values of the society in 1926. Last but not the least; the title is not accurate since the three \"bad men\" are actually three golden and warm-hearted men. My vote is eight. Title (Brazil): \"3 Homens Ruins\" (\"3 Bad Men\")",
         "This film convinces me that John Ford deserves his legendary status. He seems to have had his unique gift for cinema story telling from his beginnings. This is a starkly realistic tale depicting , unromantically , some of the brutal hardship of the late 19th century west. There is great poignancy in the loyalty and ethos which surface in even the most \"bad\" of men. To convey this in a silent film , with fairly minimal use of dialogue screens , required some pretty good acting and good camera work. There are several protracted facial studies which convey the critical messages very eloquently. Through most of the film I forgot that there was no \"talking\" dialogue. There are some surprisingly \"contemporary\" humor lines on the dialogue screens , not typical of westerns but quite typical of Fords evolving love of pathos.",
         "I agree with a previous review that the actor who makes the most impression is Tom Santschi, whose story of revenge this really is. His failure of saving Millie who sees Sheriff Hunter (Lou Tellegrin), her murderer, as the last image she sees while in Santaschi's arms, is quite cinematic. This hour and a half film has everything you would want in a western, sound or silent. There's a cute meet of George O'Brien and Olive Borden and one knows they're going to be together at the end by the 3 \"bad men\". Santschi is the leader who makes sure that happens. J. Farrell McDonald and Tom Campeau become a comedy team when they search for a proper suitor for Borden, but when Borden settles for O'Brien, it's settled. The fight scenes look truly realistic and John Ford shows his genius for great visuals. The church burning scene and the abandoned infant of the Oklahmoma Land Rush scene are among the best scenes he ever did. Santschi died in 1931. His sad eyes and his authoritative style is mostly forgotten and is one of the reasons the film should be better remembered. MacDonad would live on to 1952 and was featured in many Ford and others but barely registers like he does here. His eyebrows alone are very funny to watch and he, as in the Iron Horse, was very good as the comedy relief guy. Great use of the outdoors and putting extra meanings in the framing of scenes was Ford's stock in trade. Not all of his movies are classic. But this one most definitely is.",
         "3 Bad Men (as the title card shows it) is an outstanding example of the silent western and one of John Ford's earliest triumphs. The photography is stunning and the land rush sequences truly impressive, and while the story of redemption and sacrifice is predictable it is nonetheless still moving.",
         "It seems John Ford made his best films when a great story happened to coincide with his own sensibilities. For a director who filmed masculine camaraderie with more tenderness than male-female romance, and almost gave more weight to the comic asides than the actual plot, 3 Bad Men seems tailor-made \u0096 a Western in which the eponymous outlaws are the heroes, and the love story between Olive Borden and the more typically heroic George O'Brien becomes a subplot. Ford's tendency to improvise gags, and expand comic relief to entire scenes is often a bit excessive, but in 3 Bad Men it does not matter so much because the comedy characters are protagonists rather than supporting players threatening to steal the show. In fact the laughs we have had throughout the film make the poignant finale really pay off. You get a similar effect in Charlie Chaplin's features. What's more, Tom Santschi, J. Farrell MacDonald and Frank Campeau, big ugly supporting players that they were, were nevertheless great actors who here prove themselves fully capable of emotional depth. Ford, meanwhile, can be seen gradually developing into a confident craftsman, especially as regards his shot composition. While his earliest pictures featured framing that was pretty yet distracting, he now achieves the same aesthetics with far more subtlety. A major difference is that whereas before the framing devices were \"fixed\" items \u0096 for example a tree or a canopy \u0096 he now achieves a more natural look \u0096 a figure leaning against a post in the foreground here, the end of a wagon there. He still occasionally makes use of the old-fashioned \"heavier\" framing, but only to highlight a key moment, for example enclosing Olive Borden and Tom Santschi between two cavern walls towards the end. This is of course also an epic pioneer Western and, although the historical context is not paramount as it is in The Iron Horse, Ford constantly reminds us that a civilization is being built in the background \u0096 literally. As in many of his pictures, he balances the story of individuals with the story of masses, often in the same frame, so a dialogue scene might take place with a few horses or wagons trailing past in the distance \u0096 always done with so much control so as not to let the one outbalance the other. Perhaps the best example is in an emotional little vignette at the end of the land rush scene \u0096 a wagon fills most of the screen, but Ford allows a tiny gap on the left to show the settlers carrying on in the background \u0096 just keeping that part of the story going without allowing it to dominate. By the way, the new Dana Kaproff score that accompanies the recent \"Ford at Fox\" restoration of 3 Bad Men is also very good. This is as far as I can tell the only silent score Kaproff (normally a TV composer) has done, but he handles the form with skill. It's full of little touches that I like \u0096 for example, about twenty minutes in there is a brief scene of George O'Brien's character carrying on his way, singing his song, silhouetted against the sun. Kaproff, rather than giving us the same tune, uses a minor key variation. We recognise it as O'Malley's signature tune, but it just has that little difference that stops it becoming samey, while at the same time corresponding to the sombre tone of the shot. 3 Bad Men is probably Ford's best silent picture. Here at last he has been given a story in which the silhouettes of men on horseback riding across the plains can be tinged with both excitement and poignancy. That was where romance truly lay for old Jack Ford.",
         "I enjoyed so much this film, that it made me think that Cinema did not really evolve from silent to talkies, it just went on in a different direction. I can visualize silent films being made today with narration instead of dialogs. I would not say this film has a good story, it is over sentimental and naive, but it is a proof of what a great director, great cinematography and great actors can do. It has of of the funniest scenes when the \"bad men\" pick up a dandy in the saloon, his expressions of fear and conceit, also the fantastic way he dances with one of the girls. It also has a tragic and beautiful scene where a baby is abandoned, during the stampede of horsemen and carriages reminding one of the pram scene in \"Potemkin\". And also one of the most spectacular, grandiose scenes where thousands are waiting for the sound of the cannon to rush for the land. This DVD copy was excellent with a great soundtrack added.",
         "This is a great find - some excellent performances here (Olive Borden as the plucky little heroine, Priscilla Bonner as poor little misguided Millie, Lou Tellegen as the corrupt sheriff in rather silly hat) and an excellent story which has a lot to say and keeps you watching. If only someone out there would restore it to its former glory ... wouldn't it look wonderful?",
         "I expected this to be Ford's first adaptation of \"The Three Godfathers.\" And while the film borrows elements from Peter Kyne's story, it's really quite different, owing little to any source, having merely been \"suggested\" by Herman Whitaker's novel \"Over the Border.\" It opens with a wildly inaccurate summary of post Civil War western settlement, but soon settles down into a surprising tale of good-guy outlaws battling bad-guy lawmen, a similar kind of world-turned-upside-down theme to which Ford would return in his first talking western, \"Stagecoach.\" But unlike the Ringo Kid in that film, these bad men, \"Bull\" Stanley, \"Spade\" Allen, and Mike Costigan, aren't just misunderstood; they're cold-blooded killers. After fighting off sheriff Layne Hunter's lawmen for the prize of some thoroughbred horses brought from Virginia by a Major Carlton to compete in a Dakota territory land rush, Bull is about to establish his claim by putting a bullet through the brain of a figure kneeling over the major's body when a hat falls off to reveal the tresses of the major's daughter, Lee, played by Olive Borden. Bull has apparently murdered men under similar circumstances, but he can't kill a woman. His saving grace is his love for his sister Millie who was seduced away from home by a man against whom Bull has sworn revenge. Lee, believing the bad men came to her father's aid, pleads for Bull's assistance. Bull's compassion is awakened, and instead of stealing her horses he persuades his baffled comrades to help Lee in the land rush. Opposing them is Layne Hunter, sheriff of the town of Custer, looking sexually ambiguous with his white face, dandy clothes and long hair. He not only covets the Carlton thoroughbreds but Lee herself, apparently planning to seduce and pimp her out like his other prostitutes. One of his recent acquisitions we learn is Bull's sister. The bad men are compelled to save Lee by finding her a husband. They choose Dan O'Malley (played by George O'Brien), an Irish cowboy the Carltons had met on their way to Custer. The partners also learn from a prospector the location of rich diggings in the Black Hills. The lawmen burn down a church and Millie is shot trying to shield the minister. Bull is finally reunited with his sister who dies with him at her bedside. All five partners ride the Major's thoroughbreds in the Custer land rush. But the Hunter gang is waiting for them over the starting line, intending to follow the partners who they are certain will lead them to the gold. Outnumbered, the bad men must sacrifice themselves one by one to cover the route of Lee and Dan, redeeming their criminal pasts by saving the two lovers, and allowing Bull a final opportunity to obtain justice for his dead sister by killing her seducer. I don't know how much input Ford had on the final script. He usually had a hand in most aspects of his films. But even if other westerns occasionally featured corrupt officials and goodhearted bad men, the idea of murderers as martyrs and the town sheriff as a sexually ambiguous pimp complicates the plot more than you might expect in a movie of this era, and shows how far ahead of his time Ford actually was. Ford's infamous and unmistakable brand of humor suggests he had more than a little to do with the script. But even though the humorous interludes take too long, they're not as distracting here since they are consistent with character and plot development, which isn't often the case in Ford's films. We shouldn't be too shocked at racially insensitive title cards since such language was common to the time in which the film takes place. And finally, the Grand Tetons, standing in for the Black Hills, furnish the type of spectacular backdrop - like Monument Valley in later Ford action scenes - for some exciting images of the land rush and the heroic sacrifice of three good men.",
         "I stumbled upon this on the Fox Movie channel. it is an excellent tale of the West as only John Ford can tell it. great cinematography, narrative, acting. the camera-work is especially compelling. and the updated music by Dana Kaproff is outstanding. some of the best silent film music I've ever heard, and I write film scores, so I know what I'm talking about. check out the Fox Movie channel if your cable company offers it. They show great films from their library. this is a must see and must have for anyone's collection of silent masterpieces!"
      ],
      "genres": [
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Fox Film Corporation"],
      "summaries": [
         "In 1876, an old man finds gold in the Sioux lands, provoking a gold and land rush from immigrants to Dakota. On the way to Custer, the lonely cowboy Dan O'Malley helps to fix the wheel of Mr. Carlton's wagon and flirts with his daughter Lee Carlton. Later, Lee and her father are attacked by horse thieves and Mr. Carlton is murdered; however, the outlaws \"Bull\" Stanley, Mike Costigan and \"Spade\" Allen save her from the criminals and head with her to the camp where the pioneers are waiting for President Grant proclamation to explore the lands. In the site, the corrupt Sheriff Layne Hunter rules with his henchmen with horror and injustice. The trio of outlaws decides that Lee needs to get married and select Dan to be her husband. When Bull's sister Millie Stanley is murdered by Hunter's right arm Nat Lucas, \"Bull\" organizes the men to chase Hunter. But it is 1877 and the gold and land race of wagons is ready to start.",
         "Three outlaws come to the aid of a young girl after her father is killed."
      ],
      "budget": 0
   },
   "movielensId": 57484,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1926-08-28",
      "dvdReleaseDate": "2007-12-04",
      "directors": ["John Ford"],
      "runtime": 92,
      "movieId": 57484,
      "title": "3 Bad Men",
      "mpaa": "",
      "actors": [
         "George O'Brien",
         "Olive Borden",
         "Lou Tellegen",
         "Tom Santschi",
         "Frank Campeau",
         "J. Farrell MacDonald",
         "Priscilla Bonner",
         "Otis Harlan",
         "Phyllis Haver",
         "Alec B. Francis",
         "Jay Hunt",
         "Grace Gordon",
         "George Irving",
         "Bud Osborne",
         "Vester Pegg",
         "Walter Perry"
      ],
      "imdbMovieId": "0017463",
      "originalTitle": "3 Bad Men",
      "genres": [
         "Romance",
         "Western"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Three outlaws come to the aid of a young girl after her father is killed. A silent film directed by John Ford.",
      "tmdbMovieId": 32716,
      "avgRating": 3,
      "releaseYear": "1926",
      "numRatings": 20,
      "posterPath": "/3ciHLo1sgiRUasCBSYwlePOQRKZ.jpg"
   }
}