{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "gospel",
         "id": 5708
      }],
      "imdb_id": "tt0486578",
      "video": false,
      "title": "First Sunday",
      "recommendations": [
         10426,
         19349,
         13950,
         10471,
         28219,
         14434,
         12251,
         18056,
         456210,
         13169,
         17728,
         32010,
         241939,
         109466,
         51523,
         38401,
         19848,
         57289,
         31461,
         29230
      ],
      "backdrop_path": "/agnWagE5alhV2d8SxdBi21YPc8t.jpg",
      "revenue": 38804615,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Durell",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067d85",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rickey",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067d89",
               "name": "Katt Williams",
               "profile_path": "/pGcAE2PXmBRAL66kbuzP9q0pcIY.jpg",
               "id": 58926,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "LeeJohn",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067d8d",
               "name": "Tracy Morgan",
               "profile_path": "/wXLPjDsy4SfqghEAJ8wybHh04nU.jpg",
               "id": 56903,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sister Doris",
               "gender": 1,
               "credit_id": "52fe45f19251416c75067d91",
               "name": "Loretta Devine",
               "profile_path": "/zLQFwQTFtHkb8sbFdkPNamFI7jv.jpg",
               "id": 18284,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Deacon",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067d95",
               "name": "Michael Beach",
               "profile_path": "/lOlWhURNKyZHn71dvq7qC7fiwN6.jpg",
               "id": 87118,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Judge B. Bennet Galloway",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067d99",
               "name": "Keith David",
               "profile_path": "/nwAC9TgwRkj0Ritq93O8GeublyL.jpg",
               "id": 65827,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Omunique",
               "gender": 1,
               "credit_id": "52fe45f19251416c75067d9d",
               "name": "Regina Hall",
               "profile_path": "/5xwv4XUND9HhJqfeTmtxmzJJJR0.jpg",
               "id": 35705,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Tianna",
               "gender": 1,
               "credit_id": "52fe45f19251416c75067da1",
               "name": "Malinda Williams",
               "profile_path": "/hx4vstXwizQOSuFQ8awWO7fcR7Y.jpg",
               "id": 74612,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Pastor Arthur Mitchell",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067da5",
               "name": "Chi McBride",
               "profile_path": "/8SZovWxZzQ78uQp2rNzU9fKyYJS.jpg",
               "id": 8687,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Officer Eddie King",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067da9",
               "name": "Clifton Powell",
               "profile_path": "/hBw76xJtCwKS2v5rZtzDBqvKLN6.jpg",
               "id": 58924,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Officer D'Agostino",
               "gender": 2,
               "credit_id": "52fe45f19251416c75067dad",
               "name": "Nicholas Turturro",
               "profile_path": "/i9m7ox3KoSkqeKvyGqLHZovUN5Q.jpg",
               "id": 32897,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Blahka",
               "gender": 2,
               "credit_id": "54e662739251416f46000207",
               "name": "Paul Campbell",
               "profile_path": "/yuqpEMUTNsGp4XFZDg1xcfbwwgc.jpg",
               "id": 1129883,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Roberta",
               "gender": 0,
               "credit_id": "573cff9b9251413675000235",
               "name": "Retta",
               "profile_path": "/nAzpnWg7NqElhUMeHKaWIqmaEpJ.jpg",
               "id": 75318,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45f19251416c75067db3",
            "name": "David E. Talbert",
            "profile_path": "/knvN7IMPxKtcec74AU4MtpFLE4Q.jpg",
            "id": 109692,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.101086,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14423,
      "vote_count": 45,
      "budget": 0,
      "overview": "Durell and LeeJohn are best friends and bumbling petty criminals. When told they have one week to pay a $17,000 debt or Durell will lose his son, they come up with a desperate scheme to rob their neighborhood church. Instead, they end up spending the night in the presence of the Lord and are forced to deal with much more than they bargained for.",
      "similar": [
         2005,
         6844,
         476968,
         21539,
         1677,
         318850,
         213386,
         266405,
         45139,
         241959,
         191798,
         361063,
         192683,
         192291,
         123562,
         190439,
         491265,
         123314,
         192327,
         127601
      ],
      "original_title": "First Sunday",
      "runtime": 96,
      "poster_path": "/4crEqEk5pYHvlNG7UUBBudi4z0R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/r94SalgVn6WyQBcehzX9hmInzGP.png",
         "name": "Cube Vision",
         "id": 2780,
         "origin_country": ""
      }],
      "release_date": "2008-01-11",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Keep the faith. Steal the rest.",
      "adult": false,
      "homepage": "http://www.sonypictures.com/movies/firstsunday/international/index.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David E. Talbert"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["David E. Talbert"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0486578/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MTYzMTMxMl5BMl5BanBnXkFtZTYwNzc0Nzc4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ice Cube, Katt Williams, Tracy Morgan | See full cast and crew »"],
      "reviews": [
         "2 out of 10. What can I say? I didn't expect much walking in. Can you blame me? Did you see the trailer? You know a comedic trailer is unfunny when the funniest thing in it is the studio logo at the beginning and that wasn't funny. This debacle stars \"multi-talented\" act-rapper Ice Cube whose career started melting after Barbershop 2. Ice Cube doesn't even try to be funny nor does he have anything funny to do or say. Why is this guy even in comedies or movies for that matter? The comedy revolution of a plot consists of two losers trying to get rich quick. That is what the plot boils down to. Ice Cube's character wants to prove to his son that he is not a loser and Tracy Morgan's character wants to prove to the audience that he belongs in this movie. Neither of them are believable. The writer/director *Insert black writer/director's name here* tries to add dramatic elements to a humorless comedy script and fails just as much as he was trying to add jokes. There is something in this movie about the 2 main characters trying to rob a church and realizing that the money in the church is already stolen, but I was too distracted by the idea that someone actually green lighted this script. First off, is it even an interesting idea to rob a church? I guess the writer figured that banks stopped carrying money. Secondly, who the hell thinks Katt Williams's one liners in this film were funny? The director kept cutting to him as if he said the most uproarious thing since Stephen Hawking yodeled Green Eggs and Ham. You know a comedy is bad when they go to one character for comic relief...IN A COMEDY!!! This movie tries way too hard to have many sentimental and redeeming moments wishing for you to stand up and cheer. But such \"redeeming\" moments as Ice Cube hugging his movie offspring and Tracy Morgan feeling as he belongs in society felt as if they were added as a last minute script revision because the comedy wasn't working. The hilarity of this movie consists of Tracy Morgan getting a massage from a badly dubbed transvestite. It also includes \"pimped out\" wheelchairs because a wheelchair with hot chrome rims equals comedy gold. By the way, those wheelchairs are mentioned more times in this movie than Jesus Christ in the Bible. First (and hopefully the last) Sunday isn't the worst movie ever made. It's not as awful as other urban comedies like Who's Your Caddy? or anything with Mike Epps. First Sunday is by far no Epic Movie (which is definitely a 0 out of 500) but it is clearly a waste of time. Not only for the audience but for the people involved in making it. It adds nothing new and it insults the audience's intelligence many times. I was going to list a bunch of movies that are funnier than First Sunday but after listing Schindler's List, Citizen Kane, and March of the Penguins I got tired. So in conclusion, save your time, save your life, and most importantly save your money. If you save your money that will most likely prevent a Second Sunday.",
         "Let me start off with the downsides of this movie. There was a lot of unbelievable material, and it got so out of hand at times that I really couldn't enjoy it for how ridiculous it was being. Some of the acting was poor, and I felt the actors and actresses really didn't care how they portrayed their characters, except maybe a few, and therefore they ended up being unlikable and ultimately forgettable. Most of the funny material wasn't funny at all, and I got super tired super fast with all of the lame jokes and mundane, black comedy antics. Not to mention it was predictable to the point where I wasn't enjoying any surprises. Now, the actual upsides. I did laugh a few times, and it was because the material was actually humorous. No, it wasn't hysterically rolling on the floor laughing, but it got smiles and chuckles nonetheless. It managed to keep me entertained, and I was actually sucked into the story plot a little. I became interested because even though most every attribute about this film is average or poor, the plot truthfully seemed endearing to me, for some odd reason, and overall, while the movie is mediocre, and I certainly wouldn't watch it again, it's not terrible. I wouldn't recommend it, but you don't have to completely avoid it, per say. It was nothing special, but if you feel like watching it, be my guest.",
         "I really enjoyed this film for a number of reasons. I think Katt Williams is hilarious all by himself and was a great person to cast as choir director. I thought the plot was not as generic as most theft-based plots that hit Hollywood. I thought the transitions that happened as the film developed were fun to watch. Overall I thought the movie was really good. If you are trying to decide whether or not you want to go see this movie, consider this as you make your decision. First, the film is stereotypical. The main characters live in and attend church in a run down community exposed to crime, drugs, and other stereotypical things you expect to find in a stereotypical community overrun with stereotypical people who are stereotypically Black or Hispanic. Second, the film is funny. Things that are funny to people who understand the complexities and realities of being Black will realize this; people who do not understand will find it challenging to find the comedy. Third, the film will not be an Oscar nominee. The movie was not so well shot, scripted, edited, or presented that you will see it up for major awards. That being said, a number of movies come out every day that are entertaining but are not award-winning and we watch them because we want to be entertained. This is another one of those films. So, if you want to be entertained, you understand the positive and negative inner workings of Black society, and you do not mind viewing a film that displays both stereotypes and truths about the way Black people live, move, and have their being, this movie is for you.",
         "With scenes pumping off like in a TV show, this film exposes an urban community with an appeal that's worst off than the dirty red-light districts in some cities. The film blares with loud music that seeming competes with noise from the loud-mouthed characters. The Writer/Director brings out a Baltimore community, inhabited by either dysfunctional characters or low-based folks \u0096 gangsters, masseurs, street alcoholics, homeless folks, macho men who can't resist glaring at female bottoms, and those who fill their time in an overheated church where the choir director maneuvers around like a court jester and any one dressed like a manicured, fruity dude could be troublesome! Even the court room has the appeal of a noisy street market! Hhhmh, what a pathetic way to portray a community\u0085 especially when it's so absurd to see Ice Cube's Durell \u0096 a man obviously with brains and talent \u0096 so easily becoming enticed to crime by his dysfunctional pal, LeeJohn, or having nothing better to do than be obsessed by a female's wriggling rear end. Boy, aren't we getting rather bored with film after film that makes excuses for irresponsible bums who turn into gun-trotting robbers just because they are short of cash or are being hounded by ugly loan sharks? Boy, it's even more freakish to have to watch misfits turning over a new leaf by some lonely old church ladies with ogling eyes! Absolutely a lame movie without any witty humor, but with lots of unflattering stereotypical clichés to attempt at drawing out laughs\u0085 and where events and characters flow and end at very predictable expectations. Yep, this film is simply overloaded with non-complimentary logic and ugly characterization of an urban community!",
         "Let me see: It's January, and a film is released with a recognizable star and an obvious audience. Should be a winner? Nah! Not for nothing is this called the \"dead season\" or the \"dumping ground\" because almost all the films released at this time are potential losers, films deemed by their owners weak for a variety of reasons, but most certainly heading for panning by the critics. First Sunday, a heist film set in a church, fulfills all the requirements for this notorious time of year: The plot is thin and almost silly: a couple of slackers decide to rob a local church in order to pay debts or salvage a family, mixing guilt with almost innocence; Ice Cube stars against his type as a robber with at heart and he produces, an act that guarantees this weak film distribution. Yet, I liked First Sunday well enough to keep it from my slag heap of grade F. I liked the sub-textual seriousness of kids without dads, dads dealing with unemployment and disrespect, and mundane church matters. In addition, Cube (Durell) has a solid persona, not varying much each film, of an intelligent, serious but secretly warmhearted guy, a working stiff who just hasn't had the right breaks. His sidekick LeeJohn (Tracy Morgan) provides the feckless, goofy, but lovable klutz, whose heart is bigger than Durell's. Beyond reasonable humor is Katt Williams' Rickey, a choirmaster with loopy observations and mannerisms. The women in the congregation serve as enablers for the errant crooks, and in one case, as major eye candy. Most of the characters in the film are shameless stereotypes. The responsibility for this sub par comedy rests with writer director David E. Talbert, whose more that a dozen successful plays with heavy social themes remind of the success Tyler Perry has had with a similar profile. But Talbert lacks Perry's refinement of style and substance that deftly mixes broad comedy with social concerns. Talbert may never reach the success of Perry, but he should keep trying because social comedy is a powerful part of our popular culture.",
         "So, it turns out \"blaxploitation\" films are still alive and well, and these days cast Ice Cube, Katt Williams and Tracy Morgan in the leading roles. This offensive film parades just about every stereotype about African Americans that you can get away with while still maintaining a PG-13 rating. That translates into a ghetto setting curiously devoid of drug dealers and crack whores. There is one character who dresses like a pimp, but I'm convinced that was because of a mix-up in wardrobe, rather than a deliberate attempt at authenticity. What is inexcusably absent though is a discernible plot. The screenplay seems to be a weak attempt to re-purpose the flimsy dramatic premise that powers \"Die Hard\", but relocating it in a church and mashing some Agatha Christie mystery elements for good measure. What emerges then, in place of a plot, is a severely frayed thread, ambitiously intended to link together a series of set pieces where the various performers deliver signature material - kind of like what you'd find at a school concert, only less coherent. \"First Sunday\" does have some funny moments and to be fair, the family did chuckle about the movie for a couple of days after watching it. So think of this movie as a set of toppings in search of a (first) sundae.",
         "The movie can really touch with its emotional aspect, which consist of the old motive that money can't always buy anything. There are some good in the hood laughs, but not worth to remember. I personally think that Ice Cube can do better, and he can achieve something more great the \"Friday\" series.His acting is getting better and better, but he should try to change the plot of his movies or maybe a drastic change in his character.At all, this movie production is not something amazing,but this is not its main mission. It's just a good comedy, that can waste your time, without wasting its limit. By the way its worth nothing the fact that there are some really funny characters that are really moving the thing in this production. Like the chore director for example, or the priest.Actually this is the main element that makes me rate the movie at a more high score. It seems that almost everything was half-baked- the plot is good, but could have been better, and the actors a re funny,but could be funnier.",
         "I'm baffled by the anger in some reviewer's critiques. Sure, this movie is hardy Citizen Kane or even up to the level of the Barbershop movies, but it's not terrible. It's main issue is its inability to sustain a tone. Instead, it varies between pathos, light comedy and (of all things) hostage drama. As with the Barbershop movies, the persistent theme is community and family. The central characters are two petty criminals who remain criminals because of previous convictions. This isn't a laughable theme. A felon has a very difficult time making a living. When's the last time you saw a job application which didn't ask about previous criminal record? Anyway, in an effort to both pay off scary people and maintain family cohesiveness, two of society's losers decide on one more crime. The subsequent series of events combine serious situations with interesting characterizations and then throws in some scenes of such silliness that they tend to stomp a bit on the rest of the movie. Approach with an open mind and you'll be for a light, decent movie with some interesting character sketches.",
         "This movie was like that one paper you wrote in high school. You stayed up all night working on it, but still could only pull out a C+.. I don't know why this movie needs to be about white or black (say some of the peeps reviewing it) or if you rate it low you're a bigot or if you really like it, you're a minister @ a church etc.... I'm white and I enjoyed it, just not enough to give it a 9 or 10. And while I love Tracy Morgan, Kat Williams and I-Cube.. I thought the plot was not that interesting and the funny moments were few and far between.. Sure, it had its redeeming values.. but the movie didn't know whether to be a comedy or a redemption flick. So it tried to be both.. The one part I absolutely loved and that really touched me was when Tracy's character says that he had never had a birthday celebration because the foster care place lost his birth certificate. Wow.. Talk about sad.. I actually almost started crying, because it was so emotional and I had never heard of anyone not celebrating a birthday ever.",
         "Let me first start off by saying this movie kept true to the words of the bible and kept the sabbath day holy, as this movies plot was riddled with them. If you wondering why I have \"HA.\" as my summary title that is because at the time i read that they called this movie a comedy under genre. This movie has about as much comedy as Roots (and no I did not find Roots remotely funny). So first let me start with the plot. This story is completely messed up. First off lets start with something i noticed off the bat while watching the movie. A man in the movie (spoilers) is blind and cleans the church at nights. This doesn't bother as much as the point that in one part of the movie he is able to walk by a gun within mere inches of his face and not notice it, yet later in the movie is able to find a bag of money which no one else can. Another thing in the movie that i only realized happened afterwards was that two characters were completely missing for half the movie. In one scene there is the character of a woman in a greenish shirt with black dots on her shirt played by comedian Rickey Smiley who is a man. Her character another character who is sitting next to her in a church meeting they are having, completely disappear within minutes. The director didn't even bother to show where they had gone. Another thing that i hated about this movie was the acting. Ice Cubes performance rivals Clitista Flockhart's performance when she stared in Ally McFeal. Not only were his drama scenes unconvincing, they were the funniest parts of this movie (not really a good thing). Another thing that bothered me was Tracy Morgan and Katt Williams. They are put in the movie for comedic relief and do not deliver. They act in this movie exactly the same way the acted in previous movies they were in such as Who's your Caddy? or Gone with the Wind. By now i hope you noticed that i hated this movie. The acting ability is equal to that of someone in a elementary school play, the plot has more holes than a pasta drainer, and the jokes aren't present. Im just hoping they called this movie First Sunday for some other reason than to open the possibilities for a Second Sunday. I would recommend this movie to no one unless you are a amateur in the movie industry, whether it be a director, actor, or even producer, and want to know what not to do. In that case this is a good movie to watch as i shows how not to act nor how to direct a movie. If you aren't one of mentioned people, Stay Away!!!."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Screen Gems",
         "Cube Vision",
         "Story Company, The"
      ],
      "summaries": [
         "Durell Washington and LeeJohn Jackson are best friends and bumbling petty criminals. When Durell learns that his ex-girlfriend plans to move to another state with their son Durell Jr.--unless they can get her $17,000 to pay off a debt-- and so Durell and LeeJohn ultimately comes up with a desperate scheme to rob their neighborhood church. But when the duo fumbles their way through the break-in, they discover someone has beaten them to the punch. In order to get their hands on the money, Durell and LeeJohn are forced to spend the night in the presence of the Lord and his followers--and end up getting a lot more than they bargained for.",
         "Durell and LeeJohn are best friends and bumbling petty criminals. When told they have one week to pay a $17,000 debt or Durell will lose his son, they come up with a desperate scheme to rob their neighborhood church. Instead, they end up spending the night in the presence of the Lord and are forced to deal with much more than they bargained for."
      ],
      "budget": 0
   },
   "movielensId": 57522,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-01-11",
      "dvdReleaseDate": "2008-05-06",
      "directors": ["David E. Talbert"],
      "runtime": 96,
      "movieId": 57522,
      "title": "First Sunday",
      "mpaa": "PG-13",
      "actors": [
         "Ice Cube",
         "Katt Williams",
         "Tracy Morgan",
         "Loretta Devine",
         "Michael Beach",
         "Keith David",
         "Regina Hall",
         "Malinda Williams",
         "Chi McBride",
         "Clifton Powell",
         "Nicholas Turturro",
         "Paul Campbell",
         "Retta"
      ],
      "imdbMovieId": "0486578",
      "originalTitle": "First Sunday",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Durell and LeeJohn are best friends and bumbling petty criminals. When told they have one week to pay a $17,000 debt or Durell will lose his son, they come up with a desperate scheme to rob their neighborhood church. Instead, they end up spending the night in the presence of the Lord and are forced to deal with much more than they bargained for.",
      "tmdbMovieId": 14423,
      "avgRating": 2.42969,
      "releaseYear": "2008",
      "numRatings": 64,
      "posterPath": "/4crEqEk5pYHvlNG7UUBBudi4z0R.jpg"
   }
}