{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "neurotic",
            "id": 175357
         }
      ],
      "imdb_id": "tt0082764",
      "video": false,
      "title": "Modern Romance",
      "recommendations": [
         49454,
         47448,
         85424,
         74364,
         48679,
         271849,
         87392,
         71255,
         16771,
         24214,
         55372,
         25501,
         25338,
         62107,
         42597,
         43336,
         53198,
         16303,
         33250
      ],
      "backdrop_path": "/shtgmSmxQoeGKIhtUiF2PPG6DTw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Cole",
               "gender": 2,
               "credit_id": "52fe46aac3a368484e09d2ef",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mary Harvard",
               "gender": 1,
               "credit_id": "52fe46aac3a368484e09d2f3",
               "name": "Kathryn Harrold",
               "profile_path": "/6TvQYnmEdEanDbJbBsSMy0UjXZY.jpg",
               "id": 21519,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jay",
               "gender": 2,
               "credit_id": "52fe46aac3a368484e09d2fd",
               "name": "Bruno Kirby",
               "profile_path": "/jGRVym5zAQZix5N4ZRabuE3XKHm.jpg",
               "id": 9257,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "David",
               "gender": 2,
               "credit_id": "559c0be092514155bd0002a2",
               "name": "James L. Brooks",
               "profile_path": "/9Hx9JbnQBChJhlfJTvmnYF8o8DK.jpg",
               "id": 3388,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "52fe46aac3a368484e09d305",
               "name": "Jane Hallaren",
               "profile_path": "/zaEz8kkIqvV1OAhWTAOf8HPCfIv.jpg",
               "id": 184793,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Sporting Goods Salesman",
               "gender": 2,
               "credit_id": "559c0bfbc3a3687f3b0002a1",
               "name": "Bob Einstein",
               "profile_path": "/89cdqeLOqR2jU92fSPvBNgFsqsa.jpg",
               "id": 16302,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Head Mixer",
               "gender": 0,
               "credit_id": "559c0c1ec3a3687f3b0002a5",
               "name": "Albert Henderson",
               "profile_path": "/6MJrBpBpHYtemSHqGGeYmtkSHYT.jpg",
               "id": 156411,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "559c0c45c3a3687f40000287",
               "name": "Meadowlark Lemon",
               "profile_path": "/bRhdQo3S8BmIubRjtheJYYkPGdv.jpg",
               "id": 100610,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Himself and Zeron",
               "gender": 2,
               "credit_id": "559c0c5892514155b3000290",
               "name": "George Kennedy",
               "profile_path": "/vNYRh8f0QuA2eK8ahKftOBxtDN7.jpg",
               "id": 12950,
               "order": 8
            },
            {
               "cast_id": 6,
               "character": "Waitress",
               "gender": 0,
               "credit_id": "52fe46aac3a368484e09d301",
               "name": "Tyann Means",
               "profile_path": null,
               "id": 953116,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Albert Brooks' Mother",
               "gender": 0,
               "credit_id": "5863dfcfc3a36852ba00e937",
               "name": "Thelma Leeds",
               "profile_path": "/uNQ19Th14UMBUAbZnTGtE6NEFO6.jpg",
               "id": 1437229,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46aac3a368484e09d2f9",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46aac3a368484e09d30b",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46aac3a368484e09d311",
               "name": "Monica Mcgowan Johnson",
               "profile_path": null,
               "id": 11368,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "559c0cc492514155c30002aa",
               "name": "Andrew Scheinman",
               "profile_path": null,
               "id": 3030,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "559c0cd2c3a3687f5100028b",
               "name": "Martin Shafer",
               "profile_path": null,
               "id": 41377,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "559c0ceec3a3687f4c0002a6",
               "name": "David Finfer",
               "profile_path": null,
               "id": 18387,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e60260c3a3685a96008813",
               "name": "Barbara Claman",
               "profile_path": null,
               "id": 959257,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56e60253c3a3685a9a007d45",
               "name": "Eric Saarinen",
               "profile_path": null,
               "id": 73784,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56e60268c3a3685aa4007d5e",
               "name": "Deborah Kurtz",
               "profile_path": null,
               "id": 141211,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56e60277c3a3685a9a007d4c",
               "name": "Edward Richardson",
               "profile_path": null,
               "id": 23702,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56e602949251416d40008476",
               "name": "James L. Berkey",
               "profile_path": null,
               "id": 8884,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.810194,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 63443,
      "vote_count": 20,
      "budget": 0,
      "overview": "A film editor breaks up with his girlfriend, unsure if he is in love.",
      "similar": [
         28468,
         401898,
         27066,
         8088,
         1939,
         18215,
         9686,
         705,
         49950,
         2758,
         1903,
         64682,
         862,
         38,
         426,
         55721,
         19913,
         329103,
         400617,
         50544
      ],
      "original_title": "Modern Romance",
      "runtime": 93,
      "poster_path": "/iDRBGabz2BqlqjidUOtTvYOaSli.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1981-03-13",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Robert was madly in love with Mary. Mary was madly in love with him. Under the circumstances they did the only thing they could do... they broke up.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Albert Brooks"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Albert Brooks",
         "Monica Mcgowan Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082764/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjMwOTE1ODg0M15BMl5BanBnXkFtZTgwODU2NjAxMDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Albert Brooks, Kathryn Harrold, Tyann Means | See full cast and crew »"],
      "reviews": [
         "This film is not for everyone. If you do not already like Albert Brooks, or are only lukewarm on him, by all means stay away from it. I happen to love Brooks and, hence, this film. But I can understand people getting fed up with it because it's not structured or scripted like a normal movie. The biggest complaint I've heard about it is that all the other characters in it besides Brooks, especially the girlfriend, are mere props for him. That's absolutely true. It's as if Brooks would have preferred to do a long monologue (or a stand-up routine) but then decided at the last minute that he did need people to be present every now and again to bounce things off of. Just so you know what to expect: this is not an \"interaction\" movie - this is undiluted Albert Brooks coming straight at you for nearly two hours, with all his smarminess, vanity and doggedness firmly in place. What I love about Brooks, at least in his early movies (i.e. everything before Defending Your Life) is that he is not afraid to totally take upon himself the traits which he means to ridicule. He's often been compared to Woody Allen but I think the differences are important. In all his films, Woody Allen takes himself to task, relentlessly analyzes and criticizes himself, shows us his weaknesses and flaws, etc. - but then undercuts it all by playing for our affection with his cutesy physicality and his meant-to-be-adorable one-liners. Brooks doesn't *want* you to love him, he delights in heaping one annoying trait after another upon himself and portraying it to its full, uncensored extent. He doesn't do one-liners or gags - instead, he embodies the personality of someone who would be the butt of such gags or one-liners, and the embodiment is what is meant to be funny. For example, in this movie, there is an amazing 15 minute sequence near the beginning where Brooks, having just dumped his girlfriend, putters around his apartment pep talking himself into feeling good and succeeding only in becoming more and more miserable. The delusion and self-absorption on display is monumental, and it's given a kind of grandeur by the amount of time focused upon it - you could almost label the scene \"The Narcissist's Aria.\" It's annoying as hell, and I couldn't blame anyone for being totally turned off by it. And yet, that annoyingness is exactly the point, and what makes the scene so hysterical. Brooks' performance here is nothing short of brilliant - the kind which would surely take home an Academy Award for Best Actor in a Comedy if such a category existed at the Oscars. Think of Albert Brooks here as George Costanza on \"Seinfeld\" - only with his monomania squared simply from having no close friends to interact with and bring him down to size. If that seems like torture to you, keep right on moving when you see this one in the video store aisle. However, if you always secretly wondered what George would be like if he got his very own show - well, here's the closest approximation of a pilot episode that you're ever likely to find.",
         "If you're an Albert Brooks fan already and you haven't seen this one yet, get set to become an even bigger fan once you do. This ranks with \"Lost in America\" as one of his two best, and in many ways this takes the prize. It's as funny and painful a view of a dysfunctional person as has ever been put on film in the name of comedy. In other words, it's better than all but the very best of Woody Allen. And that's saying a lot. In fact, Brooks's own persona is more likeable and more identifiable than Woody's--and Kathryn Harrold is unbelievably attractive in the female lead.",
         "MODERN ROMANCE is one of the great unsung film comedies. It's not for everyone, in that the comedy is possibly too close-to-the-bone for people who like their comedy nice and painless. But in the post-Seinfeld era, when Curb Your Enthusiasm is a cult favorite, it is looking more and more like Modern Romance was WAY ahead of its time. Real Life, Lost In America, and Defending Your Life are all great, but for some reason this film stands out to me as Mr. Brooks' greatest cinematic effort. (Stanley Kubrick was a fan, too-- he was trying to make his own film about jealousy, which would end up being EYES WIDE SHUT two decades later.) The real shame is that this film is the only Brooks effort never released on DVD. We can only hope that Criterion might rescue it from oblivion with a nice special edition (with commentary by Brooks!)",
         "I do like Albert Brooks. As an actor. As a writer and director, his movies fall short of funny, happy to be amusing. Modern Romance is par for the course. Only in the exchange with Medowlark Lemon does the movie come close to explaining Brooks' neurotic obsession with his girlfriend: she's out of his league. We don't know enough to understand why she's with him; the movie is more interested in his antics. Not only is Brooks' character narcissistic, his movie is too. The foley scene, the shopping excursion, the Hollywood party are all deftly handled and expertly underplayed. I truly believe that Brooks can find the humor in anything. But he's satisfied with too little in his movies, and his disregard for structure (in his early films) is both curious and frustrating. It's as if he thinks he can get away with less if he doesn't seem to be trying as hard. Essentially, Modern Romance is a 60-minute monologue with some situational humor mixed in. Is he in love with her, or with himself? That may be the point, but that makes me neither marvel nor laugh.",
         "Though only his second directorial outing, \"Modern Romance\" is arguably Brooks' finest film and is the single most insightful and hilarious examination of the gut-wrenching and mind-twisting ordeal that is love. Some have commented that the movie is not as polished as his later work, and while that may be true from a cinematic standpoint, it is this raw quality that lends itself to an even greater statement about how a man can be turned upside down and inside out as he tries to comprehend life while under the influence of love. Brooks' doppelganger, Robert Cole, is the epitome of the obsessed and doomed lover, a man who knows his love for a woman (brilliantly portrayed by Kathryn Harrold, as the haughty and insecure Mary Harvard) is unhealthy, but is compelled nevertheless to have her. His struggle with reason and love is the central theme to the film, yet even though Cole is depicted as an irrational neurotic, never once does Brooks make him unsympathetic. While Coles' actions in his pursuit of Mary defy reason, anyone who has ever been in love will understand all too well why he does the things he does. This is perhaps that only movie for which it can be said that every single scene -- nay, every line -- is hilarious. Spectacular performances from Mr. Brooks, Kathryn Harold, Bruno Kirby, and terrific cameos from James L. Brooks (no relation), Bob \"Super Dave Osborne\" Einstein (who IS Brooks' brother....Yes, Albert Brooks real name is....Albert Einstein!), George Kennedy and, believe it or not, Harlem Globetrotter Meadowlark Lemon, whose scene with Brooks is a moment of surreal genius. If for no other reason, see this movie for \"the movie within the movie\" that Brooks' and Kirby's characters are editing. I would say to those who, for whatever reason, do not like Albert Brooks -- either you find him irritating or just don't get his humor -- then do not bother, because Brooks is center stage for the entire movie and the humor is the very essence of \"Brooks-ian\". Yet even if the movie seems very personal, it speaks to all of the world's \"fools in love\", managing to embody and transcend the filmmaker. I happen to think he is one of the funniest and insightful observers ever of the human condition, but am aware his style is not universally loved. Though made in 1981, it is as resonant now as it was then; and, considering that people, against all rational thought, will forever fall in love, this movie will always have something very insightful and extremely funny to say. For what it's worth, I have over the years rated almost a thousand movies and TV shows here at IMDb, and have given less than 15 \"10 stars\". \"Modern Romance\" is one of those few films, and deservedly so. I am not saying the movie is not without its flaws; but because of the nature and subject matter of the movie, and because it is painfully obvious that Albert Brooks' personal experience is very much on display, those flaws actually add to the genius of the work.",
         "This is Albert Brooks at his neurotic, psychotic, hilarious best. If you are an obsessive person, especially when it comes to relationships, and you or someone you love always kind of feared that you're a big freak - a little too scary and weird - check out Albert Brooks' Robert Cole. You'll find that you aren't nearly as bad off as this insecure little man. Or at least I hope you aren't. It also has some really funny behind the scenes comments on Hollywood, as the character is a film editor in Los Angeles. After Broadcast News this is my favorite Brooks performance.",
         "I'll come straight out with it: This is my favourite film of all time. Albert Brooks is consistently the finest Writer, Director and Actor when it comes to the character driven comedy. And this is his finest moment. Robert Cole (Brooks) is a middle-aged, neurotic film editor, who continually breaks up and rekindles his relationship with Mary Harvard (Kathryn Harold). The film opens with a typically Brooksesk scene in a restaurant when he informs his girlfriend that things aren't working out. It is, perhaps, a measure of just how funny Brooks is that he even manages to be funny ordering an omelette; not intentionally, but funny nevertheless. What follows is the most brutal portrayal of what being insecure and neurotic can really do to you, and the empathy I experienced for Brooks' character is possibly unmatched by any other. I can appreciate that non-fans of Albert's might not fully appreciate this film - because it is so unashamedly Brooks - but I think most people will find something here to laugh-out-loud to, I know I laughed all the way through, and still do after dozens of replays. Make no mistake, watch this film today, and start to appreciate a genius who is under appreciated. Long live Albert.",
         "Brooks' astute observation on men's foibles when obsessed, love~wise, aims high... and hits every mark. His character's on~again, off~again boyfriend/girlfriend relationship with coke~sniffing Kathryn Harrold [in what is clearly her best performance in what turned out to be a quickly~disintegrating short career] is the basis for the film. And it's a winner, for most male romantics I'd presume. Or at least for me: I've done most of the sneaky things Brooks' character does at one time or another, while desperately in love. As with most of Brooks' works, this isn't laughing out loud funny: it's wry, subtle and makes some great statements on man's utter base incapability of understanding women. PS: In case you didn't know, Brooks' real name is Albert Einstein... his brother Dave also became a big star in the late '80s: as pseudo~daredevil \"Super Dave Osborne\"...",
         "If the world does indeed break down into Albert Brooks' fans and detractors, then I'm definitely in with the former. We are probably something akin to \"negatively charged quarks\" while the others are \"super strings?\" As an experiment, I wonder if a relationship could brook both sides of the Albert spectrum and last outside a vacuum?? Anyways, this is a fine 90 minute (so street legal as a feature film) comedy that feels shorter. The alert level for \"needy neurosis\" on this should be set as high as the scale goes. Indeed frequently we hit the \"cringe\" zone that Larry David is mining these days with his \"Curb Your Enthusiasm\" and earlier with Seinfeld. While there are not a lot of laugh-out-loud moments for me, I don't think that is why the film moves so quickly. I think Brooks is just economical with what he shows us, I rarely feel (in any of his films) that he ever stoops to the audience. For the pace of this film to keep up is a tribute to the fact that its focus is a relationship that is going nowhere. Even if it has to visit Idylwild to get to nowhere. I suppose there's a potential deeper level here in that people who look for trouble in a relationship, or in a sci-fi film with George Kennedy, can always find such trouble. Even if it requires looking to the level of ridiculous detail. Of course most films from 20 years ago are dated, and while the song-based humor, the quaalude interlude and answering machine are dated as dressing to the film, I really don't think the message is that far off mark today. If anything, I'd like to see Brooks take this a step further in the wake of Dr. Phil and others and deal with folks who NEED to have troubles in their relationships. If you are looking for trouble in this film, go in expecting to identify with Brooks. Even when he hits moments that most of us could connect with (some exasperation with a parent, odd confessions to a co-worker, jumping back into the dating pool too quickly, getting swindled by salesfolks), he usually carries it to the level of lampooning. It's funny for me, but I think some people want so badly to identify with such a lead character that they cannot let go at these moments. Anyways, I think this is a film worth seeing, indeed you probably should arrange to see it on cable with a potential boyfriend/girlfriend on one of your earlier dates. If you both like it, things are looking good. If you both detest it, likewise. One up and one down....hmmm, maybe try \"My First Mister\" as a backup test? 6/10",
         "Modern Romance is the most daring Albert Brooks film, and the funniest. He plays a film editor who is insanely jealous of his beautiful girlfriend. Even though the film is hilarious, it shares a similar dynamic with Raging Bull, which came out a few months before Modern Romance -- it focuses on a man who imagines his girlfriend is cheating on him, and yet it turns out not to be true. But even so, Brooks' character drives himself crazy with conjecture, imagining the worst. It is the flip side of trusting a girlfriend too much and then finding out she is sleeping with everyone. Modern Romance also reminds me of another dark drama, The Gambler from 1974, in which the protagonist is smart and charming but nonetheless seeks to sabotage himself with bad behavior. Why do people destroy themselves? Some people don't want to be happy, it seems. To get comedy out of this shows the genius of Brooks. Brooks' character, Robert Cole, is a successful film editor. We see him at work, and he is very creative and good at what he does. He is a control freak at work, making the most minute changes in the film he is working on, and he applies this same desire to control (to in effect \"direct\") his personal life. In a measure, he succeeds, because he is able to get his girlfriend to ultimately go along with what he wants, despite her misgivings -- and that's another issue to explore, why women fall in love with insecure or manipulative men and put up with their difficult personalities. Brooks is very brave in playing such a difficult character, and there is nothing warm and fuzzy about Robert Cole. Brooks never tries to get the audience to love him, whereas actors like Steve Martin or Robin Williams would try to take the hard edge off and make him lovable. Also impressive is Brooks spends a great deal of screen time by himself, talking on the phone, talking to himself, driving himself crazy and driving past his girlfriend's house, in effect stalking. He spends as much time alone as Travis Bickle in Taxi Driver. To turn all of this into comedy is a measure of Brooks' unique genius."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Robert Cole, a film editor, is constantly breaking up with and reconciling with long-suffering girl friend Mary Harvard, who works at a bank. He is irrationally jealous and self-centered, while Mary has been too willing to let him get away with his disruptive antics. Can they learn to live with each other? Can they learn to live without each other? The movie also provides insight into film editing as Robert and co-worker Jay work on their current project, a cheesy sci-fi movie.",
         "Albert Brooks directs himself as a successful film editor with far too many issues that affects the relationship between him and his remarkably patient girlfriend."
      ],
      "budget": 0
   },
   "movielensId": 5769,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-03-13",
      "dvdReleaseDate": "2006-05-02",
      "directors": ["Albert Brooks"],
      "runtime": 93,
      "movieId": 5769,
      "title": "Modern Romance",
      "mpaa": "R",
      "actors": [
         "Albert Brooks",
         "Kathryn Harrold",
         "Bruno Kirby",
         "James L. Brooks",
         "Jane Hallaren",
         "Bob Einstein",
         "Albert Henderson",
         "Meadowlark Lemon",
         "George Kennedy",
         "Tyann Means",
         "Thelma Leeds"
      ],
      "imdbMovieId": "0082764",
      "originalTitle": "Modern Romance",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["XuUkdVtFLlQ"],
      "plotSummary": "A film editor breaks up with his girlfriend, unsure if he is in love.",
      "tmdbMovieId": 63443,
      "avgRating": 3.56452,
      "releaseYear": "1981",
      "numRatings": 155,
      "posterPath": "/iDRBGabz2BqlqjidUOtTvYOaSli.jpg"
   }
}