{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0303326",
      "video": false,
      "title": "Derrida",
      "recommendations": [],
      "backdrop_path": "/rSJ4hsIbzxQpl3CtPyCjoYbHel6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 3,
            "character": "Himself",
            "gender": 2,
            "credit_id": "5821fbe4c3a36871f10002f9",
            "name": "Jacques Derrida",
            "profile_path": "/1TSY40b06ueuJAyYLl2XhxIiX5u.jpg",
            "id": 96989,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c19251416c9103d473",
               "name": "Kirby Dick",
               "profile_path": "/89dwzpAQaQE2xRfXmUNQr7xuGg1.jpg",
               "id": 112588,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe45c19251416c9103d479",
               "name": "Amy Ziering",
               "profile_path": null,
               "id": 994970,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.215589,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35935,
      "vote_count": 4,
      "budget": 0,
      "overview": "Documentary about French philosopher (and author of deconstructionism) Jacques Derrida, who sparked fierce debate throughout American academia.",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         297762,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Derrida",
      "runtime": 84,
      "poster_path": "/tSx2GYgyoyTgGVW2jWmRZdGzucp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [],
      "release_date": "2002-03-12",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Kirby Dick",
         "Amy Ziering"
      ],
      "runtime": 84,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0303326/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzMyOTQ0NjgyMl5BMl5BanBnXkFtZTcwMjY0NTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jacques Derrida, Marguerite Derrida, René Major | See full cast and crew »"],
      "reviews": [
         "If you've begun reading Derrida for the first time, there is nothing in this video for you. If you've come out on the other side of reading Derrida after a long time, there is nothing in this video for you. Then why watch it? Because it is a document of a man who remains--and will remain--one of the most important philosophers of the modern era. He is gone now, but if you've never seen him you have the opportunity in this video to look at him. This video is not the Cliff notes to a corpus of work. It is, instead, a look into the public and private life of a man who, like everyone of us, remains a mystery to strangers. And it is a dirty look, a pornographic eye, indeed, that does the looking. The creators are like groupies at a rock show, the ones that manage to weasel back stage passes. They know not enough to ask smart questions, ones that would make Derrida think. So instead, they follow the man around like stalkers, pointing their video camera into his private life: We watch, as did they, Derrida put jam on his toast, talk about his cat, walk through his house, walk through the street. It is as though the video makers were simply in awe of the fact that the man lives! The same video makers/groupies/stalkers made a video about/on/addressed to/following the cultural critic, Zizek. Similar result, except the latter looked an awful lot like promotional matter. And make no doubt, the co-creator of this video has said as much: \"There is a market for these videos,\" she said at the screening of Zizek in Amherst. Pornographer indeed. In short there is nothing in this movie that you need to see. But you do get to see everything. Derrida is gone now, but he once was alive. You can find him in his books, but if you want to gawk at him, then check out this video.",
         "A documentary can never be anything other than a director's interpretation of the subject. Making a documentary about a philosopher is a particularly difficult proposition; with most other subjects, we welcome and enjoy varying interpretations, but, with philosophy, we tend to resist variance, because the very aim of philosophy, at least until Post-Structuralists came along, has always been to arrive at the Truth. The challenge of a filmmaker here is that either you properly understand the philosopher, or you may potentially embarrass yourself, though, for the audience, either way could be interesting. \"Derrida\", a documentary by the established filmmaker, Kirby Dick, and a former student of Jacques Derrida, Amy Ziering Kofman, attempts to deconstruct the idea of biography itself, but it fails to do so. It takes only the trappings of deconstruction, stripped of its objectives, and applies it as an editorial gimmick by constantly reminding the audience of the film's own awareness of itself. It frequently steps back in an effort to show its self-awareness, but it actually deconstructs nothing. For example, we see Derrida watching himself being interviewed, and later we see him watching this very footage, thereby creating the effect of two facing mirrors with infinite reflections. The objective of deconstruction is to de-center, that is, to identify the center of the argument--or of the proposed truth--that it relies on in order to make its case. You may argue here that I have just made a logocentric statement by defining what deconstruction is, that I have just centered the definition of deconstruction (note the appearance here of stepping back); you are right (and I'm leaving it at that, because I'm only a hack philosopher.). The film did not succeed in de-centering anything; not the philosopher, the medium, the filmmakers themselves, nor the film itself. Throughout the film, the narrator reads excerpts from his books against the backdrop of abstract footage of Derrida's face and his surroundings. This effectively makes Derrida the chief story-teller of the film. Instead of presenting the filmmakers' interpretations, they hide behind the power of his words, taking no chances at misinterpretation. Derrida is involuntarily made to be the center that secures and stabilizes the film. Ironically, this film that supposedly tries to explore deconstructionism and apply its tools to the medium of filmmaking finds a secure center in Derrida, and he is left un-deconstructed. We can feel the insecurity of the filmmakers in often not knowing what to ask their subject. Derrida, out of his affection for the filmmaker, tries hard to turn Kofman's dull questions into something more interesting. The camera, in effect, takes on the perspective of someone who adores him like a rock star. If the film were aware of its own insecurity, it would have been more interesting. Instead, it simply hides behind its own reverence and awe of the famous philosopher. One way to achieve this deconstruction would have been to hire multiple filmmaking crews where each goes off in its own direction, and presents a 20 minute piece each. The chances are, each will draw a very different picture of Derrida. By presenting them in sequence, the audience will wonder who Derrida really is, and they will inevitably question the process of documentary filmmaking itself, thereby deconstructing not only the idea of Derrida, but also the idea of documentary. Although I have always been an admirer of Ryuichi Sakamoto, his music in this movie was superfluous. The power of his music attached unnecessary, and often inappropriate, emotional values to the images of Derrida. I can't see any justification for emotionally manipulating the audience in this film, unless it was to deconstruct the use of music in film, which it did not. Towards the end of the movie, Derrida tells Amy Ziering Kofman that this will be a good autobiography for her. It should have been, but unfortunately it isn't a biography for either Derrida or Kofman. What this movie is to Derrida's philosophy is analogous to what music video is to a piece of music; the imagery is only superficially juxtaposed to his ideas. It is no more than a pretty way to listen to his words. One redeeming quality of this movie was that I got to see and hear him speak for the first time. After all, I'm a sucker for fame too. If I made a documentary about him, I'm sure I would have been just as nervous and insecure, if not more. In that sense, I have to praise the filmmakers for attempting.",
         "This could have been a real disaster, and even though the movie triggered a couple of cringes, it wasn't the expected trainwreck. \"Derrida\" was not too much of a waste. Thinking is a very difficult subject for a documentary. When filmmakers decide they want to present a great thinker, they are presented with a difficult decision: should they make a straightforward documentary concerned only with transmitting knowledge, or should they use the form to reflect the content of the thinker's work? Is accessiblity the goal of a documentary? And how much can we dilute for accessiblity's sake? I think this is one of the few cases where striking a balance between a dichotomy doesn't work. In \"Derrida\" the directors were trying to experiment with form and create a new audience for Derrida's work. They wanted to document Derrida's thinking. They wanted to archive the man's presense and present Derrida to a new audience. However, they felt that using the standard documentary/biography format would make Derrida's work superficially accessible. They didn't want to commit such an insult. Yet, they were not willing to alienate the audience. Thus, \"Derrida\" only registers as a lukewarm essay. The directors took an approach that is sold on today's market as \"Self-reflexivity, the dummy's guide to artsy.\" \"Derrida\" is a series of vignettes where Derrida explains his relationship to the camera and the process by which his presence is recorded. It is a total exercise in metadiscourse, and unfortunately, this theme provides plenty of stupid irritating gimmicks with which \"Derrida\" proves not your standard documentary but your undergraduate film school festival The rewarding aspects of this film are not the formal experiments or anything relating to the fact that Derrida is presented as a moving image, but rather watching Derrida speak about the camera, the archive or the image. There are some excellent shots of Derrida at work. We witness his careful footwork in the field of discourse, and the director chooses the very potent passages to outline Derrida's duties as performer for no one and the role of the filmmaker in using Derrida's words to present her story. However, the director tells no story. The film offers very little beyond problematizing the roles of the actors in this production of \"Derrida.\" And, I think what was presented would be best preserved in an essay than the series of vignettes called \"Derrida.\"",
         "I've never written a review on this site, mostly because I find that most reviews are fair and well-meaning that, for the most part, aim to get at the root of the film itself. However, I was compelled to write something about \"Derrida,\" because, for whatever reason, reviewers of the film have largely ignored the filmmakers' intent and, even worse, in some cases, used their review as a platform to air pent-up grievances about this celebrated thinker. Simply put, \"Derrida\" is a wonder: a disarming, captivating film that alchemizes a seemingly un-filmable subject--the daily life, travels, and thoughts of a brilliant philosopher--into a convincing, wholly cinematic portrait. As the above reviewers suggest, this is no bio-pic. There is no omniscient, James Earl Jones voiceover here. The film doesn't attempt to teach deconstruction, nor does it offer any Ken Burns-like, definitive world view. Instead, co-directors Kirby Dick and Amy Ziering Kofman follow the trail blazed by Frederick Wiseman and the Maysles Brothers--cinema verite pioneers who recognized that voiceover, forced narrative arcs, and easy psychological explanations of character often distort and dilute the truth of a person or event. As the Maysles brothers did in \"Salesman\" and \"Grey Gardens,\" among other films, Dick and Kofman spent years with their subject, slowly gaining the trust of this notoriously camera-shy man, following him without a narrow agenda, and open to whatever occurred in front of them. In the process, Dick and Kofman successfully capture unguarded moments and unexpected events--including quiet breakfasts, intimate conversations about his family, and revelatory interviews -which, ultimately, challenge our preconceptions of Derrida, while deepening our fascination with his mind and life. Years from now, when Derrida has left us, it will be easy to present a Crossfire-like discussion on the merits and value of his thinking. If inclined, one could even dredge up shady details of his past. However, I would strongly argue that nobody will able to provide the kind of illumination that \"Derrida\" offers--an unfiltered and tantalizing look at one of the most creative and influential minds of today.",
         "This film is a demonstration of deconstructionist thought first; and its subject happens to be the \"father of deconstructionism.\" Once you get over this situation, it's a somewhat charming film, a sort of video fugue. The film presents an important theme early on, when Derrida quotes Heidegger (quite fittingly because much of Derrida's writings are based upon Heidegger's philosophy) about Aristotle's life: he was born, he thought, and he died. And the rest is pure anecdote. This is pretty much all this film says about Derrida. Listening to the commentary on the deleted opening scene in the extras on the DVD is quite helpful, and can give you an idea if you want to continue to watch. I liked how much this film touches on the issues of celebrity, privacy, and media saturated culture, without focusing on a mega-pop celebrity. I'd have liked to have been more succinct, but this forum requires ten lines. Too bad.",
         "After reading the rest of the reviews by the \"critics\" I realized a pattern -- all of them are familiar with Derrida and would love to know more about this man who apparently is very private. The film is like \"a day in the life\" to a certain degree so for those who always were dying to know what this man is like, it is extremely exciting for them. I was shocked and appalled that they praised this movie which is nothing short of ludicrous and absurd. Most of the critics lost complete perspective in their zeal to learn more about Derrida, a man who they know little about personally, and fail to criticize the film which really is a whole group of missed opportunities and is done in very amateurish fashion. There are some golden moments but they are few and far between and could easily have been summarized in a 15 minute documentary rather than a full feature that seems only to try to prove, by \"deconstructing\" the documentary process that it is virtually impossible to do a documentary because the subject is aware of the camera and then doesn't act completely naturally. Unfortunately, the producers ram this point home with inane, superfluous shots of life designed to illustrate a phrase that a reader read in new age monotone, thus failing to even attempt to capture much of the mystery that the man is shrouded within and focus more on vague, abstract clips. Quite frankly, I thought the film was somewhat insulting to Derrida. I wasn't sure if many moments were an attempt to provide comedy in the film to keep the audience interested at the expense of the subject. The critics can spout abstract praise and make comments about philosophy and deconstructionism (hoping to feel a \"superior\" thinker to the audience) but what this comes down to, unfortunately, is a very poor film with little preparation, poor questions, no follow up, no direction at all (regardless of the mystery of deconstruction, isn't the point of most films to captivate the audience?) that will only be interesting for fans of Derrida who want to see a little bit of this man's personality -- and even that is limited. I've become interested to find out what my friend found so interesting in Derrida's philosophy and I got nothing from it in this film.",
         "I'll do my best, but nothing can really prepare you for the terribleness of this documentary. You can see Derrida squirm under the facile or pretentious questions posed by the interviewer. Add to this, there are three cameras filming at the same time; frequently when Derrida is in a small room, so that the cameras spend most of the time filming each other. This puts Derrida on the back foot (to use a cricketing term). They fill out the rest of the documentary with footage of him walking or spreading butter on his toast. Quotes are read out from his books that mainly relate to autobiography, but even this simple task is messed up with poor delivery.",
         "- includes spoilers - One might say that deconstruction is a somewhat ambivalent movement; subject to great interpretation, its foundations and place in history unsecured, like much that is fashionable in philosophy, fueled primarily from the periphery, idolized by the young, and driven to significant extent by personality. I went into this film hoping to catch a glimpse of Derrida's charisma and in this regard, was not entirely disappointed. Yet I found Derrida ultimately to be a lost opportunity. Here are some ruminations on why. Firstly, the questions posed to Derrida by the interviewers seemed naive and childish - not however in the philosophical sense of \"thaumazein\", of innocence and wonder. The questions had the quality of distant acquaintances making conversation where there is little to say. Particularly telling was the open question on love. The question was poorly phrased. Too general. JD points this out. The question was rephrased several times; Derrida tries his best to help his inept interlocutor, to no avail. The entire scene is simply an embarrassment, but is indicative of too much of the film. What is no doubt of great interest about Derrida is, as his brother points out, his productivity as a man of letters. Derrida obviously was someone who worked with facility, was creative, and certainly comes across in his cinematographic namesake as a pleasant, mild-mannered and charming man. I would like to suggest that any film that would do justice to a writer would show him at work. We never see the subject of this film at work. We never see Derrida write. We never see him editing a draft or galley or making notations in a book. We never see him in anything that might be considered a \"professional\" philosophical discussion (we do see him smiling benevolently at fawning female admirers after a lecture). Nowhere in this film do we see this man of great energy showing any power, using his talent, under any kind of duress or faced with any challenge. If the mini-interviews in the film had been better (well) conceived, we might have been privy to some interesting discussion (as we are, for example, in the excellent series of interviews in \"Men of Ideas\" hosted by Bryan Magee). Yet this rich opportunity has been forfeited. I have tried to point out some things that a viewer with reasonable expectations might expect from a full-length documentary about a writer, thinker, or philosopher. Films about philosophers are rare. The subject matter is inherently difficult (productive output, toil with the quill, pretty well excludes an exciting life). Some focus on the core of that life, work, writing, thinking, is necessary to do justice to the protagonist. The upbeat tone of the film, its superficiality, the film's musical score distract from the film's deficiencies. In the end, one wonders if Derrida's contribution to philosophy is great, and the film's makers had several years to devise ways to show the greatness of Derrida whom they obviously admire, why do we find only watery soup on the table? Even if a neutral observer, delighted when others share their hero, I find it a pity that the film not only does not succeed in \"deconstructing\" Derrida (as much of the press materials on the film's website would have us believe), but, following one widespread habit of postmodern style, manages to skirt and circumscribe content. If there is achievement to pay tribute to, it has been kept well out of view. Inevitably one must ask, why? And one fears the answer. The film does not bode well for Derrida's posthumous reputation.",
         "this isn't going to be a \"deconstruction\" of the dick/ziering film entitled \"derrida.\" i wouldn't be qualified to offer one, so i won't even make an attempt. this is merely a random assemblage of my thoughts regarding the filmtext................ derrida was one of the most powerful, iconoclastic philosophers of all time. deconstruction is essentially about the DELEGITIMATION of texts, i.e., the process of exposing their LACK of relevance and truth value. hence, a deconstruction of the bible would \"prove\" this text to be of LIMITED truth value or relevance. (take THAT Christians!) if we are to evaluate philosophies, perhaps we should judge them on the basis of what they are capable of deconstructing. in which case deconstrution would prove to be the most powerful philosophy, since it is capable of deconstructing just about anything................ that said, \"derrida\" does not portray the philosopher of deconstruction as an iconoclast. it doesn't envisage derrida as one of the (Christian, Jew, and Moslem-eating) \"lions\" of postmodern thought. instead, it presents him as a toothless, aging, declawed, castrated feline mewing by the fireside. a complacent member of the bourgeoisie enjoying his petty privileges. if you watch this film, you might get the idea that deconstruction is a cute, \"homey\" kind of philosophy designed to reassure the middle classes................",
         "There is little I can write that other reviewers have not already, skillfully written. The film was a gutting disappointment in regards to portraying segments of the life of a brilliant philosopher. The filmmakers were dim when it came to asking stimulating questions, and (gleeful to watch) Derrida called them out and/or mocked them for this on occasion. Too, the American interviewer lacked the French necessary to do the man justice. What is also bothersome: the filmmaker's readings of Derrida quotes. It seems so self-involved. Why not have Derrida read them? Also, while Derrida touches on issues of masculinity and philosophy, the words would have still been better read by a man, if for nothing more than auditory pleasure/consistency. The filmmaker drew far too much attention to herself rather than the incredibly intelligent man she was interviewing. I agree entirely with the reviewer that said the filmmakers were like groupies. Indeed. Seemingly dimwitted, self-involved groupies, at that."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Jane Doe Films"],
      "summaries": ["Documentary about French philosopher (and author of deconstructionism) Jacques Derrida, who sparked fierce debate throughout American academia."],
      "budget": 0
   },
   "movielensId": 5783,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2002-03-12",
      "dvdReleaseDate": "2004-01-20",
      "directors": [
         "Kirby Dick",
         "Amy Ziering"
      ],
      "runtime": 84,
      "movieId": 5783,
      "title": "Derrida",
      "mpaa": "",
      "actors": ["Jacques Derrida"],
      "imdbMovieId": "0303326",
      "originalTitle": "Derrida",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Documentary about French philosopher (and author of deconstructionism) Jacques Derrida, who sparked fierce debate throughout American academia.",
      "tmdbMovieId": 35935,
      "avgRating": 3.40805,
      "releaseYear": "2002",
      "numRatings": 87,
      "posterPath": "/tSx2GYgyoyTgGVW2jWmRZdGzucp.jpg"
   }
}