{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0058212",
      "video": false,
      "title": "How to Murder Your Wife",
      "recommendations": [
         24109,
         55863,
         43788,
         43348,
         34390,
         39479,
         22408,
         27465,
         64963,
         64071,
         27224,
         39948,
         90231,
         43008,
         60504,
         88359,
         30787,
         6587,
         78852,
         114740
      ],
      "backdrop_path": "/qEydpbcpbNwLQ51VAWm1C3UywAL.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5611f45bc3a368680b013dbd",
         "content": "Lemmon unable to save this from averageville.\r\n\r\nCartoonist Stanley Ford loves bachelorhood, he enjoys his life, he has a butler to serve him, he can get girls, and he likes a drink or two. Then one night he's at a bachelor party and the beautiful Virna Lisi pops up out of the cake, his life is about to change. For when he wakes up in the morning, he finds he has married her, and to compound his problems, she doesn't speak any English.\r\n\r\nAs a big Jack Lemmon fan I have to say I'm very disappointed in this picture, it's essentially a two joke movie that wastes Lemmon and Terry-Thomas' talent. The first half of the picture plays heavy on the fact that the new Mrs Ford only speaks Italian, this sets us up for a number of funny sequences, particularly when Claire Trevor enters the fray as Edna, but on it goes, and on it goes... We then get to watch as Stanley gains weight due to Mrs Ford's willingness to cook for her new husband, with Lemmon reduced to playing Stanley as an exasperated buffoon, henpecked within an inch of his manhood.\r\n\r\nThe second half of the picture, as the title suggests, sees Stanley grow a spine and decide to deal with his problem by killing the wife. You would think that this sets the picture up for a number of riotous sequences as Stanley tries to do away with her, but sadly no, it's just the one joke that fails to light up the picture in any shape or form. The run in to the finale is marginally saved by the always reliable Eddie Mayehoff, but come the credits you wonder if the film ever meant to be a full blown comedy in the first place? 4/10 for Mayehoff and Terry-Thomas' opening scenes.",
         "url": "https://www.themoviedb.org/review/5611f45bc3a368680b013dbd"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Stanley Ford",
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471cb",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mrs Ford",
               "gender": 1,
               "credit_id": "52fe4513c3a368484e0471cf",
               "name": "Virna Lisi",
               "profile_path": "/pQChU2eXwZ63rLuWF6cadyPlsJC.jpg",
               "id": 31895,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Charles",
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471f7",
               "name": "Terry-Thomas",
               "profile_path": "/tdsN3NUsBNEPtHkWX5BskfG7yCi.jpg",
               "id": 29427,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Harold Lampson",
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471fb",
               "name": "Eddie Mayehoff",
               "profile_path": "/b1cBCUoNnpGGmpBCzZ2U0wCOmWP.jpg",
               "id": 148744,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Edna",
               "gender": 1,
               "credit_id": "52fe4513c3a368484e0471ff",
               "name": "Claire Trevor",
               "profile_path": "/6RMb6vmgxfTpSWF7fggD0kYnP19.jpg",
               "id": 14965,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Judge Blackstone",
               "gender": 2,
               "credit_id": "52fe4513c3a368484e047203",
               "name": "Sidney Blackmer",
               "profile_path": "/ijI8tIlurlyyVTZYgZvoiifrMi3.jpg",
               "id": 12022,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Tobey Rawlins",
               "gender": 2,
               "credit_id": "52fe4513c3a368484e047207",
               "name": "Max Showalter",
               "profile_path": "/kWgtaI5mcCML9PeZ6Ak9qTHkBw3.jpg",
               "id": 85409,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Dr. Bentley",
               "gender": 0,
               "credit_id": "52fe4513c3a368484e04720b",
               "name": "Jack Albertson",
               "profile_path": "/8vmSxUnRqZ23bCWMim2Y1pOvSAD.jpg",
               "id": 3461,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Harold's Secretary",
               "gender": 1,
               "credit_id": "52fe4513c3a368484e04720f",
               "name": "Mary Wickes",
               "profile_path": "/eVNN8YtXFYGGO7uzaA7SqlVFe63.jpg",
               "id": 20624,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Bald Actor playing Thug",
               "gender": 2,
               "credit_id": "52fe4513c3a368484e047213",
               "name": "Khigh Dhiegh",
               "profile_path": "/mUon7SegV4Glu0xVKiqg9kFnOPs.jpg",
               "id": 14734,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Club Member in Steam Room",
               "gender": 2,
               "credit_id": "5357117c0e0a2636f40004d0",
               "name": "Barry Kelley",
               "profile_path": "/q1t3gNvtx0A4pGHEGUJATuMIrwZ.jpg",
               "id": 89834,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Construction Worker",
               "gender": 2,
               "credit_id": "535711a00e0a2636e5000475",
               "name": "William Bryant",
               "profile_path": "/pDCdDtLA4hmrdLtXoB4ZzexMPEp.jpg",
               "id": 97281,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Club Member in Steam Room / Party Guest",
               "gender": 2,
               "credit_id": "535712050e0a2636e80004ce",
               "name": "Edward Faulkner",
               "profile_path": null,
               "id": 78386,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Men's Club Manager",
               "gender": 1,
               "credit_id": "5357121d0e0a2636fd00046c",
               "name": "Lauren Gilbert",
               "profile_path": null,
               "id": 19788,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "The Trial Judge",
               "gender": 0,
               "credit_id": "535712410e0a2636e5000486",
               "name": "Howard Wendell",
               "profile_path": "/vMzTLs16JgRkveZmESmkYPZgsh.jpg",
               "id": 48961,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Party Girl",
               "gender": 0,
               "credit_id": "535712790e0a2636fa00046e",
               "name": "K.C. Townsend",
               "profile_path": null,
               "id": 1312448,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Club Member in Steam Room",
               "gender": 2,
               "credit_id": "56633eadc3a3682bd00045a3",
               "name": "Charles Bateman",
               "profile_path": null,
               "id": 151689,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471d5",
               "name": "Richard Quine",
               "profile_path": "/bkCUG3gSO3XlvHjwO2FRy0cOYko.jpg",
               "id": 18907,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471db",
               "name": "George Axelrod",
               "profile_path": "/8WXlbXdMmk6fVB5EgqkSV5001Te.jpg",
               "id": 1931,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471e1",
               "name": "George Axelrod",
               "profile_path": "/8WXlbXdMmk6fVB5EgqkSV5001Te.jpg",
               "id": 1931,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471e7",
               "name": "Neal Hefti",
               "profile_path": null,
               "id": 16891,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4513c3a368484e0471ed",
               "name": "Harry Stradling Sr.",
               "profile_path": null,
               "id": 10537,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4513c3a368484e0471f3",
               "name": "David Wages",
               "profile_path": null,
               "id": 1051412,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.856231,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26685,
      "vote_count": 38,
      "budget": 0,
      "overview": "Stanley Ford leads an idyllic bachelor life. He is a nationally syndicated cartoonist whose Bash Brannigan series provides him with a luxury townhouse and a full-time valet, Charles. When he wakes up the morning after the night before - he had attended a friend's stag party - he finds that he is married to the very beautiful woman who popped out of the cake - and who doesn't speak a word of English. Despite his initial protestations, he comes to like married life and even changes his cartoon character from a super spy to a somewhat harried husband.",
      "similar": [],
      "original_title": "How to Murder Your Wife",
      "runtime": 118,
      "poster_path": "/1lwxAeN3OGXkoPH9DzZrRtA7XK0.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Murder Inc.",
         "id": 22136,
         "origin_country": ""
      }],
      "release_date": "1965-01-26",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Bring The Little Woman...Maybe She'll Die Laughing!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Quine"],
      "runtime": 118,
      "synopsis": null,
      "writers": ["George Axelrod"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0058212/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4Mzk2NDg1OF5BMl5BanBnXkFtZTcwMjk1ODAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Virna Lisi, Terry-Thomas | See full cast and crew »"],
      "reviews": [
         "Neil Hefti's music is wonderful. He parodies spy thrillers and sex comedies in one clever score. He uses horns for the sex farce and echoes of the same horns for the spy parody. Simply brilliant. I saw this movie when it came out and I remember more details than any movie I've seen. It made an amazing impression on me - at age 14. I was fascinated by the NY townhouse with that tiny front door right next to the single car garage with the electronic opener. Then there's the glopita glopita machine and the world's most powerful remote control. And, today, it is still as funny as ever. Terry Thomas as the butler and on screen narrator is bragging away about his all-male world, when... Virna Lisi arrives as Mrs. Ford. I know that many think it is an unadulterated attack on women, wives, and marriages. But, in an odd sort of way it lays bare the reality of human relationships. Everyone in every relationship that has lasted over the years has fantasized about killing the other person. It isn't a fantasy we want to come true. We've all thought at one time or another, \"I'll kill myself and that will show'em!\" Remember, that, at every step of the way it is clear that Mr. Ford loves Mrs. Ford - Bash lays Mrs. Brannigan on the bed, covers her with a blanket, and kisses her just as he's off on his caper to murder her. It is certainly one true that the movie is dated as are 50's and 60's sex farces. But, the thing about this one is that it is so clever and it goes to such extremes even with the title. \"How to Murder Your Wife.\" Indeed! But part of the fun of this movie is that it is so unpredictably predictable. We want to suspend disbelief for this movie. We want to laugh along. It is said that this is one of Jack Lemmon's favorite movies - except for the murder trial. Funny thing is I thought the trial set the perfect notes for this farcical send-up of male fantasies.",
         "I really want to recommend this movie to you. Sure, it has a weak third act which pounds a particularly misogynistic message. And the end is so formulaic it hurts. But up until then, it classifies as among the best of comedies. I have a particular admiration for it as what I think is the first example of a cartoonist whose drawings interweave with his life. Its a clever idea at root but handled with extra sophistication here. The setup is that our hero (Jack Lemmon) is a cartoonist who draws himself in his strip as a sort of James Bond character. But before he draws each strip, he actually acts it out as movies that we see in the movie within the movie. (How he hires the actors and arranges the locations is a detail left unexplained.) Thus, strip and life have a relationship within the story proper. Much is made of conflating the movie, the life depicted in the movie, the strip, and the movies within. He ends up with an unwanted (well, sort of) wife and acts out her murder. Since she left in a huff, he has no defense when his readership (the whole country it seems) accuses him of real murder. The pinnacle of this confabulation comes when his butler comes to the realization that the murder has actually been real with the enactment an alibi. Things go downhill from there. But until that point, this is sublime, a comic \"Draughtsman's Contract.\" See it. Ted's Evaluation -- 3 of 3: Worth watching.",
         "Jack Lemmon is at his comedy best, in the genre of some like it hot, while his gorgeous co-star here is not Marilyn but Italian Virna Lisi beckons all of us to speak Italian. She cooks, she kisses, she cooks .......all while looking like the best of Gina Lolabrigida and Marilyn Monroe wrapped in silk (the white dress in the party scene is breathtaking). The Classic Terri Thomas shows once again his comedic under used genius as the English genteel butler. The court testimony of Terri is almost worth the film. Jack Lemmon goes on to make so many great films while we are left to Italian dubs of Virna best. She has had a stellar career in Italy as she has ages oh so gracefully. At 68 she is still a babe. Virna and Sophia as a 70 year old women show the pure glory of womanhood. With How to Murder Your Wife I laugh, I lust and I so enjoy the early sixties social comedy films that are absent Rock Hudson.",
         "I enjoyed \"How to Murder Your Wife\" immensely. The ordered, luxurious single world enjoyed by Jack Lemmon as Stanley Ford is forever altered by his inebriated marriage to absolutely gorgeous Virna Lisi, the most stunningly beautiful actress of her era. Their love-at-first-sight eye contact scene at a bachelor party is outstanding. The score is fantastic (I have recently purchased a mint LP) and provides the perfect accompaniment to the film. I stumbled upon this gem via DVR last month- see it if you can. The closing scene is certainly dated and not politically correct, but suspend your disbelief and enjoy the ride.",
         "Entertaining and enjoyable comedy which unfortunately is too long for the premise on which it is based, although Lemmon gives his usual faultless comic performance in the lead role of a successful cartoonist who wakes up one morning to find himself married following the previous drunken evening. However, the high point of the movie is undoubtedly Terry-Thomas' pivotal but underwritten performance as Lemmon's gentleman's gentleman whose concern for his employer's changed circumstances is as much as a result of his genuine desire to protect Lemmon's well-being as it is to avoid his own obsolescence.",
         "Jack Lemmon and Terry-Thomas are great, of course, but some of the outstanding supporting players should be mentioned: Virna Lisi, absolutely gorgeous (and funny!) as Lemmon's \"ball-and-chain,\" and the relatively unknown Eddie Mayehoff, who plays Lemmon's lawyer. Mayehoff's courtroom epiphany is hilarious. This guy steals every scene he's in from Jack Lemmon, and that's not easy. Special mention should be made of Neal Hefti's sprightly score, one of his best. Love to have it on CD.",
         "This was the last of the three comedies that Jack Lemmon made in the middle 1960s that he hated. Like GOOD NEIGHBOR SAM (and not like the abysmal UNDER THE YUM YUM TREE) HOW TO MURDER YOUR WIFE had a clever script and good production. Lemmon played a successful cartoonist who carefully scripts and photos the scenes he will use in his detective adventure strip. He lives in a townhouse, complete with top rate valet (Terry-Thomas) and has a wonderful life as a bachelor. But while attending a stag party, he meets Virna Lisi, and takes her home. Apparently he has married her (the groom at the stag party had broken up with his fiancé before the party, and throws the wedding ring out - and Lemmon uses it). As a result Lisi starts domesticating him, and Terry Thomas walks out. Lemmon uses the changes in his lifestyle in the comic strip, but finally he revolts and kills off the comic strip version of Lisi. When Lisi sees this she walks out, but everyone thinks that Lemmon killed her. So the scene is set for a murder trial. This is not a film for feminists. It takes a dim view at the effect of domestication on Lemmon (and his lawyer, a hysterically funny Eddie Mayehoff). But I point out that before the end Lemmon does admit he misses the domestication. Even Terry-Thomas gives into it at the conclusion. It still a good comedy, a worthy minor work if not one of the high points in Lemmon's acting career.",
         "This is an excellent and underrated movie that deserves accolades. Sure, it had a great cast and I feel that Lemmon was at his best, naturally using his acting skills and not so much yelling with force as some of his other comedies. What most everyone fails to mention in the comments is the incredible skill of Virna Lisi. She is a natural mixing it up with Lemmon, Tevor and the other veterans like she had been making movies for years. I have watched many movies in my day and I must say that Virna Lisi is right at the top, not only in beauty and sexuality but in carrying her role as good as anyone else could have. Ms. Lisi, my hat is off to you.",
         "A Jack Lemmon classic! One of his best films. It has been some years since I've seen this film. However, it is one of those films that has remained firm in my memory as being enjoyable to watch. Also from the previous comments made, my memory has definitely been jogged! The film is excellent from start to finish. Comical scenes in the solicitor/attorney's office, the party, and the gentlemen's club are most memorable - especially the court room!",
         "Many will gripe about the sexist views, but watch this flick for the lifestyle that is portrayed. Stanley Ford (Lemmon) works out at his men-only club...in full grey sweats (the scenes in the \"gymnasium\" are priceless)...then he drives home in his 1965 Lincoln convertible (top down, of course) and parks in his exclusive, street level garage, and enters his wild multi'level bachelor pad...furnished, and decorated to the max. Get over the social stigma, and enjoy the ride, by the way, many of the \"wifes\" are depicted as much sharper than their dog-like husbands. You have to watch the artwork in Stanley's apartment, the depiction of the \"Club\", the jogging track, the action at the parties, the booze, the dress....amazing"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Murder Inc."],
      "summaries": [
         "Stanley Ford leads an idyllic bachelor life. He is a nationally syndicated cartoonist whose Bash Brannigan series provides him with a luxury townhouse and a full-time valet, Charles. When he wakes up the morning after the night before - he had attended a friend's stag party - he finds that he is married to the very beautiful woman who popped out of the cake - and who doesn't speak a word of English. Despite his initial protestations, he comes to like married life and even changes his cartoon character from a super spy to a somewhat harried husband. When after several months he decides to kill off Bash's wife in the cartoon, his wife misinterprets his intentions and disappears. Which leads the police to charge him with murder.",
         "Stanley Ford is a happily unmarried man with all the creature comforts one could desire, including a wonderful butler who takes care of all his material needs. At a bachelor party for a friend, Ford gets drunk and wakes up married to an Italian woman who speaks nearly no English. It totally alters his life. He even changes the cartoon he writes and shifts it from a secret agent to a household comedy. When he begins to have trouble with all of these changes, he starts to plot that at least his secret agent cartoon will return to order and plans, in his daily comic strip, killing his wife. When she disappears, the cartoons are used as evidence at his trial.",
         "A man who has set up the perfect lifestyle for himself makes the mistake of marrying while drunk... and his fantasies of murder are used against him."
      ],
      "budget": 0
   },
   "movielensId": 5800,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1965-01-26",
      "dvdReleaseDate": "2002-10-15",
      "directors": ["Richard Quine"],
      "runtime": 118,
      "movieId": 5800,
      "title": "How to Murder Your Wife",
      "mpaa": "",
      "actors": [
         "Jack Lemmon",
         "Virna Lisi",
         "Terry-Thomas",
         "Eddie Mayehoff",
         "Claire Trevor",
         "Sidney Blackmer",
         "Max Showalter",
         "Jack Albertson",
         "Mary Wickes",
         "Khigh Dhiegh",
         "Barry Kelley",
         "William Bryant",
         "Edward Faulkner",
         "Lauren Gilbert",
         "Howard Wendell",
         "K.C. Townsend",
         "Charles Bateman"
      ],
      "imdbMovieId": "0058212",
      "originalTitle": "How to Murder Your Wife",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["BVWH4qCdyFs"],
      "plotSummary": "Stanley Ford leads an idyllic bachelor life. He is a nationally syndicated cartoonist whose Bash Brannigan series provides him with a luxury townhouse and a full-time valet, Charles. When he wakes up the morning after the night before - he had attended a friend's stag party - he finds that he is married to the very beautiful woman who popped out of the cake - and who doesn't speak a word of English. Despite his initial protestations, he comes to like married life and even changes his cartoon character from a super spy to a somewhat harried husband.",
      "tmdbMovieId": 26685,
      "avgRating": 3.42593,
      "releaseYear": "1965",
      "numRatings": 162,
      "posterPath": "/1lwxAeN3OGXkoPH9DzZrRtA7XK0.jpg"
   }
}