{
   "tmdb": {
      "original_language": "fa",
      "keywords": [
         {
            "name": "society",
            "id": 3679
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "human nature",
            "id": 206706
         },
         {
            "name": "iranian new wave",
            "id": 209997
         }
      ],
      "imdb_id": "tt0246266",
      "video": false,
      "title": "Blackboards",
      "recommendations": [
         54352,
         195839,
         96010,
         196929,
         255647,
         42634,
         120393,
         27142,
         78568,
         115553,
         75364,
         147196,
         71445,
         29270,
         836,
         47714,
         37573,
         45329,
         41948,
         39428
      ],
      "backdrop_path": "/uydVVOgQSTW87aOcGApH6kLdOyc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Said",
               "gender": 0,
               "credit_id": "52fe45c0c3a368484e06ccf9",
               "name": "Said Mohamadi",
               "profile_path": null,
               "id": 238781,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Halaleh",
               "gender": 0,
               "credit_id": "52fe45c0c3a368484e06ccfd",
               "name": "Behnaz Jafari",
               "profile_path": "/suvjF0nZsaFds1g9pFfqzgNucd3.jpg",
               "id": 238782,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Reeboir",
               "gender": 2,
               "credit_id": "52fe45c0c3a368484e06cd01",
               "name": "Bahman Ghobadi",
               "profile_path": "/s5RcPFMBPJXNGtMO6zMSFvWOHDL.jpg",
               "id": 54607,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Father",
               "gender": 0,
               "credit_id": "59c014229251417dc3000ffc",
               "name": "Mohamad Karim Rahmati",
               "profile_path": null,
               "id": 1890619,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ribvar",
               "gender": 0,
               "credit_id": "59c0142bc3a36804f900100e",
               "name": "Rafat Moradi",
               "profile_path": null,
               "id": 1890620,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Young boy storyteller",
               "gender": 0,
               "credit_id": "59c01437c3a36804ec001003",
               "name": "Mayas Rostami",
               "profile_path": null,
               "id": 1890621,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Group leader",
               "gender": 0,
               "credit_id": "59c0143f9251417d7d0010c2",
               "name": "Saman Akbari",
               "profile_path": null,
               "id": 1890622,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marriage registrar",
               "gender": 0,
               "credit_id": "59c01449c3a36804b100100a",
               "name": "Ahmad Bahrami",
               "profile_path": null,
               "id": 1890623,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Match maker",
               "gender": 0,
               "credit_id": "59c01455c3a3680508001133",
               "name": "Mohamad Moradi",
               "profile_path": null,
               "id": 1890624,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Old man",
               "gender": 0,
               "credit_id": "59c0145fc3a36804890011a7",
               "name": "Karim Moradi",
               "profile_path": null,
               "id": 1890625,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Child",
               "gender": 0,
               "credit_id": "59c0146a9251417de000105b",
               "name": "Hassan Mohamadi",
               "profile_path": null,
               "id": 1890626,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "The boy porter",
               "gender": 0,
               "credit_id": "59c01475c3a36804ec001047",
               "name": "Rasool Mohamadi",
               "profile_path": null,
               "id": 1890627,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Little girl",
               "gender": 0,
               "credit_id": "59c0147f9251417dc3001057",
               "name": "Somaye Veisee",
               "profile_path": null,
               "id": 1890628,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe45c0c3a368484e06ccf5",
            "name": "Samira Makhmalbaf",
            "profile_path": null,
            "id": 20026,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.336385,
      "production_countries": [
         {
            "iso_3166_1": "IR",
            "name": "Iran"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         }
      ],
      "id": 28988,
      "vote_count": 13,
      "budget": 0,
      "overview": "Itinerant Kurdish teachers, carrying blackboards on their backs, look for students in the hills and villages of Iran, near the Iraqi border during the Iran-Iraq war. Said falls in with a group of old men looking for their bombed-out village; he offers to guide them, and takes as his wife Halaleh, the clan's lone woman, a widow with a young son. Reeboir attaches himself to a dozen pre-teen boys weighed down by contraband they carry across the border; they're mules, always on the move. Said and Reeboir try to teach as their potential students keep walking. Danger is close; armed soldiers patrol the skies, the roads, and the border. Is there a role for a teacher? Is there hope?",
      "similar": [
         112160,
         858,
         141,
         634,
         185,
         242224,
         145,
         43923,
         437557,
         297762,
         27586,
         11216,
         12162,
         1359,
         4982,
         9762,
         11005,
         334,
         8923,
         8966
      ],
      "original_title": "Takhté siah",
      "runtime": 85,
      "poster_path": "/9vbkcxNoovqWQ0oxjePZhhtIaeH.jpg",
      "spoken_languages": [
         {
            "name": "",
            "iso_639_1": "ku"
         },
         {
            "name": "فارسی",
            "iso_639_1": "fa"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fabrica",
            "id": 54378,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Makhmalbaf Productions",
            "id": 54379,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rai Cinemafiction",
            "id": 238,
            "origin_country": ""
         }
      ],
      "release_date": "2000-09-01",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Samira Makhmalbaf"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Mohsen Makhmalbaf",
         "Samira Makhmalbaf"
      ],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0246266/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwOTM0NzgyNF5BMl5BanBnXkFtZTcwMjU1OTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Said Mohamadi, Behnaz Jafari, Bahman Ghobadi | See full cast and crew »"],
      "reviews": [
         "Beautiful film about what happens when loftier ideas of learning and education meet the stark reality of day-to-day existence of nomadic Kurdish refugees. This story moves through the dusty Iran/Iraq landscapes like a painful wheeze, yet compels you stay on the path, mindful of every step. I find this especially moving now, during these gut-wrenching times in which we live, and considering the US's tattered and torn relationship with the people of the Middle East. If you're looking for star power, look elsewhere. I've not seen or heard of any of these actors, but I was completely satisfied with their genuine performances. This film is also subtitled, so some may consider that a deterrent but I didn't because the pacing of this movie allowed for it. Definitely worth a view, especially if you are a person who enjoys films that juxtapose the behavior of mankind vs. the human spirit. peace.",
         "This wonderful movie (shown here as \"Blackboards\") demonstrates the power of cinema to communicate circumstances and situations that are totally alien to those of us watching in comfort during a U.S. film festival. The Director/Screenwriter, Samira Makhmalbaf, literally learned her trade at her father's elbow. He taught her well. Makhmalbaf was only twenty years old when she made this movie, but she has already acquired the skilled director's eye for filmmaking. The locale in which the film is set is totally alien to me. The mountains of Iran offer stones and more stones. I believe this is the first picture I have ever seen where there is not a single image of a tree or even a green plant. The mountains are made of rocks, and the homes are made of rocks, and most of the characters in the the films spend their time climbing up, down, and between the rocks. In this incredibly harsh, barren, non-nurturing environment, two young teachers carry blackboards on their backs and try to find someone--anyone--who wants to learn to read and write, and who can pay for this instruction. Obviously, the teachers are motivated by their basic needs for food, water, and shelter, but--like all good teachers-- they are also motivated by the desire to teach. Each teacher attaches himself to a group of people moving across a border. (I was never sure which border this was--I think it was from Iran to Iraq.) Each group has endured hardship and tragedy, and their journeys are filled with the threat of danger. Despite this, the teachers continue their attempts to teach. This movie was not only powerful, but it was informative. Anyone who thinks the mountains of Iran are more or less like the mountain meadows Julie Andrews encountered when she sang \"The hills are alive with the sound of music,\" needs to see \"Blackboards.\" Despite this hardship, human beings survive, and their desire to learn and to teach survives as well. An amazing film--not to be missed! THIS FILM WAS SEEN AT THE LITTLE THEATRE, DURING THE HIGH FALLS (ROCHESTER, NY) FILM FESTIVAL. THIS FESTIVAL IS NOT LARGE, BUT THE QUALITY OF FILMS IS OUTSTANDING. WOULD BE WORTH A SPECIAL TRIP IN 2003!",
         "BLACKBOARDS is a human story - an arduous one at that. It affirms the tenacity of human spirits. Its hard medicine content could be uneasy for some to bear. At its core, there is warmth a-glowing beneath it all. Writer-director Samira Makhmalbaf is a true artist - she included subtle visual poetic accents. Shooting along the rugged terrain of Kurdistan, nearing the border between Iran and Iraq, it's barren of vegetation, full of treacherous rocks as people traverse the steep mountain paths and windy troughs. I really appreciate a particular detail scene: from the held wide-shot of a group of teachers with blackboards strapped to their backs, standing abreast at a mountain road clearing - paused, camera quietly cuts to a close-up of a pair of feet with 'billowing' fabric of the trousers. We need no sound effect of whistling wind, the shot was at once poetic and effective. How succinct and direct in expressing the moment, Samira did. For a 20-year old woman Iranian director in her second feature film, Samira Makhmalbaf is awesome - sensitive, perceptive, mature in her viewpoint, with bold persistence against all odds to complete her project. Keen awareness of the state of affairs her film is focused on - not so much as making a political statement, she's more in earnest depicting simple everyday things: the mundane human needs of the wandering Nomads yearning to be home; the young 'mule' boys struggling for meager living yet looking out for each other; teachers seeking pupils in exchange for food. It's philosophical: through the course of the journey, the fate of the blackboards goes through transitions as situations demand - even \"let go.\" Survival and adaptability co-exist. Samira has a good mentor - her father Mohsen Makhmalbaf, who is a collaborator on the writing of \"Blackboards\" and her first feature, \"Apple, The\" 1998 (a bold unique storytelling in docu-drama format). She also has the expert assistance of cinematographer Ebrahim Ghafori, who previously worked with her on \"Apple.\" Bahman Ghobadi is the actor who portrayed the teacher who ran into the expedition of the young 'mule' boys with contraband goods on their backs. He was the writer-director-producer of the film \"A Time for Drunken Horses\" 2000, and here in \"Blackboards,\" it's déjà vu - this time is not of snowy setting, but included brief dramatic storyline between him and the boys. Reality is still bitter truth, but Samira kept the element of humanity intact. Other efforts from the Makhmalbaf family include: \"Day I Became A Woman, The\" 2000 by Marzieh Meshkini, Mohsen's wife. \"How Samira Made the Blackboards\" (it'd be interesting to see how Samira shot the film in such arduous circumstances and with mostly non-professional cast with wide age differences) by Mezssam Makhmalbaf, Samira's brother. Father Mohsen Makhmalbaf did \"Gabbeh\" 1996 and \"Kandahar\" 2001. More Iranian films? Try writer-director Majid Majidi's \"Baran\" 2001 - a poignant story about a young man (17-year old) in Tehran, how he matures through his deeds in trying to help an illegal Afghan of a poor family - it's a rich human story from the filmmaker who gave us \"Color of Paradise\" 2000 and \"Children of Heaven\" 1999.",
         "'Blackboards' is one of those films that has divided audiences between fanatical admirers and grumbling dissenters. The former admire the director's skilful juggling between formalism and humanism, individual quests and social movements, private moments and public set-pieces; her filming of landscape; her eliciting of unsentimental, compelling performances from an amateur cast; her insistence on enigma and loose ends; her portrait of life in extreme, harrowing conditions. The dissenters bemoan her fudging of politics - sure, she shows the exploitation of children, the mass displacement of the Kurds, and the murderous terror lurking behind every rock, but by refusing to put these in a contextual framework, such depictions are blunted in political force. there is a whiff of misogyny to me in these complaints. It's okay for men to make ambitious, universalising statements, but women must remain concerned with the local. Presumably Makhmalbaf would have been more political if she had concentrated on authenticating the patterns on the women's dresses. Of course, culture in general has moved towards the local: with post-modernism, very few artists have had the confidence to think on a large scale (I don't mean make large-scale films, which any fule kan do). This is presumably why 'Blackboards' reminds me of older types of artists. Most immediately, it could be a massive Beckett play, full of wandering vagrants in a vast, desolate landscape, peopled with Lucky-like slaves, surrounded by an unseen, God-like menace, occasionally erupting in capricious violence. Like Beckett, there is no real beginning or end, no context, just a sense of never-ending repetition with the only possible relief in death. Like Beckett (eg 'Waiting for Godot'), culture has no place in such an environment, indeed, seems a grotesque irrelevance, an incomprehensible babble, traces scraped in a landscape no-one can read now, never mind in the future. And yes, the film is as unremittingly hopeless as a Beckett play - there is no progress or redemption here. But it is as bleakly funny too - eg the whole marriage farrago between Said and Hahaleh; the game of marbles watched by her son; the tragicomic, very Beckettian inability of her aged father to relieve himself. In the film world, 'Blackboards' reminds me of no-one so much as Angelopolous, especially in a film like 'The Travelling players', where a group of itinerant outsiders observe and become absorbed in an unfamiliar community. Makhmalbaf has Angelopolous' confidence in allegory, a way of dramatising in mythic form life and displacement under a totalitarian regime, without in any way 'abstracting' the violence and pain. The empty landscapes suddenly being inexplicably over-run by faceless crowds also has the millenarial feel of Andersen's recent 'Songs from the second floor', or later Bunuel, from whom the theme of the journey, coming across strange, surreal strangers (eg the uncanny scene with the masked gardener whose son languishes in an Iraqi jail), or images such as the blackboard-hauling men like grounded birds watching blackbirds in the sky, and overhearing another, ominous, unseen flying object, derives. There are many, many ways of being political. Unlike these masters, however, who prefer irony and distant tableaux, Makhmalbaf, through restless handheld camerawork, gets right in between her characters and makes us feel for them.",
         "This film is flawed in any number of ways - stories are unresolved; scenes of military oppression are unconvincing; and more generally I was left with a somewhat unmoved feeling when the lights came up. I thought \"The apple\" was a fantastic film in its challenging combination of documentary and fiction, but perhaps that an over-simplicity in \"Blackboard\"'s storyline was exposed by the same honest, basic direction and storytelling that made Ms Makhmalbaf's previous film really powerful. There are definitely many positive aspects to this film as well. It fearlessly deals with one group of people (nomads who I think are Kurdish) people who really are vulnerable and at the mercy of powerful and highly suspect governments on both sides of the border. It shows that these people have a cultural strength that seems to transcend their harsh circumstances. In its other story strand it shows movingly how children, even more vulnerable, are exploited by a deregulated commercial system. Beetle-browed, bowed beneath heavy loads in the hot sun, self-defensively referring to themselves as 'mules', the kids are old before their time. The film also has a (more or less) powerful sense of transcendental storytelling to it. The nomads are all oppressed people, looking for a promised land. The children are mythical also: the kid's story about the rabbit has an air of antiquity about it. Neither group of oppressed people has time for the education that the main characters offer. They are too busy surviving. The use of non-actors in the film is a strength and a weakness. In a story that is more obviously fictional than \"the Apple\", some performances are a little wooden. But I think the emotional punch of realism, the feeling that we may in effect be watching something that is happening today somewhere in the world, more than makes up for this formal, actorly problem. Hurriedly, then: a flawed diamond in the dust.",
         "I understand the vigorous debate Samira Makhmalbaf's BLACKBOARDS, has generated, but I'd also say that I loved this very demanding but often moving film - a remarkable achievement for a very young, but already accomplished filmmaker. Watching her career develop will be quite a treat. Shot with hand-held cameras and featuring a Kurdish cast of non-actors, BLACKBOARDS is very slowly paced, with a rambling quality that captures the aimless down time of everyday life. However the restless camera work also fills the film with an unceasing tension, gradually revealing the desperation filling the stateless existances of the many nervous characters. The politics of the region are an ever-present backdrop to the story, and unfortunate political machinations render both education and basic survival an arduous complexity - to live and to gain even the most basic of educations are made into luxuries, which - even in desolate and strife-torn landscapes - some are willing to die for. A handful of moments stood out for me: the scenes set in the river camp showcase the warmest of human interactions, and the final scene is remarkably beautiful. This very rigorous film (superficially reminding me of both Abbas Kiarostami and Tsai Ming-liang) nonetheless had me hooked.",
         "When people are struggling just for survival, education for children doesn't seem necessary. Even the teacher himself, with two years of education, cannot make a living. In the film, the teacher's persuasion of the usefulness of education (some basic arithmetic and alphabets learning) attracted only one boy's attention - \"you will be able to write your name.\" To other boys, to be a successful smuggler may have a better chance in life. In the film, the teacher wants to marry a woman without reason. There is not a hint of whether affections or economic considerations were in play. Even with a series of one-man-shows of teaching the woman \"I love you,\" it is not convincing that the teacher \"loves\" that woman. The meanings of marriage and divorce are so empty which makes one wonder:\"why bother?\" The director gave us a glimpse of how desperate the lives of war-deprived people - which is heartbreaking. To a certain degree, she succeeded. However, the film needs more cutting to make it proceeds smoothly. Many shots took too long just to show repetitive movements (maybe the director wants viewer to feel the slow and tediousness of how these people feel?) One obvious editing mistake is that while the blackboard has been cut in half in the middle of the film, which miraculously maintained an uncut full-sized shape at the end.",
         "Firstly, for all those who say that this DVD is expensive, do as I did - rent it from your local lending library. £1.80 for a week, less cos I got it as a 3 for 2 on a Friday. You'd be surprised what World cinema gems (at least mine) they stock, mostly ignored by the rest of the population as they sit there from week to week. 'Blackboards' reminded me SO much of another story of Iranian children being mules for contraband and risking life and limb to sell them in bordering Iraq - the uniquely titled 'A Time for Drunken Horses'. That remains one of the most beguiling and humbling movies ever made and remains a definite favourite of mine. Some (well, let's be honest, most) scenes portraying the out-of-work schoolteacher, traipsing around the arid mountains looking for pupils to teach and how he gets married with his only tool of the trade being the barter, are eye-opening. Unbelievable, actually but as the amateur cast are obviously not acting this out for fun and the very seriousness of their plight, this is all very far from being a joke. The honesty of it all makes one humble simply to be alive, let alone being alive in our comparatively comfortable West. Like I said in my 'Drunken Horses...' review, one to show your children when they start moaning that their expensive trainers are the wrong colour. I don't think that the details of the plot are needed here. It's a short film and a lot happens, but slowly - and naturally. But, I will say that you'll never have seen so many uses for a board that's painted black in your life before. This is essential, but minor Iranian cinema. If you do come across it, either on TV or whatever source you can, make time for it. It's unforgettable.",
         "It must hard to talk about ignorance, poverty and war without being realistic. I reckon that, most of everything, this film is \"realistic\". It is undeniable that the settings, the characters and the issues belong to the director's background. She's been able to give \"a hint of poetry\" thanks to several touching and clever shots (For instance: A family that finds protection under a blackboard). I'm afraid that this film looses part of its potential because of its hybrid nature. It's not a drama, but it's not a documentary either. There are few stories crossing each other, but it is not complex enough to consider it a \"Magnolia-style\" thing. Finally (and this is what the film seems to be about), there's a teacher who dreams to heal his country with education but ends up facing the bitterness of a failed relationship. Nevertheless I truly appreciated the very last scene, that is worth 2 points in my final vote. Iacopo Destefani",
         "This is a rather well made movie, that shows some of the problems in Iran that affects its poor northern citizens, without luckily ever getting over-dramatic or too sentimental but at the same time it's also lacking in true depth to make this a powerful or impressive movie. It's a slow moving movie that is entirely filmed with handhold camera, with lots of long sequences. It works good for a realism and the atmosphere of the whole movie but at the same time means that this is not a movie for just everyone. You must be able to handle the slow- and different way of storytelling to appreciate this movie fully. The movie is good looking, with its moody, never-ending, landscapes and good camera positions to tell the story with. The dialog is realistic, though not always interesting. I mean they basically say the same things five times in a row in this movie, which perhaps is a bit irritating. This is also due to the non-professional actors that play in this movie. Needless to say that not everything works out fully in this movie, especially when it comes down to the true emotion or depth of the movie. Lucklily there is no lack of realism, although the movie its story pushes it at times. But on the other hand it's the story that still makes this a pleasant movie to watch. The subject might be heavy and serious but luckily the movie doesn't try to emphasis this. The end result is a good and not heavy to watch movie that is absolutely worth seeing but lacking in real emotions or depth to make a true lasting impression. The movie is told from an original point of view; A couple of schoolteachers that travel trough the North of the country to remote villages and groups of refugees, to teach them the basic things such as writing, reading and simple math, to try and give everyone a better future and at the same time earn some money or get some free food as well. They're mixed up in all the difficulties but yet they're no part of it. If they want they can walk away from all the troubles if they choose to. They're objective in the whole situation and they don't do more than is ever asked of them. Most of the characters in this movie are being played by non-actors. It works realistic but at the same time is one of the reasons why the movie is lacking in any true depth or well acted out emotions. The movie as a whole is effective and it makes its point well but it does so without ever impressing too much, with the exception of one or two great sequences. Samira Makhmalbaf has some good and promising potential as a filmmaker and is possible future Oscar potential, just like her father, who also co-wrote this movie but her movies have to become even more confronting and daring if she wants to achieve that. 7/10 http://bobafett1138.blogspot.com/"
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Makhmalbaf Productions",
         "Fabrica",
         "Rai Cinemafiction"
      ],
      "summaries": ["Itinerant Kurdish teachers, carrying blackboards on their backs, look for students in the hills and villages of Iran, near the Iraqi border during the Iran-Iraq war. Said falls in with a group of old men looking for their bombed-out village; he offers to guide them, and takes as his wife Halaleh, the clan's lone woman, a widow with a young son. Reeboir attaches himself to a dozen pre-teen boys weighed down by contraband they carry across the border; they're mules, always on the move. Said and Reeboir try to teach as their potential students keep walking. Danger is close; armed soldiers patrol the skies, the roads, and the border. Is there a role for a teacher? Is there hope?"],
      "budget": 0
   },
   "movielensId": 5806,
   "movielens": {
      "languages": [
         "",
         "فارسی"
      ],
      "releaseDate": "2000-09-01",
      "dvdReleaseDate": "2004-02-17",
      "directors": ["Samira Makhmalbaf"],
      "runtime": 85,
      "movieId": 5806,
      "title": "Blackboards",
      "mpaa": "",
      "actors": [
         "Said Mohamadi",
         "Behnaz Jafari",
         "Bahman Ghobadi",
         "Mohamad Karim Rahmati",
         "Rafat Moradi",
         "Mayas Rostami",
         "Saman Akbari",
         "Ahmad Bahrami",
         "Mohamad Moradi",
         "Karim Moradi",
         "Hassan Mohamadi",
         "Rasool Mohamadi",
         "Somaye Veisee"
      ],
      "imdbMovieId": "0246266",
      "originalTitle": "Takhté siah",
      "genres": [
         "Drama",
         "History",
         "War"
      ],
      "youtubeTrailerIds": ["uV_Gqz4VAF4"],
      "plotSummary": "Itinerant Kurdish teachers, carrying blackboards on their backs, look for students in the hills and villages of Iran, near the Iraqi border during the Iran-Iraq war. Said falls in with a group of old men looking for their bombed-out village; he offers to guide them, and takes as his wife Halaleh, the clan's lone woman, a widow with a young son. Reeboir attaches himself to a dozen pre-teen boys weighed down by contraband they carry across the border; they're mules, always on the move. Said and Reeboir try to teach as their potential students keep walking. Danger is close; armed soldiers patrol the skies, the roads, and the border. Is there a role for a teacher? Is there hope?",
      "tmdbMovieId": 28988,
      "avgRating": 3.09804,
      "releaseYear": "2000",
      "numRatings": 51,
      "posterPath": "/9vbkcxNoovqWQ0oxjePZhhtIaeH.jpg"
   }
}