{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sexuality",
            "id": 738
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "eroticism",
            "id": 1664
         },
         {
            "name": "night life",
            "id": 1759
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "beobachten",
            "id": 3763
         },
         {
            "name": "step mother",
            "id": 5921
         },
         {
            "name": "conflict",
            "id": 11933
         },
         {
            "name": "crime",
            "id": 14536
         }
      ],
      "imdb_id": "tt0466816",
      "video": false,
      "title": "Hallam Foe",
      "recommendations": [
         14422,
         45739,
         78504,
         77945,
         110624,
         229314,
         192126,
         53734,
         27218,
         50364,
         237,
         53604,
         24050,
         89280,
         92493,
         192623,
         73846,
         16430,
         31461,
         27215
      ],
      "backdrop_path": "/wQAjJ4yaLudVEmDGeKigyNB9MBR.jpg",
      "revenue": 60641,
      "reviews": [{
         "author": "MoHA",
         "id": "55de80ecc3a3686e82000bf6",
         "content": "After momentarily veering off course with a misguide adaptation of Patrick McGrath's eerie neo-gothic novel Asylum, Scottish director David Mackenzie is back on track, making good on the promise he initially showed with such dark, acclaimed features as THE LAST GREAT WILDERNESS and the award-winning YOUNG ADAM.\r\nExpert at lock picking and proficient at peering into other people's windows, 17-year-old Hallam Foe (Jamie Bell) is a young Scot who can't get past the drowning death of his suicidal mother in the loch on the sprawling family estate. Dad (Ciaran Hinds) has since married his former secretary, Verity (Claire Forlani), whom Hallam hates and he takes no pains to hide his feelings. After his sister, Lucy (Lucy Holt), relocates to Australia, Hallam holes himself up in his tree house where he spends hours under a blow-up portrait of his late mother, contemplating whether or not Verity might have actually been responsible for his mother's death. When Verity confronts him with the private notes books in which he records not only his voyeuristic escapades around the village but his own self-digusted lust for Verity herself, Hallam explodes. Hallam accuses her of murdering his mother, then attempts to strangle her. They then have sex on the tree-house floor. Figuring now is as good a time as any to finally leave home, Hallam runs off to Edinburgh where he spots Kate (Sophia Myles), a young woman who bears a striking resemblance to his mother. Bewitched, he follows her to the landmark Balmoral Hotel where she works, then begs his way into a job as a kitchen porter just to be near to her. When he follows her home after work, he realizes he can see into her bedroom window from the Balmoral's famous clock tower. There he sets up post, watching Kate during her most private moments as he falls in love..\r\nBased on the cult novel Hallam Foe by Peter Jinks, Mackenzie's film walks a very fine line between charming and downright creepy: There's no getting around the fact that Hallam has a few serious problems, compulsive voyeurism being the most troubling. But rather than underplay what makes this unusual character so compelling, Mackenzie leaves Hallam Foe has he found him, and Giles Nuttgens (ASYLUM, YOUNG ADAM and Deepa Mehta's gorgeous WATER) films it all in high style. Bell is excellent, the settings are spectacular and the right Scottish soundtrack features songs by Franz Ferdinand, Orange Juice and The Pastels.",
         "url": "https://www.themoviedb.org/review/55de80ecc3a3686e82000bf6"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Hallam Foe",
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473bf",
               "name": "Jamie Bell",
               "profile_path": "/7HgepK5YE8u0xrv3lJZjaEoENwl.jpg",
               "id": 478,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe4344c3a36847f80473c3",
               "name": "Sophia Myles",
               "profile_path": "/eUZW5X1FJ5utHKSw0ZqmOPhuUI.jpg",
               "id": 3971,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Julius Foe",
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473c7",
               "name": "Ciarán Hinds",
               "profile_path": "/h5n8B12WoY1UAZjzSVEup4vsoBw.jpg",
               "id": 8785,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Verity Foe",
               "gender": 1,
               "credit_id": "52fe4344c3a36847f80473cb",
               "name": "Claire Forlani",
               "profile_path": "/oJ0zBF74MjopEJrEWstXuvZWQYL.jpg",
               "id": 4174,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Alasdair",
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473cf",
               "name": "Jamie Sives",
               "profile_path": "/92BcXrr2W7gZri6xVlLhpLLaPsf.jpg",
               "id": 1833,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Raymond",
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473d3",
               "name": "Maurice Roeves",
               "profile_path": "/qXYjnIHClkey4QQxPG5D5JD7Y74.jpg",
               "id": 54,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Andy",
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473d7",
               "name": "Ewen Bremner",
               "profile_path": "/7CQBnBHSNDcbY2LucqWqEpKWsCH.jpg",
               "id": 1125,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4344c3a36847f8047397",
               "name": "David Mackenzie",
               "profile_path": "/oHZ2kkGICUnSbm73BQFK3Hau82f.jpg",
               "id": 3055,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4344c3a36847f804739d",
               "name": "Ed Whitmore",
               "profile_path": null,
               "id": 24167,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473a3",
               "name": "David Mackenzie",
               "profile_path": "/oHZ2kkGICUnSbm73BQFK3Hau82f.jpg",
               "id": 3055,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473a9",
               "name": "Giles Nuttgens",
               "profile_path": null,
               "id": 3079,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473af",
               "name": "Tom Sayer",
               "profile_path": null,
               "id": 24168,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4344c3a36847f80473b5",
               "name": "Peter Brill",
               "profile_path": null,
               "id": 24170,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4344c3a36847f80473bb",
               "name": "Colin Monie",
               "profile_path": null,
               "id": 3080,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4344c3a36847f80473dd",
               "name": "Trisha Biggar",
               "profile_path": null,
               "id": 33193,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.030879,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 2239,
      "vote_count": 59,
      "budget": 8000000,
      "overview": "Hallam's talent for spying on people reveals his darkest fears-and his most peculiar desires. Driven to expose the true cause of his mother's death, he instead finds himself searching the rooftops of the city for love.",
      "similar": [
         884,
         402,
         634,
         4141,
         310,
         1213,
         1278,
         106646,
         86331,
         112160,
         2057,
         82023,
         439,
         744,
         5176,
         859,
         6639,
         53932,
         451,
         638
      ],
      "original_title": "Hallam Foe",
      "runtime": 95,
      "poster_path": "/yzUC2fvpz1dAwdzseSXMlWGNm8e.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [],
      "release_date": "2007-02-16",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.thefilmfactory.co.uk/hallamfoe/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["David Mackenzie"],
      "runtime": 95,
      "synopsis": "Hallam Foe lives in in the Scottish countryside in a house with his father and his new stepmother, Verity. Hallam's mother died some time ago, and Hallam hasn't recovered. He spends his days mostly secluded in a tree house and spying on his surroundings. When Hallam's sister leaves home, their father suggests Hallam should find work and start a life on his own. Hallam refuses, and when he discovers a boat on the bottom of the lake he instead becomes obsessed with the details of his mother's death. His father reveals that she took her own life, but Hallam becomes convinced that Verity had something to do with it. In a pivotal scene, Verity discovers Hallam's diaries and uses them to pressure him into leaving, but only after she has sex with him in the tree house. Hallam leaves for Edinburgh without leaving word. He has no money and nowhere to stay, but on his second day he sees a woman in the street, Kate, whose resemblance to his mother makes him follow her to her work in the office of a large hotel. He persuades her to give him a job as a kitchen porter, and so he has a start. He also keeps following Kate, and echoing his experiences from the woods at home, starts to spy on her through her windows from the roof, or with binoculars from the clock tower of the hotel, and even breaks into her flat. He witnesses her sexual relationship with Alasdair, a senior employee at the hotel. By coincidence, Alasdair also discovers Hallam's spying activities and tries to fire him, but Hallam threatens to expose Alasdair's affair; he is, after all, a married man. Instead, Kate helps Hallam win the position of front-of-house porter, and after drinks on his birthday she even asks him home with her, and they seem to be starting a romantic relationship. However, the next day, when he sees Alasdair harassing Kate on her way into her flat, Hallam comes in through the window to fight him off, thereby revealing his habit of spying on her. She throws him out, of course, but she eventually lets him explain his whole situation, and they find common sympathy. Hallam's father and his wife have tracked Hallam down and come to the hotel to meet him. They want to sell off land and need Hallam's approval. He still insists Verity is responsible for his mother's death, and has even reported her to the police to no avail. Soon after, strongly affected by grief and pain, he goes back to his childhood home to seek out Verity, gags and ties her, carries her to the lake and throws her in the water. At the last minute he regrets his action and pulls her back out. Hallam's father, sickly and unable to defend his wife, finally tells Hallam the truth and asks him to blame him rather than Verity: Hallam's mother had been suicidal for a long time and on the day she died, it was because he had simply given up trying to stop her. Knowing the truth, Hallam can finally hope to find peace. Back in Edinburgh, he goes to see Kate. They talk, but she turns him away, saying she hopes to meet him again later in life. Hallam walks away, smiling.",
      "writers": [
         "Peter Jinks",
         "David Mackenzie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0466816/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4NTczMzMyM15BMl5BanBnXkFtZTcwODgwNDQ2MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jamie Bell, Ruth Milne, John Paul Lawler | See full cast and crew »"],
      "reviews": [
         "Years on from his success in Billy Elliott, it's great to see Jamie Bell being given a vehicle to show that he has the genuine talent to carry a film. Hallam Foe is a fine British production; quirky, disturbing, funny, interesting, thought-provoking and consistently well-shot and soundtracked. At the same time, it's a little gimmicky, heavily-influenced (Trainspotting, Rear Window et al), and frankly far-fetched in its depiction of the unlikely love between Hallam and the object of his affection in Edinburgh (Sophie Myles). But where the disbelief needs suspending,Jamie Bell's performance saves the day, on the emotional side through bringing tremendous depth to his character, and on the physical side by making his rooftop athleticism completely believable. For all its faults, this is a admirable and brave piece of work, well worth-watching if you're after something dark and provocative that will also make you laugh (the badger suit?).",
         "Excellent and spot on movie. Not only is this so well directed and acted, it has a difficult story to tell and convinces us 100% time. It is certainly in part the performance of Jamie Bell that helps us take this story of a peeping tom hero on board so effortlessly, but because everything else also buzzes so authentically, we can only conclude that , for once, we have a superb script. I didn't notice one word of dialogue that jarred and this when we have such taboo items up for discussion and for the doing of! Bell as mentioned is excellent but so are all the cast and because I do mean all we have to conclude that Mr Mackenzie has a rare actor directing skill. Sophia Myles is also well worthy of mention, and seems capable of disarming changes that always seem likely to catch one off guard. Funny, affecting, stimulating, sexy, stylish and not a little alarming. Do not miss this movie.",
         "The seventeen year-old Hallam Foe (Jamie Bell) is a weird teenager that misses his mother that committed suicide, drowning in a lake nearby their house in Edinburgh after an overdose of sleeping pills. Hallam spends his spare time peeping the locals and blames his stepmother Verity Foe (Claire Forlani), accusing her of killing his mother. After a discussion with his father Julius Foe (Ciarán Hinds), Hallam sneaks out from his house and travels to London, where he sees Kate Breck (Sophia Myles) and becomes obsessed for her because of her resemblance with his mother. Kate hires Hallam to work in the kitchen of the hotel where she works and they have a strange romance, while Hallam reaches his maturity through the hardest way. \"Hallam Foe\" is a surprisingly great and stylish little movie with an original and erotic romance with Oedipus complex, obsession and voyeurism. The enjoyable story is funny, sexy and dramatic and the characters are well developed with great performances and chemistry of Jamie Bell and Sophia Myles. My vote is eight. Title (Brazil): Not Available",
         "Since Hallam's (Jamie Bell) mother died two years ago, he has detached himself from life, watching (even spying) the people from a distance, going as far as breaking in and searching their closets. He despises his stepmother (a surprisingly matured Claire Forlani) who he suspects of having murdered his mom. So Hallam takes off from the Scottish countryside to Glasgow, where he prowls the roofs, and finds a girl eerily resembling his mother. Revealing more of the story wouldn't do it justice. Jamie Bell masterfully plays an angry young man, reminiscing of Holden Caulfield. The film creates magical sequences, sports a wry northern humour, and doesn't shy away from exploring the feeling of loss and pain. Although the plot background relies too much on textbook psychology, HALLAM FOE remains a kindhearted, lively drama beyond the streamline tearjerkers. 7/10",
         "Definitely. I even dreamt about him. Jamie Bell's performance as a juvenile peeping tom is one that stays with you, following your subconscious around without permission. Eliciting sympathy one moment and astonishment the next, this teenager reeling from the death of his mother leaves viewers similarly out of kilter. A dramatic thriller funnier than a lot of what passes for comedy, David McKenzie's new feature is beautifully shot in Scotland without wasting a second, the camera lingering like Hallam's binoculars one moment before leaping to the next vantage point. The plot often feels erratic as Hallam rushes around Edinburgh in a haze of paranoia and confusion, but I felt this added to my sympathy for the young crazy, and only a couple of conveniently unfortunate incidents to ratchet up the tempo jarred slightly. A strong soundtrack from Scottish indie heroes Orange Juice and a host of their darker-tinged descendants helped everything along nicely. A strong cast made for compelling viewing, particularly Sophia Myles as the object of Hallam's roving lenses, though for me it was Jamie Bell's impressive turn that made it real. He even overshadowed Spud.",
         "Jamie bell has certainly come a long way from that little dancing boy 'Billy Elliot', although he never seems to get any older, and here he takes another challenging role as Hallam Foe. Hallam is introduced to us as he skylines onto a couple having sex near his tree house, not only is he semi-clad and wearing make-up he is sporting a rather bizarre piece of headgear made out of a badger. It is at this point we the audience can assume that Hallam is not only a bit mad but a bit creepy, which apparently stems from his mothers suicide. From here on in the story sees him leave behind his tree house sanctuary, not by choice, and fly the nest to Edinburgh, he is homeless, jobless and believes his step mother killed his real mother. Armed with his trusty binoculars he scrambles around the roof tops spying on the residents of the city and we learn that he distanced himself from people when he lost his mother and it just turned into a kind of habit, a modern day peeping tom. As opposed to the obsession he had with everyone before he left home, he becomes focused on Kate, a human resources officer for a large hotel, mainly due to the fact that she reminds him of his mother. After conning his way into a job at the hotel he embarks on a relationship with Kate but his spiralling madness, dark secret and Kate's regular sex partner threaten everything and push Hallam further down the spiral. Directed by David Mackenzie it really does have a sense of love for the city and its people, but its Bell and Sophia Myles (Kate), whose strange relationship forms the centre of the film, that carry the plot along. With music from the likes of Orange Juice to Sons and Daughters and an exclusive Franz Ferdinand track the pace is upbeat and the David Shrigley Cartoon titles should be an inclination to the type of quirky film this is. Bold, funny and a little disturbing Hallam Foe is an enjoyable romp through the weird and wonderful world of the human mind and emotions and how certain things can affect our everything.",
         "Excellent performances, including a beautiful one by the city of Edinburgh, are what make this erratic movie worth seeing. Jamie Bell is very endearing, and demonstrates a wide emotional range (compare and contrast dull American actors like Ryan Phillippe and Matt Damon). He's well supported by, amongst others, Sophia Myles, Jamie Sives, that wonderful old stager Maurice Roeves and, in an splendid cameo, Ewan Bremner. The story loses itself in unconvincing melodrama towards the end, which is a pity. Up till then it's an eccentric, entertainingly wayward affair, with a sparky script, good photography and lively editing.",
         "Hallam Foe is so self-consciously a left field British Indie, at times it seems close to self-parody. The result is a film that strives hard to be a departure, but spoils its early promise. The film is about an adolescent, Hallam Foe, in a Scots upper middle-class dysfunctional family (wife recently dead, the husband having replaced her with his young English lover) on a remote Scottish estate. The early scenes are full of an atmosphere of unknown menace and lurid danger, reminiscent of Ian MacEwan's early stories. Hallam Foe is a very unusual, oedipal adolescent, one of many young screen protagonists that seem to be the spawn of the original fictional teenage weirdo, Holden Caulfield. After a lurid altercation with his father's distinctly dodgy lover, Hallam jumps ship and goes to the big city, where he quickly becomes obsessed with a female stranger who resembles his mother, and struggles with the loss of innocence and tensions of adolescence. But after developing a relationship with the stranger, the film becomes slack and loses interest as the plot becomes tenuous and spins off into improbability. Still, on the plus side, Hallam Foe is not bad and even quite funny, and has a real sense of place. The cast is good, particularly Jamie Bell and Sophia Myles, both of whom give demanding performances.",
         "Probably one of the most widely anticipated films of this year, \"Hallam Foe\" is a weird voyeuristic drama, a mix of whodunit, romance and family drama. There is a great level of eccentricity that completely permeates \"Hallam Foe\", and this generates right from the eponymous title character, in an intense yet believably rounded performance from Jamie Bell. Hallam (Bell) is a self-absorbed outsider obsessed with his dead mother who lives with his dad (Ciaran Hinds) and his stepmother (Claire Forlani) in the Scottish Highlands. Hallam likes to spy on other people, and his pasttime has descended into an obsession. Kicked out of his house after he goes too far, he heads to Edinburgh where he gets a job as a kitchen porter, beginning a romance with his boss Kate (Sophia Myles), the spitting image of his mum... The film looks great, with some great location shooting in the Scottish Highlands and Edinburgh, complemented with a lively contemporary soundtrack. Bell is well supported by Hinds and Forlani, along with rising star Sophia Myles as the luminous Kate. Jamie Sives as excellent as Hallam's thoroughly dislikeable love rival, and Maurice Roeves and Ewen Bremner, as his bonkers work colleagues, provide much welcome comic relief. It can feel a bit too weird for its own good and Hallam does things which would land ordinary people in jail, and it's only through Bell's sympathetic portrayal that we're warming to him, when probably we shouldn't. For anyone keen to see what all the fuss has been about, \"Hallam Foe\" is well worth your time.",
         "A prime example of a 'small' (or 'wee' as we say in Scotland) film. It deals exclusively with one family and their particular quirks. This film could be French - they are the masters of this particular genre. Not a lot really happens and some of what does is extremely implausible. To say the family members are dysfunctional is an understatement. Much of their behavior bears no resemblance to the lives of people I know. The strengths of 'Hallam Foe' are the performances, the soundtrack and the cinematography. Action shifts between a large country estate and the beautiful city of Edinburgh (very strangely, though, there are no shots of the world-famous Castle - like panoramic views of the Paris skyline that omit the Eiffel Tower!). Jamie Bell is excellent as the eponymous Hallam - he even gets to do a couple of runs and jumps that hark back to 'Billy Elliot'! Sophia Myles is convincing as a hotel manager with an inability to sustain fulfilling relationships. The central theme revolves around sexual confusion/obsession and much of the plot concerns Hallam's turbulent attitude to sex. Overall, this is an unremarkable film but not without merit."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Film4",
         "Ingenious Film Partners",
         "Scottish Screen"
      ],
      "summaries": [
         "The seventeen year-old Hallam Foe is a weird teenager that misses his mother, who committed suicide by drowning in a lake near their house in Edinburgh after an overdose of sleeping pills. Hallam spends his spare time peeping at the locals and blames his stepmother Verity Foe, accusing her of killing his mother. After a discussion with his father Julius Foe, Hallam sneaks out from his house and travels to Edinburgh, where he sees Kate Breck and becomes obsessed with her because of her resemblance to his mother. Kate hires Hallam to work in the kitchen of the hotel where she works and they have a strange romance, while Hallam reaches his maturity in the hardest way.",
         "Hallam's talent for spying on people reveals his darkest fears-and his most peculiar desires. Driven to expose the true cause of his mother's death, he instead finds himself searching the rooftops of the city for love."
      ],
      "budget": 3800000
   },
   "movielensId": 58334,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-02-16",
      "dvdReleaseDate": "2008-11-11",
      "directors": ["David Mackenzie"],
      "runtime": 95,
      "movieId": 58334,
      "title": "Hallam Foe",
      "mpaa": "",
      "actors": [
         "Jamie Bell",
         "Sophia Myles",
         "Ciarán Hinds",
         "Claire Forlani",
         "Jamie Sives",
         "Maurice Roeves",
         "Ewen Bremner"
      ],
      "imdbMovieId": "0466816",
      "originalTitle": "Hallam Foe",
      "genres": [
         "Drama",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["duZ4rj5-fpY"],
      "plotSummary": "Hallam's talent for spying on people reveals his darkest fears-and his most peculiar desires. Driven to expose the true cause of his mother's death, he instead finds himself searching the rooftops of the city for love.",
      "tmdbMovieId": 2239,
      "avgRating": 3.46389,
      "releaseYear": "2007",
      "numRatings": 180,
      "posterPath": "/yzUC2fvpz1dAwdzseSXMlWGNm8e.jpg"
   }
}