{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "sea",
            "id": 658
         },
         {
            "name": "boat",
            "id": 1422
         },
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "will to survive",
            "id": 2429
         },
         {
            "name": "water",
            "id": 4237
         },
         {
            "name": "no dialog",
            "id": 12602
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "japanese new wave",
            "id": 209998
         },
         {
            "name": "slap",
            "id": 212330
         }
      ],
      "imdb_id": "tt0056049",
      "video": false,
      "title": "The Naked Island",
      "recommendations": [
         83539,
         3763,
         96712,
         105711,
         125150,
         106196,
         187864,
         112501,
         101482,
         90228,
         128368,
         148050,
         148068,
         125154,
         159414,
         162551,
         104441,
         168806,
         47425,
         148514
      ],
      "backdrop_path": "/vha5VlSbrfrsUSvaVV504LmVIDH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Toyo, the mother",
               "gender": 1,
               "credit_id": "52fe43a4c3a36847f8064099",
               "name": "Nobuko Otowa",
               "profile_path": "/4uiD6Y7Sg92KvI4nT2frPbGOdUU.jpg",
               "id": 33728,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Senta, the father",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f806409d",
               "name": "Taiji Tonoyama",
               "profile_path": "/o3YTph69XZqKeZOerzUpTTAYirW.jpg",
               "id": 33732,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Tarô, the elder son",
               "gender": 0,
               "credit_id": "52fe43a4c3a36847f80640a1",
               "name": "Shinji Tanaka",
               "profile_path": null,
               "id": 33734,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Jirô, the younger son",
               "gender": 0,
               "credit_id": "52fe43a4c3a36847f80640a5",
               "name": "Masanori Horimoto",
               "profile_path": null,
               "id": 33735,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f8064083",
               "name": "Kaneto Shindō",
               "profile_path": "/imbjJnPj5EpIPY6iY7KNDEFgvtB.jpg",
               "id": 33727,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f8064089",
               "name": "Kaneto Shindō",
               "profile_path": "/imbjJnPj5EpIPY6iY7KNDEFgvtB.jpg",
               "id": 33727,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f806408f",
               "name": "Kaneto Shindō",
               "profile_path": "/imbjJnPj5EpIPY6iY7KNDEFgvtB.jpg",
               "id": 33727,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a4c3a36847f8064095",
               "name": "Matsuura Eisaku",
               "profile_path": null,
               "id": 33733,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57a2312dc3a3686c15000448",
               "name": "Hikaru Hayashi",
               "profile_path": null,
               "id": 1034270,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57a231349251415f2c004423",
               "name": "Kiyomi Kuroda",
               "profile_path": null,
               "id": 1183025,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57a231449251415f2c004427",
               "name": "Toshio Enoki",
               "profile_path": null,
               "id": 1183026,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a2314ec3a3686af20004fa",
               "name": "Mihoko Yoshino",
               "profile_path": null,
               "id": 1660917,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "57a231579251410c10000424",
               "name": "Kazuo Kuwahara",
               "profile_path": null,
               "id": 1472695,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "57a23160c3a3686af2000504",
               "name": "Mitsunori Kanaoka",
               "profile_path": null,
               "id": 1660918,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "57a2316a9251410c43000445",
               "name": "Takahisa Katsume",
               "profile_path": null,
               "id": 1615864,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5a83696e0e0a264011004e0d",
               "name": "Kunie Maruyama",
               "profile_path": null,
               "id": 1625801,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.085637,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 3764,
      "vote_count": 35,
      "budget": 0,
      "overview": "Deals with the intolerably hard life of a family of four, the only inhabitants of a very small Japanese island in the Setonaikai archipelago. Several times a day they row over to the neighboring island to fetch water for their miserable fields.",
      "similar": [
         400,
         948,
         3600,
         4771,
         769,
         205,
         8456,
         281,
         201085,
         452507,
         254320,
         281957,
         395834,
         339692,
         9373,
         341006,
         445954,
         10285,
         431,
         4141
      ],
      "original_title": "裸の島",
      "runtime": 94,
      "poster_path": "/cG4mcAdRoL6BPjSVLtoh3WDPsUU.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Kindai Eiga Kyokai",
         "id": 1516,
         "origin_country": ""
      }],
      "release_date": "1960-11-23",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Kaneto Shindô"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Kaneto Shindô"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0056049/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2Nzc5OTk2N15BMl5BanBnXkFtZTcwNDgyOTk4Ng@@._V1_SY317_CR104,0,214,317_AL_.jpg",
      "actors": ["Stars: Nobuko Otowa, Taiji Tonoyama, Shinji Tanaka | See full cast and crew »"],
      "reviews": [
         "I was living next to the Seto Naikai (Inland Sea) at the time this movie was made, and marvel at its matchless, eclectic choice of images and atmosphere to convey the ambiance of the time and place. The photography, music, and restrained acting are perfection itself. The lack of dialogue helps, rather than hinders, its beautiful, simple story. It has captured a Japanese way of life and culture (actually lived by the director---the movie was made as a tribute to his parents) forever and in the very highest artistic sense. The movie is so genuine, so sympathetic to its participants and subject matter, that the viewer is softly, irresistibly, drawn in to share their travails. For years it has been a wonder to me why this classic film has been forgotten. Of the thousands of movies I have seen in my lifetime, this is the finest.",
         "I came to the internet searching for information on this movie. Not only did I find it, but I found a comment that mirrored my own experience with the movie. I too saw it in my student days, nearly 30 years ago, in a Friday-night \"cinema\" series in the student union theater. I see it's listed as B&W; I remember it in color -- maybe colorized it in my head? No dialog, just music and environmental sound; gorgeous photography of the island, the sea, the brutally hard work ferrying water for the crops on the terraces. And we follow that work for a long long time; we go through impressed, to irritated (why don't they move to town for chrissake), to rage at being made to sit through this for so long, to numb resignation. So we're right where the characters are. Writhing in my seat, hoping it will come to an end. And then the brief scene that left me stunned, that made sense of all that lead up to it, two seconds of film that explain us in the universe. Like William, I've never met anyone else who's seen this movie. And I don't know if I could sit through it again. But I'm sure glad I did back then.",
         "I was surfing on the t.v. and came across this incredible \"little\" film on a French Canadian station. As there is no dialogue and the story is so human and pure, it is truly the most universal picture I've seen. I defy anyone not to be moved by the challenges which the characters face, the realism in the minimalist acting and the beauty of the simplistic black and white camerawork. I've never heard of this film, but I will tell all my friends about it.",
         "I saw this movie twenty years ago and I still remember it fondly. It should be part of the training of movie directors to see and analyze this movie. The naked island (as it was named in France) shows the hard struggle of a fisherman's family to survive in a very harsh environment. It is very emotional yet does not call on any modern artifice to carry the message. The music will stay with you forever. My only regret is that I can't get a copy to show my children what movie making can be.",
         "Amazing! Let me join the happy few who saw this film when it first came out. It was in Paris. I was a student. It was L'Ile Nu I think. And I have never forgotten it and never seen it again. That's over 40 years ago! And now it is coming out on DVD and most people will never have heard of it. So my dear golden oldies who were young in 1961, rejoice and tell everyone. This is pure cinema with no frills, worthy of comparison with Dreyer, Bresson and O'Flaherty and a lovely companion piece to Shindo's ONIBABA. That onibaba grass stayed with us over the years as did that naked island. Talking of films lost but not forgotten, I can draw a comparison with MERE JEANNE DES ANGES (same subject matter as Ken Russell's THE DEVILS)which I saw in Leipzig in about 1962 and which I have never seen since. What a coincidence! That Polish film (MOTHER JOAN OF THE ANGELS)is also coming out on DVD. Real poetic cinema is trickling through the mishmash.",
         "If you have ever wondered what a film would be like that exemplifies how the tools of the craft can be used to do powerfully what no other art can do, this film answers the question. It is among the most carefully wrought, least encumbered yet profound movies ever made. The fact that it has long been unavailable in America and Europe in any accessible format reflects very sadly upon us all. (Addendum 15 March 2008 for those of you with region-free players: the English distributor, Eureka, has thankfully released the original widescreen version of the movie in PAL format in its 'The Masters of Cinema Series', #12, with an optional commentary by Shindo and his composer, Hikaru Hayashi. Available from Amazon.uk.)",
         "I remember this film from my student days. I saw it in an uptown, shabby, art house theatre (when art meant porn) in Philadelphia. I was amazed. As I recall, it is a film without dialog. Not silent, but no dialog. Black and white, but singularly visual. Three, maybe four characters with self- effacing directing and camera work, it was as intimate as small off-Broadway theatre. I've seen nothing since as cinematic, or moving. No one I've ever met, has seen it. But I remember it vividly.",
         "Probably one of the most moving movies in the history ; the more so because of the simplicity of the movie: no dialogs, B&W, a very slow pace and non professional actors. But from the first to the last minute it is about fate and courage and man. Do see it. You'll understand.",
         "Probably one of the most simple and still moving movies ever seen. No words. No special effects. A family: human beings that live and work and suffer and die and live.",
         "Okay, we have a loving tribute here, personal for director Kaneto Shindo as portraying the life of his parents. We have the rural hardship, and dogged persistence for live in a place where water is painfully hauled over a steep cliff, and we have the quiet cinematic language that describes it. But also describes a life of simple pleasures. Shindo observes both closely, with sympathy. The narrative thread of The Naked Island flows with the slow and dull repetition of life itself - if the movie is dull and monotonous it is because life is dull and monotonous and with a handful of fleeting moments of pleasure and joy scattered among the daily routine of making ends meet. In that sense, the artificiality that some reviewers have spoken of (certainly Shindo's decision to include no dialogues and the film almost silent save for a few natural sounds and voices) touches upon the heart of the thing. The film follows the cycle of the seasons as the family tries to survive in the small island and it is by using the renewal of nature as a backdrop that Shindo draws emphasis on the periodic nature of life and time - the snake that eats its tail. The theme of renewal and the cycle of life and death is further symbolized through long, repetitious sequences of the man and wife transporting irrigation water in large buckets through the steep steps of a hillside and even further as Shindo ends the film cyclically with the same aerial shot that opened it. The other major triumph for the great Japanese director is the visual language he employs to tell the simple and languidly paced story. This is probably a point that will only interest the avid film buff but I'm fairly sure it's that kind of person only that will seek out such a film anyway. The cinematography consists of full images, superb staging and framing of the (little is the truth) action, images as much beautiful in the subject they present as in the presentation of the subject itself and vibrating with honesty and clarity of vision. As with Kurosawa in DERSU UZALA, The Naked Island captures the essence of 'life as lived in' - the texture, the mood, the smell. Combined with the symbolism he has carefully planted within the film, The Naked Island is a complete depiction of life on both macrocosmic and microcosmic levels. Of a very specific kind of life the truth is (rural life in a Japanese island in the 30's) but in the larger scheme of things and in the things that actually matter, what is true of one man is true of many. In an age where directors are content to just wink at their audiences with a sense of smug satisfaction, presenting us with cynic and gimmicky films, swapping emotional catharsis for surprise 'twists', doing away with honest character portrayals in favour of decorating characters with random quirks, having forgotten visual storytelling in favour of redundant voiceovers, shaky cams or self-consciously, witty dialogue; in an age like this, The Naked Island seems to come from another planet, alien to the mentality and ethics of modern cinema as much as its bucolic subject matter is to modern city life. It's definitely not something that will appeal to most but those that will set out looking for it will not be disappointed."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Kindai Eiga Kyokai"],
      "summaries": [
         "Deals with the intolerably hard life of a family of four, the only inhabitants of a very small Japanese island in the Setonaikai archipelago. Several times a day they row over to the neighboring island to fetch water for their miserable fields.",
         "A family of four are the sole inhabitants of a small island, where they struggle each day to irrigate their crops."
      ],
      "budget": 0
   },
   "movielensId": 58422,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1960-11-23",
      "dvdReleaseDate": null,
      "directors": ["Kaneto Shindô"],
      "runtime": 94,
      "movieId": 58422,
      "title": "The Naked Island",
      "mpaa": null,
      "actors": [
         "Nobuko Otowa",
         "Taiji Tonoyama",
         "Shinji Tanaka",
         "Masanori Horimoto"
      ],
      "imdbMovieId": "0056049",
      "originalTitle": "裸の島",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Deals with the intolerably hard life of a family of four, the only inhabitants of a very small Japanese island in the Setonaikai archipelago. Several times a day they row over to the neighboring island to fetch water for their miserable fields.",
      "tmdbMovieId": 3764,
      "avgRating": 3.66129,
      "releaseYear": "1960",
      "numRatings": 31,
      "posterPath": "/cG4mcAdRoL6BPjSVLtoh3WDPsUU.jpg"
   }
}