{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "teammate",
            "id": 154942
         },
         {
            "name": "narcissism",
            "id": 157291
         },
         {
            "name": "injury",
            "id": 158591
         },
         {
            "name": "skiing",
            "id": 159558
         },
         {
            "name": "winter olympic",
            "id": 241857
         }
      ],
      "imdb_id": "tt0064253",
      "video": false,
      "title": "Downhill Racer",
      "recommendations": [
         109815,
         121211,
         117500,
         106224,
         80382,
         12578,
         22014,
         199570,
         1918,
         49683,
         56386,
         96337,
         89573,
         3030,
         128343,
         55562,
         59144,
         22871,
         62676,
         25113
      ],
      "backdrop_path": "/tNilSjbwWWEBv67rbGDKL8kAprU.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "57eb2a0b9251410db4000853",
         "content": "If ANY film I have ever seen comes the closest to taking a sophisticated look at what most of the world would consider to be the spoiled-rotten, prima donna, mega-talented amateur athlete (I would add 'American', but I believe they would be like Redford's characterization even if they weren't), Michael Ritchie nails it. Way underrated. And it makes you wonder, especially with the poster pictured here, if the title's a double entendre (and not just slickly-marketed sex-advertising), not merely for various OTHER curves Redford's character wants to/succeeds in navigating, but also the possible crash-and-burn Chappellet may have, if he continues his wild, burn-the-candle-at-both-ends lifestyle while participating in quite a dangerous sport. Sonny Bono-jokes aside, this kind of thing happens.\r\n\r\nSimply marvelous work by Redford, Gene Hackman, Ritchie and cinematographer Brian Probyn. Essential purchase and rewatches for sports fans and the work of Redford, Hackman and Ritchie especially. Easily my favourite of Ritchie's work, next to, sentimentally, 'The Bad News Bears' (which is a whole different kettle of fish altogether).",
         "url": "https://www.themoviedb.org/review/57eb2a0b9251410db4000853"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "David Chappellet",
               "gender": 2,
               "credit_id": "52fe45019251416c9102446d",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eugene Claire",
               "gender": 2,
               "credit_id": "52fe45019251416c91024471",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carole Stahl",
               "gender": 1,
               "credit_id": "52fe45019251416c91024475",
               "name": "Camilla Sparv",
               "profile_path": "/2E5OhNSpzv6yMd1aNLgfRLCvqVB.jpg",
               "id": 70424,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Machet",
               "gender": 2,
               "credit_id": "52fe45019251416c9102447f",
               "name": "Karl Michael Vogler",
               "profile_path": "/k1hTwobC6OromK5fxq7A8YDcmGh.jpg",
               "id": 32021,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Johnny Creech",
               "gender": 2,
               "credit_id": "52fe45019251416c91024483",
               "name": "Jim McMullan",
               "profile_path": "/ySSDNXhh5xpXbfpYDibBkjWPH5s.jpg",
               "id": 42978,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "American Newspaper Woman",
               "gender": 1,
               "credit_id": "52fe45019251416c91024487",
               "name": "Kathleen Crowley",
               "profile_path": "/6J6uanos6031AVcO7m3HmW1tX35.jpg",
               "id": 118300,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mayo",
               "gender": 2,
               "credit_id": "52fe45019251416c9102448b",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Restaurant Patron (uncredited)",
               "gender": 2,
               "credit_id": "590d9dab9251414e8d00c9c3",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "D.K.",
               "gender": 0,
               "credit_id": "5aa1523a92514160ff0087b5",
               "name": "Kenneth Kirk",
               "profile_path": null,
               "id": 1993136,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Kipsmith",
               "gender": 0,
               "credit_id": "5aa1524792514160f7009081",
               "name": "Oren Stevens",
               "profile_path": null,
               "id": 1993137,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Engel",
               "gender": 0,
               "credit_id": "5aa1525392514160f5008cb5",
               "name": "Jerry Dexter",
               "profile_path": null,
               "id": 1215814,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Mr. Chappellet",
               "gender": 0,
               "credit_id": "5aa1525f92514160f2008d62",
               "name": "Walter Stroud",
               "profile_path": null,
               "id": 1894117,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Lena",
               "gender": 0,
               "credit_id": "5aa1526c92514160f90092aa",
               "name": "Carole Carle",
               "profile_path": null,
               "id": 1993138,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Devore",
               "gender": 0,
               "credit_id": "5aa152770e0a2644e900a90a",
               "name": "Rip McManus",
               "profile_path": null,
               "id": 1993139,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Tommy Erb",
               "gender": 0,
               "credit_id": "5aa1528fc3a3685067009b70",
               "name": "Joe Jay Jalbert",
               "profile_path": null,
               "id": 1672846,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Stiles",
               "gender": 0,
               "credit_id": "5aa1529c92514160fc008ecf",
               "name": "Tom J. Kirk",
               "profile_path": null,
               "id": 1993140,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45019251416c9102447b",
               "name": "Michael Ritchie",
               "profile_path": "/62566NoTLMRVLdoE07RG1B55zxy.jpg",
               "id": 12964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53bee5f80e0a26157f004b8d",
               "name": "James Salter",
               "profile_path": null,
               "id": 129710,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5ab2ce6c9251413a0501024f",
               "name": "Angela Allen",
               "profile_path": null,
               "id": 108656,
               "department": "Directing",
               "job": "Continuity"
            },
            {
               "gender": 0,
               "credit_id": "5ab2cead925141164201145d",
               "name": "Richard Gregson",
               "profile_path": null,
               "id": 1439679,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ab2ceeac3a3681cdc00e5cd",
               "name": "Richard A. Harris",
               "profile_path": null,
               "id": 3985,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ab2cef70e0a261e03010ce6",
               "name": "Brian Probyn",
               "profile_path": null,
               "id": 30573,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5ab2cf85c3a3686fb0012b7a",
               "name": "Kenyon Hopkins",
               "profile_path": null,
               "id": 5260,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.016403,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33166,
      "vote_count": 28,
      "budget": 16500000,
      "overview": "An ambitious young skier, determined to break all existing records, is contemptuous of the teamwork advocated by the US coach when they go to Europe for the Olympics.",
      "similar": [
         13416,
         319888,
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         396371,
         323677,
         10474,
         699,
         707,
         9563,
         2323,
         86130,
         5693,
         11287,
         444218,
         26602
      ],
      "original_title": "Downhill Racer",
      "runtime": 101,
      "poster_path": "/fJDQDmJDiEzRROph0T1ace8oyNK.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1969-11-06",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "How fast must a man go to get from where he's at?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Ritchie"],
      "runtime": 101,
      "synopsis": "Comments by Actor / Writer Roy C. Peterson This is a skier's movie. I only wish there were more ski movies. I've seen this one many times and enjoy it every time. Robert Redford did all his own skiing for this and must be especially fond and proud of this particular film. The character Redford plays, David Chappellet, is a very bleak and grimly determined individual (Remember Bruno in The Blue Max?) When David goes home to visit his father we see where he got his emotional approach to living. Their conversations are so minimalist as to be nearly autistic. From their viewpoint probably just seen as practical minded and verbally economical. But I don't care what anybody says. There was something I liked about this character and found myself rooting for him. I was happy when he won at the end. What else would there have been to this story if he hadn't won? To love your work and to never betray it, whatever else happens, is one of the greatest gifts that life can give.",
      "writers": ["James Salter"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064253/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTc3MjU5ODc0M15BMl5BanBnXkFtZTcwMDMyMTk3Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Redford, Gene Hackman, Camilla Sparv | See full cast and crew »"],
      "reviews": [
         "When Robert Redford delivered this film to the studio upon completion, the suits weren't sure what to do with it. How does one sell a pensive film about Pyrrhic victory? Against Redford's wishes, the studio ultimately marketed the film as a sports movie (\"See hottie Robbie in exciting skiing scenes!\"), and confused audiences avoided the film in droves. Redford, frustrated with the experience, created the Sundance Film Institute as a reaction to his experiences with \"Downhill Racer\". Today, it is for this reason that \"Downhill Racer\" is best remembered, but one shouldn't overlook the work itself. The film, the first in an unfinished trilogy of films about the price of success (the second was \"The Candidate\"), is a thoughtful study of competition and competitiveness. Gene Hackman shines as the impatient coach, but Redford gives one of the finest performances of his career as the brooding, singular-minded athlete. Redford's performance is reason enough to watch the film, but the skiing scenes are also quite entertaining, as they fully capture the excitement and exhilaration of Olympic competition. The dark, ironic story, while slight, is still effective enough to make its point. I shouldn't like to call this film a masterpiece; it isn't. It's a decent slice of cinema that is very unfairly maligned by too many. If you, like those studio executives, prefer a straightforward sports story in which the underdog wins and gets The Girl, look elsewhere. However, if you prefer an intelligent investigation of the human condition, well, you could do worse than \"Downhill Racer\".",
         "In this film, Robert Redford plays David Chappellet a young man training on a ski team with hopes of making the Olympics. The film is basically a character study of a somewhat narcissistic, shallow, self-centered guy from a simple rural background who dreams of attaining fame and fortune by entering the Olympics as a downhill racer. Throughout the film we see examples of his failure to connect with people. He visits his dad on his ranch and is received with complete coldness and indifference. He pulls into town and picks up an old girl friend, takes her for a ride and they have sex. Afterwards, he completely ignores her when she tries to tell him about her life. He pursues Camilla Sparv who plays the beautiful Carole Stahl. In her, he has met his match. She seems to be someone who also uses people, never lets them get very close and always has an agenda to get what she wants. She works for a ski manufacturer who seems to use her to bait the young up and coming skiing stars that he seeks to groom for product advice and future endorsements. She is narcissistic, shallow and self-centered like him but she is also elusive. This plays to the competitor in him and she knows that. Throughout the film we see Gene Hackman who plays the skiing coach Eugene Claire. We witness numerous scenes where Chappellet ignores his advice and counsel, where the coach calls him on his arrogance and selfish attitude. But in the end, they triumph and seem to be headed for the Olympics. But in the last brief scene, victory and fame seems so fickle, elusive, short lived, it all seems superficial. Redford is wonderful in this and of course, Gene Hackman is just as good. Seeing these two early in their careers, that alone makes this a film worth watching.",
         "Redford gives a low-key performance as a thoroughly unlikable member of the US Ski Team in the late 1960's, and he doesn't become any more likable as the story unfolds. Perhaps that's why the film gets such mixed reviews. The Olympic and racing sequences have an almost-documentary look to them, and for good reason. The story goes that IOC officials refused permission for the film crew to shoot during the actual Olympic events; the producers got around that inconvenience by giving hand-held cameras to cast members so they could shoot crowd scenes and background footage on the sly. It's hard to like David Chappellet, and making him a more sympathetic character might have been easier, but I think it's a much better story as-is. As we know all too well these days, world-class athletes aren't always aren't always the charming heroes we'd like them to be.",
         "After many years of catching brief scenes of this now semi-cult film, I finally watched it in its entirety. It is not a great film, but for film students, and fans of both Gene Hackman and Robert Redford, it's a must. The opening credits are delivered over scenes of a Super G skier flying down the mountain and feature a combination of stop action and over-cranked footage. The film quality is beautiful, and although the techniques now seem dated, they stand for what was cutting-edge editing at the time. Watching the opening, you feel like you're in for a great ride but are sadly let down by a staid script. Having said that, the film can sort of get a way with this (at least to a certain extent) because you've got such great actors playing the main roles of skier (Redford) and coach (Hackman). Both know how to exploit the economy of language and show a lot simply with body language and expression. (They must have realized they had to with this script.) Add to that fact, that the character Redford is playing - a vainglorious Super G racer named David Chappellett, probably wouldn't have much to say. Ultimately, the film serves as cinematic commentary on how fleeting success is in a sport like skiing, as well as the shallowness shown by both the press that cover the sport, and the women that covet the skiers.",
         "The appeal of a ski film to those who ski is obvious. But imagine yourself innocent of skiing. Can it hold the attention of the rest of us? Roone Arledge and his \"Wide World of Sports\" provided one answer, as Jean Claude Killy and his successors skied into American living rooms on many winter Saturdays. \"Downhill Racer\" seconds the motion. The late Mike Ritchie, who'd essayed nothing more ambitious than commercials, traveled the World Cup circuit in the 1967-68 winter, accompanied by Aspen novelist Jim Salter, whose screenplay (from Oakley Hall's very different novel) effectively was written in segments the night before each shoot. Almost everything about this production was improvised. Athletes are not necessarily interesting people. Killy was; stories about him, some even true, are legion. David Chappellet (a young Robert Redford), more typically, reminds one of the astronauts in \"2001\", with their limited range of expressions and nothing particularly interesting to say. This comes across powerfully in several hilarious interview scenes, with American and European journalists trying in vain to get the young man to say something worth writing down. Wengen, Switzerland passes for several World Cup race sites. (A Swiss medico wears an armband identifying him as \"Arzt\", or doctor, at a supposed French venue). The filmmakers also were present in Grenoble for the Winter Olympics, providing a fictional inside look at the Games far different from that of, for example, \"Chariots of Fire\". One still doesn't ski, but the pleasures of \"Downhill Racer\" are undeniable.",
         "After reading the several pages of comments, I wonder if some of the other reviewers really 'saw' this film. I grew up loving the sport of skiing and when the movie came out, I was almost obsessed with skiing. Unfortunately, I'm from the flatlands and so had to content myself for most of the year with vicarious experiences like Warren Miller films and marginal movies like Killy's 'Snow Job' and 'Hot Dog \u0096 The Movie' ('Better Off Dead' was a much better film from a skiing standpoint). Miller's films were fine, but those other two movies were trash. Of course, none of them, not even this one, could compete with 'Ski the Outer Limits' and 'The Moebius Flip', but those were in another league altogether. So, we have Downhill Racer\u0085. the biography of Bill Johnson. OK, not really, because Johnson could give great interviews. But the brash American who believed only in himself, well, I guess Bode would now also fit. The humor in the movie was that when it was made, the European skiing community scoffed. Not that it was a good or bad movie, but they could not accept a plot where an American!!! could win the Olympic Downhill Gold. Remember this was before 1984 and Bill Johnson. Being an avid skier (even club racing) and reading everything I could find (several mags and two newsletters, besides many books), I had an awareness of some of the lesser known stories. And there was certainly some leeway taken in how the movie was presented. For example, at that time, World Cup skiing was pretty much amateur for the Americans and fully professional for the Europeans, although totally under the table (Avery Brundage \u0096 the last Olympic commissioner to have an absurd fantasy belief in amateurism - couldn't control the Europeans but he ruled with an iron fist over the Americans). Often, quite competitive American skiers were left at home because the National team budget didn't have enough money. Or how Karl Schranz (sort of who the character, Max Meier, was based on) was robbed of the Downhill medal in 1964 by Jean Claude Killy (or rather by the judges at the French resort where it was held). And that the American ski team was more than just male downhillers (oh, yes, with women barely mentioned in the movie during that interview with the rather naïve American reporter), when in reality it included slalom and giant slalom racers, some of whom raced in the 3 disciplines available then (the Cochrans, the Palmers, the Mahres are easy examples). The irony of the final scene in the movie, is that here, after all that David Chappellet put into winning the Olympic gold, by the time he did, he is no longer the young brash new skier on the block. The kid that almost beat him, was in reality a younger, brasher, newer version, that, looking at both as the one skis off the course and the other again accepts the accolades that had almost dried up, makes us think that at the height of his fame and glory, poor David Chappellet is now washed up, a has been, for the skiing community is about to move on to its next wunderkid. One or more of the other reviewers here erroneously wrote that the competition was a Super G. Well, since the Olympics allowed all comers (sort of, remember the Jamaican Bobsled team and Eddie the amateur ski jumper), they regularly 'dumbed' down the Olympic downhill courses so they became what we think of as today's Super-G. The Europeans knew that the real yearly races like the Hahnenkamm or Lauberhorn were the true tests of downhill racing. Also, the yearly winners of the World Cup as well as the World Alpine Championships were held in much higher regard by the racers and cognoscenti than Olympic winners, unless it was one of the chosen Europeans who won the Gold, of course. Redford, in an interview, said he especially liked the scenes that his character had with his father back home (in Idaho Springs, Ida\u0085no, Colorado) during the off season. I found those dreary at best. It reminded me of that scene in 'Love Story' where the hero, who was ONLY captain of the Harvard Ice Hockey Team was sneered at by his father who had been an OLYMPIC competitor. Of course, I did get a little hungry for some Ritz crackers while watching Redford. I'm not sure how you can live in the mountains, that kind of setting, and not know anything about competitive skiing, or at least the Olympics. By the 60's thanks to Jim McKay and Wide World of Sports, most people had heard of Killy and were now commonly confusing Billy Kidd with Jean-Claude. Such is the price of fame. For a ski movie, the race scenes were riveting, the acting of people like Gene Hackman and Dabney Coleman was quite adequate, the beauty of Camilla Sparv was eye pleasing. It was a decent movie, but still confined to a certain time. Better to watch the movie as a part of a series in the career of Redford \u0096 Downhill Racer, Little Fauss and Big Halsey, ending with The Candidate, where he began to play larger characters. He was still the loner, but in a bigger and often more important setting. At least here he had broken out of his 'silly' movies \u0096 'Inside Daisy Clover', 'The Chase', 'This Property is Condemned' and the like, even 'Barefoot in the Park' in some ways, his first starring movie. Of course, it was 'Butch Cassidy and the Sundance Kid' that completely changed the way we looked at Redford, both past and present.",
         "For anybody who follows international sports, the characters and organizations in this movie ring true. Whether you follow skating, gymnastics, skiing, or any other essentially solo international sports, you have seen the loners, the chosen stars, the politics, fund raising, and everything else that goes on behind and in front of the scenes. This movie captures those people and circumstances exceptionally well. As has been noted in the coverage of the Olympics, the parallels to the 2006 US downhill team are stunning. The fact that this movie was made in 1969, with the film style of the day, makes it quite dated. But it is exactly the dated fashions, music, cinematography, skiing equipment, and attitudes that make it a keeper. Downhill Racer remains the seminal skiing movie (unless one prefers the slob humor of Hot Dog: The Movie), but it's also about bigger themes. Redford is the quintessential American loner, out for his own goals and not interested in serving the needs of his sport, his team, or the international press. It's a character we've seen a thousand times in real life, and it's one who gets deified or demonized depending on his success in the field of sport. So, view this very dated movie in today's context. You'll be surprised how relevant it is.",
         "Cocky loner Redford joins Hackman's Olympic men's ski team, ready to set the world on fire. I don't agree with the lead comment that there isn't enough action in this movie, but there is something else that's missing, not sure what - maybe it's that the presentation is very simple and almost bleak. It could be considered a character study rather than an sports movie, except that the reason for Redford's enigmatic behavior is never really explained. Hackman and Redford are both excellent in their respective and often adverse roles. Worth a view.",
         "Gene Hackman is the coach; Robert Redford the star skier looking for Olympic Gold and himself. This is a wonderful character study of a man who wants to succeed above all else. Hackman is wonderful (as always) as the coach who tries to manage a team of individuals who are trying to break through into big time international skiing. Redford was brilliant in playing complicated introspective young men... Three Days of the Condor, Jeremiah Johnson, The Candidate. These set the stage for his later great work in Out of Africa and even Havana (another very very good movie panned by the critics). Even the ending is perfect. Enjoy.",
         "Sport movie about an egoist man who unites a notorious ski team , it's mainly a character study . It deals with a small-town egotist named David Chappellet (Robert Redford in one of his earliest protagonists roles) joins U.S. ski team as downhill racer and clashes with the team's coach (Gene Hackman). Meanwhile , David falls in love with a beautiful and glamorous girl (Camilla Sparv who married Robert Evans of Paramount) Colorful and vivid story about ski sports with Robert Redford as a bleak and grimly character as a quietly mean-spirited sportsman who joins USA Olympic Games Ski team . Lots of dazzling skiing action leading to an thrilling highlight . Redford did all his own skiing for this , ten days before shooting began , he accidentally drove a snowmobile over a cliff, tearing his tendon and requiring seven stitches in his knee . Redford's good performance and a gorgeous Camilla Sparv ; however , both of them are two unappealing characters . Fine secondary cast but playing brief interventions as Karl Michael Vogler as Machet , Kathleen Crowley as American Newspaper Woman , Dabney Coleman as Mayo and cameo by Natalie Wood who appeared, well-disguised, as an extra in some crowd scenes ; she worked as an assistant behind the scenes , she typed script revisions, shopped for wardrobe and props . Worth enduring for the spectacular ski scenes that are justly the basic visual splendors . Astonishing Alpine location cinematography being splendidly filmed by cameraman Brian Probyn . Shot on location in Boulder, Colorado, USA (training track scenes) Durango, Colorado, and Kitzbühel and Europe : Tyrol, Austria , Wengen, Lauterbrunnen, Kanton Bern, Switzerland . Atmospheric and enjoyable musical score by Kenyon Hopkins . Michael Ritchie's visceral feature film debut for which he was hired by Robert Redford ; being efficiently directed but hard to amusing . He started his career as an assistant producer in television in the early 1960s and repeating with Robert Redford in ¨The candidate¨. Sports continued to be his forte, his greatest box-office successes being satirical movies about baseball ¨Bad New Bears (1976)) and gridiron ¨Semi-Tough¨(1977)) and ¨Wildcats¨ (1986) . With less commercial success , he took a humorous swipe at beauty pageants with the underrated film ¨Smile¨ (1975). While his work became more mainstream during the 1980's, it does include a few memorable comedies, notably ¨Fletch¨(1985) and its sequel ¨Fletch lives¨(1989) . But also made agreeable comedies such as ¨The survivors ¨, ¨The couch trip¨, ¨The golden child¨ , ¨A simple wish¨ and even Noir film as ¨Prime cut¨. Rating : Acceptable and passable ."
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Wildwood",
         "Wildwood Enterprises"
      ],
      "summaries": [
         "David Chappellet is a mean-spirited skier, who profits from another skier's injury to gain a spot on the American Olympic team. His roommate sums up his goals when he observes of David, \"He's not for the team, and he never will be\"; but precisely who the David is that David is so fiendishly striving for we're never to learn. He develops a short-lived relationship with Carole Stahl, a glamorous European woman even more capricious than himself. Chappellet's identity trouble are exacerbated by the fact that he is an \"Event\" as well as a personality; and more astute minds than his own have difficulty where the one leaves off and the other takes over. Director Michael Richie's (\"The Candidate\") feature film debut.",
         "From the small rural community of Idaho Springs, Colorado, Dave Chappellet has just joined the US men's downhill ski team, which has little respect from the traditional powerhouses from Europe as the US only has one seeded skier, Johnny Creech. Dave believes the team's head coach, Claire, is not looking after his best interest, such as not fighting to get him higher start numbers in races. Regardless of this and other external obstacles which Dave believes are the only things between him and the podium, he is able to achieve skiing success which leads to eventually being among that first seed with Johnny. Although Dave does ultimately win races, he DNF just as many, as he has an all or nothing approach. Conversely, Claire has a love/hate relationship with Dave, who he knows is talented and winning races will ultimately bring in much needed funding to the team as a whole, but his self-absorbed and arrogant attitude has alienated himself from the rest of the team and created team disharmony. Dave's attitude is borne out of his distant relationship with his farmer father, who does not understand why Dave is not pursuing a paying job, and an inferiority complex growing up without money like his teammates. That arrogance is also demonstrated in his personal life, in how he treats Lena, his girl back home, and how he pursues Carole Stahl, an employee of ski manufacturer Machet, who is wooing the American ski team to use his skis. Two years in Dave's journey is shown, chasing the ultimate prize of the gold medal in the men's downhill at the next Olympics.",
         "Quietly cocky Robert Redford joins U.S. ski team as downhill racer and clashes with the team's coach, played by Gene Hackman. Lots of good skiing action leading to an exciting climax."
      ],
      "budget": 1600000
   },
   "movielensId": 58439,
   "movielens": {
      "languages": [
         "Deutsch",
         "Français",
         "English"
      ],
      "releaseDate": "1969-11-06",
      "dvdReleaseDate": "2009-11-17",
      "directors": ["Michael Ritchie"],
      "runtime": 101,
      "movieId": 58439,
      "title": "Downhill Racer",
      "mpaa": "",
      "actors": [
         "Sylvester Stallone",
         "Robert Redford",
         "Gene Hackman",
         "Camilla Sparv",
         "Karl Michael Vogler",
         "Jim McMullan",
         "Kathleen Crowley",
         "Dabney Coleman"
      ],
      "imdbMovieId": "0064253",
      "originalTitle": "Downhill Racer",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "nBpHsIxp8ak",
         "UMtqOG9rPfw"
      ],
      "plotSummary": "An ambitious young skier, determined to break all existing records, is contemptuous of the teamwork advocated by the US coach when they go to Europe for the Olympics.",
      "tmdbMovieId": 33166,
      "avgRating": 3.29,
      "releaseYear": "1969",
      "numRatings": 50,
      "posterPath": "/tIUySuW4CEAmkjK9MtulOIJDDT1.jpg"
   }
}