{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0089904",
      "video": false,
      "title": "Restless Natives",
      "recommendations": [
         43233,
         34665,
         78842,
         48989,
         60481,
         84109,
         130580,
         89160,
         43488,
         111769,
         42989,
         17804,
         122268,
         63912,
         71171,
         104364,
         34127,
         33743,
         49798,
         17120
      ],
      "backdrop_path": "/uV0oTzQJYhPw3cGT1eCIgLEOtoS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Will",
               "gender": 0,
               "credit_id": "52fe4602c3a368484e07bbd7",
               "name": "Vincent Friell",
               "profile_path": null,
               "id": 141476,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Ronnie",
               "gender": 0,
               "credit_id": "52fe4602c3a368484e07bbdb",
               "name": "Joe Mullaney",
               "profile_path": null,
               "id": 141477,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Margot",
               "gender": 0,
               "credit_id": "52fe4602c3a368484e07bbdf",
               "name": "Teri Lally",
               "profile_path": null,
               "id": 141478,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bender",
               "gender": 2,
               "credit_id": "52fe4602c3a368484e07bbd3",
               "name": "Ned Beatty",
               "profile_path": "/aO5MtnqcZHpsVYz1nINdjqgEJUl.jpg",
               "id": 13726,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Baird",
               "gender": 1,
               "credit_id": "52fe4602c3a368484e07bbff",
               "name": "Robert Urquhart",
               "profile_path": "/yUsYvfDUKgMAZ0jRJW39EpRd4QJ.jpg",
               "id": 30187,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Will's father",
               "gender": 2,
               "credit_id": "52fe4602c3a368484e07bbf7",
               "name": "Bernard Hill",
               "profile_path": "/fX9ggRFAZM7J8vPBdTWQphUNiRt.jpg",
               "id": 1369,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Pyle",
               "gender": 2,
               "credit_id": "52fe4602c3a368484e07bbe7",
               "name": "Mel Smith",
               "profile_path": "/t9aojcL97IStdae9fP90D84NlSJ.jpg",
               "id": 141450,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Driver",
               "gender": 0,
               "credit_id": "52fe4602c3a368484e07bbfb",
               "name": "Bryan Forbes",
               "profile_path": "/2jVyi8jPtZ84FTmVt7Zc6DxvB09.jpg",
               "id": 31439,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Passenger",
               "gender": 1,
               "credit_id": "52fe4602c3a368484e07bbe3",
               "name": "Nanette Newman",
               "profile_path": "/249mDryM9GcyLtI0N3rQ0zLDSwA.jpg",
               "id": 71733,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Nigel",
               "gender": 2,
               "credit_id": "54cf46a79251415fb30068d7",
               "name": "Iain McColl",
               "profile_path": "/eqGyB0GgdkS0MQD8F9AhIkhiJla.jpg",
               "id": 1087561,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Will's Mother",
               "gender": 1,
               "credit_id": "57ae5570c3a36803150005f5",
               "name": "Ann Scott-Jones",
               "profile_path": "/gtzMOaqhVBTQAzHXDzbj98mcU31.jpg",
               "id": 1517090,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Ilsa",
               "gender": 0,
               "credit_id": "57ae55b7c3a368030500079f",
               "name": "Rachel Boyd",
               "profile_path": null,
               "id": 1665239,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Illingworth",
               "gender": 2,
               "credit_id": "57ae55d79251412f4500071f",
               "name": "Dave Anderson",
               "profile_path": null,
               "id": 1229902,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Presenter",
               "gender": 0,
               "credit_id": "57ae55f09251412f52000758",
               "name": "Eiji Kusuhara",
               "profile_path": null,
               "id": 207310,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Reporter",
               "gender": 0,
               "credit_id": "57ae56019251412f52000762",
               "name": "Ed Bishop",
               "profile_path": "/v5jVNLCSACz9yC0mhD4akfXPtc6.jpg",
               "id": 108277,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Mary Harrison",
               "gender": 0,
               "credit_id": "57ae5618c3a368030c0006ea",
               "name": "Laura Smith",
               "profile_path": null,
               "id": 1665241,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4602c3a368484e07bbc3",
               "name": "Michael Hoffman",
               "profile_path": "/xrMI8tNQgHws3o3Ku5cdH3ayXZx.jpg",
               "id": 52405,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4602c3a368484e07bbc9",
               "name": "Rick Stevenson",
               "profile_path": null,
               "id": 92905,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4602c3a368484e07bbcf",
               "name": "Mark Bentley",
               "profile_path": null,
               "id": 141474,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4602c3a368484e07bbed",
               "name": "Stuart Adamson",
               "profile_path": "/lZIDrFl6tnAmtiv5W9QY3bl9D56.jpg",
               "id": 141487,
               "department": "Writing",
               "job": "Musical"
            },
            {
               "gender": 0,
               "credit_id": "52fe4602c3a368484e07bbf3",
               "name": "Ninian Dunnett",
               "profile_path": null,
               "id": 141488,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.149001,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 29907,
      "vote_count": 9,
      "budget": 0,
      "overview": "Two lads in Edinburgh embark on a non-violent spree of robberies. They dress up in clown masks and act as modern highwaymen, robbing coach loads of tourists in the highlands. In the process they become folk heroes to the locals. Their adventures make for a whimsical and gentle comedy, in the Bill Forsyth vein.",
      "similar": [],
      "original_title": "Restless Natives",
      "runtime": 89,
      "poster_path": "/eudjBuqfscJAQ7o08WSD4qXkhR6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1985-01-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Scotland's most notorious public enemies",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Hoffman"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Ninian Dunnett"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089904/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNzAyNzk0MF5BMl5BanBnXkFtZTgwNzM2MzkwMzE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Vincent Friell, Ned Beatty, Joe Mullaney | See full cast and crew »"],
      "reviews": [
         "I was 12 years old when this came out, I'm Scottish, I'm male and I used to love Big Country. So guess what, I really like this film! It is however not the classic I remembered it to be. After years of searching I finally got this on DVD and I can now see as a grown adult that it does have some faults. The whole armed robbery aspect is a bit dodgy now and the ending is pretty poor too. All the rest is great though, the music is fantastic and the Scottish scenery is of course beautiful. The performances are great and I wonder why the cast never went onto bigger and better things? Instead of parts in dodgy Scottish soap Take the High Road! Ned Beatty is however a big name and its great an actor of his stature would appear in a low budget Scottish film. Good on you Ned! I'm delighted this film has at last appeared on DVD and its not bad but some more extras would have been the icing on the cake. Highly Recommended.",
         "It takes a lot to get around the alarmingly 80's Edinburgh featured in this movie. A lot has changed since then and since the movie is about 2 guys who are bored with their lives, the city scenes are shot in the most drab and depressing way possible. This only accentuates their adventures in the countryside. Basically Ronnie and Will are on the edge. They hate their lives so much and decide that a little highway robbery in the highlands would be just the fun they are looking for. What begins as a little fun soon leads to them becoming local heroes and, by the end, immortal legends. With good characters, some funny scenes and a nice feel-good factor towards the end, Restless Natives makes for easily diverting entertainment. It's long, long out of print and ancient VHS ex-rental copies go for £135 at online auction sites. I think a DVD release is rather overdue. I hope it comes in widescreen when it does. I am unsure or the original aspect ratio but the copy I saw was in pan and scan and the lack of wide shot in the countryside scenes felt awkward and disorientating. The mangled Glaswegian accents did NOT fit the Edinburgh setting though.",
         "I remember seeing this movie as a teenager. Having lived in Edinburgh, it felt great watching a place you know well on the silver screen. The typical Scottish Humour is played well throughout. My only gripe being the actors are all West Coasters, and not East Coasters, where they are supposed to be. The final scenes where they are chased through Edinburgh are fantastic, as is the wonderful soundtrack, by Big Country. The music in the film is a great memorial to Stuart Adamson. If you are an Ex-Pat Scot, then watch this movie, and you'll be transported home.",
         "Restless Natives will begin with a series of intimidating compositions introducing to us two young men in ownership of a motorcycle and whom appear to be somewhat less than hospitable. In close up format of various parts of their bodies, the pair don helmets and leather clothing to an ominous drum beating periodically so as to ride out into the rural nothingness of what turns out to be the Scottish highlands. They are there to rob, thieve and steal from the hapless people inhabiting vehicles whom may make their way down the remote road nearby; and when one car does arrive housing an upper-class English family out on holiday, they fail to impose themselves and the attempted robbery actually turns into a coming to the aid of the lost family. The film jumps from one thing to another in relatively quick time, painting an image of the people we're supposed to be dealing with before effectively demythifying them as these amateurish and rather hapless young men trying to raise money. Therein lies the nature of the film, a piece going to impressive lengths to deconstruct and explore two young Scottish men as well as their lives and mindsets after being later labelled as something else, in what is an an edifying and thoroughly engaging little British film from 1985 which really hits the marks it aims for. Vincent Friell plays one of them, named Will; a young man who's the son of a married couple and a brother to one sister living a working class life in Scotland. He sweeps roads, but maintains a healthy relationship with his family and other young friend of equal age Ronnie (Mullaney), a local kid who's an employee of the town's joke shop. Both of the boys are at a stage in their lives in which aspirations are appearing to form and the moulding of the early stages of adulthood appear ostensible, with both boy's issues and problems primarily work and girl orientated; Will despises his luckless job as a road sweeper and running the joke shop can be rather a pain for Ronnie. One day, out of sheer blind maddening suggestion in what effectively begins as a bit of fun, they decide to use some joke shop equipment in a pair of masks, a toy Luger pistol and a foam gun; ride up into the hills as they've done so before and rob coach loads of tourists. What follows is a film which hops from coming of age tale; to romance; to police procedural thriller all wrapped up into one really effective delivery. American director Michael Hoffman, working from a Ninian Dunnett script, keeps everything in check; aside from the romp that it is, Restless Natives is ultimately a cautionary tale about the pratfalls of crime and a somewhat lowly conceived adopting of celebrity status. Aside from anything else, it is a very good and very involving one. The two attain somewhat of a cult following as the police, led by Ned Beatty's character, struggle to apprehend them; effectively rendering them Robin Hood figures in that their taking from the people specifically there so as to pump money back into the system, through tourism, before distributing the cash to, on occasion, the homeless around the area. An irony here reading something along the lines of tourism in the area booming like rarely before, because of the potential at being held up by these two or the chance of catching a glimpse of them. The social affect the two anonymous thieves have on everybody is highlighted in Will's own father's (played by Bernard Hill) natural reaction to them upon a newspaper report; here being a man whom berates the charge on his gas bill before complimenting the two bandits on their work he deems was was only going to pump money back into the already established-to-be-greedy system in the first place. Things become complicated when Will spies local tour guide Margot (Lally) during one of the runs, the venturing to the coach depot a dangerous ploy in the face of blind affection to do what he does in attempting to find her so as to woo her. Margot's attraction to Will is natural and unforced, her fascination with folk figures or mythical people whom have gone on to become legends, or whatnot, is the reason she's a tour guide thanks to her knowledge on such things; in Will, a person whom has been previously labelled exactly this is right in front of her and beginning to interact with her. Complications arise, people close to the leads begin to discover the truths surrounding them and Will's own relationship with Ronnie hits its own barriers when the moral implications of their actions are explored. Hoffman balances all of the strands, characters and content really well; Will's actions eventually seeing him congratulated by a shady English criminal at a local snooker club as well as those of a similar sort around him. The club of which is decked out in a dangerous red shade, those located within of a criminal mindset and here highlighting the path Will seems to have been given the opportunity to go down should he so wish; his brief newfound sense of friendship with these people echoing what he had before with Ronnie in the joke shop. The locales are key here, the joke shop being an operative place of business more broadly representing a righteous and moral way of life through earning a living; with the snooker club and most of those whom inhabit it a path more representative of an immoral or sinful way of life, somewhere by which robbing people effectively gets you. Restless Natives appears to be the sort of rare find one just doesn't discover, and at a time when the current climate of coming of age tales are mostly processions of crass and putrid sex jokes, it is a crying shame more people apparently cannot be exposed to films such as this.",
         "For Americans, it might take a \"wee bit\" of getting use to the Scottish accents, but this loopy, off-beat picture is so good and so entertaining, the viewer just sits back and takes it all in. Two boys who work at a Magic Store by day make their own \"magic\" as they rob tourist buses after work. Ned Beatty is fine, as always. This film is a real gem: the kind you just wish would get more publicity so that so many more would see and enjoy it. Savor it--and tell your friends!",
         "Please post if you find this film on sale...or if you can find the rights to it. I'm desperate to sign it up and resell it on DVD. This is one of my favourite films of all time. I have looked high and low for a copy. I now find myself in the position of head of acquisitions at a film distributor...and I'm really looking for the film owner. If you are the owner or know who it is please let me know. I'd love to get this out on sale again as I love it, but also I think it's an undiscovred treat for the rest of the world that never saw it. Cheers Neil",
         "Restless Natives is a lovely little curiosity of a film from Scotland. I first discovered the film as a kid and had watched it about 4 times, and had very fond memories of it. On seeing it again recently, I think it is a minor masterpiece of Scottish Comedy. Great idea, fun script, charming acting, good supporting cast, great uplifting music from Big Country and beautiful locations. As a Scotsman, we always get a bit patriotic seeing Scottish locations and hearing Scottish accents in films, and this doesn't disappoint. Forget Braveheart, this is a film that makes me proud to be a Scot. Now, I'm not saying this is by any means a brilliant film... I'm saying that if you like your comedies quirky, silly, fun and with a bit of heart then this is for you. Fantastic acting from Vincent Friell, Joe Mullaney, Bernard Hill, Robert Urquart and Ned Beatty. This film is great, I urge anyone who has seen it years ago to go and get the DVD when it comes out - you won't be disappointed. Favourite moments have to be Vincent's sweeping in the park, the cop in the joke shop, any scene with Ned Beatty and that brilliant chase across Scotland at the end. Yes, there are plenty of weak points in this film too but it makes me smile so much I don't care.",
         "I saw this hilarious film about 15 years ago and have been waiting to get hold of a copy ever since. As a result I can't remember a huge amount about it that hasn't already been mentioned, but the reason for posting is below. The good news is that as of April 18th 2005, it is now available on DVD. It is available from the usual retailers.. e.g. amazon, play.com etc. ASIN for the Region 2 version is B0007SMDCI It is released by Optimum Home Entertainment Enjoy... I'm getting my order in right away in case it gets deleted again",
         "I first saw this movie in about 1986. Back then I was 15 and loved razzing round on motorbikes (still do!). I also regularly went on holiday to the North West of Scotland, Glencoe in particular, and was delighted to see a lot of the beautiful scenery of that part of Scotland captured within this film. There are some excellent performances from the main characters, Joe Mullaney and Vincent Freill, not that well known, except in Scotland, but great nonetheless. Perhaps more famous are the actors who played supporting roles, Ned Beatty, Bernard Hill, Robert Urquhart, and cameos from the likes of Brian Forbes, Nanette Newman and Mel Smith. The Soundtrack is also worth noting. I'm not a fan of Big Country, but the music that they produced for this film is absolutely excellent and complements it completely. I loved the soundtrack for this so much, that I spent 13 years tracking it down! At first it was only available as 2 b-sides split across 2 12-inch singles they had out, but eventually they released it in its entirety on 'Restless Natives - Hits and rarities' in 1998. It's a double cd, I bought it for the 35 minute soundtrack on the 2nd CD and that's the only stuff I play from Big Country - sorry boys! The movie itself was also quite elusive! I had a copy on VHS that I recorded off the telly. It was commercially available on VHS in the late 80's early 90's, then was discontinued! There then followed about 12 years of not being able to buy it at all. The surge of DVD re-issues of old films seemed to overlook Restless Natives for what seemed like an eternity, I had begun to think the Oxford Film Foundation had lost the original film reels! DVD copies of the original VHS were beginning to appear on Ebay, with the original VHS itself starting to attract a premium! Then, all of a sudden, in 2005, 20 years after it's original release, 'Optimum Releasing' brought it out on DVD in full glory! Hurrah! A bonus with the DVD is a short interview with Vincent Friell, who played Will. He looks a bit different after 20 years! Classic little bits to look out for in no particular order:- -Little old lady, mother of 'wee Angus' belting Ronnie Witherspoon unbelievably hard across the face with her hand before beating him remorselessly with a joke rubber squeaky baseball bat while Will disguises himself with a Groucho Marx Nose, Glasses and Moustache kit . - Classic physical comedy. -Watch Will playing with the green slime in the background while Ronnie is speaking to the policeman in the joke shop. Both of them provide an excellent depiction of two lads who think they're gonna get 'found out'. But all the copper wants is to buy a pair of false breasts! -Check out Will rocking back on his chair while talking to his dad at the dinner table. He just about leans back past the point of no return, before recovering it just as his dad shouts at his sister. -The street cleaner who spins his cart round with joy as he's just swept up loads of money, nearly overturns the whole thing! -Look out for the sign pointing to Glencoe Village before the scene where they're arrested. Anyone who's been to the 'Clachaig hotel' in Glencoe will recognise it! All in all, a cracking little movie, well shot, well acted, good soundtrack, lovely scenery. Pace is pretty much spot-on, although if I was pushed, I'd say it drags a touch towards the last quarter of the movie, only because the beginning and middle flow so well. Nice little twist at the end. Definitely worth a watch!",
         "I saw this film years ago, taped it from TV and watched it over and over. I wait patiently for some distributer to produce 'Restless Natives' on DVD so that it can, once more, be a part of my collection. Onto the film: it is rare that you see a Scottish film that is entertaining, doesn't have actors forcing their accents and actually makes you think \"being Scottish isn't so bad\" - this film actually fits the bill. It takes the old \"Butch Cassidy & The Sundance Kid\" formula, transplants it into Scotland, and provides non stop entertainment - you may even be inspired to wear a clown mask and rob tourist buses whilst becoming Scotlands greatest tourist attraction too; it can be that inspiring. Other reviews state that this film has a weak ending, however I feel that there was nowhere else for the film to go; this statement in itself doesn't make too much sense until you have seen the film though. All in all, an enjoyable film that will bring a smile to most faces and perhaps even relight the fire of Scottish patriotism. You may even enjoy the \"Big Country\" soundtrack."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "EMI Films",
         "The Oxford Film Company",
         "Thorn EMI Screen Entertainment"
      ],
      "summaries": [
         "Two lads in Edinburgh embark on a non-violent spree of robberies. They dress up in clown masks and act as modern highwaymen, robbing coach loads of tourists in the highlands. In the process they become folk heroes to the locals. Their adventures make for a whimsical and gentle comedy, in the Bill Forsyth vein.",
         "Two Scottish friends become local folk heroes and tourist attractions when they start holding up tour buses with novelty items."
      ],
      "budget": 0
   },
   "movielensId": 58578,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-01-01",
      "dvdReleaseDate": "2007-05-29",
      "directors": ["Michael Hoffman"],
      "runtime": 89,
      "movieId": 58578,
      "title": "Restless Natives",
      "mpaa": "PG",
      "actors": [
         "Vincent Friell",
         "Joe Mullaney",
         "Teri Lally",
         "Ned Beatty",
         "Robert Urquhart",
         "Bernard Hill",
         "Mel Smith",
         "Bryan Forbes",
         "Nanette Newman",
         "Iain McColl",
         "Ann Scott-Jones",
         "Rachel Boyd",
         "Dave Anderson",
         "Eiji Kusuhara",
         "Ed Bishop",
         "Laura Smith"
      ],
      "imdbMovieId": "0089904",
      "originalTitle": "Restless Natives",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two lads in Edinburgh embark on a non-violent spree of robberies. They dress up in clown masks and act as modern highwaymen, robbing coach loads of tourists in the highlands. In the process they become folk heroes to the locals. Their adventures make for a whimsical and gentle comedy, in the Bill Forsyth vein.",
      "tmdbMovieId": 29907,
      "avgRating": 4,
      "releaseYear": "1985",
      "numRatings": 9,
      "posterPath": "/eudjBuqfscJAQ7o08WSD4qXkhR6.jpg"
   }
}