{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "bar",
            "id": 1010
         },
         {
            "name": "pimp",
            "id": 1667
         },
         {
            "name": "self-destruction",
            "id": 1824
         },
         {
            "name": "masochism",
            "id": 3260
         },
         {
            "name": "bartender",
            "id": 3458
         },
         {
            "name": "arrest",
            "id": 5638
         },
         {
            "name": "poet",
            "id": 5933
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "alcoholic",
            "id": 33457
         },
         {
            "name": "typewriter",
            "id": 34030
         },
         {
            "name": "ex-husband ex-wife relationship",
            "id": 163758
         },
         {
            "name": "deadbeat dad",
            "id": 181514
         }
      ],
      "imdb_id": "tt0086410",
      "video": false,
      "title": "Tales of Ordinary Madness",
      "recommendations": [
         86282,
         91067,
         55711,
         68429,
         227245,
         53244,
         147287,
         170368,
         194602,
         237957,
         203226,
         147306,
         88302,
         76388,
         202768,
         131653,
         67451,
         269969,
         185354,
         134220
      ],
      "backdrop_path": "/lZMhj2gmp7EpEH5OmPilZ3QzuEl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Charles Serking",
               "gender": 2,
               "credit_id": "52fe47b5c3a368484e0d5617",
               "name": "Ben Gazzara",
               "profile_path": "/dbmfyjTC3PSBvHOjlAMI0I0eZ6T.jpg",
               "id": 856,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cass",
               "gender": 1,
               "credit_id": "52fe47b5c3a368484e0d561b",
               "name": "Ornella Muti",
               "profile_path": "/a6shpjgLMJdRhMRpLviH6poKxmI.jpg",
               "id": 27163,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Vera",
               "gender": 1,
               "credit_id": "52fe47b5c3a368484e0d561f",
               "name": "Susan Tyrrell",
               "profile_path": "/2cQnK1bJxp9PldCeA05kohavPs8.jpg",
               "id": 59369,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vicky",
               "gender": 0,
               "credit_id": "52fe47b5c3a368484e0d5623",
               "name": "Tanya Lopert",
               "profile_path": "/iiPpMs4vicwaaC8YhXtkpiXqTNv.jpg",
               "id": 20798,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Bar Patron (uncredited)",
               "gender": 2,
               "credit_id": "5a0772019251414bd2004016",
               "name": "Tobin Bell",
               "profile_path": "/vbu4iHKY46zJ6K8B5jGJxB1ffp4.jpg",
               "id": 2144,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b5c3a368484e0d5629",
               "name": "Marco Ferreri",
               "profile_path": "/ne613TRedYwJf44C6gopz1pKD8P.jpg",
               "id": 34264,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b5c3a368484e0d562f",
               "name": "Marco Ferreri",
               "profile_path": "/ne613TRedYwJf44C6gopz1pKD8P.jpg",
               "id": 34264,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b5c3a368484e0d5635",
               "name": "Charles Bukowski",
               "profile_path": "/nertEIcNeph2XwpiACSsAhaxwAJ.jpg",
               "id": 67562,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b5c3a368484e0d563b",
               "name": "Sergio Amidei",
               "profile_path": null,
               "id": 4413,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5ac2c33f0e0a260c14027182",
               "name": "Ruggero Mastroianni",
               "profile_path": null,
               "id": 32053,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ac2c34fc3a3682d3502740a",
               "name": "Tonino Delli Colli",
               "profile_path": "/eZiIxNxmEJPLWsGokFX98IcgdF2.jpg",
               "id": 2361,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.875096,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 69014,
      "vote_count": 14,
      "budget": 0,
      "overview": "Poet/lecturer Charles Serking awakens from his alcoholic haze long enough to take a bus back to L.A. and plunge into an orgy of drink and sexual depravity.",
      "similar": [
         4771,
         169917,
         11929,
         562,
         769,
         949,
         7345,
         281,
         1429,
         75780,
         627,
         281957,
         339967,
         392044,
         180863,
         171274,
         452507,
         346364,
         372343,
         157847
      ],
      "original_title": "Storie di ordinaria follia",
      "runtime": 101,
      "poster_path": "/2NyjC117qzHGK3YwLlDwqDn2wJB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "23 Giugno",
         "id": 6617,
         "origin_country": ""
      }],
      "release_date": "1981-09-11",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marco Ferreri"],
      "runtime": 101,
      "synopsis": "This is one of my favorite movies. It's from writer Charles Bukowski, and two similar roles were in Barfly starring Mickey Rourke and the newest movie, based on working, drinking and women, Factotum starring Matt Dillon. \"Too beautiful\" Serking said. \"Like an angel from heaven who flew too close to the ground.\" In Tales of Ordinary Madness, Ben Gazzara plays Charles Serking an alcoholic aspiring writer who meets a beautiful prostitute named Cass played by Ornella Muti. He is back in the world of women, and quickly takes her back to his place to meet his ex-wife, current landlord, Vicky. He realizes his inability to find hapiness taming, Cass, the self mutilating, most beautiful woman in town, he therefore continues his relationship enabling her to continue turning tricks, he ends up traveling towards rock bottom, in a pit of alcoholism and depression. \"Ever heard one mouth screaming? I have. My own.\" He picks up on two other women one,drama queen Vera, played by GREAT Susan Tyrrell, and another strange scene in the same housing complex with a widow played by Judith Drake. Charles does end up giving it a try with Cass though asking her to marry him, but fate leads him away from her once again. When he finally returns, he finds out she made good on an old promise.",
      "writers": [
         "Marco Ferreri",
         "Sergio Amidei"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086410/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4NDIwMDM4Nl5BMl5BanBnXkFtZTcwODcwMzA0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Gazzara, Ornella Muti, Susan Tyrrell | See full cast and crew »"],
      "reviews": [
         "Only very rarely are two artists as in sync as Charles Bukowski and Marco Ferreri. Both men devoted their careers to exploring the beauty and bleakness of society's underbelly and the disillusioned souls who call it home. It should come as no surprise then that Ferreri's adaptation of Bukowski's \"Erections, Ejaculation, Exhibitions, and General Tales of Ordinary Madness\" is every bit as unflinching and honest as its source material. Tales Of Ordinary Madness begins with Charles (played by Ben Gazzara) reading a poem to a group of disinterested students. After stumbling off stage in a drunken stupor, Charles meets a 12 year old girl and promptly fondles her breasts. This is the first in a long line of disturbing sexual encounters that take place during the film. Other examples include Charles' brief obsession with Vera, a woman who asks to be beaten with a belt and claims to \"love being raped\". Charles also sleeps with Vera's obese next door neighbour and in one of the film's most confronting scenes, pushes his head between the woman's legs in a literal attempt to return to the womb. The film reaches a turning point when Charles meets Cass (Ornella Muti), a prostitute as self-destructive as she is beautiful, and slowly begins to fall in love with her. Ferreri has crafted a beautifully poetic film about desperate and damaged people. Tales Of Ordinary Madness is never easy to watch but it is always enthralling. Much of the credit for this goes to the Bukowski's riveting source material and Ferreri's obvious affection for it. Marco Ferreri's distinctive use of unusual camera angles and surreal imagery are mostly missing from this film. In fact, Ferreri's direction is expertly restrained in an obvious attempt to recreate Bukowski's minimalist prose cinematically. This sense of restraint is shared by Ferreri's impressive cast. Ben Gazzara is striking as Charles. His brave performance captures both the torment and underlying humanity that shapes Charles' journey. Ornella Muti had some of her most memorable roles in Ferreri films and she gives another impressive performance here as Cass. The scene where she puts a safety pin through her cheek is simply unforgettable. My only qualm with her casting is that she is perhaps too beautiful to be realistic as a low class prostitute. Susan Tyrrell also shines as trashy Vera. This was just one of a string of eccentric roles that made Susan a cult favourite in the early 80s. Tales Of Ordinary Madness has been made with skill, care and deep empathy for its characters. This film does not quite match the brilliance of Ferreri's \"La Derniere Femme\" but it comes very close. This is highly recommended to both Bukowski and Ferreri fans.",
         "Spectacularly sleazy, beautiful, boisterous and sexy, this is the real Bukowski deal, a booze-fueled erotic odyssey by the adventurous Ferreri with the perfectly cast Ben Gazzara as Charles Serking (Bukowski). Ornella Muti, as Serking's sexual muse, is Venus incarnate and turns in a powerhouse performance as Cass, an emotionally damaged whore with a penchant for pain. The scenes of Gazzara swaggering in and out of LA's fleapit bars, apartments and hotel rooms convey a filthy, delirious ambiance that is vividly captured by Tonino Delli Colli's superb cinematography and Dante Ferretti's exquisitely oily production design. This is such an amazing looking film with a thick, steamy, anything-goes atmosphere of lust-ridden anarchy. Much grittier than the accomplished \"Barfly\" and more watchable than \"Love Is A Dog From Hell\", the entire affair has an emotional, raw resonance that slavishly captures the Bukowski sensibility and remains consistently perverse in its singular vision of a man enslaved by alcoholic and sexual gluttony. Phillipe Sarde's score is moody and rich, as is Gazzara's breathy voice-over. A masterpiece.",
         "Just about everybody seems to hate 'Tales Of Ordinary Madness' even Charles Bukowski himself. I can't see why. For me it's an extraordinary movie just as good, if not better than, 'Barfly'. Director Marco Ferreri also made the unforgettable 'Blow-Out' ('La Grande Bouffe') another overlooked gem. Both movies are disturbing, poetic and very beautiful. Cassavetes fave Ben Gazzara is the perfect choice to play Bukowski substitute Charles Serking. He gives an utterly brilliant performance, his best along with 'The Killing Of A Chinese Bookie', another love-it-or-hate-it movie. Ornella Muti plays Cass, a self-destructive prostitute he falls in love with. Now Muti is just about the most beautiful actress I've ever seen in my life so I can see why someone would have a problem with her being cast in such a role. It may be unrealistic but she's convincing in a difficult part, and she's just mesmerizing to look at! An added bonus is cult fave Susan Tyrrell ('Fat City', 'Bad', 'Flesh & Blood', 'Cry-Baby',etc.) in the supporting cast playing a typically bent character for her. 'Tales Of Madness' is slow and meandering and anecdotal so people who prefer straightforward, simplistic Hollywood movies will hate it. But if you enjoy Bukowski's work or Hubert Selby Jr's check this movie out as I'm sure you'll be impressed.",
         "If you are a conservative or weak of stomach, just forget this film. But if you are a true fan of Charles Bukowski, forget \"Barfly\" and attend this film. A deeply trip to human nature, you will find a Los Angeles that Hollywood does not show. Ugly, fat, drunks, dirty , insane people and other characters that only a European director as Marco Ferreri would have courage to bring. Ben Gazzara does a very good drunk poet (he would be better if he had a bigger belly) and Ornella Muti is divine as usual. Forget all the idiots who felt bothered with the reality shown by the film and enjoy.",
         "The movie is based on the novel of Charles Bukowski... and the film contains its spirit. \"Storie di ordinaria follia\" is deliberately sensual and \"dirt\", the main carachter (Ben Gazzara) takes directly inspiration from Bukowski himself -a drunk writer, who chooses to live among poors and neglected people, a man who lives sex like a philosophy, in order to taste the primal feeling of life...-. The picture is worth watching -because Gazzara is very good and Ornella Muti as well, she's also so sweet and gorgeous...-. The film is interesting because it tries to capture Bukowski ideals and his pessimistic ways to see the world. I think nevertheless that it is very difficult to film \"materials\" from a writer like him, because he's so excessive and outrageous... It's particularly difficult to translate his thoughts in pictures. The film is quite boring, the action is slow. Sometimes we have the feeling that there's no story. Marco Ferreri did doubtless better films (see \"La grande bouffe\" and \"Don't touch the white woman\").",
         "Marco Ferreri is a challenging film artist. His films are powered by an insistent, intense focus on the passions of flesh - the human response to, need for, and meditation on our bodily bounds and desires. In his other films he's explored the excesses which bind our mortality from hunger to sex to suicide. Here he zeroes in on the texts of the poet Charles Bukowski, whose poetic life of booze and sexual conquest has him teetering on the brink of annihilation but remaining firmly in the realm of fierce, soulful expression. The main character in Tales of Ordinary Madness is a poet whose relationships with women range from the infantile to the sadomasochistic while he continues to binge on a diet of alcohol. What he doesn't expect is to fall in love. Being a poetic film (that is based around symbols and evocative imagery rather than plot) this is a beautiful, estranged experience. Its a fascinating glimpse of America from the outside. Vividly powered by Ben Gazzara's performance as the outsider poet in the shadows of society, this is a film to be explored with a roving eye. Its a film where the sex scenes are not choreographed and sensual but brutal and unflinching in their approach to the passions of flesh. Its a rough film but one which takes us into the dark corners of love.",
         "Tales of Ordinary Madness is the first film to be based on a book by Charles Bukowski and focuses on the story of one man as he descends into a life of loose women and alcohol. I have not read the book that this is based on so I don't know how it compares to the source material; but as a movie, it's very good and I was surprised to find that the writer himself did not approve of the film. The plot is fairly straight forward in the way that it focuses on just a single character; but the film changes often and this odyssey is a long way from a commercial movie and thus is not for all tastes. Our central character is Charles Serking; a writer who also happens to be an alcoholic. He goes out looking for booze and women and finds both inside a seedy Hollywood. The story really starts when Charles meets a prostitute with a penchant for cutting herself named Cass. He brings her home to meet his ex-wife and have sex; but it's not long before he begins on a downward spiral of depression and turns to the drink for comfort. This film presents a completely downtrodden view of the world and director Marco Ferreri completely succeeds in creating a dirty and sleazy atmosphere for everything to take place in. There's plenty of full frontal nudity and sex in the film and it's all portrayed as being very dirty and thus is not erotic at all. The style of the film is excellently matched by a stunning performance from Ben Gazzara in the lead role. The actor fits into this role amazingly well and always convinces as the central character. The film doesn't hold back when it comes to showing things such as nudity either, although it's all done in such a 'matter of fact' way that sometimes the film is not even shocking. The female lead is taken by the stunning Ornella Muti, who is a real beauty and convinces alongside Gazzara. The film feels too smart to not have a point, and while the substance comes from the central character and his plight; there's not really a defining point to the film. Overall, Tales of Ordinary Madness is a film that is well worth seeking for the cult fanatic and I can recommend it.",
         "Neither Bukowski nor Marco Ferreri's film will shock the audience any more. This is a grim tale, but told in an exciting way with the enigmatic Gazarra and the superb Ornella Muti in front of the camera, backed by legendary Italians, like production designer Dante Ferretti (who worked, among others, with Fellini and Pasolini, and recently bedazzled movie-goers with 'Titus') and D.O.P. Tonino Delli Colli ('The Good, the Bad and The Ugly'; 'Histoires Extraordinaires') A great film, some years ahead of its time, so now truly not to be missed.",
         "After the lecture of a poem to a group of bored students, the alcoholic and sex addicted poet Charles Serking (Ben Gazzara) meets a young girl in the backstage and caresses her breasts. Then he travels to Los Angeles, and has kinky sex with bizarre women. When Charles meets the gorgeous self-destructive prostitute Cass (Ornella Muti) in a bar, he finds his soul mate and falls in love for her. Marco Ferreri is one of the weirdest directors that I know, and this \"Storie di Ordinaria Follia\" gives a perfect theme for him to make a good movie about of two self-destructive souls. I do not know the work of the underground poet Charles Bukowski, and actually I just know a little about his biography based on the movie \"Factotum\" that I hated. But in \"Storie di Ordinaria Follia\", Ornella Muti is on the top of her awesome beauty and her performance in the role of a tormented character is impressive. Ben Gazzara has also a stunning performance in the role of Charles Serking, a man near to madness that survives drinking booze and having dirty sex. However, this movie is only recommended for very specific audiences. My vote is seven. Title (Brazil): \"Crônicas de um Amor Louco\" (\"Chronicles of a Crazy Love\")",
         "Charles Bukowski is one of the most important men to have ever lived. His work is of the ages and I would put thousands of his passages up against the work of all those writers generally considered great. What all that has to do with this movie is not very much. As a film it falls short of the mark as it wanders like a drunk through the streets trying to give us a snapshot of sorts, a month in the life of the great Charles Bukowski. As for reality, I am sure that the Buk was pretty much drunk all the time and wasted lots of time with dirty women but that was his business. I am just glad that he put in some heavy time at the typewriter. I am also grateful for this film as it provides another document, a bit of proof that Charles Bukowski was real. Ben Gazarra does a nice job painting this particular picture of Chuck but it is not a performance that would alone make this a rental for the upcoming acting students. For a more realistic approach check our Mickey Rourke in Barfly. There is a very beautiful Italian actress (Ornella Muti) in this picture who plays the main love interest. She is worth the price of rental or even a bloated DVD purchase. I doubt that Bukowski ever had a girl this beautiful but that's the movies for ya."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "23 Giugno",
         "Ginis Films",
         "Alpes International Paris"
      ],
      "summaries": [
         "After a lecture where a poem is read out to a group of bored students, the alcoholic and sex addicted poet, Charles Serking, meets a young girl backstage. Then he travels to Los Angeles, and has sex with bizarre women. When Charles meets the gorgeous self-destructive prostitute Cass in a bar, he finds his soul mate and falls in love for her.",
         "Poet/lecturer Charles Serking awakens from his alcoholic haze long enough to take a bus back to L.A. and plunge into an orgy of drink and sexual depravity."
      ],
      "budget": 0
   },
   "movielensId": 5861,
   "movielens": {
      "languages": [""],
      "releaseDate": "1981-09-11",
      "dvdReleaseDate": "1999-02-23",
      "directors": ["Marco Ferreri"],
      "runtime": 101,
      "movieId": 5861,
      "title": "Tales of Ordinary Madness",
      "mpaa": "",
      "actors": [
         "Ben Gazzara",
         "Ornella Muti",
         "Susan Tyrrell",
         "Tanya Lopert",
         "Tobin Bell"
      ],
      "imdbMovieId": "0086410",
      "originalTitle": "Storie di ordinaria follia",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "B_ABOQv1i2Q",
         "XQfokG5vtKU"
      ],
      "plotSummary": "Poet/lecturer Charles Serking awakens from his alcoholic haze long enough to take a bus back to L.A. and plunge into an orgy of drink and sexual depravity.",
      "tmdbMovieId": 69014,
      "avgRating": 3.14516,
      "releaseYear": "1981",
      "numRatings": 31,
      "posterPath": "/2NyjC117qzHGK3YwLlDwqDn2wJB.jpg"
   }
}