{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "countryside",
            "id": 548
         },
         {
            "name": "adolescence",
            "id": 704
         },
         {
            "name": "shepherd",
            "id": 1450
         },
         {
            "name": "meditation",
            "id": 1532
         },
         {
            "name": "revolution",
            "id": 2020
         },
         {
            "name": "living together",
            "id": 3676
         },
         {
            "name": "religion and supernatural",
            "id": 3684
         },
         {
            "name": "cultural revolution",
            "id": 4004
         },
         {
            "name": "resettlement",
            "id": 4196
         },
         {
            "name": "mongolia",
            "id": 4719
         },
         {
            "name": "miner",
            "id": 4781
         },
         {
            "name": "subjection",
            "id": 5103
         },
         {
            "name": "coercion",
            "id": 6217
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "vagabond",
            "id": 11171
         },
         {
            "name": "revolutionary",
            "id": 18263
         },
         {
            "name": "nature",
            "id": 18330
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "plague",
            "id": 188959
         }
      ],
      "imdb_id": "tt0475241",
      "video": false,
      "title": "Khadak",
      "recommendations": [19581],
      "backdrop_path": "/2QEU7DIByYmG6txdNdjgjWRUi9F.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 16,
               "character": "Bagi",
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809ddb1",
               "name": "Batzul Khayankhyarvaa",
               "profile_path": null,
               "id": 54262,
               "order": 0
            },
            {
               "cast_id": 17,
               "character": "Zolzaya",
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809ddb5",
               "name": "Tsetsegee Byamba",
               "profile_path": null,
               "id": 54263,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Großvater",
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809ddb9",
               "name": "Banzar Damchaa",
               "profile_path": null,
               "id": 54264,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Schamanin",
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809ddbd",
               "name": "Tserendarizav Dashnyam",
               "profile_path": null,
               "id": 54265,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Mutter",
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809ddc1",
               "name": "Dugarsuren Dagvadorj",
               "profile_path": null,
               "id": 54266,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Nara",
               "gender": 0,
               "credit_id": "5382fa45c3a368059b008155",
               "name": "Ehkhtaivan Uuriintuya",
               "profile_path": null,
               "id": 1324399,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "le psychiatre",
               "gender": 0,
               "credit_id": "5382fa53c3a3680598008391",
               "name": "Namsrai Otgontogos",
               "profile_path": null,
               "id": 1324400,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "l'infirmière",
               "gender": 0,
               "credit_id": "5382fa60c3a368059e0083aa",
               "name": "Gereisukh Otgon",
               "profile_path": null,
               "id": 1324401,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd5f",
               "name": "Peter Brosens",
               "profile_path": null,
               "id": 53995,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd65",
               "name": "Jessica Hope Woodworth",
               "profile_path": null,
               "id": 53996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd6b",
               "name": "Heino Deckert",
               "profile_path": null,
               "id": 54253,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd71",
               "name": "Peter Brosens",
               "profile_path": null,
               "id": 53995,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd77",
               "name": "Joost de Vries",
               "profile_path": null,
               "id": 54255,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd7d",
               "name": "Leontine Petit",
               "profile_path": null,
               "id": 54256,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd83",
               "name": "Jeremy Burdek",
               "profile_path": null,
               "id": 54206,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4493c3a36847f809dd89",
               "name": "Nadia Khamlichi",
               "profile_path": "/ngeXDXYulln8G5VQzhm1RvEiGi7.jpg",
               "id": 54205,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dd8f",
               "name": "Adrian Politowski",
               "profile_path": "/wi8AgSW9ucsRNLds835V4jw4HkU.jpg",
               "id": 54204,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd95",
               "name": "Pepijn Aben",
               "profile_path": null,
               "id": 54257,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dd9b",
               "name": "Rik Meier",
               "profile_path": null,
               "id": 54258,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dda1",
               "name": "Rimvydas Leipus",
               "profile_path": null,
               "id": 54259,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dda7",
               "name": "Nico Leunen",
               "profile_path": null,
               "id": 54260,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809ddad",
               "name": "Michel Schöpping",
               "profile_path": null,
               "id": 54261,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809ddc7",
               "name": "Heino Deckert",
               "profile_path": null,
               "id": 54253,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56aa98a49251410e8f0002ef",
               "name": "Peter Brosens",
               "profile_path": null,
               "id": 53995,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56aa98b4c3a3681c31000434",
               "name": "Jessica Hope Woodworth",
               "profile_path": null,
               "id": 53996,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.665855,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         }
      ],
      "id": 8093,
      "vote_count": 5,
      "budget": 0,
      "overview": "Set in the frozen steppes of Mongolia, a young nomad confronted with his destiny after animals fall victim to a plague which threatens to eradicate nomadism.",
      "similar": [
         746,
         24684,
         284303,
         12689,
         371645,
         5951,
         13342,
         7341,
         65496,
         20178,
         19344,
         9701,
         140870,
         35052,
         438634,
         261037,
         52850,
         436,
         481,
         24548
      ],
      "original_title": "Khadak",
      "runtime": 104,
      "poster_path": "/wqk1cLWWmE4Mazvge6TG3M4uy2m.jpg",
      "spoken_languages": [{
         "name": "",
         "iso_639_1": "mn"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MA.JA.DE Fiction",
            "id": 2344,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinepartners Belgium II",
            "id": 2346,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bo Films",
            "id": 2362,
            "origin_country": ""
         }
      ],
      "release_date": "2006-08-31",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.khadak.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": [
         "Peter Brosens",
         "Jessica Woodworth"
      ],
      "runtime": 104,
      "synopsis": "The movie begins with a young woman, Zolzaya (Tsetsegee Byamba), staring into the camera, counting to twelve. She repeats the number twelve three times and tears come to her eyes. Bagi (Batzul Khayankhyarvaa) is shown listening as a woman tells him his personal life story. She says that before he was born, every citizen received fresh apples weekly, regardless of the weather. Pilots would fly by each village and drop the apples. She tells him that was the golden principle in those days. One young pilot charged with delivering both apples and mail to the communities was Bagi's father. One of the postal workers was Bagi's mother. Bagi's father's plane crashed. The woman tells Bagi that his father never should have been flying planes, that his father had a certain destiny which he denied. The scene becomes a gray horse, some sheep, and a lone tree with a blue ribbon tied to it. The woman tells Bagi that he is just like his father, that his ancestors are dreaming of him, waiting and calling for him. Fish are shown swimming below the ice on a small lake. The scene changes to the inside a yurt. There are three men, including Bagi's grandfather (Banzar Damchaa), his mother (Dugarsuren Dagvadorj) and another older woman. The men are exchanging small flasks with each other, apparently just sniffing them before handing them back. Bagi is outside on his horse, herding sheep. The yurt, corral, barn and tractor are all in the distance. Bagi is looking hard for a single sheep that has gone missing. There are dozens of sheep in the flock. He tells his grandfather he wants to go look for the missing animal. Grandfather tells him that if its not too far, to go ahead. Bagi's mother looks worried. She goes out and calls after Bagi, but by then hes too far away. Bagi finds the lone sheep, lying motionless. He lifts it into his arms, and it bleats, still alive. Bagi suddenly has a vision of his family's yurt burning. He experiences a seizure and goes unconscious. His pony lies down beside him. In the next scene, Bagi is in the yurt, with grandfather prying his teeth apart so his mother can pour some broth down his throat. Grandfather goes to get a shamaness (Tserendarizav Dashnyam), who arrives and tells the mother to get away from Bagi. The shamaness envisions Bagi outside lying unconscious on the snow, near a small grove of trees. Back at the yurt, she begins playing a tune on a harpsichord. Outside, Bagi is seen to sit up. At the yurt, the shamaness whips Bagi's torso with a whip made of straw. Outside, we see her yelling. Back at the yurt, she starts smacking her lips. Outside, Bagi rises and begins running through the trees. Out there, the shamaness utters loud animal like screams. Back in the yurt, she's shown wearing a mask and beating on a drum. Outside, as Bagi runs around aimlessly among the trees, the shamaness speaks: \"Holy Tree, mother lost soul of this boy, from the distant steppes, come back here quickly, Come here, listen to the wind! Listen to the wind!\" At the yurt, the shamaness collapses into Grandfather's arms, having something of a seizure herself. Bagi's eyes then pop open and he gasps. The shamaness recovers, and while drinking some broth, tells grandfather that they were able to retrieve Bagi this time, but that he has something within him from his ancestors and he will absolutely have to come see her. Grandfather acknowledges and says he understands. Bagi is shown sitting alone out by the lone tree with its ribbon. The sheep are clustered together. Then we see grandfather and Bagi sitting under the lone tree. Grandfather tells Bagi that he should meet with the shamaness, that she's terribly worried about him. Bagi tells grandfather that he'll be fine, with or without the shamaness. Grandpa says that is not the case, that Bagi can't do anything without her help, that it's a universal law and he will die if he ignores it. Bagi asks Grandfather if his father died because of that universal law. Grandfather believes that he did. He thinks the sprits of Bagi's father's ancestors took him away for eternity, because he ignored their call. Bagi wants to know why grandfather didn't say anything at the time about that. Grandfather says it was forbidden to think or speak about such things back then. If you did, you would die. Bagi seems angry about it all. Bagi is seen putting new hay on top of the corral roof. Mother is gathering some wood for the stove. Bagi hears something and looks to the horizon to see a vehicle approaching. It's an army jeep, with three soldiers wearing masks. One soldier tells mother that there's an extremely dangerous plague and they must leave that place immediately. He confiscates their animals. Mother asks about the plague. The soldier says they don't know much about it, but it's dangerous for people too. He hands her some masks. The officer tells mother to hurry. Mother asks where they are going. He tells her not to worry, that they are going where there is a roof and a job. He tells them that the trucks are on the way to take them away. Grandfather tells the officer that his family is not going anywhere, that they and their animals are fine. The officer tells him he has no choice and turns and leaves. Bagi is upset and rides off on his pony, going to the lone tree. He ties the horse to the tree, then places a blue ribbon around his neck, saying \"under the sky, upon the earth, only the wind can ride you now. From now on, nobody can ever harm you.\" He hugs the pony and cries, then runs back to the yurt. Mother is busy packing up the family's belongings. Grandfather just sits inside the yurt. The army trucks arrive and men dressed in hazardous material gear scurry around. One man asks why their yurt is still standing. Mother responds that they haven't had time to take it down. He directs her to gather their animals, warning that if any animals are left behind, they will be shot. A soldier starts up the family's tractor, puts it in gear and jumps out, leaving it to travel unattended across the steppe. The sheep and the family's second horse are gathered up. The yurt is emptied of all contents and is then disassembled and loaded onto trucks. Grandpa and a friend are sitting near on chairs near the small wood stove, the only things that remain of the disassembled yurt, passing their little closed flasks back and forth. Grandpa wipes away a tear. The other man allows himself to be escorted to a truck by a soldier, but grandpa remains seated. Two soldiers come and pick up him and his chair and carry him to the truck. There are about 15 people sitting in the back of the army truck as it drives away. Looking back, Bagi's pony is seen standing in the middle of the round impression in the ground where the yurt had been. The pony is eating something. Only Bagi's mother chooses to wear one of the masks provided. The trucks drive past the shamaness, who is standing off to the side of the road under a telephone or small power line, tossing stones onto a pile of rocks that is topped by a strange configuration of poles and blue and green ribbons. She turns her back to the trucks as they pass, but looks at them as they move away, seemingly engaging in some sort of telepathy with Bagi, and he experiences another epileptic fit. The pony is shown to be lying on its side inside the circle where the yurt had been, apparently dying, and the tractor is shown passing in the opposite direction of another tractor that has also been set adrift. The next scene shows the back of a hard hat being worn by an operator of a large coal mine shovel. The operator is sitting in the control booth for the shovel and swinging the boom around. We see the large open pit mine come into view in the distance. Bagi is dressed in coat, hat and driving goggles, sitting amidst piles of coal rock with steam rising from them. Next to him is a motorcycle and sidecar. He looks up to see a large coal truck, with about 10 men standing nearby, looking out into the distance. They are watching as a large explosive detonates and breaks up a seam of coal deposits. Bagi drives his motorcycle to a dilapidated looking set of multi-story barracks or apartment type buildings, where he and his family live. He pauses to look up and sees an old woman standing on a balcony, gazing off into the distance. Bagi's grandfather is sitting in their apartment, peeling potatoes, the main source of food for the people now. The old man is pleased to see Bagi and asks him how work is. Bagi says its ok. Bagi is not pleased to see that lunch will be potatoes again. He puts a few bottles of the boiled potatoes in a leather bag. He then sits on a bench and observes that grandpa hasn't made tea yet. Grandpa morosely observes that he's been struggling with the potatoes. Bagi offers to take grandpa out on his motorcycle later. Grandpa smiles and says that would be fine. Bagi leaves the apartment, and as he's riding away from the building, the old lady on the balcony stops her singing/chanting, and watches him go. Grandpa continues silently peeling potatoes. Bagi stops near the edge of the open mine pit and a large scoop bucket appears, rising up and over the lip, then setting down gently, not far from where Bagi sits on his motorcycle. Bagi's mother is shown to be at the controls of the \"claw,\" and she smiles slightly before she manipulates the large scoop back into the mine. Bagi takes the bottled potatoes inside to his mother and another man, and joins them as they eat lunch. Bagi's mother tells him that shes working that night and he should tell grandfather. Bagi tells her he's got mail for the railway security unit to deliver, and he promised to take grandfather out for some fresh air as well. She thinks that will make grandfather happy. As Bagi delivers the mail to the railway security unit, he passes by a man and two women standing by a small table piled with bibles and green apples. One of the women is reading from one of the books: \"Seven golden vials full of the wrath of God, who liveth for ever and ever, and the temple was filled with smoke from the Glory of God, and from the power, and not man was able to enter into the temple, till the seven plagues of the seven angles were fulfilled.\" The other woman holds out an apple towards Bagi, but he just stares and walks on past. Back home, Bagi pauses to look at a group of people standing in a small circle at the base of one of the apartment buildings. Grandpa is standing at a window, looking down from his apartment. A small ambulance pulls up and two attendants pick up a body and put it in the ambulance. It's the old woman he'd seen earlier standing on a balcony. In the apartment, grandpa says to Bagi, \"How poor we are at defending ourselves. The spirit of the place where we were born, and of the water in which we were bathed, and even the stones of the riverbed, are dreaming of us. Even the souls of our ancestors are dreaming of us.\" Bagi is very upset as he rides his motorcycle out to the coal mine. He crashes the bike next to some mounds of coal rock, scattering mail, but he's not hurt. However, he breaks down crying and wailing loudly. A railroad security official who is monitoring the security cameras sees a woman running near some of the coal cars and assume its a thief, but when another official goes out to check, she's disappeared. It seems that Bagi sees this girl in his thoughts. In any event, he gets up from where he's been crying and runs towards the now moving coal train and jumps onto one of the cars, then up onto the top of the coal piled inside. He immediately starts digging into the piled coal, as though he knows there's something buried under there. He listens, then moves to another spot and removes some of the coal until he reveals the face of the young woman Zolzaya, sputtering and coughing. Somehow she'd gotten herself buried in there. He digs the rest of her out and they sit on top of the coal, riding the train to wherever it's going. Bagi and Zolzaya are riding in the very last coal car of the train. Zolzaya starts filling a burlap bag with pieces of the coal. She tosses a bag to Bagi and he starts to fill it. When the train finally reaches it's destination, a large power generating station, Zolzaya and Bagi find two army officers, standing next to a jeep, waiting for them. The officers take them what appears to be another large residential compound, although this one doesn't appear to be as dilapidated, and turn them over to some other officers who are supervising a large work party of other prisoners. The prisoners are all tasked with chipping ice off the pavement. Another woman prisoner approaches Zolzaya and it's obvious they know each other. The woman tells Zolzaya that the authorities broke up their concert and now they have to do one month's labor. Zolzaya tells the other woman that Bagi saved her life. Inside the building where the prisoners are housed, there's about a dozen young people sitting around a large table, where they've been eating. Zolzaya is standing on top of the middle of the table, and she's counting out loud: \"One, Brother; Two, River; Three, Dawn; Four, Water; Five, Mother; Six, Me; Seven, Potato; Eight, Darkness; Nine, Death; Ten, Wrong; Eleven, Man.\" When she gets to twelve, she repeats it twice, then looks expectantly at Bagi. He says, \"Sky\"; Zolzoya continues counting: \"Thirteen,\" and everyone else in the room says 'River! Death! Potato! Water! Man! Wrong!'; \"Fourteen,\" and again everyone chants, 'Brother! River! Water! Dawn! Potato! Man! Brother!'; \"Fifteen,\" and the chanting continues. A guard comes in, tells Zolzaya to get off the table and tells everyone to be quiet and go to bed. As they lie down, Zolzaya asks Bagi how he knew that she was under the coal in the train car. He tells her that he felt it, that he heard her. She asks him who he lives with. He tells her he lives with his mother and grandfather. She tells him that she has a big brother (Bat-Erdene Damdinsuren), but that the rest isn't worth mentioning. She tells Bagi that her brother will get them out of this trouble soon, that he always does. She reaches out and touches his head lightly and says, \"Sky.\" During the prison work detail's lunch break, one of the male prisoners asks Zolzaya when her brother will arrive with the meat. She says \"soon.\" She tells Bagi that her brother is a black market wizard. When Bagi asks where he gets the meat, the male prisoner tells him that the animals were never sick. While riding in the back of the open bed transport truck with the other prisoners, Bagi envisions men tossing dead sheep on a pile that is burning. Suddenly, he's face-to-face with the shamaness. In the truck, he grabs his head and experiences another seizure. His new friends comfort him. He's taken to a clinic where he is hooked up to some electrodes for testing. He then meets with a lady psychiatrist (Otgontogos Namsrai) who tells him he's likely got epilepsy, something no shaman can treat, but the doctors can. Bagi just wants to be let go. The psychiatrist tells him there are many other herders being treated for stress caused by being relocated. She tells him she will prescribe a medicine. Zolzaya's brother shows up with several medium-sized fresh animal carcasses in the trunk of his car. He tells the guard he's meeting with that he will exchange the meat for the freedom of his sister and all of her friends. The guard at first says no, but after smoking a cigarette offered by the brother, he finally agrees. At the hospital, Bagi either envisions or senses the shamaness standing outside some old apartment buildings. There are numerous bottles standing upright on the ground in front of her. She is picking them up one at a time and throwing them down hard on the ground. She pauses, until she's sure Bagi is tuned in, then shouts, \"Listen!\" several times as she resumes smashing bottles. Bagi's attention is drawn to the water pipes of the room he is in. He listens carefully and can hear to sound of neighing horses and bleating sheep. He realizes the animals are alive, and he smiles. He runs out into the yard and goes up to various men and women, telling them that they must leave, that their animals are alive and he knows exactly where they are. The people ignore him and one man even shoves him to the ground. Bagi is extremely upset and is shouting. A couple of orderlies come and take him away. The shamaness is shown quietly observing it all, and we hear a female voice say, \"One.\" Bagi is shown lying on a cot and we hear a voice say, \"Two.\" The scene switches back to a cluster of trees in the snow. Bagi then sits up on the cot, now clothed in his motorcycle outfit, and a voice says, \"Three.\" The scene switches to just outside one of the barracks/apartment buildings, which is even more decrepit than the others, and we hear, \"Four.\" Bagi is shown exiting the building and approaching a covered manhole. We hear, \"Five.\" He veers off and approaches another manhole, this one with the lid off. Bagi pauses, then jumps in and disappears from view, as we hear, \"Six.\" A worker approaches the manhole and empties a wheelbarrow around the base of the manhole, then he and another man place the lid on the manhole and we hear, \"Seven.\" As the scene switches again to the lone tree out on the steppe, we hear, \"Eight.\" The camera slowly rotates so that the tree goes upside down, and we hear, \"Nine,\" then \"Ten,\" then \"Eleven.\" The face of the shamaness appears and she says, \"Twelve.\" In the vision, Bagi finds himself back inside his family's yurt, fully intact and furnished as it used to be. He goes outside to find the yurt is in close juxtaposition to the lone tree, and not far from the abandoned apartment buildings. He runs back into the yurt and sits down, apparently to think. When he goes back outside, he sees the shamaness standing on top of the nearest apartment building. He asks her, \"where am I?\" She replies, \"you must not ask where, but when. This is the future, a possible future.\" Her body suddenly appears standing close to him and she says, \"there was a time when man took too much. The desert moved, extinguishing life. The desert will always win.\" Bagi says to the shamaness, \"the animals are alive and I must go find them now.\" She says, \"'now' has no meaning here.\" He responds, \"then 'here' has no meaning either.\" She replies, \"you're right. You may get lost, but do not be afraid,\" and she hands him a round flat shiny object that has a piece of green and blue ribbon attached to it. She tells him, \"your ancestors are dreaming of you, and the sky is watching you.\" Bagi runs past the abandoned and ruined apartment buildings and, as he jumps into a pit or opening of some sort, the scene changes to one where he's being cradled in the arms of someone. He's having another seizure. He sees himself lying naked on his back, his head covered by water, then we see him continuing to run through the ruins, dressed in his motorcycle outfit. He seems to be chasing himself, as we see a duplicate of him running ahead. Under the water, Bagi's eyes pop open and he seems to be struggling and shaking his head, as though saying \"no.\" The scene at the ruins continues, as he runs harder and harder, but gets nowhere. Then we see Bagi sitting quietly, looking at Zolzaya, who's dressed like a princess, with strings of pearls hanging from a band around her head. A group of people are sitting behind Zolzaya, holding various instruments. She steps aside and the others start playing. There are many other young people, all standing along a balcony, watching. Zolzaya then starts something akin to yodeling. The scene switches to a yurt out on the steppe, burning to the ground. Back at the concert, Zolzaya's female friend is holding a microphone and speaking forcefully, \"I left my body in a dark corner! Something is wrong here! A girl awaits the death of her mother! A father awaits the death of his son! A brother awaits the death of his brother! Something is wrong here! A poet awaits the death of his horse! A woman awaits the death of her soul! A child awaits the death of tomorrow! Something is wrong here! Something something is wrong here! A river awaits the death of its waters! A sky awaits the death of dawn! Something is wrong here!\" Bagi is suddenly standing behind Zolzaya, and he slowly moves his hands up, parallel along her arms and her head, but not actually touching her. The scene then switches to a row of small leafless trees, each with blue ribbons attached to their branches. Then we see Zolzaya, dressed in a leather jacket and skull cap, standing before a hard-sided yurt-type building. Her friends all appear, coming from behind her. We hear Bagi's voice: \"I felt it. I heard you.\" Someone sets a ragged medium-sized rock at Zolzaya's feet. She picks it up and puts it close to her nose and mouth, then turns to look at her friends before she begins walking. They all follow her. They walk up a hill, where there's one of those mounds of rocks with sticks and ribbons on top. Zolzaya lays her rock on the pile and picks up a broken piece of mirror. Her friends also pick up pieces of mirror and they walk on towards the power generating facility. There are twelve of them. At the generating station, they all use their mirrors to shine sunlight into the eyes of the soldiers, who are spaced out along a road and in front of a wall. The soldiers become frozen in place. Zolzaya then runs past the soldiers and comes upon a place where she finds hundreds of animal carcasses piled up and rotting. She pauses to look. Gabi holds up the round shiny object that the shamaness gave him, turning it towards the sun. Blue ribbons begin to drop out of the sky. Zolzaya sees the ribbons and runs to a nearby building, flings the doors open, and horses, cows and sheep are able to escape. Her friends all begin tying blue ribbons around the animals' necks. Zolzaya runs back to near that mound of rocks, sticks and ribbons. As she looks down on the community below, the animals are being herded up behind her. She runs down the hill and along a road, past an abandoned hotel, with army vehicles going past her the opposite direction. Soldiers and army vehicles can be seen going different directions. Citizens come out of their buildings and are all excited. Some of the soldiers seem to be half-heartedly trying to control them. Crowds of people encounter each other out in an open area, but they run past each other, resembling a kaleidoscope from above. Bagi and Zolzaya are briefly shown kissing each other with pressed lips. Zolzaya is then shown standing near a cluster of army trucks, as people run past. She looks up and sees Bagi on top of a building, looking down at her. She calls to him. Suddenly, Bagi is on the ground and Zolzaya has run up to the roof. Bagi turns and looks up that way. Zolzaya looks down. A soldier sees her and calls into his radio that \"something's wrong here.\" About 20 soldiers all turn and look up at her. Bagi is then back on the roof, approaching Zolzaya slowly from behind, bringing his hands up to her head and lightly touching her. She looks off into the distance as he backs away. On top of the opposite buildings, all the people of the community are lined up around the outside of the rooftops, looking back at Zolzaya. Zolzaya is then shown lying on her side in the hospital/clinic room with Bagi. He is cradling her head and in her hand is that bright object with ribbons that Bagi was given by the shamaness. The radiator and water pipes along the wall are all draped with blue ribbons. We hear, \"One, Two.\" We see the sky and hear, \"Three.\" We see Zolzaya standing at the lone tree, dressed in modern clothing, a man standing near a car waiting for her. She approaches and ties a blue ribbon around the tree and sobs. Grandfather walks by, leading a horse. She says hello, he says hello. We hear, \"One.\" Zolzaya walks to the car, some sheep come walking by and they pause to look towards the tree. Water begins streaming down the trunk of the tree. The movie ends.",
      "writers": [
         "Peter Brosens",
         "Jessica Woodworth"
      ],
      "originalLanguage": "Mongolian",
      "imdbLink": "http://www.imdb.com/title/tt0475241/",
      "coverLink": null,
      "actors": [
         "Batzul Khayankhyarvaa",
         "Tsetsegee Byamba",
         "Banzar Damchaa"
      ],
      "reviews": [
         "This is an excellent movie, well worth experiencing. Don't be fooled by its obscurity. This is not a low-budget nor protest flick. It has very high production values and is worthy of the best auteurs. It's just that its distribution didn't connect with the American marketing machine. The first time I saw it, I was bowled over by the gorgeous visuals, but couldn't follow the narrative, especially in the last half. I got the feeling this was normal, that there wasn't really any narrative except in the magico-realistic sense, that the movie was meant to be viewed impressionistic-ally. Then I absorbed just a bit about the history of Mongolia and Mongolian shamanism at home, and saw it again. The second time the narrative was clear throughout. The gorgeous visuals were still there, but now they weren't the only thing. One key was understanding that shamanism was heavily discouraged when Mongolia was a Soviet satellite for decades. Another was understanding just a bit about shamanism itself: that the giant blue sky is almost a personality; that poles and clefts and even trees can be entrances to the world below; that shamans are called by their first trance experience, which often manifests as an illness, and trained by the previous generation's shaman; that shamanistic trances and epileptic fits are similar; and most importantly that the highest calling of a shaman is to \"restore balance\" with nature for an entire people. More imagery made sense with the understanding that going under water meant death from this world (and perhaps birth into the world of nature). The parallel between a woman traumatized by the relocation to modernity and a peeled potato going under water in a basin became clear. I never entirely figured out the symbolism of the apples. Maybe they signify Soviet times, or maybe danger, or maybe a turn away from shamanism, or maybe materialism. And are potatoes distorted apples? I never entirely integrated the Christian symbolism. There are clear references to at least Christ, the last supper, the twelve disciples, and the cross. And I never entirely figured out the significance of counting. Although counting works as an adjunct of other symbolism, I suspect it has a meaning of its own. There are no love scenes in the Western sense (after all, it's far too cold to take off one's clothes). We get only one tentative kiss, a couple ghost embraces, a tiny bit of touching, and a few lines of dialog. Yet the effect is sensuous in the extreme. This is way more with way less. The feelings are intense, yet without skirting an NC-17 or R rating (the movie is actually unrated; it could be PG ...but probably won't appeal to 13 year olds). Yet all of this is secondary. What really stood out the second time was the importance of hyper-hearing ...abetted by the sound track. Suddenly the scene of the fishes under the ice made sense, as did hearing approaching trucks before they even appeared on the horizon. Ears are touched throughout, and some epileptic fits begin with auditory hallucinations. At one point a medical person comments the protagonist \"listens very well\". The motions of finding a person buried somewhere in a railroad car full of coal makes sense. The sound track is very complex. Often rather than just matching the current scene, it contains the first subtle segue to the next. At one point the sounds of water in pipes goes on for so long it can get tuned out. But the sound subtly changes ever so slowly; toward the end one can dimly pick out mixed into all the water sounds another sound, that of sheep bleating. The sound track is the key to and high point of this movie. It holds the story together. And it's excellent artistry. Yet the first time I completely missed it. Listen and you'll be richly rewarded.",
         "A true work of art. An emotional journey that captures the soul of Mongolian culture and tradition while posing important questions on the dilemma facing traditional Mongolian values by the destruction of Mongolians most precious treasure, their land, by international mining operations. Beautifully crafted scene's and soul shaking audio design tell much of the story that has been left unverbalized. The directors have done an amazing job of researching Mongolian culture, society, social changes, etc. and show a true appreciation for Mongolia's heritage. The directors use of a generally unexperienced cast, with the exception of a few of Mongolia's best, had astounding results. The actors who played the main characters Bagi and Zolzaya were flawless, especially considering they have never acted before. Reading the synopsis and interviews with the directors afterwards may help some not familiar with Mongolia to better understand some of the deeper meaning and symbolism embedded in this film. 10 out of 10!",
         "I'd like to share my positive impressions from this movie. I've just seen it on Sofia Film Festival and I find it truly amazing. It deals with some topics about life and humanity in totalitarian Soviet-dominated societies - in a way that is both just and powerful. Being a Bulgarian that have witnessed totalitarian rule's disregard for the human individual - I find this movie a powerful reminder of how vital yet fragile our relations to nature and traditions are. Acting is brilliant - especially the lead character. There is a well done balance of landscape, color and contrast that make this movie visually outstanding. What did put me off a bit - and made me reduce my vote to a 8/10 mark - were a couple of scenes at the end of the movie that, though meaningful and powerful, do brake the overall balanced and well-programmed dynamics of the whole movie - and i think that if they were cut out - it would only have improved and boosted this movie's basic messages to the viewer... I find this line in the synopsis \"animals fall victim to a plague which threatens to eradicate nomadism\" irrelevant, misleading and diminishing authors' main ideas... Overall - a great movie...",
         "I saw the film only yesterday, yet my impression at the end of it has not changed. It is certainly a film containing beautiful images of snow covered plains and wastelands in Mongolia. And in the beginning there is some promise of yet another quiet, elegiac tale of wide plains, nomads and their wisdom. But this quietist expectation soon is shattered, and the viewer, together with the film's protagonists, is thrown out of this sub-zero garden of Eden. What follows still remains beautiful and striking in its imagery, but annoyed me more and more because of the loosening up of the structure and ever more unexpected twists and turns, until, really, I reached the point where it got very hard to be bothered at all. Though I am not against experiments and boldness, this attempt at a poetic film of a conflict between tradition and modernity was lost on me, mainly because its makers apparently could not decide between impressionist documentary, expressionist story-telling and a superficial interest for the folklore of the supernatural.",
         "I saw a screener DVD of this, but would love to see it on the big screen. A heartbreaking story of the nomadic peoples of Mongolia being forced to abandon their homes due to a \"plague\" outbreak among animals. Despite their own herds being healthy, the family who is the focus of the beginning of the film are forcibly moved to a mining town, where their son Bagi, who has visions of his ancestors is forced to work for a pittance. Other nomads have been detained for offenses like playing music publicly. The only food available seems to be potatoes, but there appears to be meat available on the black market, and this feeds speculation that the clearances were not motivated by animal sickness after all. Bagi is arrested and while in the detention center meets a group of young activists who want to rebel against their unlawful imprisonment, and to free the animals they know are still alive. The song they perform is a high point of the film, and adds to an already excellent score and soundtrack. This story does not have an entirely happy ending, but there is some measure of hope and redemption here. The film's strength lies in its very simple visuals and minimal dialogue, which powerfully portray a way of life that is dying out due to government interference.",
         "The reviewer of this film from Holland provides an excellent perspective of this film as an experiment in art. As an anthropologist familiar with Mongolian nomadic culture and the historical background of the horrible collectivizing results of the Maoist government of the PRC on the population of inner Mongolia where thousands died due to the heavy handed and incompetent Maoist policies, I can certainly relate to the subtext of the story of Khadak. As a film, the organization of the storyline leaves much to be desired and does have an amateurish feel to it. However, the portrait of the Mongol people in this film against the bleak background of the steppes where they've lived for centuries and the shoddy, bleak living complex and mining facility to where they've been relocated, is quite striking. The faces of the actors in long and short still shots adds to this effect. Personally, I find the Mongols to be a strikingly beautiful people with a unique history ranging from great conquest to severe abuse under both Chinese and Soviet hegemony. In this context, I find this little film to be quite good in spite of its shortcomings.",
         "This film is not meant for the audience that seeks light entertainment and action. It's a film of extreme visual beauty. Its aesthetics sometimes resemble one of Angelopoulos, with its long shots of great complexity. For those unfamiliar with the culture of Mongolia, this can be a great and refreshing experience. Main actors, who had no professional experience before this film, are so natural in their roles. Movies are about making people think and not lecturing them. This one is all about that: making you think. About the past, tradition, change of generations and what future is yet to bring. I highly recommend this film. It's a striking piece of art and a rewarding experience.",
         "I have just seen this film, and my opinion of it is mixed. On the one hand, the film gives a detailed and intimate view of Mongolian life, especially in the first part; moreover, there is a strong political message behind it, which leads to some disturbing and powerful images (nothing too shocking). On the other hand, everything is filmed in such a tediously slow manner that it becomes either mesmerizing or simply boring. Unfortunately, in my case, the whole audience including myself were not mesmerized. Moreover, toward the ending, the film becomes more and more surreal, which for me personally did not lead to a satisfied feeling at the actual end. All in all, if you enjoy watching empty lands and silent people for a long time, you may be able to enjoy the positive aspects of this film. If, like me, you like films with at least the outline of a well-defined story and the feeling that you somehow understood what you just saw, this might not be the film for you.",
         "Excellent film. It's visually sublime, very spiritual and incredibly stirring. Admittedly, the long, quiet shots resemble Jia's cinema, Byambasuren's semi-documentaries and even Tarkovsky, but it doesn't curtail the power of the images one bit. Those are shots of a faraway, hence fascinating world (Inner Mongolia) where the people have a way rougher ride than us Central Europeans - we who are living in a \"well organized\" society. I don't mean those who still live under same conditions as their ancestors thousands of years ago. They seem to be perfectly happy, much more than us. I mean those people who are forced to adjust to a system they don't know and where they either stand or fall. Most of them fall once they are robbed of their lives with all that's left is emptiness and boredom. The film is about the loss of the spiritual soul, about cutting off roots and about ruining ancient cultures. There is just one little objection: Maybe it would have been more effective if a local had made the film instead of Europeans, because this way it remains to be a view from the outside.",
         "One of world cinema's biggest virtues is that it allows us to have a personal vision of distant places where it would be difficult for us to travel due to various reasons. Mongolia is one such remote area which has caught the attention of various film directors as many films have been set in this vast central Asian nation ever since it was popularized in 1989 by renowned German director Ms. Ulrike Ottinger through her film \"Johanna D'Arc of Mongolia\". Mongolia is honestly represented by ethnographic filmmakers Peter Brosens and Jessica Woodworth. Khadak is not a documentary film but it has made good use of a lot of documentary cinema's conventions to get closer to reality. Although the main story moves slowly, there are plenty of minor stories to keep in check the viewers' attention. These stories are an excellent initiation into the lives of people in Mongolia as each story represents an event related to the lives of the protagonists. One needs to watch this film if one's knowledge of ethnographic films is restricted uniquely to films made by Jean Rouch.",
         "Khadak is a deeply personal, esoteric story that not everyone will immediately understand. It demands much contemplation from the viewer, as most of what is seen falls between both dreams and reality. From what I gathered, the filmmakers were exploring a specific cultural attitude towards how both nature and industry are viewed by Mongolians. There is a strict dichotomy between the two. Nature is upheld as virtuous, where industry is left to vice. For the most part, the people have a deep inner-connectedness with nature\u0097meaning, the land and animals. Where the land represents the spirit of the dead and living, the industrial world represents its negation. In one way, the land represents their ancestral heritage; it is their means of interconnecting with their kindred dead. A witchdoctor-type shamaness is impressionistically used in the story to help the people restore balance between themselves, the land and their ancestors. She is the healer and interpreter of both their dreams and realities\u0097those who have lived and are still living. It's as if her character is also a metaphor for the oneness of life and nature. As revealed in a conversation between Bagi and his grandfather, the shamaness must be relied upon in order to live; that is the \"harsh law of the universe.\" The sense of her representing vitality is depicted when she enters one of Bagi's epileptic dreams and helps him recover. This abstract scene, amongst others, draws a fine line between both fiction and fact, between knowing what is dream and what is reality. The purpose, I think, is to portray the idea of oneness\u0097that everything is interconnected. It is the shamaness, then, who helps show this interconnection that the people have with their surroundings. We only become aware of how deep this interconnection is when Bagi's nomadic family is shown being forced to leave their home due to a supposed animal plague. However, they do not leave without a struggle. As government officials call for evacuation, the family resists: \"We're not leaving the land. Our animals are fine,\" says the grandfather. After raiding all of the family's possessions, the officials literally have to carry the stubborn old man away in a chair in order to divorce him from his once humble abode. The family thus loses their connection with nature and enters the industrial world; a commentary that seemed to suggest how materialism pollutes spirituality. There is a lot of symbolic imagery used throughout the film; one particular symbol being the khadak, or blue scarf. As mentioned by Woodworth, it is a symbol of the sky. It also has other meanings. Whenever it is present on screen, it is usually attached to the lonesome and surreal-looking tree that stands amidst the desert. Again, the concept of interconnectedness with nature seems to be what the khadak and tree together portray. There is a beautiful moment when the camera rotates the position of the tree from earth to heaven (the tree being upside down). I found this shot particularly fascinating because the tree branches stretching out from the sky were like giant hands; hands that resonated the feeling of ancestors trying to call upon Bagi and his family to become one with nature again. Perhaps that is what the shamaness meant when telling Bagi that his ancestors are calling upon him. Since ancestors and nature seem to be synonymous, the calling from the ancestors is a calling to return to nature; a divorce from the material world and a return to oneness of nature. When the khadak later rains from the sky during the release of the animals, it seemed to represent hope; hope that reassured Bagi and his band of rebel friends that the industrial world was indeed being overcome. The rebels, after all, joined together by code names in order to revolt against the powers of industry and return to their natural environment. All of their names, or words spoken during the counting sequences were names of places in nature, like \"River\" and \"Sky.\" Another meaning for the khadak, then, is that all of their names together were symbolic for what the khadak stood for\u0097places in nature.",
         "I was very excited about watching a Mongolian movie for the first time, and this turned out to be a complete disaster. There is literally no story. The movie starts with a nomadic family having to move to the city because their animals die. In the city part of the movie, things start getting more and more weird. The two teenage characters run around constantly, the camera turns upside down, a female voice slowly counts to 10...... if you don't get it, you're supposed to feel stupid and guilty for failing to appreciate the deepness of the hipster directors, I guess. Just like in Hans Christian Andersen's \"The Emperor's New Clothes\". Don't waste your time on this.",
         "This movie lacks about everything what a movie needs for being a movie. First of all, it tells no story. It is an endless array of non-coherent scenes where every scenes lasts for at least 20 seconds. There is very little sound in the movie. People do not talk, there's no background music and there is hardly any sound from the backgrounds. Most scenes are staring people to 'god knows what' or very empty sceneries. It bores you to death. If should want to compare it with more 'down to earth' objects, then: It's like eating soup without ingredient. It's like Music without rhythms or melody. It's like a bicycle without a frame. It's like a novella without characters. It's like food without taste. It's like a car without an engine or wheels. It's like a holiday in which you have to work for 17 hours a day. It's like sailing without a boat. More of all: It's like a movie without a story."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Bo Films",
         "Centre du Cinéma et de l'Audiovisuel et des Télédistributeurs Wallons",
         "Cinéart"
      ],
      "summaries": [
         "Magical realism, epilepsy, and the steppes of Mongolia. A pilot dies. His son Bagi, who, like his father, has epilepsy, grows up on the steppes, herding sheep, subject to fits. A plague among the animals forces the family off their land to a city where Bagi gets a mining job. His seizures become more frequent and bring visions in this wasteland of strip mining, factories, and rubble. He falls in with a troupe of student performers after saving the life of one of their number. As the crisis of his people deepens - herders without flocks - Bagi uses the visions to seek direction. Can he save his people, and can he find love?",
         "Set in the frozen steppes of Mongolia, a young nomad confronted with his destiny after animals fall victim to a plague which threatens to eradicate nomadism."
      ],
      "budget": 3000000
   },
   "movielensId": 58785,
   "movielens": {
      "languages": [""],
      "releaseDate": "2006-08-31",
      "dvdReleaseDate": null,
      "directors": [
         "Peter Brosens",
         "Jessica Hope Woodworth"
      ],
      "runtime": 104,
      "movieId": 58785,
      "title": "Khadak",
      "mpaa": "",
      "actors": [
         "Batzul Khayankhyarvaa",
         "Tsetsegee Byamba",
         "Banzar Damchaa",
         "Tserendarizav Dashnyam",
         "Dugarsuren Dagvadorj",
         "Ehkhtaivan Uuriintuya",
         "Namsrai Otgontogos",
         "Gereisukh Otgon"
      ],
      "imdbMovieId": "0475241",
      "originalTitle": "Khadak",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Set in the frozen steppes of Mongolia, a young nomad confronted with his destiny after animals fall victim to a plague which threatens to eradicate nomadism.",
      "tmdbMovieId": 8093,
      "avgRating": 2.5,
      "releaseYear": "2006",
      "numRatings": 2,
      "posterPath": "/wqk1cLWWmE4Mazvge6TG3M4uy2m.jpg"
   }
}