{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "muslim",
            "id": 789
         },
         {
            "name": "museum",
            "id": 2598
         },
         {
            "name": "jew",
            "id": 2606
         },
         {
            "name": "evidence",
            "id": 2620
         },
         {
            "name": "rabbi",
            "id": 3901
         },
         {
            "name": "interview",
            "id": 4434
         },
         {
            "name": "christian",
            "id": 5950
         },
         {
            "name": "faith",
            "id": 6150
         },
         {
            "name": "atheist",
            "id": 8778
         },
         {
            "name": "chapel",
            "id": 11465
         },
         {
            "name": "religious",
            "id": 14989
         },
         {
            "name": "catholic",
            "id": 18396
         },
         {
            "name": "evolution",
            "id": 34152
         },
         {
            "name": "trucker",
            "id": 156165
         },
         {
            "name": "mormon",
            "id": 156166
         },
         {
            "name": "skeptic",
            "id": 156167
         },
         {
            "name": "creationism",
            "id": 161205
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         }
      ],
      "imdb_id": "tt0815241",
      "video": false,
      "title": "Religulous",
      "recommendations": [
         2359,
         16070,
         1776,
         18570,
         13016,
         501,
         1777,
         22074,
         9372,
         13014,
         1430,
         39452,
         23128,
         13508,
         1781,
         15258,
         10523,
         12698,
         13958,
         11499
      ],
      "backdrop_path": "/j9gn5IfNvI6EoIx0r9OXjSleru2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe452e9251416c7504e575",
               "name": "Bill Maher",
               "profile_path": "/4BSBrFCcRYJD0lVb1fyb5dxiiFu.jpg",
               "id": 74086,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e579",
               "name": "Jose Luis De Jesus Miranda",
               "profile_path": null,
               "id": 74087,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e57d",
               "name": "Andrew Newberg",
               "profile_path": null,
               "id": 74088,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe452e9251416c7504e581",
               "name": "Steve Burg",
               "profile_path": null,
               "id": 74089,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e585",
               "name": "Tal Bachman",
               "profile_path": null,
               "id": 191441,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e589",
               "name": "Jonathan Boulden",
               "profile_path": null,
               "id": 554096,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e58d",
               "name": "Francis Collins",
               "profile_path": null,
               "id": 554097,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e591",
               "name": "George Coyne",
               "profile_path": null,
               "id": 554098,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e595",
               "name": "Benjamin Creme",
               "profile_path": null,
               "id": 554099,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e599",
               "name": "Jeremiah Cummings",
               "profile_path": null,
               "id": 554100,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e59d",
               "name": "Fatima Elatik",
               "profile_path": null,
               "id": 554101,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e5a1",
               "name": "Yahuda Etzion",
               "profile_path": null,
               "id": 554102,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e5a5",
               "name": "Reginald Foster",
               "profile_path": null,
               "id": 554103,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e5a9",
               "name": "Mohamed Junas Gaffar",
               "profile_path": null,
               "id": 554104,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e5ad",
               "name": "Bill Gardiner",
               "profile_path": null,
               "id": 208977,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Himself (archive footage)",
               "gender": 0,
               "credit_id": "52fe452e9251416c7504e5b1",
               "name": "Ted Haggard",
               "profile_path": null,
               "id": 132169,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe452e9251416c7504e571",
               "name": "Larry Charles",
               "profile_path": "/fg42iXWfuIeRVk4NFNWvWJf4hst.jpg",
               "id": 6767,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe452e9251416c7504e5b7",
               "name": "Bill Maher",
               "profile_path": "/4BSBrFCcRYJD0lVb1fyb5dxiiFu.jpg",
               "id": 74086,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 8.080205,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13007,
      "vote_count": 250,
      "budget": 0,
      "overview": "Commentator-comic Bill Maher plays devil's advocate with religion as he talks to believers about their faith. Traveling around the world, Maher examines the tenets of Christianity, Judaism and Islam and raises questions about homosexuality, proof of Christ's existence, Jewish Sabbath laws, violent Muslim extremists.",
      "similar": [
         10307,
         46738,
         335778,
         30431,
         10557,
         13373,
         14438,
         1986,
         117923,
         50875,
         409502,
         41997,
         296695,
         63348,
         211086,
         102837,
         31185,
         381831,
         346873,
         369615
      ],
      "original_title": "Religulous",
      "runtime": 101,
      "poster_path": "/go7QqWheQdcJVzfFIEkxcecW0BQ.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "עִבְרִית",
            "iso_639_1": "he"
         },
         {
            "name": "فارسی",
            "iso_639_1": "fa"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/eNdCXEfW6rDxjnO3VdqIzWVuviH.png",
         "name": "Lions Gate Films",
         "id": 35,
         "origin_country": ""
      }],
      "release_date": "2008-10-01",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Heaven help us.",
      "adult": false,
      "homepage": "http://www.lionsgate.com/religulous/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Larry Charles"],
      "runtime": 101,
      "synopsis": "'Religulous' is a 2008 American documentary film directed by Larry Charles and starring political comedian Bill Maher. According to Maher, the title of the film is a portmanteau derived from the words \"religion\" and \"ridiculous,\" implying the satirical nature of the documentary that is meant to mock the concept of religion and the problems it brings about.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0815241/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMDcxMTA3M15BMl5BanBnXkFtZTcwNzk5NzU2MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bill Maher, Tal Bachman, Jonathan Boulden | See full cast and crew »"],
      "reviews": [
         "Just returned from a screening. Let me say I am a sucker for a good documentary and this film makes a load of powerful points that just cannot be refuted. As someone who believes in evolution as well as God, the film did enlighten me about a host of issues that I had been unaware of. In recent weeks my biggest fear has been that the Neo-cons were finally going to give someone the nuclear football that truly believes in the rapture. Bush and McCain and Reagan and even Bush Sr. catered to the evangelists because they are sheep and are as strong a voting block as this country has. But none of those politicians really believed things like every word of the Bible being literal. Now Palin comes along and she, like Huckabee who also scared me, is the real deal. The Neo-Cons have plucked an actual sheep to get the sheep vote this time. When people with beliefs like that are given power, the inevitable result is destruction, and that is the point that this admittedly at times hilarious film hammers in during the final 5 minutes. I call Maher a hero in that he fears the consequences of irrational religious so much that he is literally willing to put his life on the line to deliver his message.Make no mistake about it, this man will get death threats from the film and I will pray that that is all that he gets. I am not worried about a Christian extremist, though maybe I should be, I am worried about Muslim reaction to the film though he arguably treated that religion with a bit more of kid gloves than his other targets. I believe that everyone should see this film, but instead all the nuts that need to see this film the most, will probably be picketing in front of the theaters where the film is showing. Hugely entertaining, enlightening, hilarious and ultimately frightening what more could you ask from a couple of hours at the movies?",
         "Saw the world premier of this at the Traverse City Film Festival. I am a big Bill Maher fan and this was definitely the movie/documentary I was most looking forward to at the festival. I was not disappointed, though I think it could have been developed a bit more. It seemed to play to the lowest common denominator in that a lot of issues were touched on, sometimes in rapid fashion, but none was examined closely for any length of time. Any astute viewer of Real Time already knows what Maher thinks about religion and many of his arguments with regard to the same. I was hoping for a more in depth analysis of some of the primary aspects of how religion can negatively affect our world in ways that people might not intend. The documentary did that only on the surface. I suppose that shouldn't be surprising as the need to draw people into contemplative thought in this area is probably more of a priority than retaining those that already are there (not to mention selling more tickets). Subsequent to the showing, director Larry Charles had a discussion on stage with Michael Moore, with questions from the audience. Larry pointed out that he had many many more hours of footage that didn't make it into the final cut, and that he thought maybe a series could be released on cable of this material. I would very much like to see that happen as I think it would quell the thirst I had for more substance with less of the fluff. However, kudos for Maher and Charles for doing this. If it is successful in getting people to think about religion in real world terms, then it has accomplished its goal.",
         "I watched Bill Maher's new movie, Religulous at it's world premiere at the Traverse City Film Festival. It was one of the first films to sell out at the festival, selling out in just the first couple days of sales. Okay... now for the movie review: for those of you who thought that Dawkin's \"Root of all evil\" or \"Jesus Camp\" were powerful statements, then you might want to wear diapers because you might just crap yourself. Religulous doesn't take prisoners. It addresses Christianity, Scientology, Mormonism,Islam, and other religions. Bill Maher travels around the word, visiting the Wailing Wall, USA Bible Belt, Salt Lake City, and other locations while interviewing a wide range of religious leaders and followers. Throughout the interviews, Bill throws out zingers and the joke timing is impeccable. Like the pro-creationist movie \"Expelled\", Religulous cuts to a variety of old film stock when making jokes. Although it fails at times, I would say the vast majority of the cuts connect and generates hearty laughs. The first third of the film deals with Christianity and several offshoots of it. Here, the movie shines. It is hilarious! Poking jab after jab into insane ideas by asking simple questions. Unfortunately, the move starts to slow down after he lampoons Scientology. Dressed as a vagrant, he appears in Hyde Park's Speaker's Corner and runs through Scientology's belief structure... appearing as a raving lunatic while accurately describing what that religion teaches. By the time it deals with Islam, a lot of inertia has been lost. Although it still delivers some funny bits, the movie is much more subdued. Granted, anytime you are dealing with a subject so inflammatory that people have been killed over it, you tread lightly, but I think Christians will criticize the movie for being softer on Islam than on Christianity. The sad thing is that it's true. Being the more dangerous religion, people seem to be treating Islam with kid gloves. I wonder how long before other religions start adopting that tactic as they become threatened by critics? The ending is a fiery call to action for freethinkers. Rousing music & inflammatory speech hammer the dangers of religion into the audience. Propaganda techniques? Yes. Pretty heavy-handed about it too. However, I think it's needed. The flow of the movie needed something to bring things together and although thick with images and rhetoric... it is a solid ending. Is it worth seeing? Hell yes! Will people be offended? Most definitely. Will there be protesters? There should be, this is far more blasphemous than \"Dogma\", \"Passion of the Christ\", or \"The DeVinci Code\". Comparing \"Expelled\" to \"Religulous\", it's pretty quickly apparent that Religulous is the better movie. Bill Maher, with his previous experience doing standup and conducting interviews shames Ben Stein. Nicely done Bill!",
         "Two things about this film took away a star. One was that Bill Maher spent so much time with the ones he tried to make look bad that he didn't meet with enough experts who could further the points he was making. The second problem is that the people he interviewed could have easily made fools of themselves without him cutting them off and lecturing them. That being said, let's get to the good points. For one thing, he makes it so clear how illogical the mass amount of people can be. He exposes phony beliefs and shows how they can become very protective against his film crew. The film stock they put into use is done masterfully. Plenty of laugh out loud moments (particularly the image of Jesus as a teenager, you will see). My word must be taken as truth when I say that the final part of the film MUST be seen. This isn't just about cracking jokes on faith. This film is about the human race taking responsibility of itself and stopping the damage it has been doing for far too long. I truly hope religious people are not quick to brush this film off. For once, listen to the side from someone who is sincerely concerned about all of our futures.",
         "This film was everything I expected and more... To admit, I never really knew much about Bill Maher when I went to see this film. I saw this at the Atlantic film festival and I loved it. My friend had told me that it was going to be good, so when I saw it in the schedule I said \" Hmm, maybe i'll see this.\" So we did. It was hilarious, I wet myself at several points. But! It was also VERY insightful. I actually learned quite a bit about how religion can be REALLY stupid. And it's true. I really enjoyed the interviews with some people who just take everything way to seriously. I loved the comedy being used to explain things that are very serious. So I completely suggest this to everyone, not just Bill Mahers fans. \" You don't need to pass an IQ test to be a senator.\"",
         "I found this movie exhilarating. I'm with you, Bill Maher! That said, this film attempts to cover the basic tenets and idiocies of several of the major religions, namely Catholicism, Judaism, and Islam. It also encompasses evangelical/American/born-again-type Jesus-focused religion, which considers itself \"Christian\" but I have never understood that title, since Catholics revere Jesus also. But anyway... Maher is a smart man, and I would like to think that he considered the points I feel were left out of the movie and chose not to include them for the sake of condensing the film. However, there are several facts that I think would have made an even stronger case against mass religion in general: 1. Although Maher mentions several times that the Judeo-Christian Bible was written by men, and therefore contains the fallacies of men, he does not bring up the fact that the Bible has been constantly rewritten, translated from language to language, and amended to suit the needs of those in charge of its distribution -- for most of history since Christ, this was the Catholic Church and its founders. And for those of you who don't know, translation is not an exact science. Languages just do not translate word for word, and the accuracy of the translation depends on the skill, vocabulary, and motives of the translator (a human being, don't forget). 2. Catholicism was successful because it incorporated many old religions. Greek and Roman gods are just a few of those who have direct equivalents among the Catholic saints. Mahar discusses the inherent flaw in a monotheistic religion with bunches of demigods, but he does not point out that Catholicism deliberately found supposedly Catholic replacements for the more ancient, household-type gods. Why? Because those who wanted the religion to succeed decided that people would be more likely to convert to it if it weren't too different from what they were used to. Why did these men want the religion to succeed? For the same reasons that people promote religions today: to gain money and power, particularly in the form of influence. Maher reminds us that the story of Jesus Christ included many elements of older heroes or gods, but the film presents this as a matter of fact, not pointing out that Catholicism was built upon the success of these preceding stories and histories. The types of dramas that move the human spirit have not changed over thousands of years--they have simply been retold and reinterpreted. 3. My third point is more of a question. I was raised as a \"nouveau\" American Catholic, so I feel that I know a little bit about that religion, but I know next to nothing about Islam. However, it is my understanding that Mohammed did not want images of himself used to promote his teachings. Is this why some Muslims get so mad when an image, ridiculing or not, of the prophet is publicized? I wish Maher had included this, as he did talk a lot about the violence specified in the Koran. This is a terrific film. It is funny and has a great soundtrack. My hat is off to Maher for his nerve in interviewing people who become belligerent when their religion is questioned. I guess it partly comes from being a comedian--one must have guts and a thick skin! The message of the film, however, is not humorous at all. It is truly terrifying to think of all the murder, torture, and oppression that is perpetuated in the name of religion. Why then, is someone who calls himself \"Godly\" or \"religious\" considered to be a person with wholesome morals?",
         "I just come back from watching religulous. I had a great time. Bill makes a lot of fun of all those silly things people actually believe. Obviously since I am an atheist I really enjoyed this movie, and I know that most believers will reject it altogether. But there is one thing that just occurred to me as I read through the comments here, it's the fact that, yes, people like me do not go around advertising their atheism. And I saw someone writing that this was why the religious people would always dominate. Well there you have it now though... Bill Maher's movie is definitely a non-believer statement, and a wonderful one at that. I am also painfully aware that it won't change anything in the sad state of affairs in the USA. But at least it's one solid step in the right direction. Now, why do I say \"worrying\" in the title of my review, well it's because I think that Bill's got it straight regarding the dangers of religion. How can you expect people to make rational decisions when they reject the teachings of the very same science that provides them day in and day out better lives?",
         "With 16 percent of the U.S. population, the un-/non-/anti-religious represent a larger segment than blacks (13%), gays (3%), or NRA members (2%). Never mind the exact figures (which vary from source to source), focus on the question what kind of lobby do the non-religious have, with impact approaching those other groups? None, alas. Why is that? It could be this: The militantly religious must be *right*, the secular - by definition - will not fight to the death for his truth (or god, not in evidence). My money is on the righteous, the fervent, the militant, the possessed. One day, they may even have an influence over the U.S. government! Meanwhile, in our corner, there is Bill Maher. His \"Religulous,\" directed by Larry Charles, is an entertaining, funny, angry, thought-provoking journey from the Al-Aqsa Mosque, Via Dolorosa, the Qumran Caves, to Stonehenge, Habibi Ana (and a Moslem Gay bar), the Vatican, the Holy Land Experience Park in Florida, the U.S. Capitol, Mormon Tabernacle, and many others. Everywhere, Maher is asking a few simple questions: What do you believe, why, and how can you possibly...? Half Catholic, half Jewish, and fully agnostic, Maher is incredulous, in every sense of the word, but curiously warm and gentle asking questions about the \"the final battle between intelligence and stupidity that will decide the future of humanity.\" In Larry Charles' words, the situation confronted is like this: \"An old God, a very buff old God that lives in space decides to create the first man from earth dust, then makes a woman from that man's rib. They get to live forever if they don't eat the forbidden fruit from the tree of knowledge, but the woman is tricked into eating a piece by a talking snake and all future humanity is cursed.\" And that, of course, is just the basic tenet of one religion. Discuss. Maher goes on in his polite crusade to dissect some of the similar Star Wars/Disney scenarios in Scientology, Mormonism, among Orthodox Jews and televangelists. All interviews are interesting, but some are amazing and memorable. Father Reginald Foster - a senior Vatican scholar, principal Latinist for the Pope - will stun you as he agrees with Maher on some points. There is unexpected goodwill and kindness from a group of evangelists \"attacked\" by Maher; they pray for him, and really mean it. You may have chills running down your back as you listen to Sen. Mark Pryor (D-Arkansas), sitting in his Capitol office, speaking about his belief in Creationism and the literal interpretation of the Bible. You don't need to be a Christian to be offended (and amused) by the commercial Jesus impersonators Maher interviews, and you may feel a bit sorry for the Pentecostals speaking in tongues. (Gov. Palin and John Ashcroft, neither featured in \"Religulous,\" are members of that church.) After comedy, irony, and sarcasm, Maher turns serious at the end of the film, and asks with deep concern if the future of the world can be entrusted to the many varieties of believers in the unreal, the illogical, the incongruous, the phantasmagorical. Looks like we are well on our way to that eventuality.",
         "Not just a propaganda piece, and more accessible than most of Bill Maher's creative output, Religulous still preaches to the choir (please excuse this phrase). However, the film does not seek to convert; rather, Maher wants current agnostics to gather their courage and preach their doubts. Deeply atheist and deeply religious people who see the film will likely be offended or feel as though their time has been wasted. While this film is not as funny as Borat, Religulous (which, at times is actually pretty scary) is a more powerful film because this film is true. For a project written by and starring Maher, the clips in the film are (for the most part) surprisingly fair. Maher does not try to make any of the people in the film look stupid (at least no more stupid than himself); in fact, he (usually) tries to help people consider the position not that their personal/religious beliefs are incorrect but that their personal beliefs may be incorrect. Most people in the film will not consider this possibility (these are the people Maher is warning us about), but several important and seemingly wise religious figures also featured in the film agree with Maher about the danger of certainty. I recommend Frailty to anyone who would like to see a fictional, story-line illustration of the main theme of this documentary/propaganda film. I recommend Religulous to anyone who is comfortable enough with himself/herself to doubt their personal beliefs, to consider the possibility that (s)he might be wrong.",
         "I was really looking forward to this film because the one thing I hate on Real Time is when Bill Maher goes off on one about religion, making massive sweeping statements about people not being allowed to vote if they believe in angels etc. It is not that I disagree with the basic argument he says but just that he doesn't seem to have a lot to back it up and, the odd time he is called on it by the guests he will move along and not really seem to have much behind his general opinion that people with religious beliefs are idiots. So for me this film was not an opportunity to get more annoyed by this but rather give him my undivided attention and let him lay out his case. He manages to do this here and there but nowhere near consistent or good enough to make an argument capable of changing minds \u0096 although perhaps good enough to provide food for thought. At the end of the film he gives a very good speech that sums up his film and this is probably the strongest part of the whole film as it challenges and makes reasonable points. OK it is loaded with imagery that backs up his points in a very blunt way but I can forgive him for this. What I have a problem with is that the rest of the film doesn't have this same core of logic and reasoned argument. He hits it here and there but too often he is doing two things. The first of these two things is that he will never give up an easy joke and this is not helped that his goal often seems to be that he seems very keen to mock people rather than reason with them. Hence we get the personal barbed remarks that are thrown out for the audience but the interviewees either don't hear or don't get their response shown. The second thing he does is select really weak people if his goal is anything other than mockery. I do agree with a lot of what Bill says \u0096 particularly about the role of religion in world politics. I do believe in the concept that religious tenants within people's personal lives as guides and moral foundation is something I can live with but when things are taken as fact and taken totally literally then things get out of hand. So I do want to see Bill present a more rounded argument and have that debate with people who can talk to him at the same sort of intellectual level. Sadly what we get are interviews with a priest who is a self-appointed doctor, a man who plays Jesus at the Holy Land theme park, a Muslim extremist British rapper (who let me say has ZERO profile over here), a man who is a reformed homosexual, a man who claims to be descended directly from Jesus and thus now leads the one true church and others of similar quality. We do have experts on the roster but they are mainly used to back up what Maher is saying. Now, I know many people do not like him, but to me Maher is too smart to need to be protected from reasonable discussion. The only exception I would give is the one priest he talks to who seems very liberal and open to taking the basics of his religion and getting away from dogma and ritual. Outside of him though Maher does not have a hard time showing them up but, when he occasionally gets someone who is a bit more careful with language and phrasing and can prevent themselves sounding like nuts, the film uses an even more cowardly trick. What we get are Maher filmed in the car talking about the interview, which very much gives him the final word and allows him to make responses and ridicule once the individual is not there to respond anymore. I do like Maher enough to watch his stuff, but this is a cheap trick and cheapens the film by extension. Of course this doesn't look as bad when you consider the heavy editing in of footage from other films \u0096 some of it is fine to provide images, stimuli or just as a base but again mostly this is used to mock the subjects after the fact, the most unnecessary and annoying example being the use of Scarface \u0096 the guy was doing fine making himself look crazy, it didn't need the heavy hand. I read a comment on this website that said if you disagree with Maher then the film is not for you, it is about you \u0096 sadly I have to agree with that. This film will do best with those who are coming to watch Maher put the boot in without a lot of finesse or intelligence \u0096 just like he often does on Real Time. There are plenty of moments where he makes very good points and allows his subjects to talk themselves into a corner but too often he is selecting weak targets (people at a theme park!), mocking them with easy gags, letting them make themselves look like idiots (which many are) and then standing back as if he has proved something beyond the point that this person, right here, is an idiot, which he has not. It is a real shame because this should be a film for everyone \u0096 even if not everyone likes it. If he is serious about his plea for moderates to look in the mirror then he needs to make a film that does that and, sadly, this isn't it. It provides food for thought and I did find it a rousing challenge to religion but it is nowhere near the film that he should have made."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": ["Thousand Words"],
      "summaries": [
         "Bill Maher interviews some of religion's oddest adherents. Muslims, Jews and Christians of many kinds pass before his jaundiced eye. Maher goes to a Creationist Museum in Kentucky, which shows that dinosaurs and people lived at the same time 5000 years ago. He talks to truckers at a Truckers' Chapel. (Sign outside: \"Jesus love you.\") He goes to a theme park called Holy Land in Florida. He speaks to a rabbi in league with Holocaust deniers. He talks to a Muslim musician who preaches hatred of Jews. Maher finds the unlikeliest of believers and, in a certain Vatican priest, he even finds an unlikely skeptic.",
         "Comedian and commentator Bill Maher, who grew up Catholic of a Catholic father and Jewish mother, believes that organized religion is a detriment to the progress of society. He also believes that many tenets of the various religions worldwide will end up being self-fulfilling prophecies because man can now achieve them. He has trouble understanding the long held tenets that, if described today in any other western context, would be deemed crazy, such as the story of Jonah and the big fish, or a virgin birth. Maher has discussions with leaders and followers of various religions, both in the mainstream and on the fringe, to try and understand why their beliefs are so strong, while both sides try to convince the other to see things from the other side. Specifically with United States based Christianity, he has discussions with those associated on what seem to be the inherent incompatible beliefs of Americans, such as between religion and science, nationalism, and consumerism, as well as the incongruence between the purported plain life of Jesus against the wealthy opulence of modern day Christian monuments and most Christian leaders. Although focused primarily on Christianity, he looks at Judaism, Islam and what may be considered more fringe religions such as Mormonism and Scientology, not only in and of themselves, but also their tolerance, or what is more often their intolerance for views other than their own, including that of other religions.",
         "With quotes from major figureheads like Thomas Jefferson, George W. Bush and Osama Bin Laden, Bill Maher, with a Jewish-Catholic background, sets out to prove that having faith and seeking directions from God is basically ridiculous and may be due to a neurotic disorder. Interviewing Christians, Catholics, Jews, Muslims, Mormons, scientists, gays, and atheists, he cites that the number of non-believers is increasing in North America. He attempts to prove his point by citing inconsistencies in the Bible, the controversial birth of Lord Jesus, the inability of religious heads to account for His absence for over 18 years, as well as the absence of any concrete evidence that disproves the theory of evolution.",
         "Bill Maher's take on the current state of world religion."
      ],
      "budget": 2500000
   },
   "movielensId": 59126,
   "movielens": {
      "languages": [
         "العربية",
         "English",
         "עִבְרִית",
         "فارسی",
         "Español"
      ],
      "releaseDate": "2008-10-01",
      "dvdReleaseDate": "2009-02-17",
      "directors": ["Larry Charles"],
      "runtime": 101,
      "movieId": 59126,
      "title": "Religulous",
      "mpaa": "R",
      "actors": [
         "Bill Maher",
         "Jose Luis De Jesus Miranda",
         "Andrew Newberg",
         "Steve Burg",
         "Tal Bachman",
         "Jonathan Boulden",
         "Francis Collins",
         "George Coyne",
         "Benjamin Creme",
         "Jeremiah Cummings",
         "Fatima Elatik",
         "Yahuda Etzion",
         "Reginald Foster",
         "Mohamed Junas Gaffar",
         "Bill Gardiner",
         "Ted Haggard"
      ],
      "imdbMovieId": "0815241",
      "originalTitle": "Religulous",
      "genres": [
         "Comedy",
         "Documentary"
      ],
      "youtubeTrailerIds": ["XdkyLrDpaUg"],
      "plotSummary": "Commentator-comic Bill Maher plays devil's advocate with religion as he talks to believers about their faith. Traveling around the world, Maher examines the tenets of Christianity, Judaism and Islam and raises questions about homosexuality, proof of Christ's existence, Jewish Sabbath laws, violent Muslim extremists.",
      "tmdbMovieId": 13007,
      "avgRating": 3.60729,
      "releaseYear": "2008",
      "numRatings": 1412,
      "posterPath": "/go7QqWheQdcJVzfFIEkxcecW0BQ.jpg"
   }
}