{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mutation",
            "id": 2766
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "psychotronic",
            "id": 164218
         }
      ],
      "imdb_id": "tt0083629",
      "video": false,
      "title": "The Beast Within",
      "recommendations": [
         3581,
         26680,
         40969,
         39043,
         27726,
         47340,
         24124,
         73832,
         29129,
         54523,
         36835,
         40060,
         44914,
         54858,
         13798,
         24194,
         40034,
         30885,
         39875,
         84995
      ],
      "backdrop_path": "/6HGjid5ifr5RRZISqJNWWKkAFYl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Eli MacCleary",
               "gender": 2,
               "credit_id": "52fe4587c3a36847f80cc5cf",
               "name": "Ronny Cox",
               "profile_path": "/1uvHfK4dUw9VTl0kvBw9j8kg9Ek.jpg",
               "id": 780,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Caroline MacCleary",
               "gender": 1,
               "credit_id": "52fe4587c3a36847f80cc5d3",
               "name": "Bibi Besch",
               "profile_path": "/zWpFXjzIS3cWI90bjrc9GfWMRpd.jpg",
               "id": 1794,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Michael MacCleary",
               "gender": 2,
               "credit_id": "52fe4587c3a36847f80cc5d7",
               "name": "Paul Clemens",
               "profile_path": "/wbmXCv6J9TWjdN3X3MOyoXOYDUc.jpg",
               "id": 98424,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Doc Schoonmaker",
               "gender": 2,
               "credit_id": "59b59216c3a36851e50004d0",
               "name": "R.G. Armstrong",
               "profile_path": "/iyOD1sUIX4SAPbfF4C9C7cI3ayP.jpg",
               "id": 1107,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sheriff Pool",
               "gender": 2,
               "credit_id": "53e2bc040e0a262b8f002595",
               "name": "L.Q. Jones",
               "profile_path": "/jhPsFq7qYT2QKc4FO70fqxgfpXs.jpg",
               "id": 8262,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Judge Curwin",
               "gender": 2,
               "credit_id": "595b1c7e925141225102fbc8",
               "name": "Don Gordon",
               "profile_path": "/nlffwt9VgwnPvcuVEorb6AApfqR.jpg",
               "id": 14062,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Amanda Platt",
               "gender": 1,
               "credit_id": "595b1ce6c3a368265d04ab19",
               "name": "Katherine Moffat",
               "profile_path": null,
               "id": 1214007,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Edwin Curwin",
               "gender": 2,
               "credit_id": "595b1cffc3a3680d5901d3da",
               "name": "Logan Ramsey",
               "profile_path": "/p0nGZszv0Lv82bABCKxheiegWnh.jpg",
               "id": 16031,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Horace Platt",
               "gender": 2,
               "credit_id": "595b1d14c3a3680dec01d4a1",
               "name": "John Dennis Johnston",
               "profile_path": "/aNVNhdqDRR7kMegaiNWW8lGEUCR.jpg",
               "id": 85869,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Tom Laws",
               "gender": 2,
               "credit_id": "595b1d2c92514121f0030a1c",
               "name": "Ron Soble",
               "profile_path": "/rt0rehPLz50IzXolpI20MjkpTJF.jpg",
               "id": 161405,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Dexter Ward",
               "gender": 2,
               "credit_id": "595b1d4092514121f0030a36",
               "name": "Luke Askew",
               "profile_path": "/nlV0bfadoMjbz7vxmLl5zALc86H.jpg",
               "id": 8962,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Deputy Herbert",
               "gender": 2,
               "credit_id": "595b1d559251410b8604d4af",
               "name": "Meshach Taylor",
               "profile_path": "/dny2i7najOli48iy3xhlPh987cI.jpg",
               "id": 101784,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4587c3a36847f80cc5c5",
               "name": "Philippe Mora",
               "profile_path": "/391SzbIpO4fy4KIrUqmMKiFpre.jpg",
               "id": 114629,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4587c3a36847f80cc5cb",
               "name": "Tom Holland",
               "profile_path": "/yYNJTyRwKoUT27Dp9fIO9rWwO3s.jpg",
               "id": 64796,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.855416,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 40219,
      "vote_count": 29,
      "budget": 0,
      "overview": "In the beginning of the movie you see a woman getting raped by a man-creature of some sort. The movie takes place years later when the child that was a result of that rape is on the rampage looking for a girl to rape to start the process all over again.",
      "similar": [
         9659,
         8810,
         9355,
         19898,
         841,
         8337,
         9693,
         185,
         63,
         68,
         78,
         17654,
         1103,
         1359,
         111,
         141,
         627,
         762,
         4638,
         550
      ],
      "original_title": "The Beast Within",
      "runtime": 98,
      "poster_path": "/bnoThpfg26xVDdL0h4gUA9yxXIv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Katzka",
         "id": 44428,
         "origin_country": ""
      }],
      "release_date": "1982-01-01",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "He Was On The Verge Of Becoming A Man... Eater!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philippe Mora"],
      "runtime": 98,
      "synopsis": "While driving in rural Mississppi after their honeymoon, Eli McCreary (Ronny Cox) and Caroline McCreary (Bibi Besch) run off the road when they miss a turn. The car is stuck in the mud, so Eli walks to a nearby service station for help. Before he can return, a mysterious creature kills their dog and rapes Caroline. Caroline is impregnated from the encounter. Seventeen years later, their son Michael (Paul Clemens) suffers from an unknown malady and appears near death. Leaving him in the hospital, Eli and Caroline return to Naiobi, Mississippi, the small town near where the assault had happened; they are convinced the secret to Michael's condiditon lies in the identity of Michael's biological father. The local magistrate, Judge Curwin (Don Gordon), and newspaper editor, Edwin Curwin (Logan Ramsey), are suspicious of their investigation into the horrible murder on the same night as Caroline's rape, in which the victim's remains were partially eaten and his house burned down. Michael continues to have dreams of trying to lock something evil in a cellar. He escapes from the hospital, steals a car and drives to Naiobi. There, he finds himself drawn to Edwin Curwin's house. Curwin lets him in, mistaking him for the local grocery delivery boy. Michael is suddenly overcome with homicidal urges; he kills and partially eats Curwin. He is found a few houses away by Amanda Platt (Katherine Moffett). Concerned about his health, she takes him to the local doctor's office. Dr. Schoonmaker (R.G. Armstrong) contacts Eli and Caroline, but everyone is surprised that Michael seems to be in improving health. Michael visits Amanda. They go for a walk in the woods and admit their attraction to one another. But as they kiss, Amanda's dog digs up a partially eaten human hand. Sheriff Pool (L.Q. Jones) is called in, and he, Judge Curwin and Eli begin to excavate the area to find more remains. Amanda's father Horace (John Dennis Johnston) arrives and drags Amanda away, forbidding her from seeing Michael again. Later that night, Michael sneaks into the mortuary and kills Dexter Ward (Luke Askew), a relative of the Curwins and Platts. He also visits the town drunk, Tom Laws (Ron Soble), and identifies himself as Billy Connors. Michael goes to Amanda's house ostensibly to protect her from the murderer but is chased away by her father. In the hospital, Schoonemaker talks to Eli and Caroline about a mysterious second, subcutaneous layer of body that appears in Michael's x-rays. Later, Michael angrily tells Eli and Caroline that he knows Eli is not his father, but rather that Billy Connors is. When Tom confronts them the next day to tell him that Michael isn't responsible for the murders but rather Billy Connors is, Eli demands answers. Michael kills Tom then goes to Amanda's house. Realizing that his homicidal urges are returning, Michael pleads with Amanda to leave town then throws himself out the window in a suicide attempt. Sheriff Pool and Eli go to the Collins house and find a misshapen skeleton chained in the cellar. Back in the hospital, Michael transforms into a hideous creature in front of Schoonemaker, Caroline, Horace and Judge Curwin. Surviving several gunshots to the chest, Michael kills Horace then escapes into the night. His human skin is found sloughed off outside. Judge Curwin demands protection in the county jail. He reveals that Billy Connors had been imprisoned in his cellar by Lionel Curwin; Lionel, a deranged fundamentalist Christian, chained him there after he found Billy and his wife in bed together. Lionel killed his wife then left her remains for Billy to eat. Lionel, the Curwins and Ward continued to procure cadavers for Billy to eat, which transformed him into a terrible monster. Michael attacks the county jail, breaking through the walls to decapitate Judge Curwin. He then tracks down Amanda, whose car had run off the road. He chases her into the woods near where Caroline had been assaulted. There, he rapes her. When his parents, the sheriff and Schoonemaker arrive, Michael attacks Eli. Caroline grabs a shotgun and shoots Michael in the head, killing him immediately. Schoonemaker (holding Amanda's ravaged body), the McCreadys and Sheriff Pool stand, looking awkwardly at one another.",
      "writers": [
         "Tom Holland",
         "Edward Levy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0083629/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3MjgxMzIwOV5BMl5BanBnXkFtZTYwNDc2Nzg4._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ronny Cox, Bibi Besch, Paul Clemens | See full cast and crew »"],
      "reviews": [
         "Philippe Mora does has made lots of very strange movies in his underrated career, some good, some truly awful. This is one of the better ones. If you analyze the plot too much the holes become big enough to drive a truck through, but just ignore the urge to do that, and you'll find you're watching an near-classic of transformation horror. A newly-wed (Bibi Besch) is raped by a mysterious beast on her wedding night. Seventeen years later her son (Paul Clemens) is dying of an unknown illness. She and her husband (Ronny Cox) return to the scene of their past trauma to try and get some answers. They find some strange townsfolk who appear to be hiding some mysterious secret. Exactly what it is I won't say. It would not only spoil the movie, but I must admit I'm a trifle confused myself at the \"explanation\" for the weird events depicted on screen! Like I said, think about it too much and you'll ruin it. Just go with the flow... 'The Beat Within' contains plenty of creepiness and some gruesome murders. An added attraction for film buffs is the interesting supporting cast, which includes Peckinpah veterans R.G. Armstrong ('Predator'), L.Q. Jones ('Casino') and Luke Askew ('Easy Rider'), and character actors Don Gordon ('Out Of The Blue') and Mora semi-regular John Dennis Johnston. ('Flesh & Blood') 'The Beast Within' rarely gets mentioned in discussions of 1980s horror movies, but it should. It may not be up there with the best of Cronenberg, Carpenter, Romero, or Raimi, but it's well made, original, strongly acted, and damn good fun!",
         "The Beast Within is without doubt one of the most underrated Horror films of the 1980s and also probably of all time. I still don't understand why this film ranks so low on the totem pole with most fans and critics. Some say that the film's premise is ludicrous but legendary Horror author H.P. Lovecraft used similar ideas of degenerative mutation in his classic story \"The Lurking Fear.\" Beast features a strong cast with top acting honors going to Ronny Cox and Bibi Besch while excellent support comes from top character actors R.G. Armstrong and L.Q. Jones. Paul Clemens gives a very impressive turn as the title character, at one point a tortured young man, the next a murderous killer. He is really quite good, what happened to this guy? Also good is the cute Kitty Moffat who plays his ill fated girl friend. Director Philippe Mora does an excellent job of capturing the look and feel of an eerie little southern town with a dark secret and he keeps the action moving but never at the expense of the atmospherics. Particularly impressive are the scenes in the swamp after the human remains are found and the part where Clemens checks out the house where his Father was imprisioned. Much is made over the film's over the top effects work by Tom Burman particuarly the wild transformation scene at the fim's climax but give them credit for doing something different with the tired transformation sequences that populated 1980's Horror films. The part were Clemens' head blows up like a balloon is foreshadowed by a funny moment earlier in the film where Armstrong fiddles with one of those plastic dolls whose heads would expand when you squeze their bodies. And the film has a nice sense of symetry as Clemens, reborn as the monster who raped Besch is in turn killed by her at the film's end while Moffat who suffered the same fate as Besch is now going to carry the next beast. The Beast Within does not deserve the poor reputation it has and is ripe for rediscovery by discerning Horror buffs. Give it a try.",
         "\"The Beast Within\" was a staple of TNT's MonsterVision many years ago, and its unique (yet often convoluted) premise reveals why: how many movies have featured a bloodthirsty cicada monster? Based on the novel by Edward Levy (adapted by future \"Child's Play\" director Tom Holland), the plot has happy newlyweds Ronny Cox and Bibi Besch running afoul of terror along a backwoods Mississippi road, where Besch is raped by some vague, subhuman creature; 17 years later, son Paul Clemens is exhibiting some extreme growing pains that include the occasional ghastly murder when his parents return to the scene of the crime looking for answers. While the plot never really comes together as well as it should, \"Beast\" is a model of B-movie efficiency that utilizes atmosphere, location, and some supremely grotesque special effects to leave the viewer rattled (director Philippe Mora also has an excellent grasp of light and shadow to create mood). In hindsight, the film has the type of contained, small-town-America aesthetic that has become the watermark of Stephen King's prose, and the cast is appropriately comprised of rather typical faces, not marquee stars. In the end, \"Beast\" is a wonderfully ghastly little flick with a creepy story that's executed just well enough to overcome some poor acting and an occasionally sluggish pace.",
         "One of the better, and most overlooked, monster films of the 80's is this fun and effectively creepy B horror film. On a dark and stormy Mississippi night, a woman is attacked and raped by a mysterious monster. Now, seventeen years later, her ill teenage son is starting to display some murderous behavior that keeps getting worse... The Beast Within (based on the Edward Levy novel of the same title) is too often bashed by critics. Many complain that the storyline is convoluted, but frankly if everything were explained it would lose its sense of chilling mystery. There is much to be enjoyed in this off-beat creature flick. The story is nicely creative with a hint of old school horror and a good dose of building tension - all of which is dotted with some startlingly good murder scenes. The gruesome makeup effects aren't bad, this film has one wild transformation scene. Direction wise Philippe Mora does well in giving the film a great southern Gothic vibe as well as an oppressing atmosphere of dread. The cast holds their own too. Ronny Cox (of Deliverance fame) and Bibi Besch do solid performances as the understandably troubled parents of our title character. Paul Clemens is also good, and strangely alluring, as the teen with the savage side. Supporting performances from Don Gordon, R.G. Armstrong, Katherine Moffat, and L.Q. Jones are good too. The Beast Within is one under praised horror film. So what if there's a few plot holes, so what if it doesn't follow the book it's based on to the letter - it's a truly memorable horror ride that never has a dull moment. Check it out creature feature fans. *** 1/2 out of ****",
         "Bibi Besch is raped by a monster on a Southern road,and 17 years later,her son(very convincing Paul Clemens)begins showing signs of change.Pretty soon,he's rampaging through a small town of Nioba killing people,and(in an excellent transformation scene)changing into a slimy fanged beast.The acting is great,the music is really spooky,and the special effects by Thomas R.Burman(\"Prophecy\",\"Invasion of the Body Snatchers\")are simply outstanding.Tom Holland(\"Fright Night\")wrote the screenplay from an Edward Levy novel.Director Philippe Mora creates a fair amount of suspense and atmosphere,and there's enough gore and violence to satisfy all the gore hounds.So if you like horror genre,check out this gory shocker.Cult classic indeed!",
         "**SPOILERS** The biggest problem with THE BEAST WITHIN is that about a third of the story appears to be missing. There seems to be an entire subplot about the man/thing who rapes Bibi Besch in the opening of the movie that is just not there. I have heard rumors over the years that an entire reel of the negative was lost or destroyed before post-production began, and they did not have the money to re-shoot the lost footage. If this is true, it explains a lot. One night in the late fifties, a young newlywed couple (Besch, Ronny Cox) get stuck on the side of the road. Cox runs for help, while Besch senses that someones lurking in the woods, so, naturally, she goes to investigate. A monstrous humanoid creature appears and rapes her. Seventeen years later... Cox and Besch have a seventeen year old son (Paul Clemens) who is suffering from some mysterious illness. Knowing that there's a real chance the father is Besch's attacker from years earlier, they go to the small Southern town they were passing through to investigate, hoping the key to curing Clemens may lie there. They venture to the town, but Clemens follows them, and starts picking off men who knew the man/thing that raped Besch. As best I can figure, the guy (\"Billy\") was so rotten and evil that he eventually turned into a monster, sort of a giant cicada. His buddies locked him up, but he escaped and raped Besch. Now seventeen years later (get it?...seventeen years?...cicadas?...no neither do I), he has come back in the form of Besch and Cox's son, apparently to seek revenge for being locked up in that musty old basement. This may have made sense at some point, but it sure doesn't anymore. There's a lot of Southern Gothic mumbo jumbo, and people repeatedly mention cicadas. The one thing they don't talk about is exactly WHY \"Billy\" turned into a cicada in the first place, or exactly why he's p***ed off at all these people. I would almost be willing to accept this movie on an existential level, but there's too much exposition pointing at something more going on for that approach to work. However, if you can get past the incoherent plot (or lack thereof), THE BEAST WITHIN is actually a pretty weird little flick. The acting is amusingly overwrought, there's some great, over-the-top music by Les Baxter, and some impressively gruesome gore sequences. The infamous highlight of the movie, though, is the grotesque transformation scene. Clemens lays strapped to a hospital bed, while a dumbfounded group of people stand there like idiots and watch him slowly turn into a monster. His head swells up like a balloon, his tongue grows to an enormous size, his eyeballs grow into huge orbs. It's pretty freaky and genuinely frightening. He then breaks out of the hospital and rapes a local girl, thus starting the whole vicious cycle all over again. The movie ends on a decidedly grim note, with Mom blowing his head off with a shotgun as he tries to kill Dad. The fact that he's not really her son anymore doesn't seem to console her as she breaks down. The sheriff comes walking up carrying the girl, now impregnated by \"Billy\". The end credits unceremoniously roll. It's all pretty nonsensical, but the movie is bizarre enough to hold my attention. If anything, it's a nice reminder of old school horror. It may not be very good, but they just don't make them like this anymore.",
         "I am going to disagree with most of the reviewers in here and say that I found the story to be quite intriguing. Some of it was a little out there but the crux of it ( the town conspiracy ) was quite well done. What wasn't so great was some of the acting and some of the things people do to get themselves in trouble. The film starts off with Ronny Cox and his wife traveling down some lonely Mississippi road in the dead of night. They spin off the road and the front of his car ends up on some moist land. His tires spin and spin but they will not respond. The car is stuck there. Now instead of A) trying to push the car out or B) both of them walking back to the gas station for a tow, Cox tells his wife that he is going back to that gas station for a tow. He playfully tells her to stay there and to lock the door ( he says it as though nothing bad could have ever happened on the side of the road in Mississippi. Does anyone ever remember MISSISSIPPI BURNING?) Okay, we have all seen too many horror movies but that is just dumb, horror movie or not. You never leave someone alone, on a deserted road while you are surrounded by the dense bush. Anything could happen. Bigfoot could jump out. Jason could be close by. The thing from THE PREY could pop and get you or more realistically you would just be too afraid to stay by yourself because it is dark. But she does and of course something attacks her and rapes her and then the film jumps ahead 17 years where of course she had the baby. This is another part when we all go \" Oh Come ON!!! What are you, stupid?\" If some big disgusting swamp thing with calves the size of the Caveman in Scooby Doo episodes raped you, you get an abortion, right away. But again, this is a horror movie and people have to do stupid things to get themselves into the prediciments that they are in. If you can get past some of this sheer idiocy, the rest of the story is quite good. It is not on par with some of the greats but it is a worthy addition to the early 80's horror. One by one, the slimy town folk are being attacked and devoured by a beast. Now we don't know why these people are being stalked, only that they are suspect looking to say the least. There is obviously some town secret that is being swept under the proverbial rug and these people are the main culprits. The final thirty minutes is quite good. I can remember being about 13 when me and my friends rented this film for the first time. We accepted the challenge on the front of the box where it dares you to watch the last thirty minutes without chickening out. And when you are 13 and are challenged like that, you eagerly accept. None of us were horrified but we sure thought it was cool. Now that I have more of an appreciation for horror and the effects that go into it, I have to say that the creature effects were astonishing here. Rick Baker would be proud of Thomas Burman. This is on par with Baker's work in AMERICAN WEREWOLF IN LONDON. The transformation scene is truly a work of art. Perhaps people will say that it is dated because now a days they use computer graphics to make everything look real but let me tell you, give me guys like Rick Baker, Stan Winston and Thomas Burman and I would rather watch them at work than a chip and a computer program that does the same thing. This is fun to watch and I believe more work and innovation goes into the process. I would give this film a 6 out of 10. The story is intriguing and the plot is carried out quite well. And look at it this way. Take most horror films from today like URBAN LEGEND, I KNOW WHAT YOU DID..... and so on and compare them to this one and others like it from the 70's and early 80's. Most 90's films can't hold the director's Cole's Notes to how to make an affective horror film. The Beast Within is better than 95% of the horror that was released in the 90's. It is getting better now with stellar efforts like FINAL DESTINATION, BLAIR WITH, SIXTH SENSE, STIR OF ECHOES and even STIGMATA. Their roots lie with films like this.",
         "Woo-hoo! This freaky puppy needs to go on a leash! The Beast Within is highly entertaining 80's pulp that regretfully got ignored over the years, along with so many other B-movie goodies from that decade like \"Dead & Buried\", \"Basket Case\" or \"From Beyond\". I hope that too many people won't be biased about the gory, cheap looks of this film, because it actually has got more to offer than you'd think! The Beast Within fits perfectly in the \"the little town with a secret\"-sub genre that I personally adore. The screenplay (written by Tom Holland of \"Fright Night\" and \"Child's Play\") handles about a newlywed couple facing a nightmare when the wife is raped by a hideous creature on a remote Mississippi road. The \"miracle of life\" takes place and 17 years later, the progeny of this unpleasant meeting begins to undergo a bizarre metamorphosis. The adolescent Michael is aggressive, weak and goes prowling overnight. The victims of these nightly hunts all share a common secret that slowly unravels itself and leads all the way back to the night of the rape. The plot contains quite some holes (big ones!) and logicalness is totally out of the question! Hopefully, you'll be able to look passed these flaws and see how director Mora attempts to add tension and atmosphere to his film. The obvious aspect to love naturally is the blood and gore! The Beast Within features an infamous and nearly classic transformation and this scene alone makes the film worthy. A catchy (country) soundtrack and fairly good acting complete my overall positive opinion on this overlooked cult gem. Ronny Cox is quite convincing as the \"official\" father but it surely is the young actor Paul Clemens himself who impresses. His ultra-mad grimaces while attacking the hillbillies form the best parts of the film.",
         "\"The Beast Within\" is a highly amusing, over-the-top, endearingly senseless combination of a monster movie with a \"Bad Day at Black Rock\" type of story. Future director Tom Holland supplies the story for these macabre theatrics. A couple honeymooning in 1964 have car trouble after which the new wife is raped by a humanoid thing. 17 years later, and the now teen aged product of that rape is going through some pretty ugly growing pains, periodically killing and eventually transforming into a monster himself. Adding to the melodrama is the back story of that long ago rapist's pitiful existence and a cover up that had been engineered by the bigwigs of the local small Mississippi town. Many things come together in this movie that makes up in panache what it may lack in any sort of logic. It's just oozing with foul and sordid backwoods atmosphere, and the makeup effects and gore courtesy of Tom Burman are well worth a look; the climactic transformation that is trumpeted so proudly in the theatrical trailer can't compare to the likes of what we saw in \"The Howling\" or \"An American Werewolf in London\", but it's not bad either. It's only the final monster incarnation that disappoints, as it's obviously a man in a clunky, none too convincing costume. Still, monster movie lovers such as this reviewer can still delight in a fun little movie that does things in such an old-fashioned way. The score by A.I.P. pro Les Baxter is full of doom, and the movie looks just great in the 2.35:1 aspect ratio. Philippe Mora directs with efficiency; he was hired for this project based on his direction of the 1976 favourite \"Mad Dog Morgan\". A rock solid cast treats the insane material with gravity; Ronny Cox and Bibi Besch are the perplexed, truth seeking parents, and Paul Clemens the tormented teen. Clemens really gives his all in what is truly a wild role. Excellent character actors also help, including Don Gordon, who erupts into a scenery devouring frenzy before the picture concludes, R.G. Armstrong, L.Q. Jones, Logan Ramsey, John Dennis Johnston (playing the role of a stereotypical hostile redneck to the hilt), Ron Soble, Luke Askew, and Meshach Taylor. Co-star Katherine \"Kitty\" Moffat is a lovely and appealing gal in the part of the love interest. An overlooked and under appreciated flick as far as 80's horror goes, \"The Beast Within\" is deserving of cult status - simply put, it's trash at its finest. You can just turn your brain off and enjoy the lurid thrills, which it delivers for a well paced 99 minutes of mayhem. Eight out of 10.",
         "The changing into a monster of a young man is used as a metaphor for boys growing into men. The body goes through changes and urges become more primal. Suddenly playing center field for your baseball team is less alluring than chasing skirts. THE BEAST WITHIN perfectly captures this sentiment. The film focuses on teenage Michael (Paul Clemens) who has an illness that the doctors can't identify. It seems that young Michael is changing into a beast--one that resembles a humanoid creature that sexually assaulted his mother seventeen years ago. His parents, played by Ronny Cox and Bibi Besch, try to learn more about what happened seventeen years ago and venture to the town where she was raped by the monster: a sleepy, backwoods Mississippi community. They leave Michael at the hospital but he breaks out and some urge lures him to the small town his parents are visiting. While in this small Mississippi hamlet, Michael begins to succumb to urges: eating flesh and chasing the local hotty (Kitty Moffat). But these urges aren't your normal teenage male pursuits and Michael fears for Amanda's (Moffat) safety when he learns that members of her family are being targeted by a serial killer--the beast within. STORY: $$$ (The story is quite interesting. We get a nice little isolated setting with eccentric hillbilly characters who all seem to harbor a dark secret. Cox and Besch as the concerned parents try their hardest to uncover the secrets so they can save their child. The script builds enough suspense to sustain interest but the falling down of females in the woods seems a bit foolish. Bibi runs into a tree and Kitty looses her bearings too easily). ACTING: $$$$ (A helluva lot better than you see in the usual B-Rate film. Clemens is terrific as young Michael. His scenes where his body changes are brilliant displays of acting. He masterfully portrays agony. L.Q. Jones shines as the town sheriff, Mike's parents only real ally in the backwoods community. The underrated Ronny Cox is great as Mike's dad. He knows that Michael isn't his son but still shows him the amount of love he'd show a boy direct from his loins. Don Gordon and John Dennis Johnston are effectively slimy as backwoods villains and Kitty Moffat is solid in the role of Michael's forbidden fruit. But the best piece of acting belongs to Bibi Besch. There's little for her to do in the script but Bibi gets more out of this character than most actresses could extract. There's a scene, in which Miss Besch has no dialogue, where she learns that her son is becoming something akin to the monster that raped her years ago. Bibi exhibits such raw emotion in the scene that you, the viewer, know exactly what is going through her mind without her having to say a word. Give Bibi a standing ovation). NUDITY: $$$ (What would be a movie about teen lust without a little titillation? Bibi is stripped bare in the woods by a monster at the beginning of the film while Kitty Moffat suffers the same treatment at the close of the film. Creepy morgue attendant Luke Askew also spends some time ogling a buxom dead body in his morgue)."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Katzka"],
      "summaries": ["In the beginning of the movie you see a woman getting raped by a man-creature of some sort. The movie takes place years later when the child that was a result of that rape is on the rampage looking for a girl to rape to start the process all over again."],
      "budget": 0
   },
   "movielensId": 5925,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-01-01",
      "dvdReleaseDate": "2007-09-11",
      "directors": ["Philippe Mora"],
      "runtime": 98,
      "movieId": 5925,
      "title": "The Beast Within",
      "mpaa": "",
      "actors": [
         "Ronny Cox",
         "Bibi Besch",
         "Paul Clemens",
         "R.G. Armstrong",
         "L.Q. Jones",
         "Don Gordon",
         "Katherine Moffat",
         "Logan Ramsey",
         "John Dennis Johnston",
         "Ron Soble",
         "Luke Askew",
         "Meshach Taylor"
      ],
      "imdbMovieId": "0083629",
      "originalTitle": "The Beast Within",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["kPsbf3cAB8s"],
      "plotSummary": "In the beginning of the movie you see a woman getting raped by a man-creature of some sort. The movie takes place years later when the child that was a result of that rape is on the rampage looking for a girl to rape to start the process all over again.",
      "tmdbMovieId": 40219,
      "avgRating": 2.36719,
      "releaseYear": "1982",
      "numRatings": 64,
      "posterPath": "/bnoThpfg26xVDdL0h4gUA9yxXIv.jpg"
   }
}