{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0940620",
      "video": false,
      "title": "Patti Smith: Dream of Life",
      "recommendations": [
         54464,
         17605,
         109192,
         14654
      ],
      "backdrop_path": "/u660PdOS5mcB7YJQFjE9lR6mqFF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4443c3a368484e0190d3",
               "name": "Patti Smith",
               "profile_path": "/sHYdAAE8IKDQtZnjk9lwekysjlu.jpg",
               "id": 56200,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4443c3a368484e0190ef",
               "name": "Jay Dee Daugherty",
               "profile_path": null,
               "id": 95336,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4443c3a368484e0190f3",
               "name": "Flea",
               "profile_path": "/3mvSPp8RpuuPJUuNwq9PyjFu2Ug.jpg",
               "id": 1237,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4443c3a368484e0190f7",
               "name": "Philip Glass",
               "profile_path": "/5xhnji5hjwJHbWer6nwjFdM9GAB.jpg",
               "id": 1551,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4443c3a368484e0190fb",
               "name": "Lenny Kaye",
               "profile_path": null,
               "id": 95337,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4443c3a368484e0190ff",
               "name": "Sam Shepard",
               "profile_path": "/6KincXfDKVQaRHwtX6qMUAwOsR0.jpg",
               "id": 9880,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4443c3a368484e019103",
               "name": "Benjamin Smoke",
               "profile_path": null,
               "id": 95338,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4443c3a368484e019107",
               "name": "Michael Stipe",
               "profile_path": "/dF5PVRN0kAz1XK4zCP2jE5HVgDj.jpg",
               "id": 6957,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4443c3a368484e01910b",
               "name": "Tom Verlaine",
               "profile_path": null,
               "id": 95339,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4443c3a368484e01910f",
               "name": "Bob Dylan",
               "profile_path": "/ubCLNwXh9Nv3EHkOkdeVbXMZa5P.jpg",
               "id": 1487,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4443c3a368484e0190c9",
               "name": "Steven Sebring",
               "profile_path": null,
               "id": 88874,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4443c3a368484e0190cf",
               "name": "Steven Sebring",
               "profile_path": null,
               "id": 88874,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e0190d9",
               "name": "Phillip Hunt",
               "profile_path": null,
               "id": 95333,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4443c3a368484e0190df",
               "name": "Steven Sebring",
               "profile_path": null,
               "id": 88874,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e0190e5",
               "name": "Angelo Corrao",
               "profile_path": null,
               "id": 95334,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4443c3a368484e0190eb",
               "name": "Lin Polito",
               "profile_path": null,
               "id": 95335,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 1.203846,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22498,
      "vote_count": 8,
      "budget": 0,
      "overview": "An intimate portrait of poet, painter, musician and singer Patti Smith that mirrors the essence of the artist herself.",
      "similar": [],
      "original_title": "Patti Smith: Dream of Life",
      "runtime": 109,
      "poster_path": "/qBlBhhFMvZIFwRozmkHIfYYmsCG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Clean Socks",
         "id": 4102,
         "origin_country": ""
      }],
      "release_date": "2008-01-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Sebring"],
      "runtime": 109,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0940620/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3MDA0NDExNl5BMl5BanBnXkFtZTcwNTY5OTg5MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Patti Smith, Lenny Kaye, Oliver Ray | See full cast and crew »"],
      "reviews": [
         "Thin, long-faced, androgynous, stringy-haired, dressed in skinny pants, coat, dangling tie, she is unmistakable, made famous by her own achievements as poet, painter, singer, musician, and activist and her close friend the late Robert Maplethorpe's iconic photo-portraits. Her music is and was a distinctive fusion of punk rock and spoken poetry. This film, created with an art installation and photography book, is the product of her 12-year collaboration with director Steven Sebring, and it is dominated by her own voice and vision, her sense of poetry, her wry warmth, elegance, and taste. She's a sweet, kind person, as we see her, who's suffered and been redeemed by significant personal loss. She particularly describes how the unexpected death of her younger brother has given her a larger, warmer heart, because it has been filled with him. The value of Smith's kinship with Blake and Rimbaud sinks in as she depicts herself in an ongoing cloud of quiet words. This is a public figure who emerges as a deeply authentic private person. The film, mostly in evocative and beautiful but not arty black and white, cunningly but not logically edited, is meandering, equally strong in its depiction of personal talismanic objects and treasured people, but despite beginning with Smith's recitation of a series of personal milestones and dates, it's deliberately vague about denoting times and places--reminding one of the famous passage from Henry Green's 'Pack My Bag' that goes: \"Prose is not to be read aloud but to oneself alone at night... it should be a long intimacy between strangers... it should slowly appeal to feelings unexpressed, it should in the end draw tears out of the stone.\" Smith and Sebring seem to know that to speak to us as poetry, her life need not be hung on a list of names and dates. Dream of Life then is a film appealing to the open-minded and indulgent, unlikely to win over outsiders or skeptics. Despite its many beauties, it's rather a pity it can't serve as a more informative introduction to the woman and her work. Since she believes in reserve, but also in ruthless candor, Smith reveals that she has always had to get other people to tune her guitar. Sam Shepherd, whom she first met as a drummer, finds her playing ragged when they play a rather superfluous impromptu duet. She seems important as a poetic voice, not a musician or singer. This film, singing its own song, not cajoling, is full of the palimpsest pleasures of a layered life and likely to reward repeated viewings. Patti Smith seems most convincing to this respectful non-devotee as a figure, an \"icon,\" who was central to her times, friend of William Burroughs and Allan Ginzberg and Gregory Corso as well as Maplethorpe, a cult figure who has toured with Bob Dylan, a bereaved wife and mother who has taken long sabbaticals from her public career to immerse herself in living, a woman with dear siblings and sweet parents from a happy childhood. A woman whose son and daughter are hard to tell apart from her, who pays tender homage on screen to the tombs of Blake and Rimbeau with caressing hands on the marble and use of her ever-present Polaroid camera. From seemingly humble south Jersey origins, she grew up loving books and worshiping at the font of poets like Shelley and Whitman. After her remarkable relationship with Maplethorpe she went to live in Michigan with her husband Fred \"Sonic\" Smith, then when he died returned to poetry and music and activism in New York in 1994. As Andrew O'Hehir points out in his Salon review, she \"is perhaps the only major surviving link from the beat era to the '70s Manhattan art scene to the birth of punk to the present.\" She has evidently done this through her own special calm and integrity and keen instinct. Now 61, living in the Chelsea Hotel, still vibrant and active and herself, she is most impressive in a passionate, deeply angry reading of the American Declaration of Independence, which merges into a ferocious indictment of George W. Bush, the most succinct yet complete and powerful one I have ever heard. A truly amazing and astonishingly winning lady. Her influences has been enormous, and her words are often wise. \"In art and dream may you proceed with abandon. In life may you proceed with balance and stealth.\" Famously, from her first album, the opening words: \"Jesus died for somebody's sins, but not mine. . .My sins my own/They belong to me....\"",
         "PATTI SMITH: DREAM OF LIFE is a free-floating ramble through the life of one of America's premiere poets. The time sequences are hazy, her children appear and reappear at dramatically different ages, and this only adds to the visionary quality of the film. This is the farthest one could imagine from the standard Rock Bio that one might see on VH1. The Patti Smith of today seems just as interesting and dynamic as the artist who created HORSES many years ago. She is among the few contemporary artists who manage to connect the Beatnik sensibility of the late 50's and the rock and roll music of today's social and political activists. Hopefully, this film will spread her musical and poetic influence to people who may not be aware of her compelling aesthetic vision.",
         "\"Patti Smith: Dream Of Life\" was a film I saw at the 11th Annual Maine International Film Festival on July 16, 2008. This film will without a doubt appeal mostly to Patti Smith fans. Those who don't know that much about her, and want to find out more, may want to buy one of her earlier albums (such as \"Horses\") or read about her on the Internet first. I say this only because the parts of this documentary when we hear Patti Smith in her own words are very well done, and at many times artistic. However, the movie loses its momentum within the second part when the director seems to be only interested in how Smith acts backstage. This latter subject takes up approximately 60% of this 109 minute movie, and it had me checking my watch constantly as I sat in the theater. For the record, I have heard some of Patti Smith's records and generally like her music, but I don't count myself a big fan of hers which may be why I found myself bored through some of the movie. Truth be told, she is probably one of the most devoted musicians of the last 40 years, not to mention the most devoted and spirited female artist. She may not have a following as big as Bob Dylan or the Rolling Stones, but she has influenced countless alternative bands including R.E.M., Marilyn Manson, Red Hot Chili Peppers, Talking Heads, and other influential artists. In regards to this documentary, the parts that truly shine are when Patti Smith speaks to the audience and recounts her influences, which include various poets not to mention Bob Dylan. I also liked some of the backstage footage of her interacting with her bandmates and even sometimes with her children. For such a musical legend, she is very personable and incredibly down to earth. She also is well aware of where she came from, as evidenced from the interesting part of the documentary where she visits her parents. There are other great gems in this documentary, such as when she makes a live tirade against President George W. Bush. After hearing that speech, it made me wish that more antiwar protesters were that spirited. You'll notice that so far, I've given Patti Smith a lot of compliments, all of which are well deserved. This documentary did her justice, and I will give it credit for that. However, it was just too unfocused for me, and those great moments were just thrown in there with a whole lot of rubble. The film could have truly benefited with some better editing and more finite organization. As a result, by the second half of the film, the momentum is completely lost and the film just drags. It appeared that the filmmakers didn't know whether they wanted to make a true portrait of an artist or a concert feature. If they wanted to make a concert feature, they could have taken a hint from Martin Scorsese, who directed such great concert films as \"The Last Waltz\" and \"Shine A Light\". A concert feature wouldn't have been a bad idea either. Patti Smith fans would have enjoyed it, and those who aren't familiar with her work would be introduced to her great songs, energetic stage presence, and appealing personality. If the filmmakers had any inclination on a focal point to base this documentary around, it would have made for a far more energetic take on the first true alternative artist. With all that said, it's difficult for me to recommend this picture. Die-hard Patti Smith fans may like it, but better editing would have brought this documentary to greater heights.",
         "Patti Smith has always been an astonishingly iconoclastic, performing and visual artist. She's always been the most influential woman, in the Punk rock world. She really helped kick-start this exciting new genre of music, when it was still just a fringe element of the rock scene, in the mid-70s. Patti also single-handedly crafted a bold new image, of the female rock performer during the 70s. She startled the rock world with her unapologetic, devil-may-care androgynous style. Patti was the first woman in rock, to completely eschew glamor. Her clothes and shoes that she wears, have always been scruffy and disheveled. Her hair is scraggly, and she has a long, homely face. She is the complete personification, of what Punk rock is all about-brash, gritty, daring, and wickedly avant-guard. This documentary highlights Patti's exceptional achievements as a visual artist, poet, and Punk rock icon. Her personal life is completely laid open for the viewer. Patti is shown at her childhood home in a humble working class neighborhood, visiting her parents. Patti's two children also appear in this film, and she shows how proud she is of her family. The viewer plainly realizes that instead of being a decadent rock star, Patti Smith is a warm, caring, and sharply intelligent human being. This film has an arty visual style, which dovetails perfectly, with Patti Smith's status as a dedicated artist and performer. At times, the film drags on a bit. And there's a morose quality, underlying the film too. This factor is brought on mainly by Patti's intense focus, on the deaths of her spouse Fred, brother Todd, and friend Robert Mapplethorpe. It was obviously cathartic for Patti to discuss the sense of anguish that she feels, about the deaths of those she cared deeply about. That in itself is positive, but it dominated the film a bit too much. For those who are not yet familiar with Patti Smith, seeing this film is a good way to acquaint yourself with her, and her legendary accomplishments as an artist/musician. Now in her early 60s, Patti Smith still reigns supreme, as the Godmother of Punk rock.",
         "Patti Smith is the embodiment of what a true artist is. Beautifully shot filled with poetry, ideas, music and life. I do have to say that it drags just a little bit on the second half and that Patti can also sound a tad pretentious, but what really shines is her humanity and her internal world of intricate emotion and rationality. I personally could listen to her read her poems for hours and just feel inspired. The film is also quite touching and heartfelt. She is still as relevant today as she was in the 70s. I saw her live two years ago when she came to Portugal e it was life changing. Such raw power and commitment to her art. This is also a very American documentary in the truest essence of what i feel America really is: the ancient power of the land that washes over brilliant artists and shines through them I am a true fan of Patti's so i'm not sure if the casual viewer would love it as much as me, but all of us who want to be artists should see. Also great passionate speech against Bush.",
         "Patti Smith: Dream of Life is a frankly disappointing documentary which gives little real insight into its subject. Made by Patti Smith herself, the film tends to gloss over large sections of her life, without giving viewers an understanding of their significance. Even more annoyingly, given that its musical focus, it is largely lacking in concert footage. For example, although the film mentions Smith's friendship with Robert Mapplethorpe, it fails to delve into what influence he might have had on Smith's artistry. Given that this case represented two of the major artists of the twentieth century living together, one would have thought this would merit a sustained discussion. The lack of musical footage is also glaring. In the end, we are interested in Smith not because of her life or opinions, but because of her music. That should have been a far greater element within the piece. Ultimately, those who want to learn more about Patti Smith would be better off seeking out her memoir, or finding a good interview with her.",
         "While this is not a perfect documentary, it IS a nice insight into all the spaces of Patti Smith's life, as others have said, we see her as performer, mom, daughter, friend... just being herself. She's amazingly candid and gentle, hard to believe such a quiet soul is so wild, angry and volatile on stage!!!! I saw the film at the Karlovy Vary Film Festival in the Czech Republic, a place Patti often plays since her one-time band member and collaborator, Ivan Kral is Czech. Audience seemed to have a mixed reaction, not sure all were familiar with her work. *****SPOILER BELOW ******** The film is full of poetry, hers and others.. and ends with a quote I know so well I couldn't help mouthing as she said it... \".. Peace peace he is not dead, he doth not sleep he hath awakened from the dream of life... \" --- Shelley, Adonais -- a poem that has a rock and roll connection as Mick Jagger read it a Brian Jones' funeral. and of course contains the title of one of Smith's LP's and the name of this film.. This might be a film just for serious Patti Smith fans, not sure, since I have been a fan since \"Horses\" came out, it's hard for me to say if the non-fan would find the film as interesting, since it does tend to ramble. Hard to believe she's 61... wow.... worth seeing if you are a big fan you will be touched.",
         "This was my first introduction to Patti Smith. I didn't know what to expect of the film. If you are expecting a movie with actors pretending to be someone they aren't, this isn't the movie for you. This is a wonderful documentary about a fascinating person. You won't just see Patti Smith/ Punk Rocker. You'll also see Patti Smith/Mother, Daughter, Activist, Friend, Artist and more. I enjoyed this Documentary very much. 11 years in the making. You can see Patti Smith's children grow before your eye's. This movie was definitely a labor of love. I look forward to the DVD release. Thank you Steven for taking the time to do this documentary right.",
         "It is OK to make a sentimental family movie - but it is not polite to bother other people by distributing it! \"Vanity\" is the word that describes this movie. However, it asks couple of questions: are the artists really incapable of talking about their own work (no, not all of them, I believe)? Second, does Patti Smith really believe that her art will survive her - i.e. human being is mortal, poetry is immortal? Well, her books and Cd's are now on sale for couple of bucks, I am not sure in ten years it will be any better ... And finally, why does she treats herself as the most important thing in the universe ... thanks god for those punk bands that can make fun out of them. Well, if you have not seen this movie, you did not missed much. Play some of Patti Smith CDs instead - any of them is much better to this.",
         "Thank God half of it was out of focus so I was partly spared from being tormented by what can only be described as the biggest \"ego self loving\" horror that has ever be put to film. Steven Sebring despite being in what must be his 30s-40s, is in full \"17 year old film student\" mode here. No connection from scene to scene, void of any true meaning other than 'look at me I can make ambiguous shots!', and his egoistic 'look at how artistic I am' style vomits off the screen into your, what is now, blood soaked eyes. I must stress I am not some philistine complaining that there were not enough explosions, but even a Patti Smith fan I went to see it with fell asleep. Not to mention the 30 or so people (all wearing Patti Smith t-shirts, clothes\u0085 obvious fans) who had no choice but to leave this brutal cinematic molestation (o my how I envied them). DO NOT SEE THIS FILM unless you are some kind of super Patti Smith fan that enjoys psychological torture!"
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Clean Socks",
         "Thirteen / WNET"
      ],
      "summaries": ["An intimate portrait of poet, painter, musician and singer Patti Smith that mirrors the essence of the artist herself."],
      "budget": 0
   },
   "movielensId": 59655,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-01-01",
      "dvdReleaseDate": null,
      "directors": ["Steven Sebring"],
      "runtime": 109,
      "movieId": 59655,
      "title": "Patti Smith: Dream of Life",
      "mpaa": "",
      "actors": [
         "Patti Smith",
         "Jay Dee Daugherty",
         "Flea",
         "Philip Glass",
         "Lenny Kaye",
         "Sam Shepard",
         "Benjamin Smoke",
         "Michael Stipe",
         "Tom Verlaine",
         "Bob Dylan"
      ],
      "imdbMovieId": "0940620",
      "originalTitle": "Patti Smith: Dream of Life",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An intimate portrait of poet, painter, musician and singer Patti Smith that mirrors the essence of the artist herself.",
      "tmdbMovieId": 22498,
      "avgRating": 2.9375,
      "releaseYear": "2008",
      "numRatings": 16,
      "posterPath": "/qBlBhhFMvZIFwRozmkHIfYYmsCG.jpg"
   }
}