{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "classic noir",
            "id": 155436
         }
      ],
      "imdb_id": "tt0049414",
      "video": false,
      "title": "A Kiss Before Dying",
      "recommendations": [
         3422,
         27999,
         61908,
         38395,
         29477,
         12578,
         35023,
         50669,
         27035,
         61095,
         43046,
         76121,
         45247,
         74753,
         60938,
         65777,
         53714,
         25672,
         37315,
         37380
      ],
      "backdrop_path": "/ryJ1hXGLjuS1kjsDj5j4BN3VnZg.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5a0fec7f92514138e4024bc7",
         "content": "Love conquers all...\r\n\r\nA Kiss Before Dying is directed by Gerd Oswald and adapted to screenplay by Lawrence Roman from the novel of the same name written by Ira Levin. It stars Robert Wagner, Joanne Woodward, Virginia Leith, Jeffrey Hunter and Mary Astor. A CinemaScope/De Luxe Color production, music is by Lionel Newman and cinematography by Lucien Ballard.\r\n\r\nPlot basically finds Wagner as a scheming pretty boy willing to commit murder in order to reach the riches of an inheritance. Story bubbles away nicely as Bud Corlis (Wagner) and Dorothy Kingship (Woodward), he sly and distant - she vulnerable and love struck, both hold court with performances of merit. The spiky edge comes by way of knowing what Bud is up to, and that poor Dorothy is completely oblivious, and when the key moment comes, it's shocking and really perches ones expectation levels to the edge of the seat.\r\n\r\nSadly the second half of the movie doesn't quite live up to the promise of the first, for here the focus shifts from a twist into an investigation by Dorothy's sister, Ellen (Leith), who refuses to accept the official party line surrounding her sister. It's all very competently mounted, but the pervading sense of menace has dissipated and in place is just an average murder mystery.\r\n\r\nWagner and Woodward are very good, Leith not so much, while Hunter as a pipe smoking professor is badly miscast and Astor is under used. Oswald's direction is fine, with some nifty long takes and some very cheeky visual jokes that only become apparent once story has run its course. Ballard's Scope photography is impressive, managing to make the bright colourful city surrounds always appear as threatening, and Newman's musical arrangements are indicative of the murder mystery splinter of 50s film noir.\r\n\r\nThe themes at the core of the picture are daring and interesting, though more should have been made of the hinted at fact that Bud is a troubled war veteran. It's not all that it can be, the second half diluting the whole as it were, but this is still a tasty noir thriller worthy of catching. 7/10",
         "url": "https://www.themoviedb.org/review/5a0fec7f92514138e4024bc7"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1003,
               "character": "Bud Corliss",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f81683fd",
               "name": "Robert Wagner",
               "profile_path": "/nlRWGpsQPo8sSFdl8larlPUy1rS.jpg",
               "id": 9208,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Gordon Grant",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168401",
               "name": "Jeffrey Hunter",
               "profile_path": "/rK5yovSBl25ginB2wiYLwLw0eGF.jpg",
               "id": 30551,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "Ellen Kingship",
               "gender": 1,
               "credit_id": "52fe4876c3a36847f8168405",
               "name": "Virginia Leith",
               "profile_path": "/1QLn1rgPuKQqa79lQpKZvjXNLb1.jpg",
               "id": 110727,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Dorothy ('Dorie') Kingship",
               "gender": 1,
               "credit_id": "52fe4876c3a36847f8168409",
               "name": "Joanne Woodward",
               "profile_path": "/8a500O203jN1IHFZVAPwVUyAHUZ.jpg",
               "id": 109410,
               "order": 3
            },
            {
               "cast_id": 1007,
               "character": "Mrs. Corliss",
               "gender": 1,
               "credit_id": "52fe4876c3a36847f816840d",
               "name": "Mary Astor",
               "profile_path": "/w1KLRK5J5SRXkqONL9WS8exhKgp.jpg",
               "id": 13992,
               "order": 4
            },
            {
               "cast_id": 1008,
               "character": "Leo Kingship",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168411",
               "name": "George Macready",
               "profile_path": "/t1xXYLfj7KSn2YQ3cKJ4V5ZYoQV.jpg",
               "id": 14564,
               "order": 5
            },
            {
               "cast_id": 1009,
               "character": "Dwight Powell",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168415",
               "name": "Robert Quarry",
               "profile_path": "/lr88ZEjDtRCvIz2iuNhWKyUgRcr.jpg",
               "id": 82830,
               "order": 6
            },
            {
               "cast_id": 1010,
               "character": "Howard Chesser, Chief of Police",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168419",
               "name": "Howard Petrie",
               "profile_path": "/u4NvUHS6ju87Fv3ugnY5C6d9kd4.jpg",
               "id": 148742,
               "order": 7
            },
            {
               "cast_id": 1013,
               "character": "Annabelle Koch",
               "gender": 0,
               "credit_id": "5433f4060e0a2659150081d0",
               "name": "Molly McCart",
               "profile_path": null,
               "id": 1142861,
               "order": 9
            },
            {
               "cast_id": 1014,
               "character": "Medical Student",
               "gender": 0,
               "credit_id": "5433f4150e0a2659150081d7",
               "name": "Marlene Felton",
               "profile_path": null,
               "id": 935642,
               "order": 10
            },
            {
               "cast_id": 1015,
               "character": "Bill, the Butler",
               "gender": 2,
               "credit_id": "57aa00e1925141383f007030",
               "name": "Bill Walker",
               "profile_path": "/yHmvPGkSWsvnTTLYRDljb2WXF5H.jpg",
               "id": 103107,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4876c3a36847f81683f3",
               "name": "Ira Levin",
               "profile_path": null,
               "id": 13019,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4876c3a36847f81683f9",
               "name": "Lawrence Roman",
               "profile_path": null,
               "id": 70682,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4876c3a36847f816841f",
               "name": "Gerd Oswald",
               "profile_path": null,
               "id": 8626,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5ac389b3c3a368443f076a66",
               "name": "Lucien Ballard",
               "profile_path": null,
               "id": 3351,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ac389ba0e0a260c140369dc",
               "name": "George A. Gittens",
               "profile_path": null,
               "id": 114327,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5ac389c3c3a3682d1a03435d",
               "name": "Lionel Newman",
               "profile_path": null,
               "id": 11441,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5ac389d0c3a3682db50365af",
               "name": "Robert L. Jacks",
               "profile_path": null,
               "id": 48964,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.33764,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53712,
      "vote_count": 16,
      "budget": 0,
      "overview": "Bud Corliss (Wagner) is an ambitious student who is wooing Dorothy Kingship (Woodward) purely for her father's mining fortune. When he discovers that Dorothy is pregnant with his child, he realizes she is quite likely to be disinherited by her wealthy family. He assures Dorothy that he'll take care of her, yet he hesitates when Dorothy insists on marrying. Bud then murders Dorothy and stages it in a way that it appears to be a suicide. He then reaches out to her sister Ellen (Leith) with the hopes of marrying her in order to ingratiate himself with her father. After a couple of months Ellen finds evidence to question the suicide verdict, and then discovers Bud knew Dorothy. Ellen struggles to avenge her sister and save her own life.",
      "similar": [
         15069,
         984,
         8090,
         807,
         4771,
         75780,
         1939,
         357096,
         445954,
         21484,
         10651,
         11423,
         2749,
         18587,
         26390,
         37645,
         12150,
         369300,
         1586,
         2832
      ],
      "original_title": "A Kiss Before Dying",
      "runtime": 94,
      "poster_path": "/4vap0guvlafQRBGDWKw4kWoeWWl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Crown International Pictures",
         "id": 1009,
         "origin_country": ""
      }],
      "release_date": "1956-06-12",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "He had looks, charm... and killer instincts.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gerd Oswald"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Lawrence Roman",
         "Ira Levin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049414/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczODk2OTgyMF5BMl5BanBnXkFtZTcwNjc4ODg0NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Wagner, Jeffrey Hunter, Virginia Leith | See full cast and crew »"],
      "reviews": [
         "This is a beautifully photographed, in CinemaScope and Deluxe Color, hauntingly scored, gripping thriller, with four lead actors who were, curiously, 20th Century Fox contract players, yet the film was released by United Artists. Robert Wagner gives the performance of a lifetime as the coolly handsome psychopath who loves his mother (Mary Astor) and money. In a framework similar to \"Psycho\" (1960), there's a long prologue featuring a sweet blonde (Joanne Woodward) who gets \"into trouble\" and has to meet an early demise. Her chic, savvy sister (Virginia Leith), with some help from a great-looking professor (Jeffrey Hunter) searches for a killer, almost gets done in herself in a suspenseful climax. \"Psycho\" similarities include two sisters, a handsome psycho, an even handsomer hero, a mother, two murders. 1950s style icons (still quite retro today) are seen in startling abundance here: shiny red convertibles, college sweaters, slinky theme song, swoop skirts, the jukebox, poodle haircuts, greasy kids stuff hairstyles, etc. Woodward is wonderful and tragic as the first sister, Hunter offers able support, George MacCready is sturdy as the girls' father, while Astor, in a handful of scenes, conveys a true picture of a slightly slatternly, doting mother. The stunning Leith basically carries the last half of the picture and acquits herself well; she never really got her due in films, but is seen in the best advantage here. Also, this movie can be seen as a companion piece to the 1950s Italy set \"The Talented Mr. Ripley\" (1999). Chilling, very well-presented.",
         "Robert Wagner as a psychopathic killer, Jeffrey Hunter as a math teacher/cop, Joanne Woodward as a clinging dishrag, Virginia Leith as a sexy prospective victim and Mary Astor as a dowdy mom? It's so strange I began to wonder if it was some kind of demented masterpiece. It starts with perky titles promising a silly romantic comedy, then has a long dialogue scene between Bob and Joanne all in one take, a tumble by a pregnant woman that *doesn't* result in a miscarriage (surely a movie first), and indescribably odd moments like a sixtyish woman in a see-through blouse sashaying through an intense dialogue scene that pauses to honor her passing, and a postal clerk whose delicate cough serves as a Pinteresque interruption to an otherwise inconsequential line. It was Gerd Oswald's first movie and as far as I can tell he never did anything of note after-wards, but he might have been an Ed Wood buried under a studio budget. It's on DVD and should be seen in its original Cinemascope glory.",
         "Gerd Oswald's excellent film was his first and perhaps his best, as well as arguably providing Robert Wagner's finest hour. Like Tony Curtis was to do a decade later in The Boston Strangler (1968), screen pretty-boy Wagner took the role of the cunning sociopath Bud Corliss partly in an attempt to prove he could act darker parts than his fans had been used to. Taken from a novel by Ira Lewin (whose work also inspired Rosemary's Baby, The Stepford Wives and The Boys From Brazil) the film is a well mounted, taut B-movie, albeit shot widescreen in Deluxe Color by no less a talent than Lucien Ballard, who later went on to do sterling work for such directors as Sam Peckinpah. His crisp cinematography reveals a land dressed in bright open colours, where American meritocracy is secure and, on the surface at least, all seems right. As such, it carries echoes of contemporaneous romantic fluff such as Pillow Talk as well as some of the late, luscious films by Douglas Sirk. Watching A Kiss Before Dying however is a wholly different experience from Sirk's ironic stagings of smug Eisenhower society, this despite the presence of a clean-cut, pipe smoking Professor Grant (Jeffrey Hunter). His academic character, perhaps the least convincing in the film, is more of a straightforward stereotype than the German director would ever manage, but acts as a counterweight to Corliss' callous misuse of his own good looks and intelligence. Self-satisfied and entirely free of remorse, the student is thus a much more modern figure than the academic, and his presence undermines Grant's rather ineffectual 1950s' decency. Oswald's minor classic focuses on this cold heart - an individual whose ambition, and eventual downfall, might have found its roots in such earlier films as Ulmer's Ruthless (1948), as well as it anticipates some of Hitchcock's work. Although it is only mentioned briefly, Corliss has obviously been affected by his experience in the war (\"It's my side where I was wounded,\" he says at one point, and one of the first things we see are military photographs.) The implication, typical of noir, is that the conflict has affected his mental state. Corliss is a promising student, who lives alone with his mother (Mary Astor). As the film begins he is learning of the unexpected pregnancy of his girlfriend Dorothy (Joanne Woodward). Despite his outward concerns and pledge to marry the woman, he secretly plots to dispose of her before moving on to her sister Ellen (Virginia Leith). At the same time Ellen suspects that her sister's eventual suicide was not entirely as it seemed and does some investigating with the help of the obliging Grant... As others have noticed, there are certain intriguing similarities between A Kiss Before Dying and the plot of Psycho which came four years later: both films begin with furtive discussion of lovers discussing the implications of illicit sex, go on to feature the premature demise of a blonde and then, in a second half, the investigation of mystery by a determined female relative. There are echoes of Vertigo (1958) too in the dangerous heights of City Hall where Budd finally commits his heinous crime, and more than a taste of Hitchcock in some of the of the suspenseful machinations of the plot - most especially in the chemistry supply room scene where Corliss furtively steals his poisons, or during the tense roof scene. It's somehow apt that Mary Astor, who played the calculating Brigid O'Shaughnessy in The Maltese Falcon (1941), should be cast as Corliss' mother in the present film - although even she is much reduced and manipulated by him, facing a final humiliation on the doorstep of the Kingship residence. Her son is at heart a ruthless social climber, for whom the earlier 'problem' posed by Dorothy was just another obstacle to his inevitable rise to social success, just as his mother's dress sense is then another. As a schemer he leaves little to chance, as is evidenced by his careful arrangement of events in the first half of the film and detailed knowledge of the Kingship mining operation he casually reveals at the close. When he is undone, it is by misfortune rather than carelessness - a fact that makes his success all the more frightening as it is compromised by chain of chance more than anything else. As Corliss, Wagner is entirely convincing in a ruthless part that, at first sight, would have been ideal casting for Dennis Hopper. Beneath the familiar clean-cut image lies a calculating, black heart, and he suggests this by effective mannerisms, such as the throwaway, amoral shrug reflected in the jeweller's shop window at the end of his second meeting with Dorothy, or by holding his arms high and clear, as if in supplication to his own genius, as she makes her final descent. Years down the line, after the amiable dross of such later work as Hart To Hart (1980-5), it is a shock to see the actor create such an impact in what was a unique role for him. Oswald's direction is frequently distinguished by the use of long takes: the first scene for instance, which contains a fair chunk of dialogue, consists just of a pan over some photographs and one other extended set up. Part of this can be put down to necessary economies of shooting. In some scenes, especially those alone between Corliss and Dorothy, the refusal to cut away acts as if to trap the participants in their own moral universe, while the unflinching lens demands that the viewer make judgement. (There are sly visual jokes contained within shots too, as when at the conclusion of Corliss' second meeting at the sports ground, after her 'trip' down the bleachers, he is framed under a 'speed kills' road sign, or when Corliss and Ellen later flirt and in the wrap up shot the camera reveals they have been chatting under a tombstone-shaped rock.) This is not altogether to the film's advantage; in the middle section of the film, when Corliss is largely absent, some scenes drag a little. Occasionally Oswald changes pace, such as when he uses a fast dolly-in on the suicide note. But one senses that here the exposition would have benefited from shorter cutting, as the earnest Ellen and nice-but-dull Grant are not a very dynamic couple when alone on screen. However this is a minor quibble in a film that relishes a broad mise-en-scène, typical of 1950s' melodrama. George Macreedy, who plays Leo Kingship, gives excellent, grouchy support. It is his character that undergoes the only real metamorphosis in the film. His daughter of course learns that things are not really what they seem, as she discovers what Budd is really like under the tailored surface. Kingship Senior's education is far more profound, as he almost loses her through his over-protectiveness and intransigence. In one respect he is like Corliss: both have seen the nexus of family ties fray, leading to personality problems. At the end of the film, as he escorts his daughter away from the last encounter, Kingship does so more in sorrow than with the anger he would have earlier displayed. Here, as events take a final turn, the desolation of the mines provides a physical corollary for the stark moral drama being played out between the principals. A Kiss Before Dying was remade by James Dearden in 1991, an unsatisfactorily production that entirely missed the period intensity and compulsiveness of the original. The DVD offers little other but a trailer, although the widescreen transfer is splendid.",
         "If you're looking for an adaptation of the Ira Levin book--this isn't it. Also the book would be impossible to film. That aside this is OK murder mystery-thriller. I was lucky enough to see it letter-boxed on TCM--it looks great! However a film dealing with a psycho and murders he commits does NOT need a theme song! Acting is OK--not good, not bad, just OK. The cast is attractive, the film is beautiful to look at and it's an interesting diversion for 1 1/2 hours. So, an OK thriller--nothing really inventive or different about it. At all costs, AVOID the terrible 1991 remake! That one is a TOTAL waste of time!",
         "True, the story line is a bit noir for a Technicolor Cinemascope production, but when one realizes that Tucson was at the time a popular and inexpensive location for John Wayne films and the musical Oklahoma! also in glorious color under the blazing Arizona sun, it begins to make sense -- at least in terms of getting out of nearby California where the visible smog at the time was far greater than it is even today. I saw several of the exterior scenes of this film being made, and wondered whether the final cut would amount to much of anything. Robert Wagner seemed very young for the part, and almost frighteningly thin in stature. Moreover, his acting ability had not yet developed to the extent of that displayed by his contemporary Joanne Woodward. But it was obvious to all that the production itself and the supporting cast were professional to the core. Author Ira Levin was very popular at the time, something of the sort of writer one reads today in Robin Cook, Jonathan Kellerman, Stuart Woods, etc. In other words, not really a Raymond Chandler or even a Michael Connelly. That explains why so many recent viewers seem able to catch the adumbrations in the film early on. Potboilers lack the complexity of truly great detective fiction because the characters are stock heroes and heavys. The view looking down from the top of the old 12-story Valley National Bank building (portrayed in the film as the city hall), even though insignificant by today's height standards, is just as scary as it was then. Many of the other locations like the resort portrayed as a grand estate have been transformed or have simply disappeared. And those really cool \"rides\" are now languishing in automobile museums.",
         "A scheming college guy, played by a youthful Robert Wagner, tries to marry into wealth. Complications result in murder. Because of the murder angle, and because the plot centers on Wagner's sly and cunning character, the film reminds me a little of \"Dial M For Murder\". But, to its credit, \"A Kiss Before Dying\" has a darker, more brooding, noir-like quality, helped along by a 50's music score that is jazzy and slightly mournful. Wagner's acting, if not Oscar-worthy, is at least acceptable. But Jeffrey Hunter is miscast, and therefore not convincing, as the pipe-smoking professor/detective. And Joanne Woodward gives a clinging, and altogether too whiny, performance, as the damsel in distress. A couple of interesting, if somewhat implausible, plot twists add impact to the screenplay. The film's conclusion, however, is predictable and just a tad melodramatic. Overall, \"A Kiss Before Dying\" comes across as a stylish, very 1950ish, wanna-be classic. It doesn't quite succeed, but is nonetheless worth watching at least once, especially for viewers who like dark, brooding, twist-laden thrillers.",
         "An evil young man resorts to murder in his efforts to get his hands on an heiress's fortune. Unluckily for him, the heiress's sister and a smart young college lecturer smell a rat ... This is a sumptuous mid-50's all-American movie, set in a world of sorority houses, open-top cars and drug stores. The boys have shiny, well-oiled hair and the girls wear big skirts. Courting couples meet on the bleachers at the football field between classes. Shot in cinemascope, the film's aspect ratio means that television (where I saw it) does it a disservice: all too often, dialogues are conducted between two noses at either extreme of the screen. The colour is 'de luxe', so the credits tell us, and indeed the look of the film is rich and bright. The film is a standard thriller, based on an Ira Levin novel. It is well put together, and has a nice, slinky jazz score, including the theme song (playing on the juke box during one of Bud's dates with Dory). The opening is impressive. The camera pans around a student's bedroom, neatly setting the scene for us. We hear (but do not see) a girl crying. Gradually, as the characters are revealed, we get the message - Dory has found out that she is pregnant by Bud. She has a wealthy father, but is prepared to forego comfort if the man she loves will marry her. Bud is much more interested in the family money. Even though Bud is despicable, we find ourselves wanting his scheme to succeed, so cleverly are we drawn into his plan. He surreptitiously studies poisons in the university library, then by a cunning ploy gains access to the chemistry lab. He composes a note in Spanish, ostensibly a piece he needs to translate for his class, then gets Dory to write out the English for him. She doesn't realise it, but she is writing her own 'suicide note'. Gerd Oswald's direction is strong on body language throughout the movie, and we cannot help but see the significance when Dory (played by Joanne Woodward) goes to kiss Bud, and he flinches. A very young Robert Wagner portrays Bud as a slick, incredibly handsome villain with no feelings. He feigns affection for women, but is capable of none. When he cajoles his mother (Mary Astor) into choosing a tie for him, he craftily changes it for a preferred one when her back is turned. The director is adept at conveying information without words. When Bud looks at the municipal building and marvels at its height, we know straight away what he is planning. When he is on the roof, the tension is sustained commendably. Victoria Leith plays Ellen, Dory's sister. In another fine 'body language' moment, we see her subtly shrugging off her father's attempt to comfort her. We gather from this that Ellen blames him for what happened to Dory. The plot contains some elements which stretch our credulity. If the ending is contrived and highly improbable, at least the incremental steps by which doubt invades Ellen's awareness are cleverly done. Is it a coincidence that Jeff Hunter (Gordon Grant) and Robert Wagner look so alike? Or are they meant to represent two facets of intelligence - one cold and selfish, the other beneficent and altruistic? In the scene just before the engagement party, they are even dressed identically. Verdict - A cleverly-executed murder flick.",
         "When his girlfriend Dorie becomes pregnant, Bud Corliss knows that he will be trapped into a marriage and a child that he didn't want. Telling her to keep the whole thing a secret, Bud fools Dorie up onto the roof of a civic building before pushing her to her death and making it look like suicide. The police see it as open and shut but Dorie's sister smells a rat and believes that Dorie was going to the building to be married and that her intended groom was the one that killed her. Opening with a theme music and bright colours that suggested a 1950's comedy, I was worried that I had been misled by the title that suggested much darker fare. However the story quickly unfolds with a young couple in trouble, suggesting it would be a dated melodrama; but as the story progresses it does become more sinister and much more of a dark thriller. The story doesn't always ring true but it is more than enough to engage and makes for a good base for the film even if it is other aspects that make it stronger. Oswald's direction is a big plus because he mixes styles and genres well. He uses the colours and sets of a typically 1950's melodrama but at times the lighting, shot framing and music of a noir of sorts. The clash of genres works well, complimenting one another and making it seem more tense for being such a tough story within such a colourful and homely world of college students. The performances are roundly good. Wagner steals the show of course with a ruthless and selfish performance that could easily have been an one-note affair were it not for the script and Wagner's ability to bring out character in a couple of strong scenes (including an excellent one with his mother at a pool party). Woodward is convincingly naïve and works well with her character but I didn't think Leith suited Ellen that well, although I didn't totally buy her character either. Hunter is solid if uninspiring and the support cast are pretty much the same. Overall this is an enjoyable film that works thanks to strength in several areas. The story is engaging enough but it was the direction, visual style and use of music that impressed me more. Add to this a dominating central performance from Wagner and you have a film that is worth checking out.",
         "Set against the backdrop of the shiny 1950s, \"A Kiss Before Dying\" is a taunt thriller that can arguably be voted the predecessor of many modern thrillers. When the film starts, it looks like a glamorous, teenybopper flick. The opening song compliments this heavily, as does the numerous logos and neon colours used in the opening credits. Thinking back on it now, I find it to be a very unusual, brilliant style of film-making that isn't seen very often. It tricks the viewer into something it is not. It is not a 1950s college comedy, but a relentless thriller with lots of unexpected twists and turns. I thought this movie was going to be tame, being a 1950s film and all, but I was pleasantly surprised in how raw the plot was in some places. A young Robert Wagner portrays Bud Corliss, a darkly handsome college student with an obsessive taste for riches and fine dining. Bud is a trouble 25 year-old man who still lives at home with his aging widowed mother (Mary Astor). He feels unfulfilled in his life and a little uncertain about his future. Dorothy Kingship (Joanne Woodward), a girl with whom he is having a secret relationship with, may be the only glimmer of hope that will lift him up out of his bland, disappointing life. Dorothy's father is incredibly wealthy, and Bud knows this. However, Dorie falls pregnant and Bud is threatened with disinheritance and the inevitable prospect of working as a gas station attendant in order to pay the bills for his wife a baby. This is where the film really takes off and we get to see how dark, desperate and evil Bud really is. Bud devises a plan: stage his girlfriends suicide. The plan seems simple enough and actually works in Bud's favour. He is free of Dorie and the prospect of disinheritance, and is now able to court Dorie's older sister, Ellen (Virginia Leith), who is totally oblivious of the fact that Bud is Dorie's old flame (and murderer). Enter rookie detective Gordon Grant (Jeffrey Hunter), an intelligent young man who questions the circumstances surrounding Dorie's death, as well as the integrity of Ellen's new lover, Bud. He just has to put the gruesome pieces together to solve the complex puzzle of deceit and murder. I recommend this movie to fans of the thriller genre, as well as those who want to take a trip down memory lane. Great film with top performance by all. Kudos to Jeffrey Hunter.",
         "Ira Levin, an accomplished mystery writer, wrote the book in which this picture was based. The adaptation, by Lawrence Roman, works as a movie. Gerd Oswald, whose second movie this was, shows he wasn't up to the task of directing it. Perhaps with another director, a more satisfying film could have emerged. If you haven't seen the movie, please stop reading here. The film presents us a situation that was a classic dilemma for the times in which it was filmed: an unexpected pregnancy. It was a social issue that had more impact in those days than presently. This is a story of a young, naive coed that finds out to her horror, she is in the family way. The handsome boy that is responsible for it, goes into a state of panic, as he doesn't want any part of this situation. The young woman is killed in front of our eyes, so there is no suspense in the fact, since we know who did it. The crime is exacerbated because the sister of the dead girl smells a rat in the way her sister, supposedly committed suicide. She starts digging into the past. The complicating factor is that Ellen, the kind sister has fallen for a hunk that hides from her the key for solving the crime. The casting of the film was unusual in that Robert Wagner is cast as the evil Bud Corliss. Mr. Wagner with his good looks presents a facade of being what he is not. This duplicity makes us hate him. Virginia Leith, on the other hand, as the good sister, Ellen, is totally miscast. Perhaps another actress and a better direction would have made her more appealing. Joanne Woodward, as the doomed girl, makes a believable Dory. Jeffrey Hunter, as the man who discovers the mystery, makes a good impression."
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Crown Productions"],
      "summaries": [
         "Student Bud Corliss is wooing Dorother Kingship purely for her father's mining fortune. When he finds she is pregnant he realises she is likely to be disinherited, so cleverly stages her suicide. After a couple of months her sister back home finds evidence to question the suicide verdict, but by then has a new boyfriend of her own...",
         "Bud Corliss is an ambitious college student with big plans for himself and an heiress, Dorothy Kingship. But then Dorothy goes and gets herself pregnant. It's his child, too, of course; but this ruins everything. Her moralistic father will disown her and will certainly never accept him. It seems he's trapped. Bud's mother knows something is troubling her son, but he won't talk to her about it. All she knows is that Bud doesn't want to turn out like his father, with holes in his shoes. He doesn't have to worry. As his mother says, when he turns his mind to something, he does it. Unknown to her, his thoughts have turned to murder.",
         "A ruthless college student resorts to murder in a futile attempt to marry an heiress."
      ],
      "budget": 0
   },
   "movielensId": 5966,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-06-12",
      "dvdReleaseDate": "2002-12-03",
      "directors": ["Gerd Oswald"],
      "runtime": 94,
      "movieId": 5966,
      "title": "A Kiss Before Dying",
      "mpaa": "",
      "actors": [
         "Robert Wagner",
         "Jeffrey Hunter",
         "Virginia Leith",
         "Joanne Woodward",
         "Mary Astor",
         "George Macready",
         "Robert Quarry",
         "Howard Petrie",
         "Molly McCart",
         "Marlene Felton",
         "Bill Walker"
      ],
      "imdbMovieId": "0049414",
      "originalTitle": "A Kiss Before Dying",
      "genres": [
         "Drama",
         "Thriller",
         "Crime",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": ["95IWP5U_cmw"],
      "plotSummary": "Bud Corliss (Wagner) is an ambitious student who is wooing Dorothy Kingship (Woodward) purely for her father's mining fortune. When he discovers that Dorothy is pregnant with his child, he realizes she is quite likely to be disinherited by her wealthy family. He assures Dorothy that he'll take care of her, yet he hesitates when Dorothy insists on marrying. Bud then murders Dorothy and stages it in a way that it appears to be a suicide. He then reaches out to her sister Ellen (Leith) with the hopes of marrying her in order to ingratiate himself with her father. After a couple of months Ellen finds evidence to question the suicide verdict, and then discovers Bud knew Dorothy. Ellen struggles to avenge her sister and save her own life.",
      "tmdbMovieId": 53712,
      "avgRating": 3.3038,
      "releaseYear": "1956",
      "numRatings": 79,
      "posterPath": "/4vap0guvlafQRBGDWKw4kWoeWWl.jpg"
   }
}