{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0105809",
      "video": false,
      "title": "Where Sleeping Dogs Lie",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bruce Simmons",
               "gender": 2,
               "credit_id": "52fe464cc3a368484e088f79",
               "name": "Dylan McDermott",
               "profile_path": "/4VVyvrxVVrrX9GsKlkSnUz32Ft6.jpg",
               "id": 32597,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Eddie Hale",
               "gender": 2,
               "credit_id": "57ee30b09251415e39002598",
               "name": "Tom Sizemore",
               "profile_path": "/soINOuacuiThRb2LyPD4tTWve7C.jpg",
               "id": 3197,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Serena Black",
               "gender": 1,
               "credit_id": "52fe464cc3a368484e088f81",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Evan Best",
               "gender": 2,
               "credit_id": "52fe464cc3a368484e088f7d",
               "name": "Charles Finch",
               "profile_path": null,
               "id": 58047,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Stan Reeb",
               "gender": 0,
               "credit_id": "57ee30cdc3a3684e32003df9",
               "name": "Ron Karabatsos",
               "profile_path": "/i4YiJSoEGOVZ5CUsQF0wpnUGdLz.jpg",
               "id": 1367324,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Woman Tourist",
               "gender": 1,
               "credit_id": "57ee30d89251415daa002519",
               "name": "Mary Woronov",
               "profile_path": "/s2bYX2L2WYRXw1feRBKpRITDJQZ.jpg",
               "id": 100552,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Man Tourist",
               "gender": 0,
               "credit_id": "57ee30e29251416cd3004add",
               "name": "David Q. Combs",
               "profile_path": null,
               "id": 1491195,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Serena's Secretary",
               "gender": 1,
               "credit_id": "57ee30f39251416cd3004ae2",
               "name": "Elizabeth Whitcraft",
               "profile_path": null,
               "id": 9172,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dol Whitney",
               "gender": 1,
               "credit_id": "57ee30ff9251416ce8004d29",
               "name": "Jillian McWhirter",
               "profile_path": "/k7GuUTxgA3np96cavUoZfZpzkOh.jpg",
               "id": 184459,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe464cc3a368484e088f87",
            "name": "Charles Finch",
            "profile_path": null,
            "id": 58047,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.38316,
      "production_countries": [],
      "id": 61265,
      "vote_count": 2,
      "budget": 0,
      "overview": "A murder mystery writer misreads the nervous man he bullies in a spooky Hollywood mansion.",
      "similar": [
         274,
         10285,
         949,
         189,
         2832,
         181283,
         336843,
         1949,
         158011,
         910,
         996,
         1939,
         8834,
         12150,
         371608,
         4638,
         845,
         28902,
         72784,
         9272
      ],
      "original_title": "Where Sleeping Dogs Lie",
      "runtime": 95,
      "poster_path": "/epypVRtRWCFKgOMPKdpmcFF6nUV.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1991-11-13",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "A writer searching for the dead is about to uncover the killer.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Charles Finch"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Yolande Turner",
         "Charles Finch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0105809/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MjM0MzA1OV5BMl5BanBnXkFtZTcwNzk5OTkyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Dylan McDermott, Tom Sizemore, Sharon Stone | See full cast and crew »"],
      "reviews": [
         "\"Where Sleeping Dogs Lie\" would have been a much better film had the director and writer tightened the screen play in which it's based. Charles Finch, the director, and Yolanda Turner, the writer, tried to put some life into the film with mixed results. The story of Bruce, a writer that is house sitting a mansion that has seen better days, offers a lot of possibilities. Bruce made the discovery about a murder that has taken place in the house. To make matters worse, he agrees into taking a lodger, the creepy Eddie Hale. The viewer realizes right away where the story is going. The result is an uneven movie that has some good elements and with another creative team it might have been more interesting. Dylan McDermott is Bruce, the writer. Tom Sizemore has more opportunity playing the strange Eddie Hale, who is the key to the mystery surrounding the mansion and what happened in it years ago. Sharon Stone is seen as a literary agent that wants to dare Bruce into producing a masterpiece. \"Where Sleeping Dogs Lie\" is a curiosity piece that is mildly engrossing.",
         "This movie should have been great. The acting is great. The locations are excellent, as is the photography, editing and so forth. The premise is clever, the opening scenes of the script intriguing, and the actions of the characters logical given the circumstances. A few scenes are riveting, and the sequence of events, at least for the first half of the movie, captures your attention completely. My feeling is that the film was cut, to the point where we are left with only the basic storyboard. The ending is questionable, probably because there are missing pieces of information. Hopefully, the whole film was shot, and someone will go back and re-edit the final version someday. Or perhaps I am filling in a script that was not revised enough - who knows? But my gut feeling is that this film could have been quite extraordinary.",
         "This is a film that has you thinking about it later on for a few days. You can't seem to get it out of your mind. I found it absolutely enjoyable. The storyline and the acting is terrific. Suspenseful and intoxicating.",
         "There are three reasons to watch, and enjoy, this film... Sizemore, Sizemore and Sizemore. Dylan McDermott is alright and all, beefcake does nothing for me. A dozen guys could've played this part. A half dozen would've made something of it. Sharon Stone... anyone could have played her part, and she acted as if she was proving just that. She looked good doing it, no surprise. A little slow moving and the plot is very predictable but a nice ending semi-twist. It is Tom Sizemore's performance that makes this film worth watching. I always liked this guy but he does a good-to-great weirdo in this movie. 7 out of 10... Too generous?? To each his own.",
         "Most will find this movie slow and sluggish. There really is not a lot of action, but plenty of dialogue and suspense. An out of work writer (Dylan McDermott)house sits a vacant mansion, where he decides to write a book about the wealthy family that was murdered there. His agent and former lover(Sharon Stone) tries to shame him into submitting a masterpiece novel for publication. The stalker/murderer who slaughtered the family arrives and ends up helping McDermott write in detail. My favorite scene is where the tantalizing Miss Stone lifts herself up out of the swimming pool to smooch McDermott. A second viewing will help you make sense of this dark drama.",
         "Sure, it's slow on action, but what atmosphere! I really enjoyed this movie the first time around, when I wasn't really paying attention, so I watched it a couple more times on cable. This was the first movie where I had really seen Tom Sizemore and known who he was, and he was absolutely chilling. I thought the interplay between Sizemore's menacing character and McDermott's kind of confused, innocent character was a lot of fun. Poor Dylan. He had no idea what he was getting into when he let that guy into his house, did he? I think the Sharon Stone sequences looked kind of tacked on - not that she didn't brighten up the screen - and I agree with other comments that the plot could have been tightened up, but overall I find it a haunting, very entertaining movie that should have gotten a lot more attention than it did at the time of its release. It didn't show up on cable until several years later. I liked it so much I picked up a copy on eBay and would highly recommend it to anyone who likes creepy suspense films.",
         "This movie is about a writer who moves into an old house to write a novel. He is played Dylan McDermott(Three To Tango). During the movie, he accidently invites the killer of a family to live with him. Eventually he goes crazy and gets himself some help. You can see Sharon Stone in this movie a agent of a the writer!!So once again , great cast!!Pathetic story!!If you like Dylan, you can see him shirtless in the beginning!!!Tom Sizemore(Bringing Out the Dead) also co-stars in this movie!!",
         "The script telegraphs all of its \"surprises\", the direction is strictly by-the-numbers and Dylan McDermott is a bland lead. There are only two noteworthy elements in this movie: the dangerous, edgy intensity Tom Sizemore brings to his role, and a couple of steamy moments provided by Sharon Stone, who was then at her best-looking phase; at one point she actually says to McDermott: \"Don't fret, you 'll get the check in a week and you can have me now\". Now that's what I call a GOOD DEAL. (**)",
         "There's no reason to watch this unless you're in love with Dylan McDermott. Dylan plays a down on his luck writer, who is given a house to sell. It is a large spooky Spanish mansion. Since he is so down on his luck he doesn't even have a car with a roof on it to sleep in, he moves into the mansion. Apparently a very brutal bloody murder has taken place in this mansion. Shortly after he moves in, another man shows up wanting to rent a room. This oddball goes by the name of Eddie and says he works at a supermarket. So here you have two nutty fruit loops in an old spooky mansion. It comes to nothing. Sharon Stone puts in an appearance as Bruce's beautiful agent-- for all her role contributes to the film she might as well have not been there. The ending is as anticlimactic as the rest of the movie. One star.",
         "First of all, not even the title is good. I think this film would have been good if there was more of a definate plot to it. Within 25 or so odd minutes, you already get the gist of whats going to happen! It's a total \"cop-out\"! The only good part of this flick, was Dylan McDermott. Not only was he really believable, he brought a certain charm to the role. (The looks did help though) *smiles* One thing he (Dylan) does well in this, is scream. I mean scream at the top of his lungs, till hes purple in the face..it was heart stopping, in other words awesome. Another thing he does well, hes got a great mouth to swear with, it just sounds better. Is that weird? Anyway, see for yourself, if only to see McDermott!"
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Sotela Pictures"],
      "summaries": ["A murder mystery writer misreads the nervous man he bullies in a spooky Hollywood mansion."],
      "budget": 0
   },
   "movielensId": 5976,
   "movielens": {
      "languages": [""],
      "releaseDate": "1991-11-13",
      "dvdReleaseDate": "2002-12-03",
      "directors": ["Charles Finch"],
      "runtime": 95,
      "movieId": 5976,
      "title": "Where Sleeping Dogs Lie",
      "mpaa": "",
      "actors": [
         "Dylan McDermott",
         "Tom Sizemore",
         "Sharon Stone",
         "Charles Finch",
         "Ron Karabatsos",
         "Mary Woronov",
         "David Q. Combs",
         "Elizabeth Whitcraft",
         "Jillian McWhirter"
      ],
      "imdbMovieId": "0105809",
      "originalTitle": "Where Sleeping Dogs Lie",
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A murder mystery writer misreads the nervous man he bullies in a spooky Hollywood mansion.",
      "tmdbMovieId": 61265,
      "avgRating": 2.47059,
      "releaseYear": "1991",
      "numRatings": 17,
      "posterPath": "/epypVRtRWCFKgOMPKdpmcFF6nUV.jpg"
   }
}