{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [],
      "runtime": 174,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0424600/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgwMDM0NzUyN15BMl5BanBnXkFtZTcwODk5MTE3MQ@@._V1_SY317_CR14,0,214,317_AL_.jpg",
      "actors": ["Stars: Benjamin Bratt, Christa Miller, Louis Ferreira | See full cast and crew »"],
      "reviews": [
         "The original is a classic and one of my 50 favourite movies. This 2008 remake... I just watched it tonight... it was up there with being a BAD movie... It is very disappointing... come on... its 2008.... SURELY they could have remade it better than the 1970 (ish) version ? The answer: NO Its far fetched... has bad acting... bad special effects (the wave of virus washing across the land) and worse plot. Its rubbish compared to the original, which gave you a little tingle down your spine as you watched it... this version makes you feel embarrassed to admit you watched it. What made the original work is that it was 'confined'... the majority of the movie took place down in that closed off lab... you were trapped in there with the 'Andromeda strain' and the scientists. THATS what gave it its realism... All of the attempt at action... just shook the original plot all to pieces. Thumbs down on many levels...",
         "This miniseries was mostly a 7.5 or so for me, until the last half of the final part where they proceeded to: - Basically ignore (they threw in a casual explanation) the two survivors of Piedmont sub-plot - Ignore the sub-plot (even if it was a horribly clichéd one) of the estranged wife of Dr Stone, and rebellious son - Ignore the fact that there were airborne rubber eating Andromedas above Piedmont when the helicopters flew over - Turn the Andromeda strain into a visible on-screen entity - Provide no clear reason for why Dae Kims character died upon throwing a thumb - Flub the ending of the reporter sub-plot, so it became a total \"Who Cares?\" - Give Andromeda an actual (and completely dumb) origin, rather than leave it mysterious like the novel - Bore us all to death with environmentalist clichéd 1960s Star Trek-esquire moralising - Bore us past death to \"government conspiracy\" plot line that's so horribly overdone - Provide no reason as to why there was lots of rubble falling down the central shaft But perhaps the most burning of the flaws with this miniseries was the action that occurred when the nuclear fail-safe was activated. Besides being motivated by a plot contrivance rather than logically occurring as it did in the novel, it was also horribly dragged out. I recorded this and watched it back via Sky+ (Tivo-esque machine for those of you not in the UK) and I must have fast forwarded through most of that climbing and crawling sequence. It actually seemed to me like because they had a few ex-24 stars, they felt like the thing needed to happen in real time. Do film-makers really think we need to see every excruciating detail of climbing up ladders, climbing down ladders, throwing thumbs, climbing into vents, climbing out of vents, crawling across a floor, crawling up a wall, struggling to remove a key-card, struggling to remove a thumb. Just get to the point, we don't want to see 10 minutes of padding in a 15 minute \"action\" sequence!",
         "While lifting various plot elements from the original (nasty virus, Wildfire containment facility, odd-man-out auto-destruct canceler, etc) we get a whole pile of additional elements thrown in, and for no apparent good reason. Ben Bratt's character has a substance abusing wife and an estranged son...this goes no where. The Wildfire team is now composed of a more politically correct team including a black, an Asian, and a homosexual. Wormhole? Virus sent from the future so we can save ourselves? Somebody's been watching too many Star Trek reruns. The let's-crawl-up-the-central-Wildfire-tube-core sequence in the original was terrific and tension filled. In this remake it is labored and boring. It might have gained another score point if the wrong thumb had been cut off. And then there's Jack Nash running around looking for Grace (oops, wrong series). And then we have all the secret bad government daring-do, a predictable addition in these times. As someone else once said \"They should only remake bad movies\". You've been warned.",
         "Save yourself a few tedious hours, skip this crap and see the 1971 original. This is another example of a movie that has nothing going for it but the good feelings a viewer might have about the original. (How appropriate that I first saw a commercial for it while waiting for the lousy \"Indiana Jones 4\" to begin.) So, so, so much padding! (And even so, A&E managed to stuff in almost 80 minutes of commercials in the two night run.) Ridiculous plot lines that go nowhere (the Geraldo-style reporter, \"vent-mining\"), unnecessary time-waster shots of animals eating each other (all just to establish the infection vector of a rat dropped onto a group of National Guardsmen) family squabbles that go nowhere... all of these had the unmistakable feel of an effort to reach a predetermined running time. The problem is, when length is more important a goal than quality, nothing can be left on the cutting-room floor. Trimmed to two hours, this just might have been a watchable movie. Even if decently edited to tighten up the pacing, there's then the problem of reeediculous plot devices that were added to this adaptation. For example: - Telepathic germs (you gotta be freaking kidding) - Messages from the future (I wish I was freaking kidding) --- Note to you guys in the future: instead of the cryptic \"739528\", maybe \"hey, look on the space station!\" would get your point across a little better - Orbiting wormholes (still not kidding) - Blackbird attacks that kill soldiers in helmets and full combat gear (shades of Alfred Hitchcock) - Endless blather about \"vent mining\", and even a terrorist attack on a vent mining platform. ----- (Oops! did we forget to explain what that had to do with the story?) - \"Pass the thumb\" - Andromeda racing across the countryside turning everything yellow. - Dime-store CGI (we're talking \"Sci-Fi Channel Original\" quality) used even in scenes where the real thing would have been easier and more effective: flame throwers, dried blood sifting from a cut, the inexplicable falling debris in the core. - Is the action dragging? Time for some Guardsmen to buy the farm! - Hollywood leftist paranoia: the evil team of General Mancheck and Colonel Farris, military hit men, NSA stashing a final vial of the pathogen, and (my personal favorite) the company Enburton (Enron + Halliburton?) running the vent mining operation. Michael Crichton wrote the original novel of \"The Andromeda Strain\", and the 1971 movie remembered so fondly by many was a quite faithful adaptation. You've heard of Michael Crichton because he has written lots of exciting and interesting science fiction, much of which has been turned into movies (of varying quality.) This adaptation was written by Robert Schenkkan. You likely haven't heard of him, because he's been asked to write almost nothing else for the screen. Judging from this production, there would seem to be a reason for that. He has written a number of well-received plays, but apparently that talent does not translate well to television; what I recall of his 2004 \"Spartacus\" miniseries was on the level of \"Andromeda\". (Trekkie alert: as a C-list actor, Schenkkan is best remembered for eating an alien cockroach and then getting his head blown up, when he played Commander Remmick in the ST:TNG first-season episode \"Conspiracy\".) If this is the best A&E can do, I hope that in the future they'll just stay out of the science fiction genre. At the very least they should produce original stories, instead of mucking up remakes of perfectly good predecessors. I'll never get those four hours back, but you still have a chance to miss this movie. Consider yourself warned.",
         "Hard to believe such a great book and movie could be ruined by infantile, cheap, melodramatic, two-dimensional writing, directing and camera-work, but this is a great example of how it can be done. Unwatchable. Pointless love story. Robotic characters. TV-style, quick-take, short-attention-spanning, wannabe thriller movie-making. One hopes the director and writer never get another TV credit again. Crichton should sue. I could tell from the first 30 seconds of the film that it was going to disappoint and be as predictable and unimaginative as it was. Not even HBO for pre-schoolers. See the original ASAP! IT can be watched ten times and not be as boring as this remake.",
         "36 years later, better CGI etc. so I had high hopes that this miniseries would be even better than the film from 1971. Unfortunately, it proved to be a big disappointment. The acting is bad, the CGI is worse and the story ...... Well, i guess a new word has to be invented to describe it properly. The original story, which had a big mysterious ring to it, has been altered for the worse. The story has been poisoned with paranoid idea's on the future, politics, governmental conspiracy's, conservation of the planet etc. etc. etc.. Flavoured with a little wormhole and spiced with a time paradox. And there you have it! A castrated remake of a superb film! This miniseries is worse than Plan nine from outer-space by far! I'm utterly disgusted with myself for having watched this ...... (truck-)load of horse excrement. Avoid this film, if you liked the '71 version!",
         "During the late sixties, Michael Crichton wrote a novel about contamination with an alien microorganism. At that time, science was hailed as the pinnacle of human achievement and it was thought that anything is possible. Therefore it is normal for the book and the subsequent film from 1971 to focus on the science, on the formalism, on the way people think their way out of a situation. Fast forward to 2008. People are dumber, science is a joke, people need to look good and the design must be perfect. Some horrible deaths and some fear of government conspiracy or terrorism is the only way tension can be achieved. The problem is that I have anticipated this. My own theory says that if you expect it to happen, there won't be a negative response, yet I am terribly angry at this mini series BECAUSE it was exactly what I expected. Things have been added to the original story that make no sense and make no sense to add: government black ops, wormholes, message from the future, ecological controversy over ocean vent mining, etc, etc. As expected the effects were really good, the people looked good, the computer interface design was flawless. And it all fell completely empty. If you are familiar to The Andromeda Strain book or 1971 movie, you might find it interesting to see how it can go horribly wrong. Otherwise, just watch the 1971 version. It is slow paced, faithful to the book and a lot more interesting.",
         "If you've seen the \"updated remakes\" of Rollerball, The Time Machine, Planet of the Apes, The Invaders, War of the Worlds, The Haunting, Lost in Space, and Battlestar Galactica and liked them, if you like the contrived derivative science-fictiony mini-series \"Taken\", then you'll like this. The novel \"Andromeda Strain\" by Michael Chrichton could have been updated to 2008 U.S.A. without doing the overboard nonsense as clearly demonstrated in the above-mentioned awful remakes. I'm sorry Michael Crichton is still alive to see this hack job of his masterpiece. For example, in the remake of \"The Haunting\", there had to be lesbians. For what reason, who knows? But, in this remake, guess what? Unnecessary homosexuals! Even though it was obvious in the original film that the female scientist could have been a lesbian IT WAS IMMATERIAL TO THE PLOT, so wasn't explored! There was child abuse in the new \"The Haunting\", too. Why? I dunno. Someone wanted to make a point, I suppose, but failed utterly in doing so. In the \"Lost in Space\" remake, the relationship between Will Smith and his father is dysfunctional as all get out. And UNNECESSARILY SO. Well, in this remake, the various characters (and there's too many of them) all have some sort of dysfunctional relationship with each other, with baggage left over from previous run-ins, affairs, and incidents. The \"Planet of the Apes\" remake and \"Time Machine\" remake both did something stupid and unnecessary with time-space travel. So does this. Wanna not trust the government? Well, \"The Taken\" used that so much it wore a hole in it. And it's done to death in this remake, even though, in the original Andromeda Strain, it was done just right. Why? Because in the original the government was running a con on the bio-scientists who didn't figure it out until five minutes from the end. That was enough government conspiracy stuff for me. I don't need anti-government paranoia thrown in my face, overdosing me, from the first minute of the film! And don't get me started on the moronic, pandering introduction of a sensation-seeking \"journalist\" (who wasn't in the original novel or film) that just mucks up the whole works. The producers apparently wanted to base him on an Anderson Cooper-Geraldo Rivera hybrid. Like that's a good model for a fabricated journalist. If you wanted to update the Andromeda Strain, why not do it by updating the computer tech, the genetics, the medical diagnosis tech, the biochemistry knowledge/tech and the biowarfare tech? Those were all in the original film, but could use updating to 2008 tech or even envisioning a bit beyond 2008 tech. It could have been done just like the original Andromeda Strain, which put tech there that was recognizable and believable and understandable for a 1970 audience, but, where necessary, took it a step or two into the future. And why do we have to have a mix-and-match one-from-column-A-and-one-from-column-B gender/race/sexual preference scientific team? Because it's politically correct? Guess what? I just watched the Phoenix Mars Lander team get interviewed and there was no such politically-motivated race/gender/sexual preference nonsense on that team. That's because the Phoenix team was chosen on the basis of knowledge, expertise, and ability, just like the the original Andromeda Strain scientific team. Sorry, Benjamin Bratt, Christa Miller, Eric McCormack, and Rick Shroder, I loved you in other stuff, but you sure got suckered into this. I really hate \"remakes\" that are over-emo, angst-filled, self-involved, personality conflict bore-fests. Can you tell? Anyway, after watching this wretched thing, I put in my DVD of Andromeda Strain and actually enjoyed \"The Andromeda Strain\".",
         "I can't begin to say all that is bad about this extremely long terribly boring mini-series. First off the script is terrible. Here is one of the worst things that is said & mind you these are supposed to be some of the smartest minds of all. \"Oh the power is out so there is no way to get up to the other floors, so well why don't we just climb up manually? Wow that's a brilliant idea.\" I'm not kidding this is actually said. Besides the script even the effects and the acting is wooden. This wouldn't be as bad if it weren't for the fact that you have to endure this for 4 HOURS!!! Well not counting commercials it is probably ONLY 3 hours but even still it is just not watching. Considering the fact this was done better (although outdated) in 1971 makes this version even worse. Please don't waste your time with this snore-worthy mini-series drivel.",
         "Let's see: Some guys in the future have some kind of death organism that they discover can only be controlled by the bacteria that live near mineral-rich undersea vents. So they send a sample of the deadly stuff back in time to us, encased in a bucky-ball package that has instructions written on it in ASCII (not EBCDIC!) about how we shouldn't mine the vents and destroy the anti-virus bacteria. But some military types have a satellite hanging around the worm hole to the future hoping to snag some kind of schrecklichkeit from space they can use for germ warfare. Unfortunately, they snag the bucky-ball and break it open, destroying all the instructions except the name of the stuff and a serial number. The satellite crashes, loosing the virus. Meanwhile, evil big businessmen are preparing to mine the vents. So there are two simultaneous conspiracies, one to use the virus for warfare, the other to make sure the vents get mined. In the end: (1) scientists figure out how to use the vent-bacteria to kill the virus, thus saving the world for the moment; (2) the military conspirators kill each other because some of them have a change of heart; (3) the President decides to go ahead with the vent-mining anyway (4) a cigarette-smoking man saves a sample of the virus in the International Space Station so it will be available for the future. So... (1) Where did the virus come from in the first place? Did the Future get it from us, the Past? But in the Past (our Present) the vents get mined and there would be no bacteria for the Future to use to suppress the virus. So the Future could not be telling us how to combat the virus. (2) Or, we are living in alternative past created when the Future sent the sample back to our universe. In the alternative Future created by our alternative Past, the Future will receive the sample from us, but they won't be able to control it and Time will end. But the real Future doesn't care, because they created an alternative Future (not theirs) that took the fall. (3) But wait.... (4) And what about those highly favorable reviews posted here that were posted days and sometimes weeks BEFORE the date the show was aired? Are we living in an alternative universe in which the show is a turkey caused by the messages posted by people in the Past sending messages to the Present? If that singularity had not happened, would the show have been as great as they said it was?"
      ],
      "genres": [
         "Romance",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "A.S. Films",
         "Scott Free Productions",
         "Traveler's Rest Films"
      ],
      "summaries": [
         "In \"The Andromeda Strain,\" a U.S. military satellite crashes in a small town and unleashes a deadly plague killing all but two survivors. As the military quarantines the area, a team of highly specialized scientists is assembled to find a cure to the pathogen code-named \"Andromeda,\" and a reporter investigates a government conspiracy only to discover what he is chasing wants him silenced.",
         "When a satellite crashes near the remote Utah town of Piedmont, it becomes apparent that it may be carrying a deadly virus. All but two of the town's inhabitants, a baby and a Sterno drinker, are dead. Working in a secret government laboratory deep underground, Dr. Jeremy Stone leads a team of scientists who try to identify the virus and develop a means of stopping its spread. Several others, including the military and other senior government officials, have their own agendas however leading to the spread of misinformation about the origin of the virus.",
         "Two soldiers are sent to find a satellite that has crash-landed near a small town in Utah called Piedmont; but someone has removed it from where it landed. The soldiers make their way to town in order to find it. But what they find in \"the armpit of nowhere\" is unexpected and horrible. Dead bodies are lying about everywhere. Suddenly an old man runs up to their Humvee screaming for help. But it's too late - for the soldiers. Within moments they are stricken by something unknown. And then they're dead. Soon, Dr. Jeremy Stone will lead a crack team of scientists as they work feverishly in a secret, state-of-the-art laboratory to discover what has killed the citizens of Piedmont, and why two survivors seem to have been immune. They have little time. Whatever wiped out the people of the small town is spreading across the country and killing everyone in its path. Meanwhile, a rogue television reporter battles with sinister government agents to learn the truth about the disaster.",
         "A crack team of top scientists work feverishly in a secret, state-of-the-art laboratory to discover what has killed the citizens of a small town and learn how this deadly contagion can be stopped."
      ],
      "budget": 15000000
   },
   "movielensId": 59869,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-05-10",
      "dvdReleaseDate": "2008-06-03",
      "directors": ["Mikael Salomon"],
      "runtime": 180,
      "movieId": 59869,
      "title": "The Andromeda Strain",
      "mpaa": "NR",
      "actors": [
         "Benjamin Bratt",
         "Christa Miller",
         "Eric McCormack",
         "Daniel Dae Kim",
         "Viola Davis",
         "Louis Ferreira",
         "Barry Flatman",
         "Ricky Schroder",
         "Andre Braugher",
         "Magda Apanowicz",
         "Fred Keating",
         "Anna Galvin",
         "Eve Harlow",
         "Paul Perri",
         "Adrian Holmes",
         "Emily Holmes",
         "Juan Carlos Velis",
         "Michal Suchánek",
         "Ted Whittall",
         "Ted Atherton",
         "Roman Podhora",
         "Jonathan Potts",
         "Denise Galik",
         "Kurt Max Runte",
         "Cory Dagg",
         "Nicola Anderson",
         "Douglas O'Keeffe",
         "Tom McBeath",
         "Jesse Moss",
         "Kurt Evans",
         "Panou",
         "Candus Churchill",
         "Graeme Duffy",
         "Daniel Bacon",
         "Stacee Copeland",
         "David Ross",
         "Tom Butler",
         "Nels Lennarson",
         "Chris Bradford",
         "Biski Gugushe",
         "Matthew Smalley",
         "Teach Grant",
         "Bart Anderson",
         "Donna Soares",
         "Michale Ascher",
         "Luke Camilleri",
         "Michael Teigen",
         "Jacob Blair",
         "Eric Breker",
         "Ava Salomon",
         "Aaron Junior Turner",
         "Calvin Lee",
         "Zyan Panagopoulos"
      ],
      "imdbMovieId": "0424600",
      "originalTitle": "The Andromeda Strain",
      "genres": [
         "Romance",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["edUWhyQHhc8"],
      "plotSummary": "A U.S. satellite crash-lands near a small town in Utah, unleashing a deadly plague that kills virtually everyone except two survivors, who may provide clues to immunizing the population. As the military attempts to quarantine the area, a team of highly specialized scientists is assembled to find a cure and stop the spread of the alien pathogen, code-named Andromeda.",
      "tmdbMovieId": 14305,
      "avgRating": 3.15714,
      "releaseYear": "2008",
      "numRatings": 70,
      "posterPath": "/9sXHa1PdBe4nv5YwCUnQFqK9Tjs.jpg"
   }
}