{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "transporter",
            "id": 396
         },
         {
            "name": "boxer",
            "id": 2792
         },
         {
            "name": "boxing match",
            "id": 4487
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "gritty",
            "id": 155453
         },
         {
            "name": "over-the-hill fighter",
            "id": 155464
         }
      ],
      "imdb_id": "tt0068575",
      "video": false,
      "title": "Fat City",
      "recommendations": [
         73455,
         37315,
         42984,
         91426,
         16659,
         39986,
         44026,
         836,
         29835,
         42061,
         104398,
         51143,
         42136,
         52282,
         13415,
         146580,
         93114,
         42134,
         43385,
         147723
      ],
      "backdrop_path": "/zGHWjvk0GL50OQQV76dJE31a3LU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Tully",
               "gender": 2,
               "credit_id": "52fe46fc9251416c7508a229",
               "name": "Stacy Keach",
               "profile_path": "/9G0urAVBBP9FRX1wrxkdZCj3VCW.jpg",
               "id": 825,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Ernie",
               "gender": 2,
               "credit_id": "52fe46fc9251416c7508a22d",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Oma",
               "gender": 1,
               "credit_id": "52fe46fc9251416c7508a231",
               "name": "Susan Tyrrell",
               "profile_path": "/2cQnK1bJxp9PldCeA05kohavPs8.jpg",
               "id": 59369,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Faye",
               "gender": 1,
               "credit_id": "54c20510c3a3687c4000d5e2",
               "name": "Candy Clark",
               "profile_path": "/6pGZGgHa09ktPwEcFWNAU3PLFdi.jpg",
               "id": 12407,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Ruben",
               "gender": 2,
               "credit_id": "572e5c1c92514173a100042f",
               "name": "Nicholas Colasanto",
               "profile_path": "/i7gdG5j4jf13lSkvKI0JalJ9IyZ.jpg",
               "id": 17651,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Babe",
               "gender": 2,
               "credit_id": "572e5c25c3a36818d100077e",
               "name": "Art Aragon",
               "profile_path": null,
               "id": 136334,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Referee at Tully-Lucero Fight",
               "gender": 2,
               "credit_id": "5a7dbf830e0a2654e90000cc",
               "name": "Al Silvani",
               "profile_path": "/tHjzbzaPTDPvkewRwmiXH0zQkdI.jpg",
               "id": 16528,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46fc9251416c7508a207",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fc9251416c7508a20d",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fc9251416c7508a213",
               "name": "Ray Stark",
               "profile_path": null,
               "id": 32790,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46fc9251416c7508a225",
               "name": "Walter Thompson",
               "profile_path": null,
               "id": 19334,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "572e5bd1c3a3680fdf003e6b",
               "name": "Leonard Gardner",
               "profile_path": null,
               "id": 81117,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "535a25220e0a2664100013b4",
               "name": "Conrad L. Hall",
               "profile_path": "/fGWnmu9EAYqX974sP0ddkOjgVEy.jpg",
               "id": 8217,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "572e5bcbc3a3684bd3000d8a",
               "name": "Leonard Gardner",
               "profile_path": null,
               "id": 81117,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "572e5bddc3a3684bd3000d8f",
               "name": "David Dworski",
               "profile_path": null,
               "id": 1616576,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "572e5be992514173a100042b",
               "name": "Fred Roos",
               "profile_path": null,
               "id": 2871,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "572e5bef9251410d30002e36",
               "name": "Jennifer Shull",
               "profile_path": null,
               "id": 8426,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "572e5bf7c3a36869e60022d5",
               "name": "Richard Sylbert",
               "profile_path": null,
               "id": 12017,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "572e5bfec3a3680fe5003c89",
               "name": "Morris Hoffman",
               "profile_path": null,
               "id": 118291,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "572e5c05c3a36819390007b5",
               "name": "Dorothy Jeakins",
               "profile_path": null,
               "id": 29800,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.675915,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16993,
      "vote_count": 34,
      "budget": 0,
      "overview": "Two men, working as professional boxers, come to blows when their careers each begin to take opposite momentum.",
      "similar": [
         1374,
         1367,
         1371,
         1375,
         921,
         17218,
         1578,
         1366,
         70,
         1246,
         10637,
         45317,
         22881,
         9291,
         2300,
         323677,
         10474,
         680,
         9563,
         2323
      ],
      "original_title": "Fat City",
      "runtime": 100,
      "poster_path": "/xRjvUQqqMUACGre1IVJJwip8WVd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rastar Pictures",
            "id": 2070,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1972-07-26",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Life is what happens in between rounds.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Huston"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Leonard Gardner",
         "Leonard Gardner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068575/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAzNjk1MTcxN15BMl5BanBnXkFtZTYwMjA2OTc5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Stacy Keach, Jeff Bridges, Susan Tyrrell | See full cast and crew »"],
      "reviews": [
         "I had deliberately overlooked Fat City in the past believing it to be yet another twist on the formulaic and Hollywoodization of boxing stories. Was I wrong! I'm so glad that I unexpectedly caught this and was riveted from the get go. Fat City is an amazing film, made even more stellar by the casting of Stacy Keach, Jeff Bridges, Candy Clark and Nick Colasanto. It is hard to distinguish between these marvelous actors as their performances, under the hands of the maestro John Huston, are incredible. Stacy Keach is the focus however, and he carries the film with the able performances of the aforementioned. I believe this to be one of the most overlooked films of all time. The characters are a bunch of losers, but they don't know they're losers and keep reiterating their dreams. They operate on a level that is below average and live in impoverished surroundings, always believing that something good is around the corner. There is no big win in this, the wins remain around the corner. There's basically no beginning, middle and end. It is a study of the underbelly of a town in California, the seedy bars, the dirty restaurants, life in the one room with kitchen-in-a-corner of a walk-up fleabag hotel. Stacy Keach pulls you into this world, he lives and breathes the character he plays down to the last few minutes of screen time when he takes a look around the rathole of a restaurant he's in, surrounded by people like himself and the film freezes for about a minute before it moves on. You catch his stark awareness at that moment. And all of his life, past, present and future becomes crystal clear to him. You don't think he's going to do much with this newfound insight. It doesn't matter. And that's the point. Bleak and beautiful. All in the same minute of time. 9 out of 10. Thanks once again, Mr. Huston.",
         "John Huston's 1972 production of FAT CITY is a masterpiece of film-making and acting. It's more than just a movie of boxing, it's symbolic of the American Dream gone depressingly wrong. Stacy Keach in the finest role of his outstanding career is symbolic of \"every-man\". His dreams are based on professional successes, which by gaining money and fame, he will be happy in his life. As we know in so many cases, that obtaining fame and money leads many people down an even deeper road of depression and self-destruction. For without emotional success, without love, a person is empty inside. A powerful film. Not a boxing film at all. Boxing is merely the symbolism here; fighting to succeed. \"I win the fight and I get my wife back\", says Keach's character, Billy Tully. A great movie, but one that leaves you feeling sad; pondering your own hopes, dreams, and desires. A remarkable supporting cast, high-lighted by a young Jeff Bridges, make FAT CITY one of John Huston's most memorable films. A Champion of movie-making.",
         "The 1970s produced some of the greatest American movies of all time, that's indisputable. But while everyone focuses on (the admittedly very good) more famous works by Scorsese and Coppola, many equally worthwhile movies get little attention - 'Bring Me The Head Of Alfredo Garcia', 'Scarecrow', 'Fingers', 'Tracks', 'The Panic In Needle Park', 'Blue Collar', and this one, arguably John Huston's most underrated film. The four leads Stacey Keach ('The Ninth Configuration'), Jeff Bridges ('The Last Picture Show'), Susan Tyrrell ('The Killer Inside Me'), and Candy Clark ('American Graffiti') are all outstanding, and in Keach's case it's possibly his finest performance to date. What an underrated actor Keach is! This is a powerful and haunting look at the underbelly of American working class life, a subject very rarely dealt with honestly in contemporary Hollywood films. 'Fat City' doesn't deserve its obscurity. It is a small masterpiece. Highly recommended to people who value downbeat and realist dramas more than dumbed down popcorn \"entertainment\".",
         "Huston always had an eye for characters. His movies almost all dealt with the concerns of lower middle class working joes, the \"regular fellows\" with whom Huston somehow identified in the romantic Hemingwayesque lantern jawed \"a man's gotta do what a man's gotta do\" tradition. But his characters were more than mere macho he-men. They displayed genuine and uncommonly powerful vulnerabilities, hopes and dreams, flaws and finally cynicism. After an incredible first 20-plus creative years, Huston floundered for almost a decade with commercial and artistic disappointments (FREUD, THE BIBLE, THE KREMLIN LETTER, SINFUL DAVEY among them) before coming back to his wheelhouse with the carefully subdued yet deeply affecting character study FAT CITY. FAT CITY is a grand return to form for Huston precisely because it is so indelibly imbued with real life in the form of its unforgettably true characters. None of these people are particularly remarkable individuals (frankly they are mostly below average in self-awareness, skills and intelligence), yet because Huston is so skillful at revealing character through the carefully structured unfolding (and gradual unhinging) of Keach's character, we are given insights which Keach (and Bridges and Candy Clark and the wonderful Nicholas Colasanto) can't make for themselves because they are too close to their own situations. Bridges has a nice interlude and Colasanto is so good in his limited Burgess Meredith Mickeyesque role, but the heart of this movie is Stacy Keach, who rises to the occasion with uncommon subtlety and power. It is a rare movie that can document losers in their daily lives without editorializing or sermonizing. FAT CITY takes an unflinching glance at these people and shows us things which seem prosaic on the surface but which upon examination hide deeper meaning (and heartbreak). There are no pyrotechnics, no real twists, no witty or stand out dialogue exchanges, not much going on with the camera (though Hall's coloring is as always very well chosen), and very little budget on display in FAT CITY. It appears Huston shot pretty much everything on location in the flophouses around Stockton, CA. Yet the performances are uniformly outstanding and we come to care about these losers as they fumpher through life kidding themselves about where they've been, where they are and where they are going. I can't think of a movie where less actually happens to the characters (maybe BARFLY) but where I still find myself so deeply involved. Whenever I see it playing on the tube I generally stay with it all the way. There are very few movies in that league for me. Warning: do NOT go in expecting crowd-pleasing Rocky-esque boxing sequences. This is less the story of a Rocky and more the story of a Spider Rico (the \"ham n' egger\" Rocky beats up in his first fight and from whom we never hear again.) The movie disguises itself as a Horato Alger-like comeback or underdog story initially, but it is ultimately one of the bleakest, realest character studies you're ever likely to see. One of the best Huston movies to come after the 1960s and a downbeat classic. 9/10.",
         "The down-to-earth tale of two small hall boxers -- at the opposite ends of their careers -- and the blows they take in and out of the ring. This is one of the best American movies ever about normal working class lives where failure is common and the only thing you can do is pretend otherwise or drug it all away to nothing. I know why so many people prefer Rocky to this -- this is too real for them. Indeed it is almost too real for me! Stacey Keach was given the role of lifetime in this. He really does look like a failing boxer turned to flab (although maybe that is nature -- not punches!) trying to find a life (of sorts) beyond the ring. Bridges really does look and sound like the daydreamer believer that makes the boxing game go round. Johnny No Talent who thinks he is Mike Tyson when his face finally clears up. They don't make films like this anymore. The Europeans can, although they are rarely shown and end up too self indulgent. Everyone here gets what they deserve, which is sadly, very little. That is what sport is about in real life -- lots of people failing so that are very small few can succeed. The best the majority can hope for is some exercise and comradeship. (This contrasts with most sports movies -- which are about glory. Or at least glory through struggle.) This is the best late John Huston film and every single frame is a frame of reality and believability. Maybe that is what leads so many people to say \"so what\", the world outside their window has many of the same elements and there are many times you feel you are -- indeed -- looking at real life.",
         "John Huston is amazing to me. He defined an entire genre with his foot barely in the Hollywood door, then he kicked the door down and walked in to clear well deserved Oscars as both writer and director, he took his Oscars with him to Africa to get hammered with Erol Flynn and go out on safaris leaving behind him a big production to go to hell, then came back to find they had nailed a new door in place of the one he had torn down so he didn't bother to knock at all this time, he packed his things and went to a small dingy bar where Mexicans and barflies go to kill their time to make movies about killing time, movies about misfits and people who are dead inside, movies like Fat City and Under the Volcano, to adapt Flannery O'Connor and James Joyce, to soar above and beyond what anyone might have expected from any director of his generation. It's 1972 and John Huston is still relevant as ever. How many directors can you name who turned out some of their best material in their fifth decade directing movies? Venerable relics like Clint Eastwood move over, American cinema (not simply Hollywood) already had a patriarch in place long before any of you looked through a viewfinder. It's also amazing to me how an indomitable absolute badass of a successful director can know failure so well. This is a movie where people box but it's not about boxing. There's no triumph to be had here and the crowd gathered in the small suburban boxing hall in Stockton, California, to pass their time is not there to be pleased. Most of them are probably the same kind of deadbeat with no future and a sh-tty job as the third-grade boxers who beat each other for their amusement. We get the young upstart boxer with the fast legs and a bright future ahead of him if only someone could train him right but this character can only make sense when we see him standing next to Stacy Keach, the aging boxer who won't see thirty again and who maybe had a chance once but blew it for women and alcohol and now he's desperate for one last throw of the dice. The sad beauty of Fat City is that we're not looking at some kind of last defiant stand, we don't enter the ring for one last moment of triumph with the lights blaring bright and the crowd cheering, this is not The Wrestler anymore than it is Rocky, the lights were not only dimmed long ago but they probably never shone bright enough anywhere except in the protagonist's head. The closest Stacy Keach came to glory some odd 10 years ago was in itself a failure. Were his eyebrows slashed with a razor or not that fateful night down in Mexico we never find out. For most of its duration Fat City is a beaten man with sunken cheeks and a grim unshaven wan face wearing an expression of incredulous outrage. Then we're inside a rundown cafe, the walls are painted in sickly washed-out colors and old men play cards around tables in felt, and we sit down for one last cup of coffee on the cheap formica counter. We see the young boxer standing next to the washed-up has-been one who can't even be a mentor anymore and an old man, a walking shell of someone \"who was maybe young once\", comes over to serve us and it all makes sense. \"Maybe he's happy\" says the young one. \"Maybe we all are\" says the other, and we know we're not, life doesn't quite work out that way, but it's all we have. The old man turns and smiles a toothless smile (senile or knowing, who's to say) and Fat City fades out into one of the most touching heartfelt endings I've seen. Fatalists cannot afford to miss this one, it's the stuff dashed hopes and broken lives are made of. Rejoice.",
         "Probably one of the most realistic films about boxing. Not the big prime time fights but the small time boxing matches that spring up in town after town. Great performances all around with extra notice to Nick Colasanto as Ruben who could be related to his Coach in \"Cheers\" and Stacy Keach as the brain-addled old fighter that will never be able to quit. His fight scene at the end with the Mexican boxer who is only there for a paycheck win or lose, really says a lot about how boxing can be a pathetic sport. Keach's Tully is probably how a lot of boxers end up. Typical late John Huston film that focuses on the underbelly of American society. And a good one too.",
         "American audiences don't generally go in for realistic stories of human despair and suffering that offer very little in the way of hope or relief. This may explain why John Huston's Fat City has been condemned to obscurity, a real shame considering what a great flick it is. It's the sort of movie you see and remember but can't quite pick it out of a line-up... a shuffling, mumbling story of down-and-out pugs in an off-the-map burgh. You're taunted with the possibilities of the story picking up to... well if not epic at least noteworthy proportions... but, all of the characters' minor victories are mitigated by their simultaneous defeats. Keach's Tully is the main thrust of the story, though it tends to veer off on the occasional tangent. A has-been who possibly never really was, crushed by the departure of his wife and overwhelmed by the constant little defeats in his life. Huston really drives this point home, that all of these little defeats add up. Without giving too much away, suffice to say Fat City is a film where mood overshadows plot. The mood is indelibly rendered by Conrad Hall's dark, dirty images, which nearly swallow the characters in the depth of their shadows. Watching it back to back with fellow pugilist opus Raging Bull (1980), it's easy to see that Huston was a keen observer of human behaviour, while Scorsese was a keen observer of Hollywood films of the thirties. And don't even talk about Rocky. I would compare it favourably with Barbet Schroeder's Barfly (1987), another film about fringe life in California, and even Vincent Gallo's excellent Buffalo '66 (1998), though of the three it is the bleakest and the least accessible.",
         "How in the world did I miss Fat City's greatness all these years? Ignore the rhetorical question. I read the Leonard Gardner novel when it was published and vastly enjoyed its subdued magic. If I saw the movie, it went past me as an Grad Intern pulling all nighters, and then zoning out during movies in first-run theaters. My friends knew \"Great Movies\" didn't they? I wasn't gonna stay in and miss out. Last night, I saw Fat City with \"new eyes\" - or for the first time! The cast was like a Repertory Theatre cast: All spoke like people speak. Even the local LA boxing legends of my youth. It's far too understated to be compared to \"Raging Bull\" and proves there was never a recognizable entity like a \"John Huston-style\" movie. Astonishing.",
         "'Fat City' has an solid and hard-won reputation. It was released to the cinema in 1972 with little fanfare. It got good notices but was one of those films that could not expect immediate success with a fickle public prone to more showy attractions; today it has a loyal following amongst those not oblivious to its virtues. As embarrassing as it is to admit, on discovering 'Fat City' I clasped it to my heart in gratitude: I had found something worthy of my attention that was not Hollywood vulgarity nor mindless escapism for the great unwashed. It was a film with backbone, a film with brain. 'Fat City' is an unforgettable portrayal of lost and lonely people quietly losing what is left of their lives. They struggle to survive but the struggle is pointless and they are left at the mercy of an unyielding fate that can only be guessed at, because of the film's refusal to pander to audience expectations of mindless resolutions and resolutely happy endings. Winning isn't the issue, but how much it's going to cost merely to survive. But most of all 'Fat City' is a film with its heart in the right place. The characters are not remarkable, they may not even be bright, but they are real and breathing people being photographed as their lives are disintegrating in front of us. Such an approach was relief from the stifling boundaries of Hollywood notions of entertainment when I first saw the film on ex-rental VHS and remains so today. The characters in this story are played by Jeff Bridges as Ernie, and Stacy Keach as Billy. Ernie and Billy are both going in opposite directions in their lives one up (supposedly) and the other down. They make a connection with each other for the purposes of mutual support and camaraderie, both scarcities in the world of small time boxing in Stockton California where the movie is set. Billy has already begun his downward trajectory towards oblivion for personal and professional reasons. He meets Ernie, an inarticulate young man with some talent and sets him on his way to what they both hope will be a successful boxing career. Things however, don't go entirely to plan. Candy Clark plays Jeff's girlfriend, a lost soul, who seems incapable of making her own decisions. A relatively unknown actress Susan Tyrell received an Academy Award nomination as Best Supporting Actress for her part as Oma, Stacy Keach's mentally unstable girlfriend. Both give standout performances, but Tyrell's is more showy, and it's understandable why the Academy took notice. The film was shot on location in Stockton, and the rest of the cast appear to be locals who effortlessly give the film an authenticity which is so rare for a mainstream American film. Finally, the Kris Kristofferson ballad 'Help Me Make it Through the Night' is prominently featured to excellent effect, in order to illustrate the desolation and loneliness of the main characters. The lack of a driving narrative is actually one of the virtues of 'Fat City', It makes up for this with lots of atmosphere and interesting and believable people. It takes it's time to tell what story there is, and is almost Thomas Hardy-like in its sense of fatalism. I could be facetious by describing 'Fat City' as a hybrid of Thomas Hardy, with a bit of 'Barfly' thrown in. The two films are strikingly similar in their portrayal of the working class streets of an anonymous, American city, and its characters, largely inarticulate and living on the fringe, which is a polite way of saying that they're poor. It strikes me with these kinds of films which don't wish to be seen as mainstream, how bold they are in depicting the reality of poverty in America as if being poor is a crime. I think this kind of approach is more of a reality now than it was when 'Fat City' was originally made. Boxing is portrayed in 'Fat City' as a nasty, unpleasant business that scars the lives of the men and women who inhabit it and suffice to say, this isn't your conventional Hollywood boxing film. It's not remotely like any other and to compare 'Fat City' with 'Raging Bull' is like comparing aesthetics to real human engagement. Huston has an interest in the characters both as human beings with the ability to act freely (at least once), as well as victims of a corrupt society which really doesn't care for them. The fetishisation of two men pounding it out in the ring is of no concern to Huston, but rather the dubious morality of feeding unrealistic expectations to the poor and disenfranchised when their lives are not enriched but destroyed by the notion of an American 'success' which they crave for themselves but can never achieve because of an unjust economic inequality entrenched in the American system. If this seems like an overly didactic interpretation of the film, it's because the realism it displays is endemic and one cannot help, if one respects a film, to treat it on its own terms instead of offering a critique that is not adequate to its purpose. According to other critics more influential than I, 'Fat City' is right up there as one of John Huston's best films, and is believed by many to be his crowning achievement. There are some who even rate it as one of the best films of the '70s, but the fact is that this has been far less seen, than other, better known and more familiar titles, that it could be argued, are not nearly as good. For so many reasons, 'Fat City' deserves to be seen by a larger audience who I am sure would appreciate it as much as those who have been lucky enough to see it in the past. For anyone reading who hasn't, you won't fail to be captivated by the lyricism and meaningful human truths of 'Fat City'."
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Rastar Pictures"
      ],
      "summaries": [
         "The film tells the story of two boxers and their problems. One of them is on the decline of his career while the other one just begins his ascent in this sport.",
         "Two men, working as professional boxers, come to blows when their careers each begin to take opposite momentum."
      ],
      "budget": 0
   },
   "movielensId": 5986,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-07-26",
      "dvdReleaseDate": "2002-12-10",
      "directors": ["John Huston"],
      "runtime": 100,
      "movieId": 5986,
      "title": "Fat City",
      "mpaa": "PG",
      "actors": [
         "Stacy Keach",
         "Jeff Bridges",
         "Susan Tyrrell",
         "Candy Clark",
         "Nicholas Colasanto",
         "Art Aragon",
         "Al Silvani"
      ],
      "imdbMovieId": "0068575",
      "originalTitle": "Fat City",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "voMK5RG-4WA",
         "AqB9xbDjvRM",
         "sVXhoiS0BPA"
      ],
      "plotSummary": "Two men, working as professional boxers, come to blows when their careers each begin to take opposite momentum.",
      "tmdbMovieId": 16993,
      "avgRating": 3.72222,
      "releaseYear": "1972",
      "numRatings": 135,
      "posterPath": "/xRjvUQqqMUACGre1IVJJwip8WVd.jpg"
   }
}