{
   "tmdb": {
      "original_language": "de",
      "keywords": [{
         "name": "comedy",
         "id": 10267
      }],
      "imdb_id": "tt0071483",
      "video": false,
      "title": "Wrong Move",
      "recommendations": [
         29722,
         84956,
         41834,
         28642,
         30363,
         188223
      ],
      "backdrop_path": "/uRRdPUIqBnUgf1LjnUIkCUwwbhm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Wilhelm",
               "gender": 0,
               "credit_id": "52fe43d3c3a368484e000389",
               "name": "Rüdiger Vogler",
               "profile_path": "/dUUXAwPRMkRdv5PSGv8ndWvztDW.jpg",
               "id": 5266,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Laertes",
               "gender": 2,
               "credit_id": "52fe43d3c3a368484e00038d",
               "name": "Hans Christian Blech",
               "profile_path": "/plrW2sGmpPq6Uv6OEaDrokb1H5f.jpg",
               "id": 23694,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Therese Farner",
               "gender": 1,
               "credit_id": "52fe43d3c3a368484e000391",
               "name": "Hanna Schygulla",
               "profile_path": "/rlM0TCA5NNLQ9SwP4Cn4PhmaGgy.jpg",
               "id": 3734,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mignon",
               "gender": 1,
               "credit_id": "52fe43d3c3a368484e000395",
               "name": "Nastassja Kinski",
               "profile_path": "/4ru0isgjh43sPCpHMyXa0OuLkJn.jpg",
               "id": 2630,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Bernhard Landau",
               "gender": 2,
               "credit_id": "52fe43d3c3a368484e000399",
               "name": "Peter Kern",
               "profile_path": "/eS7EYsJO9Pp9mbYijUPBgmEdiEH.jpg",
               "id": 73671,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Industrieller / The Industrialist",
               "gender": 2,
               "credit_id": "52fe43d3c3a368484e00039d",
               "name": "Ivan Desny",
               "profile_path": "/s1UPN4N3CiIsfyiPU2VV3ynpInS.jpg",
               "id": 9928,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mutter / The Mother",
               "gender": 1,
               "credit_id": "52fe43d3c3a368484e0003a1",
               "name": "Marianne Hoppe",
               "profile_path": "/80drPXXtIAejvYRpuIEuehH6Uxl.jpg",
               "id": 39755,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Janine",
               "gender": 1,
               "credit_id": "52fe43d3c3a368484e0003a5",
               "name": "Lisa Kreuzer",
               "profile_path": "/ur06QfGJtQDONbLGeY11JsPNaf3.jpg",
               "id": 22612,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43d3c3a368484e000379",
               "name": "Wim Wenders",
               "profile_path": "/ruRe7v4OaDE0zG6PLbwHDomhVLq.jpg",
               "id": 2303,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d3c3a368484e00037f",
               "name": "Johann Wolfgang Goethe",
               "profile_path": null,
               "id": 66797,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d3c3a368484e000385",
               "name": "Peter Handke",
               "profile_path": "/tonwLQzN0dDPCA3N7H9iiKUPIkp.jpg",
               "id": 2305,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5897a4199251417a88000221",
               "name": "Peter Przygodda",
               "profile_path": null,
               "id": 2309,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5897a42cc3a3687712000206",
               "name": "Jürgen Knieper",
               "profile_path": null,
               "id": 2308,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5925157cc3a368782d008f41",
               "name": "Robby Müller",
               "profile_path": "/d9Fz3vBIBBYUXYbPTIxo2FwYGSL.jpg",
               "id": 1632,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.19285,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 20017,
      "vote_count": 10,
      "budget": 0,
      "overview": "Six days in the life of Wilhelm: a detached man without qualities. He wants to write, so his mother gives him a ticket to Bonn, telling him to live. On the train he meets an older man, an athlete in the 1936 Olympics, and his mute teen companion, Mignon. She's an acrobat in market squares for spare change.",
      "similar": [
         435126,
         37247,
         289,
         947,
         703,
         50620,
         10530,
         67308,
         51828,
         372058,
         329865,
         20943,
         19995,
         812,
         16290,
         270946,
         49013,
         10719,
         37710,
         62206
      ],
      "original_title": "Falsche Bewegung",
      "runtime": 103,
      "poster_path": "/eGe4mIFdoBC5OzAsoy6GAW6yDcg.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Wim Wenders Stiftung",
            "id": 36229,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Albatros Produktion",
            "id": 2592,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Solaris Film",
            "id": 1001,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Westdeutscher Rundfunk (WDR)",
            "id": 7025,
            "origin_country": ""
         }
      ],
      "release_date": "1975-01-01",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "West Germany",
      "color": "Color",
      "budgetCurrency": "DEM ",
      "directors": ["Wim Wenders"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Johann Wolfgang Goethe",
         "Peter Handke"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0071483/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NTE4MjEyOV5BMl5BanBnXkFtZTcwMTI2MzA0MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Rüdiger Vogler, Hanna Schygulla, Hans Christian Blech | See full cast and crew »"],
      "reviews": [
         "Wenders' road movies of the 70s have a charm that makes them accessible to many viewers, yet are often linked by the less accessible themes of alienation and detachment. It is an interesting dichotomy and one that comes to focus with this film. Political and cultural pre-determinism are not as easily digested outside the German point of view in the 70s, yet it is a common theme amongst Wenders films as well as (arguably) Herzog & Fassbinder (New German cinema contemporaries) . One does not have to be a philosophy or poli-sci major to enjoy this film however. The fact that Wrong Move is freely based on Goethe's \"Wilhelm Meister's Apprenticeship\" is easily overlooked by the casual viewer - but if viewed as an allegorical narrative, like Goethe's work, parts of the film come together and make this obtuse, personal work by Wenders more interesting. The characters Wilhelm (Rudiger Volger) meets during his trip represent ideological sensibilities of 70s Germany. Mignon played by the teen Nastassja Kinski represents the youth and future of Germany (mute, trusting yet undemanding). Laertes represents the idealism of old Germany, and considers himself a martyr for the Nazi cause. Wilhelm and Therese (Hanna Schygulla) are between these 2 and take action to liberate one from the other. All is told in an un-naturalistic style that only works in some cases. The long (almost single take) walk up the hillside by the river are a good example of where the film shines. The photography by Robby Müller is consistently excellent here. It's a difficult film but rewarding to those who take time to understand it from it's original historical and ideological context. Worth seeing for the cinematography of Müller and the presence of Hanna Schygulla and Nastassja Kinski.",
         "Many people spring to life when expressing their contempt for Wim Wenders' films, pushing themselves toward new heights of eloquence...and for that reason I usually keep my admiration for him to myself but this movie and the Goalie's Anxiety (not the easiest film to watch) really hit the nail on the head. Incredible portraits of people (in this case men) who have itches that they just can't scratch! In one scene the \"hero\" listens to the ex-Nazi make some crack about Jesse Owens getting the gold medal and he says,\"..so you wouldn't have stood on the platform next to a black man?\" and I thought, \"I would give anything to see an American movie with a conversation as half as real as this!\" You think Wenders is boring? Ok, fine, he's boring. But American movies are phony, like Mcdonald's french fries, they're treated with formaldahyde to maintain their \"natural\" color.",
         "\"Falsche Bewegung,\" (In the US called \"The Wrong Move\") is one of the finest films ever produced in Germany and certainly of of film guru Wim Wender's best works. An analysis of the sentiments, both serious and humorous, of the citizens of Post-war Germany, the feelings of guilt, loss, anger, and misdirection is so clearly and frighteningly distributed to the audience it really brings you to thought and to tears. A masterpiece.",
         "\"The Wrong Movement\" is the second of three films by Wim Wenders about a disaffected man (in each case played by Rüdiger Vogler) searching for himself out on the open road. Unlike the first (Alice in the Cities) and third (Kings of the Road) films, this one is infinitely less accessible. It's the talkiness that brings it down in the end. Each character seems especially in touch with their own highly specific brand of angst. It's almost too easy to identify with, all the abstract alienation. We all feel it sometimes, but do we actually spend so much time speaking of it? This depiction of dark truth doesn't make it a good story, only an honest one. The actors are good (Nastassja Kinski plays a mute, in her first role), but the characters are cold. The dialogue is impressive, yet bereft of all beauty. On some inherent level, it's apparent that all the characters deeply despise one another. Wilhelm himself testifies at the very start to his dislike of people. Wim Wenders seems to be doing very much the same. Only, this time, it doesn't make for a very good film. Its shorter length is almost a relief.",
         "This early Wim Wenders film is about a frustrated writer who is encouraged by his mother to take a train trip to Bonn. On the way he meets an odd assortment of characters including a former concentration camp guard who is now a street musician, a mute teenage acrobat, a semi-famous actress, a hilarious overweight would-be poet, and the latter's \"uncle\", a depressed suicidal recluse. The film is rather talky and philosophical, frequently meditating on the nature of artistic creation itself. It has kind of morose atmosphere to it like Wender's later film \"Paris, Texas\", but without the redemptive ending. For lack of a better word I would call it existentialist. Like \"Paris, Texas\" it's kind of an existentialist road movie except that the characters travel by train. The only recognizable actor in this is a young Nastassia Kinski. This isn't nearly as sexy as one of her late 70's/early 80's roles (but like \"To the Devil a Daughter\" a year later, it's probably sexier than it ought to be). Still, whereas most male directors at the time were mostly interested in undressing Kinski (both on and off screen), Wenders can be credited at least with making her a more respected actress, mostly with her later role in \"Paris, Texas\", but also to a lesser extent with her debut role in this. I can see why people find this kind of slow-going and perhaps a little depressing. But I found it quite interesting and actually enjoyed it.",
         "Basically the story of a man who finds that six days of travel doesn't broaden his mind. Made on a tiny budget, on a very tight four-week shoot, TWM punches well above its weight. Full of incident and drama, but none of it is related to anything but the general theme of \"life is sh*t and then you die\" - which you soon get used to; and some of it's actually very funny. A group of six people drift together, then drift apart. All of them are disenfranchised from politics, society and love, and the dialogue is typically Pinteresque: long pauses, non-sequiturs and deep feelings not being expressed, just like real-life dialogue. Thought-provoking and haunting, beautifully filmed and acted,, TWM is a great \"mood movie\". You may find it frustrating if you're looking for resolution or even logic, but the observations about life and people in general are as true as you'll get. Woody Allen, eat your heart out.",
         "\"The Wrong Move\" is essentially a plot less film about loneliness that follows a late twenty-ish year old, blond German writer-to-be for six days. He is someone who is in search of something. The film is in German with English subtitles and is unusual in that there are occasional first person voice over/commentaries by the principal character by which we know exactly what he is thinking. The film is set in the early 70's with a short audio track of American rock that dates the movie. Through his first person commentary, the writer freely admits that he is not very good at observing people nor does he like people, which leads one to wonder what kind of writer is he? Because \"The Wrong Move\" is a Wim Wender's film, one inevitably notices the carefully composed shots with meticulous attention to detail. This brief odyssey is a more sophisticated version of candid camera in which the confused writer encounters a handful of people. The film, then, is about his interactions with these people. These characters appear randomly, interact, and disperse. This is probably Nastassja Kinski's first film. If not, then the likelihood of ever watching whatever preceded \"The Wrong Move\" is close to zero. Long out of print, \"The Wrong Move\" was only available on scarce, hard to find VHS tape that can be exorbitant in cost, but now is one of eight DVD's in the Wim Wenders Collection Vol 2. It is extremely unfortunate that the DVD has been enhanced for pseudo wide screen, meaning that the original 4:3 image has been chopped, losing some of the image of the original VHS tape. The film was low budget and has attained near cult following among some. Nastassja was a whole thirteen years old when \"The Wrong Move\" was filmed. This was the first of three films that she has made with Wim Wenders with the other two being: the legendary 1984 \"Paris, Texas\" and the powerful 1993 \"Faraway, So Close.\" In \"The Wrong Move,\" Nastassja is cast as a mute - meaning that she doesn't speak, has no lines of dialog, and doesn't use anything resembling sign language. Her on screen presence is then all facial expression and body language. In some scenes she looks like a scruffy, scrawny twenty year old. Other times, she has the face of a twelve year old. Sometimes she is a well made up teenager. Sometimes not. But there are always the tennis shoes and the way that she walks that underscores that she is a very young adolescent girl. In the hands of Wim Wenders, her performance is fluid and natural. She and her much older male companion/guardian make their living with Nastassja as a street performer - one that is not highly skilled and in some respects awkward. That has to do more with her young age, rather than a lack of physical skills. Nastassja is a juggler and not a very good one as she usually drops one of the balls. One time she stands on her head, another time she does cart wheels. Eight years later in \"Exposed\" this gymnastic talent would be on full display in a very sexy, solo performance in front of an all seeing mirror. There is one particular memorable scene in which the writer and the band of strangers are walking through a neighborhood street, observing the interchanges between residents on the roof top of the buildings. The timing is exquisite, the look on Nastassja's face is memorable - but that is Wim Wenders and is an indication of the potential first rate talent in this thirteen year old girl. It is no accident that Nastassja is in so many scenes and some of those appearances are very brief. Even in nothing scenes in which she is not doing anything out of the ordinary, Nastassja is focused - not sleeping or bored. Peter Sykes, the director of \"To the Devil...a Daughter,\" would later see \"The Wrong Move,\" remember her, and later on in need of a young German actress would hire Nastassja. It is all to easy to see \"The Wrong Move\" as a very superficial movie. Even the translation of the title presents a problem. Should it be \"Wrong Movement?\" \"False Movement?\" \"wrong\" and \"false\" imply that there is a \"right\" move or that one has strayed from the \"right\" path and is in search of it. Is there a \"right\" path? Is there a \"wrong\" path? What is the path? Does it make a difference? These are the types of questions that go to the core of the human experience. There is depth here, but only for those who can \"see\" into it.",
         "Rudiger Vogler plays a dull, young man who still lives with his mother. He wishes to be a writer, and his mother gives him a push at it when she kicks him out, forcing him to experience the world on his own. This is kind of an abstract narrative. Vogler drifts along picking up new companions, who then accompany him and chat with him on long walks. It's interesting at first, but, frankly, the talk gets pretty boring after a while and it never really goes anywhere. A visual cue in the very first scene should have tipped me off about what I was getting into: William Faulkner's sophomore novel, Mosquitoes, is propped up in an awkward position against a wall so we're sure to see it. Not many people have read that one, and for good reason: it isn't any good. But it follows a very similar structure, as it's about a group of banal people who talk a lot. The story itself is purportedly based on a Goethe novel. Hanna Schygulla and a very young and adorable Natassja Kinski co-star (I kind of suspected Kinski was extremely young, but she was only 14 when the film premiered and she appears topless in the film, which is quite icky).",
         "I've noticed that many reviews about \"art films\" are written by people who have already decided to like them. This is the only way for me to explain why so many uninspired films are unavoidably hailed as master pieces - maybe it is because of the \"artistic patina\" that covers them, and Wim Wenders, after all, has got himself a name. For me it's a very simple question: Did I like the film? It doesn't matter who directed it, or anything like it. Well, I THINK didn't like the film. Why? I'll try to answer it. \"Falsche Bewegung\" is based freely on Goethe's \"Wilhelm Meisters Lehrjahre\" (another reason why \"art film\" buffs SHOULD like this film). Wilhelm is tired of life and wants to become a writer. He leaves his mother and starts on a self-discovery journey. On the train, he meets an old athlete of the 1936 Berlin Olympic Games and his assistant Mignon, a mute acrobat (lovely Natassja Kinky). During a train stop he sees a woman staring out of a window of another train, Therese (Hanna Schygulla). In a road house they will know an amateur metaphysical poet. And these characters will unite and travel together searching for the meaning of life - reflexions on politics, the meaning of life, love, the need for action, metaphysical poetry... but no emotional links are established among the characters. Maybe it is because this film is seen through Wilhelm's eyes and all he really wants is to write a book. The film floats in emptiness - what moves the characters and makes them stick together remains a mystery - after many deep conversations, melancholy, and nothing else, I was really tired, and I almost decided to call it a day. But I gritted my teeth and watched the film to the end. When the film ends, the group has disbanded, each goes his/her own ways and Wilhelm is left alone brooding that he had made again \"the wrong move\", because he couldn't establish any emotional links with anyone. Emptiness, grey skies, hopelessness... Now, beware you \"art film\" buff - if you want to compare Wim Wenders with Antonioni or Bergman, you're on the wrong track. In Antonioni or Bergmans films, there's is loneliness and alienation, all right, but their films portray deep emotional troubles that come from human relationships, while this film, in particular, shows nothing at all, just emptiness followed by empty words. Nothing plus nothing equals nothing.",
         "I wouldn't call it a masterpiece. And, to be honest with you, I haven't seen \"The Wrong Move\" in many years. That said, I possibly lacked the life experience(s) to understand the unspoken message. But I did find the \"freeflow\" aspect of the journey interesting. Certain visual images along the way were filmed matter-of-fact, like Truffaut's characters who appear dramatically and yet, have no actual connection to the story. I remember feeling unsatisfied with the film's resolution. (How the \"journey\" was resolved). But then again, perhaps it was unrealistic to expect anything else."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Albatros Produktion",
         "Solaris Film",
         "Westdeutscher Rundfunk (WDR)"
      ],
      "summaries": ["Six days in the life of Wilhelm: a detached man without qualities. He wants to write, so his mother gives him a ticket to Bonn, telling him to live. On the train he meets an older man, an athlete in the 1936 Olympics, and his mute teen companion, Mignon. She's an acrobat in market squares for spare change. An actress, whom Wilhelm gazes at, joins them. Then, a plump young man introduces himself, having heard them talk of poetry. He takes them to his uncle's, except it's the wrong house; they interrupt a man's suicide. He invites them to stay. The actress tries to connect to Wilhelm. Couplings and rare bursts of feeling come as surprises; other characters remain alone."],
      "budget": 620000
   },
   "movielensId": 59893,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1975-01-01",
      "dvdReleaseDate": "2006-12-05",
      "directors": ["Wim Wenders"],
      "runtime": 103,
      "movieId": 59893,
      "title": "Wrong Move",
      "mpaa": "",
      "actors": [
         "Rüdiger Vogler",
         "Hans Christian Blech",
         "Hanna Schygulla",
         "Nastassja Kinski",
         "Peter Kern",
         "Ivan Desny",
         "Marianne Hoppe",
         "Lisa Kreuzer"
      ],
      "imdbMovieId": "0071483",
      "originalTitle": "Falsche Bewegung",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Six days in the life of Wilhelm: a detached man without qualities. He wants to write, so his mother gives him a ticket to Bonn, telling him to live. On the train he meets an older man, an athlete in the 1936 Olympics, and his mute teen companion, Mignon. She's an acrobat in market squares for spare change.",
      "tmdbMovieId": 20017,
      "avgRating": 3.13158,
      "releaseYear": "1975",
      "numRatings": 19,
      "posterPath": "/eGe4mIFdoBC5OzAsoy6GAW6yDcg.jpg"
   }
}