{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0089847",
      "video": false,
      "title": "The Protector",
      "recommendations": [
         10753,
         18763,
         18857,
         21519,
         25539,
         10974,
         18741,
         21733,
         19274,
         11563,
         38902,
         42186,
         50916,
         16407,
         38034,
         17205,
         18262,
         14570,
         62851,
         218460
      ],
      "backdrop_path": "/t56sgTopKQohzZRz5kFe88UdgRl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Billy Wong",
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f8110591",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Danny Garoni",
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f8110595",
               "name": "Danny Aiello",
               "profile_path": "/UvPalkz4ynJJrTcrbpfD05gVoO.jpg",
               "id": 1004,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Mr. Ko",
               "gender": 0,
               "credit_id": "53f9db43c3a3687355002eab",
               "name": "Roy Chiao",
               "profile_path": "/6gBxdImc8eGHeDDEJGFiGrIwx6O.jpg",
               "id": 695,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Soo Ling",
               "gender": 1,
               "credit_id": "53f9db5fc3a3687352002e15",
               "name": "Moon Lee",
               "profile_path": "/i0LogkFwDWwIfvMDkT4T3vmmO8l.jpg",
               "id": 544779,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Lee Hing",
               "gender": 2,
               "credit_id": "53f9db80c3a368735b002da8",
               "name": "Peter Yang Kwan",
               "profile_path": "/nIB5UY2j7AQyE5LuDAvR14HptmR.jpg",
               "id": 1275566,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Gang Leader",
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f8110599",
               "name": "Sandy Alexander",
               "profile_path": null,
               "id": 134877,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jesse Alexander",
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f81105a9",
               "name": "Jesse Cameron-Glickenhaus",
               "profile_path": null,
               "id": 134880,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Samantha Alexander",
               "gender": 1,
               "credit_id": "53f9dbadc3a368734c002d20",
               "name": "Becky Ann Baker",
               "profile_path": "/9gvQnoCjPirtC656XmKqex3tLAn.jpg",
               "id": 59206,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Stan Jones",
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f81105a1",
               "name": "Kim Bass",
               "profile_path": null,
               "id": 134878,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "May Fung Ho / Sally",
               "gender": 0,
               "credit_id": "53f9dbcbc3a368735b002dad",
               "name": "Sally Yeh",
               "profile_path": "/ebMhexM72sv8L5HGPIQ2xIdWuRg.jpg",
               "id": 67046,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Mr. Booar",
               "gender": 2,
               "credit_id": "53f9dbe3c3a3687361002d32",
               "name": "Paul L. Smith",
               "profile_path": "/1NZXecko55r4vchJkUAshliIctS.jpg",
               "id": 39782,
               "order": 10
            },
            {
               "cast_id": 11,
               "character": "Benny Garrucci",
               "gender": 2,
               "credit_id": "538615efc3a3681af00016c7",
               "name": "Bill Wallace",
               "profile_path": null,
               "id": 87471,
               "order": 11
            },
            {
               "cast_id": 7,
               "character": "Police Captain",
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f811059d",
               "name": "Victor Arnold",
               "profile_path": "/tr3HJuPI69xsJiSCV0gske7jNnY.jpg",
               "id": 6565,
               "order": 12
            },
            {
               "cast_id": 9,
               "character": "Masseuse #1",
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f81105a5",
               "name": "Irene Britto",
               "profile_path": null,
               "id": 134879,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f8110581",
               "name": "James Glickenhaus",
               "profile_path": null,
               "id": 99032,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c1c3a36847f8110587",
               "name": "James Glickenhaus",
               "profile_path": null,
               "id": 99032,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c1c3a36847f811058d",
               "name": "King Sang Tang",
               "profile_path": null,
               "id": 69886,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a6d0c10c3a3685552010aff",
               "name": "Evan A. Lottman",
               "profile_path": null,
               "id": 57925,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.476061,
      "production_countries": [
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 45408,
      "vote_count": 44,
      "budget": 0,
      "overview": "Billy Wong is a New York City cop whose partner is gunned down during a robbery. Billy and his new partner, Danny Garoni, are working security at a fashion show when a wealthy man's daughter, Laura Shapiro, is kidnapped. The Federal authorities suspect that Laura's father is involved with Mr. Ko, a Hong Kong drug kingpin, so the NYC police commissioner sends the two cops to Hong Kong to investigate.",
      "similar": [],
      "original_title": "The Protector",
      "runtime": 91,
      "poster_path": "/wINnrnHDiHYNkNSqkp36CbmeAHw.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Golden Harvest Company",
            "id": 2521,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Golden Way Films Ltd.",
            "id": 3054,
            "origin_country": ""
         }
      ],
      "release_date": "1985-07-11",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Now, New York has a new weapon - A cop with his own way of fighting crime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Glickenhaus"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "James Glickenhaus",
         "King Sang Tang"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089847/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMzM1MTY4MF5BMl5BanBnXkFtZTcwMzIyNDUxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Jackie Chan, Danny Aiello, Sandy Alexander | See full cast and crew »"],
      "reviews": [
         "This movie is a lot better than people say it is. Sure, it's not a typical Jackie Chan movie, but it's good anyway. It has lots of action and is better than most of the buddy cop movies of the 1980's. Don't expect this to be like all of his other movies and you may like it. I did.",
         "I DIDNT HATE IT! which really surprised me, because everyone on IMDb said this movie totally sucked and I went in expecting the worst. Sure Jackie is miscast, but other than the addition of curse words, his character isnt any darker than in Crime Story or Police Story 2. The action is slow, but better than any of the American action junk I've ever seen. Plus, there is tons of full-frontal nudity! Bet you didnt expect that from a Jackie Chan movie, did ya? I can understand why JC was disappointed with it, because it is nowhere near as good as almost any of his other 80's-90's movies, but it aint all that bad. Go in thinking you will hate it, and you just might like it.",
         "Jackie Chan's strength is in my opinion his talent in performing action comedy and fighting in creative settings. This movie puts Jackie Chan in an average cop-action movie that hardly takes advantage of Jackie Chan's strength. If someone else has played the role that Jackie Chan played in this movie, the movie could be a decent one. But Jackie Chan's presence in the movie gives expectation of something else than what this movie is. This is the problem of this movie: using Jackie Chan in an unsuitable role; or on the flip side, giving the role to someone unsuitable for this movie, Jackie Chan.",
         "Jackie Chan had no control of this movie (at least the American version). The director somehow thought that Jackie would come across better to audiences as a Dirty Harry cop! Didn't he realize that Chan is popular because of his stunts and kung-fu action? Apparently not, because in an interview years later, the director said he didn't regret his decision and kept claiming that Americans wouldn't accept Chan's Asian style. Back in Hong Kong, Chan re-shot the movie extensively, adding car chases and kung fu action. He also edited out a lot of the American director's idiotic stuff. That version is supposed to be quite good. This American version? It's AWFUL! You'd never guess what Chan is capable of by just watching this movie. The action scenes here are *dull*. Yes, *dull*. By the way, Chan next did POLICE STORY, as a \"take that!\" to that American director (James Glickenhaus, who hasn't done much lately. Hmm...wonder why....). See that movie instead of this!",
         "The Protector was another failed attempt to launch Jackie Chan as a star in the USA after The Big Brawl/Battle Creek Brawl failed to do the trick, and it's all too easy to see why this was even more unsuccessful. For the most part ignoring Chan's comic and acrobatic abilities, it simply partners him with Danny Aiello and plants him in the middle of a conventional buddy cop movie set in New York and Hong Kong where they get involved in tracking down the kidnapped daughter of a heroin smuggling kingpin. It's not terrible but it's the kind of film that could have starred absolutely anyone in Chan's role, so little use does it make of his talents, while James Glickenhaus' rather workmanlike direction pushes the plot along efficiently enough without it ever really threatening to catch fire. Even one spectacular chase around Kowloon Harbour that should be a highlight turns into a bit of damp squib because of lethargic pacing and editing. It's certainly watchable if you're in an undemanding mood, but it never really pushes the envelope. Still, it did inspire Chan to show how he thought a modern day cop movie should be done with Police Story. Chan was so displeased with the film that for the Hong Kong version he directed several new scenes and re-edited the film, adding more and much better fight scenes that played to his strengths, losing the odd bit of nudity and throwing in a car chase as well as a new subplot, improving the film no end. Unfortunately, this is not the version that Hong Kong Legends chose to release on their UK DVD, which contains the disappointing US version with no deleted or additional scenes (the only extra is an audio commentary by Andrew Staton). It's not a terrible film, but you're much better off tracking down the Hong Kong Region 0 DVD which includes Chan's cut with English subtitles.",
         "This movie was so good. People wrote that this movie sucks and stuff but they are dead wrong this movie has lots of action and some classic stunts from the master hismself Jackie Chan. This movie is also kind of a drama but mostly action and some comedy. Also has a great fight scene at he end.",
         "Billy Wong (Chan) is a tenacious and dedicated cop who always gets his man - but doesn't always play by the rules. Because of his rogue ways, he's busted down to \"crowd control\". While with his new partner Garoni (Aiello) at said crowd, a fashion show displaying \"shimmering cocktail wear\", a woman named Laura Shapiro (Ellis) is kidnapped by marauding thugs which crash the fashion show. Tying her kidnapping to the nefarious Hong Kong crime lord Harold Ko (Chiao), Wong and Garoni travel all the way from their home base in New York City to Hong Kong to rescue Laura and bring down the criminal enterprise of Ko. While there, they team up with some unlikely allies, Stan Jones (Ballistic director Kim Bass) and Soo Ling (Lee). Will they achieve their mission, and not destroy Hong Kong in the process? Find out today! We really loved The Protector. It's classic 80's fun all the way, with no shortage of action. Not only does the movie look great, thanks to its excellent cinematography, but it truly is Jackie Chan as you've never seen him before. We can see why he and director Glickenhaus had a falling out over differing visions, but, without giving away any spoilers, you just have to check out the scene between Jackie and none other than Big John Studd. It's amazing. In the New York City scenes, there are some great shots of the World Trade Center towers that add another layer of nostalgia. But besides the WTC, there's also a great example of a WYC (a White Yelling Chief, that is). The entertainment value never lets up. This movie was released at the height of Glickenhaus' powers as a director - we can see why Golden Harvest wanted to do a deal with him. He was smart enough to give action fans all of what they want, and none of what they don't. There's no stupid, annoying kid, there's no stupid, annoying romance, it's just one super-cool action setpiece after another, with Jackie doing what he does best. What more could you want? Plus, we get to see a slimmer Danny Aiello teamed with Jackie Chan. This truly was a once-in-a-lifetime pair-up. We thought they made a great team. Aiello wears a red jacket with no shirt, but with a medallion, which was a cool style for the day, and he's familiar with Hong Kong in the film because he was in Vietnam and they used to go there for R & R. The Protector is a winner - it's just wildly enjoyable fun from beginning to end. Featuring the song \"One Up For the Good Guys\" by Chip Taylor, we strongly recommend The Protector.",
         "This is one of those really unjustly criticized movies, I've vide'd a few times. It too has a great soundtrack at it's end, by Chip Taylor. This is another action spectacular flick from Glickenhaus, who knows how to make bigger than life action movies. The Protector has a lot of qualities about it, and in spite of Chan's real hate for this film, this is one I'd rather opt to watch, than his other chop suey comic style ones. The action sequences in this film that really get us exhausted, watching Jackie, especially in the last one, are fantastically shot. After being suspended for not playing by the rules when avenging his partner, (in the first great action piece, my favorite involving a speedboat chase) Chan's New York cop, Billy Wong is demoted to crowd control for a high fashion show. Here the beautiful daughter of the company is kidnapped and it's up to Chan and likable sidekick (Aiello) to retrieve her, which leads em' to Hong Kong for business and a bit of dangerous if near fatal pleasure, involving some sexy, young, and deadly masseurs, where another great action piece evolves. This movie is heavy on action. It has almost everything, even a drug lab, full of totally nude Asian women. This is a bit of a cheeky action movie, as how it lets a bit of female anatomy seep through, one thing I strongly admire about it, and Chan barely has time to stop and rest, fighting baddies, and impressing us with some of his stunts. The movie too has an interesting, unrelated start, involving thugs stripping a truck, and making of with off the Texan's guy's computers. Aiello and Chan make an interesting team, in a interesting choice of casting. They work well off each other, and though this film isn't at the top of Jackie's hit parade, The Protector is an action movie that delivers on all levels too with a bit of guilty cheek and humor. Don't be put off with the bad reviews, please. Watch for Mike Starr as Thug 2 in the first action sequence.",
         "i didn't mind this movie pairing Jackie Chan and Danny Aiello.it's not a great movie by any stretch of the imagination,but it kills some time.i've always liked Danny Aiello,so he elevates the movie a notch for me.the movie itself is a pretty generic crime drama.it's much darker in tone than The Big Brawl,Chan's first American movie,which had some humour in it.this one really doesn't.i didn't think the dialogue was all that great in this movie either.some of the lines were unnecessary or just plain silly.still,the movie was entertaining enough.this is Chan's second American movie(Cannonball Run II was just a small role,so it doesn't count)for me,The Protector is a 5/10",
         "After constantly reading and hearing nothing but negative opinions about the American produced, but also filmed in Hong Kong Jackie Chan vehicle 'The Protector'. It didn't sway me from checking it out. I'm no Jackie Chan fan, but honestly it was director James Glickenhaus' name which fed my interest. Best known for the 80s exploitative vigilante flick 'The Exterminator (1980)' and some entertaining action joints 'The Soldier (1982)' and 'Shakedown (1985). 'The Protector' does have the same vibe of his early efforts; gritty, brutal, rough and seamy. And I would call it lesser work. However the main talking point will always be how Glickenhaus used Jackie Chan. Yes, Chan is wasted in a role that would've been better suited for someone else (Norris comes to mind, as it has more in common with his stuff), as his martial arts abilities and amusing characteristics are never truly capitalized on. I'm so use to seeing him with that *wink, wink* attitude (Project A) and piling on those extravagantly energy-packed stunt work (Police Story). It's a different kettle, and very atypical. Here he looks uncomfortable throughout with that hardboiled edge. Just listen to his sober delivery of the dialogues. That endearing personality is kept in check. This performance seemed to ask more on dramatic acting, than his psychical and lively talent. He's pairing up with Danny Aiello (a loutish cop) couldn't be anymore disjointed and unbelievable. The chemistry never felt right, but with these problems I still was mesmerized. The rest of the performances (Bill Wallace, Roy Chiao) were indifferent. Look out for a short appearance by Mike Starr. While it didn't have the on-going rush I was expecting, Chan gets some furious and hard-hitting action sequences (like the opening slow-motion bloody shoot-out, tricky boat chase (one by water and the other by foot) and a marvellous sky-high balancing act). The film doesn't start off too badly, but when it hits Honk Kong. The copy and paste formula with its many predictable outcomes (involving the seedy crime underworld and the buddy style of two rogue cops) seems to plod along rather coldly. At least there's something enticing about the moody Hong Kong scenery, and ace cinematographer Mark Irwin's crisp moving camera-work is expansively fleshed-out. Effectively detailing the backdrop. Glickenhaus' direction is scratchy, but he knows how to set-up street style locations and infuse sleaze (especially the opportunities that arose to squeeze in nudity). It cops a lot shtick, but without the expectations it's a passable odd of sorts."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Eurasia Investments",
         "Golden Harvest Company",
         "Golden Way Films Ltd."
      ],
      "summaries": [
         "Billy Wong is a New York City cop whose partner is gunned down during a robbery. Billy and his new partner, Danny Garoni, are working security at a fashion show when a wealthy man's daughter, Laura Shapiro, is kidnapped. The Federal authorities suspect that Laura's father is involved with Mr. Ko, a Hong Kong drug kingpin, so the NYC police commissioner sends the two cops to Hong Kong to investigate. Once in Hong Kong, the pair causes no end of trouble for both Mr. Ko and the local authorities.",
         "Two New York cops, Billy Wong and Danny Garoni, head to Hong Kong after the daughter of a rich businessman is kidnapped by the drug lord, Mr. Ko."
      ],
      "budget": 0
   },
   "movielensId": 59947,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English",
         "Français"
      ],
      "releaseDate": "1985-07-11",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["James Glickenhaus"],
      "runtime": 91,
      "movieId": 59947,
      "title": "The Protector",
      "mpaa": "R",
      "actors": [
         "Jackie Chan",
         "Danny Aiello",
         "Roy Chiao",
         "Moon Lee",
         "Peter Yang Kwan",
         "Sandy Alexander",
         "Jesse Cameron-Glickenhaus",
         "Becky Ann Baker",
         "Kim Bass",
         "Sally Yeh",
         "Paul L. Smith",
         "Bill Wallace",
         "Victor Arnold",
         "Irene Britto"
      ],
      "imdbMovieId": "0089847",
      "originalTitle": "The Protector",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["E5MKQBqkfa0"],
      "plotSummary": "Billy Wong is a New York City cop whose partner is gunned down during a robbery. Billy and his new partner, Danny Garoni, are working security at a fashion show when a wealthy man's daughter, Laura Shapiro, is kidnapped. The Federal authorities suspect that Laura's father is involved with Mr. Ko, a Hong Kong drug kingpin, so the NYC police commissioner sends the two cops to Hong Kong to investigate.",
      "tmdbMovieId": 45408,
      "avgRating": 3.02381,
      "releaseYear": "1985",
      "numRatings": 21,
      "posterPath": "/wINnrnHDiHYNkNSqkp36CbmeAHw.jpg"
   }
}