{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "painter",
            "id": 437
         },
         {
            "name": "waitress",
            "id": 828
         },
         {
            "name": "oregon",
            "id": 1897
         },
         {
            "name": "trauma",
            "id": 2754
         },
         {
            "name": "grave",
            "id": 2968
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "notebook",
            "id": 5585
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "co-worker",
            "id": 14522
         },
         {
            "name": "portrait",
            "id": 41388
         },
         {
            "name": "telemarketing",
            "id": 182242
         },
         {
            "name": "christmas",
            "id": 207317
         },
         {
            "name": "introvert",
            "id": 215409
         }
      ],
      "imdb_id": "tt0491162",
      "video": false,
      "title": "Spiral",
      "recommendations": [
         17236,
         32162,
         206,
         37850,
         32229,
         74718,
         32150,
         10109,
         204882,
         33563,
         126757,
         25655,
         32241,
         29977,
         82469,
         32157,
         77504,
         73897,
         5759,
         263905
      ],
      "backdrop_path": "/iTBerhxPLlMHlnySareZOJpsXH2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mason",
               "gender": 2,
               "credit_id": "52fe477f9251416c7509b83d",
               "name": "Joel David Moore",
               "profile_path": "/y6AyGCsQHLoi4LegSS7VRtgRyJe.jpg",
               "id": 59231,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Amber",
               "gender": 1,
               "credit_id": "52fe477f9251416c7509b841",
               "name": "Amber Tamblyn",
               "profile_path": "/4nwsbtFzoxzN2YF2HOW4P4vdit2.jpg",
               "id": 20354,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Berkeley",
               "gender": 2,
               "credit_id": "52fe477f9251416c7509b845",
               "name": "Zachary Levi",
               "profile_path": "/ezGnRBi5zn9S6WFxuVxFfZdRH3e.jpg",
               "id": 69899,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sasha",
               "gender": 1,
               "credit_id": "52fe477f9251416c7509b849",
               "name": "Tricia Helfer",
               "profile_path": "/uEQgBzR1Bk4cIsPFLAfZ6ckm7EK.jpg",
               "id": 74423,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Will",
               "gender": 2,
               "credit_id": "52fe477f9251416c7509b84d",
               "name": "David Muller",
               "profile_path": null,
               "id": 83154,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Diana",
               "gender": 0,
               "credit_id": "52fe477f9251416c7509b851",
               "name": "Annie Neal",
               "profile_path": null,
               "id": 83155,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Valerie",
               "gender": 0,
               "credit_id": "5880f18a92514134cd00df89",
               "name": "Lori Yohe",
               "profile_path": null,
               "id": 1741815,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe477f9251416c7509b857",
               "name": "Adam Green",
               "profile_path": "/dVTHjh33pASH2nnNL00N4WXfjdR.jpg",
               "id": 70890,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5373753bc3a368150900131a",
               "name": "Jeremy Danial Boreing",
               "profile_path": null,
               "id": 1319442,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53737582c3a3681530001282",
               "name": "Joel David Moore",
               "profile_path": "/y6AyGCsQHLoi4LegSS7VRtgRyJe.jpg",
               "id": 59231,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5373758dc3a3681518001300",
               "name": "Joel David Moore",
               "profile_path": "/y6AyGCsQHLoi4LegSS7VRtgRyJe.jpg",
               "id": 59231,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "537375b9c3a3681539001246",
               "name": "Jeremy Danial Boreing",
               "profile_path": null,
               "id": 1319442,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "537375d3c3a368152000125b",
               "name": "Cory Neal",
               "profile_path": null,
               "id": 70896,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "537375f5c3a368151800130f",
               "name": "Will Barratt",
               "profile_path": null,
               "id": 70898,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5373760cc3a368152800121b",
               "name": "Todd Caldwell",
               "profile_path": null,
               "id": 1319443,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "53737633c3a3681502001236",
               "name": "Michael Fish Herring",
               "profile_path": null,
               "id": 1319445,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5373767fc3a3681520001262",
               "name": "Michelle Sandvig",
               "profile_path": null,
               "id": 1319446,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "537376bfc3a3681509001340",
               "name": "Travis Zariwny",
               "profile_path": null,
               "id": 22239,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "53737704c3a3681518001322",
               "name": "Tyler B. Robinson",
               "profile_path": null,
               "id": 1020784,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "53737729c3a3681502001251",
               "name": "Rileah Vanderbilt",
               "profile_path": "/pxxWFuNs8fQQBsEmD99aCxIticz.jpg",
               "id": 131822,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.235234,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18467,
      "vote_count": 29,
      "budget": 1500000,
      "overview": "A reclusive telemarketer has only one semblance of a friend: His telecommuter boss. But the telemarketer's social circle seems to improve greatly when a whimsical co-worker enters his life. Only, as he begins to sketch his new friend's portrait, disturbing \"voices\" from the phone man's past threaten to lead him into a network of destruction",
      "similar": [
         51052,
         9479,
         11395,
         1585,
         10147,
         634,
         338964,
         10510,
         11881,
         5375,
         17979,
         1581,
         5255,
         8871,
         10719,
         772,
         527,
         9714,
         27414,
         9279
      ],
      "original_title": "Spiral",
      "runtime": 90,
      "poster_path": "/eW890meqSQs1I8dNWXmTR6RCK1f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ArieScope Pictures",
            "id": 3960,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Coattails Entertainment",
            "id": 23375,
            "origin_country": ""
         }
      ],
      "release_date": "2007-01-01",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Adam Green",
         "Joel David Moore"
      ],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Jeremy Danial Boreing",
         "Joel David Moore"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0491162/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODk2NTYzOTI2M15BMl5BanBnXkFtZTcwOTk5OTk1MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Joel David Moore, Amber Tamblyn, Zachary Levi | See full cast and crew »"],
      "reviews": [
         "Spiral is a well-acted, intense thriller about a lonely, delusional young man trying to overcome his powerful inner demons. In the starring role of Mason, Joel Moore effectively plays a telephone salesperson whose feelings of anxiety and confusion are intertwined with disturbing flashbacks of his former girlfriend. Mason cringes from most of society. His boss (played by Zachary Levi), an arrogant womanizer who knows the circumstances of Mason's tragic past, is his only friend. Gradually, however, Mason builds a relationship with a young female co-worker (played by Amber Tamblyn) who brings out his confidence by encouraging his artistic talents. Yet, Mason's feelings of dread and paranoia are never far away. In fact, deciphering whether Mason's reality is synonymous with truth kept me spellbound throughout the film. The camera work in Spiral is especially outstanding. Sudden, vivid images from Mason's memories take the viewer to his level of turmoil and terror. In addition, shooting this movie in the great city of Portland, Oregon was an excellent choice. The gloominess of the rainy winters fit perfectly with the murky shadows of Mason's mind. The end of the movie has some great twists and surprises for the audience to relish. When all is said and done, Spiral is a wonderfully dark and intense film that holds up to any of today's big-studio thrillers.",
         "This mystery/thriller has quasi-comic elements in the initial portrayal of the protagonist. But all is deceptive and this well-constructed film holds your interest with a well written script. The charming Amber Tamblyn shows her acting skills and is well cast as the quirky girlfriend character. The acting and pacing are excellent.The office space reference in the summary is due to the fact that the main character, an artist, works at an insurance company as his day job. His high school friend is his boss and tries to help him throughout the film. This is just a little reminiscent of the \"Office Space\" style parody of such places. If you like Hitchcock and independent film, you will love this one.",
         "Now this is really a movie for anybody, who is not only focused on getting a gripping story when going to the movies. Everyone who can get the kicks out of nicely staged and directed pictures, visual effects, lighting and the whole scenery will be pleased to see this one! I got interested in the movie because of its director, Adam Green. Unlike many other users here i saw HATCHET on the 2006 Fantasy-Film-Fest in Germany and loved it! So i looked through IMDb from time to time, to see what he would do next. First of all i have to warn all the \"Horror/Gore/Splatter/whatever\"-Fans. This movie has absolutely nothing in common with HATCHET except for its director and leading actor! Second: Don' t watch the trailer! It is a real spoiler, and it lets the viewer assume that SPIRAL would be a psycho-thriller, with a really dark atmosphere all the time and shock-moments every five minutes or so. It isn't - but that is what's best about it. Other users compared it with Hitchcock and i have to say, that this reference also came to my mind when i watched the film. It's a mixture of a really gripping relationship (love-story???) and a character study that every now an then has its dark undertones. Only at the end there are real classical and modern thriller elements. The plot and the whole atmosphere really reminds me of my favorite Hitchcock movies like \"Vertigo\" oder \"Marnie\". Of course you can see, that Adam Green is still trying to find his unique style, that the actors do their best but are not yet at the peak of their acting abilities and that this is an indie-film with a small budget. But after all i would say, that this is without doubt one of the best movies i have seen the last months!",
         "Spiral is the story of Mason, played by co-director, co-writer, producer Joel David Moore from Hatchet. Mason is a telemarketer, who likes to paint mysterious women, and consumes nothing but peanut butter sandwiches, apples and milk. (Just a warning, before viewing, you may want to be sure to have these items in the house in case you have a sudden craving. Or maybe that's just me?) Mason's life is a mess; he's messing up at work, having panic attacks that end in 3am phone calls, and freaky visions of some waitress. Mason is like a child in a man's body, awkward, scared; he needs a lot of help that he unfortunately isn't getting. Mason's only \"friend\" is Berkeley, played by producer Zachary Levi, who I hear has a show called Chuck but I've never seen it. Berkeley doesn't so much help Mason, as treat him like crap, then tries to justify it to himself and others by saying that he's being \"honest\". I think he's said it enough times that he actually believes it either that or he doesn't care, because he treats everyone the same way. One day, Mason meets a woman named Amber, played by Amber Tamblyn of Joan of Arcadia and more recently a great Hallmark movie, The Russell Girl. Amber is happy, bubbly, outspoken, and open book, she's the exact opposite of Mason and for a while, their relationship seems to work. Mason decides to paint her; he starts to seem happy, borderline normal. But, Amber knows there's something in his past, other women he's painted but won't talk about and the harder she pushes the more he pulls away. After seeing co-director Adam Green's film, Hatchet, back in December I wasn't sure I was ready for the 180 into Spiral. I knew this film was going to be different, because for one thing, Spiral wasn't written by Green. This film is Joel David Moore's first as a writer/director but you have to wonder how the director of Hatchet is going to make this film work. I don't know how they did it but Green and Moore did an incredible job, I love this film. It reminds me of Psycho (the original not the piece of crap 1998 remake), the Sixth Sense, and maybe even a little 1408. Spiral already seems like a classic, with a great storyline, amazing jazz score (I'm not even into jazz), great camera work (even the hand-held at the end which makes you just the right amount of nauseous) and memorable performances. I'm not saying that all fans of Hatchet will like this film because I know many of them won't, Spiral isn't hardcore horror and it doesn't claim to be. Spiral is much more psychological, character and relationship driven. But if you like mystery and suspense, with a great twist ending, see this film, you won't regret it. My only wish for Spiral is that it could see a wider audience because the film and filmmakers deserve it.",
         "Mason isn't exactly your everyday joe. He's an artist. A sketcher and a painter, but he's also incredibly quiet and tends to keep to himself. He has an office job where he tries to sell car insurance, but he doesn't exactly fit in with others. His only friend(if that's what you want to call him) is Berkeley, the boss. Berkeley comes off like he cares about Mason, but his compassion is overshadowed by the fact that he's a prick. Things start looking up for Mason as he meets Amber. After seeing Mason's sketches and getting to know him a little better, she decides she wants him to paint her. Mason's...odd side starts to reveal itself as he won't let Amber see his sketches. \"There are rules,\" he says, \"You can't see it until it's done.\" As Amber gets closer to Mason, what can he be hiding? Why is he such an \"enigma,\" as Amber put it? Why does he keep having disturbing dreams about another woman? Where do I start? I actually really liked this. I was expecting to as Adam Green and Joel David Moore were both involved with Hatchet, which is a guilty pleasure of mine. While Hatchet is half comedy and half gorefest, Spiral is more of a dramatic thriller that builds towards the ending. Spiral, while being low budget, is shot in superb fashion. The way its shot is actually its charm. I love the way the camera gets shaky during the scenes where Mason seems like he's going to lose it or when he finally does. Joel David Moore is also in top form here. His talent truly shines in this role. Everything from his body language to the way he chomps his teeth when he gets nervous, he sucks you in. You wind up feeling sorry for Mason even though you know he's twisted in some way. Witnessing his character unveil how dark really is is just amazing. The other actor I was really impressed with was Zachary Levi. I wound up becoming a fan of his with Chuck, but I've never seen him like this. He's basically a prick with a heart(even though that side of him is really only shown to Mason). While his role is a little small, he's still able to steal a few scenes...especially in the last half of the film. The other element that really adds to the film is the jazz music used. It fits perfectly with Mason's personality. Jazz music accentuates Mason's insanity that nothing else could. I really have nothing bad to say about the film. This may surprise a few people, but Spiral is actually quite enjoyable. The acting is top notch and it's written incredibly well. For a movie that went straight to DVD, it's quite surprising how good it actually is. Even if you hated Hatchet, you should give Spiral a chance as it's a completely different kind of film.",
         "In order to describe what's seriously wrong with this movie it has to contain some *spoilers* so if you're going to see it and expect to be surprised, don't read this! I liked everything about this movie except the plot; and in a thriller like this believable plot is essential. It is well acted, if a bit slow moving, and the camera work and Portland scenes are exquisite for a low-budget, unpretentious picture. The dialog is very good. Mason is seriously withdrawn youth who works at a telemarketing company selling insurance. His high school buddy, Berkeley, is his employer and looks after him like a brother despite the fact that Mason is quite obviously mentally ill. Mason has nightmares which send him gasping and fumbling for his inhaler. His visions and nightmares suggest that he has had serious problems with good-looking women in his past, and the movie seems to be suggesting that he may be a serial killer of women. He meets a perky, pretty girl named Amber and he sketches her in his notebook. She takes a liking to him and poses for him so he can paint her portrait. He sees more of her and begins to awaken from his withdrawn state, almost becoming halfway human. Then something goes wrong. Amber finds sketchbooks with drawings in his apartment of other girls and she begins to wonder. She becomes frightened and pulls away. We are wondering if her sudden coldness is going to push him over the edge. His behavior becomes more erratic. This is the setup for a revelation. In order to explain how this movie goes horribly wrong I have to explain what happens. *Another spoiler warning!* In order for this plot to work we have believe that Amber, a really outgoing, pretty young girl is going to go for a seriously emotionally disturbed young man who, at least at the beginning of their friendship, has a vacant stare and can only speak in monosyllables or doesn't speak at all. He's way beyond nerdy, he appears on the verge of total catatonia. Yes I know, girls can be attracted to all kinds of weirdos, but usually the Charles Manson type or punk rockers, guys with some kind of evil manic energy. Mason is practically a zombie, he's hardly there at all. Any perky young thing would cross the street to avoid him. It is just not believable that this girl is attracted to him. Moreover, there is no credible reason for Berkeley to indulge the crazy Mason, that just isn't believable either. But wait, there's a revelation. Amber fails to show up at Berkeley's house for Christmas dinner where Mason is expecting her, and Berkeley, his old buddy, has to tell him that Amber and all his other former girlfriends, the ones he drew in his many sketchbooks, don't exist at all! She and all the others are merely figments of his twisted imagination: he dreamed them up. Well, this explains why a normal cute Amber would go for Mason: she's just a figment of his imagination. This could have been the final revelation of the movie with the proper preparation and setup, but alas, it's not. At this point Mason runs back to his apartment and finds Amber there...he's enraged, he kills her. But now we are given to understand that Amber was in fact real, not Mason's imaginary girlfriend. In the end, after being given proof that Amber actually existed and that Mason killed her, Berkeley has to admit that he was wrong, that he misjudged Mason. This would work if Mason had been halfway sane from the beginning, but because we the audience always suspected him of being totally deranged and possibly a killer of women, it is no surprise to us. We suspected what he was all along and can't understand why Berkeley couldn't see it. But then we are once again left to wonder: if she was real, why Amber would be attracted to the catatonic Mason? To make the ending worse, we never find out whether Mason's other girlfriends, the ones in the sketchbooks, were real, or was Amber the first real one? And if the others were real, did he kill them too? What did he do with the bodies? The problem is that the filmmakers just didn't know what to do with the material. Perhaps there could have been a way to straighten it out and tell a credible suspense story, but this movie is not that.",
         "I had the opportunity of seeing Spiral as part of the Film 4 Frightfest 2007, on Monday 27th August. I have to say that this was an amazing film that really struck a cord with me. The main character is developed with such love and empathy that by the end you want to juxtopositionaly love him as well as be horrified by his actions. The double twist at the end is brilliant and keeps you guessing right until the last few seconds of the film, the end result being that you have to revisit some of your earlier assumptions, particularly regarding the attitudes towards the secondary character of Mason's boss and friend. In short, anyone who is a fan of love stories, horror, or dark independent films like Donnie Darko will love this movie. Highly recommended, and especially will resonate with those like myself who grew up as quiet intelligent outcasts; the \"odd\" kid at school. :o)",
         "This could have been a different and much better movie. Apparently I saw a potential depth to it that completely escaped the filmmakers. So I find myself in the odd position of disagreeing with all the other reviewers. What they hated about it I liked. What they liked about it I hated. I was unaware of the filmmakers' link to the splatter film \"Hatchet\", which I have not watched and have no intention to. So my review of this film is based solely upon its own merits and not on any similarity or differences to some other movie. So, what's right about this movie? I actually liked the slow development of the characters. I came to care about them. I began to root for the budding relationship between the two leads. Was Mason actually autistic, or was he a victim of emotional trauma? Was there hope for him to come out of his shell with the help of his quirky girlfriend Amber? Silly me. I found out too late that the movie makers didn't give a damn about the characters. They were merely fodder for the clichéd \"twist\" ending. What a letdown. They threw away all the potential for a serious movie by capping it with a cheap Hollywood trick from the threadbare \"Screen Writing for Dummies\" handbook. So, if you want a \"mystery thriller\", then the ending of this movie is for you, but you will become impatient with all the unnecessary character buildup preceding it. On the other hand, if you go in, as did I, unwittingly willing to care about people, especially those marginalized by society, and root for them to triumph over adversity, then skip this movie. The buildup will intrigue you and make you care. But the ending will terrifically disappoint you.",
         "The best thing about this movie is that despite how much you THINK you've seen this story before, no elements of the tale overstay their welcome. It's like when a band you really like comes out with an EP. You enjoy it for what happens within the boundaries it's length. What works best is the acting, particularly that of Joel David Moore, who simply seems to be enjoying himself while finding depth in this character him & Adam Green more than likely collaborated on. Amber Tamblyn was also not annoying to me in this. Sounds back-handed, I know, she's talented, but just ain't my style most of the time. Also, the choices of music in the film add to it's uniqueness. Please, do enjoy \"Spiral.\"",
         "The asthmatic aspirant painter Mason (Joel David Moore) is a lonely and outcast employee of the JZD & J Insurance that is haunted by dreadful nightmares of women. His supervisor and only friend Berkeley (Zachary Levi) tries to approach to him but Mason remains reclusive and alone. He is befriended in the lunchtime by the new employee Amber (Amber Tamblyn) and a couple of days later they date and Mason begins to paint her. On the Christmas Eve, they make love and on the next morning, Amber finds his blocks of identical drafts of different women in his drawer. When Mason discovers that Amber has broken his rule that she could never see his sketch before the painting is ready, he has a violent argument with her. On the next morning, Mason comes to the company and tells Berkeley that he killed his girlfriend, and Berkeley discloses and finds secrets about his strange friend. \"Spiral\" is a low-budget movie supported by a great screenplay with surprising twists; excellent direction of Adam Green and Joel Moore; and magnificent performances of Joel David Moore, Amber Tamblyn and Zachary Levi. The weird character Mason slightly recalls the deranged May, but the plot is ambiguous in \"Spiral\": I understand that Mason killed all the girls that Berkeley believed were imaginary but it is never clear whether Amber was his first actual victim and the others fruit of his damaged mind or all of them were real. My vote is eight. Title (Brazil): \"Círculo do Pânico\" (\"Circle of the Panic\")"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "ArieScope Pictures",
         "Coattails Entertainment"
      ],
      "summaries": [
         "A reclusive telemarketer has only one semblance of a friend: His telecommuter boss. But the telemarketer's social circle seems to improve greatly when a whimsical co-worker enters his life. Only, as he begins to sketch his new friend's portrait, disturbing \"voices\" from the phone man's past threaten to lead him into a network of destruction.",
         "A reclusive telemarketer, whose dysfunctional friendship with his boss is alleviated when a whimsical co-worker enters his life. But as he begins to sketch his new friend's portrait, disturbing feelings from his past threaten to lead him down a path of destruction.",
         "The asthmatic aspirant painter Mason is a lonely and outcast employee of the JZD & J Insurance that is haunted by dreadful nightmares of women. His supervisor and only friend Berkeley tries to approach to him but Mason remains reclusive and alone. He is befriended one lunchtime by the new employee, Amber. A couple of days later they date and Mason begins to paint her. On Christmas Eve, they make love but the next morning, Amber finds his blocks of identical drafts of different women in his drawer. When Mason discovers that Amber has broken his rule that she could never see his sketch before the painting is ready, he has a violent argument with her."
      ],
      "budget": 1500000
   },
   "movielensId": 60030,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-01-01",
      "dvdReleaseDate": "2008-02-19",
      "directors": [
         "Adam Green",
         "Joel David Moore"
      ],
      "runtime": 90,
      "movieId": 60030,
      "title": "Spiral",
      "mpaa": "PG-13",
      "actors": [
         "Joel David Moore",
         "Amber Tamblyn",
         "Zachary Levi",
         "Tricia Helfer",
         "David Muller",
         "Annie Neal",
         "Lori Yohe"
      ],
      "imdbMovieId": "0491162",
      "originalTitle": "Spiral",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["riL5PAtYNIk"],
      "plotSummary": "A reclusive telemarketer has only one semblance of a friend: His telecommuter boss. But the telemarketer's social circle seems to improve greatly when a whimsical co-worker enters his life. Only, as he begins to sketch his new friend's portrait, disturbing \"voices\" from the phone man's past threaten to lead him into a network of destruction",
      "tmdbMovieId": 18467,
      "avgRating": 3.28049,
      "releaseYear": "2007",
      "numRatings": 41,
      "posterPath": "/eW890meqSQs1I8dNWXmTR6RCK1f.jpg"
   }
}