{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bride",
            "id": 3582
         },
         {
            "name": "chinese",
            "id": 13159
         },
         {
            "name": "groom",
            "id": 171817
         },
         {
            "name": "tofu",
            "id": 208544
         }
      ],
      "imdb_id": "tt0111752",
      "video": false,
      "title": "The Wooden Man's Bride",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Brother (as Paoming Ku)",
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2b1",
               "name": "Gu Bao-Ming",
               "profile_path": "/68QjJtnMLteW8tE5Ae7QH84LeSJ.jpg",
               "id": 228915,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Chief Tang",
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2b5",
               "name": "Mingjun Kao",
               "profile_path": null,
               "id": 228916,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Young Mistress",
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2bd",
               "name": "Lan Wang",
               "profile_path": null,
               "id": 43918,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "Madame Liu",
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2c1",
               "name": "Yumei Wang",
               "profile_path": null,
               "id": 228918,
               "order": 4
            },
            {
               "cast_id": 1010,
               "character": "Sister Ma",
               "gender": 0,
               "credit_id": "56d1e902c3a3681e4a009352",
               "name": "Fuli Wang",
               "profile_path": "/7x8t5EFZbbzCKUEe5G4HWbhJMwb.jpg",
               "id": 1163179,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2c7",
               "name": "Huang Jianxin",
               "profile_path": "/sD2vujivL6rZ2HQDmlKmXx7qADs.jpg",
               "id": 134026,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2cd",
               "name": "Zhengguang Yang",
               "profile_path": null,
               "id": 228919,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2d3",
               "name": "Xudong Li",
               "profile_path": null,
               "id": 228920,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e2d9",
               "name": "Yu Shi",
               "profile_path": null,
               "id": 228921,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4983c3a36847f819e2df",
               "name": "Wang Ying-hsiang",
               "profile_path": null,
               "id": 228922,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.325768,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 59146,
      "vote_count": 1,
      "budget": 0,
      "overview": "Emerging from the Chinese film renaissance of the 1990s (Raise the Red Lantern, Farewell My Concubine) this haunting folk tale set in rural China in the 1920s tells the story of a young woman forces to grieve the death of a man she was destined to marry. Combining astonishing visuals with intriguing plot turns, this moving drama is not to be missed. When the spirited Young Mistress (Wang Lan) is kidnapped on the way to her arranged wedding, the groom is killed in an explosion in an attempt to rescue her. The peasant charged with her care, Kui (Chang Shih) manages to free her but the groom's bitter mother forces the Young Mistress to honor her agreement by marrying a wooden statue of her son, and staying chaste. Director Jianxin Huang's fascinating exploration of forbidden love and rigid social hierarchy reveals a culture in turmoil, where tradition is taken to cruel extremes and young lovers may not survive.",
      "similar": [
         712,
         50124,
         11003,
         2959,
         11931,
         6557,
         24,
         15590,
         37247,
         9029,
         1597,
         8273,
         3933,
         9522,
         11778,
         82695,
         400617,
         16563,
         12220,
         10521
      ],
      "original_title": "The Wooden Man's Bride",
      "runtime": 113,
      "poster_path": "/fSEKaXqvuVh5RiJMK8CNgJXbEPg.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Long Shong Pictures",
         "id": 5551,
         "origin_country": ""
      }],
      "release_date": "1994-02-05",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "She defied a thousand years of tradition for one moment of passion",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jianxin Huang"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Jia Pingau",
         "Zhengguang Yang"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0111752/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4ODk3NzMxNF5BMl5BanBnXkFtZTcwMTUwODUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Shih Chang, Bao-ming Gu, Mingjun Kao | See full cast and crew »"],
      "reviews": [
         "This was a fascinating movie that certainly deserves credit for being original. A young bride is on her way to her wedding when she is kidnapped. Though eventually released due to the bravery of her servant, Kui, the prospective husband is accidentally killed when preparing to rescue her. So, when she eventually arrives for the wedding, the dead groom's mother insists she marries a wooden statue created to symbolize the dead man and remain forever chaste. And, naturally, this is a less than wonderful marriage and the young bride is miserable. Eventually, though, she and Kui fall in a doomed love--he is a poor servant and she is being forced to remain faithful to a lump of wood. While there is a lot more to the story than that and it has a very exciting and fulfilling ending, I am left wondering if there is any truth to the odd story. Did women ever marry symbolic images in China and is this story based on real characters. The movie seems to imply it is true, but there are no DVD extras to explain the movie and IMDb isn't much help here either. So, apart from a very original story idea and a wonderful ending, what's the movie like? Well, it's good but very, very slow. In fact, with a bit of editing this movie could have scored a 9--the pace (aside from the conclusion) was just too turgid. As a result, some might be tempted to turn it off--resist that urge! The payoff is worth the long wait.",
         "This is definitely on my list. As with most asian films, the visuals are striking. And as to be expected with asian films, several scenes can tell a story without dialogue. Some might argue that the interweaving of the various elements of Kui's life-story are slow, but how they manage to all come together in the end is incredibly done. \"Young Mistress'\" punishment is stereotypically harsh when viewed from western eyes, but it doesn't distract from the film. I defintely recommend this one to any fan of asian films...",
         "This is definitely on my list. As with most asian films, the visuals are striking. And as to be expected with asian films, several scenes can tell a story without dialogue. Some might argue that the interweaving of the various elements of Kui's life-story are slow, but how they manage to all come together in the end is incredibly done. \"Young Mistress'\" punishment is stereotypically harsh when viewed from western eyes, but it doesn't distract from the film. I defintely recommend this one to any fan of asian films...",
         "If you like Wu Kui, then you would probably like Red Sorghum (Hong Gao Liang), the two are in the same class. The plot is told in kervinjp's post. The comment to be added here is to remind that the burden of tradition is heavy, especially on Chinese women who had to suffer under the rigid Confucius morale that destroy humanity. Every culture has its goods and bads, and people often willfully ignore the bad part of their own culture out of nationalism, ethnocentrism, or other reasons. This film, like Red Sorghum, accurately confronts what was bad in its own culture and therefore is worth applauding.",
         "BAD MOVIE! Should have been a great concept but the story teller/director totally screwed up on the way it is presented. The story is full of holes: it takes place in rural China at an unspecified time but assumed to be more than a hundred years ago, when social behaviour and morality is very strict. The main character, Wu Kui, is a hired hand who is sent to bring the bride back to her future rich husband's house. On the way he displays a mischievous side by teasing his companions to peek behind the bride's veiled face, for good luck, which is socially highly unacceptable. When some bandits try to kidnap the bride he carries her on his back and run away \u0096 for a long, long time even the bandits are on fast horses. After she is finally taken he sits around for maybe half a day(the other servants return home, report the incidence over a cup of ginger tea, then the husband accidentally kills himself, and then people set back out to look for him) that's when he suddenly decides to go after the bandits to rescue the bride. He passes through a gate of the bandits' hideout with armed guards without any questioning. When he meets the bandit leader instead of asking about the woman the first thing he asks for is to have a meal, which is granted and he sits down and eats a whole chicken, while the bride sits tied up a few feet away. Then with some lame excuse the leader set them both free. The bride is forced to stay married to a dead husband, in the form of the wooden figure of a man, despite the kindness the mother-in-law show to both the bride and Kui. Kui, now portrayed as an innocent good-hearted country boy, makes contact with the beautiful young widow numerous times, including inside her bedroom at night, which is ridiculous. He finally surrenders to her seduction and has sex in her bedroom, with the lights on and the mother-in-law and the servants still awake in the next room. But no one suspects anything. The miserable bride tries to run away a few times but stopped by the servants. Still she's free to wander about without any restrain and surveillance, but somehow forgets about running away. Finally while the innocent Kui tries to say goodbye to the bride due to his guilt the mother comes out of her room and sees them. Right away a mob with torches suddenly appear from nowhere. Although the traditional punishment for adultery is by drowning both parties the kind mother-in-law just breaks the bride's ankles and sets the man free without even a slap on the wrist from the mob. Kui decides to join the bandits and finds the whole den burned down and every bandit killed. He breaks down and cries hysterically\u0085I don't know why. Then a year later this innocent crying baby suddenly becomes the leader of a group of 100 bandits, with no explanation on how, and returns to get his lover. She is now chained to her bed, even when she's crippled, unlike during her few attempts to run away while she was very healthy. Then Kui orders the mother-in-law to kill herself by hanging, despite after her continuous kindness to both himself and the bride for all this time. The acting of the 2 main characters is poor, although the mother-in-law and the housekeeper have done a passable job. The lighting control is substandard, and the pace of the movie is dreadful. It totally fails when compare to other excellent movies about cultural frustration in past China, e.g. The Old Well, The Story of Qiu Ju, Raise the Red Lantern, etc."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Long Shong Pictures"],
      "summaries": ["Camels carry a bride to her groom's house; he is a wealthy tofu maker and the bride's father is in debt to him. Leading the caravan is Kui, a strong, courageous, and naive peasant. Bandits intercept them and carry off the bride. Kui follows: two days later, at the bandits' stronghold, he seeks her return. The gang lord tests Kui then grants his wish. The groom, meanwhile, has died in an accident preparing to give chase. His iron-willed mother orders the wedding to proceed, and she marries the bride to a wooden pole resembling her son. The bride chaffs at this prison, and after a year, brings Kiu to her bed. Kiu is cast out and she is severely punished. Does Kiu have any options?"],
      "budget": 0
   },
   "movielensId": 601,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1994-02-05",
      "dvdReleaseDate": "2004-07-13",
      "directors": ["Huang Jianxin"],
      "runtime": 113,
      "movieId": 601,
      "title": "The Wooden Man's Bride",
      "mpaa": "",
      "actors": [
         "Gu Bao-Ming",
         "Mingjun Kao",
         "Lan Wang",
         "Yumei Wang",
         "Fuli Wang"
      ],
      "imdbMovieId": "0111752",
      "originalTitle": "The Wooden Man's Bride",
      "genres": [
         "Drama",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": ["-y9LgpU2ugQ"],
      "plotSummary": "Emerging from the Chinese film renaissance of the 1990s (Raise the Red Lantern, Farewell My Concubine) this haunting folk tale set in rural China in the 1920s tells the story of a young woman forces to grieve the death of a man she was destined to marry. Combining astonishing visuals with intriguing plot turns, this moving drama is not to be missed. When the spirited Young Mistress (Wang Lan) is kidnapped on the way to her arranged wedding, the groom is killed in an explosion in an attempt to rescue her. The peasant charged with her care, Kui (Chang Shih) manages to free her but the groom's bitter mother forces the Young Mistress to honor her agreement by marrying a wooden statue of her son, and staying chaste. Director Jianxin Huang's fascinating exploration of forbidden love and rigid social hierarchy reveals a culture in turmoil, where tradition is taken to cruel extremes and young lovers may not survive.",
      "tmdbMovieId": 59146,
      "avgRating": 3.39167,
      "releaseYear": "1994",
      "numRatings": 120,
      "posterPath": "/fSEKaXqvuVh5RiJMK8CNgJXbEPg.jpg"
   }
}