{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0479547",
      "video": false,
      "title": "Surfwise",
      "recommendations": [
         114903,
         297421,
         41648,
         34219,
         199571,
         43459,
         230846,
         287322,
         21,
         201419,
         212994,
         297859
      ],
      "backdrop_path": "/hZC8jB95Hk3CDGuUhtr8D9k0M7p.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe44fcc3a368484e04249d",
            "name": "Doug Pray",
            "profile_path": "/8LOpInHNj28pxCArfbtTSiIk6un.jpg",
            "id": 105802,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.033713,
      "production_countries": [],
      "id": 26354,
      "vote_count": 11,
      "budget": 0,
      "overview": "The inspiring and tumultuous story of 85-year old surfer, health advocate and sex guru, Dr. Dorian \"Doc\" Paskowitz, his wife Juliette, and their nine children who were all home-schooled and raised in a small camper on the beach, where they surfed and had to adhere to the strict diet and lifestyle of animals in the wild.",
      "similar": [],
      "original_title": "Surfwise",
      "runtime": 93,
      "poster_path": "/3oSnMMLorkctvXUOloNxHkSezaB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2007-01-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Reject normal.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Doug Pray"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Doug Pray"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0479547/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQxNDQwNTg5Ml5BMl5BanBnXkFtZTcwNDEyODU2MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Juliette Paskowitz, David Paskowitz, Jonathan Paskowitz | See full cast and crew »"],
      "reviews": [
         "Don't be fooled by the title. Surfwise is much more than a surfing movie. It chronicles the amazing journey of \"Doc\" Paskowitz, his nine kids and his beautiful and understanding wife Juliette. After two failed marriages, the doc packs up his \"normal\" life and goes Bohemian, living off the earth while teaching people how to surf. The highly religious man meets his life partner in Juliette and they immediately start having kids - one after the other. But that's where the normalcy ends. They travel around the country in a 24' cramped trailer \u0096 all eleven of them, eating healthy, the kids getting home schooled, surfing everyday, and staying below the radar from truant officers. To make money, the Paskowitz' start a surf school and \"Doc\" would occasionally take low-level medical positions. As was the case with \"Doc,\" the kids became champion surfers and the family was profiled numerous times in magazine articles and television segments. Although many outsiders found this nomadic lifestyle idyllic, the kids started to rebel against \"Doc.\" He was unyielding, he didn't offer them options, and it was either his way or \"off\" the highway as it were. It also didn't help that their parents were having sex just about every night in a small trailer with the nine of them watching and listening. As their hormones kicked in, they needed sexual release as well, but those needs were not met because they were constantly travelling without any chance to make their own relationships. One by one, they left the fold. Many of the kids became estranged from their parents and each other. But through it all, the kids turned out to be smart, intelligent, good parents, creative and successful in many ways. The cynicism in many would think that out of this dysfunctional upbringing would come the typical end game of suicides, failed marriages, or any other downers. But this couldn't be further from the truth. What lingers is the fact that I really liked these people. I wanted to get to know them better and hang out with them. What \"Doc\" was preaching years ago is now fact \u0096 eating well, preserving the planet and loving one another is essential to survival. And although he didn't give his kids a choice and forced them to live life \"his way,\" one can't really fault him for trying to give them the best that he thought was right. Doug Pray makes great documentaries and I look forward to his next one. Screened at the Starz Denver Film Festival.",
         "After, \"Crumb\", \"Capturing The Friedmans\", and to a much lesser extent, \"The Devil And Daniel Johnston\", I assumed I had seen my fair share of dysfunctional documentary families, but the Paskowitz also known as the \"First Family Of Surfing\", maybe the new heavy weights. Assume for a second you father is a Jewish Stanford educated Dr., President of the medical association for the island of Hawaii, who has a mental breakdown/breakthrough...gives up his possessions, and moves to Isreal to live off the land. Here he introduces surfing to the 'Holy Land\", and is in turn, taught the finer things in life, such as the application and enjoyment of Cunnilingus (an event which Dr. P claims \"completely changed his life\".) Dr. P, decides to abandon the pursuit of money or financial security, live in his van with his wife, maintain a healthy lifestyle, and surf. Dr. P, has 9 children who he raises in such a Camper. The family is something of a surfing Partriges of the 70's, and are seen as a symbol of freedom, escape, and adventure to just about everyone they meet. Of course the kids are miserable, desperate to join the real world, which there father forbids them involvement with. . They listen to their parents have loud energetic sex, every single night, separated by a bed sheet. They are forbidden to have any formal education(one actually wants to be a DR.). At one point a family photo is on screen, everyone out in the water and smiling, and one brother says, \"Adams bleeding in this picture actually, he didn't want to be in it. Dad made him\". Which is the movie itself in microcosm. More on that latter....",
         "Dorian Paskowitz marches to a different drummer and he marched his wife and 9 children to that same beat. The sad theme was that \"Doc\" naively behaved as if his children were clones of him. Anyone who is emotionally invested in eliminating diversity from our society will probably have a strong negative reaction to this film. I'm glad the family decided to pull together for this film. Keeping group of siblings on good terms is a challenge for any family. This family has very special reasons for harboring animosity towards each other and I think it is a testament to the power of love and discipline that they seem to have come to terms with their lot in life. If Doc and Juliette had been abusive alcoholics living in welfare housing there would have been no movie, nothing unique and certainly no happy reunion at the end. Those families are more acceptable and less remarkable than the Paskowitz family to the American sensibilities because they do not eschew the State but are assimilated into its worst functions. I wish the kids would have spoken out against family violence. The film doesn't sweep it under the carpet but it certainly doesn't use the opportunity to speak out against it either. Jahfre",
         "THIS is what documentaries are designed to do, teach, inspire, and shift perspectives. Definitely Surfwise compellingly did all of the above. I irrationally and foolishly simply wanted to go out and have more children after my viewing (I've *only*got 2 boys). Thank GOD I cannot have more, but I have to admit I would love to live like the Paskowitz family for a year or two. Here's the reality, only for a few (insert moderate time frame here), would this be the lifestyle for me. But only if there is a safety net of a hot shower and a more spacious end in sight. The lack of education for the children definitely did not sit well with me, this was incredibly selfish. But I did take some personal resolutions taken away from this film: eat healthier, hit the beach and camp with the boys more often, taking actions to fight genocide (there are about five going on right now in 2008 with many escalating in intensity) and anything that I feel strongly about however wacky - if it ain't hurting anybody go for it! Quotes are also memorable - Having to fight to stay hungry truly is our modern day curse.",
         "\"Surfwise\" is what Dorian \"Doc\" Paskowitz has sought to be after he found himself--a surfer guru. A Stanford-educated doctor and observant Jew fed up with conventional life and passionate about surfing, he put two failed marriages and an ordinary medical practice behind him in 1956 and left Hawaii for Israel. He hung out with the bedouin and taught Israelis to surf, but when they wouldn't let him join the military during the Suez crisis he went to California. He and Juliette, his new wife of Mexican/Mexican heritage, first made their home in a 1950 Studebaker. Next \"Doc\" set them up to wander in a 24-foot camper, working part-time in clinics and focusing on family. And I mean family. For ten years Juliette was constantly pregnant or breast-feeding and the result was nine children, eight boys and one girl, all surfers, unschooled, living on a spartan diet of no fat or sugar, sometimes down to their last quarter and crammed into the little vehicle under the iron rule of Dorian and later of David, the eldest, the \"captain\" who carried out his orders--but later rebelled dramatically. No school, no fat, lots of surfing. And always the little camper rig. \"Doc,\" now a tanned eighty-something with an arthritic limp but great vigor of mind and body who still surfs (on his knees), for five decades lived his life in the moment for the pleasures of the waves, which he passed on to the big Paskowitz brood and eventually to many others in his surfing school which several of his sons continue. He decided, as he explains in terms too frank to give here, that his previous marriages had failed because of poor sex. This time with the help of Juliette there was good sex and plenty of it-- every evening, in fact, in the confined quarters, where the kids also had to sleep. Not a very comfortable situation for the boys, whose nomadic life and lack of school made it hard for them even to meet girls. \"Doc\" had become fiercely idealistic, and his example has influenced others and hasn't been rejected by his offspring. Their life was rough, artificial, and arbitrary, and not always fair to the kids. Nonetheless they were the envy of other kids who came their way. They didn't grow up ignorant because they read a lot of books--from public libraries which would like them back. \"Doc\" didn't condone stealing, but penurious circumstances sometimes necessitated a little lawlessness. Big risks were taken when the young ones faced the big waves. There were a couple of serious injuries. But they didn't risk being caught by truant officers because being on the go, the family lived off the books. There is a carelessness and speed about Pray's film that's not entirely out of keeping with the material but is frustrating--right from the start. In over a decade of previous efforts like 'Hype!,' 'Scratch,' 'Red Diaper Baby,' 'Infamy,' and 'Big Rig' the filmmaker has tended toward punk, hip hop, and off-the-mainstream cultures and the Paskowitz radicalism--sort of--fits the picture, but details of the family history, which spans half a century in images and documents, are sometimes allowed to flit by too fast to take in or digest. It is stunning to see the row of boys in wet suits or shorts, perfectly graduated in height, tan and bursting with health if sometimes (by American super-sized standards) precariously lean. Those images are clear enough. \"Doc\" and Juliette, who're still together, living in Hawaii, and both speak a lot on camera, produced a passel of robust young people. In an outtake son Abraham runs down the list in order of arrival on the scene. David was captain. Jonathan was the black sheep. Abraham was the \"little lover,\" \"the soft one,\" Israel was \"the golden boy, \"as talented as he was good looking.\" Moses was \"the Macabee, the giant.\" Adam was \"the genius.\" Salvador was the artist. Navah is the strongest women he's ever met. She lives a conventional life as a suburban housewife in Encino. It's not easy growing up with a crusader, and Paskowitz was something of a dictator, though also fiercely protective. The kids weren't prepared for the outside world, for mercantilism, jobs, traffic, living in a world governed by money. \"Doc\" may have done OK without it, but they couldn't. And when they found friends who got sugar doughnuts for breakfast or later who used alcohol and drugs, it was hard to go back to multigrain gruel and clean living. They were human. Adam wanted more than anything to become a doctor. But when he found out at 18 that he'd need about ten years to catch up on normal preparation for college and medical school, sadly he gave up on those ambitions. He is the one now who pledges to \"keep the dream alive\" and \"put my kids through what Dorian put us through.\" One brother is a professional artist, two are singers, another is in Hollywood. Izzy/Israel who has an autistic son, helps run Surfers Healing, a program of surfing for autistic kids. Two of the other sons are involved in the family surfing school. They seem all to have done well. Some have pretty strong complaints about how their special upbringing handicapped them, at least at first, but they seem to agree that the good outweighs the bad and that what their father gave them was priceless and unique. I say \"seem,\" because this documentary is neither cautious nor searching. There is an unfortunate slapdash feel about it. And it's not a good thing--not at all--that some of the key information seems to be in outtakes on the DVD. There are i's that need dotting and t's that need crossing. The film concludes with a family reunion staged in Hawaii. It emerges that some of the siblings hadn't seen each other or their parents for years. Details are not forthcoming.",
         "Just as the Godfather is a movie about family not crime, so is Surfwise a movie about family not surfing. And although this movie (or the vast majority of all movies) doesn't come close to the cinematic value of the Godfather, it's still one hell of good ride. The film follows the lives of the Paskowitz family, detailing their strange upbringing that is in equal parts inspirational, radical, and debilitating. There family is so large, personalities so varied, talents so strong that it's easy to get lost between everyone yet the film manages to tie it all wonderfully together. Full of home video footage, mixed with interviews and some lines causing me to spew whatever I was drinking in laughter and astonishment, this documentary keeps you engaged and thinking the entire time. It's a powerful story, a mind-boggling piece of 'what if' psychology, and easily appreciated even if you are not a fan of surfing.",
         "Dorian \"Doc\" Paskowitz has been riding the waves for nigh unto three-quarters of a century now. In 1956, at the age of 45, he abandoned a career as a doctor to pursue a life dedicated almost exclusively to surfing and raising a family - and he hasn't looked back since. In fact, Doc and his family have achieved a notoriety of sorts (in surfing circles, at least) for their nonconformist, iconoclastic lifestyle, which involved all eleven of them living together in a cramped 24-foot camper trailer, avoiding any kind of formal schooling, and flitting from one beach to another in search of the perfect wave. Now, in his mid 80s, Doc, along with his wife, Juliette, and their nine kids - eight of whom are named after Biblical figures - discuss their lives and upbringings in the fascinating documentary \"Surfwise\" by director Doug Pray. Life literally has been a beach for these people. The thing that strikes us most about Doc is that he is no self-conscious radical trying to make an ideological point with his life; rather, he's a fairly average guy who's honest enough to admit that he never much cared for school or the money-grubbing rat race of the corporate or business world and that he is simply much healthier and happier when in the water. And it is these values that he has chosen to instill in his children, along with a devotion to their Jewish heritage and a healthy attitude towards sex (apparently, he and his wife were less than shy about showing their affection for one another in front of the children, much to the kids' consternation at times). But there has been a definite downside to this nonconformity as well, and the movie does not shy away from depicting it - whether it be in Doc's dictatorial, even violent, methods of maintaining his authority over the kids or in the children's understandable desire to break free of their upbringing to lead a lifestyle more in accord with social norms. And, of course, there's the resentment they've come to harbor in their later years towards a father who, by willfully choosing to separate them from the outside world, rendered them ill-equipped to function in that world once they became adults (one son laments that he could never attend medical school because he was too far behind all the other applicants in basic knowledge to successfully compete with them). The movie raises the thorny issue of just how much right a parent has to deny his children the privileges and benefits that come from being socialized into the society around them. Was Doc practicing a form of child abuse - or simple providing his kids with a rare and perhaps enviable opportunity to live life as one long summer camp? (The family does actually run a camp of sorts dedicated to teaching the fine art of surfing to crowds of eager youngsters). Even the kids themselves can't agree on the answer to that question, with some feeling the need to defend their dad and the way in which he raised them and others choosing to lash out at and lambaste him for the same reason. Yet, the children could hardly be classified as dysfunctional adults, with each of them pursuing respectable careers and raising apparently stable and healthy families. Perhaps the most remarkable feature of the documentary is that it leaves it up to the viewer to formulate his own assessment of Doc. We're never pushed to take sides in the conflict. Through Doc's story, \"Surfwise\" provides a fascinating look at what it means to be a family, what it means to be a parent, and why it's important to find a balance between the overindulgences of the modern world and the deprivations of a simple life, not completely ignoring one at the expense of the other. The movie ends on an upbeat note with a long overdue reunion where old wounds are healed and old grudges put aside - all in the name of Family. Which is, I suppose, as it should be.",
         "The tight knit Paskowitz family lived a dreamlike existence packing their nine kids into a camper, living beach-side in cities across the US and Mexico, surfing everyday, never sending the kids to school and working only when they had to. By 2006, many of the family members weren't speaking to one another. The story of how the family fell apart is at the center of this intriguing documentary. Dorian \"Doc\" Paskowitz, the patriarch of the family, is a Stanford graduate and one-time head of the American Medical Association for the State of Hawaii. Though he achieved significant professional success at a young age, he was miserable and dropped out of his work and marriage. While on a worldwide research tour--bedding numerous women--he meets Juliett who scores high on his \"1-100\" scale that he uses to quantify each conquest. She joins him in the tiny camper and together they go off to live Dorian's dream. He feeds the kids an all natural diet, keeps them out of school, teaches them how to surf, and conducts all marital activities in front of his nine children. The film uses a mix of news footage, still photography, and modern day interviews. At first the tone of the film is kind of wacky and fun, but the tone grows darker and more bizarre as the children age. Is Dorian a tyrant? Is he forcing the family to live a dream that is fundamentally unwise, unhealthy? The film lets Dorian and the children pass judgment on their own experience. (Ordeal?) Some of the now grown children's' interviews are particularly painful including a pained, angry song from son David which he wrote for his father and sings to the camera. This is one of the rawest, most uncomfortable film moments I have seen in recent years. \"Surfwise\" wisely lets each family member speak for themselves and in doing so creates an even-handed, fascinating look at a family in crisis.",
         "A pretty excellent viewing experience with some hilarious jaw-dropping moments, especially some of the comments from Doc. (Don't watch this with your kids if you're not comfortable talking about cunnilingus with them.) The movie is a little long, and it never answers the question of how you pay for gas, food, clothing, and campers without a job, but very worth watching. Excellent soundtrack, which I'm having a hard time finding (a little help anyone?). Doc's family philosophy is incredibly compelling, even if fatally flawed. Lots of moving moments, where some characters, I mean PEOPLE, come to some grave realizations about their lives, and you see how one man's whacked ideas can spread and infect the lives of others. The big question is, does Doc see what he hath wrought? You think YOUR family is screwed up...",
         "This movie is not about surfing, although that is the background. It is a movie about parenting. \"Doc\" Paskowitz drops out and becomes a surfer. he marries and has nine children. They all travel about the country in a 24' trailer. Now, one can imagine the effect on the children as their brothers and sisters were being made right before their eyes in that trailer. They had sex every single night. \"Doc\" had his life, but what about them? No schools, no friends, just traveling from place to place so daddy can find himself. Of course, you may accept his beliefs that \"cultures (like ours) that are all f*cked up about f*cking, will decline and cause wars.\" And, maybe you can accept that having a bad family is better than no family. But, you have to agree that his method of parenting had serious implications for how his children lived in the real world. I couldn't have went back."
      ],
      "genres": [
         "Documentary",
         "Sport"
      ],
      "productionCompanies": [
         "Consolidated Documentaries",
         "HDNet Films",
         "Mekanism"
      ],
      "summaries": [
         "The inspiring and tumultuous story of 85-year old surfer, health advocate and sex guru, Dr. Dorian \"Doc\" Paskowitz, his wife Juliette, and their nine children who were all home-schooled and raised in a small camper on the beach, where they surfed and had to adhere to the strict diet and lifestyle of animals in the wild.",
         "Doug Pray explores the life of surfer Dorian \"Doc\" Paskowitz."
      ],
      "budget": 127000
   },
   "movielensId": 60135,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-01-01",
      "dvdReleaseDate": null,
      "directors": ["Doug Pray"],
      "runtime": 93,
      "movieId": 60135,
      "title": "Surfwise",
      "mpaa": "R",
      "actors": [""],
      "imdbMovieId": "0479547",
      "originalTitle": "Surfwise",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["uw4sUEV8lL0"],
      "plotSummary": "The inspiring and tumultuous story of 85-year old surfer, health advocate and sex guru, Dr. Dorian \"Doc\" Paskowitz, his wife Juliette, and their nine children who were all home-schooled and raised in a small camper on the beach, where they surfed and had to adhere to the strict diet and lifestyle of animals in the wild.",
      "tmdbMovieId": 26354,
      "avgRating": 3.51111,
      "releaseYear": "2007",
      "numRatings": 45,
      "posterPath": "/3oSnMMLorkctvXUOloNxHkSezaB.jpg"
   }
}