{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "sport",
         "id": 6075
      }],
      "imdb_id": "tt1204298",
      "video": false,
      "title": "Gunnin' for That #1 Spot",
      "recommendations": [],
      "backdrop_path": "/iI49oEWluKCcgx9vKiz5J9VGbKG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe43fd9251416c910014b1",
               "name": "Jerryd Bayless",
               "profile_path": null,
               "id": 1048655,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe43fd9251416c910014b5",
               "name": "Michael Beasley",
               "profile_path": "/mk8jUlzVPUsKSQjHi6ATtaCtb47.jpg",
               "id": 143261,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe43fd9251416c910014b9",
               "name": "Tyreke Evans",
               "profile_path": null,
               "id": 1048659,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe43fd9251416c910014bd",
               "name": "Donte Greene",
               "profile_path": null,
               "id": 1048662,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe43fd9251416c910014ad",
            "name": "Adam Yauch",
            "profile_path": null,
            "id": 115611,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.267301,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30106,
      "vote_count": 5,
      "budget": 0,
      "overview": "The film follows 8 of the top high school basketball players in the US at the time of filming, in 2006. The plot centers around the first annual Boost Mobile Elite 24 Hoops Classic game at the legendary Rucker Park in Harlem.",
      "similar": [
         9655,
         10637,
         22881,
         8923,
         9291,
         2300,
         13416,
         323677,
         86130,
         4942,
         10474,
         9614,
         9472,
         11770,
         12163,
         15070,
         707,
         1578,
         1374,
         45317
      ],
      "original_title": "Gunnin' for That #1 Spot",
      "runtime": 90,
      "poster_path": "/86qDteN6zqQRcFEa60FfPjLWmf1.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2008-04-18",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Adam Yauch"],
      "runtime": 90,
      "synopsis": "On the corner of 155th Street and Frederick Douglas Boulevard in Harlem, New York, lies Rucker Park. By appearances, the green concrete pavement, anchored on either end by its run down slab bleachers, is no different than any other basketball court in the city. But this is the place where nicknames are earned and basketball legends are made. On September 1, 2006, the top 24 high school basketball players in the nation stepped out on this same court that once saw the likes of Wilt Chamberlain, Kareem Abdul-Jabbar, and Dr. J, to compete in the first annual \"Boost Mobile Elite 24 Hoops Classic.\" GUNNIN FOR THAT #1 SPOT documents these athletes' skills on the most legendary court in the world, showing never- before-seen footage of that \"Elite 24\" game. Directed by Adam Yauch (founding member of the Hip Hop trio the Beastie Boys and director of \"Awesome: I Shot That\"), the film follows eight of the country's premiere high school basketball players on the fast track to the NBA, as they are adored by fans, wooed by colleges and sneaker companies, and groomed to be in the spotlight of the multi-million dollar game. Blending this next generation of b-ball players with a mix of raw hip-hop, jazz and break beats, and Yauchs unique kinetic filmmaking, GUNNIN is an explosively entertaining look at soon-to-be NBA All Stars. *Since the Elite 24 game 18 months ago, five of these players have become national celebrities and university legends playing for top college basketball programs. The other three are still in high school.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1204298/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMTE1MDYxN15BMl5BanBnXkFtZTcwMDEwOTM2MQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Jerryd Bayless, Michael Beasley, Tyreke Evans | See full cast and crew »"],
      "reviews": [
         "An outstanding soundtrack that seems to magically enhance every single scene resonates throughout Adam Yauch's latest documentary exploration: Gunnin' for That #1 Spot. Following the formula for typical documentaries, Yauch examines eight high school basketballers vying for recognition, college scholarships and attention from the NBA. But while a few unique camera tricks are used to enhance the rudimentary questioning of family and friends, Gunnin's #1 nemesis is the same predicament far too many documentaries face: the subject matter. Highly appealing to those interested in the topic, the film never breaks into total entertainment for those not enmeshed in the frenzy and corrival nature of an elite game at Rucker Park. Eight high school kids, including Jarryd Bayless, Michael Beasley, Kevin Love, Kyle Singler and Tyreke Evans, are gearing up for an invitation to one of the most prestigious basketball events in the nation. The Elite 24 pits the top talents all around the U.S. against each other in a competitive game of basketball at the famed Rucker Park. Where Reebok, Adidas, and Nike have their own camps to harvest the best young basketball talent, The Elite 24 doesn't separate players based on their shoes. It is an all-out battle between the best of the best in high school basketball. Adam Yauch from Beastie Boys fame directs Gunnin' for That #1 Spot with a standard documentarist feel for material. From the generic opening title sequence with painfully low-budget graphics, to the commonplace hand-held camera-work, there really isn't anything technically outlandish to witness. Yauch uses a fisheye lens for visual flair in an impressive aerial shot above New York, but then proceeds to overkill the idea by utilizing it for every other subsequent shot. The most exciting moments, including the shattering of a backboard at a high school game, are home video footage from the bleachers, and are unfortunately incredibly grainy. While more of these exhilarating moments would have been gladly welcomed, the low quality of such archives detracts from truly focusing on the amazing talents of these young men. The most impressive aspect of Gunnin' for That #1 Spot is the soundtrack. Blazing hip-hop, smooth jazz, break beats and heavy rhythmic clips permeate the documentary and manage to make each skilled maneuver just that much more awe-inspiring. But like so many documentaries, Gunnin' suffers from the fact that its subject matter appeals to a very distinct group, and doesn't have the power to transcend to other demographics. With the inspiring notion that these kids are as young as 15 years old, the hilarious nicknames, the brightly colored shoes, overbearing agents, questionably experienced professional analysts, pressures of the media and an abrupt conclusion, Gunnin' for That #1 Spot is enlightening and entertaining, but tragically too narrow. - Mike Massie",
         "When I read New York Magazine's recommendation of Gunnin' as their top pick of the 300+ flicks at TriBeCa Film Festival, I took a couple days off from work just to check it out. It turned out to be a magical trip. The audience at Tribeca talked to the screen the way any good congregation does on a Sunday morning. Neal Usatin, the film's lead editor, got a particularly good reception when his credit floated on a ball across the screen. (Makes me think I should keep my eyes on his work.) I loved it so much I went back to NYC for its theatrical premier, just down the street from the Rucker in Harlem, to see how it had been tweaked. And I'm not even a basketball fan. This film fits the way I think. It's fast, and like good comedic timing, presents the player's stories in a way that left me wanting more -- if I'm interested, I'll look it up. The imagery goes from Redacted-style website searches, to fisheye trips over and through NYC, VHS- quality home video, to YouTube footage and HD slow-mo. It's like every photographic and film experiment ever discovered, sampled and flashed before my eyes. On that level, it's like the ultimate style collage. I bought an educational license and showed it to my high school varsity basketball team. They rolled at Bobbito's nicknames (Shampoo!) the way only those who live it know how it sounds. In fact, they loved the soundtrack so much, I'm buying a copy so they can warm-up to it. The stand-outs in my book are the bird's-eye, fisheye tour of New York to the smooth sounds of \"Let's Do it Again\" (on loop). The lens makes Manhattan seem like it's half the world. I love chapter 16's fisheye tour at ground-level; especially when the beat hits on the pigeon and taxi moving in opposite directions. Chapters like this in a movie make for perfect party background pieces. I show them to my friends who don't have time to see the whole movie, but know a good visual over a beat. You could rent it, but this is also a great example of the artistry of packaging. It's a stand- out example of graphic design gone fine art. From the paper and ink choices, to the colors and the trading cards. (Would have been cooler if they'd been actual cards. Maybe an add-on purchase soon?), this is one of those instant classics that deserves to be in any film-lovers permanent collection.",
         "Gunnin' for that #1 spot was a neat glimpse into the world of the top high school basketball players. The lives of the high school players was way more intense than I would have imagined. On the outside, they all seemed like your typical high school boys, but their passion and skills for the sport really set them apart from other high school students. The mere fact that they had college coaches and sponsors trying to recruit them all the time showed that these guys were on a completely different level than your average high school basketball player. The determination of the college coaches to have their chosen player recruited to join their school and play for them was really astounding. I didn't realize that so much effort went into recruiting high school players. The kids seemed way older than 17-18 years old because they had to deal with so much, and some of them had to make some really mature decisions regarding their futures. The visual effects made the movie fresh and not monotonous. It was able to hold my attention and kept me wanting more. I feel like the visuals mixed with the music really added a lot to the documentary and made it even more entertaining. I absolutely loved the music all throughout the film.",
         "It's almost hard to believe that this kind of film, so focused on the livelihood and future of a couple of teenagers, could actually ignore emotion completely. A very important topic, not completely neglected, just not focused on as much as I thought was necessary. I just thought it numbed how much emotion is actually put into these basketball players' games. From what I perceived from the film, basketball was most likely going to be these kid's main means of support. So what was to happen if they lost? Without the emotion of the players how are we supposed to relate to the film and genuinely understand how much basketball means to them? Not a complete miss, the characters were well explained otherwise, with statistics and coach support, also explaining how competitive High School basketball is. As a documentary you are allowed to get so personal with your subject, which is something the film COULD have accomplished easily.",
         "One of the highlights is the goofy color commentator who gives nicknames to all the players, comments on their shoes, begs out loud for someone to bring him free food and drinks and complains that his microphone is soaked with spit. The other highlight is one of the \"coaches\" who tells his team of all-stars \"Africa has AIDS. We have a case of the 'Me' disease.\" Otherwise this movie is not worth seeking out. The opening sections where they go into the backgrounds of the players are boring. Nothing on the level of Hoop Dreams, or even of a quality of a halftime show of the players' lives. I have to add one more line to get this published.",
         "The release of Hoop Dreams in 1994 set the standard for basketball documentaries. It depicted the lives of two young men on their journey to fulfill their \"hoop dreams,\" discussing their victories as well as the challenges in their way. No film has since had the same impact; Hoop Dreams was the Michael Jordan of basketball films. So who are the Lebrons, the Carmelo Anthonys, the Chris Pauls? Hoop Dreams has had no match, no counterpart until Oscilloscope's Gunnin' For That #1 Spot. Gunnin' documents eight of the nation's top-ranked high school basketball players as they travel to the first-ever Elite 24 basketball game at the famous Rucker Park in Harlem, where legends have been known to be born. Between astonishing clips of high school games, where senior Kevin Love breaks the glass dunking, and interviews with coaches, trainers, critics, and family, the boys tell us about themselves, their hopes, their game, why they play. It is clear from listening to them talk that they are typical teenage boys who go to regular schools and have regular lives, except one thing; they are the nation's top high school basketball players of any age, and they're almost famous. As the story moves on from getting to know them, their lives, and their game, we become as eager for the Rucker game as the boys themselves, trying to anticipate who will shine. In Harlem, the boys spend three days together, practicing with NBA trainers and being showered with freebees as companies try to snatch the boys up for endorsement early. The game is not a high school game, and these great eight are not just high school players. Dunk after dunk, windmills and swooshes from across the court, the Rucker game brings the excitement of every slam dunk contest, the discipline of the basketball veterans, and renewed intensity reminiscent of Hoop Dreams. Gunnin' leaves us wanting more, hungry for slams dunks and anxious to see which one of these basketball phenoms will join the ranks, who will claim that number one spot."
      ],
      "genres": [
         "Documentary",
         "Sport"
      ],
      "productionCompanies": ["Oscilloscope Pictures"],
      "summaries": [
         "In September, 2006, the top 24 high school basketball players in the nation stepped out on this same court that once saw the likes of Wilt Chamberlain, Kareem Abdul-Jabbar, and Dr. J to compete in the first annual 'Elite 24' all-star game. GUNNIN' follows eight of these players as they prepare to showcase their skills at the most legendary playground in the world. The film trails these players on the fast track to the NBA, as they are being groomed to be in the spotlight of a multi-million dollar game.",
         "Eight of the U.S.'s top high school basketball players compete in the first \"Elite 24\" tournament at Rucker Park."
      ],
      "budget": 0
   },
   "movielensId": 60284,
   "movielens": {
      "languages": [""],
      "releaseDate": "2008-04-18",
      "dvdReleaseDate": "2008-10-21",
      "directors": ["Adam Yauch"],
      "runtime": 90,
      "movieId": 60284,
      "title": "Gunnin' for That #1 Spot",
      "mpaa": "PG-13",
      "actors": [
         "Jerryd Bayless",
         "Michael Beasley",
         "Tyreke Evans",
         "Donte Greene"
      ],
      "imdbMovieId": "1204298",
      "originalTitle": "Gunnin' for That #1 Spot",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The film follows 8 of the top high school basketball players in the US at the time of filming, in 2006. The plot centers around the first annual Boost Mobile Elite 24 Hoops Classic game at the legendary Rucker Park in Harlem.",
      "tmdbMovieId": 30106,
      "avgRating": 3,
      "releaseYear": "2008",
      "numRatings": 10,
      "posterPath": "/86qDteN6zqQRcFEa60FfPjLWmf1.jpg"
   }
}