{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "space suit",
            "id": 1828
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "space centre",
            "id": 211487
         }
      ],
      "imdb_id": "tt0487928",
      "video": false,
      "title": "Dante 01",
      "recommendations": [
         16909,
         24553,
         36177,
         34681,
         41846,
         14403,
         99251,
         16268,
         6277,
         62721,
         131476,
         169953,
         71381,
         143569,
         55998,
         28933,
         29361,
         52256,
         15011,
         26125
      ],
      "backdrop_path": "/cdaslM0fCLGCbeR9qKtO6NiHcZX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Saint-Georges",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071b67",
               "name": "Lambert Wilson",
               "profile_path": "/jFkr2kuFfpzS1plfOlNJ6kURV6O.jpg",
               "id": 2192,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Elisa",
               "gender": 1,
               "credit_id": "52fe463c9251416c75071b6b",
               "name": "Linh Đan Phạm",
               "profile_path": "/l3GvGzT46PQEQMNaFE57HE1pjml.jpg",
               "id": 19115,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Perséphone",
               "gender": 1,
               "credit_id": "52fe463c9251416c75071b6f",
               "name": "Simona Maicanescu",
               "profile_path": "/b4hCnBwZtcYqvxDuG6r7Fs0fkjM.jpg",
               "id": 77902,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "César",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071b73",
               "name": "Dominique Pinon",
               "profile_path": "/uXS9jinsWVT1ZWAz8rj9ifCy9qS.jpg",
               "id": 2413,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Bouddha",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071b77",
               "name": "Bruno Lochet",
               "profile_path": "/SNuKtVcGejDrxmMrvHBksrTs5x.jpg",
               "id": 71377,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Lazare",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071b7b",
               "name": "François Levantal",
               "profile_path": "/abfVtuDDsjxkv8bICcO33k6n6vG.jpg",
               "id": 5440,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Moloch",
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b7f",
               "name": "François Hadji-Lazaro",
               "profile_path": "/xLAuJ8o7cH0i2ZwSYAcD5VHIPZL.jpg",
               "id": 77904,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Raspoutine",
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b83",
               "name": "Lotfi Yahya Jedidi",
               "profile_path": "/pcqomuB8rwAKLuoB4tHhNjXOHn1.jpg",
               "id": 77905,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Attila",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071b87",
               "name": "Yann Collette",
               "profile_path": "/q7GGqhD87jmy6MSHArMoacC8RYK.jpg",
               "id": 77906,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "BR",
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b8b",
               "name": "Dominique Bettenfeld",
               "profile_path": "/4LovjhsdwsUsHjFfIyOoWPYBB6T.jpg",
               "id": 28462,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "CR",
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b8f",
               "name": "Antonin Maurel",
               "profile_path": "/7Ne6JahY7ucdDg2G0rXRTikXdkQ.jpg",
               "id": 77907,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Charon",
               "gender": 2,
               "credit_id": "52fe463c9251416c75071b93",
               "name": "Gérald Laroche",
               "profile_path": "/lblUFtSye9ZdBuKkPiUokkUIVDh.jpg",
               "id": 77284,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b51",
               "name": "Marc Caro",
               "profile_path": "/tUOvPzeZsFLjkclLks4xATX5PJC.jpg",
               "id": 13680,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b57",
               "name": "Marc Caro",
               "profile_path": "/tUOvPzeZsFLjkclLks4xATX5PJC.jpg",
               "id": 13680,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b5d",
               "name": "Pierre Bordage",
               "profile_path": null,
               "id": 77900,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe463c9251416c75071b63",
               "name": "David Martinez",
               "profile_path": null,
               "id": 77901,
               "department": "Crew",
               "job": "Additional Dialogue"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 4.065859,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 15125,
      "vote_count": 44,
      "budget": 8000000,
      "overview": "Deep space, at the edge of the galaxy. The future. A new prisoner arrives on top security prison ship and psychiatric research unit Dante 01. Sole survivor of an encounter with an alien force beyond imagining, Saint Georges is a man possessed by inner demons, caught up in the battle to control the monstrous power within him. It's a power that will infect the other highly dangerous occupants of Dante 01, gaolors and prisoners alike, unleashing a violent rebellion that turns this terrifying, labyrinthine world upside down. In the otherworldly hell of the ship's depths, through danger and redemption, each must journey to his very limits... each must confront his own Dragon.",
      "similar": [
         95,
         157336,
         286217,
         568,
         107846,
         698,
         348,
         395992,
         49047,
         68179,
         11119,
         5925,
         9291,
         1368,
         667,
         1429,
         708,
         278,
         76640,
         1701
      ],
      "original_title": "Dante 01",
      "runtime": 82,
      "poster_path": "/jdPWkbV4pPzB9esCZ10tyfwjLpW.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": "/8T8OOQe3Xei2mW0DQepwQG1IMT0.png",
            "name": "StudioCanal",
            "id": 694,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Eskwad",
            "id": 616,
            "origin_country": ""
         },
         {
            "logo_path": "/z0vTTWBhZggM09oZWSY3hbXgPKv.png",
            "name": "Wild Bunch",
            "id": 856,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "CinéCinéma",
            "id": 6301,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Région Ile-de-France",
            "id": 11246,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Conseil Régional des Pays de la Loire",
            "id": 37104,
            "origin_country": ""
         }
      ],
      "release_date": "2008-01-02",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "In deep space, there is no rescue.",
      "adult": false,
      "homepage": "http://www.dante01.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Marc Caro"],
      "runtime": 82,
      "synopsis": "Deep in space, above a fiery prison planet named Dante, Dante 01, a scientific space station orbits the planet. Its inhabitants include two security guards, two scientists and six prisoners whose crimes were so severe that they volunteered to live under experimentation rather than face death penalties. One day, a shuttle arrives with a new scientist named Elisa. Her passenger is a man of unknown origins, who wakes up severely disoriented, unable to speak, and often falls into blank stares at what he sees as a bright, shimmering light. He seems to be aware of his surroundings, though, but is unable or unwilling to interact with them for the most part. He is introduced to the prisoners: their leader César, his right hand man Lazare, the large Moloch, the socially reclusive Bouddha, Raspoutine, a religious man who believes in repentance with God and the only one who sides with Saint George in the beginning, and Attila, a computer hacker. Raspoutine claims that the new one was sent by God to save the lot of them, calling him \"Saint George, the Dragonslayer\", because of a tattoo \"George\" has. Elisa and the station's head researcher, Perséphone, are at odds over their research methods. Meanwhile, the arrival prompts the station's commander Charon to work with Attila in hacking into Elisa's files and finding out what she is really there for. Much to Attila's horror, her experiments authorize her to kill all of them for the sake of the research. Meanwhile, Bouddha's self-righteous killing pattern takes effect when he sees George in great pain, and attempts to strangle him in order to alleviate his suffering. This leads to infighting amongst the other prisoners, and the wardens use gas to knock them out. Bouddha becomes Elisa's first experiment. She injects him with nanotechnology and returns him to the prison hold. Bouddha's own unbearable pain from the nanites bonding with his DNA summons George, who is somehow able to remove them from him (George is seen removing some kind of abstract energy creature from Bouddha and eating it; he does the same later with Moloch and César) and Bouddha becomes well again. Bouddha then becomes as convinced as Raspoutine that Saint George is a miracle worker and befriends him, swearing to protect George. Moloch attempts to attack George. In the fight, Moloch pulls a knife, and Raspoutine's struggle with him causes Moloch to accidentally slit his own throat. Gas pours in to knock the group out, but not before George runs over to assist Moloch. The prison guards discover, to their amazement, that Moloch has no wound on his throat, and is alive and well, although unconscious. On their way out they inject César with the nanotechnology as they did for Bouddha and depart. Perséphone's assumption that George is a miracle worker is scoffed at by Elisa, but Moloch's doubts prompt César to await an impending usurping of his authority, and he plots to get rid of George. However, César's sudden bouts of pain and illness from the nanotechnology render him unable to take care of George himself, and Lazare and Moloch are sent in his stead. Meanwhile, Charon is contacted by Attila and learns that Attila has locked all of the main computer systems in an attempt to resist their eventual sacrifice. While Bouddha and Raspoutine are distracted, George is attacked by Lazare, and stabbed several times in the chest and abdomen. During experiments on George's corpse, Perséphone has doubts about Elisa's methods, but she is overruled by Elisa and Charon. Before Elisa can continue with her experiments, George, who is supposedly dead, wakes up completely healed, grabs Elisa and uses her as a hostage to reach the prison quarters before releasing her. César is in severe pain from the nanomachines, and George cures him. Attila appears and tells the others of his plans to destroy them all out of spite, by making the space station crash into Dante. Objecting to this, the prisoners subdue Attila while George attempts to cure him, but Attila manages to break free and runs away. César and his crew attempt to catch Attila; they eventually find him, only to see that he has hanged himself. With Attila dead, their plans for stopping the station's decaying orbit require the scientific personnel and the prisoners to work together, since the mechanism necessary to stop the decaying orbit is located under a trapdoor below the prisoner's quarters. The prisoners agree, and while Charon and Perséphone lead the security to the prisoner's area, they leave Elisa alone to man the controls. As the station inhabitants work to open the hatch to the manual control unit, the gas goes off, knocking out the lot of them. Elisa preps and attempts to escape via shuttle, but Lazare, who had to hold his breath during gas emission, forces her into letting him escape with her. As the others awaken, one of the guards goes to check on the shuttle, and finds that as part of his meddling, Attila had also locked the shuttle controls as a result, Elisa and Lazare are killed when the shuttle crash lands on the planet below. Opening the panel, the group finds that the hatch to the override room is filled to the top with boiling water. César realizes he is the only one who can properly fit into the little space, and is wrapped in some protective fabrics, covered with cold water and jumps in. He loses his protective goggles on the short trip, and emerges on the other side horribly burned and dies in the compartment before entering the six digit code necessary to reset the control computer. Though dead, he indirectly managed to enable their escape from the planet's orbit: in a strange epilogue, Saint George emerges from the station in a space suit and floats above the planet on thin air he could not save the station, so he changed the context, suddenly using the full extent of his strange and inexplicable powers (while doing this, it is seen that the strange \"creatures\" he extracted from the others are now existing inside him) to terraform Dante into a livable planet, while his body disintegrated in space as a result. Source: Wikipedia",
      "writers": [
         "Marc Caro",
         "Pierre Bordage"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0487928/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1OTg1MDc2MV5BMl5BanBnXkFtZTcwOTY5ODU4MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Lambert Wilson, Linh Dan Pham, Dominique Pinon | See full cast and crew »"],
      "reviews": [
         "Got the chance to see this at the Sci-Fi London last night in a packed cinema. As a big fan of City of Lost Children and Delicatessen I was suitably excited. The film establishes itself from the off with a very confident and distinct visual style and sense of (the deep, dark void of) space. A man arrives at a colony circling the fiery planet Dante, his name and history unknown. The ship is a base for psychiatric research on a handful of criminals, held as guinea-pigs and cut off from outside contact. The new man is seen as a messiah by some of the convicts, a trouble-maker by others, as the psychiatrists carry out routine and risky genetic experiments with their DNA. The film maintains a heightened feeling of tension and claustrophobia that is almost migraine inducing but transfixing. The editing is first rate and the film is well acted (Dominque Pinon, a Caro and Jeunet regular, appears). Unfortunately, the plot keeps promising to go somewhere but ends up disappearing down a black hole of messianic symbolism, and the dialogue is fairly bland and perfunctory. The violence is also almost sickening at times, though this may not bother some. This is a very confidently directed film that is clearly the unique vision of one very creative visualist, I only hope Caro could have applied his touch to better material and not surrender to pretensions of the religious and philosophical. I'm not suggesting that no film should try to tackle these things, but this film doesn't deliver enough of anything else. Many will call the film deep but ask them what it's about before you believe them. Worth seeing, though. Definitely deserves better marketing, but I wouldn't want to be the one to do it.",
         "Considering Caro's past work in the movie field, one can really look forward to see his latest film as director : Dante 01. Well I have to say I was for one really eager to do so and as I watched the movie, even as a full open minded viewer, some scenes were feeling just ... incomplete. The thematic is quite fine, a deep space station used as a psychiatric facility is exiting knowing the visual taste of Caro and the cast is well done too, but in the end every way you look at it the movie never fully unfold his potential. The story, as mysterious it can be, fail to be emotional or understandable at any level which is really disappointing considering you can't connect to any character at all - especially not with the main one - having a feeling of emptiness despite the solid material that could have been used in a much better way. The budget isn't large for this movie, that's obvious and still the director pulled some extremely good shots and some solid acting while being uneven at times (considering the budget, I can only guess that some takes as to be done only a few times), still, beyond that there is nothing to properly think of. As said, the story was somewhat promising at the beginning ... and sadly looks still promising at the end, it's a tale with a slow beginning and no real end or ground to rely on - an etheral narration with some pretty visuals and scenes empty of meaning. If I were to make a comparison, I'd pick \"The fountain\". They look alike in many ways, sharing a radical vision of movie-making and story telling but where the fountain kept me involved in the character development process and opened some thoughts, \"Dante 01\" just got me lost somewhere loosing the meaning of it's concept - or maybe I never got it in the first place. Overall, the movie itself isn't bad and you can see it without regrets it's still a nice movie but it's nothing more and that is probably the most disappointing thing about it : you don't feel more than looking at an OK film. Now, I do hope Caro will be directing again and with a better budget and more freedom over his uncompromising style, making this one just a trial step for better materials next time.",
         "I'm usually a very 'nice' reviewer. The kind that usually overlooks some faults in movies because the 'experience' is truly what matters to him. So, 'tis with a heavy heart that I say; I have to agree with the majority of reviewers here. This movie feels like it was obviously cut short because of money or deadline issues, so it is painfully frustrating in that sense. The story is interesting, and the visuals and sound are astounding, although very influenced by older sci-fi movies (Alien 3 and Resurrection come to mind), but the religious overtones are rendered abstract (at best) by end of the movie. This is a beautifully well-made movie with awesome visuals, but it has to be taken as an experiment, just like inside the story. Or as an experience, if you prefer. That's because essentially, the last part of the movie was completely lame. And by lame I mean obviously rushed, incomplete and unfinished. Similar to \"The Objective\" in that respect, but even worse. So allow me to present this movie in another way - as an experimental movie. As an audiovisual spectacle for the senses. And as such, Dante 01 is a marvel. Having said that, the average casual moviegoer will probably not appreciate it in that sense and thus ask for a refund.",
         "I pulled this one out after reading someone's review here. One-- If you pull the DVD via Netflix, you CAN change the language to English, although I am sure that you will notice some of the lines just fall so flat it hurts, but if (like me) you are not a native French Speaker, you will just have let those moments pass. Just try to ignore long complicated lip movements when the actor gives a three-word answer. Plus the Dubbed English is can be extremely FLAT and lacks emotion. The Film is dark, clinically brutal and coherently themed. The scene is an orbital Psychiatric station around some unknown planet named Dante 01. The patients/inmates are all hopelessly criminally insane. And here arrives another patient with a cold-eyed research doctor who begins to conduct not-quite-kosher nanotech psychonueral experiments on the inmates. On board the station already are two resident doctors, one of whom has a dark secret of his own. The Sets are well thought through and definitive. You will feel the close, tight confines of a Space Station and a sense of vulnerability both to space itself, and empathize with the vulnerability of the inmates who seem to be caught in a maze of compartments wherein they are treated more like lab animals than patients. The problem-- and the reasons I rated this a 6 --is the story line. Saint-George's history & origin is vague and not explained. Maybe in the French version there is some side explanation-- but not in the English dub. But if you ignore that omission, the story did move with a rough-edged deliberation that is part intelligent prison-drama and Medical Science Gone wrong, an interesting combo. The new Doctor commences experimental injections on the prisoners with some rather icky internal graphics and outward pain and suffering. At the same time, Saint-George is manifesting some strange 'power' that has an origins with whatever the heck happened to him in the past. As you watch the movie you will be settling into watch what happens when Saint-George's power manifestations begin to go head-to-head with the Doctor's twisted medical experiment. THIS was the script and the imbued storyline for the first two thirds of the movie which makes this movie different from MOST of the Sci-Fi out there. Here is where I downgraded the movie down to a 6. Either they ran out of Time or Money or the good graces of the Producers-- because the ending was just slapped onto the end of this movie just for the sake of being able to say: \"The End\". One of the inmates acts of his own and accesses the station's system to send it powering out of orbit, then locks the controls. Well. . .he IS criminally Insane. And That's what Criminally Insane people DO. Okay. . .except here's where the Movie ran out of Time or whatever because it goes from being cerebral Sci-Fi and becomes suddenly Brainless. Because it turns out that the only way to stop disaster is to get to the Manual control which is only accessible INSIDE the Prisoner quarters? Oh. . .that makes Sense. And it gets better-- Once INSIDE the Prisoner quarters, you then have to open a conduit filled with BOILING HOT cooling fluid and swim down a corridor to this little isolated room where the EMERGENCY CUTOFF is? Oh that makes even MORE Sense than before. I know and recognize the Mad Engineering Schematic gimmick. Emergency Switches that are ALWAYS located on the OPPOSITE end of a facility or Ship and the ONLY way to get to it is through a tunnel filled with Toothy Alien Monsters? And the only things that makes this gimmick work is that the male viewers usually get to ogle the scantily clad female heroine screaming alongside the hero as they fight their way to aforesaid 'Emergency Switch'. That doesn't happen here, though. So put your beer down. Instead one of the Inmates VOLUNTEERS to dive INTO THE BOILING OIL and swim to the switch. Think 'Deep Frying'. Okay, that's rich! But it's still workable-- if he were to don a spacesuit. . .They ARE on a Space Station after all. And he IS Insane?!? But NO! They rip and cut INSULATION, douse it with water and wrap the fool up from head to toe in foamy strips that will only SUCK UP BOILING OIL Cooling fluid as ANY IDIOT will tell you it would. Think 'French Fry'. But at least they give him strap on Goggles. . .which come off while he's in the boiling oil. I will say that the fellow gave the Director and the audience some heart-wrenchingly convincing SCREAMS before flicking the switch and then dying. Bravo! Bravo! Then the Next Scene has Saint-George outside in. . . a SPACE SUIT! And at this point the movie patently STOPS making sense. Although the Director made an attempt to hypnotize me. . .I think. It didn't work. The End STILL made no sense. But I found the first 3/4 of the movie very memorable, nonetheless. Unfortunately, the ending turned what could have been a truly epic, cerebral Sci-Fi film into a classic with Literary undercurrents into an interesting Saturday night Flop. I say watch this with your Sci-Fi buff friends and have your own Vote competition. Lambert Wilson's talent was wasted here. WASTED.",
         "So, there is this space prison filled with bald criminals...heard this one before? Corporate scientist Elisa (Linh Dan Pham) arrives on a prison ship with plans of using the felons as guinea pigs for a new DNA altering serum. Also arriving on the shuttle is new prisoner St. Georges (Lambert Wilson). Quickly thrown into the tiny populace, the prisoners notice something is not right with the new inmate when he begins miraculously healing other inmates. Marc Caro - co-director of the DELICATESSEN and THE CITY OF LOST CHILDREN - makes his long awaited return to feature film-making but, unfortunately, this seems a step back. The film is visually stunning but the religious allegory heavy plot doesn't do it any favors as Caro seems to be mimicking 2001 and SOLARIS. This moves along at a pretty deliberate pace until an ending pops up that will make you scramble for the DVD menu, thinking you've inadvertently skipped a chapter. It literally comes out of nowhere and you can almost hear the money men pulling out of the project (reportedly last minute financial woes forced Caro to change his original ending). Interestingly, the US DVD has a 30-minute \"making of\" extra and co-writer Pierre Bordage mentions this was a project originally developed for Alejandro Jodorowsky. There is a great cast including DELICATESSEN lead Dominique Pinon and DELLAMORTE co-star François Hadji-Lazaro.",
         "I really wanted to like this film, since I've had good luck with French flicks lately as well as being interested in the neat little cast assembled here. Among them are Lambert Wilson (the Merovingian himself) and Dominique Pinon (Delicatessen, Amelie, etc...). Mix in a little Cube, throw in a dash of Alien 3 and sprinkle in some Powder for good measure and you have the undercooked hodgepodge of Dante 01. Good sci-fi is hard to come by these days, mainly because I think it's the most high concept genre of film as well as the hardest to execute really well. Unfortunately, despite some very interesting ideas and good production values, it doesn't add up to much of anything when it was all over. Wilson's main character has almost zero lines in the film and isn't really even a main character. If you're going to have your main character remain essentially silent, that's fine, but for the love of Odin please make him interesting. I completely understood what was going on, but it just didn't register with me as much as I was hoping it would. There is a sequence just before the last shot of the film with Wilson outside in space that was just so agonizingly excessive that I was swearing at the screen for it to stop, which I hardly ever do. Maybe you'll have a different opinion, which is fine. But for me, no dice.",
         "Any fan of the imagination rich City of Lost Children and Delicatessen should know that both were helmed by Jean Pierre Jeunet and Marc Caro. Jeunet has gone solo and done magnificently for himself with films like A Very Long Engagement. And now Mr. Caro steps into the director chair alone. For fans of said above films, getting the chance to see a new film by either is like asking me if I would like some Mountain Dew. God, yes! The picture revolves around a space station which is being used as psychiatric prison that consists of a population of 7 prisoners and a team of 5 employees. At the beginning of the film a new scientist and a mysterious new patient is brought aboard the ship. With these two the station begins unraveling from it's normal routines and begins heading into violent and unbelievable territories. The crew begins arguing with one another because of the new scientist's ideals and orders, while the prisoners are freaking out due to the new prisoners nature and abilities. With everything coming to ahead the prison is beginning to fall apart. From what I can gather from the other reviews this film is pretty much hit or miss. I'm on the side who dug it. The film more than anything is very familiar in the sense that you know it's directed by Caro. It's stylish with great camera shots and it has an atmosphere that oozes scifi prison. And with familiar actors from past Jeunet and Caro films like Mr. Pinon, there's no complaining whatsoever in the acting department. The writing itself is also very good. It's well thought out, interesting and intelligent. Caro and Jeunet are always great at delivering good dialogue and this is no different. My issue with the film lies within the story itself. The film plays mostly like a mystery. The new scientist is doing experiments on the prisoners and you obviously know it's pretty inhumane, but you don't (me, I didn't) ever grip exactly what's going on with the treatments. And with our mysterious prisoner, you do by the end understand who he is and what he's about (kinda), but up to this point it's very up in the air. And there are a few scenes when the scientists are talking among each other where the movie begins to drag a little bit. Nevertheless, the movie plays out in an intriguing fashion with more than enough things going on that kept this viewer happy and entertained. I see some pretty petty gripes some people are having with the film concerning symbolism and that it felt like it wasn't long enough. I do agree with the length issue because it seemed the movie would have benefited with a tad more explanations. But the symbolism issue is solely based on that person's issue with beliefs. That stuff bothers you, then you'll have an issue. Doesn't bother me in the slightest. Dante 01 overall is a unique, interesting film with a fantastic look and feel, but it does feel like it could have been much better. With that said I enjoyed it and this flick should definitely be seen by all fans of Caro.",
         "The whole story goes by in a space shuttle which is being used as a medical research center, far away from the earth. 1 organization chief, 1 psychiatrist and 3 guardians are in charge of 7 convicts. Those convicts are chosen haphazardly from the world. They are all average human beings; some of them are murderers some of them are psychopaths. As the story progresses a genetic engineer woman comes to the space shuttle for a confidential experiment. While she was arguing with the psychiatrist on the case of conscience of making experiments over convicts' bodies, a new convict is been delivered to the space shuttle who is very strangely sick, dumb and hold on... No identity! This is Hint-1, he is identity-free. When I complete all the hints I found out from the film, I will explain them within the conclusion. Hint-2: One of the mad convicts began believing that this sick, dumb and unknown mankind is the Messiah sent from God; and he gives him a name after a saint. Hint-3: By time, convicts fall apart into two confronting sides and turn against each other. 3 of them believe that the strange man came for help, the other 4 think that he brought only curse and hatred. Hint-4: After she gives a start to genetic experiments, the genetic engineer woman injects the immortality virus into some of the convicts' bodies via their operator genes of the cellular membranes. Right after she delivers them to their rooms, just before she is going to watch their behavioral change; our strange guy shows up and takes the immortality virus out of their bodies and injects it to himself. He does this while everyone is asleep. Thus he makes everybody thinks of him that he can heal people, and even he can vitalize a dead body. Hint-5: Soon everyone becomes believers of him. After a while the space shuttle loses its route and is dazed by the magnetic flow of a planet; then it comes to a crucial point to enter an ultra energy sphere. Our strange guy puts on an astronaut suit, jumps out to space, depletes all the energy of the sphere, then he sends the space shuttle back to Earth. During the moment he was depleting the energy of the sphere using the power of his spiritual immortality, the space shuttle turns upside down, forms \"T\" shape which references the crucifixion of Christ. When you watch the end, you might think that the strange guy might be the Messiah as the mad convict guessed from the beginning.In fact who is this strange man? He has been delivered to the space shuttle without nobodies' knowledge. Is he a spy of a world-based confidential organization(like CIA or NSA) or is he a missionary of a secret and forbidden futuristic project(like discovering the secret of immortality). Either way no computer, no population data-based software would be able to sniff out his identity. But which one is right? How do we know? Do we have to take a guess? Do we have to write a new scenario out of it, just to understand it? Directing and writing of this movie completely fails at this point, leaving viewers' minds confused. This is not a proper story-layering structure. The second hint I found out indicates that viewers have to believe that the strange man is the Messiah, since his name is credited as Saint Georges, officially. If this guy is the Messiah how come does he carry the same virus that the genetic engineer woman wants to inject to everybody? Is this a coincidence or a logical mistake? Plus, if he is the Messiah why does he need to carry a virus in his body to heal the wounds and to vitalize the dead bodies? At that point director Caro contradicts himself. The third hint I found out reminded me the life of the 3 basic prophets who brought the scriptures of the 3 main religions, somehow! Also at the forth hint remember that only prophets be able to heal people. Rather than the final of the movie, the moment we understood that the strange prophet has been sent there to prevent others from discovering the secret of the immortality must have been the actual final. Despite the fact that the best technical aspects are failed, sounds and visual effects are enviable. The music score kept our attention in the movie. Art direction and cinematography was alright. In overall, plot was so effectively original for a feature film; seemed to have some inspiration from Russian \"Parajanov's The Last Spring\" with Tarkovsky essences, and carrying along within the well-known Alien genre space- horror cinema language it was not hard to watch. Dante01 is the next and futuristic step of its genre. This is going to spread so much inspiration for cinema lovers and sci-fi movie makers in future, if it could be marketed in the right fields. Pay a very good attention, rewind as much as you need for details, and turn off the lights while watching. It's the only way to catch the joy of it.",
         "I had the pleasure of watching this movie yesterday and wasn't disappointed. I had been waiting for Caro's next work with great anticipation and I consider this movie to be a success on every level, with the only disappointment being that it didn't seem to have been released in many theaters in France, I hope it'll fare better in other countries. This movie isn't an epic by any means. The story takes place in a psychiatric facility orbiting around a burning planet deep in space, and populated by little more than a dozen people, so the scale is pretty intimist. The patients of this space hospital are all death row inmates who have agreed to serve as guinea pigs for behavior-changing treatments in order to win a few years of life. The routines of the whole compound are disrupted when a new patient with intriguing abilities (Lambert) arrives, escorted by a new doctor (the beautiful Linh Dan Pham) ordered to test new treatments on the inmates. You will soon realize upon watching the first few minutes of this movie that everything that happens in it is a metaphor, and that's all I will say about that in order not to spoil anything. I have nothing but praise for all the elements of this movie. The actors are top notch (especially the inmates), as well as the direction, the art direction and the story, which all together manage with great success the most important aspect of any movie of that kind: to suspend our disbelief. The immersion was complete and I have not for one second questioned the how's and why's of the setting. The movie didn't feel too long or too short, and the ending was satisfying and brought a sufficient amount of closure while still leaving many aspects of the story open for personal interpretation. Overall a great experience that I would recommend to anyone.",
         "I expected to watch this movie for a long time. It is not easy always to get access to French or other non English speaking movies. I knew about the bad comments but the director previous work convinced me of this one. The story is interesting and the idea of a possible messiah in a jail is very compelling. The main character never talks too much and you never know exactly what was in his past. That is a good ingredient that several westerns exploited very well. The beginning promises a psychological thriller in space like Moon from Duncan Jones or the creation of a religious cult like the one existing in Alien 3. Unfortunately we don't get any or that, only the promise and the glimpses of what it could have been. The end is confusing to say the least and the director appeared to rush to end the movie. Some of the news in the trivia section may explain why this movie appears to be an unfinished work. Cutting the budget in half changes whatever the director had originally in mind. That is a shame because the movie had potential."
      ],
      "genres": [
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Eskwad",
         "Wild Bunch",
         "Sofica Cinemage"
      ],
      "summaries": ["Deep space, at the edge of the galaxy. The future. A new prisoner arrives on top security prison ship and psychiatric research unit Dante 01. Sole survivor of an encounter with an alien force beyond imagining, Saint Georges is a man possessed by inner demons, caught up in the battle to control the monstrous power within him. It's a power that will infect the other highly dangerous occupants of Dante 01, gaolors and prisoners alike, unleashing a violent rebellion that turns this terrifying, labyrinthine world upside down. In the otherworldly hell of the ship's depths, through danger and redemption, each must journey to his very limits... each must confront his own Dragon."],
      "budget": 8000000
   },
   "movielensId": 60338,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2008-01-02",
      "dvdReleaseDate": "2009-04-21",
      "directors": ["Marc Caro"],
      "runtime": 82,
      "movieId": 60338,
      "title": "Dante 01",
      "mpaa": "R",
      "actors": [
         "Lambert Wilson",
         "Linh Đan Phạm",
         "Simona Maicanescu",
         "Dominique Pinon",
         "Bruno Lochet",
         "François Levantal",
         "François Hadji-Lazaro",
         "Lotfi Yahya Jedidi",
         "Yann Collette",
         "Dominique Bettenfeld",
         "Antonin Maurel",
         "Gérald Laroche"
      ],
      "imdbMovieId": "0487928",
      "originalTitle": "Dante 01",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": ["0OL8lGoJ8rw"],
      "plotSummary": "Deep space, at the edge of the galaxy. The future. A new prisoner arrives on top security prison ship and psychiatric research unit Dante 01. Sole survivor of an encounter with an alien force beyond imagining, Saint Georges is a man possessed by inner demons, caught up in the battle to control the monstrous power within him. It's a power that will infect the other highly dangerous occupants of Dante 01, gaolors and prisoners alike, unleashing a violent rebellion that turns this terrifying, labyrinthine world upside down. In the otherworldly hell of the ship's depths, through danger and redemption, each must journey to his very limits... each must confront his own Dragon.",
      "tmdbMovieId": 15125,
      "avgRating": 2.75781,
      "releaseYear": "2008",
      "numRatings": 64,
      "posterPath": "/jdPWkbV4pPzB9esCZ10tyfwjLpW.jpg"
   }
}