{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "island",
            "id": 2041
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "youth",
            "id": 14751
         },
         {
            "name": "foster home",
            "id": 158394
         }
      ],
      "imdb_id": "tt0997188",
      "video": false,
      "title": "The Home of Dark Butterflies",
      "recommendations": [
         22326,
         108768,
         64509,
         158947,
         341544,
         114172,
         215739,
         60678,
         47554,
         89280,
         32990,
         14344,
         343725,
         43738,
         15730,
         20163,
         16439,
         65831,
         51722,
         136478
      ],
      "backdrop_path": "/ugHdRn8kYJRFM4VeTO6AMGX9SC3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43edc3a368484e0065b1",
               "name": "Niilo Syväoja",
               "profile_path": "/xe0T0bNPFuYZYfoBqOeuTEvyAUF.jpg",
               "id": 141998,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "52fe43edc3a368484e0065a5",
               "name": "Kati Outinen",
               "profile_path": "/cjcuhAXRcg8C0VIDHtfz1BIVE3m.jpg",
               "id": 5999,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe43edc3a368484e0065a9",
               "name": "Pertti Sveholm",
               "profile_path": "/ahvsL5gLTYaEEH9m4otYEZWmE1K.jpg",
               "id": 89504,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe43edc3a368484e0065ad",
               "name": "Eero Milonoff",
               "profile_path": "/hKFYirM4vdctOzofTyNHAFysFPq.jpg",
               "id": 85751,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43edc3a368484e00659b",
               "name": "Dome Karukoski",
               "profile_path": "/4lkhkvoVu5pUQE04kQS27Ynncoe.jpg",
               "id": 88857,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55805748925141274b000178",
               "name": "Marko Leino",
               "profile_path": null,
               "id": 148015,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55805750925141271000018c",
               "name": "Leena Lander",
               "profile_path": null,
               "id": 141997,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.607621,
      "production_countries": [{
         "iso_3166_1": "FI",
         "name": "Finland"
      }],
      "id": 20548,
      "vote_count": 10,
      "budget": 0,
      "overview": "Haunted by his traumatic past and cautious about the prospects of an uncertain future, a fourteen year old boy named Juhani winds up in an isolated boys' home known as The Island. Juhani (Niilo Syvaoja) has been shuttled between foster homes and temporary families for the past six years, leaving any prospect of stability in his life a faded dream. When Juhani winds up in a remote shelter for troubled youth known as The Island, he has little idea of how ruthless superintendent Olavi Harjula (Tommi Korpela) can truly be.",
      "similar": [
         449176,
         272693,
         81250,
         43923,
         10625,
         9880,
         308369,
         286565,
         50479,
         4951,
         9655,
         85350,
         2108,
         222935,
         10229,
         26123,
         397837,
         227156,
         38117,
         19458
      ],
      "original_title": "Tummien perhosten koti",
      "runtime": 108,
      "poster_path": "/oQgIEDeMFkMqvq7m6UMaKyxHc5X.jpg",
      "spoken_languages": [{
         "name": "suomi",
         "iso_639_1": "fi"
      }],
      "production_companies": [{
         "logo_path": "/ufP8NkiJ9ScGLIKz7J25xKtmVvX.png",
         "name": "Solar Films",
         "id": 6339,
         "origin_country": "FI"
      }],
      "release_date": "2008-01-10",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A past to forget - a future to find",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Finland",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Dome Karukoski"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Dome Karukoski",
         "Leena Lander"
      ],
      "originalLanguage": "Finnish",
      "imdbLink": "http://www.imdb.com/title/tt0997188/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyNjY2MTc3NF5BMl5BanBnXkFtZTgwNjQ2MzI2MDE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Niilo Syväoja, Tommi Korpela, Kristiina Halttu | See full cast and crew »"],
      "reviews": [
         "Juhani Johansson (Niilo Syväoja) is a teenage boy with a very traumatic past who gets sent to an isolated home for troubled boys situated on an island, presumably sometime in the 1960s. The home is managed by a strict but fair man named Olavi Harjula (Tommi Korpela), and besides him and seven boys the only people on the island are Harjula's wife Irene (Kristiina Halttu), their two daughters and the female caretaker Tyyne (Kati Outinen). After initial adaptation troubles and an escape attempt, Juhani starts bonding with the other boys and befriends Harjula's older daughter Vanamo (Marjut Maristo). Still, dark shadows of the past won't leave Juhani alone and the other boys have their own problems as well. Besides Juhani's development, the story is also about Harjula's plans to solve the school's financial problems by breeding domesticated silkmoths with the help of the boys (hence the title of the film). Harjula's blind commitment to his job with the boys is taking its toll on his frustrated wife who subsequently cannot handle the physical and emotional isolation and has to seek closeness elsewhere. Some of the dramatic twists of the story, a certain death scene in particular, don't necessarily seem highly realistic at first, but since the focus is more on the emotional side of things, they have their place in the film. Juhani's budding relationship with Vanamo is closer to ordinary youth movie material, but helps to present Juhani's changing moods to the audience without artificial voice-overs or other tricks. Visually the film is strong: Juhani's development is portrayed at an unhurried pace using many flashbacks to cast light on his home life with his unstable parents. The dark blue hue of the flashbacks provides a strong contrast with the green summer on the island and the brownish interiors of the house. The scenery in general is also very beautiful. The most effective part of the film is the acting; Tommi Korpela radiates charisma as the superficially strong Harjula and Pertti Sveholm as Juhani's father Erik nails the sycophantic but explosive part perfectly. In his first starring role, Niilo Syväoja brings Juhani's confusion to life on his slender face with few words, and while Eero Milonoff may look a little old for his part as Salmi, the most menacing of the boys, he handles the role with competence too. In the end, the main theme is forgiveness and accepting the fact that making errors is an essential part of human life. The most interesting aspects of the story, namely Harjula's complex, contradicting nature and the sad fates of a few characters, are quite haunting, but perhaps the lack of action from Harjula after a revelation regarding his wife could have been explained better, even at the risk of losing some of the enigma surrounding him. In any case, The Home of Dark Butterflies is a well made film and a good addition to Dome Karukoski's directorial career.",
         "The Home of Dark Butterflies (Tummien Perhosten Koti) is an emotional drama which tells the story of youngster named Juhani Johansson. He is moved into an island which contains the home for troubled boys. The film showcases emotional fights with their own pasts. The acting in the film deserves to be praised. All of the actors capture the mood of the book really well and picture the characters like they were imagined. The island was also pictured really well with it's stormy waves and the old house. Film's use of visuals work really well and give strong effect with the film's topic. Sad thing about the film is the fact that it doesn't feature some keyparts from the book. The story works pretty well but doesn't raise up to it's full potential. Also, some of the characters don't get their chance to shine and stay pretty unknown or worthless. The story is twisted from the book where Juhani is an enemy with the boys for a long time before rescuing one of them. In the film he makes friends with them pretty quickly which lowers the film's potential, it would have worked much better with the original plot from the book. The worst scene of the movie is the part where one of the boys causes a death really unrealistically. Apart from the negative things, the movie works really well and I recommend watching it.",
         "Loved it!! I usually don't like Finnish films, they are usually too long and boring... But this film had me crying. The story and the characters... Everything, the acting was great. I was in tears. At some point u felt like maybe the movie was moving a bit too slow, but then everything just clicked and came together while u kept watching. I love this film, it's one of my favorites now, and i will buy it on DVD so I can watch it when I feel like it. This movie will really touch u in some level, if I would recommend some Finnish film to you this would be it. Becaause for example Suden Vuosi, for me it was too boring, and I it didn't move me at all. Musta Jää was pretty good, but this... this is a great film go and see for yourself! I have to say great job! From everyone the actors, director etc...",
         "Dome Karukoski made himself known in the Finnish cinema with the movie 'Tyttö sinä olet tähti'. This movie is very similar in at least in two aspects: In both movies we can see \"teenage\" love tension. The girl in this movie, actor Marjut Maristo is actually about 23 years old and the boy is about 18 years old. The other similar thing about these movies is the lack of content and originality. So how are these movies different? This movie has something which 'Tyttö sinä olet tähti' was lacking and that is pseudo artistic sequences. For example the beginning sequence in the rain with the gramophone was very tasteless and mockery to true art. I think the director must divide all music in two categories, there's pop music and there's Mozart. Even though I hadn't my hopes very high before, after this sequence I was completely prepared for a bad movie. There's of course nothing bad about Mozart, but I despise the way the music was used here in this shot. After this the movie goes completely wild. We jump forward in time. The boy is having troubles with society and with himself and he is sent to an island with troubled kids. These kids are supposed to be very disturbed because of their past. However there's no guards and no rules whatsoever. We have a family here in the same cabin with these disturbed boys and they are having fun there as if they were on a vacation. Soon after arriving the main character Juhani gets a golden shower from these boys and he's isolated as punishment in a dark hole like in some Van Damme movie, but he won't squeal on the other boys. After he gets out he's now suddenly friends with these rednecks and don't even consider a revenge. There's a lot's of stupid stuff going around in the movie, most of which are these pseudo artistic sequences where Juhani's past is revealed in small parts. One thing bothering me a lot is that there's no attempt to give a character for Juhani's mother, she's just silent. This is why her motivation (at the end scene of these flashbacks) remains completely curtained and I didn't buy it for a second. It's just one of the sequences where the characters in this movie do unimaginable things just to progress the plot and make it seem more complete. The actions of the character is based on nothing and are added just for \"shock\" value as many other sequences in the movie. More of these types of sequences can be found in many places. One of the most funniest parts was a sequence where the brute (the largest of the boys) hurts himself and has to take his shirt off. The wife (in the family) is taking care of him and notices his scars. She gets turned on when she hears about the sexual and physical abuse of which the brutes father is responsible for. After this they end up having sex and this unbelievable \"side plot\" of passion has an incredibly unbelievable ending as well which culminates in a weird way with the emotions of the main character to make the side plot seem somehow relevant to the main plot. I'm not going to talk in detail how this movie was made. I didn't notice anything original in the directing or in the storyline. The story is actually just typical Finnish erotic drama with no content and the actors can't shine in this movie no matter how hard they would try. This goes into same series with 'Levottomat' and other such movies. I would feel sorry for the actors if I didn't know that they got money by acting in this movie. For a decent new Finnish movie it's better to see 'Paha Maa' by Aku Louhimies. It wasn't an attempt to make superb realism, but it's certainly more entertaining and atmospheric compared to this one."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Mainostelevisio (MTV3)",
         "Solar Films"
      ],
      "summaries": ["Juhani, 14 years old and tormented by a childhood trauma, has changed several foster parents from the age of eight. He is taken to an island, where there is a boys' home, run by a strict superintendent, Olavi Harjula. Besides the seven boys that dwell there, there is the superintendent, his wife, his two daughters and a woman for menial help. Juhani is gradually accepted by his peers and strikes a friendship with the eldest daughter. When Harjula is advised that funding will stop for his school due to his harsh methods, he decides to start a silkworm project for self-funding. All the boys agree to stay and help him, apart from Juhani, who expects to go back to his family that wants him back."],
      "budget": 1600000
   },
   "movielensId": 60461,
   "movielens": {
      "languages": ["suomi"],
      "releaseDate": "2008-01-10",
      "dvdReleaseDate": null,
      "directors": ["Dome Karukoski"],
      "runtime": 108,
      "movieId": 60461,
      "title": "The Home of Dark Butterflies",
      "mpaa": "",
      "actors": [
         "Niilo Syväoja",
         "Kati Outinen",
         "Pertti Sveholm",
         "Eero Milonoff"
      ],
      "imdbMovieId": "0997188",
      "originalTitle": "Tummien perhosten koti",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Haunted by his traumatic past and cautious about the prospects of an uncertain future, a fourteen year old boy named Juhani winds up in an isolated boys' home known as The Island. Juhani (Niilo Syvaoja) has been shuttled between foster homes and temporary families for the past six years, leaving any prospect of stability in his life a faded dream. When Juhani winds up in a remote shelter for troubled youth known as The Island, he has little idea of how ruthless superintendent Olavi Harjula (Tommi Korpela) can truly be.",
      "tmdbMovieId": 20548,
      "avgRating": 3.36957,
      "releaseYear": "2008",
      "numRatings": 46,
      "posterPath": "/oQgIEDeMFkMqvq7m6UMaKyxHc5X.jpg"
   }
}