{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "animal horror",
         "id": 223059
      }],
      "imdb_id": "tt0479528",
      "video": false,
      "title": "Rogue",
      "recommendations": [
         14138,
         101669,
         9885,
         11152,
         6948,
         13849,
         11880,
         11908,
         12590,
         9022,
         5072,
         13059,
         9035,
         81390,
         26587,
         9825,
         10070,
         16126,
         11427,
         8991
      ],
      "backdrop_path": "/2HpxNuR5iNSxSbEBRxd0YXJv3f6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kate Ryan",
               "gender": 1,
               "credit_id": "52fe45309251416c7504e9f7",
               "name": "Radha Mitchell",
               "profile_path": "/kKbnljNC07nqiucGeouxhKESXUC.jpg",
               "id": 8329,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pete McKell",
               "gender": 2,
               "credit_id": "52fe45309251416c7504e9fb",
               "name": "Michael Vartan",
               "profile_path": "/5HCb1CxwIgiZAjKMe9BG8VtHE80.jpg",
               "id": 15424,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Neil",
               "gender": 2,
               "credit_id": "52fe45309251416c7504e9ff",
               "name": "Sam Worthington",
               "profile_path": "/9XzAE3ZnCnazub4xrSY8YBN7sNq.jpg",
               "id": 65731,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Sherry",
               "gender": 1,
               "credit_id": "52fe45309251416c7504ea0f",
               "name": "Mia Wasikowska",
               "profile_path": "/9vjaqsaoW9jzRaWMnbZ06g9KTgP.jpg",
               "id": 76070,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mary Ellen",
               "gender": 1,
               "credit_id": "52fe45309251416c7504ea13",
               "name": "Caroline Brazier",
               "profile_path": "/tNewtv0jeJUg8rkCOhcbP0wnwcj.jpg",
               "id": 216802,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Simon",
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea17",
               "name": "Stephen Curry",
               "profile_path": "/oLSXOQ0obi46ReuDr3mveHBivfb.jpg",
               "id": 49360,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gwen",
               "gender": 1,
               "credit_id": "52fe45309251416c7504ea1b",
               "name": "Celia Ireland",
               "profile_path": null,
               "id": 84556,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Russell",
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea1f",
               "name": "John Jarratt",
               "profile_path": "/yRUY3lMYP5NTkxc54Wrj8NgXxAu.jpg",
               "id": 45210,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Allen",
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea23",
               "name": "Geoff Morrell",
               "profile_path": "/pDKvveuKSMT3mxikAj3CPC5FogS.jpg",
               "id": 93119,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Collin",
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea27",
               "name": "Damien Richardson",
               "profile_path": "/z7iJefe1tP2HVJOGL8GKdsatfyV.jpg",
               "id": 80264,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Everett",
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea2b",
               "name": "Robert Taylor",
               "profile_path": "/aqRJQj0KBPhGLDxfmOAXCUzCcSJ.jpg",
               "id": 39545,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "52fe45309251416c7504ea2f",
               "name": "Heather Mitchell",
               "profile_path": null,
               "id": 61350,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea05",
               "name": "Greg McLean",
               "profile_path": "/2DPAARHLV29cCdQeUjkQ06lZh9b.jpg",
               "id": 59998,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea0b",
               "name": "Greg McLean",
               "profile_path": "/2DPAARHLV29cCdQeUjkQ06lZh9b.jpg",
               "id": 59998,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe45309251416c7504ea35",
               "name": "Greg McLean",
               "profile_path": "/2DPAARHLV29cCdQeUjkQ06lZh9b.jpg",
               "id": 59998,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.414278,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 13022,
      "vote_count": 191,
      "budget": 0,
      "overview": "From the director of Wolf Creek comes this terrifying look at nature's perfect killing machine. When a group of tourists stumble into the remote Australian river territory of an enormous crocodile, the deadly creature traps them on a tiny mud island with the tide quickly rising and darkness descending. As the hungry predator closes in, they must fight for survival against all odds.",
      "similar": [
         9426,
         135397,
         124905,
         578,
         332567,
         929,
         244,
         9433,
         4961,
         11237,
         9825,
         8869,
         9360,
         814,
         1678,
         44037,
         9406,
         6488,
         3603,
         11071
      ],
      "original_title": "Rogue",
      "runtime": 99,
      "poster_path": "/pZC9HA9ngsG68vsGzwZwpSYFnDh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         },
         {
            "logo_path": "/tpFpsqbleCzEE2p5EgvUq6ozfCA.png",
            "name": "Village Roadshow Pictures",
            "id": 79,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Emu Creek Pictures",
            "id": 19010,
            "origin_country": ""
         }
      ],
      "release_date": "2007-11-08",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "How Fast Can You Swim?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": ["Greg Mclean"],
      "runtime": 89,
      "synopsis": "While carrying out his research as a travel journalist, cynical American Pete McKell joins a group of tourists on a crocodile watching river cruise in Kakadu National Park of Australia's Northern Territory. Among the other passengers are a photographer named Simon, a local Australian family of Elizabeth, Sherry, and Allen, a local couple named Gwen and Russell, an American couple named Mary Ellen and Everett, local tour guide Kate Ryan, and Kevin, her dog. After a run-in with two locals, Neil and Collin, the cruise winds to a close and Kate prepares to return the group to base. Everett spots a flare in the distance, and Kate tells the group that they must investigate to determine whether someone is in distress. A few miles up river, they come across a half-sunken boat when suddenly something crashes into the tourists' boat, creating a crack in the side. Kate's only choice is to run it ashore on a small island in the middle of the river. The group disembarks and begins discussion of what to do. Everett suddenly disappears, pulled into the water by an unseen predator. Kate comes to the conclusion that they are in the heart of a large crocodile's territory and that it will be more aggressive than usual. As the afternoon wears on, the tourists realize that the tide is rising: in a matter of hours their small island will be submerged. Neil and Collin arrive soon after and as they near the island, the 25-foot long crocodile smashes Neil and Collin's boat and sinks it. Neil manages to swim to the island safely, but Collin has disappeared. As night falls, Neil proposes that he swim to the mainland and string a rope between two trees, creating a zip-line to allow the group to cross above the river. Neil succeeds in setting up the rope and Mary Ellen crosses first only to freeze in fear halfway across. Allen becomes impatient and aggressive and attempts to get himself and Sherry across with Mary Ellen still on the line. While trying to secure the rope, Neil is attacked by the crocodile and gets eaten alive. The tree holding the rope snaps and the three on the line fall into the water. They scurry back to the island, but as Allen crawls up the beach, the gigantic crocodile suddenly lunges out of the water and throws him further into the river where he is also eaten alive. Later that night, Pete suggests they can delay the croc with a hook and bait on one side of the island while everyone escapes off the other side. Kate hooks two dead birds onto the boat's anchor while Pete secures the anchor rope to a boulder and throws the bait out into the river. After a long wait, the anchor is suddenly grabbed and pulled and the entire group jumps into the water and makes a break for the far shore. Pete tries to stop the boulder from being pulled over as Kate swims across behind the group. The croc suddenly lets go of the hook and bait, seizes Kate, and drags her underwater. Pete hurriedly makes the swim across the river with the dog Kevin in tow, and heads off into the bush to meet up with the others. As day breaks, Pete is crossing a stream when Kevin runs away. Pete chases the dog into a cave and falls down a narrow chute into a larger cave, where he sees Neil's partly eaten corpse. He quickly realizes that the cave is the crocodile's lair, and to his surprise, he finds Kate who is still alive but badly injured and unconscious with her part of her left leg and right arm missing having been eaten. He attempts to carry her out but has to hide when he hears the crocodile eating Kevin outside the cave. The huge crocodile then slowly enters the cave, laying down, and going to sleep. Trying to reach the entrance carrying Kate, Pete accidentally wakes the crocodile and it makes several attempts to devour both him and Kate as he retreats into the narrow confines of the cave. Finally, after a long fight in which he gets tossed around and is bitten in the hand, Pete makes one last stand. He braces a broken log against a large boulder with the sharp end pointing out towards the croc. The croc lunges at him, and Pete successfully impales it through the head killing it. He escapes from the cave with Kate to join the other tourists and waiting paramedics. As the credits roll, the camera zooms in on a newspaper article detailing Pete's heroic battle with the croc and rescue of Kate.",
      "writers": ["Greg Mclean"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0479528/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxNzAxNDU3Ml5BMl5BanBnXkFtZTcwMDU0ODg2MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Vartan, Radha Mitchell, Sam Worthington | See full cast and crew »"],
      "reviews": [
         "I thought this would be a real cheesy B movie but was in for a great surprise. Starting with the cinematography and the initial town scenes I figured this may be half decent. Things picked up even more with the scenes on the boat introducing the characters. Small touches like the guy letting his loved ones ashes into the water and the photographer having a sly chow down on a hidden sandwich were really cool touches. Bigger budget films should take note! It got better from there, not showing too much of the croc and building suspense with good pacing and realistic reactions from the cast. The cinematography and editing on the river journey were great. After seeing this I almost want to go to the Northern Territories. Almost, but not after the Croc finally shows its face. This is one primal beast. The film does a good job of keeping it under wraps for the early portion of the film but when it finally shows its face its a great moment. The visual fx are faultless and the croc acts in a very realistic manner. In the second act the filmmakers do a great job at ratcheting up suspense, using a great set up involving the river. I wont spoil it here but its so simple but very effective. I am a jaded monster film fan and this one had me wanting to see it for a second time straight away. Crocs and Alligators seem to be the whipping boys of the film industry with so many comedy or low budget appearances. To finally to see one with real teeth and to give it a go with a good story and great fx is fantastic. I would recommend this to anyone after a monster night out.",
         "I saw Rogue this morning at a preview screening in Melbourne, I've been looking forward to this film for some time. I don't want to say that it was a disappointment as it is a solid effort. There is nothing that stands out as something I think should have been done differently. Some wandering British and American accents from the mostly Australian cast can be forgiven. The obvious difference between the locations in the Northern Territory and those in Victoria caused a brief chuckle (mainly because director Greg McLean introduced the film and commented that he hoped the transition would be seamless), though this may go unnoticed by foreign (non-Australian) audiences. Visual effects were highly competent, I doubt that the average cinema-goer will pick the matte paintings or have an issues with the CG croc. The main issue I have is that the film lacks the suspense and excitement of a truly great monster/horror film. Due to the nature of the material this will have to be compared to Jaws and Rogue will inevitably suffer. A fairer comparison has to be Lake Placid, and in that scenario Rogue also comes off second best. Rogue lacks the suspense and the humour of the American monster Croc effort. This follow up to Wolf Creek was written long before the surprise Aussie hit, Rogue has the hallmarks of a first feature script, hitting all of the genre conventions without ever attaining any moments of originality. If you enjoy this kind of monster movie (and I do) you'll find it a decent way to spend a couple of hours, you won't be missing much if you see it on DVD. Apart from Radha Mitchell looking great in khaki shorts, and believably playing a 28 yr old, though she has to be at least 35. Nice job over all, good job, not great but good.",
         "Greg McLean is looking to be someone to watch out for. After scaring audiences witless with his Aussie outback shocker \"Wolf Creek\" and hurting the Australian Tourism Board immensely his back at it again. However, this time he replaces a serial killer with a 7 metre saltwater crocodile who's hungry for humans and luckily a boat full of them arrives at his doorstep. McLean doesn't waste time with a huge story, it is very basic and to the point. Pete McKell is an American travel writer who travels the world and writes about the places he visits. He is sent to the Northern Territory to go on a river cruise which is lead by Kate Ryan (Radha Mitchell). On board there are plenty of other tourists waiting to become bait. The movie starts off with some beautiful scenes of Australian outback, they are absolutely stunning. When the action starts, though, it never lets up. For the rest of the movie I was on the edge of my seat, McLean really knows how to racket up the tension. It helps that the river is murky and we don't see too much of our monster until the end. And when we do see our crocodile friend it is amazing. Part CG and part animatronics, the crocodile looks very good and very menacing. The acting is good all round, although the characters aren't hugely deep, the actors do a good job of making us love them or hate them. Particularly good is John Jarret (of Wolf Creek fame) and Radha Mitchell (Silent Hill). For those that like blood and gore you won't be too disappointed, there is some and it's nice and bloody when it comes. 3½/5",
         "To begin with, wolf creek was a solid horror film, certainly not mainstream, quite a challenge to watch, rather sordid and macabre, pretty much unwatchable, though i admired it's stylish look, and its daring. Rogue has the same sort of appeal, though it is far more accessible, the suspense is brilliant, keeping the crock hidden for most of the show, this makes the film hugely successful, but little glimpses, a tail, a missing tourist, who was there only a second ago, really makes the film one that makes you laugh that giddy fear laugh we all know. This film had my nerves in a stitch and it was all brought together by a heart pounding finale. Another thing that really proved affective was the films realism, the crock looked very real, was of plausible size, but most definitely wasn't small. if you love the old school suspense tricks of Alien (i stress this film is not in the same league) then this is definitely a good night at the movies. Recommendation: nothing can really prepare you",
         "Before i saw this movie i said to myself probably it will be like any other crocks movie which most of them were pretty obvious and not really suspenseful and the acting were mostly bad . In most of them the crock didn't look real and the size was not realistic enough. In this movie it looked really fine and they did a good job to show the crock only when it was the right time and by that they made it more realistic and interesting.This movie caught me by surprise, it was a quite suspenseful movie with good build up and acting and the end was quite good. I recommend to watch it, i'm sure you will enjoy. I'm giving this movie 8 out of 10.",
         "Nothing wrong with yet another killer crocodile movie. especially one that keeps the beast hidden until the second half. A group of tourists on an Australian river is stranded on a tiny spit of sand after a croc attacks their boat. Trying to get from the spit of sand to the riverbank becomes the group's major challenge as the monster croc picks them off one by one, and their spit of sane begins to go underwater. Radha Mitchell is the tour boat captain and French-born actor Michael Vartan (who bears an uncanny resemblance to Luke Perry here) plays an American journalist. When we finally see the croc, it is huge and fearsome indeed. Vartan ends up in its lair and must face it down. Great CGI and physical special effects. Most of the movie was shot on sets and a back lot, but you'd never know it. A must-see for killer croc fans.",
         "Usually my first instinct upon hearing that a movie was made in Australia, by Australians, is to completely dismiss it. I am glad I did not do so with Rogue. The building of suspense was surprisingly good. The action was amazing and the silver lining for all of this was the amazing dialogue (apart from the littered swear words). It was also well acted, and the accents weren't even annoying. A total bonus was the awesome special effects. I will truly never go to the Northern Trerritory, thanks Mr. McClean! For anyone tired of the dull, lifeless Aussie movies that unfortunately we are all used to, go and take a chance by seeing Rogue...even if only to support it. I can only hope they don't go down the well-worn road of making lack-lustre sequels...there is no need to spoil a great movie. Great work to all that were involved with making this movie. 10 out of 10 all round.",
         "Granted, it's not perfect, and the idea is not 100% original (from a cinematic point of view) but one thing I love about Greg McLean's films is that he takes what are essentially Australian icons and flips them totally askew. For instance in Wolf Creek the films brutal killer - Mick Taylor is basically Mick Dundee turned psycho. And in Rogue, he yet again takes a well known Australian reptile and sets it loose on some unsuspecting tourists. There's no denying McLean can shoot a beautiful movie, and some of the wonderful scenes of the Australian top-end are simply stunning. The characters all portray strong performances, especially when the pressure sets in and they begin to crack. McLean also does a good job at drip feeding the dread and teasing the audience with nothing but growls, grunts and slippery tails. It's an age old formula where directors don't show the full extent of the threat till the end - well, thankfully we don't have to wait that long, as when the croc does reveal itself - we see that it is frickin'MASSIVE! And what's even more scary is that these thing's actually exist up there. The croc itself is naturally CGI with some animatronics, and it's a relief to see that it looks \"real\". The movement and animation is authentic and the sound design is also effective in giving the audience that jolted feeling a 3 tonne croc would give. It's a tense, taught and well directed film, and the only gripe I have about it is that it seems a little short - maybe that was put down the fact that I was so immersed into the film? But it did feel a little short. It also lacked the brutal punch Wolf Creek gave us back in 2005, but never the less, it's a cute little Aussie horror thriller where McLean pays sound homage to classics like Jaws and Aliens. And it's also good to see more \"genre\" films like this coming out of Australia, and it's also good to know people like the Weinsteins and Warner Brothers are backing horror films from Australia for international releases and distribution. For anyone into their Reptillian chills and thrills - I highly recommend ROGUE.",
         "This movie was very good. The pacing is fantastic and all the characters are likable. The death scenes are very graphic and gory! For those who just love to see Horror movies for just the gore, there's more to it than that. You don't know what will happen next. It's like a thriller mixed with Horror. It's a lot like Jaws and Lake Placid. The effects done on the crocodile are brilliant. It was absolutely fake, but it looked very real. Effects aren't usually that good in Australian movies, but the effects in this one are brilliant! I just wish the Crocodile killed more people, but apart from that, it's great! If you loved Wolf Creek or Jaws you'll love this! I give this movie an 8/10!",
         "In the Northern Australia, a group of tourists goes on tour in the Ryan's Wildlife River Cruise to see crocodiles in the Australian Outback in the boat The Suzanne with the guide Kate Ryan (Radha Mitchell). When they are ready to return, one tourist sees a distress flare 3 km upstream the river and Kate heads the boat to an unexplored territory. They are attacked by a huge crocodile, the boat sinks and the hysterical group is trapped in a small muddy island stalked by the crocodile. However, the high tide forces the group to move, and the American journalist Pete McKell (Michael Vartan) has an idea to hold the killer croc while the group swims to the other side of the river. \"Rogue\" is a light version of the tense, realistic and dramatic \"Black Water\", which is based on a true event. The beginning is well developed and tense, but in a certain moment the story becomes unrealistic and corny with a silly conclusion. Anyway, \"Rogue\" is an entertaining adventure, and the viewers that have not watched \"Black Water\" or appreciate a commercial happy ending, will certainly like this flick much more than I did. My vote is six. Title (Brazil): \"Morte Súbita\" (\"Sudden Death\")"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Dimension Films",
         "Village Roadshow Pictures",
         "Emu Creek Pictures"
      ],
      "summaries": [
         "An idyllic wildlife cruise disintegrates into terror when a party of tourists are stalked by a massive man-eating crocodile. Pete McKell, a cynical American travel writer, joins a disparate group of holiday-makers on a river cruise through the waters of Kakadu National Park. Initially Pete clashes with their tour captain, Kate, a feisty young woman who assumes he is just another 'city-slicker' in search of a quick thrill. After an uneventful day cruising the river, Kate is reluctantly persuaded to steer their boat into unexplored territory. They discover a secluded lake but terror strikes when their craft receives a powerful blow from beneath the murky depths and begins to sink. With little choice, she beaches the vessel on the closest dry land -a tiny mud island. With a rising tide and only half an hour of daylight left, fear grips the group as they realize they are trapped in the lair of a 'rogue' crocodile, governed only by its need to hunt and kill. Begrudgingly, Pete and Kate join forces to keep hysteria at bay and in the process start to see beyond their initial impressions. Their first attempt to escape fails, but then Pete has an idea - they must trap the crocodile to enable the group to flee to the other side of the island whilst Kate swims for help. Pete volunteers to stand guard, but without warning, the beast breaks free and targets Kate who fails to resurface. As darkness descends and the muddy waters rise, a terrifying struggle ensues with only one probable outcome death.",
         "An American journalist on assignment in the Australian outback encounters a man-eating crocodile while trapped on a rapidly flooding mud island."
      ],
      "budget": 26900000
   },
   "movielensId": 60471,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-11-08",
      "dvdReleaseDate": "2008-08-05",
      "directors": ["Greg McLean"],
      "runtime": 99,
      "movieId": 60471,
      "title": "Rogue",
      "mpaa": "R",
      "actors": [
         "Radha Mitchell",
         "Michael Vartan",
         "Sam Worthington",
         "Mia Wasikowska",
         "Caroline Brazier",
         "Stephen Curry",
         "Celia Ireland",
         "John Jarratt",
         "Geoff Morrell",
         "Damien Richardson",
         "Robert Taylor",
         "Heather Mitchell"
      ],
      "imdbMovieId": "0479528",
      "originalTitle": "Rogue",
      "genres": [
         "Action",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["BFx00dpfApQ"],
      "plotSummary": "From the director of Wolf Creek comes this terrifying look at nature's perfect killing machine. When a group of tourists stumble into the remote Australian river territory of an enormous crocodile, the deadly creature traps them on a tiny mud island with the tide quickly rising and darkness descending. As the hungry predator closes in, they must fight for survival against all odds.",
      "tmdbMovieId": 13022,
      "avgRating": 3.0988,
      "releaseYear": "2007",
      "numRatings": 167,
      "posterPath": "/pZC9HA9ngsG68vsGzwZwpSYFnDh.jpg"
   }
}