{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "mike hammer",
         "id": 155727
      }],
      "imdb_id": "tt0084112",
      "video": false,
      "title": "I, the Jury",
      "recommendations": [40790],
      "backdrop_path": "/kOJdLGRsvRqgN74m0P4a9K0hD1O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mike Hammer",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6a3",
               "name": "Armand Assante",
               "profile_path": "/m9DCpe9HkIXEAp3aq1wKpmN8mih.jpg",
               "id": 23346,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Dr. Charlotte Bennett",
               "gender": 1,
               "credit_id": "52fe46329251416c9104c6a7",
               "name": "Barbara Carrera",
               "profile_path": "/zmuNNytZ5w3ewWC6ShWeqFZl49c.jpg",
               "id": 10938,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Velda",
               "gender": 1,
               "credit_id": "52fe46329251416c9104c6ab",
               "name": "Laurene Landon",
               "profile_path": "/fbfnkFJm8CMIg1ae8zFMx4MA5y7.jpg",
               "id": 76465,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Charles Kalecki",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6af",
               "name": "Alan King",
               "profile_path": "/gYtn6UNocRfxISIAKmUfRxl7zOr.jpg",
               "id": 7169,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Joe Butler",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6b3",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Detective Pat Chambers",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6b7",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Charles Kendricks (as Judson Scott)",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6bb",
               "name": "Judson Scott",
               "profile_path": null,
               "id": 104054,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Romero",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6bf",
               "name": "Barry Snider",
               "profile_path": null,
               "id": 169115,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Norma Childs",
               "gender": 1,
               "credit_id": "52fe46329251416c9104c6c3",
               "name": "Julia Barr",
               "profile_path": "/zfqBiagVEfqjaKe4aNHQnQs7Nqa.jpg",
               "id": 196718,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Hilda Kendricks",
               "gender": 1,
               "credit_id": "52fe46329251416c9104c6c7",
               "name": "Jessica James",
               "profile_path": null,
               "id": 75195,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Jack Williams",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6cb",
               "name": "Frederic Downs",
               "profile_path": null,
               "id": 142180,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Myrna Williams",
               "gender": 0,
               "credit_id": "52fe46329251416c9104c6cf",
               "name": "Mary Margaret Amato",
               "profile_path": null,
               "id": 544815,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Goodwin",
               "gender": 2,
               "credit_id": "52fe46329251416c9104c6d3",
               "name": "F.J. O'Neil",
               "profile_path": "/fk9V2rhZzB7M78cAA1WBdHoQpte.jpg",
               "id": 152911,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Lundee (as William Schilling)",
               "gender": 0,
               "credit_id": "52fe46329251416c9104c6d7",
               "name": "William G. Schilling",
               "profile_path": null,
               "id": 544816,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Breslin",
               "gender": 0,
               "credit_id": "52fe46329251416c9104c6db",
               "name": "Robert Sevra",
               "profile_path": null,
               "id": 171041,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Victor Kyle",
               "gender": 2,
               "credit_id": "549c9035c3a3682f1b0042a1",
               "name": "Mike Miller",
               "profile_path": null,
               "id": 1404084,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "1st Twin",
               "gender": 0,
               "credit_id": "57ef950792514141db005d92",
               "name": "Leigh Harris",
               "profile_path": null,
               "id": 127316,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "2nd Twin",
               "gender": 0,
               "credit_id": "57ef9510c3a3683fac002108",
               "name": "Lynette Harris",
               "profile_path": null,
               "id": 127317,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Sheila Kyle",
               "gender": 0,
               "credit_id": "57ef951ec3a3683c3e002121",
               "name": "Bobbie Burns",
               "profile_path": null,
               "id": 1137825,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Soap Opera Actress",
               "gender": 1,
               "credit_id": "57ef9534c3a3683c0c001fd3",
               "name": "Corinne Bohrer",
               "profile_path": "/i4U1Xg5173eoQbyEQklVy8pyCM3.jpg",
               "id": 74954,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Guy at Orgy (uncredited)",
               "gender": 2,
               "credit_id": "57ef9546c3a3683f72001f66",
               "name": "Bobby Astyr",
               "profile_path": null,
               "id": 101157,
               "order": 20
            },
            {
               "cast_id": 25,
               "character": "Guy at Orgy (uncredited)",
               "gender": 0,
               "credit_id": "57ef954ec3a3683c3e002137",
               "name": "Roger Caine",
               "profile_path": null,
               "id": 100510,
               "order": 21
            },
            {
               "cast_id": 26,
               "character": "Girl at Orgy (uncredited)",
               "gender": 1,
               "credit_id": "57ef95599251415925002561",
               "name": "Samantha Fox",
               "profile_path": "/u9XzOUHcrFYM3ayORpMtUjRr4NY.jpg",
               "id": 44941,
               "order": 22
            },
            {
               "cast_id": 28,
               "character": "Girl at Orgy (uncredited)",
               "gender": 1,
               "credit_id": "57ef9571c3a3683fac002121",
               "name": "Marlene Willoughby",
               "profile_path": "/nXK4m7DqzJtDZpJqmzYdBZkiH6g.jpg",
               "id": 98374,
               "order": 24
            },
            {
               "cast_id": 29,
               "character": "Girl at Orgy (uncredited)",
               "gender": 0,
               "credit_id": "59780b269251417558004c26",
               "name": "Candida Royalle",
               "profile_path": null,
               "id": 104538,
               "order": 25
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46329251416c9104c693",
               "name": "Richard T. Heffron",
               "profile_path": null,
               "id": 35525,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46329251416c9104c699",
               "name": "Larry Cohen",
               "profile_path": "/jB85d7bfXoIWW2nKxMe7fQJQ7rC.jpg",
               "id": 19266,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46329251416c9104c69f",
               "name": "Mickey Spillane",
               "profile_path": "/gHl2RPwAqs8EmGiyJVGOYQ6WDvr.jpg",
               "id": 82616,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 0.880921,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37191,
      "vote_count": 6,
      "budget": 0,
      "overview": "Jack Williams was the best friend of Vietnam veteran and detective Mike Hammer. When Jack is murdered, Mike makes it his business to solve the crime. He is helped by his secretary Velda, and partly helped, partly hindered by the Chief of Police, Pat Chambers. On the trail of the killer, Mike discovers government conspiracies, and plots used by the CIA and the Mafia.",
      "similar": [
         106239,
         37184,
         18030,
         42298,
         28257,
         38464,
         80757,
         50747,
         49431,
         97904,
         95345,
         161172,
         121992,
         130290,
         106060,
         249068,
         267981,
         130174,
         479524,
         386613
      ],
      "original_title": "I, the Jury",
      "runtime": 111,
      "poster_path": "/nrDU3GkcsPze1yZ2Y3HurKnNDrD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1982-04-22",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "The cops, the mob, the broads, everyone's after Hammer!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard T. Heffron"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Mickey Spillane",
         "Larry Cohen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084112/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwMjk5ODczMF5BMl5BanBnXkFtZTcwOTU1NjkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Armand Assante, Barbara Carrera, Laurene Landon | See full cast and crew »"],
      "reviews": [
         "This actually a combination of two Spillane books \"I the Jury\" and \"The Body Lovers\" This is not a great film, but good. The action and plot are pretty good and Assante gives a decent performance, but the thing that I remember the most is just how damn sexy Barbara Carrera is in this movie. I watched this movie with my mom on cinemax one night when I was in junior high school and I had to sit with a pillow on my lap. She blows away Sharon Stone in Basic Instinct. She's very tempting at the end when she confronts Mike Hammer and he's got to make a life and death decision. This movie belongs to her. She has been good in other movies, but this is her best performance. It's worth watching for any fan of Barbara Carrera and sleazy action movies",
         "I remember renting this film and seeing it with my friends. The video machine was new and enormous and my friends an me were in heaven. In the cover was a guy with a gun and that was enough for us to rent it. Everybody was drooling with the steamy sex scenes and gratuitous nudity. The violence over the top, the sex is wild I mean there is an orgy and people in white coats are taking notes for Christ sakes, and the unintentionally funny dialogue makes for a camp classic. We thougth we were seeing the greatest movie in the world. How can you not like a booby trap place like the one Mike Hammer drives trough with Alan King being 12 years old. Yea, Adult supervision Blah! I recently showed it to my wife and she almost passes out from laughing. It still is a great popcorn movie and her laughter was contagious. See without prejudices and just enjoy Assantes unbounded energy. Excuse my English if there are any errors in the spelling.",
         "Everywhere I look, people say that this is the best Mike Hammer film to date, and I can't help but ask \"why?\" It just isn't very Mike Hammer. If perhaps it was just a ripoff of the pulp classic \"I, the Jury\" with Armand Assante, I would have enjoyed it. As a movie, it's pretty good considering it was pure 1980's action. But as Mike Hammer, it's weak. The biggest differences between true Mike Hammer and this movie is Armand Assante's portrayal. He does a fine acting job, but Hammer is MEAN and always angry. In this, Assante is either manic depressive or smirking at the bad guys that he just beat. Mike Hammer gets into fist fights. Armand just pushes some people down stairs, doesn't throw punches. At least they got the ending right, although Armand Assante was still way too melancholy. I can say several positive things about this movie. The scene when Assante does a full assault on the criminal's compound with an M-16 is well directed, a good solid action scene (no way connected with the book). Velda and Assante's love interests were both more interesting to watch than the rest of the movie. In closing, I would like to say that Hollywood still has the chance to make a good, solid film based on Mike Hammer. Two tips: FOLLOW THE BOOK. Regardless of which book you use, follow it. Spillane wrote better than 90% of Hollywood anyways. And second, get someone who can be a mean and downright angry Mike Hammer, not depressed. I think Michael Madsen would fit the job well, he has the right look and the right voice.",
         "The first version of \"I, the Jury\" (1953) was a noir. \"I, the Jury\" (1982) is not a neo-noir. It is an action film built around a detective hero, combined with a large dose of CIA hanky-panky and a killer who is a pawn of the CIA. The action scenes are very well-directed and satisfying. The plot is fairly complex and somewhat murky as to details. This is more than compensated for by a high number of sharp lines, story ideas and novel situations. Assante is determined to find his friend's killer, no matter what. He's unafraid. He usually finds some clever way or approach to make headway in every situation. His secretary (Laurene Landon) is tough and smart. He's helped, up to a point, by policeman Paul Sorvino. A key player is the woman who runs the CIA's false clinic, and that's Barbara Carrera, later to be a Bond girl and warming up for it here at a high temperature. One should not expect a movie to be faithful to a book or its characters, and movies made from Mickey Spillane's books have always proved this. This one is no exception, so one cannot expect to see Mike Hammer brought to life as in the books. Certainly, Assante would not be cast in the part if that were the objective. What he brings to the movie is confidence, swagger, an ability not to be taken in, cleverness, solid anger at times, and humor at other times. Geoffrey Lewis provides his usual excellent support, but in one sequence only. There is female nudity too. Who's complaining? Overall, I enjoyed this film.",
         "I THE JURY (1982), the first Mike Hammer movie since THE GIRL HUNTERS (1963). This was a half-hearted attempt to bring Hammer into the modern world-- or something. Armand Assante's too short & skinny, his accent's all wrong & he seems too laid-back about all the nastiness going on, like he's a wise-guy when he should be a dangerous Neanderthal. Laurene Landon's pretty, but she seems too helpless when the going gets rough-- and she's blonde! (Velda's supposed to be a brunette, how hard is it to get even the simple details right?) Paul Sorvino as Pat Chambers isn't bad, but he gets forced to involve Hammer against his will, while in the original, he happily fed Mike all the info he could, knowing Mike would not be held back by rules & regulations the way he would be as a cop. The highlight of the film is no doubt Barbara Carerra, who gets to have one HOT nude sex scene about 2/3rds of the way in-- but it doesn't seem like she's really given much chance to act. Her lack of ability, or just a director who has NO IDEA what he's doing? Someone said this looked and felt like a \"tv movie\"-- the only difference being, the excessive graphic violence, nudity & sex. And while the original I THE JURY was a very complex plot, which left you marvel at the way such a \"thug\" on the outside as Hammer could figure it out when nobody else could, here, too much is spelled out for the audience, and yet, not enough is spelled out clearly for any of it to really make sense. OY! Bill Conti tries his best with a high-powered jazz score, but it's no FOR YOUR EYES ONLY. It's a fun flick and can be enjoyed for exactly what it is. But watching this again really makes me wish I had a good copy of the Biff Elliot film...",
         "I The Jury is an exciting action flick from 82, I first saw two years later and I must say me and my friend, saddled up in front of the t.v were engrossed, and underage to watch this sort of thing, but who's counting. Again, I re-iterate, this is an exciting psychological action thriller, and our psycho really here is nuts. Armand Assante is tailor made for our great fictional detective, Mike Hammer. He's everything he should be. I loved the fact Assante was in this. They don't make films like this anymore. The 80's had the best decade of movies, and this one's a prime example, and is quite on the blood and guts side too. Investigating the murder of a close buddy who served with him in Nam, Hammer stumbles upon a conspiracy trying to plughole his efforts, people going at great lengths to stop him, and make sure that people he talks to are people who'll be having their last conversation. I gotta admit, this film has style and the beautiful Carrera. She runs a sex retreat, where lovers can participate in, sexual experiments, orgies, a no holds barred, practice, what have you. The scene with those two naked twins, the psycho, a younger better looking version of Richard Lynch, doing them, is intense, and as I can remember, provided heavy viewing on my first watch back in 84 that I got away, renting this R movie, as I did a few others. There's action aplenty in this tasty, flick that has sex, beautiful nudity, some sick violence, and Assante. The thrilling action climax is great, plus another little after climax, which has Assante properly avenging his friend's death. Too, a great scene has Assante giving a new meaning to catching a cab, when he traps a goon, his coat, half in and half out, before he's dragged behind, over the coarse bitumen. A must see flick, you must see.",
         "At the end of the novel, Mike Hammer's tough-as-nails private investigator enfolds a beautiful woman in his arms. They kiss. He shoots her in the belly. She backs away, astonished, and before she collapses she asks, \"How could you?\" \"It was easy,\" replies Mike. These were the single most celebrated lines in pulp literature in 1953. The plot is torturous. Mike's old friend is murdered and this provides Mike with the revenge motive that propels him through the rest of the story, which has some sort of sex institute operating as a brainwashing tool of the CIA for the purpose of creating sex fiends who murder the agency's enemies and make it look like the work of a sex fiend which, in a way, it is. I told you it was complicated. But it deserves a few observations. One is that Barbara Carerra, an aristocratic looking ex-model and ex Miss South American Continent, looks perfectly beautiful, especially when completely and unashamedly nude. Shooting her was a mortal sin and Mike Hammer's soul should roast in hell. It doesn't matter that she was a treacherous, murdering, domineering nymphomaniac. Some men might enjoy just those properties in a woman. De gustibus non disputandum est. Another is that Mike Hammer, incarnated here by Armand Assante, is the luckiest man alive. Everybody who shoots at him misses. And, man, do they shoot at him -- with M-16s and Uzis and other weapons. They try to electrocute him. They blow him up with mines. Yet he always escapes. And when he has an opportunity to shoot BACK you can bet HE never misses. The police can't be trusted. Only Mike's secretary, Velda, she of the long and lustrous blond tresses can be trusted. She's played by Laurene Landon, who is a paragon of beauty but who can't act, not that it matters. Many of the action scenes, and they are here in abundance, are in the slow motion that was fashionable at the time. They entered their decadent period years ago. I blame Sam Pekinpah for their persistence. Armand Assante is the best performer in the film, even if the film itself is tripe. Second Best award goes to Judson Earney Scott, a magnetic actor, as the sex-driven, twisted madman. You can't take your eyes off the guy. He resembles Peter Greene, another very convincing villain.",
         "***WARNING SPOILERS*** Mike Hammer, Armand Assante, taking time off from his grueling and back breaking job as a divorce investigator to find who's responsible for the murder of a Vietnam army buddy of his Jack Williams, Frederic Downs, and bring him or they to justice; Mike Hammer-style. Jack a private investigator who lost an arm in Vietnam seemed to be on to something when he was murdered. Mike gets a clue from his widow Myrna, Margaret Amato, on what Jack was doing up until the time of his death. Going to a Manhattan sex clinic where Jack was a patient in Hammer finds the clinic manager Dr. Bennett, Barbara Carrera, anything but helpful. It's then that Mike figures that Jack was undercover there as a patient and uncovered something that cost him his life, but what was it? It later turns out that the sex clinic is a front for a rouge element of the CIA thats working together with the New York Mafia smuggling weapons and at the same time using the patients in the clinic with sever mental problems as programed assassins. Having them go out and murder those who are on to the clinics real purpose and at the same time having those killings written off as simple sex-related crimes by the police. The operation is run by former US Army Special Forces colonel Romero, Barry Snider, who's tactics in Vietnam were even too much for his superiors in the business of breaking down or turning enemy combatants to be cooperative. Hammer doesn't realize that he's being used by the US government to bring down this operation and at the same time he's on his own doing it. Since those in government don't want it to come out that it's an unofficial CIA/Mafia endeavor since it would lead to the many sponsored covert CIA/Orginized Crime actions over the years. Mike Hammer does his job, even though he doesn't seemed to get paid for it, with brutal and deadly efficiency. Taking everything the rouge CIA/Mob group could dish out and putting them out of business in grand fashion at the conclusion of the film. Hammer does this in a one man shoot-out at their secret headquarters where he finishes off both mob boss Charles Kelecki, Alan King, and his gang of CIA/Mafia henchmen. Mike now has just one loose end to tie up to finally close the case on the death of his friend Jack and he'll do it with a smile a kiss and a gun. Armand Assante is very good as the brutal, but at the same time added a lot of humor in his role, private eye Mike Hammer. His actions at Dr. Bennetts office and her sex clinic run mansion in suburbia were hilarious and Barbara Carrera was both sexy and deadly as the dragon-like lady Charlotte Bennett. Carrera together with Assante had the most super charged sex scene in the film that made all the orgy sequences in the movie pail in comparison. Besides both Alan King and Barry Snider being in roles as the mob boss and rouge CIA operation chief Paul Sorvino was in the movie as Mike's friend in the NYPD Det. Chambers. Det. Chamber knew what the US government was planing in having him do their dirty work but was too scared to tell him until Hammer found it out for himself.",
         "I like this slightly over the top interpretation of Mike Hammer, especially after viewing all the previous watered down versions. I, The Jury (1982) Directed by Richard T. Heffron, starring Armand Assante, as Mike Hammer, Barbara Carreram as Dr. Charlotte Bennett, Laurene Landon as Velda, Alan King as Charles Kalecki, Geoffrey Lewis as Joe Buttler, and Paul Sorvino as Det. Pat Chambers. I first saw this probably sometime in the late 80's once, had nothing to compare it to, and barely remembered it so it was a delight to get to view this the other day, especially since I've recently been revisiting Spillane and the films based on his novels. It took 30 some odd years for a film to really do full justice to the zeitgeist of a Mickey Spillane novel. The best looking and true Noir adaptation is still \"Kiss Me Deadly\" (1955) with Ralph Meeker, Jack Elam, Strother Martin, Jack Lambert, Gabby Rogers, and Cloris Leachman, but it was hampered by being made while the Hays Code was still in effect. The original \"I, The Jury\" (1953) was DOA having non presence Biff Eliot in the title role, but at least the babes were \"hammertomically\" correct , \"My Gun is Quick\" (1957) starring Robert Bray as had the right caliber of women, but had the action not in NYC, but in some seaside resort and Hammer was running around with a pop gun not his trademark .45 Colt Automatic. \"The Girl Hunters\" (1963) had Spillane in the title role, but he was no actor, and aside from the establishing shots of NYC , the film was shot in England. At least it had the babes. But WOW!, right from the opening credits of I, The Jury (1982) you know you are in Mike Hammer land with the emphasis on women and the Colt .45 automatic, Broads & Bullets, Girls and Guns (both kinds). I'm sure graphic novelist Frank Miller (Sin City) had to have seen this graphic opening sequence in three colors black, white, and red, and was influenced by it. If not, it predates that style by 10 years. This version has Hammer's office located above Times Square, set in the post Vietnam 80's. Hammer is a sleazy detective working divorce cases. We first see him pulling a dead fish out of his tank and holding it while talking to another fish/client, who is worried about his wife cheating on him. Hammer asks to see her picture notices that she is beautiful, then tells the client that he's in trouble. Next shot has Hammer screwing the clients wife while fielding a call from him, the conversation is humorous along the lines of , \"yea I'm right on top of her\", and \"yea, don't worry, I'm very familiar with all her moves\". Hammer's one armed war buddy Jack takes a slug in the guts and dies crawling across his living room, notified of his death Hammer (like a licensed rogue cop with full access to NYPD info) acts like bull in a china shop and the action (along with the catchy and wonderfully complementary score) never quits\u0085 that is unless a broad drifts into range, and a bevy of lovelies do so. In this version Velda who in the novels was also a licensed detective holds her own doing double duty as a competent secretary/associate, and quasi love interest, she shows flashes of jealousy when Mike returns to the office disheveled and bruised from his escapades. All the actors put in decent performances, I just wish Geoffrey Lewis had a bigger part, my only quibble. What's not to like. Barely Neo Noir if that. The one noir lit sequence that I do remember was when Hammer goes to pay respects to Jack's wife. Most of the film is too brightly lit. No first person narrative. And well, this version deviates a bit from the novel, i.e., using a surrogate serial killer in place of Kaleki's henchman to the detriment of the novel's excellent Bellamy Twins sequences, the substitution of the sex clinic for the whorehouse, and bringing an ex-CIA paranoid operative \"house as fortress\" character into the story. Armand Assante as Hammer hews closer to Ralph Meeker looks than what you picture Mike Hammer should look like (for me that would have been the great Charles McGraw), but he has the machismo and misogynistic qualities right, lol . The cinematography is adequate, very pedestrian, nothing stylistic. Setting the story in the post Vietnam 1980's takes away the dirtier, grittier, sleazier, New York of the late Forties to early Sixties. There's no street level connection to the Burlesque Joints, XXX Movie Theaters, The \"Live Nude Girl\" Peep Shows, the Arcades, the newspaper stands, the street vendors, the con games, the Dime A Dance Ballrooms, the bums, the panhandlers, the hookers, etc., etc., New York was starting to loosing that real ambiance, too bad. I remember The 42nd St. Times Square area ridden with the above in 1970, and by the time I returned in 1996 it had changed to Disneyland. Minor quibbles. Still excellent film 8.5/10,some funny bits, almost the perfect Hammer with an excellent score. The only way to improve would be a Sin City type treatment keeping the machismo and misogynistic qualities this film has with the dirtier, grittier, sleazier, New York of the late Forties to early Sixties.",
         "Oh the 70s was a great time for crime features\u0085 although \"I, the Jury\" was made in the early eighties it had me thinking it was from the 70s like some sort leftovers that found itself in the wrong decade. And hey that's not a bad thing at all. Originally it looked like it was cult-filmmaker Larry Cohen's project, as he penned the screenplay and was to direct to only be replaced by Richard T. Heffron (Futureworld). This is another adaptation of novelist's Mickey Spillane's Mike Hammer character. Private detective Mike Hammer looks into the case to seek revenge when he learns of the killing of his one-armed ex-army buddy. What he digs up about his mate's death, is something quite big. \"I, the Jury\" is a tough as nails, lean and steamy pulp crime / film noir feature that's sexually charged (an opened orgy sequence) and brutally violent (a ghastly slit throat) amongst a rather seedy backdrop. Filling in the role as the iconic Mike Hammer is a fittingly hardboiled, but wry Armand Assante. Surrounding him is a bunch of attractive, but formidable ladies in the shape of Barbara Carrera and Laurene Landon. Also you got the likes of Paul Sorvino, Alan King, Geoffrey Lewis and Barry Snider pitching in with good performances. Cohen's story remains exhaustively captivating; by always being on the move in what is a complicated web of conspiracies and leads. The dialogues are bold. Sometimes contrived in its actions, but it does open up a can of worms. Heffron's steadfast direction is economically staged with moments of thrilling engagements and brooding passages that he's not afraid to bare flesh, but at times it felt like I was watching a long-winded TV episode. Bill Conti composes a titillatingly smoking blues score, which installs a whirlwind of emotion."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "American Cinema Productions",
         "Larco Productions",
         "Pellepont"
      ],
      "summaries": ["An old friend of a private detective is murdered. The detective, Mike Hammer, will make every effort to find out the killer. At each step he does, there is someone taking advantage of his progress."],
      "budget": 0
   },
   "movielensId": 6086,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-04-22",
      "dvdReleaseDate": null,
      "directors": ["Richard T. Heffron"],
      "runtime": 111,
      "movieId": 6086,
      "title": "I, the Jury",
      "mpaa": "",
      "actors": [
         "Armand Assante",
         "Barbara Carrera",
         "Laurene Landon",
         "Alan King",
         "Geoffrey Lewis",
         "Paul Sorvino",
         "Judson Scott",
         "Barry Snider",
         "Julia Barr",
         "Jessica James",
         "Frederic Downs",
         "Mary Margaret Amato",
         "F.J. O'Neil",
         "William G. Schilling",
         "Robert Sevra",
         "Mike Miller",
         "Leigh Harris",
         "Lynette Harris",
         "Bobbie Burns",
         "Corinne Bohrer",
         "Bobby Astyr",
         "Roger Caine",
         "Samantha Fox",
         "Marlene Willoughby",
         "Candida Royalle"
      ],
      "imdbMovieId": "0084112",
      "originalTitle": "I, the Jury",
      "genres": ["Crime"],
      "youtubeTrailerIds": ["p5G-m6lLBLI"],
      "plotSummary": "Jack Williams was the best friend of Vietnam veteran and detective Mike Hammer. When Jack is murdered, Mike makes it his business to solve the crime. He is helped by his secretary Velda, and partly helped, partly hindered by the Chief of Police, Pat Chambers. On the trail of the killer, Mike discovers government conspiracies, and plots used by the CIA and the Mafia.",
      "tmdbMovieId": 37191,
      "avgRating": 3.075,
      "releaseYear": "1982",
      "numRatings": 40,
      "posterPath": "/nrDU3GkcsPze1yZ2Y3HurKnNDrD.jpg"
   }
}