{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0055052",
      "video": false,
      "title": "The End of Summer",
      "recommendations": [
         159414,
         21967,
         45999,
         142373,
         112501,
         141906,
         28249,
         217411,
         46918,
         50247,
         104549,
         56801,
         66148,
         65040,
         57969,
         37239,
         33356,
         55192,
         29268,
         54291
      ],
      "backdrop_path": "/3rKDVUqxwL8g8ufujtT4fZRskuR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kohayagawa Banpei",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060711",
               "name": "Ganjiro Nakamura",
               "profile_path": "/e7uJtd79BrM7uMWbwghBmptLvG6.jpg",
               "id": 96551,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Akiko",
               "gender": 1,
               "credit_id": "52fe4587c3a368484e060715",
               "name": "Setsuko Hara",
               "profile_path": "/ndu5fjeHxUduXCfzXz2vPR6i1ks.jpg",
               "id": 95504,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Noriko, second daughter",
               "gender": 1,
               "credit_id": "52fe4587c3a368484e060719",
               "name": "Yôko Tsukasa",
               "profile_path": "/urhDBrQRSs690WNSh5eVJrXdWzq.jpg",
               "id": 70811,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Fumiko, eldest daughter",
               "gender": 1,
               "credit_id": "52fe4587c3a368484e06071d",
               "name": "Michiyo Aratama",
               "profile_path": "/penV4mYKxLtmChZkAoFZss5HuEF.jpg",
               "id": 85307,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hisao, Fumiko's husband",
               "gender": 2,
               "credit_id": "52fe4587c3a368484e060721",
               "name": "Keiju Kobayashi",
               "profile_path": "/41yr4DgrkiIB0ywzcVcKGYvMJyt.jpg",
               "id": 70324,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Masao, thier son",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060725",
               "name": "Masahiko Shimazu",
               "profile_path": null,
               "id": 135135,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Isomura Eiichirou",
               "gender": 2,
               "credit_id": "52fe4587c3a368484e06075f",
               "name": "Hisaya Morishige",
               "profile_path": "/erp4sA19i50PStmxwTJ3RMcJyT5.jpg",
               "id": 20340,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Sasaki Tsune",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060763",
               "name": "Chieko Naniwa",
               "profile_path": "/78db2QPUQd9UkjhKJuAes4sPrD9.jpg",
               "id": 134344,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Yuriko, her daughter",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060767",
               "name": "Reiko Dan",
               "profile_path": null,
               "id": 131203,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Katou Shige",
               "gender": 1,
               "credit_id": "52fe4587c3a368484e06076b",
               "name": "Haruko Sugimura",
               "profile_path": "/g4ro32UO0Aob9QtLAVAXI9oOKZT.jpg",
               "id": 131013,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Kitagawa Yanosuke",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e06076f",
               "name": "Daisuke Katô",
               "profile_path": "/rZGOg4xRkDTVMdGCzMhswioT4pU.jpg",
               "id": 7457,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Kitagawa Teruko",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060773",
               "name": "Haruko Tôgô",
               "profile_path": null,
               "id": 134319,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Nakanishi Takako",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060777",
               "name": "Yumi Shirakawa",
               "profile_path": "/3PCFDGFlguaMFe1IeOf9y82RWGB.jpg",
               "id": 128665,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Teramoto Tadashi",
               "gender": 2,
               "credit_id": "52fe4587c3a368484e06077b",
               "name": "Akira Takarada",
               "profile_path": "/65Z2wChBXZjkcRcFgq7aeDkoyCa.jpg",
               "id": 18615,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Yamaguchi, chief clerk",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e06077f",
               "name": "Kyû Sazanka",
               "profile_path": null,
               "id": 213469,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Maruyama Rokutarou",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060783",
               "name": "Yû Fujiki",
               "profile_path": "/am1RppKjEZV8mw216UtAIRblLwe.jpg",
               "id": 144797,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Farmer",
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060787",
               "name": "Chishû Ryû",
               "profile_path": "/ocEzSylcvsKIKw8LciHEA3E1LEG.jpg",
               "id": 33135,
               "order": 16
            },
            {
               "cast_id": 28,
               "character": "Banpei's brother",
               "gender": 2,
               "credit_id": "52fe4587c3a368484e06078b",
               "name": "Tatsuo Endô",
               "profile_path": "/1B5DH8kvsPZS1HMrGUmqQ0TqtGU.jpg",
               "id": 83205,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4587c3a368484e06072b",
               "name": "Yasujirō Ozu",
               "profile_path": "/xq5SKmMDxsmnLn75FBqPjQ0xbP4.jpg",
               "id": 95501,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4587c3a368484e060731",
               "name": "Kogo Noda",
               "profile_path": "/gK4hSppQWVZab0Y1LL4pg7UcSsf.jpg",
               "id": 131010,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060737",
               "name": "Yasujirō Ozu",
               "profile_path": "/xq5SKmMDxsmnLn75FBqPjQ0xbP4.jpg",
               "id": 95501,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4587c3a368484e06073d",
               "name": "Sanezumi Fujimoto",
               "profile_path": null,
               "id": 15216,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4587c3a368484e060743",
               "name": "Masakatsu Kaneko",
               "profile_path": null,
               "id": 1092557,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4587c3a368484e060749",
               "name": "Tadahiro Teramoto",
               "profile_path": null,
               "id": 1092558,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4587c3a368484e06074f",
               "name": "Toshirō Mayuzumi",
               "profile_path": null,
               "id": 25800,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4587c3a368484e06075b",
               "name": "Kôichi Iwashita",
               "profile_path": null,
               "id": 564868,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5717c2d8c3a3686cb7001d1b",
               "name": "Asakazu Nakai",
               "profile_path": null,
               "id": 34380,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.894375,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 28273,
      "vote_count": 20,
      "budget": 0,
      "overview": "The Kohayakawa family is thrown into distress when childlike father Manbei takes up with his old mistress, in one of Ozu’s most deftly modulated blendings of comedy and tragedy.",
      "similar": [],
      "original_title": "小早川家の秋",
      "runtime": 103,
      "poster_path": "/iM9tdNrjcci5hk5TW59LLIDTl7T.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/lYCOp17DBEjFD1UygdRor98PVWR.png",
            "name": "Toho Company",
            "id": 882,
            "origin_country": "JP"
         },
         {
            "logo_path": null,
            "name": "Takarazaka Productions",
            "id": 10624,
            "origin_country": ""
         }
      ],
      "release_date": "1961-10-29",
      "vote_average": 7.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yasujirô Ozu"],
      "runtime": 103,
      "synopsis": "The Kohayakawa family is thrown into distress when childlike father Manbei takes up with his old mistress, in one of Ozus most deftly modulated blendings of comedy and tragedy.",
      "writers": [
         "Kôgo Noda",
         "Yasujirô Ozu"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0055052/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzNzE1MDc4N15BMl5BanBnXkFtZTcwNjIyMTY0MQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Ganjirô Nakamura, Setsuko Hara, Yôko Tsukasa | See full cast and crew »"],
      "reviews": [
         "It is a bunch of baloney to say that END OF SUMMER is far behind Ozu's other efforts. I have seen most if not all of Ozu's most acclaimed works, and END OF SUMMER is the best one I've ever seen. It even surpasses TOKYO STORY, which many scholars claim is Ozu's best masterpiece, one of the greatest movies of all time. For my money, END OF SUMMER is one of the top five foreign movies of all time. The beautiful photography is sublime; the movie contains some of the funniest things in any Ozu movie; and the ending is one of the most heartbreaking, most superbly visualized endings ever put on celluloid! I just can't say enough good things about this movie. There may be another Ozu movie I haven't seen that surpasses this one, but I sincerely doubt there's more than one, if there's even one.",
         "Yasujiro Ozu is, without a single doubt in my mind, in the top five directors of all time. Possibly the second best after my personal favourite Akira Kurosawa. Many may credit my preference due to the fact that Kurosawa was considered as the most Western of all Japanese directors. However Ozu came from the same time and his films are very different but just as good. Ozu's films have the most simple of plots, in that they do not have a strict or interesting storyline. This can sometimes lead to extremely complex situations as Ozu focuses on the trials of Japanese family life. If you are looking for films about real life, and real people, then look no further than Ozu. Like other Ozu films there are arranged marriages, and relationships that cross through all generations. A father is distracted from troubling finance issues by a recently rekindled affair from nineteen years previously. The film is very subtle in its extraction of emotions, Ozu's trademark of not moving the camera once, with completely still shots. Ozu also doesn't use flashbacks, resulting in people simply talking and describing the past. The editing is restrained to simple straight cuts, and no fancy transitions are used. It is this simplicity that some may find boring, or a lack of pacing. For me however it is great to see a master of the craft not give in to unnecessary techniques when the acting and slightly faded picturesque cinematography does all the talking. Dialogue between characters is both intriguing and thought provoking. The final funeral scenes really do demonstrate the beauty of Ozu's films, when we see a couple of complete strangers talk about the recent passing, as we are then treated to a magnificent shot of the funeral procession walking down a bridge. Like 'Tokyo Story' and 'Early Summer', 'The End of Summer' is a thoughtful and delicate piece of work, and also a fine example of Ozu's rare use of colour.",
         "This is classic Ozu, a small slice of life, a crucial turning point in the history of a family fighting the inevitable progress of time and change. In this case it is a family consisting of a widower, clearly someone with a racy past, and his four children - a somewhat dim son, two dutiful older daughters, and a sharp tongued younger daughter, outraged that her father is determined to age disgracefully. He (played by the impish Ganjiro Nakamura) is sneaking off from his duties at his struggling sake brewery to meet an old flame. His eldest daughter, in true later Ozu style is reluctant to accept the hand of an apparently decent suitor. His second daughter is torn between the 'good' match and her true love, an impoverished academic. Ozu's penultimate film, and perhaps this is reading too much into it, but its hard not to see his vision of his own impending death in it, despite the great humour in it. This is a meditation on a dying world - despite the vibrant photography, the film resonates with images of passing - constant visions of graveyards, an old dying Japan, the families roots in a dying form of business as they are overtaken by big, highly capitalised larger companies. The ending is sad and inevitable, but not tragic - life does go on, and a new generation wills step in, even if the old traditions are not maintained. One striking thing about this film is the incredible photography. Have humble domestic interiors every looked so stunningly beautiful? The lighting is luminous, every scene is as perfectly composed as a Vermeer painting.",
         "Ozu's penultimate film is also one of his best. As in many of his movies, the theme here deals with the dynamics of a traditional Japanese family. The aging patriarch of a family has to deal with marrying his two grown daughters (one is divorced with child, the great Setsuko Hara), the financial problems facing his small sake producing business, the reunion with his long lost lover and their capricious daughter and, last but not least, his impending death. The death theme hangs throughout the movie; Ozu was probably thinking of his own death when he filmed this (he would live only a couple of years more); the last shot has black crows standing over the patriarch's gravestone. Ozu's films in color are even better than those in black and white: his famous sense of composition shines even better. Besides, I love color films from the late 1950s and early 1960s period, perhaps because they show us what society look like before the great disruption of the late 60s (this is not personal nostalgia, since I wasn't even born then). Overall, one of Ozu's best films.",
         "This beautiful, haunting film takes place at the end of a hot Japanese summer that, as one of the characters puts it, \"refuses to end.\" The mournful sound of cicadas accompanies the series of tableaux about the scion of the Namakura family, a whimsical widower who continues to see the mistress who caused his late wife and currently cause his three daughters a lot of sorrow. The film is about the impracticality and unpredictability of love in opposition to a rigid social order. Two of Namakura's daughters share their father's ambivalence about marriage. The older daughter, herself a widow, hesitates to re-marry. Although she embraces traditional values, she treasures her life \"as it is,\" and values the freedom she now has as a single woman. Another daughter prefers to marry for love, rather than go with the dull, practical man her family has chosen for her. Only one daughter has a traditional marriage, but she's the most angry and outspoken to her father about his mistress. The film is also about the contrasts between the old and, \"New Japan,\" the English words written on a flashing neon sign glimpsed on an anonymous city street. Despite his eccentricities, Namakura was a good businessman who kept the family sake business afloat; he could straddle both the old and new worlds. This is a physically gorgeous film, filled with humble domestic scenes that radiate the light of Vermeer and Dutch genre paintings. Ozu shows tremendous respect for women and the humble work they do--washing, sewing, cooking. It's work that is usually unseen and under-appreciated, so it's a pleasure to see it honored here.",
         "After his second experience with colour, a light, happy \"Ohayo\", secretly epic and impressed, Ozu shot one of the milestones of his career: \"Kohayagawa-ke no aki\" is in my recollection, with \"Banshun\" and \"Munakata shimai\", his best work. Most of the themes exposed in previous films (father's intervention in his daughters' lifes, love (in the hands of others), solitude) are here integrated in a comedy-structured film that becomes a drama. It's perhaps his unique melodrama and it is shown with the desperate of the last breath for some characters, as usual in Ozu, doubtful and seeking a place for their quiet happiness. There is no Ozu film nearest Sirk's or Minneli's universe like this one.",
         "Of the Ozu films I've seen this one seems to stand out the most; there isn't a single shot of a train, only the sound of distant ones passing. There are attempts at arranging marriages, for a young woman and for a widow, but neither come to fruition. He almost throws a curve ball so to speak, since at the beginning of the film you're given the impression that it's going to be about two widows getting' the hook up, but then it turns out to be more of a study on the widowed father of the Kohayagawa family. There's also one more thing I've yet to have seen in an Ozu film, as far as I can remember: a dead person on screen, usually we're entering the stories of these people's lives after someone has croaked. Definitely the most bittersweet of the Ozu films I've seen thus far, there are moments of genuinely touching comedy and also a few moments of blatant commentary on the modernization of the Japanese woman at the time, with the one daughter whose only regret after her \"father\" dies is that she doesn't get the mink stole she wanted, not to mention she's going out with a new American guy every other day.",
         "The End Of Summer is another Ozu film about making a love connection, but this time there are multiple characters involved. One of the Ozu twists is the great Ganjiro Nakamura, who plays the father. He is trying to marry off his three daughters while he is visiting an old flame. One of the daughters is played by Yoko Tsukasa, who movingly played Setsuko Hara's daughter in the equally absorbing Late Autumn. Here, Mr. Nakamura provides the film's comedy, an old man looking for some action from a former mistress. However, this film is not really a comedy. Its a story about life events, the changes in ones personal destiny. Its hot in the movie, since a few characters fan themselves, hence the title. Not quite as good as Tokyo Story, Late Spring or Late Autumn, but that is such a tall order, I don't feel anything but admiration for this film. One great thing about this film is that many actors in prior Ozu films are here, making it almost an ensemble piece. I would have liked more of Setsuko Hara's character, but just seeing her in a film is worth anything. This film also works almost like a play, little stories molded together into one film. Worth your time and, as it was Ozu's penultimate film, its practically required viewing.",
         "I've come to think that Ozu is the most original of all directors post silent era. The End of Summer is just another example of how Ozu manages to make a compelling film out of the most mundane of plots. This also one of the funnier Ozu movies. The early scene of Akiko's meeting with a potential suitor is handled with great light comedic touches (the nose signal). Ozu's signatures are all here: the static camera shots,shooting actors from behind, sudden jumps in timeline, and of course great acting. I can't think of a director who is more instantly recognizable not just for technique but also plot and dialogue. There is only one Ozu and this is one of his best, right up there with : Late Spring, Tokyo Story, Early Spring, and Tokyo Twilight",
         "\"Kohayagawa-ke no aki\" reveals a spectacular display of color and form that only a true master of art can achieve. Yasujiro Ozu has outdone even himself in this regard. One can easily get lost in one scene after another and forget that a film is playing. It is a though one is in an art gallery of cultural art which happens of be that of Japan. Monet attempted to imitate the impressionistic art of Japan during his lifetime in the 19th century, as can be seen in his own collection. The trend seems reversed in the 20th century, with Ozu using the techniques of American and European hard-edge expressionist. The results are stunning, infinity better than his earlier works. The same scenes in black and white in 1956 are presented in 1963 with vivid complementary and contrasting color. Barrels against a wall are no longer just gray shades but brown tubs with white rims and adjacent white umbrellas and buildings. There are dozens of other equally impressive combinations. The most spectacular scenes are those without actors or minimal acting. But after all, this is a movie so one has acting and dialogue. Moving hand fans dominate many scenes to an almost hypnotic end. The striking neon sign of the NEW JAPAN presages the future. The Left Elbow Index considers film from seven perspectives--acting, production sets, artistry, character development, film continuity, plot and dialogue--with a rating of 10 for very good, 5 for average, and 1 for needs help. The sets, the artistry, and the plot are rated very good. The plots are intriguing: to marry or not, East vs West, and cultural change. The acting is average due to the fixed photo technique and the talking head approach. Dialogue is appropriate. However, character development and film continuity seem submerged in the attention to color and form. The LEI average rating is 6.0, with a full point more given for Ozu's quantum leap into a new world of color, resulting in a 7.0, or above average, equal to an 8 on the IMDb scale. If one is serious about film history, this movie is essential to understanding trends. I strongly recommend this film. Just sit back and enjoy one tableau after another. You may find your jaw dropping in wonder and awe."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Toho Company",
         "Takarazaka Productions"
      ],
      "summaries": ["The family of an older man who runs a small sake brewery become concerned with his finances and his health after they discover him visiting an old mistress from his youth."],
      "budget": 0
   },
   "movielensId": 60990,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "1961-10-29",
      "dvdReleaseDate": "2007-06-12",
      "directors": ["Yasujirō Ozu"],
      "runtime": 103,
      "movieId": 60990,
      "title": "The End of Summer",
      "mpaa": "",
      "actors": [
         "Ganjiro Nakamura",
         "Setsuko Hara",
         "Yôko Tsukasa",
         "Michiyo Aratama",
         "小林桂樹",
         "Masahiko Shimazu",
         "Hisaya Morishige",
         "Chieko Naniwa",
         "Reiko Dan",
         "Haruko Sugimura",
         "Daisuke Katô",
         "Haruko Tôgô",
         "Yumi Shirakawa",
         "Akira Takarada",
         "Kyû Sazanka",
         "Yû Fujiki",
         "Chishu Ryu",
         "Tatsuo Endô"
      ],
      "imdbMovieId": "0055052",
      "originalTitle": "小早川家の秋",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The Kohayakawa family is thrown into distress when childlike father Manbei takes up with his old mistress, in one of Ozu’s most deftly modulated blendings of comedy and tragedy.",
      "tmdbMovieId": 28273,
      "avgRating": 3.74444,
      "releaseYear": "1961",
      "numRatings": 45,
      "posterPath": "/iM9tdNrjcci5hk5TW59LLIDTl7T.jpg"
   }
}