{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0084481",
      "video": false,
      "title": "Godard's Passion",
      "recommendations": [
         123817,
         107551,
         98200,
         148905,
         147611,
         128368,
         209744,
         260215,
         209699,
         176704,
         146172,
         152933,
         209754,
         154412,
         142191,
         236576,
         148040,
         145502,
         390392,
         335708
      ],
      "backdrop_path": "/ugJ7vVariqmHMFMcT6GEPAi1goY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Isabelle",
               "gender": 1,
               "credit_id": "52fe44e59251416c910207b3",
               "name": "Isabelle Huppert",
               "profile_path": "/wGG9v1Uci3sfrbjt0bRXkLrTqjY.jpg",
               "id": 17882,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Hanna",
               "gender": 1,
               "credit_id": "52fe44e59251416c910207b7",
               "name": "Hanna Schygulla",
               "profile_path": "/rlM0TCA5NNLQ9SwP4Cn4PhmaGgy.jpg",
               "id": 3734,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Michel Boulard",
               "gender": 2,
               "credit_id": "52fe44e59251416c910207bb",
               "name": "Michel Piccoli",
               "profile_path": "/gz91b4tVn6yYsKemek2YkUdjlSH.jpg",
               "id": 3784,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Laszlo",
               "gender": 0,
               "credit_id": "52fe44e59251416c910207bf",
               "name": "László Szabó",
               "profile_path": "/dFEmQzfyfU557kH8PGHR3GI29EE.jpg",
               "id": 38899,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Jerzy",
               "gender": 0,
               "credit_id": "52fe44e59251416c910207cf",
               "name": "Jerzy Radziwiłowicz",
               "profile_path": "/fKTbFcO0fkpFVkVjbbQRlaprxsg.jpg",
               "id": 1386,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "54621fc60e0a2672ad0021a3",
               "name": "Myriem Roussel",
               "profile_path": "/ybcwN8I21uP88EfSHFU5VOPinMu.jpg",
               "id": 1383725,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44e59251416c910207c5",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44e59251416c910207cb",
               "name": "Jean-Luc Godard",
               "profile_path": "/40irqwjSgDaxts68tdV63m4Ls4n.jpg",
               "id": 3776,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.130802,
      "production_countries": [
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 32692,
      "vote_count": 14,
      "budget": 0,
      "overview": "While shooting a film, the director becomes interested in the unfolding struggle of a young factory worker that has been laid off by a boss who did not like her union activities.",
      "similar": [],
      "original_title": "Passion",
      "runtime": 87,
      "poster_path": "/hQ1zhDRbuNkN63eWTSKuHLKM6gs.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1982-05-26",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Godard mixes up politics, love and the workers plight, with the struggles of filmmaking, in his cheeky brand of art.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean-Luc Godard"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Jean-Luc Godard"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0084481/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzNjIyMjkzMl5BMl5BanBnXkFtZTcwNjIxMDkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Isabelle Huppert, Hanna Schygulla, Michel Piccoli | See full cast and crew »"],
      "reviews": [
         "Godard's 'Passion' will inevitably draw violent reactions from didactic viewers with a classical Hollywood outlook, even though it expressly addresses the contradictions and pains in discerning just what makes a film \"a film\". To condemn it as boring or shapeless is to blindly miss the point. For those of us more inclined to tackle this fascinating question, there is much to luxuriate in here. From even a purely aesthetic viewpoint, the wonderfully incongruent images (like the ship in the forest) and the beautifully lit reconstructions of classical paintings (with their attendant outpourings of classical music) are enough to hold sway. With these tools, Godard contrasts the passion and belief in labour; the practical against the artistic. Isabelle Huppert's stuttering, incoherent virgin loves her factory job and fights for her \"right\" to work, while the jaded director Jerzy, surrounded by a bevy of naked beauties during the making of his elusive film, sullenly stages his reconstructions. His work, however, contains no such solace and he becomes morose to the point of inertia by his task of creating a formally perfect but outwardly fragmented piece. Jerzy's constant frustration with having to explain to others what his film is \"about\" is a poignant running comedic highlight. But that is only part of the battle - practical concerns impinge also. This is painfully clear (and bitterly funny) when Jerzy's ever suffering assistant points out to the frustrated producer the individual cost of each item on the set in an attempt to explain where all the money is going. The characters aggressive tussling, either through physical pulling and pushing or through their cars (reminiscent of Godard's masterpiece 'Week End'), also signify the difficulty and pain inherent in any kind of birth. The quiet moments call out to be examined and celebrated as much as the grand statement while others jostle for their money, their moment, or even a simple explanation as to what it all means. Like most of Godard's late work, this mosaic approach will not appeal to all who cross its path (what film ever does?) but, even if it does ultimately fall short of answering any of the questions it asks, adherents will find much to ruminate on.",
         "In narrative painting, a story is told by the image, either through the composition or devices such as registers or continuous narrative. In a film, the story and image are separate and the image is usually a reenactment of the story. Jean-Luc Godard would say (and has said, more or less) that all art forms have an interrelationship and interchangeability. With this philosophy in mind he used his work to try to break down film from its conceptual boundaries of the narrative. In a sense this is a beautiful gesture, and I'm not denying this, but this manifesto-based approach to art- making leads to a lot more of explaining yourself than creating original work. The Godard film I want to put in question is called Passion (1982). It scandalizes the film vernacular of that postmodern trope, the film within the film. It goes behind the scenes of film-making, but the mock-film, which is also titled Passion, has no plot. It simply recreates a few painting \"masterpieces\" on film with real characters, on a real scale. The seminal painting- reenactment is Eugene Delacroix's The Entry of the Crusaders into Constantinople. Delacroix truly wanted to revolutionize narrative painting of the Romantic period in France. He was fed up with the conservatism introduced by painters like David. So rather than painting simple, yet psychological moments in a narrative like The Death of Marat, he tried to expand the modes of depicting narrative. The result of this effort is evident in The Entry of the Crusaders into Constantinople, completed in 1838, at the height of his career. His mode for this painting is somewhere between narrative registers and a theatrical moment (such as the moment Géricault chose for Raft of the Medusa). Elements of story are scattered around the chaos of the historical event: a woman kneels over her fallen friend, an old man tries to protect a young woman from the crusaders on horseback, another man fights a soldier on the steps of a temple, etc. At face value, it looks a bit like an epic painting, but it isn't. Epic paintings always have a shining moment; in Delacroix's, every moment shines in its own way. So while Delacroix's practice wasn't necessarily interdisciplinary, it most certainly zigzagged across painting genres. This aspect of the work is probably one of the Godard's interests in Delacroix, being that Godard was a seminal figure in the development of the shiftiest art movement to date, postmodernism. The understanding that there are separate shining moments in both Godard's Passion and Delacroix's The Entry of the Crusaders into Constantinople is very important to the interpretation of these works. As Jerzy, the director of Godard's film within the film said, \"An image is not beautiful because it is brutal and eerie it is because the solidarity between ideas is distant and just.\" This line is incredibly profound, because it lays out the truth of art and life in general before the work; that truth is that all ideas are conceived disparate from one another because ideas come out of experience, which coincidentally is a paraphrasing of another one of Jerzy's lines. This idea becomes more important as the movie progresses. The other painting-reenactments, which appear closer to the beginning of the movie, are simply still images transferred to three dimensions and then recorded on film; but when he gets to the Delacroix scene (which was the most modern of the paintings and also stretched the concept of narrative the most), he is true to his philosophy. The characters begin the scene by reenacting the sacking of Constantinople, so as to have the experience, each one on an individual level, to be able to depict it. The action, which was being filmed, didn't even seem important to the filmmakers, in fact some of the production assistants were yelling at the actors (especially the women who were pretending rather convincingly to be raped and harassed) to get back into their places, as if they were supposed to be standing still. The action became a way for the still image to fall into place on a more real level than could be composed (a testament to Godard's philosophies). So there you have it, another piece of writing about ambitious men who wanted to make their mark on civilization (and if you pay attention to the gender relations in this movie, this is appropriate to mention). There's a lot of pressure out their for the ambitious man, and he is extremely sensitive. It's a tiring job for people who are more interested in theory than something more tangible (medium over message). And so they deal in epics and ambiguity. Godard, intent on advancing the medium of film is torn between writing stories and making abstractions that somehow incorporate characters. His answer, make a film about a filmmaker, making a film with master paintings in it. In the end, he creates a crypt filled so much with briefly explored theories (which may be too much to really comprehend) that it essentially becomes meaningless. Let's face it, Godard's Passion is a puzzle, and Delacroix's The Entry of the Crusaders into Constantinople is a puzzle with historical information behind it. I'd have to say that watching Godard's Passion was like being spoon-fed personal beliefs; not a work, but his philosophy. But, I liked it. As an artist, it is liberating to think of what Godard proposed with his reenactment of the invasion of Constantinople. Maybe if I get into the right groove, my work will somehow form out of a rehashing of my experiences, and I can make my experiences as exciting as a reenactment of The Entry of the Crusaders into Constantinople.",
         "If one were to hold up a camera to life and to film for ninety minutes, the result would be, more than likely, a boring snapshot of the banal and mundane. These snapshots of life would have no narrative, would be disjointed and chaotic, for such is life. Godard's Passion struck me as just that, a snapshot of the banality of life, the disconnected, seemingly meaningless misadventures of ordinary people, captured in one moment of time. But of course, these are not ordinary people in ordinary circumstances, these are the creations of Godard's imagination, yet the presentation of the content of the film is without structure, narrative or any of the Hollywood conventions of 'good filmmaking'. I found the film compelling and intriguing; I wanted to know more about the people and the universe that they populated. The lack of narrative structure was not a negative factor in my enjoyment of the film, for the anarchic content was, of itself, enough to keep my mind from wandering away from it. Godard's reflexive jibes at cinema convention were acerbic and witty, carrying with them a tremendous knowledge of the mechanics of filmmaking. The story of Passion, what story there is, is subservient to the process of filmmaking and Godard's desire to subvert it. For me, that is what makes this film so entertaining. The influence of Godard's work on other filmmakers is probably most profound in European cinema where the role of the Auteur is, if not quite nurtured, respected. It was a delightful surprise for me when, having seen Passion, I began to draw connections between Godard's storytelling and popular TV comedy. The First Series of the BBC comedy 'The Office', by Ricky Gervais and Stephen Merchant, leapt to mind as I mulled over Passion. The non-structure of Passion is very much evident in The Office, where the stories unfold as snapshots and moments in time, captured, and heavily influenced by the presence of the cameras. The Office is probably the most original piece of TV comedy since Monty Python's Flying Circus, yet I can see the influence of filmmakers like Godard in its presentation. Although there exists an A plot, B plot and guest plots, typical TV structure, in The Office, it is the presentation that makes all the difference. If handled in a more traditional fashion, it is highly unlikely that The Office would ever have been made, never mind popular. Even the origins of The Office pay homage to the anti-structural approach of filmmakers like Godard. Conceived and performed as an adlib piece on a BBC director's course by Gervais and Merchant, it shined with originality and a deep knowledge of and healthy disrespect for, convention; much like Godard really. The success of The Office owes much to its originality and wit but also to the possibility that the audience is searching for a new experience in terms of storytelling both on television and film. The irony is that this type of storytelling has been with us since Godard and long before Godard. Perhaps the audience has finally caught up with the filmmakers.",
         "Have you ever watched a movie and been aware of how much your emotions are being manipulated? Your buttons being pushed? Just before I watched this film, I'd seen neuroscientist Susan Greenfield say how modern media encourages a sequence she calls arousal-addiction-reward. And stimulating that mental pathway releases dopamine, which inhibits the part of the brain associated evaluating social behaviour, planning complex cognitive behaviour, personality expression, and decision making. Most films are designed to produce emotional response. We are aroused (for instance) by the plight of the leading lady, addicted to the drama long enough to see what happens, and then suitably rewarded when she marries and lives happily ever after. Not only have we been told what to feel, but our critical thinking is subjugated into passive viewing. Unbiased appraisal of hypothetical outcomes is largely overridden by dominant subtexts. Critical thinking off: mainstream message on. Godard claims he makes films to invite audiences to think, not to feel. The complex concept and metaphor (rather than adrenalin-filled) stories, can at first seem boring. Lacking in formal narrative, they flop at the box office, yet go on to critical acclaim and canonical status. Passion examines this discrepancy between a film as a piece of art versus the demands of commercial cinema. Passion is a film within a film. Jerzy, a Polish filmmaker in western Europe, is re-creating tableaux vivants - masterpieces by Goya, Rembrandt, El Greco, Ingres and Delacroix. Tableaux vivants were a popular 19th century pre-cinema entertainment (described, for instance, in Sontag's novel, The Volcano Lover). Actors don't speak or move, and Jerzy is obsessing over light and shade while making up scenarios on the fly. His aesthetically ambitious film is two billion francs over budget. Money is needed. Meanwhile backers harangue Jerzy over his lack of storyline. The filmmakers occasionally go to a nearby hotel and factory to find extras. Jerzy seduces both the factory owner's wife and a worker, Isabelle (Isabelle Huppert), who has been laid off and wants her money. They are attracted to the artistic environment, finding an aesthetisized mirror of their daily life. Squabbles off-set seem to be echoed in set pieces (for instance, where a Crusader carries off a half-clad maiden). The idea is voiced that work and love share the same movements, underlined with typical Godardian 'food for thought' such as, \"One has to work on loving or love working.\" With painting, image takes precedence over movement. The viewer supplies movement, or 'narrative,' by imagining a backstory or the painting's creation. With film, movement takes precedence over image. Brechtian techniques can be used to jolt audiences into awareness of stillness, or a concept contained in the film, allowing us to approach it from different angles much as we would a sculpture. Some techniques here used by Godard include extended L-cuts: we hear one woman talking but the camera is on another woman who is talking at the same speed, her voice muted (symbolically unheard). We watch an actress as she watches herself: on a video monitor, where she is struggling to lip-synch an operatic aria. That the film mirrors the film within the film, and also its own making, focuses our attention on the idea of what we are watching rather than the visual spectacle itself. Godard breaks down the barrier between documentary and fiction: \"It's not a lie but, rather something imagined, not the exact truth, nor the opposite of truth. It's set apart from the real as it appears by the thoroughly calculated approximations of verisimilitude.\" In making his Passion (the word can be taken in all three senses), Godard, like Jerzy, experienced resistance from actors because action is organised around images rather than a script. He created scenarios on a day-to-day basis as the film was being shot. For non-Godard fans, Passion is less hard work than his most abstruse work, but still takes effort to figure out what is happening rather than dismiss it as meaningless self-indulgence (which on casual viewing would be very easy to do). Once that investment has been made, it contains not only considerable satire, but enough material to engender repeat viewing. Although there are some political overtones, they are more in the background than with his earlier work. The film can also be admired for sheer exquisiteness, attention to detail, and perfect lighting in its re-creation of famous paintings. Amidst the mayhem of the studio and the baring of the director's soul, the young woman dancing clumsily around with a robe falling off, the young girl told to lie naked in the pool as a star-shape, or the cherub with a pointing finger \u0096 all are transformed into images of utter beauty. Godard's rendering of Rembrandt's Nightwatch is uncanny to anyone familiar with the painting. Goya's Nude Maja closely resembles Godard's live copy. The characters in Godard's version of Ingres' Small Bather might be inexact, but a comparison draws attention to the perfectly reproduced luminescence of the woman's skin \u0096 an effect achieved by perfect lighting \u0096 lighting that makes the human image semi-divine. \"An image is not powerful because it's brutal or eerie,\" muses Jerzy, \"but because the solidarity between ideas is distant and just.\" Passion is an outpouring of the creative process, inspired, according to Godard, by Titan's Bacchus and Ariadne. Together with First Name Carmen and Slow Motion, it is is one of three films by Godard showing directors struggling with 'impossible' projects. I sometimes find Godard almost spoils me for conventional cinema. Like one of his characters, I find myself muttering, \"Don't push my buttons! OK?\"",
         "My theory is this: you have to watch this film after midnight, after all the cares of the day are forgotten (the phone call you forgot to make, the stuff you didn't pick up at the store) and you can relax completely. Just let the scenes unspool before you, the beautiful images wash over you. Godard has made a kind of masterpiece, under trying circumstances--he wanted Vittorio Storaro as DP, and had to call in Coutard, with whom he was no longer friendly--and his efforts were not crowned with commercial success; the picture was a flop. Jerzy's character is fascinating; he seems to take inertia to new heights. Imagine refusing to shoot because the lighting is wrong. Fritz Lang (and Godard himself, of course) would never have used that silly excuse: they would have worked around any problems on the set. Miss Lucachevski, the tall and very elegant script-girl, says that she is tired of working on a production that produces nothing and we can feel her frustration. Jerzy asks her to read a passage from Les Miserables about Enjolras's passion, then he makes the bloodless remark about bloodless times I've used in the summary. Radziwilowicz is a pudding-faced actor who shows us little of what he's feeling. Hanna Schygulla on the other hand is extraordinarily animated and focused as the uneasy female angle of the triangle with Michel and Jerzy. She is photographed better here than Fassbinder managed to shoot her in his films. MacCabe's book on Godard tells how she came to work one day after a night of excess and Godard insisted on shooting her with every wrinkle lovingly recorded. Whatever, she is gorgeous, every bit as striking as Anna Karina, or even Jane Fonda, to name two of Godard's leading ladies. The enactments of the paintings are ravishing, worth the price of the video in themselves. Myriem Roussel posing on the pool deck for the Ingres Bather is stunning, the entry of the crusaders into Jerusalem will delight you. A knockout.",
         "Very little in this film can honestly be said to grab the attention for long, unless perhaps, you are a Godard completest. An art historian might appreciate the messages hidden within the old master painting being turned into a movie by the director at the centre of the piece. For the rest of us it's hard to follow threads of the various partially connected stories in which largely unappealing characters bicker, berate and bed one another. Jerzy a Polish movie director, has literally 'lost the light' in his big budget production. His efforts are hamstrung by news of Solidarity's emergent uprising in his native land, the financial demands of his producers and his involvement with two women : the owner of the hotel in which most of his film company lodge, and a dowdy sacked worker at her husbands factory. That's pretty well it. There's not much more. The images of the old masters Jerzy is attempting to turn into a film, although he seems to have little concept of exactly how, are nicely lit but the films exteriors around the promising location of Lake Geneva are drab, the interiors even worse and despite some big names among the cast there is little charisma in evidence. I've watched it twice and sadly 'Passion', an oddly inappropriate title in itself, made no more impression on the second viewing. The Godard of 'Pierrot Le Fou' (a film I loved) seems a long way from the Godard of 'Passion'. Other reviewers have clearly found a meaning and beauty that I have missed. But hey! If it floats your boat then thats good.",
         "Passion was the kind of Jean-Luc Godard picture I would watch rather late at night, ironically enough, thinking of it and other works of his like digging into a good book as something fulfilling before conking out. There are things that make this effort quite reccomendable, albeit I'm not sure how I would react to it overall if seen again in the context of a sunny day and some more concentration going on. What remains striking, even when Godard was at his most slumming-it points in the 80s (and he had quite a few) are the images as done by a master of the camera. The opening shot is one of these, with the airplane far off in the sky letting out its white line of smoke, photographed to a classical composition playing in the background. It has a feel of the documentary, but the push of something more operatic in the meaning behind the image. This could go for what is most significant about the rest of the film, where- per usual as one of Godard's most love-hate subjects- cinema itself is dissected though what could be more like abstract documentary figures as characters. The one asset to a film like Passion, at least in comparison to other works at this period for the filmmaker, is that there is at least something of a story going on, something that doesn't shut out a viewer entirely by the banality of overused semantics and images that end up evoking a disinterest in the distance of subject to viewer. There's even a couple of conversations one sees from time to time with the characters that go towards at least coherent and at best with a good edge at the struggles of film-making and the hassles of love, or half-hearted lust. The only problem then comes with some of this just being so experimental that it ends up closing off some viewers. I remember one segment that had the inklings of being a compelling scene, where Godard shows the filming within the filming (if it is that, maybe it isn't) of a period piece being filmed. There's many faces and narration going over each face and image, but one's attention (at least mine anyway) waxed and waned. This may or may not be Godard's fault; in fact, one of the points that Godard has in his main filmmaker character having to make a film on TV is how mixed forms of media can be sort of antithetical. But to say that there are more than a couple of scenes and moments that foreshadow Godard's decent into pure (un-captivating) self-indulgence in his later years is present, even amid the nudity and classical music.",
         "This is a good introduction to late-period Godard: all (ideological) passion spent, Oncle Jean is just going to show us a good time. Pretty girls lolling around the pool naked, glamourous stars like Hanna Schygulla with little to do, Isabelle Huppert when she could still play dewy-eyed ingenues, a ridiculous peplum being filmed by greedy, unscrupulous types (the director should have been played by Jacques Dutronc instead of that dour Polish actor). It's 1982,these are the Thatcher-Reagan years, nobody thinks about Vietnam or the Palestinians or civil wars in Africa--people only want to make money. Godard gives us hip product-placement, Rembrandt, Caravaggio, Mozart instead of Coke or Pepsi.",
         "Despite the idiocy of the last comment there is an awful lot to be loved about Passion. The almost overstyled interiors of the studio set, complete with Painting Concrete (if you will) while the director and producer wander about discussing exactly how much per day it costs. Love it! The narrative (yes it is there, just let your mind wander) is simple and familiar, the in jokes are hilarious, and the atmosphere, especially at the end scene with the ship in the forest is, at times, breath taking. Yes it is dis-continuous, it is a film by JEAN-LUC GODARD! What do you expect. If you hate him, you'll hate this, if you love him, then this is destined to be one of your favourite JLG films (if you like his \"mature\" style that is).",
         "This beautiful film takes me into my childhood fantasy world. The colours are beautiful, the dynamics is nocturnal, the people dance a ballet all the time, the sound has a life of its own... It's not just a motion picture, it's a motion painting. What a shame it hasn't been issued on DVD yet."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Sara Films",
         "Sonimage",
         "Films A2"
      ],
      "summaries": ["On a movie set, in a factory, and at a hotel, Godard explores the nature of work, love and film making. While Solidarity takes on the Polish government, a Polish film director, Jerzy, is stuck in France making a film for TV. He's over budget and uninspired; the film, called \"Passion,\" seems static and bloodless. Hanna owns the hotel where the film crew stays. She lives with Michel, who runs a factory where he's fired Isabelle, a floor worker. Hanna and Isabelle are drawn to Jerzy, hotel maids quit to be movie extras, people ask Jerzy where the story is in his film, women disrobe, extras grope each other off camera, and Jerzy wonders why there must always be a story."],
      "budget": 0
   },
   "movielensId": 6113,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1982-05-26",
      "dvdReleaseDate": null,
      "directors": ["Jean-Luc Godard"],
      "runtime": 87,
      "movieId": 6113,
      "title": "Godard's Passion",
      "mpaa": null,
      "actors": [
         "Isabelle Huppert",
         "Hanna Schygulla",
         "Michel Piccoli",
         "László Szabó",
         "Jerzy Radziwiłowicz",
         "Myriem Roussel"
      ],
      "imdbMovieId": "0084481",
      "originalTitle": "Passion",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "While shooting a film, the director becomes interested in the unfolding struggle of a young factory worker that has been laid off by a boss who did not like her union activities.",
      "tmdbMovieId": 32692,
      "avgRating": 3.18605,
      "releaseYear": "1982",
      "numRatings": 43,
      "posterPath": "/hQ1zhDRbuNkN63eWTSKuHLKM6gs.jpg"
   }
}