{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1091751",
      "video": false,
      "title": "The Longshots",
      "recommendations": [
         59711,
         369060,
         332936,
         9925,
         42217,
         20927,
         38560,
         122987,
         58028,
         32007,
         26352,
         27342,
         14809,
         6277,
         10416,
         15513,
         15313,
         26486,
         54613,
         35059
      ],
      "backdrop_path": "/kXQOWS6RV1b7JsuBqn64RozqgYQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Curtis Plummer",
               "gender": 2,
               "credit_id": "52fe457d9251416c7505844f",
               "name": "Ice Cube",
               "profile_path": "/dzdn1tyWkC4EjlBVKvpAhg5osYA.jpg",
               "id": 9778,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jasmine",
               "gender": 1,
               "credit_id": "52fe457d9251416c75058453",
               "name": "Keke Palmer",
               "profile_path": "/tj3fxH0LtMVpj9fX8kj4kDSSkRu.jpg",
               "id": 74688,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Claire Plummer",
               "gender": 1,
               "credit_id": "52fe457d9251416c75058457",
               "name": "Tasha Smith",
               "profile_path": "/2Hnsk7ukDdrOPcT2lwlfW7RDJmx.jpg",
               "id": 74610,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ronnie",
               "gender": 1,
               "credit_id": "570e14a892514124e3001b1c",
               "name": "Jill Marie Jones",
               "profile_path": "/qIbdulbqSMeFZRKQFTo1O7cMcxd.jpg",
               "id": 98399,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Cyrus",
               "gender": 2,
               "credit_id": "570e14b3c3a3680a3b001e1e",
               "name": "Dash Mihok",
               "profile_path": "/jnruNUJv57nNtO66SR3oJ5tQuM5.jpg",
               "id": 6066,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Coach Fisher",
               "gender": 2,
               "credit_id": "570e14c69251417351000e7f",
               "name": "Matt Craven",
               "profile_path": "/atUkssC0DowpBbFvsnRf92cEf9y.jpg",
               "id": 13525,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Winston",
               "gender": 2,
               "credit_id": "570e14d2c3a3680a33001de3",
               "name": "Glenn Plummer",
               "profile_path": "/esZnjqw2WRA7zaX8SbJKGMp1xBg.jpg",
               "id": 2683,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Reverend Pratt",
               "gender": 2,
               "credit_id": "570e15109251410ce8000b67",
               "name": "Garrett Morris",
               "profile_path": "/2Sd1njRdKzWEHNY2AqFZGTv1xtT.jpg",
               "id": 83187,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Damon",
               "gender": 0,
               "credit_id": "570e151c9251417351000e86",
               "name": "Miles Chandler",
               "profile_path": null,
               "id": 1605092,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Tammy",
               "gender": 1,
               "credit_id": "570e1543c3a3680a39001dc8",
               "name": "Chloe Bridges",
               "profile_path": "/7j9F8UbqAaosPLd7p2bk51Swa72.jpg",
               "id": 98272,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Popular Girl",
               "gender": 1,
               "credit_id": "570e154fc3a3680a3f001b58",
               "name": "Debby Ryan",
               "profile_path": "/bGLpPeIyYd4HN3QLusrK8l0ZVnZ.jpg",
               "id": 123846,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Roy",
               "gender": 2,
               "credit_id": "570e158e9251417351000e96",
               "name": "Malcolm Goodwin",
               "profile_path": "/igRMW5VUmv52D6wsD03s08oRWHT.jpg",
               "id": 57997,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Ennis",
               "gender": 2,
               "credit_id": "570e15999251417351000e99",
               "name": "Michael Colyar",
               "profile_path": "/jPN2lqH5TaxUnsORwY430aFO5YQ.jpg",
               "id": 54430,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Karl",
               "gender": 2,
               "credit_id": "570e15abc3a3680a35001daf",
               "name": "Earthquake",
               "profile_path": "/3ToxkHIIdajbg3ccNVUSTop9BPl.jpg",
               "id": 60277,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Edgar Mejavar",
               "gender": 0,
               "credit_id": "570e15b6c3a3680a39001ddc",
               "name": "Hugo Perez",
               "profile_path": null,
               "id": 54765,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Jonesy",
               "gender": 2,
               "credit_id": "57df65ca9251413d7400c31b",
               "name": "Caleb Landry Jones",
               "profile_path": "/a5RwSg8YN9JW0VZqekIbiJlLVhJ.jpg",
               "id": 572541,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Javy Hall",
               "gender": 2,
               "credit_id": "5987fd0192514153c801772f",
               "name": "Kofi Siriboe",
               "profile_path": "/4qxcHkPIMUMZCW7UNH9kIfRndgS.jpg",
               "id": 1451543,
               "order": 16
            },
            {
               "cast_id": 17,
               "character": "News Reporter",
               "gender": 0,
               "credit_id": "570e15d192514102c7000e1d",
               "name": "Zorianna Kit",
               "profile_path": null,
               "id": 90721,
               "order": 17
            },
            {
               "cast_id": 18,
               "character": "Girl #1",
               "gender": 1,
               "credit_id": "570e15e1c3a3680a35001db6",
               "name": "Sophia Taylor Ali",
               "profile_path": "/msqG0Pn3dDdME6GPuPLqVV1pQDl.jpg",
               "id": 1163789,
               "order": 18
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe457d9251416c7505845d",
            "name": "Fred Durst",
            "profile_path": "/1BByU9VNLiqbFQGJGn5dEZtDqCf.jpg",
            "id": 29783,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.835788,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13579,
      "vote_count": 12,
      "budget": 0,
      "overview": "The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history.",
      "similar": [],
      "original_title": "The Longshots",
      "runtime": 94,
      "poster_path": "/7m2uq8Is8nOfq4GKAUOPqddiSGd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/r94SalgVn6WyQBcehzX9hmInzGP.png",
         "name": "Cube Vision",
         "id": 2780,
         "origin_country": ""
      }],
      "release_date": "2008-08-22",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fred Durst"],
      "runtime": 94,
      "synopsis": "Based on a true story, Curtis Plummer (Ice Cube) is a down-on-his-luck former high school football star that turns his niece, Jasmine (Keke Palmer), into the quarterback of the local team, the Minden Browns. He gets his stride back when he becomes the team's coach after the current coach (Matt Craven) becomes ill. With Curtis as their new leader and their pigtail-wearing star player at QB, this team of misfits wins its way to the Pop Warner Super Bowl and the small city of Minden, Illinois is ignited with team spirit, town pride and glory. Becoming the first female to lead her team to the Pop Warner Super Bowl does not come without conflict. Along with the struggles of being accepted by her all male teamates, her deadbeat father re-appears when he sees his daughter starting to appear on the local & national news. She struggles with wanting her father to be a part of her life, but will soon find out that her uncle is the one who truly cares about her and is committed to being there when she most needs a father figure and best friend. She not only looks up to her uncle, but honors him by wearing his old jersey number, #11.",
      "writers": ["Nick Santora"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1091751/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5NDMwODQ3MF5BMl5BanBnXkFtZTcwNTA1NDc4MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ice Cube, Keke Palmer, Tasha Smith | See full cast and crew »"],
      "reviews": [
         "I know that this movie is getting a lot of hate, but I still wanted to check out The Longshots, once again, this is a movie that I am just baffled by all the hate. I thought this movie was actually decent and watchable, I know that the main reason why this movie is getting the bad reviews from IMDb users is because of Fred Durst, not to mention that everyone seems to hate Ice Cube's career choices. But honestly, this movie was inspiring and uplifting, there wasn't any harm done in this movie and it was different from other sport movies. We are used to the underdog usually being a guy in these movies, it's because of race, money, looks, or mental disabilities, for once we have a movie about the pressures of being a girl who is into sports who also enjoys being a girlie girl as well. The Longshots is also fun to watch and doesn't fall flat or becomes predictable like most sports movies. Jasmine Plummer is a loner at her school, always having her head in a book, her mother works long hours and her father abandoned them. Her mom asks Curtis, Jasmine's father's brother, to babysit her after school while she's working, Curtis complains all the way and even has to be paid to do the job. But when Curtis plays ball with the town minister, he discovers that Jasmine has quite an arm and makes her try out for the football team while he trains her. Jasmine takes back the team's loosing streak and she and Curtis start to finally love each other. The Longshots isn't movie of the year and it's not the best sports movie either, but I thought it was a decent movie to watch. Like I said, it's different and I thought for what everyone was expecting, Fred Durst did a good job of directing and Ice Cube is a lovable character that makes a great role model. I would recommend The Longshots for a matinée or a rental, don't take the IMDb rating so seriously, because I think it's just one of those hater's issues where the people who think it's going to be bad automatically just vote 1 without seeing it. So give this movie a fair chance, it's a good family movie to watch. 6/10",
         "this was an interesting family film,and for the most part it was well done.It was decent,no bad language,so it was great for all to see. I think it was obvious that it was all males behind the scenes ,perhaps it would have had a better solid feel to it ,if it would have had a woman director?Just a thought. Some of the scenes felt off.As a female athlete who once played football,it seemed somewhat off, but overall the acting was good,and at times very funny. The development of the relationship between the uncle and niece was actually pretty well done.Overall a good sports movie,about looking at what we have and not at what we don't have.",
         "A very good movie, Long shots is based on a true story of a run down town and a young lady that achieves confidence on the football field. Against all odds, the town as well as the girl learn to achieve simply by watching the girl overcome obstacles on the football field. This movie is good for all ages to see due to it is positive and it shows that anything can be done if you put the proper effort into it. The movie displays decent acting, humor and drama. Ice Cube, Keke Palmer, Tasha Smith, Jill Marie Jones, Dash Mihok did good work. The acting is very nice, Ice Cube, yes, (I've enjoyed his acting since the Boyz N the Hood days), Keke Palmer very believable as a tall misfit Jasmine Plummer, and the supporting cast. There's even a cool cameo by Garrett Morris (Saturday Night Live fame of the Chevy Chase / Steve Martin era). You won't be disappointed with watching this film.",
         "My entire family enjoyed The Longshots, based on the true story of an eleven year old girl who played quarterback on a Pop Warner football team. The movie makes no pretense of being the world's greatest sport movie. It is however an inspiring, wholesome story. Both Ice Cube and Kiki Palmer are excellent in this movie. As the parent of two children of color, I appreciated the fact that even though the lead characters are African American and many of the other characters are White, race was not an issue in this story. Both my 11 year old daughter and 13 year old son (who is a quarterback) enjoyed the movie without feeling preached to. The Longshots is especially appropriate for that age range. The Longshots might have a fairly narrow audience. It is not for young children, and is probably not exciting enough for older teenagers and many adults. The situations are not over dramatized to increase the tension in the story. The Longshots is an inspiring film that especially should be seen by pre-teen girls and their families.",
         "In brief Longshots is the classic underdog story but with a few twists. Not only do we have a young,struggling,American rugby team we also have the struggle of a young girl trying to earn respect and gain a place in this young,struggling,American rugby team. People may think they have seen hundreds of these types of films before, Mighty Duck's (the ice hockey one with Billy the Kid as the head coach) and Little Giant's (the American rugby one with Louis Tully as the head coach) to name two off the top of my head. Longshots however is a different breed of animal.The powerhouse performance of Ice Cube accompanied with the fantastic direction of Fred Durst makes this film a must see. Ice Cube plays Curtis Plummer, a down and out with little in his life except American football and alcohol. He has a distant relationship with his niece, Jasmine Plummer, until fate brings them closer together. It is at this point that Curtis Plummer realises his young niece has a talent for throwing a Rugby ball a long way very accurately!. Without spoiling the rest of the film Ice Cube basically becomes a Yoda figure to Jasmine Plummer and trains her in the art of throwing a Rugby ball without going to the dark side (Laces out Dan!). This film goes on to teach us a valuable life lesson. In one scene we have Curtis Plummer a smelling,dirty, down and out looking at the horrible state he has let himself become in a mirror. Whilst looking into this mirror and deep into his own heart does Curtis decide to change his ways? become a better uncle to Jasmine? become a role model to all those other down and outs around him? NO!!! he simply changes his shirt and puts on a bowler-esquire type hat. The message this gives to the young generation out there is that a small change can be all that is needed in life. After raving about this film you may wonder why i did not give this film 10 stars. Well my only niggle with The Longshots is the soundtrack. Instead of the kids winning their first American rugby game and a mediocre run of the mill instrumental accompanying the scene why not add Ice Cubes own masterpiece Roll All Day to make this a truly epic scene and epic film! For this film to be at a meager 2.7 on IMDb is a utter disgrace. What Durst,Cube and Cube vision have created is a minor miracle. GO BUY IT!",
         "Ice Cube stars in the inspiring and very well done (by Fred Durst of Limp Bizkit?) of the first girl to quarterback a team in the Pop Warner Championship game. Yes its by the numbers and yes you kind of almost (though not quite) know how its going to come out, but at he same time Ice Cube and the rest of the cast sell the cliché and you really don't mind watching. High art? Hardly, but a good little film that is surprisingly better than the dozen or so similar films from the last couple of years (and trust me I think I've seen most of them and suffered through the uninspiring lot of them. Worth a look on cable if nothing else.",
         "This movie doesn't do anything new. And yes,it is full of clichés. Who cares! People who love the genre will watch it anyways. This movie does what it aims for. And that is make you feel good. Nothing more nothing less. My only complaint is that it could have used more jokes. Keke Palmer as Jasmine is the first woman to take part in The Pop Warner Football Tournament. Surely they could have come up with more scenes to exploit this. Or at least show her struggle before being accepted as a team member of all boys. I also would have loved to learn more about Jasmin Plummer (Does she still play football?). Overall this movie is adequate and certainly not as bad as the low rating suggests.",
         "I found this movie surprisingly satisfying and would recommend it over most family films with much higher budgets. It deals with important developmental issues but has an engaging plot to carry it along. My 8-year old daughter saw both \"The Longshots\" and \"Wall-E\" on the same weekend and said she enjoyed \"Longshots\" more! I am always encouraged when small-budget movies hold their own against the big, hyped Hollywood movies. Ice-Cube did a good job with the central role and the other supporting actors were fine as well. Keke Palmer's limited acting range holds back the film a little bit but she is still a compelling character. The film's plot is fairly predictable but there is a couple of non-standard turns that add some complexity to a story line that has been told before. Yes, all the central characters are African-American but the issues are not unique to that community. Most children of any ethnicity should relate to the interpersonal issues. Best I can tell, the PG-13 comes from a frank portrayal of alcohol use and a couple of anatomical jokes. The jokes would be pretty standard fair on network TV. Unless you are very sensitive to this sort of thing, I think the move would be appropriate for a child about 8 or 9 and above. Below that, most children might miss the social and developmental issues which make the movie most worthwhile, anyway. I used this movie as an opportunity to discuss with my child about some of the issues involved and it went really well. In summary, this won't be the most fantastic movie you've ever seen, but I think a lot of families will go away saying, \"That was better than I expected!\"",
         "The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history.It so amazing you should watch and read it! The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history.The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history.The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history.The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history.",
         "this movie tells the true story of an 11 yr old black girl who is the first girl ever to play on a Pop Warner football team, and she plays qb as well. Ice Cube does a great job in the film I thought, he plays an uncle who is taking care of his niece because the real dad is either in prison, or away somewhere not taking care of his child. the girl has to go thru many struggles to make it on the team, and at first she really doesn't like her uncle or even get along with him for that matter,, but he was a football player, so he decides one day to play catch with her,, and the two start throwing the football around, and he sees something in her that he used to have,, so he coaches her up and low and behold we got the girl trying out for the football team.. great family movie and should not be missed."
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Drama",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Cube Vision",
         "Dimension Films"
      ],
      "summaries": ["The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history."],
      "budget": 23000000
   },
   "movielensId": 61253,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-08-22",
      "dvdReleaseDate": "2008-12-02",
      "directors": ["Fred Durst"],
      "runtime": 94,
      "movieId": 61253,
      "title": "The Longshots",
      "mpaa": "",
      "actors": [
         "Ice Cube",
         "Keke Palmer",
         "Tasha Smith",
         "Jill Marie Jones",
         "Dash Mihok",
         "Matt Craven",
         "Glenn Plummer",
         "Garrett Morris",
         "Miles Chandler",
         "Chloe Bridges",
         "Debby Ryan",
         "Malcolm Goodwin",
         "Michael Colyar",
         "Earthquake",
         "Hugo Perez",
         "Caleb Landry Jones",
         "Kofi Siriboe",
         "Zorianna Kit",
         "Sophia Taylor Ali"
      ],
      "imdbMovieId": "1091751",
      "originalTitle": "The Longshots",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["0ls_1-UQVO4"],
      "plotSummary": "The true story of Jasmine Plummer who, at the age of eleven, became the first female to play in Pop Warner football tournament in its 56-year history.",
      "tmdbMovieId": 13579,
      "avgRating": 3.18,
      "releaseYear": "2008",
      "numRatings": 25,
      "posterPath": "/7m2uq8Is8nOfq4GKAUOPqddiSGd.jpg"
   }
}