{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0196708",
      "video": false,
      "title": "Lockdown",
      "recommendations": [
         13202,
         254143,
         86980
      ],
      "backdrop_path": "/n2QwF6qSs3HH4p0os2MpUicMdoQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cashmere",
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f8147721",
               "name": "Gabriel Casseus",
               "profile_path": "/hq47yaZk40VSv0rbdtrrj5J5zzL.jpg",
               "id": 18272,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dre",
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f8147725",
               "name": "De'Aundre Bonds",
               "profile_path": "/3zCQRZ6bkUNA9JKW6CDpjz1whrK.jpg",
               "id": 93538,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Clean up",
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f8147729",
               "name": "Master P",
               "profile_path": "/crshi8WF4eXvaumY5CLmPoTyMFB.jpg",
               "id": 65164,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Krista",
               "gender": 1,
               "credit_id": "52fe47c6c3a36847f814772d",
               "name": "Melissa De Sousa",
               "profile_path": "/imkxqOQjJuZqT64vWSUzTFSktBN.jpg",
               "id": 75696,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Malachi Young",
               "gender": 2,
               "credit_id": "52fe47c6c3a36847f8147731",
               "name": "Clifton Powell",
               "profile_path": "/hBw76xJtCwKS2v5rZtzDBqvKLN6.jpg",
               "id": 58924,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Marisa",
               "gender": 0,
               "credit_id": "566b4837c3a368535a0056bf",
               "name": "Paulette Braxton",
               "profile_path": "/7dhyAlgLud5sAGtEN0Wub5Z5Sug.jpg",
               "id": 1547870,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Avery Montgomery",
               "gender": 2,
               "credit_id": "56b0d689c3a3686213000250",
               "name": "Richard T. Jones",
               "profile_path": "/ccELAB9yHvG4OxG8dURdUXznwJ8.jpg",
               "id": 55755,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dana",
               "gender": 1,
               "credit_id": "56b0d6dac3a368620900029e",
               "name": "Chrystale Wilson",
               "profile_path": "/nkil2lcV1ViVW3kaJQPNtS6KIbj.jpg",
               "id": 582888,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47c6c3a36847f8147737",
            "name": "John Luessenhop",
            "profile_path": "/HI2jnUyVBZu2xYOohzjM4nB8XQ.jpg",
            "id": 97026,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.369247,
      "production_countries": [],
      "id": 50380,
      "vote_count": 15,
      "budget": 0,
      "overview": "Avery (Jones) returns to college as a competitive swimmer after getting his life back on track. But his life takes another unexpected turn when he and his two friends (Bonds, Casseus) are wrongly accused of murder and end up in prison.",
      "similar": [],
      "original_title": "Lockdown",
      "runtime": 105,
      "poster_path": "/5i2aVGMXrIAX5iq5WmohmPFIfpL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-09-15",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Luessenhop"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Preston A. Whitmore II"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0196708/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2Njc1MzE2Nl5BMl5BanBnXkFtZTYwMjM3MTg5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard T. Jones, De'aundre Bonds, Gabriel Casseus | See full cast and crew »"],
      "reviews": [
         "Yes, this is a brutal film. It's scary to us who are not criminals or have not been around these types for any length of time. Since I am a fan of HBO's \"OZ,\" I felt that I'd partake in this much talked about flick. I ordered the DVD and I'm pleased to have it in my collection, mainly because it introduced me to a couple of really good actors. Bill Nunn, as Charles, the college scout, I've seen for years on TV and in the movies. Richard T. Jones was new to me. If he is going to be a star, he shouldn't do what Sidney Poitier did: ignore his own lighting. The star MUST always be lit correctly, especially if he is darker skinned. Mr. Jones is a good-looking leading man type and he should \"tend to his business\" and make sure HE looks good on that screen. \"Lockdown\" is an okay movie. Gabriel Casseus as Cashmere was appropriately ignorant and vacuous. His \"don't care\" attitude is pervasive in poor neighborhoods where people feel helpless and hopeless in America. It was not surprising that he, a drug dealer, with a violent demeanor ended up in jail and adapted easily to that macabre world behind bars. Of course it was different for Dre (De'Aundre Bonds) as the sensitive brother of Jones' girlfriend, Krista (Melissa De Sousa). Dre is not gay, but his good looks scream \"woman\" to brutes behind bars. He is viciously raped by two Aryan thugs the first day he arrives in the big house. He is immediately frightened into becoming Graffiti's \"bitch,\" sexually available at \"his man's\" will. Graffiti (David \"Shark\" Fralick) is a muscular and insane drug dealer who is in competition with the head black dealer, Clean Up (played by rapper, Master P) who is a psychotic, disgusting character who would kill you for a nickle, no problem. His speech is as brutal as the part he portrays. The movie is about survival, and that is what Avery (Jones) has to do, if he wants any kind of life and future. Yes, the characters are sterotypical, but aren't they always in this kind of vehicle? The sex was played down in this, as it is in all American-made prison films. Americans are very squemish about man/man sex and DO NOT want to see it on the screen. Two woman. That's okay. When are we going to grow up? If you liked \"OZ\" you might like this. But be prepared. It's not an easy watch.",
         "Many references to HBO's Oz have been made about this movie. The two are similar, but the gangs focused on here are limited to the Blacks and Aryans. The colorful actors are convincing in their roles. Master P comes across as a worthy heavy. Craig T. Jones provides the great contrast of clean cut protagonist. With a plethera of unwatchable exploitive black urban videos, Lockdown is a high quality cut above.",
         "If you like 'Oz' you'll enjoy this movie.Predominately a African American cast,this is one of those movies white america will not embrace,and because of that it will get undeserved negative criticism.If you've been behind bars,you will relate and love this movie more than the average person.But even if you haven't been in the pen,this flic is entertaining with some real scenes that depict life when your freedom is taken away. ****/5.",
         "Lockdown is a Low class Prison Movie that Entertains Big time. I enjoy watching Black Crime movies and like Prison Movies. I saw the cover of Lockdown and did'nt expect much. I still rented it out, since i had nothing else to watch. Surprisingly, the movie was very good with just a few bad scenes. If you enjoy watching Prison Break and like brutal prison movies, then this is a good choice. The movie shows some disturbing, brutal and harsh realities of American Prison life. It focuses on three friends who get arrested in suspection of murder. One of the friends, stupidly shoots at the police, which is why they get arrested. The acting ain't so professional, with not so popular actors and rappers in main roles. The storyline and direction was however very impressive. For all fans of this genre, i know there have been some crap movie with rappers in recent times, but this is worth the watch.",
         "Lockdown is a great movie. Sad but real. Lockdown is a story about an aspiring swimmer named Avery (Richard T Jones). One of his main goals in life is to become a swimmer One night while he and his two friends Dre and Cashmere ( Gabriel Casseus, Deaundre Bonds) are driving in Cashmere's car they find a gun. The gun is linked to a fast food robbery earlier that night. The Police tracks them down and finds the gun on them. They all get sentenced for armed robbery and murder. Gabriel Casseus's performance of the hyper and thuggish Cashmere was brilliant. Bonds role of Dre was not bad, but it didn't live up like the roles of Richard T Jones and Gabriel Casseus. Master P is also great as Clean Up, the vicious inmate who has security guards working for him, his drugs being brought in and out of the prison a ho of a girlfriend who Cashmere gets a piece of, and he wants Cashmere to do his dirty work. The supporting cast was brilliant. Melissa De Sousa as Avery's girl Krista; Sticky Fingaz as Broadway the ex drug dealer turned inmate; Bill Nunn as Avery's scouter for college and his attorney; And Clifton Powell who was the OG of the prison, and I felt he should've had a longer part in the movie. Lockdown is Master P's best movie to date.",
         "Lockdown another film from ghetto cinema fanatic's No Limit Films is actually one of their best to come alone. The very talented and underrated Richard T. Jones plays Avery an aspiring swimmer who along with his boys Cashmere (Gabriel Casseus) and Dre (De'Aundre Bonds) get locked up for a crime they didn't commit. While in prison each of the boys follow a different path Avery ends by getting a valuable prison education from his Ralph Ellison-quoting cellmate Malachi (Clifton Powell), while Cashmere quickly becomes part of the African-American gang network operating under the leadership of Clean Up (Master P). Dre, meanwhile, meets the worst fate of the three, resorting to heroin after he's gang-raped by a group of Nazi thugs. Each of the three leads plays their roles with passion and the viewer feels what they are going through. Even Master P the king of ghetto method acting gives a good performance.",
         "OK so I just finished watching this movie, it was in the graveyard time slot, you know the after the \"box office hit\" movie they play that is usually crap but you still watch it because you can't sleep. At first I thought oh crud not another movie with rappers trying to act, but then it actually started to work for me. I think De'Aundre Bonds - Dre was perfect in his role, I was surprised how he showed the pain of what he was going through so convincingly with his eyes. I just wanted to get him away from all of it. I will also have to be a girl and say that Gabriel Casseus is gorgeous and a talented actor to boot. I was torn between liking his character and wanting to smack him in the head, which is definitely a good thing because in a lot of movies the characters are so clean cut, usually good or bad and thats that. I think that was the only thing about Avery - Richard T. Jones. He seemed to me to be a plain character, i.e. the good guy. You wanted him to get out and that was what one side of the plot was about. So to sum up I really was nicely surprised by this movie, there were a few inconsistencies but hey if you don't over analyze movies then you should be just fine.",
         "I was eager to see Lockdown as its a movie i quite simply missed in the past. Finally got around to grabbing it on DVD for cheap and it was certainly a good movie and I'm pleased to have it in the collection but being a huge fan of the old HBO Gritty Prison drama OZ and a fan of Prison Break this did definitely have its weaknesses. At times it dragged on and just didn't always have the full hard hitting grit i thought it would have. I did expect more from this movie. It was great to have a ghetto based prison movie as i have not seen one in a long time - the last one i saw was Prison Song with Q Tip (great film!) Lockdown gets a 7 out of 10 from me. A good watch but not enough gritty surprises it was quite predictable.",
         "Right - another prison flick. Another movie about a young black man, in this case 3 young black men, wrongly accused of a crime, convicted and sent to prison. The statement behind that injustice is bold enough. It's a bit \"Boyz n the Hood\" up to that point. Once it hits the prison - there are few comparisons to match some of the intensity (how's that for ambiguity?). This movie has a few valuable segments worth the rest of its deficits. A few scenes may take you to a place you do not want ever to be. There are moments in the prison scenes where the actors are so credible it might as well be real. The directing had flickers of greatness to capture that intensity. But just like that, in a flicker you're back to watching a $2 film worth a penny. Just watch it for the acting and directing behind a few prison scenes that fairly represent \"Lockdown\".",
         "I've always felt \"Escape from Alcatraz\" starring Mister Eastwood was the best PM ever made but this one is just as good though a much different story. Some black dudes in their early 20s are convicted of a crime even though only one of them did anything wrong. Anyway, they get sent up for 10 years or so and the movie follows their experiences. Lots of fighting and action and, bless his soul, the director allows no talk unless it pertains to the action. Solid ending. Lots of anti-white racism in the movie. The guards are all white and they are bastards and the white inmates are monsters. Graffiti, played by David Fralick, is really bad. Good-looking, super-fit guy and vicious as they come. Needless to say, the movie portrays prison life as ultra-violent but that's just Hollywood for you. It makes for a good movie but prison is mostly about boredom not violence. Hell - you've got guards and cameras everywhere; you can't get away with much in prison and real convicts know it."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Evolution Entertainment",
         "No Limit Films",
         "Palm Pictures"
      ],
      "summaries": [
         "Avery had to drop out of college to support his girlfriend Krista and their son Jordan, but he saved his money and is eager to get back in the game. He has returned to the swim meet circuit and is now having the time of his life. One night, after winning a race, he is approached by a college scout. Thrilled, he goes out with his friends Dre and Cashmere to celebrate. A gun used in a drive-by shooting somehow finds its way into Cashmere's car. The cops arrive, and soon the trio land in jail. Cashmere has an easier time adapting to penitentiary life than Dre and Avery, who are more unfamiliar with the gang life that pervades the environment. Avery clings to Krista and Jordan as reasons to hold on, but there is only one man who can, and will, fight on his behalf - Charles, his swimming scout, who believes in his innocence without question. Regardless of the outcome, Avery must learn to hold on to his ideals after the brutality he has witnessed.",
         "Avery (Jones) returns to college as a competitive swimmer after getting his life back on track. But his life takes another unexpected turn when he and his two friends (Bonds, Casseus) are wrongly accused of murder and end up in prison."
      ],
      "budget": 0
   },
   "movielensId": 6164,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-09-15",
      "dvdReleaseDate": "2003-04-29",
      "directors": ["John Luessenhop"],
      "runtime": 105,
      "movieId": 6164,
      "title": "Lockdown",
      "mpaa": null,
      "actors": [
         "Gabriel Casseus",
         "De'Aundre Bonds",
         "Master P",
         "Melissa De Sousa",
         "Clifton Powell",
         "Paulette Braxton",
         "Richard T. Jones",
         "Chrystale Wilson"
      ],
      "imdbMovieId": "0196708",
      "originalTitle": "Lockdown",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Avery (Jones) returns to college as a competitive swimmer after getting his life back on track. But his life takes another unexpected turn when he and his two friends (Bonds, Casseus) are wrongly accused of murder and end up in prison.",
      "tmdbMovieId": 50380,
      "avgRating": 2.92105,
      "releaseYear": "2000",
      "numRatings": 19,
      "posterPath": "/5i2aVGMXrIAX5iq5WmohmPFIfpL.jpg"
   }
}