{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0859760",
      "video": false,
      "title": "To Rob a Thief",
      "recommendations": [],
      "backdrop_path": "/xdwCWhB2IY8Dm62YAs7GNhVoBtb.jpg",
      "revenue": 6,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1015,
               "character": "Alejandro Toledo",
               "gender": 0,
               "credit_id": "532eb2cfc3a3685fdb003c8d",
               "name": "Fernando Colunga",
               "profile_path": "/tvY8d100cSJ6Tceujgr0gWnYvgX.jpg",
               "id": 1235729,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Emilio Lopez",
               "gender": 2,
               "credit_id": "52fe46989251416c9105964d",
               "name": "Miguel Varoni",
               "profile_path": null,
               "id": 145216,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "Moctesuma 'Mocte' Valdez",
               "gender": 2,
               "credit_id": "52fe46989251416c91059651",
               "name": "Saúl Lisazo",
               "profile_path": "/7clgpIOCFuyMYw7IsB0ydQJjBPV.jpg",
               "id": 145217,
               "order": 2
            },
            {
               "cast_id": 1003,
               "character": "Rafaela",
               "gender": 1,
               "credit_id": "52fe46989251416c91059655",
               "name": "Ivonne Montero",
               "profile_path": "/rND2HOytvWDT4xIQC8fQpbaegOp.jpg",
               "id": 145218,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "Miguelito",
               "gender": 0,
               "credit_id": "52fe46989251416c91059659",
               "name": "Oscar Torre",
               "profile_path": "/jxyF7XSUcvvBOmhtfrRNr5zBo8g.jpg",
               "id": 145219,
               "order": 4
            },
            {
               "cast_id": 1005,
               "character": "Rafa",
               "gender": 2,
               "credit_id": "52fe46989251416c9105965d",
               "name": "Ruben Garfias",
               "profile_path": "/tIRxlQtTApKefFES9WueXRJphzV.jpg",
               "id": 78321,
               "order": 5
            },
            {
               "cast_id": 1006,
               "character": "Anival Cano",
               "gender": 0,
               "credit_id": "52fe46989251416c91059661",
               "name": "Gabriel Soto",
               "profile_path": null,
               "id": 145220,
               "order": 6
            },
            {
               "cast_id": 1007,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe46989251416c91059665",
               "name": "Julie Gonzalo",
               "profile_path": "/hijoTFxL83zgUxoEMdilP8XIxSf.jpg",
               "id": 68769,
               "order": 7
            },
            {
               "cast_id": 1017,
               "character": "Camera Guy",
               "gender": 0,
               "credit_id": "55b871fac3a3684aeb0010f7",
               "name": "Joe Menendez",
               "profile_path": null,
               "id": 145221,
               "order": 8
            },
            {
               "cast_id": 1018,
               "character": "Julio Miranda",
               "gender": 0,
               "credit_id": "55b8cf3092514123db001ad6",
               "name": "JoJo Henrickson",
               "profile_path": null,
               "id": 145222,
               "order": 9
            },
            {
               "cast_id": 1019,
               "character": "Father O'Malley",
               "gender": 0,
               "credit_id": "5609d057c3a368681700092d",
               "name": "James M. McNamara",
               "profile_path": null,
               "id": 145224,
               "order": 10
            },
            {
               "cast_id": 1020,
               "character": "Blanca",
               "gender": 0,
               "credit_id": "58f091aec3a3686b8e00db0f",
               "name": "Lidia Pires",
               "profile_path": null,
               "id": 1795841,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46989251416c9105966b",
               "name": "Joe Menendez",
               "profile_path": null,
               "id": 145221,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46989251416c91059671",
               "name": "JoJo Henrickson",
               "profile_path": null,
               "id": 145222,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46989251416c91059677",
               "name": "Roni Eguia Menendez",
               "profile_path": null,
               "id": 145223,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46989251416c9105967d",
               "name": "James M. McNamara",
               "profile_path": null,
               "id": 145224,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46989251416c91059683",
               "name": "Ben Odell",
               "profile_path": null,
               "id": 145225,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46989251416c91059689",
               "name": "Meta Valentic",
               "profile_path": null,
               "id": 145226,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46989251416c9105968f",
               "name": "Andrés Levin",
               "profile_path": null,
               "id": 145227,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "55b871bc92514123e70010c5",
               "name": "Joe Menendez",
               "profile_path": null,
               "id": 145221,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.958138,
      "production_countries": [],
      "id": 38140,
      "vote_count": 7,
      "budget": 4002313,
      "overview": "Emilio, a Colombian con man, arrives in LA with two weeks to complete his plan to rob a former colleague, Claudio Silvestrini, who's made a fortune using infomercials to peddle snake oil to Latin immigrants. Emilio's friend Alejandro, who sells pirated DVDs, has assembled a team of amateurs, who, as Alejandro says, will go unnoticed because they're immigrants. The team must gain entry to Silvestrini's well-guarded mansion, steal two keys to access a vault, and then get the money off the property. A father and his tomboy daughter, a nervous Cuban actor, a techie, and a muscle man make up the team, plus Alejandro has been courting Silvestrini's nanny. Will they be enough?",
      "similar": [],
      "original_title": "Ladrón que roba a ladrón",
      "runtime": 98,
      "poster_path": "/rRaPWVZFFrgu5ZNSXxbhV0UsR5H.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Narrow Bridge Films",
         "id": 6535,
         "origin_country": ""
      }],
      "release_date": "2007-08-31",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.lionsgate.com/ladron",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joe Menendez"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["JoJo Henrickson"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0859760/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODg4ODE4NzgyNV5BMl5BanBnXkFtZTcwNDM3Nzk0MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Fernando Colunga, Miguel Varoni, Julie Gonzalo | See full cast and crew »"],
      "reviews": [
         "I loved this movie! The focus of this heist movie was on the characters' resourcefulness and cleverness, not on special effects. The clever dialogue, plot twists and the wonderful humor reminded me of the great classic \"The Sting.\" I much preferred this film to the big-budget Ocean 11-13 series, which is too self-important, and I found the characters far more charming and easy to root for. While I am not Latina, I am very familiar with the works of the three stars, Varoni, Colunga and Lisazo, and they were the reason I went to see this film. They did not disappoint me. The entire ensemble is great and very believable, although Oscar Torre and Miguel Varoni steal a few scenes. Fernando Colunga always stands out b/c he's so darn HOT! He's also very good here. On the other hand, my friend's heart palpitated every time S. Lisazo and G. Toro came on screen. Ivonne Montero is very funny in a role very different than many of her telenovela ones. All around, definitely worth seeing!",
         "WOW! MUST SEE!! Ladrón que roba a ladrón This Gringo felt that this movie is one of the best this year.. Funny, Clever, Excellent direction, Very well acted. Four Stars!! This is my first review but I felt compelled to write it. Ladrón que roba a ladrón was Fantastico! Muy Bien!! The plot was well developed with a little extra surprise which pulled it together well. The language was Spanish but easy to follow with the acting and the subtitles, which were very clear, and I honestly at the end felt I was watching it in English. The plot develops well from the beginning and the characters grow on you. The acting was first rate and Dirctor Joe Menendez and Writer JoJo Hendickson put it all together in a tight package without the unnecessary fluff that often take a good story and makes it difficult to follow. Ladrón que roba a ladrón is a Must See!!",
         "I don't believe that I need to recap the plot of this movie since other commentators have done so quite clearly. However I would like to expand on three aspects of the film: the casting, comparable movies, and the technical credits. I'm an Anglo and came across the movie by accident on Amazon.com. As such I was totally unfamiliar with the cast of this movie, most of whom appear to have extensive credits in Hispanic television series. When an actor delivers a good performance you can credit the actor. When all the actors fit their roles you have to credit the casting. Saul Lisazo, as the putative villain Moctesuma Valdez, was impressive. Both of the gang leaders, Miquel Varoni as Emilio Lopez and Fernando Colunga as Alejandro Toledo, were in character. While the latter was billed first, I assume he's better known for his television work, I would say the former was more of a standout in this film. Ruben Garfias was expressive as car jockey Rafa and Ivonne Montero was very dynamic as his motor-head daughter Rafaela. Gabriel Soto brought some charm to the usually thankless role of caper muscle man. Julie Gonzalo was attractive in the role of the nanny Gloria but Sonya Smith had little to do as Mrs. Valdez (apparently she was more actively involved in a sub-plot which was cut from the movies to reduce run time). Oscar Torres as Miguelito, a would be actor, and Jon Molerio as a security guard provide standout comedy relief. Only the computer \"nerd\" role of Julio Miranda was surprisingly under written given that it was played by JoJo Henrickson, the author of the screen play. It is relatively seldom that all major roles in a film are well cast. It is a high compliment when I say it makes me want to go out and look at the other work of these performers. Commentators have compared this film to Ocean's Eleven (1960/2001) or the The Sting (1973) in terms of where it was derived from and the style of the caper. I don't know who made the first caper film, with people coming together to stage a heist, but I know it definitively precedes Ocean's Eleven (1960). Without even pausing I can think of Jules Dassin's Rafifi (1955), Stanley Kubrick's The Killing (1956) or John Huston's The Asphalt Jungle (1950). In terms of style I think we must remember that this film was apparently made on a budget of US$900,000 over twenty days. Its simply not going to have the high-technology caper of a big budget Ocean's Eleven (2001). The complexity of the caper is more like that of 1960's television series Mission Impossible or Man From U.N.C.L.E. However the director and writer of this film wisely choose to concentrate on character and social commentary rather than complexity of the caper. This fits better within both the budget and the concept of invisible immigrants staging a caper. Part of the emotional satisfaction with the ending is the social commentary embedded within it. Technical credits are normally taken for granted but deserve comment in this case. The camera work is particularly impressive, with use of continuous takes as the camera moves amongst the participants in the scene. This style binds the characters together and creates both realism and a sense of activity. I was also impressed with some of the framing of the shots, with the main characters bookending the background events. I don't think I've ever commented on subtitles in a movie. Inevitably one senses that the subtitles you are reading are a poor reflection of what's said in the original language. In this case the English subtitles, I presume by the screen writer JoJo Henrickson, are fluid and fully convey the emotions on the screen. The catchy soundtrack also adds to the professionalism of the credits.",
         "Not a deep film, no moral lesson learned (except that Karma is a female dog with PMS), but entertaining and amusing. Fernando Colunga and Miguel Varoni are likable and clever as the two master thieves who conspire to steal an ill-gotten fortune. There is almost a Rat-Pack feel to them; they certainly have the attitude. I think sometimes that Miguel Varoni wants to be the Hispanic John Cleese; this must help to explain the contrast between his slightly sleazy look (awkward ponytail and stubble) vs Colunga's perfect grooming and tooth-paste-commercial smile. He has that perfect, ideal masculine face that belongs on a big screen; my one disappointment is that we didn't get to see more of his equally perfect body. The other actors, especially Gabriel Soto as the muscle-man and the great Saul Lisazo as the greedy villain, are amusing and look like they're having a good time in this film. The Mission-Impossible style heist is not as smooth as in that classic TV program, but clever, amusing, and with more than a few jokes about what it is to be a Latino immigrant in the US. The early scenes of immigrants falling for the phony products and the TV studio scenes poke fun at the infomercials for sexually-related pills and phony weight-loss products one sees on Telemundo. Every time I see those commercials I always wonder how the actors can get through them with straight faces. There are a few things you're in the dark about on the way to the end (which I won't reveal) but suffice to say that the ending of this picture is very satisfying.",
         "First off, I love when people try and be production critics (\"bad direction\") when the majority of people just want to know if the film is good. And Ladron que roba a ladron is just that. Who says similar movies, Ocean's 11 and this one, can't coexist? First of all, it's in Spanish, but for me, who only speaks English, it didn't distract from the movie at all. The actors area all great, which is not always true for ensemble casts. The plot isn't necessarily predictable, as there are definitely twists, and the fact that it was filmed in LA really doesn't have any effect on the film, positive or negative. Overall I absolutely recommend this film, especially if you, like me, feel the Matt Damon- George Clooney dynamic getting old.",
         "That translation sounds very familiar, Yes, dear readers, we have seen this type film many times over the years.The Oceans 11-13 series, comes to mind first. The film was made by a Mexican-American film company & has a large cast of actors famous on Mexican Television. The cast & crew live in Los Angeles & have their roots either here or in other Latin-American countries. The setting is Los Angeles, most of which was filmed in a beautiful house & grounds in one of the more upscale areas. The entire cast is excellent,all aspects of the movie are first rate. The general idea of this tale is we have a villain, a snake-oil salesmen who sells phony health remedies to gullible TV listeners. Enter 2 righteous dudes who form a gang to take this sleaze-ball down It is a fun ride all the way, with a few surprises. I was laughing out loud all the way through, I think you all will as well. This movie has none of the phoniness of the Oceans 11-13 series, Minimum of violence,next to no sexual stuff & no songs to disrupt the comedy.its pure fun. It is in Spanish with excellent closed captioning. next to no objectionable language as well. Ratings ***1/2 (out of 4) 94 points (out of 100) IMDb 9 (out of 10)",
         "I was born in the US to immigrant parents and while I don't care for telenovelas or the typical overracting that is present in Latin entertainment, I really enjoyed this movie. While it may seem to be a wannabe Ocean's 11, you also have to bear in mind that the recent O11 movies are also knockoff's of an original movie made in the 60's. I don't think that this movie is in any way trying to set itself apart or claim complete originality. The formulas have been used in many movies in the past, present and will continue to be used in the future. What sets this movie apart is how the subject appeals to a broad group of people on a personal level. This is not the type of movie that could truly appeal to non-Latinos because they have no emotional investment in the storyline. While there may have been a few things that others would consider predictable, it was still worthwhile to view. I think that if non-Latinos could understand the struggles that Latinos endure trying to come to the US, they would have a deeper understanding of what it means to get back at someone who robs their own people. I think that if I did not speak Spanish I would probably not appreciate the film as much. The nuances in tone and inflection by some of the actors, particularly Oscar Torres, are just outstanding. I loved watching him on the screen and hope to see him in more movies. I think that his character alone, led the audience to an uncertainty of the outcome of the heist. The other actors, popular in the world of Telenovelas, still had some very good performances. Personally , I would not really compare this to Ocean's Eleven, Italian Job or any of those types of heist movies. Those movies had an air of sophistication that is entirely different than LQRL. I would compare LQRL more to the Donal Logue show, Knights of Prosperity. Equally zany, hilarious and in some cases the performances are so nonsensical you can't do anything but laugh your @ss off. The ending is of a different type than most heist movies in that it circles back and closes well.",
         "Ladron Que Roba A Ladron is a good Latino film with a Telenovela cast (soap opera) Colunga, Lisazo, Montero, Soto and Varoni. The story, the direction and the acting were good as well with some funny moments. Few things I like about the film is how the movie begins believe it or not does things happen. I was expecting for more and my only complaint about this movie is that the actors need to challenge themselves a little bit more and break up the \"Telenovela\" type of look they have so that we can see that they are up to something different. I hope I make myself clear on this, anyways overall they make a good movie made for TV.",
         "boy i was over pleased with this(maybe because i did not have high expectations since never seen an add for it? ) reading the reviews of how low the budget was and especially 20 days of shooting sound unreal to me for such a top notch cast and especially directorial credits. i absolutely love the political undertones such as \"oh boy i did not that the united states are not as pro-syndicates as much as i thought\", and that coming from a character that is a Cuban political refugee.you will have to see the context in which this happens, i almost fall of the chair laughing on this one. unlike many action movies this days( or even worse comedy actions)this one has a CLEAR focus without many inner-thoughts and supposable \"choices\" normal people theoretically have. the movie shows the wonders of \"direct action\" in a very intelligent, non-violent way.everyone has doubts about getting onto the heist but once the target is reviled as a multimillionaire Argentinian \"shark\" representing the pro-globalization salesman movement, everyone is willing to take the calculated risk involved.all the team members put effort and especially passion in see the things done right. the bad guy slowly reveals himself as being a pure evil character that indeed feeds on and gets more wealthy from the suffering of others, especially his own Latin group. this guy shows a level of narcissism typical to Latin telenovelas but with tragic social-economic implications in the movie context. the puns taken at Tom Hanks, Julia Roberts and other media made \"stars\" are very hilarious and witty)))) also this scene show a naivety based on perceptions that are familiar to telenovelas viewers regardless of which country/culture one would be part of. the character called \"primitivo\" makes such hilarious scenes sometimes by name alone, and mot just in a \"simplistic\" approach))), the references to Castro are darn hilarious; the movie does not seem to pick a side even if its intentions are to show insights onto globalization as we feel it, not necessary seeing the whole \"details\"; and there are many attempts at portrayng those, generally within a very funny framework that not even the \"big guy\" would resist cracking a few loughs at least))) i have never seen any of this actors before and i was surprised of how great their chemistry is without \"over the top\" vibes.the two hit planners have the physical and spiritual appeal of classic revenge movie genre.the female characters are absolutely delightfully and provides excellent Latin type of comic relief that goes both ways. enjoy!",
         "A wonderful film, easy to watch and the characters are absolutely charming! the pacing fits the bill and the film does not drag at any point, which is something that some heist films could work on, including the ocean trilogy. The superstars of Latin America bring an extra pinch of charm to the film, especially Fernando Colunga. The latter and Saul Lisazo are brilliantly paired as nemeses, it makes sense, since these two are the leading men of the telenovelas, not to mention Gabriel Soto. If they were to put Gabriela Spanic as the wife in a cameo, it would be almost a reunion.... All in all, a must-see for anyone who likes a well-paced and well-acted film!"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Narrow Bridge Films",
         "Panamax Films"
      ],
      "summaries": [
         "Emilio, a Colombian con man, arrives in LA with two weeks to complete his plan to rob a former colleague, Claudio Silvestrini, who's made a fortune using infomercials to peddle snake oil to Latin immigrants. Emilio's friend Alejandro, who sells pirated DVDs, has assembled a team of amateurs, who, as Alejandro says, will go unnoticed because they're immigrants. The team must gain entry to Silvestrini's well-guarded mansion, steal two keys to access a vault, and then get the money off the property. A father and his tomboy daughter, a nervous Cuban actor, a techie, and a muscle man make up the team, plus Alejandro has been courting Silvestrini's nanny. Will they be enough?",
         "Two former thieves reunite to rob the biggest thief they know -- Moctesuma Valdez, a TV infomercial guru who's made millions selling worthless health products to poor Latino immigrants. When none of their affiliates want to go undercover as day laborers to pull off the heist, the two men turn to the real thing for help."
      ],
      "budget": 1200000
   },
   "movielensId": 61707,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2007-08-31",
      "dvdReleaseDate": "2008-01-29",
      "directors": ["Joe Menendez"],
      "runtime": 98,
      "movieId": 61707,
      "title": "To Rob a Thief",
      "mpaa": "PG-13",
      "actors": [
         "Fernando Colunga",
         "Miguel Varoni",
         "Saúl Lisazo",
         "Ivonne Montero",
         "Oscar Torre",
         "Ruben Garfias",
         "Gabriel Soto",
         "Julie Gonzalo",
         "Joe Menendez",
         "JoJo Henrickson",
         "James M. McNamara",
         "Lidia Pires"
      ],
      "imdbMovieId": "0859760",
      "originalTitle": "Ladrón que roba a ladrón",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Emilio, a Colombian con man, arrives in LA with two weeks to complete his plan to rob a former colleague, Claudio Silvestrini, who's made a fortune using infomercials to peddle snake oil to Latin immigrants. Emilio's friend Alejandro, who sells pirated DVDs, has assembled a team of amateurs, who, as Alejandro says, will go unnoticed because they're immigrants. The team must gain entry to Silvestrini's well-guarded mansion, steal two keys to access a vault, and then get the money off the property. A father and his tomboy daughter, a nervous Cuban actor, a techie, and a muscle man make up the team, plus Alejandro has been courting Silvestrini's nanny. Will they be enough?",
      "tmdbMovieId": 38140,
      "avgRating": 3.5,
      "releaseYear": "2007",
      "numRatings": 14,
      "posterPath": "/rRaPWVZFFrgu5ZNSXxbhV0UsR5H.jpg"
   }
}