{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "eating non food",
            "id": 168889
         }
      ],
      "imdb_id": "tt0097670",
      "video": false,
      "title": "Kinjite: Forbidden Subjects",
      "recommendations": [
         32029,
         107321,
         293536,
         96635,
         137420,
         31671,
         33055,
         166392,
         36584,
         37626,
         79683,
         48885,
         27344,
         87303,
         267319,
         92272,
         25111,
         44181,
         42551,
         30644
      ],
      "backdrop_path": "/uqJ6FMw8pCI4VK67yOz8EWQJql6.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "56a04e33c3a36858dc00bc9a",
         "content": "Their ninth and final film together over a 12-year partnership, 'Kinjite: Forbidden Subjects' basically plays out as a Death Wish installment with Charles Bronson portraying Lieutenant Crowe instead of Paul Kersey, and being focused in anger both over child prostitution and that his own teenage daughter was molested by a Japanese businessman. Many would write this off as simply an exploitation film, but I love the fact that, like 'Gentleman's Agreement', it shows both that different degrees of racism are possible in anyone, but is also stoppable, as in seeing that a Japanese father cares about his daughter just as much as he cares about his own, he changes his own perspective. And the ending, that the criminal gets what's coming to him, is very satisfying, and makes many of Bronson's films such guilty pleasures...",
         "url": "https://www.themoviedb.org/review/56a04e33c3a36858dc00bc9a"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Lieutenant Crowe",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819ea6b",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Kathleen Crowe",
               "gender": 1,
               "credit_id": "52fe4985c3a36847f819ea6f",
               "name": "Peggy Lipton",
               "profile_path": "/ufFeqwjB6GGdZCRnkZtNS2hDoz9.jpg",
               "id": 152759,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Hiroshi Hada",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819ea73",
               "name": "James Pax",
               "profile_path": "/rGohfLMMuUcbJ1uORku4EFg96s1.jpg",
               "id": 53024,
               "order": 3
            },
            {
               "cast_id": 1017,
               "character": "Duke",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819eab9",
               "name": "Juan Fernández",
               "profile_path": "/kA5I0SunYlTP9YJYwOrs4aCarCH.jpg",
               "id": 1607,
               "order": 4
            },
            {
               "cast_id": 1018,
               "character": "Eddie Rios",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819eabd",
               "name": "Perry Lopez",
               "profile_path": "/bpw3oCVkAasOd8A2uwy60pnSXoD.jpg",
               "id": 12295,
               "order": 5
            },
            {
               "cast_id": 1020,
               "character": "Mr. Kazuko Hada (as Marion Kodama Yue)",
               "gender": 1,
               "credit_id": "52fe4985c3a36847f819eac1",
               "name": "Marion Yue",
               "profile_path": null,
               "id": 178124,
               "order": 7
            },
            {
               "cast_id": 1021,
               "character": "Father Burke",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819eac5",
               "name": "Bill McKinney",
               "profile_path": "/bXGJNizj5SbEFPjeBupnRxgwPq0.jpg",
               "id": 16555,
               "order": 8
            },
            {
               "cast_id": 1022,
               "character": "Captain Tovar",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819eac9",
               "name": "Gerald Castillo",
               "profile_path": null,
               "id": 152927,
               "order": 9
            },
            {
               "cast_id": 1023,
               "character": "DeeDee",
               "gender": 1,
               "credit_id": "52fe4985c3a36847f819eacd",
               "name": "Nicole Eggert",
               "profile_path": "/xkpPODDLjrwcNNaDcWcbnwwPWJs.jpg",
               "id": 44711,
               "order": 10
            },
            {
               "cast_id": 1024,
               "character": "Rita Crowe",
               "gender": 1,
               "credit_id": "52fe4985c3a36847f819ead1",
               "name": "Amy Hathaway",
               "profile_path": "/vb4UTeWz30gUv380ecG7dzLQUES.jpg",
               "id": 181851,
               "order": 11
            },
            {
               "cast_id": 1025,
               "character": "Lavonne",
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819ead5",
               "name": "Sy Richardson",
               "profile_path": "/kPlnnAmAbqQB33OcEVXiScK1Brr.jpg",
               "id": 58623,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819ea79",
               "name": "J. Lee Thompson",
               "profile_path": "/cVHgJwHOh4j7q1tn3vQEcopblrJ.jpg",
               "id": 18669,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819ea7f",
               "name": "Harold Nebenzal",
               "profile_path": null,
               "id": 51811,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819ea85",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819ea8b",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4985c3a36847f819ea91",
               "name": "Pancho Kohner",
               "profile_path": null,
               "id": 237036,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819ea97",
               "name": "Richard Driscoll",
               "profile_path": null,
               "id": 101911,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819ea9d",
               "name": "Patricia G. Payró",
               "profile_path": null,
               "id": 1096221,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819eaa3",
               "name": "Greg De Belles",
               "profile_path": null,
               "id": 69404,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819eaa9",
               "name": "Gideon Porath",
               "profile_path": null,
               "id": 1096222,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819eaaf",
               "name": "Mary E. Jochem",
               "profile_path": null,
               "id": 1096223,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4985c3a36847f819eab5",
               "name": "Peter Lee-Thompson",
               "profile_path": null,
               "id": 70750,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.749241,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 59201,
      "vote_count": 16,
      "budget": 0,
      "overview": "A Tokyo businessman (Hiroshi Hada), transferred to L.A, molests a teenage girl on a train. It turns out that the girl is the daughter of a vice cop. But in one of those plot twists that can only occur in the movies, the cop is assigned to find the businessman's own daughter who has been kidnapped and forced into a teen prostitution ring.",
      "similar": [
         74997,
         357096,
         73861,
         281957,
         2652,
         3134,
         5336,
         1696,
         8090,
         156022,
         281,
         979,
         238636,
         395834,
         588,
         445954,
         71181,
         133805,
         6312,
         8292
      ],
      "original_title": "Kinjite: Forbidden Subjects",
      "runtime": 97,
      "poster_path": "/rTqTswNj2hHKrfMxECK3O7fRrIS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Golan-Globus",
         "id": 1445,
         "origin_country": ""
      }],
      "release_date": "1989-02-03",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["J. Lee Thompson"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Harold Nebenzal"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097670/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0MjY4MDcyMF5BMl5BanBnXkFtZTcwNjA0NzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Charles Bronson, Juan Fernández, Perry Lopez | See full cast and crew »"],
      "reviews": [
         "This thrilling picture titled Kinjite (which means \"to forbid\" in English) contains suspense , noisy action-packed , intrigue , thrills and lots of violence . The meaning and relevance of this movie's title is that it refers to subjects such as sex, child molesting, prostitution which are forbidden topics in Japanese culture . It deals with the cop Lt. Crowe (Charles Bronson , he was about sixty-seven years of age) who takes on a pimp (Juan Fernandez) and a slimy hoodlum (Sy Richardson) whose speciality is recruiting adolescents including the daughter of a Japanese business man (James Pax). The lieutenant married to Kathleen (Peggy Limpton) has a teenager girl (Amy Hathaway) and is helped by another policeman (Perry Lopez). He then stalks the baddies and takes the law into his own hands , acting as judge , jury and executioner ; searching vengeance on crooks , pimps making the neighborhood safer and bumping off delinquents and street scum. This standard Bronson movie is full of action , thrills, and disturbing scenes . Bronson in his usual stoic acting displays efficiently his weapons such as ¨Harry the Dirty¨ and killing mercilessly nasties . This is the last movie Charles Bronson made for Cannon Films and it represents the tenth and final of ten teamings between producer Pancho Kohner and star actor Bronson . It's certainly thrilling , though the morality may be questionable , even in this time, as the spectators were clearly on the Lt. Crowe Bronson's side . Disagreeable scenes and loathing theme as abuse of children with terrible end . Screen debut from Baywatch's Nicole Eggert as a teen prostitute and Danny Trejo as an inmate in a final brief appearance -almost extra- . Unappropiated and anti-climatic musical score composed by means of synthesizer . The fare was badly directed by J. Lee Thomson , in his last one , he previously had a nice track record in the English cinema from 1950 until 1961 , directing good Western (McKenna's gold , White Buffalo) and all king genres as Sci-Fi (Conquest and Battle of planet of apes), terror (reincarnation of Peter Proud, Eye of the devil), adventures (Flame over India ,Kings of the sun, Taras Bulba , Tiger Bay) and Warlike (Guns of Navarone, Von Braun , Chairman , The passage) . His two biggest successes turned out to be ¨Guns of Navarone¨and ¨Cape Fear¨. Thereafter , the filmmaker's career subsided in a morass of slickly realized but middling films . He moved into the field of international spectaculars , at which point his filmmaking seemed to lose its individuality . J. Lee Thompson working from the 50s in England, finished his career making Chuck Norris (Firewalker) and Charles Bronson vehicles (Caboblanco, Evil that men do , Messenger of death, Death Wish 4 : Crackdown, Caboblanco, St Ives). Rating : Below average . Lousy results for this disagreeable thriller that has many depressing failures.",
         "When great director/actor combinations are talked about the team of J. Lee Thompson and Charles Bronson is not usually mentioned. Probably because the output of nine joint ventures between the two of them runs the gamut from the really good action entertainment to the mediocre. Unfortunately Kinjite: Forbidden Subjects falls in the latter. That's sad because Kinjite could have been a whole lot better. But for the life of me I don't understand why it was necessary to make the father of the missing Japanese girl, a guy used to getting some cheap jollies because the romance in his marriage has run out. That might have been good for another film altogether, but it served no purpose here. A straightforward cop drama with Charles Bronson as a vice cop who's seen a bit too much in his line of work and has a strong prejudice against orientals. That part could also have used a little explaining as well. But he's going to have to overcome it if he and patient partner Perry Lopez are going to locate a captured Japanese school girl. Bronson's time in the vice squad have told him exactly where to look for the kidnapper. A stylish, murderous pimp played by Jaime Fernandez is the guy and he and Bronson have some history. In fact in the film's best scene, Bronson made him eat an expensive rolex watch and set his car on fire. At one point Fernandez happens to spot Bronson and Lopez in an all night delicatessen and this being after his rolex snack, he sprays the place with an Uzi killing everyone, but Bronson and Lopez. I really think that little incident would have had more than a couple vice cops from the LAPD after Fernandez. But that's another terribly big hole in the plot. Still there is a very rough justice in the end for Fernandez. I wish the whole film had been better though. This was the last film of the Bronson-Thompson team and J. Lee Thompson's last as a director. He should have gone out with something better.",
         "Charles Bronson stars as Lt Crowe a police detective who declares war on a pimp named Duke (Juan Fernandez) who kidnaps the daughter of a Japanese businessman who is the man who sexually harassed Crowe's daughter (Amy Hathaway) in this sleazy yet stylishly helmed revenge thriller. Kinjite may not be for everyone with it's somewhat disturbing plot threads but it is well made and indeed entertaining.",
         "*SPOILER ALERT* *SPOILER ALERT* Charles Bronson has had enough. He's had enough of the low down punks who are turning Los Angeles into a disease ridden swamp. He can't stand the sight of Japanese businessmen buying up his city. He gets sick of all the exploitation that surrounds him day after crushing day. And why won't somebody cover up his daughter when she comes out of the pool for Pete's sake? Lousy punks. They're not going to get away with it for much longer. \"Kinjite: Forbidden subjects\" is about Charles Bronson getting in touch with his soft, nurturing side. Just kidding. It's a typical Bronson flick in which he gets to bash in the head of anybody he doesn't like. This time a young Japanese girl gets kidnapped by a slimy pimp and Bronson has to find her. This gives him plenty of opportunity to run into many sleazy situations. \"Kinjite\" doesn't really have any graphic violence but it does keep up a very strong sleaze vibe. It doesn't deal with child prostitution delicately. It's a nasty piece of work. Speaking as a sleaze fan, I enjoyed this film. It could have had a little more action and gun play, but I enjoyed it for what it was.",
         "May be spoilers. Kinjite:Forbidden Subjects is not one of Charles Bronsons best movies, but is better then what most have said on here. The movie deals with a cop (Bronson)trying to take down a lowlife child pimp and rescue a Japanese girl from him. As with most Bronson films, he deals out his own brand of justice rather then doing it by the book. As one reviewer said already this is truly a movie about what goes around comes around. For instance,the father of the Japanese girl molests Bronsons daughter on a bus and ironically its his daughter that gets snatched by the pimp \"duke\". Forbidden Subjects does not contain the large body count that Bronson racks up in other movies, but contains some great moments, such as Bronson forcing the pimp to eat his diamond Rolex and then let some jailbird have his way with the pimp, thats justice. Although the subject matter is a bit sickening, the movie is well made and the actors do a good job with there roles. Although Bronson is by far not the best actor in Hollywood there are far worse actors out there getting praise for nothing. Overall, its good for a watch but I would probably skip on buying it.",
         "This is the last movie that Charles Bronson made before the death of his second wife, actress Jill Ireland. At 68 and with a string of mediocre action thrillers littering his 1980s output, this sleazy cop movie turned out to be one of his better efforts of the decade. Bronson plays vice detective Crowe, a racist veteran of the force who has grown weary of seeing the scum of Los Angeles dragging innocent children into prostitution and drugs. A parallel storyline follows visiting Japanese businessman Hiroshi Hada (James Pax) who struggles to adapt to American values and soon after arriving loses his young daughter to slimy pimp Duke (Juan Fernandez). Crowe has already had run-ins with Duke, so when he is assigned to find Hada's daughter, the stories merge with tragic results. Bronson is still trim and performs well as Crowe, with several good action sequences. Largely maligned as an actor because he underplayed his leading roles, Bronson always fit this type of role because you could believe that he actually does the things he is portraying. There is a nice little scene involving an ethnic event where Crowe vents his frustration on some startled Japanese that speaks volumes about character motivation. Juan Fernandez is exceptional as Duke and makes his character truly evil. Veteran British director J. Lee Thompson does a fair job of keeping the movie plugging along and has a great set piece at the end of the movie involving a crane and crashing automobiles. The subject matter isn't as exploited as it could have been, but it's still pretty rough and loaded with nudity and violence. Bronson fans won't be disappointed and even non-fans (like my wife) enjoyed it.",
         "It's been a couple days since I watched it, and I just had to let it sink in. Fans of the Bronson/Thompson pairing will know what to get (being no restrictions within a Cannon production), but for some particular reason it didn't hit home for me. Well not straight away. This is probably the pairs' most daring work (yeah more so than \"The Evil That Men Do (1984)\"), and fittingly the last they would make together in a technically well-made fable. What ruffled a lot of feathers when this came out was the exploitative topics at hand (child prostitution, repressed sexual desire and drug addiction), and the way they were handled and brought across. They are gruelling, stomach churning and sleazily downbeat, but never did it struck those cords with almighty, gut-busting force. The ugliness of these facets definitely creeps in, but the emotional drive while being there, feels quite thin with an uneasy and bitter underbelly taking hold. Thompson's sufficiently polished direction (though a more raw edge to it would've been better) paints a rotten, grimy and scummy texture through heavy atmospheric vibes than anything visually punishing. Gideon Porath's leering cinematography streamlined the feature. For a Bronson film, action makes little head-way. Quite strange, but its slow going pace lets the basic premise evolve, with its two separate stories eventually interlocking with each other with a neat slice of irony and karma, which made the material not so predictable and largely authentic. However don't worry too much, as Bronson does gets his hands dirty, just the way we like it too. Serving out his 'own' unpleasant justice in few memorable sequences! Some might say that Bronson in the latter end of his career (mainly through the 80s) made a living out of the same character and motivation. But an earnestly scathing script, helps give Bronson something interesting to work with (even a bit of western and eastern cross-culture differences plant themselves in early, and play a bigger part to story's progression) and makes for a weathered, but righteously hard-hitting performance of a multi-facet character. In support; Juan Hernandez's seedy pimp is a disturbingly slimy portrayal and James Pax's square Japanese businessman with an uncontrollable sexual urge effectively counter-punches Bronson and Hernandez's characters. None of these are clean characters, even though Bronson has the badge. He shows his insecurity, of the subject and uses it to make his actions justified. In the lesser co-starring roles is an exceptional Peggy Lipton as Bronson's wife. Perry Lopez is good in the loyal, but tired cop partner. An imposing Sy Richardson plays one of Hernandez's goons. Amy Hathaway shines as Bronson's on screen daughter and Kumiko Hayakawa impresses with a movingly gusty turn as the young kidnapped girl. As for Greg De Belles' funky music score, I found it sloppy and unsuited instead of sapping bleakness. I just wanted the musical pieces to get under my skin. The dark, unsparing perverse tone doesn't make it enjoyable entertainment. However it really does linger on the mind, and holds a steady curiosity to it.",
         "Repugnant Bronson thriller. Unfortunately, it's technically good and I gave it 4/10, but it's so utterly vile that it would be inconceivable to call it \"entertainment\". Far more disturbing than a typical slasher film.",
         "With more holes than a sunken U-boat, and more cheese than a medium pizza, Kinjite still manages to entertain those who are fond of Bronson, or those who are fans of the more gritty action films of the era. The film has strong moments, but it also suffers at times from overly lazy dialogue, direction and overall storytelling, and it's hard to forget the painfully bad 80's music in this film. The fight scenes are also far from great, however there is enough grit, sleaze and action to make the film a worthy watch for many. The film is undoubtedly a fairly confused morality tale, or perhaps a morality tale within a confused society is the better way of describing it. In the end, the film does rely on a sort of karmic justice to satisfy it's audience, and to a decent degree, it works, at times however it just leaves us asking some very strange questions. Of other note, there is an early but very small appearance by Danny Trejo in the film, as well as a decent performance from a very young Nicole Eggert, as well as a strong performance by the little known but hard to take your eyes off of Amy Hathaway. Worth a look for some, but not to be touched with a ten foot pole by others. My rating... 5.5/10",
         "Well Bronson sure has a real scumbag to shake down in this film, KINJITE:FORBIDDEN SUBJECTS, in pimp Juan Fernández(whose name is Duke!)who seduces minors(mostly female 16 year olds)into becoming prostitutes for \"wealthy perverts\". He and partner, Eddie Rios(Perry Lopez)are assigned by their superior to find the teenage daughter of a Japanese businessman, Hiroshi Hada(James Pax), kidnapped by Duke and his vile associate, Lavonne(Sy Richardson). You see Duke and Lavonne drive down LA streets searching for \"fresh stock\", teenage runaways desperate for attention, luxuries, bed, board, and food, the amenities. Kids believe Duke only wants the best for them(as is the case when Bronson's detective Crowe questions the loyalties of one such prostitute played by a young Nicole Eggert who tells him the Duke is a good man, better than her step-father!)and so they hook for him and in return he gives them what they believe is \"the good life.\" In J Lee Thompson's final film, KINJITE is obviously an indictment on the exploitation of teenage girls and how they are consumed by lecherous fiends who promise them great things in exchange for prostituting themselves. There's also a statement, through the character of Crowe, about the discontenting nature of festering racism..take the scene where Crowe becomes enraged with Japanese tourists and businessmen who he considers \"invaders\", buying up everything in America. This racism extends from an incident where Hiroshi himself \"cops a feel\" of Crowe's daughter while she and some of her friends are on board a bus heading home(Crowe doesn't know who it was exactly, just \"some Oriental guy\"). Thompson and company know how far to go and thank goodness Crowe's family isn't raped and murdered as was often the case in the Winner DEATH WISH movies. By '89 Bronson could no longer hide the fact that he was around 70 years old and that his geriatric cop hero roles were soon to be retired. Unbelievable as it might be, Bronson would actually return to his Kersey role five years later for DEATH WISH V, not to mention the A FAMILY OF COPS series, even as he was approaching 80! Fernandez is a really depraved kind of monster who actually gets off a bit easier than you'd think(hell, even a client of Fernandez, although off-screen, gets a dildo up his ass by Crowe!), though his fate is rather fitting. The subject matter for this film is really off-putting but relevant, and Thompson uses subtlety instead of elaborating in exact detail. Thompson's action-packed finale lets him go out with quite a bang as explosions and machine gun fire there are aplenty."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Golan-Globus Productions"],
      "summaries": [
         "A Tokyo businessman (Hiroshi Hada), transferred to L.A, molests a teenage girl on a train. It turns out that the girl is the daughter of a vice cop. But in one of those plot twists that can only occur in the movies, the cop is assigned to find the businessman's own daughter who has been kidnapped and forced into a teen prostitution ring.",
         "A brutal Los Angeles police Lt. is determined to bust up an organization that forces underage girls into prostitution."
      ],
      "budget": 0
   },
   "movielensId": 6174,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-02-03",
      "dvdReleaseDate": "2003-02-04",
      "directors": ["J. Lee Thompson"],
      "runtime": 97,
      "movieId": 6174,
      "title": "Kinjite: Forbidden Subjects",
      "mpaa": "R",
      "actors": [
         "Charles Bronson",
         "Peggy Lipton",
         "James Pax",
         "Juan Fernández",
         "Perry Lopez",
         "Marion Yue",
         "Bill McKinney",
         "Gerald Castillo",
         "Nicole Eggert",
         "Amy Hathaway",
         "Sy Richardson"
      ],
      "imdbMovieId": "0097670",
      "originalTitle": "Kinjite: Forbidden Subjects",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["-Ri--GrmRRs"],
      "plotSummary": "A Tokyo businessman (Hiroshi Hada), transferred to L.A, molests a teenage girl on a train. It turns out that the girl is the daughter of a vice cop. But in one of those plot twists that can only occur in the movies, the cop is assigned to find the businessman's own daughter who has been kidnapped and forced into a teen prostitution ring.",
      "tmdbMovieId": 59201,
      "avgRating": 2.24038,
      "releaseYear": "1989",
      "numRatings": 52,
      "posterPath": "/rTqTswNj2hHKrfMxECK3O7fRrIS.jpg"
   }
}