{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "extraterrestrial technology",
            "id": 1603
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "alien life-form",
            "id": 4862
         },
         {
            "name": "cult film",
            "id": 34117
         }
      ],
      "imdb_id": "tt0074851",
      "video": false,
      "title": "The Man Who Fell to Earth",
      "recommendations": [
         36040,
         13820,
         11542,
         931,
         10803,
         11905,
         811,
         11942,
         1410,
         11654,
         994,
         25504,
         476,
         695,
         884,
         10176,
         31767,
         11850,
         32054,
         4923
      ],
      "backdrop_path": "/y3U2fDOWbT0bEDa40PRSHPyA7rY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Thomas Jerome Newton",
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa79",
               "name": "David Bowie",
               "profile_path": "/7OIa363iSLG43x9Sb9HojUANwbh.jpg",
               "id": 7487,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Nathan Bryce",
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa7d",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Mary-Lou",
               "gender": 1,
               "credit_id": "52fe4297c3a36847f802aa81",
               "name": "Candy Clark",
               "profile_path": "/6pGZGgHa09ktPwEcFWNAU3PLFdi.jpg",
               "id": 12407,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Arthur",
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa85",
               "name": "Tony Mascia",
               "profile_path": null,
               "id": 14904,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Oliver Farnsworth",
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa89",
               "name": "Buck Henry",
               "profile_path": "/1RVDoUYK85mynMCU7mom7B1TQqC.jpg",
               "id": 7795,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Peters",
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa8d",
               "name": "Bernie Casey",
               "profile_path": "/rvL40yyewKgTDVm7doR1ym09sUj.jpg",
               "id": 10939,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Trevor",
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa91",
               "name": "Rick Riccardo",
               "profile_path": null,
               "id": 14908,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Elaine",
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa95",
               "name": "Linda Hutton",
               "profile_path": null,
               "id": 14909,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Jill",
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa99",
               "name": "Hilary Holland",
               "profile_path": null,
               "id": 14910,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Professor Canutti",
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa9d",
               "name": "Jackson D. Kane",
               "profile_path": null,
               "id": 2853,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Helen",
               "gender": 1,
               "credit_id": "58341645c3a36829d9001caf",
               "name": "Adrienne La Russa",
               "profile_path": "/xGR7MilJ5AcIzhy9frfYKUwODQa.jpg",
               "id": 105335,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Peters' Wife",
               "gender": 1,
               "credit_id": "5a48919d925141030b00e217",
               "name": "Claudia Jennings",
               "profile_path": "/eicX3cmq3EnnAC59CDO9dSl8ySU.jpg",
               "id": 45469,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa2d",
               "name": "Nicolas Roeg",
               "profile_path": "/m1f5AHFoKMabMBKEpllcm0MhbMz.jpg",
               "id": 14132,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa33",
               "name": "Paul Mayersberg",
               "profile_path": null,
               "id": 14894,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa39",
               "name": "Walter Tevis",
               "profile_path": "/4BISPeJQKfwJhVtdTuz4JdDNUnK.jpg",
               "id": 14877,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa3f",
               "name": "Michael Deeley",
               "profile_path": null,
               "id": 581,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa45",
               "name": "Barry Spikings",
               "profile_path": null,
               "id": 14895,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa4b",
               "name": "Si Litvinoff",
               "profile_path": null,
               "id": 14896,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa57",
               "name": "John Phillips",
               "profile_path": null,
               "id": 14898,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa5d",
               "name": "Stomu Yamashta",
               "profile_path": null,
               "id": 14899,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa63",
               "name": "Anthony B. Richmond",
               "profile_path": null,
               "id": 14139,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa69",
               "name": "Graeme Clifford",
               "profile_path": null,
               "id": 13488,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4297c3a36847f802aa6f",
               "name": "Brian Eatwell",
               "profile_path": null,
               "id": 14900,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4297c3a36847f802aa75",
               "name": "May Routh",
               "profile_path": null,
               "id": 14901,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.395979,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 991,
      "vote_count": 172,
      "budget": 1500000,
      "overview": "Thomas Jerome Newton is an alien who comes to Earth to get water for his dying planet. He starts a high technology company to get the billions of dollars he needs to build a return spacecraft. A British science-fiction film from director Nicolas Roeg and starring David Bowie.",
      "similar": [
         10803,
         869,
         871,
         9659,
         9693,
         1091,
         198663,
         63,
         78,
         76341,
         131631,
         157350,
         8810,
         281,
         604,
         605,
         335984,
         9482,
         1103,
         7512
      ],
      "original_title": "The Man Who Fell to Earth",
      "runtime": 138,
      "poster_path": "/wLyhPmNXiXrYKqqTOq63oSex6qi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "British Lion Films",
         "id": 632,
         "origin_country": "GB"
      }],
      "release_date": "1976-03-18",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "You have to believe it to see it",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nicolas Roeg"],
      "runtime": 139,
      "synopsis": "have you ever wonder wondered whether david bowie looks back at his varied film and wonders why he does'nt still have big hair...",
      "writers": [
         "Paul Mayersberg",
         "Walter Tevis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0074851/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1MDc5NTg1N15BMl5BanBnXkFtZTcwODUyNDk5MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: David Bowie, Rip Torn, Candy Clark | See full cast and crew »"],
      "reviews": [
         "Cinema, once in a while, can provide frustrations of the highest order. You watch with interest, only to have your train of thought switched elsewhere by a film that steers you off course. You are perplexed, through missing something, but this is even more annoying when you don't quite know what that something is. This is precisely the criticism leveled at The Man Who Fell To Earth, which carries the hallmark of a peculiar, brave but controversial directorial style. Nicolas Roeg directs this science fiction/drama/love story with one eye on the main event and another on the various sub plots that weave their way in and out of the principal tale. The fact that he uses this to create a somewhat disjointed narrative is seen as a personal indulgence and many were puzzled enough to claim that the whole project was flawed. That is a harsh judgment; the film is highly stylized, but this does not detract from it's undoubted quality. Thomas Jerome Newton (David Bowie) lands, as surely all self respecting aliens would choose to do, in New Mexico. How come he is wearing \u0091normal' clothes? Where did he get the precious metal rings that he wastes no time in trading so eagerly? Why is he carrying an Englishman's passport? These are the kind of questions that confront you at the outset, causing many to bark in dismay. To get the maximum benefit from the film, you simply have to take these unexplained occurrences - and also the rapid passing of time - on board, because the whole is more significant and understandable than its component parts. Newton arrives here to suck on the capitalist system, recruiting a top patent's lawyer (Buck Henry as Oliver Farnsworth) along the way to help quickly mould his business idea, World Enterprises, into an immense scientific and commercial colossus. He needs the cash to fund the construction of a spacecraft which will carry him back home with the secret of water, the vital resource that, without which, his planet is dying. A disillusioned college professor, (Rip Torn, magnificent as Nathan Brice) stale with the stench of academia and tired of bedding his female students joins Newton as a chief scientist. He is actually the closest to understanding the man, but he ultimately fails him. The mocked time lapses in this film are, in my view one of it's strengths. It enables us to see Mary Lou (Candy Clark) pass from young humble hotel maid to alcoholic old wretch, via live-in lover and \u0091Tommy' worshipper. Clark & Bowie share a key scene where Newton decides to reveal his true self: Newton discards his human-eye contact lenses, strips away the false body hair and fingernails. Mary Lou goes hysterical with fear as the real Newton appears in all his extra-terrestrial glory and this is made all the more grotesque when he starts to exude a complete bodily slime during the ensuing love ritual. A special mention should be made of Anthony Richmond's photography, particularly in the spectacular terrain of New Mexico. Indeed, the whole film is a technical masterpiece and the acting is also of the highest level. Of course, the Man Who Fell To Earth is himself beaten at the outset. The Intelligence Services, jealous, as opposed to curious, of his corporate success, want this weirdo brought to order. They achieve this by hounding Farnsworth and infiltrating the company, finally spoiling everything. Imaginative, vibrant,different, ambitious and memorable: I rarely award ratings but will make an exception here. 8/10 and worth regular re-viewings.",
         "Of all the movies I saw as a teenager (I am now middle aged) this is the one that has remained with me the most, more so even than the highly acclaimed \"Deerhunter,\" which came out 2 years later in 1978. I have not seen it since 1980, so if my memory fails me, please excuse. This eerie, moody movie encapsulated for me -- an alienated kid, I'll grant you -- the perils of living in, and partaking of, the modern world. An alien falls to earth in search of water for his planet, and somehow loses his way, corrupted by materialism, sex, alcohol, the physical world. I recall Candy Clark's cool, almost southern voice (just saw her in a cameo performance tonight, playing Christopher Walken's girlfriend in the 1986 \"At Close Range, another great) purring at Bowie after he has built a little house for her at the end of a dock, \"You're such a nice man,\" and there is something so unsettled about the cinematography -- cloudy and dark and too still -- in the scene that you know he is definitely NOT a nice man, but deeply troubled and unable to respond to human emotions. The other reviewers noted the somewhat disturbing sex scene towards the end of the movie, but for me, at least, that was not needed. I didn't need slime or removed eyeballs (although that is a great scene) to tell me the man is a freak who is human enough to lament his own inability to connect with these creatures from Earth. For the most part the movie was understated, unfolding in its own, detached time.",
         "The Man Who Fell To Earth is one of the few sci-fi films that can justifiably call itself brilliant. But what makes it so brilliant, you ask? It's certainly not the story, which is merely about an alien coming to earth in order to save his dying planet. The performances are excellent, but actors alone cannot make a film brilliant. Perhaps what makes The Man Who Fell To Earth brilliant is the thing that causes people to despise it: it has no plot. That's right. It's alot like a David Lynch movie; there are bizzare characters, bizzare dialogue, and bizzare situations, but barely any trace of a followable plot. The film manages to carry a thin story with almost no plot whatsoever and be consistently interesting and entertaining throughout. On top of that, it's all stunningly photographed. There is quite a bit of sex in this movie, but the sex is done so stylistically we hardly notice how pornographic it is. For instance, in one scene near the end of the film, Bowie wields a pistol loaded with blanks like a phallus. The scene than erupts into a bizzare sex scene filled with flashing strobe lights, full frontal shots of Bowie, and the gun firing randomly off. The Man Who Fell To Earth is essential viewing(unless of course movies that are hard to follow or a naked David Bowie aren't your thing).",
         "Bowie is perfectly cast as an alien who seeks water for his dying planet. This film is so sparse as to be misleading as to the depth of its development, and it takes considerable time to grasp the message on the screen. But when you do, it is devastating: it haunts me 30 years after seeing it. Bowie's character has, of course, super powers...but not of the comic book kind...which he uses to amass a fortune in order to finance his goal. He is drawn to earthly ways, seeks emotional contact, but is unable to connect on any level. Earthlings use him mercilessly, and he is truly alone. His failure to save his family seals his doom; he will outlive all around him. Science fiction of the best kind.",
         "I have just watched \"The Man Who Fell to Earth\" from beginning to end after seeing several scenes here and there from years of flipping past the sci-fi channel or whatever other channel this film might've been shown on. I must say that I think it is one of the most interesting films I've ever seen. Now before you start thinking this is going to be a review of blind worship, stop for a moment and remember that just because something is interesting doesn't mean it's likeable. Art is not meant to be appealing. It's meant to cause a reaction, it's meant to make you think, it's meant to make you uncomfortable. Art forces feelings upon you that you might rather not experience, so whether you like it or not, this film is a work of art. But some art...in fact a lot of art...is trash. Is this movie trash? Some say yes, some say not. Some think it's brilliant, others think it a waste of time. Some think the narrative's dependence on visual stimulus as opposed to linear storytelling is a touch of cinematic beauty, while others dismiss it as experimental tripe. Somebody wrote a scathing review saying that if you like junk like \"Lost Highway,\" you might enjoy this movie. Well, no offense meant, but I'd like to say that this person has made clear that he can't see past what's appealing. Why watch something that's unappealing you might ask? Because that's what art's supposed to do...it challenges you and your values. Sometimes it reinforces them, and sometimes it will blatantly attack them. You have to draw your own conclusions and interpretations. \"The Man Who Fell to Earth\" is no different. Yes, the film seems to jump from time to time, one scene juxtaposed with a scene that takes place 20 years later, a flashback that may or may not be a flashback, it is confusing. I know I was confused. It's not a linear narrative...it's telling a story through pictures, with occasional words just to make sure you have a little more than an inkling as to what you're supposed to be seeing. Personally, I would be interested to see the movie without dialogue...like \"Aeon Flux,\" a story can be told philosophically and artistically without words. What is the story? Well...quite simply, David Bowie, in his first and probably one of his best on-screen performances, is an alien on Earth trying to find a way to get water back to his world. Is it as simple as it sounds? Not by any means. But you have to believe it to see it. You will be confused, you might even be offended (there's a lot of sexually explicit scenes that border on pornography), but one way or the other, this film is meant to be visually stimulating. What you see will make you think...if you're repulsed by it and feel the urge to turn it off, then it's simply not your kind of movie. On the whole, I like this movie, though I must be in a certain mood to watch it. It is not easy to watch, there are long stretches without dialogue, and when there is dialogue, it's often confusing. But no matter what, I like what I was seeing on the screen. I do feel like watching it again because I know there is more to absorb and take in, there's more to think about that I missed before. But that's the kind of person I am...I want to think, and I want that discomfort this movie gives me because I am alleviated by the need to solve it, not dismiss it. Bowie is in fine form, probably used to alienation being a Brit in America, and having played his own Ziggy Stardust character in the past. The rest of the cast performs rather competently, although nobody's performance shines as much as Bowie's (although Candy Clarke is pretty good in some scenes, and Rip Torn's deadpan performance is a bit of dry humor). Dispute me if you must, I give this movie ***1/2 out of ****.",
         "I first saw \"The Man Who Fell to Earth\" when it was first released, and found it to be a jumbled mess. There were plot holes galore, and scenes that went nowhere or had no connection to anything. A few years back, I saw the director's cut, and it was an entirely different film. The plot holes were filled and all the scenes fit together perfectly. As bad as the original release version was, the director's cut is great and worth seeing.",
         "Several things about this film make it worth watching... beginning with the premise that Earth's abundant water is what makes it rare in the galaxy. But more intriguing is how the alien visitor, landing with absolutely nothing but the clothes on his back and a gold wedding ring, and knowing absolutely nothing about Earth culture, \"gets up to speed\" with astonishing, ruthless, clear-sighted rapidity...within days raising the $10,000 he offers a patent attorney for one hour of the latter's time. In that hour, Bowie's character outlines three basic patents -- including two which we can recognize today as digital cameras and music. A particularly fascinating scene has our newly rich and already bored alien watching about 20 TV sets at once, while holding a small, battery-powered propeller. Repeated viewings will reveal that the disparate programs (presumably actual images of television shows) occasionally \"come together\" to form coherent messages... at which time our hero spins the propeller.",
         "So, you thought Alan Yentob's \"Cracked Actor\" or perhaps D.A. Pennebaker's \"Ziggy Stardust: Motion Picture\" was the perfect pictorial rendering of David Bowie and his life in the '70s? Oh no! It's in this, Nicolas Roeg's 1976 master-piece, the real Bowie reveals himself. The rock star's perfect in his interpretation of Thomas Jerome Newton, alien castaway turned resigned and bored capitalist super-star. Mainly because this was were Bowie were at in the mid-'70s. It's not acting. It's Bowie's mere presence. He was an earthling just as alien as his character. \"The Man Who Sold The World\" is a rather depressing, and strange, tale of a man who comes to our planet to raise money to help his own world dying from drought. All he really want is to get home to his wife and kids on that doomed planet. But instead he falls for the mortal sins (sex, drugs, music, television). The film's beautiful, sad, scary and somewhat pretentious. It's sci-fi when it's human.",
         "I went into this film expecting something more like Walkabout, because that is all I had seen of Nicholas Roeg's work previously, and the thought of David Bowie being in it enticed me. Really, though, I had it backwards... It's David Bowie's creation with a little bit of Nicholas Roeg in it. The whole \"human alien\" thing is very much Bowie's schtick, and to a degree I found it hard not to imagine that this was Bowie's entire idea of himself. A sort of silent tragedy encompasses his character, expressed mostly in the scene with the eye-test where Bowie says very smally and pathetically \"Oh... now I'll never get them out.\" Bowie sees himself as an alien that just can't escape being human. On a broader sense than this one artist's idea, however, this is a fascinating science fiction film because it points out a side of human nature not often developed very well in other science fiction films. Instead of dissecting the alien, which is what everyone always expects humans will do, the humans do everything in their power to make him more human. Where not actually working towards constructing this \"other\" as a human, they try to own him, via capitalism or politics or, yes, even love. It's interesting then the space they put him in, with all of the various rooms like different human-empathetic places. On one hand, it's a self-reflective look at the \"set\" of the movie, showing that we are designing this alien to look human, but secondly a lot of it is surreally natural, as if to imply that even nature is forced to be human at our hands. --PolarisDiB",
         "This movie is definitely one of my favourites. First off, the acting is wonderful. David Bowie is awesome, I could not have imagined a better choice of actor. He plays his role to perfection and with just the right emotion. Candy Clark is also incredible in her role. Then comes the plot itself. Sure the plot is a little hard to follow but it is so brilliantly rendered and the cinematography is perfect. A very strong atmosphere and mood is created and the whole thing all together is just mind-blowing. Very original. Very artistic. Go see it if you haven't already. I would also like to add that this cult science fiction film is however not for everyone. The way it was created and the way the scenes are shot resembles an experimental film. The style is also out of the ordinary and the plot may seem to be a little strange and confusing to some. Most people either love it or hate it."
      ],
      "genres": [
         "Sci-Fi",
         "Drama"
      ],
      "productionCompanies": [
         "British Lion Film Corporation",
         "Cinema 5"
      ],
      "summaries": ["Thomas Jerome Newton is a humanoid alien who comes to Earth to get water for his dying planet. He starts a high technology company to get the billions of dollars he needs to build a return spacecraft, and meets Mary-Lou, a girl who falls in love with him. He does not count on the greed and ruthlessness of business here on Earth, however."],
      "budget": 0
   },
   "movielensId": 6184,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1976-03-18",
      "dvdReleaseDate": "2003-02-11",
      "directors": ["Nicolas Roeg"],
      "runtime": 138,
      "movieId": 6184,
      "title": "The Man Who Fell to Earth",
      "mpaa": "",
      "actors": [
         "David Bowie",
         "Rip Torn",
         "Candy Clark",
         "Tony Mascia",
         "Buck Henry",
         "Bernie Casey",
         "Rick Riccardo",
         "Linda Hutton",
         "Hilary Holland",
         "Jackson D. Kane",
         "Adrienne La Russa",
         "Claudia Jennings"
      ],
      "imdbMovieId": "0074851",
      "originalTitle": "The Man Who Fell to Earth",
      "genres": [
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["lfccDapMA14"],
      "plotSummary": "Thomas Jerome Newton is an alien who comes to Earth to get water for his dying planet. He starts a high technology company to get the billions of dollars he needs to build a return spacecraft. A British science-fiction film from director Nicolas Roeg and starring David Bowie.",
      "tmdbMovieId": 991,
      "avgRating": 3.35899,
      "releaseYear": "1976",
      "numRatings": 1390,
      "posterPath": "/wLyhPmNXiXrYKqqTOq63oSex6qi.jpg"
   }
}