{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0481254",
      "video": false,
      "title": "Zuzu Angel",
      "recommendations": [
         36093,
         40860,
         34196,
         59474,
         56049
      ],
      "backdrop_path": "/jWvbAaTnMWRPS3JMRwI5UTDnDgN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 18,
               "character": "Zuzu Angel",
               "gender": 0,
               "credit_id": "540bd426c3a36879ab002a43",
               "name": "Patricia Pillar",
               "profile_path": "/zoqvBeXtHhOj2PoOzQecR5Tvlt1.jpg",
               "id": 1074749,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Stuart Angel",
               "gender": 2,
               "credit_id": "52fe4890c3a368484e0ff4dd",
               "name": "Daniel de Oliveira",
               "profile_path": "/xhLcXI86abbO3cM1BUBbk5H9pcd.jpg",
               "id": 142818,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sônia",
               "gender": 1,
               "credit_id": "52fe4890c3a368484e0ff4e1",
               "name": "Leandra Leal",
               "profile_path": "/zH1cS4el6PlNYpq7A05c8unAoFl.jpg",
               "id": 278354,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Fraga",
               "gender": 0,
               "credit_id": "52fe4890c3a368484e0ff4e5",
               "name": "Alexandre Borges",
               "profile_path": "/tNIqXaSYHdWehzzoQWja2PQYmLC.jpg",
               "id": 115173,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Elke Maravilha",
               "gender": 0,
               "credit_id": "52fe4890c3a368484e0ff4e9",
               "name": "Luana Piovani",
               "profile_path": "/hxGXvVkn6xsolt6hmrp2dOrgwW1.jpg",
               "id": 135746,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tenente",
               "gender": 0,
               "credit_id": "52fe4890c3a368484e0ff4ed",
               "name": "Aramis Trindade",
               "profile_path": "/ehyqVj7fNDOltiOMiCKb4JzN20A.jpg",
               "id": 123761,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lúcia",
               "gender": 1,
               "credit_id": "52fe4890c3a368484e0ff4f1",
               "name": "Ângela Vieira",
               "profile_path": "/g2E50EDLeHY6Tke0TcDlDMVImVK.jpg",
               "id": 132076,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mota",
               "gender": 0,
               "credit_id": "52fe4890c3a368484e0ff4f5",
               "name": "Flávio Bauraqui",
               "profile_path": "/6KTONApwRkrSZ6WBwt6dBzXYhYw.jpg",
               "id": 121457,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Hildegard Angel",
               "gender": 0,
               "credit_id": "52fe4890c3a368484e0ff4f9",
               "name": "Regiane Alves",
               "profile_path": "/9ZK2ULdegZu3uBHBRsATY60mmFk.jpg",
               "id": 568400,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Alberto",
               "gender": 2,
               "credit_id": "52fe4890c3a368484e0ff501",
               "name": "Caio Junqueira",
               "profile_path": "/hz3UzOo0l9YWfqnSeIYaxqEwwkN.jpg",
               "id": 52584,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Antônio Lamarca",
               "gender": 2,
               "credit_id": "52fe4890c3a368484e0ff505",
               "name": "Nelson Dantas",
               "profile_path": "/n4YCLXdAr3S2UKUO6T4ZKR9t4Ca.jpg",
               "id": 87338,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Carlos Lamarca",
               "gender": 2,
               "credit_id": "52fe4890c3a368484e0ff509",
               "name": "Paulo Betti",
               "profile_path": "/nvGgplSiVVl3fhOByEqcxhczUgJ.jpg",
               "id": 55036,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Lieselotte",
               "gender": 1,
               "credit_id": "52fe4890c3a368484e0ff50d",
               "name": "Elke Maravilha",
               "profile_path": "/gVky310UqEi4Gh0f0OpVVVLMx7g.jpg",
               "id": 280680,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Brigadeiro",
               "gender": 2,
               "credit_id": "54ee7da1c3a3686d66005a65",
               "name": "Othon Bastos",
               "profile_path": "/cKZos1GKCQNHbaUqa9byGGl90rq.jpg",
               "id": 10061,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Policial gentil",
               "gender": 2,
               "credit_id": "54ee7dcb9251417961004fdf",
               "name": "Antônio Pitanga",
               "profile_path": "/w68VOq40SdlOAkHHG3OQ2K8saX5.jpg",
               "id": 230269,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Ana Angel",
               "gender": 0,
               "credit_id": "581822eb925141481f00155a",
               "name": "Fernanda de Freitas",
               "profile_path": "/vyG49RtnBAlv4RmbAtLCVypBfmA.jpg",
               "id": 1257193,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4890c3a368484e0ff4c9",
               "name": "Sérgio Rezende",
               "profile_path": null,
               "id": 109049,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4890c3a368484e0ff4cf",
               "name": "Sérgio Rezende",
               "profile_path": null,
               "id": 109049,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4890c3a368484e0ff4d5",
               "name": "Marcos Bernstein",
               "profile_path": null,
               "id": 10030,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.285611,
      "production_countries": [{
         "iso_3166_1": "BR",
         "name": "Brazil"
      }],
      "id": 73169,
      "vote_count": 12,
      "budget": 0,
      "overview": "\"Zuzu Angel\" covers the last years of the famous Brazilian fashion designer in her doomed quest for justice in the case of her activist son Stuart's arrest, torture, murder and subsequent corpse disposal by the military forces in early 1970s Rio de Janeiro, during the darkest era of Brazilian military regime and media censorship. Not even the fact that she was a widely known public figure saved her from being killed in a car crash in 1976, in one of the regime's favorite elimination techniques (many other similar \"car crashes\" still have to be re-investigated).",
      "similar": [],
      "original_title": "Zuzu Angel",
      "runtime": 108,
      "poster_path": "/zqeNZIMZN7xNUn0h46LLthH1s5R.jpg",
      "spoken_languages": [{
         "name": "Português",
         "iso_639_1": "pt"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Globo Filmes",
            "id": 13969,
            "origin_country": "BR"
         },
         {
            "logo_path": null,
            "name": "Lereby Productions",
            "id": 11446,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Toscana Audiovisual",
            "id": 93214,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2006-08-04",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://wwws.br.warnerbros.com/zuzuangel/",
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sergio Rezende"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Marcos Bernstein",
         "Sergio Rezende"
      ],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt0481254/",
      "coverLink": null,
      "actors": ["Stars: Patricia Pillar, Daniel de Oliveira, Leandra Leal | See full cast and crew »"],
      "reviews": [
         "\"Zuzu Angel\" covers the last years of the famous Brazilian fashion designer in her doomed quest for justice in the case of her activist son Stuart's arrest, torture, murder and subsequent corpse disposal by the military forces in early 1970s Rio de Janeiro, during the darkest era of Brazilian military regime and media censorship. Not even the fact that she was a widely known public figure saved her from being killed in a car crash in 1976, in one of the regime's favorite elimination techniques (many other similar \"car crashes\" still have to be re-investigated). Director Sérgio Rezende has a coherent oeuvre mainly dedicated to depict iconic figures in Brazilian political history, from congressman/vigilante/killer Tenório Cavalcanti (\"O Homem da Capa Preta\", 1986), to the persecution and assassination of left-wing urban guerrilla leader Carlos Lamarca by the military regime in the 1970s (\"Lamarca\", 1994), to the massacre of religious leader Antonio Conselheiro and his 25,000 followers by government troops in 1897 (\"Canudos\", 1997), and the rise and fall of Brazil's greatest 19th century entrepreneur, Barão de Mauá, who tried to foster Brazilian economical independence, confronting and, of course, ultimately beaten by huge international financial interests (\"Mauá: O Imperador e o Rei\", 1999). Though in all these films -- as in \"Zuzu Angel\" -- the subject, the historical moment and the political implications are far more riveting than Rezende's predictable, conservative treatment, they remain nonetheless valid initiatives to bring fictionalized versions of Brazilian history to the average movie audience. Rezende still struggles with his usual shortcomings: cliché script structure, underdevelopment of characters (all of them, except for Zuzu), uninspired dialog; his camera is too precious and well-behaved (the torture scenes don't have the slightest impact, they're are moody and well-lit instead of horrifying). His direction of actors is loose and underachieved: most of the cast is wasted, miscast or misdirected. Luana Piovani is (as usual) an embarrassment, Elke Maravilha's scene is cringe-worthy, veterans like Othon Bastos, Angela Leal or Angela Vieira are wasted (the exception is Nelson Dantas' great cameo), Daniel de Oliveira (who plays the important part of Zuzu's son Stuart) and Leandra Leal are mechanical and unsatisfactory, while Flávio Bauraqui and Aramis Trindade, as the baddies, are hammy to the point of caricature. Rezende's cinema lacks thrill, risk, boldness, essential qualities in a filmmaker dedicated to such electrifying political themes. However, \"Zuzu Angel\" still has considerable assets: first of all the real story of a successful, apolitical middle-class woman who, only through her tragic son's assassination and the disappearance of his corpse, developed political conscience and the strength to fight the autocratic regime, albeit taking self-immolating, strategically naive steps. Patrícia Pillar's performance as Zuzu is a wonder considering how little the script gave her: it's mature, intelligent and carefully conceived, and if it lacks greater contrast and tragic transcendence it's not her fault. Marcos Flaksman's art direction is flawless: the cars, sets, props take you right back to the early 1970s. Pedro Farka's cinematography is too \"beautiful\" for such a rough theme, but if it fails in thrilling power it succeeds in the \"postcard\" shots of Rio and Zuzu's fashion creations, meticulously recovered by costume designer Kika Lopes. The closing credit song \"Angélica\", written shortly after Zuzu's death by her friend Chico Buarque, is hauntingly effective. \"Zuzu Angel\" joins other recent Brazilian films (\"Que é Isso Companheiro?\", \"Quase Dois Irmãos\", \"Cabra Cega\", \"Ação entre Amigos\", \"O Olho do Furacão\" etc) in the reassessment of the deeply traumatic Brazilian military regime that lasted from 1964 to 1985, with multi-fold consequences through this day. \"Zuzu Angel\" -- though flawed in many ways -- is a sincere, committed effort by a coherent, honest filmmaker. If it doesn't thrill hearts and minds as it should, it's nonetheless better and more important than the many idiotic romantic comedies and soap-opera rip-offs that galore in contemporary Brazilian film-making.",
         "I read here in IMDb an user writing that it was a bad movie and no one should watch it. I totally disagree. It's a movie that shows Brazil in the 70's while the dictatorship was arresting people that was against it. The movie is a real story of a famous woman. Many unknown families suffered that days. It's an excellent movie that shows a really ugly part of Brazilian history. Patricia Pillar and Daniel Oliveira were excellent on the movie. (and the whole cast) Every Brazilian should watch it!!!",
         "Zuzu Angel is surprisingly a good movie. I didn't expect much from it cause it was made almost totally by a TV team (someone already noticed that it sometimes seems like an afternoon soap opera). Yes, the soundtrack is really obvious, and just everything is explained, which kind of irritates anyone used to watching good creative movies. I believe this simplified way the plot deals with the flashbacks and the political situation in Brazil, for example, is a way of trying to get in touch with a wider public. Many people may dislike it (my case) but we can understand it (my case again). However, both the great performance of all the actors - specially Patricia Pillar, who looks better and better every day - and the intensity of the story make sure it's worth to go to the movies and watch Zuzu Angel.",
         "Zuzu Angel was an iconic fashion designer during the 70's. Her works were applauded in New York, Madrid and, of course, Rio De Janeiro. Her happy and uplifting style still defines Brazilian fashion, even three decades after her tragic demise. This movie, brought up by Sergio Rezende, of \"Canudos\" and \"Lamarca\" fame, gets the right mood and the right aura of Brazil's 60s and 70's, portraying those dark times in a convincing way. The movie tells the story of Zuzu's crusade against the Brazilian Military Government (that spanned from 1964 to 1985, ruled successively by four military presidents), the same regime that murdered her son, a left-wing guerrilla fighter. Zuzu's life story was indeed full of drama, courage and determination, all the components of a good movie. However, Rezende's film is filled with bad acting and overtly dramatic dialogs. Worse, its understanding of Brazilian politics is the same that the one of a 12 year old kid. The film is saved, however, by the wonderful acting prowess displayed by Patricia Pillar and the always magical Flavio Bauraqui. Summarazing: Flawed, but worth watching.",
         "I did not expected much from Zuzu Angel. The critic was not favorable here in Brazil and after Olga I got really suspicious about historical movies specially made by Globo films. But I got to the movies and i like Sérgio Rezende work. He made good choices. It's not an all perfect movie, but it's reliable, not unfair to the historical facts and the acting is excellent. Made for the masses? Yes. But movies are made to the great public and must be enjoyable. I think every Brazilian should watch. It reminds me Antigone, specially the court scene. No matter what are the laws of a country, the family has the right and the obligation to give rest to their beloved kin.",
         "I got surprised with the story. I mean, did I? Exactly. An old story, even for a youngster like myself; however, still kinda fresh and worth watching. Two reasons: Patricia Pillar's performance, and it is a good memory pill to remind us (or make us aware) that once upon a time even celebrities could go to jail, be tortured, and get killed by our government for playing the B-Side of the record. Perhaps a third reason: Mr. Kissinger! Mr.Kissinger! Yes, the third reason explains why the whole world had to succumb and learn to (at least) poorly communicate in English within the last century to get something working for you. Poor Mrs. Angel! I really felt sorry for her. She had it all! The generals wives! The entire elite world of fashion at her feet... all but one thing. Her little Che! I feel ashame to find out that in such a place like Brasil (yes, Brasil with no \"Z\"), we let ourselves be invaded over and over by pirates in shapes of militia, or foreign policies, and then culturally. But hey! Like we say in Brasil after a few caipirinhas... zuzu bem... zuzu beleza... everything is just fine!",
         "Brazilians will go to this movie knowing how this will end. That does not necessarily diminishes its interest, as movies like Titanic can attest to (the ship sinks in the end). This movie, unfortunately, sinks right at the beginning. A deeply moving story, with the twists and turns of a Hollywood script, but based on real events, became worthy of an early afternoon soap opera. Everything is obvious and explained word by word to the audience - Nothing is left to imagination, because characters are as cliché as cliché goes. The director tried to be creative by making liberal use of flashbacks, but that does not change the general pace dictated by a conservative and uninspired script. The best is Patricia Pillar's performance, because she acts well even when everything is against her, and her natural beauty is enhanced by the awesome clothes she wears - a necessity, considering Zuzu Angel was a clothes designer. In short... don't bother. Watch it on video, while in bed with the flu, and just because you can't take comedies anymore.",
         "Brazil had 21 years (1964 - 1985) of military dictatorship and this still hurts many people who lived those times of horror and violence against people. From time to time those memories come up when a new film of TV series is done. \"Zuzu Angel\" is the newest of these products and again the hard reality of 60's, 70's and 80's comes back. \"Zuzu Angel\" is much more than a simple film! It's live history and also an important document which proves how courageous and dedicated a mother can be. This is also a good opportunity for the world to know Patrícia Pilar, a very good Brazilian actress. Worldwide cinema fans should enjoy this movie and use it as a tool to get in touch with the great cinema Brazil has done in the last 11 years.",
         "The real story of Zuzu Angel is incredible. Patricia Pillar and Daniel Oliveira are great actors. Why this movie is so terrible, boring, dull? There are a lot of reasons: Firs of all, Sérgio Rezende is a bad director and should think as quick as possible in the end of his career! The screenplay is risible. The writers create a kind of \"Smith Agent\" (the bad guy of Matrix) in the movie, that is responsible for all of the tragedies that happen in the story! The soundtrack...no comments! Please, don't watch ZUZU ANGEl and don't lose your time with it."
      ],
      "genres": [
         "Biography",
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "Globo Filmes",
         "Lereby Productions",
         "Toscana Audiovisual"
      ],
      "summaries": ["Based on the true story of Zuzu Angel, a famous Brazilian fashion designer in the 70's, who searches for her son Stuart, a member of a leftist university group who suddenly disappears during the darkest era of Brazilian military regime and media censorship."],
      "budget": 0
   },
   "movielensId": 62014,
   "movielens": {
      "languages": ["Português"],
      "releaseDate": "2006-08-04",
      "dvdReleaseDate": null,
      "directors": ["Sergio Rezende"],
      "runtime": 108,
      "movieId": 62014,
      "title": "Zuzu Angel",
      "mpaa": null,
      "actors": [
         "Patricia Pillar",
         "Daniel de Oliveira",
         "Leandra Leal",
         "Alexandre Borges",
         "Luana Piovani",
         "Aramis Trindade",
         "Ângela Vieira",
         "Flávio Bauraqui",
         "Regiane Alves",
         "Caio Junqueira",
         "Nelson Dantas",
         "Paulo Betti",
         "Elke Maravilha",
         "Othon Bastos",
         "Antônio Pitanga",
         "Fernanda de Freitas"
      ],
      "imdbMovieId": "0481254",
      "originalTitle": "Zuzu Angel",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "\"Zuzu Angel\" covers the last years of the famous Brazilian fashion designer in her doomed quest for justice in the case of her activist son Stuart's arrest, torture, murder and subsequent corpse disposal by the military forces in early 1970s Rio de Janeiro, during the darkest era of Brazilian military regime and media censorship. Not even the fact that she was a widely known public figure saved her from being killed in a car crash in 1976, in one of the regime's favorite elimination techniques (many other similar \"car crashes\" still have to be re-investigated).",
      "tmdbMovieId": 73169,
      "avgRating": 2.95455,
      "releaseYear": "2006",
      "numRatings": 11,
      "posterPath": "/zqeNZIMZN7xNUn0h46LLthH1s5R.jpg"
   }
}