{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "flying saucer",
            "id": 3243
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "ray gun",
            "id": 191256
         }
      ],
      "imdb_id": "tt0053337",
      "video": false,
      "title": "Teenagers from Outer Space",
      "recommendations": [
         84719,
         89858,
         52745,
         3149,
         23389,
         39311,
         30345,
         99008,
         43341,
         112481,
         36530,
         109122,
         29071,
         27831,
         35662,
         118641,
         139324,
         35911,
         59589,
         61855
      ],
      "backdrop_path": "/sgIT39BV4kchbRd9fU2Z0UjPNEI.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5607ea10c3a3681205004b65",
         "content": "Rock Lobster and the Skeleton Crew.\r\n\r\nAn alien race come to earth with less than honourable motives in their genes...\r\n\r\nGargons Will Rule The Universe!\r\n\r\nAh, well, one needs to have a modicum of interest in the \"Z\" grade sci-fi schlocker craze of the 1950s to even watch this picture. To understand why it exists, with a knowledge of budget restrictions etc, allowances can be made. Yet it's so dreadfully performed and constructed it asks for giant leaps of faith even from the most hardened of cult schlock fans.\r\n\r\nIn truth there's only enough material here to have filled a half hour Twilight Zone episode, in fact thinking about the acting this would have made a good silent feature. There's some fun in the ray guns used, which reduce living beings to skeletons, and the flying saucer is funky, hell there's even the notion that aliens get horny as well. But come the time when the rock lobster puts in a show, you wont know whether to laugh or cry... 3/10",
         "url": "https://www.themoviedb.org/review/5607ea10c3a3681205004b65"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Derek",
               "gender": 2,
               "credit_id": "52fe45969251416c91037949",
               "name": "David Love",
               "profile_path": null,
               "id": 131476,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Thor",
               "gender": 2,
               "credit_id": "52fe45969251416c91037951",
               "name": "Bryan Grant",
               "profile_path": null,
               "id": 131478,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Gramps Morgan",
               "gender": 2,
               "credit_id": "52fe45969251416c91037955",
               "name": "Harvey B. Dunn",
               "profile_path": null,
               "id": 131479,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Joe Rogers",
               "gender": 2,
               "credit_id": "52fe45969251416c91037959",
               "name": "Tom Graeff",
               "profile_path": null,
               "id": 131474,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Spacecraft Captain",
               "gender": 2,
               "credit_id": "52fe45969251416c9103795d",
               "name": "King Moody",
               "profile_path": null,
               "id": 111382,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Nurse Morse",
               "gender": 1,
               "credit_id": "52fe45969251416c91037961",
               "name": "Helen Sage",
               "profile_path": null,
               "id": 131480,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dr. C.R. Brandt, MD",
               "gender": 0,
               "credit_id": "52fe45969251416c91037965",
               "name": "Frederick Welch",
               "profile_path": null,
               "id": 131481,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Gas Station Attendant",
               "gender": 0,
               "credit_id": "52fe45969251416c91037969",
               "name": "Carl Dickensen",
               "profile_path": null,
               "id": 131482,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Alice Woodward",
               "gender": 0,
               "credit_id": "52fe45969251416c9103796d",
               "name": "Sonia Torgeson",
               "profile_path": null,
               "id": 131483,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Driver picking up Thor",
               "gender": 0,
               "credit_id": "52fe45969251416c91037971",
               "name": "Billy Bridges",
               "profile_path": null,
               "id": 131484,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Professor Simpson",
               "gender": 0,
               "credit_id": "52fe45969251416c91037975",
               "name": "James Conklin",
               "profile_path": null,
               "id": 131485,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "The Alien Leader",
               "gender": 0,
               "credit_id": "52fe45969251416c91037979",
               "name": "Gene Sterling",
               "profile_path": null,
               "id": 131486,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Moreal, Spaceship Crew",
               "gender": 0,
               "credit_id": "52fe45969251416c9103797d",
               "name": "Ralph Lowe",
               "profile_path": null,
               "id": 131487,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Saul, Spaceship Crew",
               "gender": 0,
               "credit_id": "52fe45969251416c91037981",
               "name": "Bill DeLand",
               "profile_path": null,
               "id": 131488,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Betty Morgan",
               "gender": 0,
               "credit_id": "5875d5fec3a3682b0d005aa2",
               "name": "Dawn Bender",
               "profile_path": null,
               "id": 131477,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45969251416c91037945",
               "name": "Tom Graeff",
               "profile_path": null,
               "id": 131474,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45969251416c91037987",
               "name": "Tom Graeff",
               "profile_path": null,
               "id": 131474,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.517548,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35139,
      "vote_count": 20,
      "budget": 0,
      "overview": "A young alien falls for a pretty teenage Earth girl and they team up to try to stop the plans of his invading cohorts, who intend to use Earth as a food-breeding ground for giant lobsters from their planet.",
      "similar": [
         272693,
         449176,
         10625,
         9880,
         308369,
         2105,
         222935,
         397837,
         3597,
         26123,
         43923,
         57214,
         10314,
         286565,
         37725,
         4951,
         9655,
         9377,
         37735,
         85350
      ],
      "original_title": "Teenagers from Outer Space",
      "runtime": 86,
      "poster_path": "/pHmXPfCarJSRErUo9LEVxgJqcAC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tom Graeff Productions",
            "id": 13941,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1959-06-01",
      "vote_average": 3.7,
      "belongs_to_collection": null,
      "tagline": "Thrill-crazed space kids blasting the flesh off humans!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Tom Graeff"],
      "runtime": 86,
      "synopsis": "Derek (Derek Love), a teenaged alien guy, among a small crew of extraterrestrials in a little silver flying saucer, has come to Earth on a \"seeding\" expedition where \"Gargons\" (the alien world's foodsource animal) are to be exposed to the atmosphere in order to note their reaction to the new world's air. If they are able to thrive, millions more of the creatures will be brought to the planet to grow, and eventually be harvested for their flesh. The crew are from a totalitarian world where children are raised without parents by the state, where freedom of thought is suppressed, and empathy mocked. The killer instinct is paramount, as shown by Thor (Bryan Grant), who kills a wandering pet dog (\"Sparky\") which approaches after hearing the landing saucer and, as the crew disembarks, a stern associate of Derek called Thor (Bryan Grant), is startled by the barking critter, and draws his silver ray gun and disintegrates the flesh from the dog, leaving a falling mass of bones. Derek, meanwhile, examines the bones of \"Sparky\", and notices a metal tag with his name and address stamped on it. He brings this detail to the attention of the ship commander (Robert King Moody), saying that it signals intelligent life on this world. Derek wants to return to the times pictured in a book when there were families and love. The captain tells Thor to keep Derek under watch after taking his book away - Thor tells him that he'll be executed soon. Meanwhile, the Gargons first seem to fail the test, having a negative response to Earth's atmosphere, but the creature then revives, and its cells divide even faster than expected. Earth will be a perfect place to breed these fast-growing, flesh-eating monsters. Moreal (Ralph Lowe) calms Thor down and tells him that the gargons will be picked from the air. The captain speaks to the alien Leader (Gene Sterling), who tells him to kill Derek if he keeps on being a nuisance. Derek, who has turned against the authoritarian beliefs of his home world through contact with a forbidden book (which he brandishes at the crew to explain his baffling change of heart), rebels against unleashing the killer Gargons on Earth, since they will attack higher beings, but the crew members all scoff at his weakness. Derek escapes to try to warn Earth. Derek speaks with a gas station Attendant (Carl Dickensen) who directs Derek to the Morgans'. A driver (Billy Bridges) gives him a lift. Grampa Morgan (Harvey B. Dunn) is told by his niece Betty Morgan (Dawn Anderson-Bender) that Derek wants to rent the room of the brother who has just gone away to start a new life with his wife. Derek is surprised that Betty has known her siblings. Betty shows Derek his room. Thor has been also given a lift by another human (Billy Bridges) who explains the pieces within the car. Grampa accepts Derek as a boarder until he finds a job. Betty gives Derek her brother's left-behind clothes. Joe Rogers (as Tom Graeff-Lockyear) talks to Betty and drives away. The petrol station attendant tells Thor where the other guy who dressed like him went. Thor kills the attendant and his driver and drives away. Betty is teaching Derek how to drive. They meet Alice Woodward (Sonia Torgeson), a blonde bombshell who's swimming in the pool. Finally, Betty notices Derek's name tag. Betty is appalled. Thor talks to Grampa, who's watering the plants. Derek and Betty go to the landing site in the middle of the desert, where Sparky's bones still are. Thor also meets Alice, who is rude to him and swims away, and Thor kills her. Betty leaves a not to her sleeping grandfather. He's woken up by Joe, who's a journalist. Joe is Betty's boyfriend, and he's investigating a double murder. Grampa tells Thor that Derek and Betty have gone to Prof. Simpson (James Conklin)'s office and her secretary tells them he hasn't arrived yet. Thor reaches him first and kills him. Then, he jumps from the window. Derek, Betty and his secretary find the skeleton. Betty is worried about Grampa and tells him to go to the police. Grampa hides from Thor and leaves through the back door. The police fight Thor. Mac (Jim MacGeorge) wounds Thor. Harry (Kent Rogers) leaves after him. Betty talks to Joe and he talks to Grampa. Derek picks up a gun. Thor was hiding in a car, forces Betty and Derek inside the car and they go to see Dr. C. R. Brandt, MD (Frederick Welch), who was about to leave. Thor tells him to take away the bullet. Thor didn't kill Derek because he's the son of their leader. Thor wakes up sick but without the bullet and alone at Brandt's office. Thor faints. Nurse Morse (Helen Sage) tends to Thor, so she can't pick up Brandt's call. Thor takes Morse hostage. Mac and Harry go to look in a cave where the aliens have left the fast-growing lobsters. Thor and Morse also go there. Morse steers and saves Harry's life after the gargons had killed Mac. Thor beats Morse and drives after Harry. Morse wakes up. She jumps from the car which falls off a slope. She talks about the monsters at the cave with Harry. Betty realises that Derek is an alien. She thinks that he looks like his grandfather when younger. Derek decides to stay at planet Earth. They frenchkiss. Betty wonders why there are no crickets making noise. Suddenly, the monster lobster attacks her. Derek throws a stone at he and then they both drive away. A search party is killed by the huge black lobster. It makes the front page of the newspaper. Derek knows that the beast will end up attacking the city, if only for food. A man (Robert \"Bob\" Regas) calls the police about having seen the monster. A news caster (Robert Williams) gives the news, and says that everybody is evacuated except for Derek and Betty. Grampa is still looking for Betty. Joe will help him. Betty and Derek find the monster. She tells an electricity generating-plant technician (Don DeClue) to turn the power on at the right moment when Derek has put a wire around the monster. The technician gives more and more power until the monster dies. Derek needs to leave before Grampa and Joe arrive, as Betty will stay with them. Derek drives away but remembers sentences said to him. Betty tells Grampa and Joe about Derek being an alien, and the monster, and the psycho killer who had been going around killing people. Derek is at the Morgans'. He doesn't even say goodbye to Betty. He will go to hospital searching for Thor. Harry is taking Thor away from hospital. Derek takes Thor at gunpoint. He tells Thor that he won't kill humans because they'll be dead soon enough. Meanwhile, Grampa and Betty look for Derek in the desert. Betty, Derek, Joe, Thor and Grampa see the spaceship land in the desert. Betty cries because Derek is leaving him. The captain and the leader are there. They need to go back fast because Derek hasn't been the only one who read the book, and a revolution may arise if the leader is not in the planet. On the other hand, the leader admits that Derek is his son, and that he's been following him from afar. Derek enters the spaceship cheating his father, his captain and Thor outside. He tricks the other spaceship with the dangerous animals into going faster when entering the atmosphere and crashing onto the ground. He sacrifices himself for the Earth's well-being and dies. Betty, Grampa and Joe survive because they hide in the cave. They walk out of the place. ---written by KrystelClaire",
      "writers": ["Tom Graeff"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053337/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNjA3MjU1Nl5BMl5BanBnXkFtZTcwMTY0NzI0NQ@@._V1._CR44,34,279,420_SX214_AL_.jpg",
      "actors": ["Stars: David Love, Dawn Bender, Bryan Grant | See full cast and crew »"],
      "reviews": [
         "This film is a prime example of the low budget 1950s B movie sci-fi. This movie is the 50s and that's the best reason of why you should see it. Anyone who is interested in 50s sci-fi, has to see Teenagers From Outer Space. The flaws are so numerous they can't be counted, and the acting is as bad as the script. The only monsters in the movie are the Gargons, which are lobsters. Apart from these flaws, Teenagers From Outer Space is a fun movie. I've watched it several times and find it very entertaining. The alien's death ray gun is quite impressive, as are the scenes in which it is used. View this movie remembering it is 1959. I would think this film would have been quite popular and very scary back then. Sit down, relax and get a bowl of popcorn. Pop in the DVD or VCR and have a good time watching this fun, exciting 1950s sci-fi thriller.",
         "I first saw this film when I was only 7 and even then I knew there was something . . .well . . .different about it. For one thing those are the oldest looking teenagers I ever saw; then again all those JD movies offered actors who looked too old even for college in the roles of \"kids\" so we can't hold that fact against this film. The reason the aliens have come to our world is also atypical of 1950's films. They don't want to conquer the Earth, they don't want to re-populate a war devastated world. They are hungry and in need of a square meal and Earth is the perfect spot to breed the creatures they use as food! They call the creatures Gargans but they look a lot like lobsters. Of course since this is a science fiction picture, the atmosphere of Earth causes the Gargans to grow so large a single one could keep a Red Lobster in business for months! the effects budget was so low we never see the actual giant monster, just an empty travelling matte! Most memorable are the ray guns used by the bad aliens . . .er . . .the intergalactic juvenile delinquents. As the original trailer said \"They blast the flesh off humans!\" and quite a few people get zapped into skeletons. There is one good alien, a sensitive fellow named Derek (David Love) who stands alone against his own people when he suggests they go raise their favourite meal on some other planet. Derek is unaware that he is the son of the leader of the planet, a fact which is not exploited nearly as much as it should be in this film. The cast includes Harvey B. Dunn, best remembered as the police inspector in BRIDE OF THE MONSTER. Harvey was a professional clown and performed at parties with his trick bird (the bird appears in BRIDE also). Yes it's an offbeat film but worth a look. Get ready for a tearjerker ending that is telegraphed well in advance.",
         "My 10/10 rating assumes that you're the type who's decided that you like \"Teenagers from Outer Space\" before watching it. It portrays an alien race coming to earth to let their lobster monsters grow and devour all humans. As an example of what these aliens are like, they have disintegrating guns that can turn you into a skeleton in the time that it takes to blink. But, one of the aliens named Derek (David Love) decides that he doesn't like their plans and escapes. Most of the rest of the movie has another alien looking for Derek while the latter hides out with human Betty Morgan (Dawn Anderson) and her grandfather. Yeah, it sounds like your average '50s B-movie, but it's still really neat. One of the many movies that truly makes one nostalgic for the era when one could go to the drive-in and see these sorts of flicks, mainly because Betty was kinda hot (well, duh; it seems like all the women in these B-movies were). And I don't think that the aliens were actually teenagers. Still, I can't quite figure out: why would an alien be named Derek?",
         "'teenagers from out of space' has grown on me a LOT since the first time i saw it. true, it isn't a very good movie, but considering how they used what little they had to work with (budget-wise, acing-wise, etc.) i'd say this movie deserves a bit more respect. the effects were cleverly planned (if not well-executed), the fairly inexperienced actors weren't terrible ( except for TORCHA! guy, but he's so bad he's great), and it had a decent plot with a fairly atypical ending. (okay, there's no excuse for the lobster. the lobster was just terrible.) it's no 'godfather' (heck, it's not even 'cannibal: the musical'), but, in the vein of 'night of the living dead', 'teenagers' takes very little and makes something decent with it.",
         "- Aliens land on Earth to determine whether or not the planet is suitable for raising their Gargons (a creature raised by the aliens for consumption). It seems that these Gargons are quite ferocious and as big as a house when fully grown. Therefore, they require their own planet. But releasing the Gargons on Earth will wipe out all of humanity. One alien, Derek (David Love), has second thoughts about killing the inhabitants of Earth. He leaves the group to warn the citizens of Earth. What he doesn't know, however, is that one of the other aliens has been sent to stop him. - While I've seen worse, Teenagers from Outer Space is really not a very good movie. Most of the acting is terrible and the dialogue is even worse. The \"teenagers\" mentioned in the title appear to be mid-20s to early-30s in age. The flying saucer used by the aliens is about ten feet in diameter, yet can carry 6 or 7 human sized aliens. The Gargons are really just lobsters. The full-grown Gargon is a shadow of a lobster projected onto the film to make it look huge. Much of the movie is laughable at best. - But, Teenagers from Outer Space is not as bad as it could have been. Underneath the cheese is a nice little story just aching to get out. The two leads (David Love and Dawn Bender) do their best. There is a real chemistry between the two that comes through even the most hokey of scenes. Although they might have lacked real talent, they appeared to be trying. So many of these 50s sci-fi films have actors that just appear to be going through the motions. - The aliens use some sort of hand-held death ray weapon. And, for this kind of movie, the results are rather gruesome. In a lot of these movies, when someone is shot with a ray gun, they either fall down without a scratch to be seen or just disappear. Not here. When the human (and canine) victims are hit with these ray guns, all tissue disappears leaving only a (obviously plastic) skeleton. It's not a very pleasant way to go. - I watched the MST3K version of the movie. As usual, there were a few good laughs to be had. But this is one movie that I'm going to try on its own. I think it deserves to be judged that way.",
         "If you like unintentionally bad movies from the 50's, you will absolutely LOVE Teenagers From Outer Space. First of all, you pretty much know what you're getting with a movie that has \"teenagers\" and \"outer space\" in the title...this masterpiece offers some of the worst acting, plot, script and f/x you will ever see, and all rolled into one neat little package. There is enough action and stupidity to keep you interested all the way through. Notice the voiced-over (obviously human) barking of the dog Sparky (RIP) at the beginning, classic. Interesting too is the fact that the actor who played the ship's captain (the guy with, not one, but TWO v's on his astro suit) went on to become the original Ronald MacDonald. I'm lovin' it, and you will too.",
         "I know it sounds stupid, but I saw this movie last night and it's not as bad as some of the descriptions make it out to be. Maltin gets a little hoity-toity in his reviews; a movie doesn't have to be \"The Color Purple\" to be worth watching. It's not Oscar material to be sure and the effects are _awful_, but the writing is a lot better than most films of this ilk and the action/acting is OK. If you're busting code out at 3 AM and this comes on, don't turn the channel. Kind of an interesting flick.",
         "Tom Graeff's entire film career consisted of this one film and work editing another. He shot it for $5000, performed much of the work himself, and gave his boyfriend David Love (Charles Robert Kaltenthaler) the lead role. Graeff was 28 and Love 23 when the film was shot. Graeff died 12 years later after an apparent mental breakdown; no one seems to know what happened to Love. Amazingly, Warners paid $25,000 for distribution rights for this clunker at a time when teen audiences were eating up sci-fi movies. More bizarre details about the film, including props and locations used, are at the Daddy-O's Drive-In Dirt website.",
         "I enjoyed Teenagers from Outer Space in that there is a spiritual significance to it. Admittedly, I saw the whole thing but recently, as when I saw it on TV March 19, 1965, I caught it in the middle of it, after my kid brother had turned it on. What sort of spiritual meaning the movie has was brought out by Derek's rebelliousness. He justifiably inveighed against the others' plans to make Planet Earth breeding ground for the Gargons, pointing out the Earth has intelligent beings. Derek also criticized the rule on their home planet, set up to breed a Supreme Race, breeding babies like livestock and denying them knowledge of their parents, brothers, and sisters, executing all who age or become ill. Such suggests that with the universe infinite, other planets may well be inhabited by intelligent beings who share Earth peoples' belief in the one God Who created the universe, and all life in it. (Derek seemed to be of that belief.) Derek DID believe in loving one another; he loved Betty Morgan and her grandfather; he loved her reporter beau Joe Rogers and her best friend Alice Woodward; he loved Dr. Brandt and his nurse Miss Moss-- and everybody else whom he met. Further, Derek adjusted beautifully to life on Earth, taking the room that Bud Morgan (Betty's brother ) had and wearing clothes that Bud had left, learning easily how to drive Grandfather Morgan's car. Indeed, when grasping at means of killing the Gargon, Derek looked at the overhead electrical wires and knew what they were for, as he put it \"source of energy for illumination and power in the home\". Most of all, at the end he steered the ships bearing more Gargons to one spot to crash onto the guide ship-- which killed all of them, including himself! Looking down from the sky, he declared his intention to make the earth his home, and never leave it. You do not find too many as noble and u",
         "****SPOILERS**** With the explosion of youth-oriented movies mixed with science fiction coming out of Hollywood in the 1950's with movies like teenage Werewolves Frankensteins and Zombies a movie about teenagers from outer space couldn't be that far behind. Landing in the outskirts of town a spacecraft with a number of the crew looking like they just came off the set of a beach party movie plan to release a horde of deadly Gorgans, a crustacean-like creature, that will grow to enormous sizes and devour the entire human race. Later the aliens plan to use the Gorans as lobster soup lobster salad and about a dozen lobster main course dishes to supplement their planets dwindling food supply. Derek a sensitive as well as rebellious youth, just like the teenagers in many movies made at that time, gets very upset when his fellow spaceman,Thor,shots Sparky, a cute little doggie,who was barking at him and turned the poor pup into a bag of bones. Derek is also secretly reading \"The Book\",that has been banned by the Leader of his planet, and \"The Book\" is putting bad ideas into Derek's head of how his planet is being run. The movie tries to be a little more adult then most teenage movies released at that time with Derek more interested in saving the Earth from the deadly Gorgans then wanting to party around and drive fast sport cars and make out with the girls like you would expect him to do in most teenage movies like this one. The story is ridicules as Derek is being persuaded by his fellow teenager from outer space Thor in order to either kill him or bring him back home to the Leader. The leader we later find out is Derek's father. The scenes when Thor uses his disintegration gun to turn people and animals into skeletons and the sight of the deadly Gorgans are hilarious instead of scary as the makers of \"Teenagers from Outer Space\" would have wanted them to be. The ending of the movie with Derek tricking his father, the Leader, and fellow spacemen into destroying themselves with him included was all too predictable and didn't come off as good as it would have if Derek were to be left alive with his earthling girlfriend Betty and live happily ever after. You would have hoped that the heartless aliens would have seen the light by getting influenced by the loving and family oriented earthlings and thus be able to see the errors of their ways. Then they would have converted to become members of the human race, like Derek tried to do and become. But that as we all saw in the movie was sadly not to be."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Tom Graeff Productions"],
      "summaries": ["A young alien (David Love) falls for a pretty teenage Earth girl (Dawn Anderson) and they team up to try to stop the plans of his invading cohorts, who intend to use Earth as a food-breeding ground for giant lobsters from their planet. The invaders, who arrive in a flying saucer, carry deadly ray guns that turn Earth-people into skeletons."],
      "budget": 0
   },
   "movielensId": 6208,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-06-01",
      "dvdReleaseDate": "2003-02-18",
      "directors": ["Tom Graeff"],
      "runtime": 86,
      "movieId": 6208,
      "title": "Teenagers from Outer Space",
      "mpaa": "",
      "actors": [
         "David Love",
         "Bryan Grant",
         "Harvey B. Dunn",
         "Tom Graeff",
         "King Moody",
         "Helen Sage",
         "Frederick Welch",
         "Carl Dickensen",
         "Sonia Torgeson",
         "Billy Bridges",
         "James Conklin",
         "Gene Sterling",
         "Ralph Lowe",
         "Bill DeLand",
         "Dawn Bender"
      ],
      "imdbMovieId": "0053337",
      "originalTitle": "Teenagers from Outer Space",
      "genres": [
         "Crime",
         "Horror",
         "Science Fiction",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "dQYlvwp6Ip0",
         "j4eQG0I9lsg"
      ],
      "plotSummary": "A young alien falls for a pretty teenage Earth girl and they team up to try to stop the plans of his invading cohorts, who intend to use Earth as a food-breeding ground for giant lobsters from their planet.",
      "tmdbMovieId": 35139,
      "avgRating": 2.01415,
      "releaseYear": "1959",
      "numRatings": 106,
      "posterPath": "/pHmXPfCarJSRErUo9LEVxgJqcAC.jpg"
   }
}