{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "depression",
            "id": 894
         },
         {
            "name": "harvard university",
            "id": 2463
         },
         {
            "name": "rolling stone",
            "id": 2465
         },
         {
            "name": "writer",
            "id": 13028
         },
         {
            "name": "therapy",
            "id": 40952
         },
         {
            "name": "mental illness",
            "id": 41329
         },
         {
            "name": "young adult",
            "id": 206298
         },
         {
            "name": "degradation of lifestyle",
            "id": 221805
         },
         {
            "name": "lou reed",
            "id": 221806
         }
      ],
      "imdb_id": "tt0236640",
      "video": false,
      "title": "Prozac Nation",
      "recommendations": [
         17236,
         35851,
         128842,
         285844,
         285838,
         42380,
         32248,
         12612,
         82477,
         33135,
         32150,
         175956,
         74718,
         10109,
         37850,
         32229,
         206,
         32162,
         250572,
         324291
      ],
      "backdrop_path": "/76T47DQMzk0xc8YYGPNzptxluSE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Elizabeth Wurtzel",
               "gender": 1,
               "credit_id": "52fe46ba9251416c750817bb",
               "name": "Christina Ricci",
               "profile_path": "/dzB58d6fNrTEi7nBAU1tySJc2at.jpg",
               "id": 6886,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rafe",
               "gender": 2,
               "credit_id": "52fe46ba9251416c750817bf",
               "name": "Jason Biggs",
               "profile_path": "/7CcISIHMvpzcUVo4NmxgA6f71RQ.jpg",
               "id": 21593,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dr. Sterling",
               "gender": 1,
               "credit_id": "52fe46ba9251416c750817c3",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ruby",
               "gender": 1,
               "credit_id": "52fe46ba9251416c750817c7",
               "name": "Michelle Williams",
               "profile_path": "/xaRSSWD3jD1KpyjWgzzDP5lO5DS.jpg",
               "id": 1812,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Noah",
               "gender": 2,
               "credit_id": "52fe46ba9251416c750817cb",
               "name": "Jonathan Rhys Meyers",
               "profile_path": "/A6RyyQ4GeXl0ugnGrqGqBMQIgKh.jpg",
               "id": 1244,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mrs. Wurtzel",
               "gender": 1,
               "credit_id": "52fe46ba9251416c750817cf",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ba9251416c750817d5",
               "name": "Erik Skjoldbjærg",
               "profile_path": "/39ItHz2wcUHjRFnFMNDwR75KR02.jpg",
               "id": 95760,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "56ddc5f1925141188300010f",
               "name": "Elizabeth Wurtzel",
               "profile_path": null,
               "id": 224682,
               "department": "Writing",
               "job": "Book"
            },
            {
               "gender": 1,
               "credit_id": "56ddc606c3a3685d720000e5",
               "name": "Galt Niederhoffer",
               "profile_path": "/eDeP5c0pi6MX7ppKXpcU0qlIKCz.jpg",
               "id": 53276,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "56ddc65d925141187f000124",
               "name": "Frank Deasy",
               "profile_path": null,
               "id": 1233953,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56ddc67ec3a3685d67000119",
               "name": "Larry Gross",
               "profile_path": null,
               "id": 1725,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "59d4477b9251414b4500c019",
               "name": "Christina Ricci",
               "profile_path": "/dzB58d6fNrTEi7nBAU1tySJc2at.jpg",
               "id": 6886,
               "department": "Production",
               "job": "Co-Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.449149,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 16229,
      "vote_count": 95,
      "budget": 0,
      "overview": "Elizabeth is on the verge of losing her grip on life after she leaves her emotionally fraught home to start college. Quickly, her life takes a turn for the worse: She clashes with her roommate and decides her boyfriend, Rafe, is her sole salvation. Her psychiatrist prescribes Prozac … but is that her only choice?",
      "similar": [
         82693,
         12662,
         157851,
         8272,
         14474,
         31414,
         523,
         511653,
         63945,
         511650,
         137776,
         511659,
         511658,
         511645,
         511643,
         42679,
         15842,
         295721,
         14234,
         511661
      ],
      "original_title": "Prozac Nation",
      "runtime": 95,
      "poster_path": "/dQ27zo9fbbqPZ4AfSvOL7AEl75G.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "2001-09-08",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Pledge allegiance. Life's a drag.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Erik Skjoldbjærg"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Elizabeth Wurtzel",
         "Galt Niederhoffer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0236640/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2MDEyODkwMl5BMl5BanBnXkFtZTcwMzM3ODkyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Christina Ricci, Jonathan Rhys Meyers, Jessica Lange | See full cast and crew »"],
      "reviews": [
         "I think I should start by stating that I was hungry for this film, the book Prozac Nation, which chronicles Elizabeth Wurtzel's battle with depression, meant so much to me and each delay to the film (and there were many) only served to increase my desire to see it. Then I watched it\u0085. and from the opening scene my heart sank. But lets get things straight first, it is a good film, probably would never win any awards but there are worse ways to kill a couple of hours. The performances, from a cast that includes Jessica Lange and Anne Heche, are solid (although somewhat unfairly Jason Biggs will always be the guy who humped the pie in my eyes) and in the case of Christina Ricci, who played Wurtzel herself, exceptional, the soundtrack's cool (well it does include The Pretenders, Lou Reed and Bruce Springsteen after all) and if you haven't read the book you'll probably like, maybe even love, it. However therein lies the problem, a film based on an international bestseller is surely aiming itself at a target audience of its readers and for this film that's the very people who are least likely to enjoy it. The film sucks out all the depth that made the book so brilliant and so important to millions, for example, instead of being a emotionally messed up young woman who fears abandonment and uses sex and anger as defence mechanisms, Wurtzel becomes a bitchy, whiny slut who is difficult to relate to or feel sympathy for. Furthermore the time constraints lead the film to focus solely on the Harvard years cutting out the important childhood/teen years and leading to a resolution which occurs far to early making depression seem like a problem which can be solved within a year. However I suppose the biggest problem the film has to overcome is the fact that reading Prozac Nation is a highly personal and private thing, meaning no film will be able to compare to the one the readers have already seen in their heads.",
         "I thought that the main problem with Prozac Nation was that it just seemed to lack focus. The movie obviously compressed a lot of details in the book, but I think if it had just focused on the main crisis of the book, the character's descent into depression would have been easier to understand and empathize. As it was, it tried to do that, but it also tried to cram in other things, and I feel that if I hadn't read the book or gone through something similar myself, I would not have understood why Lizzie was so afflicted at this particular point in her life. I thought the acting was excellent: Michelle Williams and Jason Biggs were great, and Christina Ricci was phenomenal, capturing the entire range of the pain and anger and self-loathing of depression. I thought Jessica Lange put in a good performance, although her bizarre accent and the fact that she in no way resembles the darker and petite Christina Ricci was really distracting. I was simply unable to believe she was her mother, and certainly not a Jewish mother. If you're a fan of one or more of the actors, I would watch the movie for the sake of appreciating their skill. Or, if you've suffered from severe depression, then watch it and know that there are other people who feel the same way you do and think the same thoughts as you, and who would understand why you feel and act the way you do. Otherwise, skip it. If you don't understand depression before going into the film, it is unlikely that this it will shed any light on the topic for you. It's pretty much impossible to understand unless you've been there yourself.",
         "I have never read the book, now I want to. Seeing this movie really touched me. I cried all the way through it. Living in a small northern town in British Columbia, I've always thought I was alone, fighting a battle that could never be won. Watching this movie, was a sigh of relief. It was like she was telling my story. Many stories. Explaining exactly what it feels like, the demons in my head, the spinning, the realistic, the logical point of view, what we know is real, but what we feel is two different things. She has this brought to life, making sense to the rest of the world what is and isn't wrong with us. I see the news, talk with the people around me, and it seems like everyone has been, or knows someone that has been on anti-depressants. They are not, and will be the quick fix, but between therapy, and anti-depressants, it has saved my life. I have heard many comments about how anti-depressants don't work, and that they are just a quick fix. It takes a lot of hard work, and therapy that goes with anti-depressants to make it work. I totally agree in the film where she said it would help her to be able to see things in a different light. This is truly a wonderful, and amazing film and I'm looking forward to reading the book.",
         "well if you're one of those rare creatures that would answer with a 'no' then watch this movie you'll understand how hard is get out of a bed when you are depressed, how hard is to find a reason to live and why you just can't explain the way you feel. Cristina Ricci is an amazing actress indeed. portrayed this problem in such an excellent way that gave you the right idea is not a romantic or dramatic, or pathetic point of view at all, just the way it is. its a simple story with a simple explanation for a complicated issue, the reason why sometimes you can't just look forward a supposed good life, no matter how good you are, how brave you look, or how easy your life looks. there's also issues that actually affect our youngsters this days, and changes during the movies, the Part that Jonathan Rhys Meyers has here is small and looks like non important at all but it is, he's crucial for the whole story to be told, shows the difference between a depression patient and just a messed up kid. An amazing movie made from an Amazing book.",
         "I really liked this movie, growing up I was always so confused about the way I felt. The way Wurtzel acts is almost identical to way I would act growing up, and I always felt so alone like no one understands me. After seeing that movie, it brought tears to my eyes. Just the realness of it. I now take Prozsc. But how I picked out the movie, I was in the video store and saw it just stood out to me. I didn't even know what it was about, just something about it made want to watch. I watched it twice, I never watch movies twice. Me being on Prozac actually helps me and I don't feel disoriented or anything. Maybe they have perfected it since the 80's. I was shocked I didn't even know they had ant-depressants then. But in any even its an awesome movie, I think parents should really watch it because I don't think they realize what they are doing to their children.",
         "I think you have to know someone that behaves like Christina Ricci's character in this movie in order to appreciate the reality of the performance. I felt that it was very real and as such yet another tour de force for Christina. Shame on Miramax for burying this labour of love. Obviously the Weinsteins are not about art. Just remember Harvey ... you can't take it with you. This film has to be the only cult classic that has NEVER been released in the US. The energy for the plot is supplied by the trajectory of the main character played by Ricci. We follow her as she enters Harvard through her initial successes and through her problems that develop as she pushes herself too hard to achieve her own personal goals. Christina is beautiful and compelling throughout. Jessica Lange is also very good. The plot moves with good cadence and the cinematography is vibrant. The little girl at the end seems to symbolize the re-birth of the protagonist as she overcomes her demons with the help of prozac.",
         "I picked up the DVD of \"Prozac Nation\" at a great low price, and I am pleased to say that this movie was well worth the money. I liked this movie so much that I can't wait to read the book when I find it (the film is based on the novel of the same name). The movie tells the true story of Elizabeth Wurtzel (played by the beautiful Christina Ricci)and her battle with depression. She gets tired of life and nears suicide. However, she struggles to stay alive throughout her life in the 1980's, when sex and drugs ruled. Christina Ricci was the best at acting in this film. Her performance was very realistic and true as the depressed Elizabeth. I myself had to combat depression before, so I know the things she was going through, and I know how she feels. She was really trying her best to survive in the movie, and I appreciate the film-makers efforts to show it on the screen. And aside from her character in the film, Christina Ricci herself was beautiful; her gorgeous nude body is shown at the beginning of the movie! The movie put great effort to give the background scenery an 80's feel, since the book was based in the 1980's. However, I noticed that there were glaring anachronisms (mistakes in the timeline setting of the movie) that distracted me slightly from the story. But still, I got over it and continued watching the movie. The anachronisms was one of the two things that I didn't like in the movie. The second thing I hated was Elizabeth's mom (played by Jessica Lange); she was a very annoying and clichéd character. Without Jessica Lange's exaggerated performance, the movie would have been nearly perfect. Aside from those two things, the movie was very good and interesting. I never imagined that there would actually be a true story about depression portrayed in a movie. It was good to see this movie, since it would help spread awareness about depression. It's too bad that the author of the book didn't like the film. I give this film an 8/10.",
         "Congratulations to Christina Ricci for making this movie and putting her mojo behind this important subject and trying to make a great film. Ricci is my favorite actress: She is so gifted, so natural, her reactions are perfect and so is the energy she constantly radiates, which gives credence to the often misapplied term \"star.\" The film misses its mark for lots of various reasons, but perhaps most notably for the story's seeming unadaptability to the screen in making it a compelling narrative...more on that later. The cast at first glance is excellent, but come to think of it, Jessica Lang as the Jewish mother is too Protestant and not exactly right, Ann Hetch doesn't come close to showing the compassion and dedication of the psychiatrist from the book, and when your making a movie, how can you justify saying no to Anne Heche and Jessica Lange? But the real problems are in the film's construction: first in the failure to elicit any kind of lasting sympathy for the Elizabeth Wurtzle character, and second to say anything meaningful regarding the all too common and horrible situation that this poor girl finds herself in. Unfortunately do to the flashback construction, Lizzy merely comes off as certainly more affected teenager than most, but not nearly as devastatingly ill as she comes off in the book. This is a major problem. This story had to be told from beginning to end and from the therapist's couch. She is only eight or nine when her depression starts due to devastating social factors, both society and the home, and this is a crucial point in not only eliciting the proper sympathy for her but also of the gravitas of her case. She is so talented, and such a vulnerable and disaffected spirit so early on, that one's heart can't help but reach out to her due to her victimization. This is missed on the film. Ultimately one has to come to terms with what the film is trying to say: it is a biopic of one severely affected girl, but also it is a film about a nation who can't get its act together; that is very clear in the book but interestingly not in the film where the chosen at Harvard are even more messed up than the average college enrollee. The film finally isn't able to get either of these messages across compellingly, and that's too bad. Is Prozac a good thing or is it a bad thing, or a mixed blessing or a seeming necessity in a country in which so many people can't function without a chemical crutch? These are tough and challenging concepts to work with and the writing does not really attempt to address any of them in a more or less engaging way. The Challenger disaster is an interesting image to symbolize a dysfunctional America, but that doesn't have the effect it's suppose to have due to the crosscutting and insufficient earlier development of controlling themes. Ricci's performance is tight and heartfelt, and one of the best of her acting career. Michele Williams is also superb in her role.",
         "If you're coming to this film to learn something about depression, forget it: you won't learn anything except how not to write a screenplay on the subject. I understand the intent was to show how severe depression can turn an average person into a complete wreck, but the result is the most one-dimensional character I've ever seen in a Hollywood feature... no small feat. Christina Ricci as Elizabeth spends the entirety of this film screaming at the top of her lungs, viciously insulting someone, bursting into tears or some combination of the three (the only exceptions being some quiet sulking at the beginning and end). There is not the slightest hint of what she might be like WITHOUT depression... not the faintest glimmer of any other aspects of her personality... she just screams. At one point, her roommate tells her, \"Lizzie, you're such a fun person to be around when you're not being depressed,\" and my reaction was, \"She IS?\" It seemed odd that the writers would include this comment without giving us any examples, but this script is a lesson in incompetence. It has no discernible structure or flow at all; instead, it consists of a series of awkwardly strung-together scenes of Lizzie screaming, then ends. Character development? No... Scenes of her everyday existence, i.e. going to classes, that might possibly be important details? No... Screaming at maximum volume? CHECK. It's not quite enough, I'm afraid. 1/10.",
         "I believe Erik Skjoldbjærg holds the record for most 'J's in a director's name, but apart from that, he also shows good restraint and a keen eye for narrative and detail in helming 'Prozac Nation.' Basically a period piece set in the mid 80's, the film relates the collegiate memoirs of Elizabeth Wurtzel, who now writes a music column for The New Yorker. Christina Ricci plays the part of Wurtzel and does passably well, though I couldn't help noticing the actual Wurtzel bears more than a slight resemblance to Anne Hathaway. The film gives a sympathetic account of Wurztel's struggles with substance abuse and depression while being a journalism prodigy and dealing with undergraduate studies at Harvard. Friends and family run out of patience in trying to secure help for her as she tailspins into a suicidal funk. Eventually, she allows herself to be medicated on Prozac, which sort of stands as the anticlimactic resolution of the film. Jason Biggs does a fine job portraying her first serious lover, and they have a couple very powerful scenes together which I would recommend that people watch if they are at all concerned about heir own tendencies to romantically obsess over other people. Jessica Lange falls a bit into melodrama in portraying Wurtzel's frazzled mother, but Michelle WIlliams gives a very strong performance as Wurtzel's supportive but overwhelmed roommate. Anne Heche turns in a *meh* performance as Wurtzels's shrink. Lou Reed plays himself and in one incredibly frightening scene he gently strokes Ricci's face (don't get too alarmed, it happens in a fantasy sequence). I find it sort of sadly hilarious that this film, which appositionally refers to America in its title never received a U.S. theatrical run. Americans should probably all watch this movie."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Miramax",
         "Millennium Films",
         "Cinerenta Medienbeteiligungs KG"
      ],
      "summaries": [
         "Elizabeth \"Lizzie\" Wurtzel is a teenager accepted into Harvard with a scholarship in journalism. She has been raised by her divorced mother Mrs. Wurtzel since she was two years old, but she misses her father and feels needy and depressive. When she joins the university, she lives with a roommate Ruby and has her sexual initiation with Noah. Her article for the local column in Crimson newspaper is awarded by Rolling Stone magazine. Lizzie becomes abusive in sex and drugs, and her existential crisis and depression increases and she hurts her friends and her mother that love her, while dating Rafe. Mrs. Wurtzel sends her to an expensive psychiatric treatment with Dr. Sterling, in spite of having difficulties paying for her medical bills and therapy sessions. After a long period of treatment under medication, and suicide attempt, Lizzie stabilizes and adjusts to the real world.",
         "A young woman struggles with depression during her first year at Harvard. Based on Elizabeth Wurtzel's novel."
      ],
      "budget": 9000000
   },
   "movielensId": 6222,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2001-09-08",
      "dvdReleaseDate": "2005-07-05",
      "directors": ["Erik Skjoldbjærg"],
      "runtime": 95,
      "movieId": 6222,
      "title": "Prozac Nation",
      "mpaa": "R",
      "actors": [
         "Christina Ricci",
         "Jason Biggs",
         "Anne Heche",
         "Michelle Williams",
         "Jonathan Rhys Meyers",
         "Jessica Lange"
      ],
      "imdbMovieId": "0236640",
      "originalTitle": "Prozac Nation",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["0QWM_Kni6l0"],
      "plotSummary": "Elizabeth is on the verge of losing her grip on life after she leaves her emotionally fraught home to start college. Quickly, her life takes a turn for the worse: She clashes with her roommate and decides her boyfriend, Rafe, is her sole salvation. Her psychiatrist prescribes Prozac … but is that her only choice?",
      "tmdbMovieId": 16229,
      "avgRating": 3.17467,
      "releaseYear": "2001",
      "numRatings": 375,
      "posterPath": "/dQ27zo9fbbqPZ4AfSvOL7AEl75G.jpg"
   }
}