{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "famous score",
            "id": 1505
         },
         {
            "name": "lion",
            "id": 2043
         },
         {
            "name": "animal attack",
            "id": 5160
         },
         {
            "name": "dead animal",
            "id": 7345
         },
         {
            "name": "game warden",
            "id": 9892
         },
         {
            "name": "lioness",
            "id": 9893
         },
         {
            "name": "lion cub",
            "id": 9896
         },
         {
            "name": "rifle",
            "id": 9897
         },
         {
            "name": "animal rights",
            "id": 9898
         },
         {
            "name": "warthog",
            "id": 9900
         },
         {
            "name": "wildlife",
            "id": 9902
         }
      ],
      "imdb_id": "tt0060182",
      "video": false,
      "title": "Born Free",
      "recommendations": [
         128048,
         36652,
         31685,
         116695,
         76187,
         14689,
         84050,
         2887,
         42232,
         27978,
         25728,
         111883,
         40555,
         33657,
         24481,
         25010,
         131473,
         92312,
         36332,
         25900
      ],
      "backdrop_path": "/h7ZKbGAgIsBGoya6623SbT4zTgo.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "John Chard",
            "id": "56f6435ec3a3686a610024f1",
            "content": "The wonders of Elsa.\r\n\r\nBorn Free is based on George and Joy Adamson and their raising of a lioness during their time living at a game reserve in Kenya. It's directed by James Hill, adapted to screenplay by Lester Cole, and stars Virginia McKenna and Bill Travers as the Adamsons. Music is by John Barry and cinematography by Kenneth Talbot.\r\n\r\nIt's a classic case of a family film keeping everything simple for maximum results. A big hit upon release, as was the book written by Joy Adamson, the beautiful landscapes and emotionally swirling musical score marry up perfectly with the story being told. There's some liberties taken with the facts, both with humans and lions, but we aren't in to this pic for any sort of misery or grimy drama. We want, and get, feel good, a time for animal lovers to rejoice and wipe that fly from the eye. 8/10",
            "url": "https://www.themoviedb.org/review/56f6435ec3a3686a610024f1"
         },
         {
            "author": "Reno",
            "id": "57a376ad9251416b97006260",
            "content": "> We want them to be an angel, but being wild is what defines them.\r\n\r\nI thought I dreamt about these lions when I was a kid, but when I came to know about this film that made me realise I actually saw this film when I was a very young to remember anything. It was a few images remained in memory, that's how I tracked it. So while watching this now brought back those scary moments. Yep, I was scared like hell, like the character Kendall from it was. Childhood is like a dream, until we re-encounter those things we held, met, seen, which wakes up our memory after a long time and becoming adults.\r\n\r\nI really enjoyed watching it, because I love animals. But what I did not like was harming the animals. I don't think animals were harmed while making this film, and they even smartly censored story/scene that consists harming/killing them. Actually the film was inspired by the real story, in that, the animals were killed and that is what this film depicted, yet disappoints from that perspective. The time has changed, now it is different, we learnt our lesson, so I hope we focus on protecting this magnificent animal to be born free and to be wild.\r\n\r\nThe Africa was very beautifully portrayed. One of the best films on the wild animal theme I've ever seen. It was a documentary style narration with a little story from the human couple. Hats off to the real Joy and George Adamson. It won a couple of Oscars in the category of music and song. But I think it deserved more than that. I can't believe it is rated PG, but I scared watching it as a kid and I believe the young children with the awareness of the true nature of the lions would do the same. But still highly recommended for all ages. We have now 'Duma', 'Two Brothers' and many more, but this film is something special and you will know it after a watch.\r\n\r\n8/10",
            "url": "https://www.themoviedb.org/review/57a376ad9251416b97006260"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Joy Adamson",
               "gender": 1,
               "credit_id": "52fe464e9251416c75074371",
               "name": "Virginia McKenna",
               "profile_path": "/1oc5UW2OfoMNHW01vPcsytCZVeV.jpg",
               "id": 77165,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "George Adamson",
               "gender": 2,
               "credit_id": "52fe464e9251416c75074375",
               "name": "Bill Travers",
               "profile_path": "/oepnDgU3anJvZCKMvfL10B8L9Jm.jpg",
               "id": 16898,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kendall",
               "gender": 2,
               "credit_id": "52fe464e9251416c75074379",
               "name": "Geoffrey Keen",
               "profile_path": "/cfl3AjlaS4beYAbxbmXUWgH337Y.jpg",
               "id": 10462,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Nuru",
               "gender": 2,
               "credit_id": "52fe464e9251416c7507437d",
               "name": "Peter Lukoye",
               "profile_path": null,
               "id": 78161,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Makkede",
               "gender": 2,
               "credit_id": "52fe464f9251416c75074381",
               "name": "Omar Chambati",
               "profile_path": null,
               "id": 78162,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe464f9251416c75074385",
               "name": "Bill Godden",
               "profile_path": null,
               "id": 78163,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "James",
               "gender": 2,
               "credit_id": "52fe464f9251416c75074389",
               "name": "Robert S. Young",
               "profile_path": null,
               "id": 78164,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Baker",
               "gender": 0,
               "credit_id": "52fe464f9251416c7507438d",
               "name": "Bryan Epsom",
               "profile_path": null,
               "id": 78165,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Watson",
               "gender": 0,
               "credit_id": "52fe464f9251416c75074391",
               "name": "Geoffrey Best",
               "profile_path": null,
               "id": 78166,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ken",
               "gender": 2,
               "credit_id": "52fe464f9251416c75074395",
               "name": "Robert Cheetham",
               "profile_path": null,
               "id": 78167,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "52fe464f9251416c75074399",
               "name": "Surya Patel",
               "profile_path": null,
               "id": 78168,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe464e9251416c75074367",
               "name": "Lester Cole",
               "profile_path": null,
               "id": 78158,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe464e9251416c7507436d",
               "name": "Joy Adamson",
               "profile_path": null,
               "id": 78159,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe464f9251416c7507439f",
               "name": "Sam Jaffe",
               "profile_path": null,
               "id": 78169,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe464f9251416c750743a5",
               "name": "Paul B. Radin",
               "profile_path": null,
               "id": 65685,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe464f9251416c750743ab",
               "name": "John Barry",
               "profile_path": "/9NyieJO78xbwKIBZ1589WfdRPV8.jpg",
               "id": 2289,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe464f9251416c750743b1",
               "name": "Kenneth Talbot",
               "profile_path": null,
               "id": 78171,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe464f9251416c750743b7",
               "name": "Don Deacon",
               "profile_path": null,
               "id": 78172,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe464f9251416c750743bd",
               "name": "James Hill",
               "profile_path": null,
               "id": 126462,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.020323,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 15347,
      "vote_count": 44,
      "budget": 0,
      "overview": "Born Free (1966) is an Open Road Films Ltd./Columbia Pictures feature film starring Virginia McKenna and Bill Travers as Joy and George Adamson, a real-life couple who raised an orphaned lion cub to adulthood, and released her into the wilds of Kenya.",
      "similar": [
         433,
         14211,
         8967,
         411,
         2454,
         12,
         39254,
         110415,
         244772,
         277216,
         806,
         10054,
         2196,
         11012,
         8204,
         11421,
         157827,
         38843,
         1075,
         1254
      ],
      "original_title": "Born Free",
      "runtime": 95,
      "poster_path": "/yMYmH3K6R9Nen8CNwWUsFdWS54j.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "High Road",
         "id": 3066,
         "origin_country": ""
      }],
      "release_date": "1966-06-22",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/7Vqj3BVr0OTbiquXZD2OkIlVg20.jpg",
         "name": "Born Free",
         "id": 354210,
         "poster_path": "/1VwVsWkzhvKDd36s7Wwif0u45u3.jpg"
      },
      "tagline": "From The Pages Of The Beloved Best Seller... A Motion Picture To Delight All The World!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "James Hill",
         "Tom McGowan"
      ],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Joy Adamson",
         "Lester Cole"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0060182/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNTQ4Mjc2M15BMl5BanBnXkFtZTcwMzAzNzgyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Virginia McKenna, Bill Travers, Geoffrey Keen | See full cast and crew »"],
      "reviews": [
         "Real-life husband and wife Virginia McKenna and Bill Travers play real-life husband and wife Joy and George Adamson. Strangely, the chemistry between them is really not played up here. Everything is focused on the cubs, perhaps as it should be. This film takes what could've just been another National Geographic episode and turns it into a \"triumph of the spirit\" story. When you watch this film, you understand the true meaning of freedom. And you can't help but look at that lion and want the best for her. The title song is a perfect ending to the film. It is too bad the Adamsons' lives did not have a happy ending like this story. The film keeps it simple, but there are still some emotional moments. It delivers what it promises.",
         "True life story. George and Joy Adamson (Bill Travers and Virginia McKenna) live in the wilderness in Kenya. In self defense, George kills a lion and his mate only to find they were protecting their three cubs. He and his wife decide to raise the cubs. They give two of them away to zoos, but can't part with Elsa, a lioness. But then they realize they can't keep her and don't want to put her in a zoo. Can they help her live in the wild? I read the book \"Born Free\" when I was in grammar school in the 70s and loved it. I also vaguely remember seeing the movie on TV (and liking it) and the very short-lived (13 episodes) series in the early 70s. Also the song was a big hit in the mid 60s and again in the early 70s. But I had forgotten all about it until it popped up on TCM. I decided to tune in and loved it! The movie was shot beautifully on location in Kenya (where it took place). Wide screen viewing is essential for this one. Also, Travers and McKenna were a real-life couple when they did this film (in fact they remained married until his death in 1994) and there devotion to each other comes through loud and clear. Also the lions (male and female) are SO cute when they're cubs and even beautiful as they get older. Elsa herself was portrayed by a number of different lionesses but you can't tell the difference. And Travers and McKenna worked with all the animals for 2 weeks before filming so they all interact together perfectly. This is perfect family viewing--adults will adore it as much as the kids. I'm only giving it a 7 for a few reasons--there isn't much of a story and the film DOES drag a little. Also the cute little shots of the cubs get a little bit much. Yeah they are adorable, but it got to the point that I thought the filmmakers were purposely shoving them in our faces to get us to go \"awwwwwwww\"! A little bit too cute for my tastes. Still it's a great film and the music in this one is fantastic (and Oscar-winning). Also I defy anyone not to cry during the final sequence--it even got to me and I'm the last person to cry at movies like this. A very good family film. See it!",
         "Set in Kenya in the 1960's, and based on factual events, the film is the story of how a young orphaned lion cub is rescued by a British colonial couple who run a wildlife sanctuary and then prepared for a return to the wild. The scenery is spectacular, and the thin dividing line between death and survival in the wild is palpable. But the film is not only about struggle, it is, in an almost unique way, a love story too; one between a woman and a lioness. Hugely popular when released, the film still has the power to move. An especially good movie for families.",
         "You always here the story or the expression that you can't take wild animals and try to them into pets. This movie tells and shows you why. The movie is based on a true story from a book by Joy Adamson. The movie is set back in the 1950 era when George Adamson who is the game warden for the Kenya area in Africa. While out on a routine run George has to kill a charging female lion in self defense. After George kills the lion he discovers that the lion was a mother as three lion cubs come out of no where. George takes the 3 cub's home because he knows that if he didn't the cubs will die. When the cubs get too much to handle they have to make the hardest decision of their life. Do they send the animals to the Rotterdam Zoo? Do they send all the cubs or do they keep one? To me the acting was great as Bill Travers and Virginia McKenna play George and Joy Adamson. As a side note McKenna also narrates the story as Joy voice-over, using the book. The real star of the show, though, is Elsa herself, actually played by three different lionesses. You can really see the genuine affection between the large cat and her caretakers as they interact. It is magical to watch. This movie would be great for you and your family because there's none of the following in this picture. There's really no violence, and there's no sex or any swearing for that matter. The entire movie was shot in Africa. If you can get the DVD the picture quality is as good as a movie that you would buy today. This review is based on my home addition of Born Free on DVD. You can get this DVD right here on Amazon.com and it by far better then the current VHS that's out there now. Based on the scenery alone I give this movie 7 weasel stars.",
         "Joy Adamson and her husband, Kenya game warden George Adamson, bring up a lion cub Elsa, but later they have to teach her about the wild and free life she was born to. Warm, good-looking but rather casually assembled screen version of a highly popular bestseller, with irresistible animal shots that made it enormously successful at the box-office - and over the years a family film \"par excellence\". It started a cycle then and was followed by the less successful \"Living Free\".",
         "Esteemed producer Carl Foreman's name is on this modestly enjoyable family film, and his trademark attention to storytelling and production values ensure that this is a considerable cut above other such G-rated fare from the 60's. Based on Joy Adamson's bestselling book, it tells the true story of how the wife of a game warden in Kenya raises Elsa, an orphaned lion cub, then has to face the difficult task of training the adult lioness to return to the wild. Pacing is stolid, the photography of authentic African locales impressive (with the exception of a couple of poorly-integrated stock shots of attacking lions), and John Barry's Oscar-winning score is memorable if a bit overblown. The acting by real-life spouses Virginia McKenna and Bill Travers is excellent. Interaction of the lion cubs, and later, the star feline Elsa, with the human actors is often remarkable. Recommended for kids over 8 and their parents, who won't be bored.",
         "An English couple living in Kenya try to reintroduce an orphan lion cub back in to the wild. Based on a real story. Family movies get a bad rap because they are usually films that only children enjoy and adults can bare only when drunk. Born Free is the kind of movie that can play well to both adults and children -- if they are the type that like wildlife. You should never act with children or animals because they steal every scene they are in. Born Free features two very fine performances from real life couple Virginia McKenna and Bill Travers -- but when the cubs are on screen you won't be looking elsewhere. I have read the book which I loved and well worth checking out because it is NOT a novelisation of this film -- Joyce Adamson (whose early life the script is based on) was not the angel of virtue she is portrayed here. She was a tough woman who made enemies and ruffled feathers. Her early death is another story and another film. The problem with the film is that it has enough syrup in it without the extra sugar that is the title song. Also the real couple had personal problems that this film doesn't really want to deal with. From the nature of the film we know the final happy reel and are merely travelling towards it. There aren't many films you can enjoy two or three times over and even get a bit emotional over -- but this is one such film. One for the DVD collection of all animal lovers. If you are the sort that doesn't subscribe to the Discovery Channel than you are better staying away.",
         "It's really hard now days to get the same feelings that this film brings to your soul, innocence, love, devotion, honesty. It's all rare commodities in the today's life in general. It's really hard now days to get the same feelings that this film brings to your soul, innocence, love, devotion, honesty. It's all rare commodities in the today's life in general. Virginia McKenna & Bill Travers are the perfect couples. The film brings you the atmosphere of the great African wildlife on its last glorious days; I and my family enjoyed this film very much. It was a wonderful experience for my kids its represent the animal in a realistic and compassionate way not like the cg cartoons or other comic animal films of todays.",
         "This really is a wonderful movie - a true story; funny, dramatic, bittersweet, and with a title song that will never be forgotten by anyone who hears it. Virginia McKenna and Bill Travers star as Joy and George Adamson. He is the game warden in a game reserve in northern Kenya; she is his wife, and together they adopt three orphaned lion cubs. Sending two of them to zoos, the third (Elsa, who was the darling of the bunch) stays behind and becomes something of a household pet, until the inevitable day comes when she has to be either taught to live in the wild on her own, or sent to a zoo. You find yourself rooting for Elsa, shedding a few tears with Joy and in the end feeling quite uplifted by how the whole thing turns out. It's a fast movie (about an hour and a half in length) which is good, the editing I thought was a bit rough (although there are some great shots of Africa and its wild life) and in the end it's a great feel-good movie for the whole family. 8/10",
         "The story of Joy Adanson & Elsa is unlike any love story you will ever see. I seen this when I was young at camp, I was so upset that my mother had to pick me up. I never fully watched this movie until I was 21 & bought the VHS, just to say I had it in my collection. Well I finally seen the whole thing & although I have grown up, it still hit me hard. I think the part that hit me hardest was the thought they had to give her up. Being an animal lover, I'd give anything to be able to live outside in the wild with a pet lion like Joy did, or even a pet bear like Grizzly Adams. The quote that stayed with me has always been when Joy tells her husband George \" She was born free & deserves to live free\". Also note this movie has won awards in 1966 (same year I was born lol), also has an amazing song which till this day brings back tears if anyone plays it near me or family goofing & singing it. I felt happy when Elsa finally was able to hunt for herself & I cheered her on when she met her first male lion. I adored Georges game warden friend who always seem to get them time off to work with Elsa. Its a must see movie if your an animal lover. Also see the sequel \"Living Free\". Also this was my first book report lol."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Open Road Films (II)",
         "Atlas",
         "Highroad"
      ],
      "summaries": [
         "Married couple George Adamson and Joy Adamson have longed lived in northern Kenya for George's work as the senior game warden of the region. One of George's primary responsibilities is to deal with dangerous animals that may be chronically threatening to humans, livestock and/or crops. It is in this vein that George and his staff end up killing a man eating lion and its lioness, resulting in their three young female cubs being orphaned. Although difficult to begin, George and Joy are able to wean and take care of the three cubs, who they adopt as pets. But soon, they know they have to provide a more suitable environment for the cubs, namely sending them to Rotterdam Zoo... that is except for the smallest, who they have named Elsa and to who Joy in particular has become attached as the emotional fighter among the three. As Elsa grows into lioness maturity, George and Joy provide her with greater freedom away from their property, which may get her into trouble as a largely tame animal. Ultimately, John Kendall, George's boss, directs them to send Elsa to a zoo like they did with her sisters, especially as with anyone in George's job he is soon being reassigned. Joy cannot bear the thought of Elsa being locked up for the rest of her life, believing that they can reintegrate her back into the wild instead, something that had never been done with a tame lion. John gives them three months to accomplish this task, which most specifically involves getting Elsa to be able to kill for food, other creatures which up to this point she has seen only as fellow playthings, and to be accepted by other lions, most specifically mate with and provide food for a male partner while standing up successfully to female competitors.",
         "Joy Adamson and her husband, Kenya game warden George Adamson, raise Elsa, a lion cub. When Elsa approaches maturity, Joy determines she must re-educate Elsa to living in the wild so that the lioness can return to a free life."
      ],
      "budget": 0
   },
   "movielensId": 6232,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1966-06-22",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["James Hill"],
      "runtime": 95,
      "movieId": 6232,
      "title": "Born Free",
      "mpaa": "",
      "actors": [
         "Virginia McKenna",
         "Bill Travers",
         "Geoffrey Keen",
         "Peter Lukoye",
         "Omar Chambati",
         "Bill Godden",
         "Robert S. Young",
         "Bryan Epsom",
         "Geoffrey Best",
         "Robert Cheetham",
         "Surya Patel"
      ],
      "imdbMovieId": "0060182",
      "originalTitle": "Born Free",
      "genres": [
         "Family",
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["e1wpbCbPP7U"],
      "plotSummary": "Born Free (1966) is an Open Road Films Ltd./Columbia Pictures feature film starring Virginia McKenna and Bill Travers as Joy and George Adamson, a real-life couple who raised an orphaned lion cub to adulthood, and released her into the wilds of Kenya.",
      "tmdbMovieId": 15347,
      "avgRating": 3.40449,
      "releaseYear": "1966",
      "numRatings": 356,
      "posterPath": "/yMYmH3K6R9Nen8CNwWUsFdWS54j.jpg"
   }
}