{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "videotape",
         "id": 177185
      }],
      "imdb_id": "tt0178868",
      "video": false,
      "title": "Ringu",
      "recommendations": [
         9669,
         12205,
         11838,
         10389,
         27324,
         4552,
         11075,
         9674,
         15516,
         17111,
         1694,
         794,
         10692,
         9696,
         16307,
         9666,
         11880,
         2291,
         9529,
         8740
      ],
      "backdrop_path": "/zoBEPyPnJ9dsyoKTz3BfH80Icef.jpg",
      "revenue": 8690429,
      "reviews": [{
         "author": "artmeja",
         "id": "508e6d6d19c2951120000eae",
         "content": "This film is very Japanese.If the objective of any horror movie is to scare, then Ringu succeeds with flying colours. Everything about this movie is genuinely disturbing and unsettling. From the mythology of the tale to the ghastly contorted faces of the corpses that Sada, the demon of the story leaves in her wake.",
         "url": "https://www.themoviedb.org/review/508e6d6d19c2951120000eae"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Reiko Asakawa",
               "gender": 1,
               "credit_id": "52fe4364c3a36847f8050f1d",
               "name": "Nanako Matsushima",
               "profile_path": "/lKqYbDFdS9ulZ5BjObu0bKD7Ydi.jpg",
               "id": 27776,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mai Takano",
               "gender": 1,
               "credit_id": "52fe4364c3a36847f8050f21",
               "name": "Miki Nakatani",
               "profile_path": "/qaRpv9GOkUX2ClscEGNJ9wdqwCZ.jpg",
               "id": 27778,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ryuji Takayama",
               "gender": 0,
               "credit_id": "52fe4364c3a36847f8050f25",
               "name": "Hiroyuki Sanada",
               "profile_path": "/fljn2lkeej3gAwSOvXXMVVQlA2K.jpg",
               "id": 9195,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tomoko Oishi",
               "gender": 1,
               "credit_id": "52fe4364c3a36847f8050f29",
               "name": "Yuko Takeuchi",
               "profile_path": "/qxSio4g1ehRiYEz2l2y2Ducvwwx.jpg",
               "id": 27779,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Masami Kurahashi",
               "gender": 1,
               "credit_id": "52fe4364c3a36847f8050f2d",
               "name": "Hitomi Satô",
               "profile_path": "/ghGh2wiQTivTcADNJMJ6PTecZJg.jpg",
               "id": 27780,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Takashi Yamamura",
               "gender": 2,
               "credit_id": "52fe4364c3a36847f8050f31",
               "name": "Yôichi Numata",
               "profile_path": "/7MNgdAnmjUto0pe3ftgq1j9THp9.jpg",
               "id": 27781,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Yoshino",
               "gender": 2,
               "credit_id": "52fe4364c3a36847f8050f35",
               "name": "Yutaka Matsushige",
               "profile_path": "/oTV8MFQSTVSroDAImu9WHpp4QA4.jpg",
               "id": 27782,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Koichi Asakawa",
               "gender": 0,
               "credit_id": "52fe4364c3a36847f8050f39",
               "name": "Katsumi Muramatsu",
               "profile_path": null,
               "id": 27783,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Yoichi Asakawa",
               "gender": 0,
               "credit_id": "52fe4364c3a36847f8050f3d",
               "name": "Rikiya Ôtaka",
               "profile_path": null,
               "id": 27784,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4364c3a36847f8050f19",
               "name": "Hideo Nakata",
               "profile_path": "/fQ3XJXTNpxzt6gMpMM0pJOyuibA.jpg",
               "id": 26875,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4364c3a36847f8050f43",
               "name": "Hiroshi Takahashi",
               "profile_path": null,
               "id": 27785,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4364c3a36847f8050f49",
               "name": "Kôji Suzuki",
               "profile_path": null,
               "id": 27786,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "56ee9bf99251412d6e0000b8",
               "name": "Jun'ichirô Hayashi",
               "profile_path": null,
               "id": 27794,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56ee9c2bc3a368226000b13f",
               "name": "Kenji Kawai",
               "profile_path": "/jIhpBTVJ4JmPFUbTlXROgL6GMCT.jpg",
               "id": 57304,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.74,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 2671,
      "vote_count": 381,
      "budget": 1200000,
      "overview": "A mysterious video has been linked to a number of deaths, and when an inquisitive journalist finds the tape and views it herself, she sets in motion a chain of events that puts her own life in danger.",
      "similar": [
         41630,
         51828,
         200727,
         16869,
         388,
         2667,
         668,
         4233,
         76163,
         565,
         10320,
         18239,
         35056,
         639,
         10096,
         11322,
         38,
         11216,
         17654,
         10358
      ],
      "original_title": "リング",
      "runtime": 96,
      "poster_path": "/3joRI3S4jK4ZOuxnhauOdc0uvjb.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kadokawa Shoten Publishing Co. Ltd.",
            "id": 1194,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Omega Project",
            "id": 1195,
            "origin_country": ""
         }
      ],
      "release_date": "1998-01-31",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/aS42DTtR6UYNLfKdKJBKYL1OS1U.jpg",
         "name": "Ringu Collection",
         "id": 93369,
         "poster_path": "/vLXGBo24STidL5jmCACSKSHSKLn.jpg"
      },
      "tagline": "One curse, one cure, one week to find it",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Hideo Nakata"],
      "runtime": 96,
      "synopsis": "Two teenagers, Masami (Hitomi Sato) and Tomoko (Yuko Takeuchi) talk about a videotape recorded by a boy in Izu which is fabled to bare a curse that kills the viewer seven days after watching. Tomoko then reveals that a week ago, she and three of her friends watched a weird tape and received a call after watching it. Unnervingly similar to the storied videotape, Masami realizes that Tomoko was fated to die. After some unsettling moments, Tomoko is killed by an unseen force with Masami having the horror of watching. Some days later, Asakawa Reiko (Nanako Matsushima), a reporter investigating the popularity of the video curse among teenagers, discovers that her niece, Tomoko and her three other friends mysteriously died at the same time on the same night with their faces twisted in a rictus of fear. She also discovers that Masami, the girl who was with Tomoko when she died, went crazy and is now in a mental hospital. After stumbling upon Tomoko's photos from the past week, Reiko finds out that the four teenagers stayed in a rental cabin in Izu. Eventually, she flips to a photo of the teens with their faces blurred and distorted. Later, Reiko goes to Izu and finds an unlabeled tape in the reception room of the rental cottage where the teenagers stayed. Watching the tape inside Cabin B4, Reiko sees the tape containing a series of seemingly unrelated disturbing images. As soon as the tape is over, Reiko receives a phone call, a realization of the tell-tale videotape curse. Then on, she now assumes that she has a week to live. On the first day, Reiko enlists the help of her ex-husband, Ryuji Takayama (Hiroyuki Sanada). They take a picture of Reiko and find her face blurred in the photograph, further confirming that Reiko really was cursed. Ryuji then watches the tape, against Reiko's objections. A day later, Reiko creates a copy for Ryuji for them to study. They find a hidden message embedded within the tape saying that \"if you keep on doing 'shoumon', the 'boukon' will come for you.\" The message is in a form of dialect from Izu Oshima Island. The two sail for Oshima (after Asakawa's son watches the videotape) and discover the history of the great psychic Shizuko Yamamura. With only a day left, Reiko and Ryuji discovered that Shizuko's lost daughter, Sadako, must have made the videotape. Determined, the two go back to Izu with the assumption that Sadako is dead and it was her vengeful spirit that killed the teenagers. The duo then uncover a well under Cabin B4 and realize, through a vision, that Sadako's father killed her and threw her into the well. They try to empty the well and find Sadako's body in an attempt to appease her spirit. Reiko finds Sadako's body. When nothing happens to her, they believe that the curse is broken. All seems fine until the next day when Ryuji is at his home and his tv switches on by itself showing the image of a well. He stares in horror as the ghost of Sadako crawls out of the well and out of Ryuji's TV set and kills him. Desperate to find a cure to save her son, Reiko realized what she did that Ryuji did not, thus saving her: She copied the tape and showed it to him. With a VCR and Ryuji's copy of the tape, Reiko rides to her son in attempt to save him, realizing that this is a never-ending cycle: The tape must always be copied and passed on to ensure the survival of the viewers.",
      "writers": [
         "Hiroshi Takahashi",
         "Kôji Suzuki"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0178868/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMDEyMjY3MV5BMl5BanBnXkFtZTcwNTg3NDEzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Nanako Matsushima, Miki Nakatani, Yûko Takeuchi | See full cast and crew »"],
      "reviews": [
         "In 2002, Dreamworks released a movie on American theaters called THE RING, by Gore Verbenski. It expanded to great lengths around the world. People claimed they had never been so scared while watching a movie in their entire life. Critics had mixed opinions of it, most for the better. But while the entire world was screaming to THE RING, others decided to reach out for the original version that Dreamworks decided to \"hide\" while THE RING was in it's theatrical run. The 1998 Japanese phenomenon RINGU (a.k.a RING.) Based on a 1991 novel by Koji Suzuki (claimed as the Japanese Stephen King) RINGU tells the story of reporter Asakawa Reiko (Nanako Matsushima), a middle-class Japanese single mother. Her latest story is the investigation of a mysterious urban legend that circulates around high schools about a tape that kills whoever watches it seven days later. She learns that five teenagers recently died from a heart attack at the exact same time, and that they were all friends who spent a vacation on a cabin resort exactly one week before. It becomes up close and personal when she finds out one of them was her recently deceased cousin Tomoko (Yuku Takeuchi.) Reiko eventually tracks down and watches the mysterious tape, and in one of the movie's many chilling moments, receives a strange phone call confirming that the urban legend is true, an element that reminded me of the 1992's similar CANDYMAN. She finds help from her ex-husband Ryiuji (Hirouyuki Sanada), a psychic with paranormal powers (an element obviously removed from the US version). Both Reiko and Ryiuji examine the tape carefully and realize it was shot in a nearby volcanic island. With only a few days left, they travel to the island where the dark, disturbing truth remains hidden, waiting to be discovered. Taking liberties from the infilmable novel, director Hideo Nakata (DARK WATER, CHAOS) and screenwriter Hiroshi Takahashi (DON'T LOOK UP) were able to create what is perhaps one of the most impressive horror films of recent memory, challenged maybe only by the less-subliminal AUDITION. Nakata's direction already explains what makes RINGU so unique: The absence of music, limited photography, simple camera movements, and no cheap jump scares. The fear in RINGU comes from skin-deep slow burn. If you are looking for jumps, watch the American remake instead. Which brings us to the infamous RINGU vs. THE RING internet battle: A pointless one. The 2002 remake had more technological resources and a stronger desire to freak out the audience. Director Gore Verbenski decided not to copy the original and went for a less subliminal more artsy Dario Argento dreamy approach with a Nine Inch Nails vibe and a David Fischer love for rain. While THE RING improved on the upcoming flaws of the original, it had problems of it's own. Not wanting to change the subject, let me tell you the Japanese version is the one to see. The problem is that most people who watch the recent remake will hate RINGU, and vice-versa. Unlike THE RING, RINGU avoids CGI shocks and cheap jump scares like a plague. You won't find any suspenseful moments, chases, or any physical struggles between the cast here. While the remake scared you with fast zooms, weird camera tricks, and inhuman freaky bursts of weird noises, RINGU scares you with it's lack of... sadism. A good example are the videotapes. The videotape seen in THE RING is a Nine Inch Nails video, in a good way, with very weird supernatural images and weird gross-out quick glimpses. The original's videotape is shorter and maybe even weirder. It shows you different but equally impressive images that belong to a David Lynch nightmare while a \"scratching\" noise is heard on the background. A noise that was unfortunately omitted in the remake. The Japanese tape can be either laughable or scary depending on the mentality of whoever watches it. But what makes RINGU the phenomenon that it is today is the character of Yamura Sadako, who turns out to be pulling the strings. Not wanting to spoil the plot, I will just say that never since Hanniball Lacter has a character with such little screen time terrorized the audience as good. The American doppelganger Samara was badly used in the remake. While what made Sadako scary was that she was pure evil, the remake's screenwriter Ehren Kruger tried to turn her into a Batman-like repressed character that you are supposed to feel sorry for. This terribly reduces the impact of \"the scene\". Which leads me to \"the scene\" itself. If you ask anyone who watched either version what \"the scene\" is, they will probably know. Let me tell you that \"the scene\" is done much better in this version. I will go as far as saying \"the scene\" is hands down one of the scariest moments in cinematographic history, very close to the shower scene and the climax of DON'T LOOK NOW. The remake tried to hard with it's own \"scene\", adding CGI effects, quick cuts, and many other gross-out elements that the original didn't need. But RINGU is not without it's flaws. Either the fact that I am not Asian, or maybe that I am not familiar with psychics, but the whole Ryiuji character left me wishing for more. Maybe the subtitle translation didn't make it clear enough, but I couldn't connect to that way he always had an answer to everything. Not that Sanada's performance is lacking. He steals the scene and carries out most of the movie. Remember Bruce Lee in GREEN HORNET? Maybe not, but that is Ryiuji here. And Matsushima is equally good, although she is given less to do than her American counterpart Naomi Watts. I will give credit to the US remake by eliminating the psychic subplot. I won't forgive the fact that Ryuji's American counterpart is a pointless and boring sidekick which is what ironically gives Watts her chance to shine. RINGU is still a superior horrifying experience that you will not easily forget. Forget the sequels (RING 2), forget the spin-offs (RASEN), the rip-offs (FEARDOTCOM), or remakes (RING VIRUS and THE RING). It all rounds up to here. Be sure to watch Nakata's equally good DARK WATER, which is already getting a remake on early works. Oh, the humanity... *phone rings* (4.5/5)",
         "**CONTAINS MILD SPOILERS** Ringu is an unassuming little movie that my boyfriend and I rented from the local DVD store knowing little about it other than it had inspired a recent Hollywood remake. The first thing which accosts you when watching this film, is it's lo-fi documentary-style reality. Ringu has the look and feel production wise of a TV movie, but this only adds to the objective of it, to terrify. The story unfolds of an everyday Japanese single mother, the backdrop is nothing unusual but this is required as the bizarre begins to unravel before the eyes of the watcher. The woman has a child whom appears to be a strange little boy, and in many ways he parents her in her hectic schedule. Her ex husband is an amiable fellow, though he has an annoying quality to any female whom observes him which one assumes is the reason for the couple's politely handled split. The story takes a turn for the more macabre when a videotape emerges which is shrouded in urban myth. The short synopsis is you watch the tape and die within seven days of doing so. A group of teenagers inexplicably die, one of which is the niece of our leading lady. Being the plucky reporter that she is, she begins to investigate the eerie tape initially by watching it herself and embroiling her ex in this grim fairytale by seeking his counsel, on technical matters relating to the tape itself. The two find themselves in a race against time to discover the secret of the tape when their son watches a copy that was made. The bogeyman of this psychologically rattling outing, is Sada- a child or a demon?, perhaps a freak of nature? No answer is given and the viewer is left to their own conclusion and speculation. This reliance upon the viewers observational conclusion is what makes Ringu a truly adult horror movie above all others, we are not told what to think or moralised. Ringu simply displays the evidence on the nature of Sada, and leaves you to suppose whether she is a tortured victim cast from society, or simply a demon and nothing more. If the objective of any horror movie is to scare, then Ringu succeeds with flying colours. Everything about this movie is genuinely disturbing and unsettling. From the mythology of the tale to the ghastly contorted faces of the corpses that Sada, the demon of the story leaves in her wake. The grainy gritty production plays and builds upon anybody who dares to watch. The bittersweet relationship between the two leads encourages us to care about them and their plight. The story piques the curious child in all of us, and dares us to look when we should not, and tamper with things that are beyond our understanding. The absolutely heart ripping and bone chilling climax to this movie is unmissable. You will not be able to stop watching, but be wishing that you could rip out your eyes simultaneously! This movie is a quiet and unpretentious if imaginative little piece from Japan, which displays something that Hollywood has lacked in the horror genre in many years. The director has a true innate gift for knowing exactly what it is that we can not put our finger on that horrifies the human mind. This film is very Japanese, and I cannot imagine it doing well when converted to Hollywood form. Ringu is a movie made to be watched on your TV at home, exactly the way I did renting the DVD from your local store. This plays upon the very nature of the story. The TV is something we all think of as safe, it's in all our homes, and it is exactly this that adds such an overtone of terror to this particular film As an additional note, my boyfriend was flicking through the extra features on the DVD and came across the cursed video clip, and proceeded to watch it. I couldn't, I left the room. This fact serves as the best conclusion that I can muster as to the brilliance of Ringu. It is not to be missed, but do not watch it alone! 10/10",
         "Forget the fact it's subtitled - that only adds to the effect. The director's use of angles, sudden appearances of characters in the frame, wonderfully puzzling flashback and periods of absolute silence combine to form THE best horror film I've seen in years. Forget Blair Witch, this is a true horror story - it could happen to anyone. The Japanese location may make the story more remote, but also makes it more mysterious. The story would work in another locale, say, the Deep South, US, but there's just something about \"Ring\" which works due to its defiance to comply with cliche. Just when you think you've got the film nailed down and swaggeringly predict the next events, you're proven totally wrong and dealt the double joy and horror of a perfectly timed shock revelation or two. No spoilers about the ending, needless to say, you will not see this one coming...",
         "I watched The Ring before Ringu and was sorry that I did. Everybody thinks that the US always does things better. This is one example of how wrong those people are. Now, don't get me wrong, The Ring was a good flick. I enjoyed it very much, BUT, it really fell short of the original. So much was lost in the translation and in remaking it. If you have never seen The Ring, do yourself a favor and see Ringu first. It really shows how the Japanese can make good horror. The story is based on a novel written by Koji Suzuki entitled \"Ringu\". If you get the chance, you can pick this up over at Amazon, it's a very good read and shows you how the story was meant to be told. The Japanese film was a better adaptation of the movie. I give Ringu 8.5/10",
         "Unlike some reviewers here, I'm happy to have seen Hollywood's 'The Ring' first. Now that I've seen both I would have to say that 'Ringu' is the better film (marginally). The Hollywood version was quite an unsettling experience in it's own right and having seen it first I rather expected 'Ringu' would be a 'ruined' experience as I was already familiar with the overall story and, of course, THE scene. After all, when the scene finally occurs in 'The Ring' the unexpectedness of it very much increases the shock of it. I hadn't been truly frightened by a scene from a horror movie for a very long time so I was unequivocally impressed. So when I got around to watching 'Ringu' my expectation was low. I assumed that the absence of surprise would diminish the experience greatly but, as it turns out, the difference in the styles (and some of the substance as well) was adequate enough to scare me all over again even though I thought I knew what to expect. Somehow I doubt that this would have been the case if I'd watched these movies in reverse order. I believe 'The Ring' would have been less enjoyable as it likely would have suffered from comparison. The familiarity actually served as a primer for watching the original. I've found that reading subtitles often detracts from the complete enjoyment of a film as one's appreciation of the visual content usually suffers from the distraction. In this case though, I found it to be less of a problem. Of course it certainly doesn't hurt to have the ability to rewind and in instances where I was unable to finish reading the dialogue completely you can be sure that I made use of it. The first difference that struck me was the teens found in the car. Like the girl in the closet in 'The Ring' their faces are frozen into grotesque masks, but the more terrifying aspect is that they have been 'gotten to' outside of their homes and all at the same time. This really drives home the realization that there may be no way to escape this thing. Safety in numbers? Nope. Don't go home? Nope, won't help. 'Ringu' is somewhat more detailed in providing background than is 'The Ring'. The demonic child is shown in a scene that was omitted from the copied version and it adds a little something extra to our understanding of this terrifying entity. Also, I found that the valiant attempt to lift the curse by trying to 'free' the spirit from the well was more intense and claustrophobic (not to mention yuckier) than the American film. But what is it exactly that is so disquieting about both versions? Well, to begin with, the seemingly unrelated, disjointed and positively eerie imagery that is seen on the mysterious videotape really gets under the skin. The first time we see these we are troubled by the strangeness of them and thoroughly perplexed as to their meaning. We come to realize that a seed of uneasiness has been planted within us. The direction is masterful at nourishing this seed not only by showing short repeats of these images, but also by giving us incremental hints of what is still to come. We are briefly shown the well. Briefly again, the beginning of emergence. Briefly again, it's almost out. More and more I found myself getting cold shivers at each progression. The uneasiness is becoming dread. But there's something else that frightens apart from the film's construction. Is it the ultimate realization that this thing will not be placated no matter the heroic and well-intentioned efforts of the film's principal leads? Yes, that's an acutely chilling slant to be sure. But ultimately, I feel that the most disturbing element is that, were we to find ourselves in this position, we would be faced with a terrible choice - face the horror ourselves or deliberately inflict it on another. Escape it and you condemn your own soul. Now that's some scary sh*t",
         "I have to disagree with the comment above from Mike Washen. Indeed, the storyline of both movies is similar for the first part of the movie (no complaints so far), but the second part of the originals movie is more believable IMHO. The original has only one real special effect but this does not mean that the movie isn't scary. Especially due to this lack of special effects a better thrill is created al throughout the movie. One sees just enough to get scared. The originals story builds up a tad more slowly which gives a better story overall. If you are going for special effects, take the remake. If you like to see all 4 movies and like a scary experience overall take the original.",
         "Everyone knows the story by now: there's a videotape which, when played, reveals a discordant string of disturbing images including a circle of sky seen from below and a man looking down from above, the word \"Eruption\" written over and over again and moving of its own accord across the page, a hooded figure pointing at some unseen accused, a woman brushing her hair before a mirror and, last but not least, a well standing alone on a neglected patch of land. The video ends and the phone rings...but there is only an eerie silence on the other end. In seven days, the viewer of the video is dead, their heart having suddenly come to a stop for no apparent reason. One such victim is a seventeen year old girl, and it is up to her aunt, hotshot newspaper reporter Reiko, to solve the mystery of the strange video. Like the American remake \"The Ring,\" Ringu is not a perfect film. It leaves more than a couple of unanswered questions and may move too slowly in some parts to hold the attention of horror film fans who are used to a bloody slaughter scene every seven minutes. But for fans of good, spooky, old fashioned ghost stories, \"Ringu\" has a lot to recommend it. One of the things I appreciated the most about this movie is the complete and utter lack of gore. There's not a drop of blood to be found in this film, which makes the sight of so many dead bodies, their faces frozen in hideous screams of horror, all the more effective. The character of Sadako also has more of an impact than the child from the remake. Sadako never speaks, her face is never seen (but for one hideous, floating eye) and her presence is solid, unlike her static-y American sister. Sadako's emergence from the TV screen in the films final moments is worth waiting through the rest of the movie to see; it is a truly creepy moment which looks to have been filmed backwards as Sadako creeps with jerky, inhuman movements across the floor and up, swiveling to face her victim. That scene haunted me (no pun intended) for two full nights of broken sleep...mostly because Sadako seemed so terribly human, as sad as she was frightening. You pity her before you see her merciless side, and this throws the balance way out of whack. Unsettling, to say the least. This is a film about dread, about knowing that something dark and terrible is waiting for you and not knowing how to stop it. You can only wait and hope for the best...but the wait itself is the real horror, and the unseen unknown is the most frightening monster of all.",
         "The storyline is based around an Urban legend that involves a piece of footage that causes the eventual death of anyone having watched it. A female news reporter, Reiko Asakawa , investigates this case after her niece is the latest victim of the alleged curse. From here on, the film follows the female lead's search for clues as she races against time to find salvation. Caught up in the events is former husband, Ryuji Takayama , who possesses latent psychic abilities which come in handy later on as things start to spring to light. The film is made in typical Japanese horror genre style that plays on the mind as well as including sudden shock effects. Fans of urban legend type horror will take delight in this offering from director Nakata Hideo and whilst the film does lack substance somewhat, it makes up in suspense and mystery. You are also made to sit on the edge of your seat by the film's soundtrack which is disturbingly quiet, subtle and sinister. The atmosphere is the key part of the film that makes it a horror masterpiece. The story is cleverly written to move at a rate which keeps the audience interested and finally end in a twist that sets itself up for a sequel.",
         "The journalist Reiko Asakawa (the gorgeous Nanako Matsushima) resolves to investigate the death of four teenagers who watched a videotape that might kill the viewer seven days after watching the film. The viewer would receive a telephone call and seven days later would die. She herself finds the videotape, watches the strange movie and becomes afraid of being killed. She prepares a copy for her ex-husband, who decides to help Reiko in her investigation, specially because their son has also watched the film. This movie is great, with characters well-defined, excellent cast and direction and a screenplay focused on the story and not in special effects. An original horror movie, with a tight plot. Why Americans insist in spoiling excellent movies? It is amazing the quantity of (expensive) remakes of marvelous foreign movies that Hollywood spoils. Once I heard that American people would not like to read subtitles, but I refuse to believe in such non-sense. The American remake 'The Ring' is not a bad movie, and Naomi Watts is a great actress. But why the remake? The modifications introduced by the American screen writer and director changed a simple and terrifying plot into an expensive, complicated and non-resolved story. My vote is nine. Title (Brazil): \"Ring - O Chamado\" (\"Ring - The Call\")",
         "The late 90s saw a resurgence of well-crafted horror movies that have to this day virtually reinvented the genre. The Eye, Pulse, Audition, to name a few, are truly disturbing films that create horror out of objects or elements which are the farthest from the genre: a medical surgery to reestablish sight, the Internet, videotaping. With Ringu, Japan came into its own with a legitimate tale of horror which implies that the act of watching can actually kill you, and that evil can and will replicate itself through elements of our own technology as a means of feeding itself and thus, spreading itself out like a web. This is the secret within the film, and the theme which later on defines it (and the Ringu series). Ringu is not an excellent film. Far from it. But it does manage to instill a decent amount of atmosphere and eerie moments within its narrative (although there were scenes which, like the book, caused unintentional laughs, such as when the bodies of the two teens who first saw the video were taken out of the car and we are informed they were \"making out\"; and Ryuji's sudden revelation that he too has psychic powers) without resorting to cheesy special effects. Spooky, but not terrifying."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Omega Project",
         "Imagica",
         "Asmik Ace Entertainment"
      ],
      "summaries": [
         "Reiko Asakawa is researching into a 'Cursed Video' interviewing teenagers about it. When her niece Tomoko dies of 'sudden heart failure' with an unnaturally horrified expression on her face, Reiko investigates. She finds out that some of Tomoko's friends, who had been on a holiday with Tomoko the week before, had died on exactly the same night at the exact same time in the exact same way. Reiko goes to the cabin where the teens had stayed and finds an 'unlabeled' video tape. Reiko watched the tape to discover to her horror it is in fact the 'cursed videotape'. Ex-Husband Ryuji helps Reiko solve the mystery, Reiko makes him a copy for further investigation. Things become more tense when their son Yoichi watches the tape saying Tomoko had told him to. Their discovery takes them to a volcanic island where they discover that the video has a connection to a psychic who died 30 years ago, and her child Sadako...",
         "After the death of her cousin Tomoko, reporter Reiko hears stories of a videotape that kills everyone who sees it exactly one week after viewing. At first she discounts the rumors, but when she learns that Tomoko's friend (who watched the video with her) died at exactly the same time, she begins to investigate. After viewing the tape herself, strange things start happening, and so she teams up with her ex-husband to try to stop the death clock that has once again begun ticking.",
         "Reiko Asakawa is a young journalist with a divorced husband, Ryuji, and a son, Yoichi. Her niece, Tomoko, was recently found dead with a look of pure shock embedded in her face as if something scared her to death. Upon learning that her niece's three friends died at the same time, too, and hearing about a disturbing videotape that is said to kill you seven days after watching it, Reiko comes into the possession of that same tape. Now, as time grows short, Reiko and Ryuji race to save their lives from impending doom and discover what the tape has to do with a tragedy-stricken volcanic island and a very strange little girl named Sadako ...",
         "A mysterious video kills whoever views it, unless that viewer can solve its mystery."
      ],
      "budget": 1200000
   },
   "movielensId": 6242,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1998-01-31",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Hideo Nakata"],
      "runtime": 96,
      "movieId": 6242,
      "title": "Ringu",
      "mpaa": null,
      "actors": [
         "Nanako Matsushima",
         "Miki Nakatani",
         "Hiroyuki Sanada",
         "Yuko Takeuchi",
         "Hitomi Satô",
         "Yôichi Numata",
         "Yutaka Matsushige",
         "Katsumi Muramatsu",
         "Rikiya Ôtaka"
      ],
      "imdbMovieId": "0178868",
      "originalTitle": "リング",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["oTtz7g2tiuI"],
      "plotSummary": "A mysterious video has been linked to a number of deaths, and when an inquisitive journalist finds the tape and views it herself, she sets in motion a chain of events that puts her own life in danger.",
      "tmdbMovieId": 2671,
      "avgRating": 3.58736,
      "releaseYear": "1998",
      "numRatings": 3148,
      "posterPath": "/3joRI3S4jK4ZOuxnhauOdc0uvjb.jpg"
   }
}