{
   "tmdb": {
      "original_language": "es",
      "keywords": [{
         "name": "new mexican cinema",
         "id": 209987
      }],
      "imdb_id": "tt0322824",
      "video": false,
      "title": "Japón",
      "recommendations": [
         111367,
         10244,
         281122,
         109380,
         49695,
         263197,
         131193,
         95378,
         136762,
         233180,
         173029,
         147015,
         63401,
         151730,
         355505,
         146815,
         236063,
         151336,
         138750,
         256222
      ],
      "backdrop_path": "/24p8lLVn1aK4dXzGOf4mbkRXbao.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "The Man",
               "gender": 0,
               "credit_id": "5a9718050e0a26015300472b",
               "name": "Alejandro Ferretis",
               "profile_path": null,
               "id": 1987736,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ascen",
               "gender": 0,
               "credit_id": "5a97180e0e0a26015600450a",
               "name": "Magdalena Flores",
               "profile_path": null,
               "id": 1987737,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Sabina",
               "gender": 0,
               "credit_id": "5a97181ac3a368615a0041af",
               "name": "Yolanda Villa",
               "profile_path": null,
               "id": 1987738,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Juan Luis",
               "gender": 0,
               "credit_id": "5a9718250e0a2601620047f7",
               "name": "Martín Serrano",
               "profile_path": null,
               "id": 1987739,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "The Judge",
               "gender": 0,
               "credit_id": "5a9718380e0a26015c004a65",
               "name": "Rolando Hernández",
               "profile_path": null,
               "id": 1987741,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "The Singer",
               "gender": 0,
               "credit_id": "5a9718430e0a260156004530",
               "name": "Bernabe Pérez",
               "profile_path": null,
               "id": 1987742,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Fernando",
               "gender": 0,
               "credit_id": "5a9718590e0a260156004546",
               "name": "Fernando Benítez",
               "profile_path": null,
               "id": 1987743,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "The Hunter",
               "gender": 0,
               "credit_id": "5a97186bc3a368615a0041ee",
               "name": "Carlo Reygadas Barquín",
               "profile_path": null,
               "id": 1987745,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45d49251416c9103fe69",
               "name": "Carlos Reygadas",
               "profile_path": "/3xWB5Pef1UfQalHC2eY0t5mp30K.jpg",
               "id": 20660,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d49251416c9103fe6f",
               "name": "Carlos Reygadas",
               "profile_path": "/3xWB5Pef1UfQalHC2eY0t5mp30K.jpg",
               "id": 20660,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a971878c3a368613d0042c2",
               "name": "Carlos Reygadas",
               "profile_path": "/3xWB5Pef1UfQalHC2eY0t5mp30K.jpg",
               "id": 20660,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a971886c3a3686141004848",
               "name": "Jaime Romandia",
               "profile_path": null,
               "id": 20714,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a9718af0e0a26016200489d",
               "name": "Carlos Serrano Azcona",
               "profile_path": null,
               "id": 1157151,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a9718bb92514128a400419e",
               "name": "Gerardo Tagle",
               "profile_path": null,
               "id": 1827467,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a9718cf925141289b004312",
               "name": "Diego Martínez Vignatti",
               "profile_path": "/igI6kFGBloDHq8g3Vo3PTX9oc0P.jpg",
               "id": 230088,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a9718dbc3a3686145004943",
               "name": "Thierry Tronchet",
               "profile_path": null,
               "id": 1987749,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a9718e40e0a26015f004ac5",
               "name": "Daniel Melguizo",
               "profile_path": null,
               "id": 1987750,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a9718f0c3a36861490047ee",
               "name": "Carlos Serrano Azcona",
               "profile_path": null,
               "id": 1157151,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a9718fb92514128a40041dc",
               "name": "David Torres",
               "profile_path": null,
               "id": 1301549,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a9719290e0a260165004786",
               "name": "Elsa Díaz",
               "profile_path": null,
               "id": 1987755,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a971938c3a36861410048f9",
               "name": "Alejandro Reygadas",
               "profile_path": null,
               "id": 1987756,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a9719ac92514128b0003ec5",
               "name": "Gilles Laurent",
               "profile_path": null,
               "id": 1381300,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5a9719b60e0a2601530048d1",
               "name": "Ramón Moreira",
               "profile_path": null,
               "id": 1987757,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5a9719bfc3a3686145004a10",
               "name": "Jorge Lerner",
               "profile_path": null,
               "id": 1987758,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "5a9719d40e0a2601560046e9",
               "name": "Arvo Pärt",
               "profile_path": null,
               "id": 20230,
               "department": "Crew",
               "job": "Thanks"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.307928,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "MX",
            "name": "Mexico"
         },
         {
            "iso_3166_1": "NL",
            "name": "Netherlands"
         }
      ],
      "id": 36211,
      "vote_count": 13,
      "budget": 250050,
      "overview": "A painter from the big city goes to a remote canyon to commit suicide. To reach some calmness he stays at the farmstead of Ascen, an old religious woman. Although but a few words are spoken love grows.",
      "similar": [
         55,
         1391,
         542,
         17247,
         22093,
         163676
      ],
      "original_title": "Japón",
      "runtime": 130,
      "poster_path": "/gXnrT2anpO30xKkNe50wQ0A6Wgo.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bodega Films",
         "id": 6939,
         "origin_country": ""
      }],
      "release_date": "2002-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Carlos Reygadas"],
      "runtime": 130,
      "synopsis": null,
      "writers": ["Carlos Reygadas"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0322824/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxODIzNjE3Nl5BMl5BanBnXkFtZTYwNTAxODc2._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Alejandro Ferretis, Magdalena Flores, Yolanda Villa | See full cast and crew »"],
      "reviews": [
         "Japon, a film by first-time director Carlos Reygadas, is a sensual meditation on death and the possibility of transformation in which a gaunt middle-aged man comes to a remote Mexican village with the stated purpose of killing himself. We are given no information as to his name or background except that we later surmise that he is a painter who has come from the city to seek solitude for his final act of self-abnegation. The man with no name and no past is the quintessential existential anti-hero, a character that could easily have wandered in from a Wim Wenders movie or a novel by Albert Camus. Reygadas has said that he admires spectators who go to the movies to experience life, not to forget about it. In Japon, Reygadas largely succeeds in engaging those who wish not to forget, showing nature in all its ragged beauty. His images of an unseen pig crying out as it being slaughtered, horses copulating while children laugh, and a bird being decapitated push viewers out of their comfort zone and challenge us to engage life at a deeper, more honest level, similar to the work of Bruno Dumont. Though I found parts of the film to be abrasive, I was pulled in by the stark beauty of the desert landscapes, the authenticity of its non-professional actors, and its willingness to explore issues of man's loneliness and relationship to the natural world. After an opening sequence on the freeway that, in its drone of dehumanized images, pays homage to Tarkovsky's Solaris, a tall man (nameless) with a weather-beaten face played by the late Alejandro Ferretis makes his way down the canyon to a small village in a remote part of Mexico. Limping with the aid of a cane, he tells a man offering directions to the canyon floor that his purpose in going to the remote village is to commit suicide. The man shrugs and tells him to get into the van. Since there are no hotels in the area, he is offered lodging in a barn close to an old woman's shack. The woman is named Ascen, short for Ascension which she says refers to Christ ascending into heaven without help. Japon is a work of mood and atmosphere; the director's static takes and long periods of silence achieve a tone of somber intensity. Ascen, remarkably played by 79-year old Magdalena Flores, is generous and loving, leaving her house guest confused and not sure that he knows what he wants. He fails at a suicide attempt and then settles in to the routine of living in the desert. He drinks Mescal and gets drunk in the village, smokes marijuana (offering some to the old lady), and masturbates while dreaming of a beautiful woman on the beach. It is only when Ascen's son-in-law attempts to cheat her out of her house that he comes alive and asks a strange favor of Ascen that made me decidedly uncomfortable. Little by little the depressed man seems to be engaging more in life and connecting with the people around him. Japon uses an amazing seven-minute circular tracking that employs both natural sound and the sublime music of Arvo Part's Cantus in Memory of Benjamin Britten to end the film on a note of transcendence. Although Japon is at times vague in its delineation of character and feels derivative of Kiarostami and Tarkovsky, it is a promising first effort and I am eager to follow this audacious director's career.",
         "One of my favorite movies of the last couple of years. I happened to see it in a movie theater in Argentina, so I have no idea whether it plays well on a smaller screen. That said, it's a haunting meditation on the transitory and ineffable nature of life, on the tiniest of joys that in the end are all we can rely on to make our existence meaningful. The cinematography is breathtaking and does justice to the desolate beauty of the canyons of northern Mexico. Don't expect a rollicking narrative. This movie invites you to enter a lingering dream.",
         "Japón is not a film about Japan. It is a Mexican film, but not a film about Mexico either. For me, it is something really grand: a film about cinema and why it still exists. The story is rather simple and not at all world-shattering: a man, determined to kill himself, walks into a canyon in order to commit suicide in peace and tranquility. He moves to an old woman's house and, impressed by her attitude to life and somehow inspired by what is going on in the beautiful Nature around him, falls in love with or, or at least unfolds the desire to sleep with her. Telling the rest wouldn't take long but still spoil a lot. The important thing is not the story (including logical character development) but the way it is told. The movie has the air of grandezza sometimes, it is the opposite of naturalism, but thus it is much more like \u0084reality` than a couple of Dogma-style films. When you are alone in nature, well, what else will you do but admire the wonderful landscape and small events happening therein for a couple of minutes, trying to absorb it as intensely as possible? As a result, there are quite lengthy moments in the film, which might repel some people but that's a pity because it means that they are unable to enjoy the immediate experience of beauty. In a review I read the author charged Reygardas with being pretentious and cheap, and I guess he referred to the very last shot (which, by the way, could be the most astonishing technical achievement a cinematographer has ever performed!). I understand what he means, and in a way he is right but I find that what we see makes up for this oh so terrible lack of modesty. Seldom have I heard so little noise in a theatre after the last image of a film - it was completely silent (except for one person in the audience who couldn't help applauding). And this experience has confirmed me in two opinions: First, movies are not made for intellectual critics in the first place. And second, cinema will always have a reason to persist. Nothing like a television or DVD set can give you the same feeling as a movie like Japón on the big screen. Of course, there are a lot of films that need the big screen to be worth their money but, as opposed to them, Japón is something really, really great, touching our hearts AND senses AND also (it is not a silly movie!) brains.",
         "I watched this film after reading some interesting reviews about a promising art-house director, stunning landscapes and grit and reality, as harsh as it is seen through the ever widening lens. Hmm. All of the above is perfectly fitting. The camera work is sheer brilliance. The audio on this film is what grabs you from the very start: The sound is used to full effect, from the bird calls in the trees; the nearby water; the drunken Mexican workers: especially watch out for the singing scene, all made so very powerful thorough the medium of sound. In lots of scenes, the audio is carrying the visuals and not the other way around. I have to say the story is most unusual and as you may already have read, can be quite uncomfortable at times. At one point I actually thought 'I don't need to be watching something like this on my screen..why am I?', as it just got a bit weird for me. I stuck with it though and, there is a message in there. I won't spoil any of the movie for you by going much deeper into it but as one commenter already said, it is about Man and his loneliness. His desperation and also his bad decisions and inability to change: his world and himself. I can see why there are so many negative remarks here for this. At first, I came here with the intention of doing something similar but when I started writing about this movie I just watched, I find myself analysing it and it sinks in that there really is a work of art and it shouldn't be condemned, it should be talked about and watched by many! There are, for sure, some bad areas where they might have done better to edit certain overly long scenes out or perhaps moved the story around a bit but, this movie isn't about the story, not really. It is about the characters, more than that: it is about Character itself. Even the characters are just a vehicle for the main theme. I urge you to watch this with an open mind.",
         "\"Japon\", Carlos Reygadas' startling directorial debut is a mysterious film that will divide audiences. Mr. Reygadas, working with the talented cinematographer, Diego Martinez Vignatti, takes us along for a ride to an unknown part of Mexico where he sets this complex tale about a man at a crossroad of his life. Shot entirely on location in the state of Hidalgo, \"Japon\" gives us a bird's eye view of life in those forgotten areas where time seems to stand still forever. The man at the center of the story wants to commits suicide. For that, he has chosen going back to this desolate part of the country where he wants to do himself in. He suddenly discovers there is a life out there he didn't even know existed. When he befriends the older woman, Ascen, he mistakenly calls her Asuncion, and she corrects him it is Ascencion, an odd name for anyone to have. The title is probably related to the hari-kiri he intends to commit, and it's the only reference between the title and what's going on in the mind of the would be suicide. When he asks Ascen if she would have sex with him, we are shocked. Isn't she, after all, much too old to be having sex? Yet, when she complies, what we see is something like a redemption, and Ascen is the object where the man suddenly becomes human again knowing the sacrifice she has made in order to redeem him. Many people have suggested an affinity of Mr. Reygadas with the Iranian filmmaker Kiarostami. Both men have dealt with this same theme, but where Kiarostami becomes repetitive in what he gives the viewer, Mr. Reygadas takes a different approach that rewards us as viewers. Mr. Reygadas also has to be congratulated by the use of non-actors that give intense performances that no other trained professionals would ever dreamed of giving. Carlos Reygadas will no doubt infuriate some of his audiences, but at the same time he shows he has talent and imagination.",
         "Wow. Didn't think there was this type of filmmaker still out there in this century. What's even amazing is I find out this director was inspired by most of my favourite directors, most of whom see a bigger picture about humanity than others: I mean Tarkovsky, Kiarostami, Kurosawa, Bresson, etc. This movie is definitely in their tradition. First of all, the woman in the film is unbelievable in the most exalted sense of the word. She is the anchor of it all and so naturally unassuming and modest. I don't want to give anything away but as Reygadas, the director, implies in a surreal beach sequence, beautiful beyond ... I'll leave it at that. Also, the most memorable singing sequence near the end of the film with this peasant labourer after he accepts the gift of a drink from the woman during a work break from smashing up her barn (or maybe from pretend filming). I mean, who says beautiful singing has to be technically beautiful? What he sings and how he sings it beats anything I've ever seen and that says a whole bunch. Anyways, a film definitely worth seeing in view of the overinflated monetary and materialistic attitudes of this new order world of ours. What is it we want? Can we really have everything? That's just one of the many questions posed to us from Reygada's film. Stick with it. The film may seem sluggish at the beginning but it might just blow you right out of the water (or cesspool) in the second half. I'd give it a perfect ten if I were more spiritual but Doestoevsky, most of us are not. Reygadas comes damn close though.",
         "We have seen this before, humanity giving back a taste for life to those who have lost it. Hope and goodness bring back those who are standing on the brink of the great chasm. The film is at the antipodes of Hollywood studio stews and is obviously more inspired by a current European wave which gives a spiritual, almost theological, insight of human life through carefully chosen characters of ordinary background. Don't expect much action, life is not always a whirlpool. Japon is earthly, poetic and sometimes a bit raw. It could be boring to some viewers as well.",
         "This film, though not close to perfect is a beautifully crafted work that uses cinema to create poetry. It seems that the director might have been heavily influenced by Italian neorealist cinema (think de Sica) and uses nonprofessional actors who convincingly take on their roles. The story explores sex and romance among people normally associated with being at the end of their lives and no longer in need of that type of affection. The older woman lead is brilliant, and the cinematography captures the unromanticized bleakness of life in rural Mexico. The problem with the film is that it seems a bit pretentious when it becomes too cryptic. Also, at times, the story meanders, and I still don't get the title but overall a solid piece of work and a nice respite from big-budget Hollywood films.",
         "A man in a strange village without desires and expectations, lives with the chimeric temptation of suicide. An old lady, out of time and realities, lives in the shadow of few icons and with small pieces of innocence. A trip, empty present and fragile symbols. Kids, voices, faces and some words. A sex scene and the cruel nephew. Some rocks, few old soft gestures, an accident and the end. \"Japon\" is not worst or beautiful film. It is not a masterpiece or trash. It is not a story. Any message is not present, any tale. May be a form of remember or a game about feelings. A Mexican sequence from a old picture. A sarcastic joke. But important it is not the tale. The flavor of subtle death is the only character in which dust and empty days are parts of subtle putrefaction. And the heart of this small fight with places and memories is ambiguous hope. Who must be object of devotion? Jesus or Mary? Where is the best space to end a inutile existence? What is the sense of days, evenings or days? The value of a picture or the life of an old woman are more that myths? This film is an April rain. Short, strange and insignificant. A piece of a lost game who has same colors and same soft after many long years.",
         "Carlos Reygadas' film Japon is a breathtaking work of image making, rich with scenes that unfold in unbroken time, story untold, and symbolic gestures and references left un- authoritatively open to interpretation. It's a cinema of the immanent that accomplishes transcendence: in Deleuze's terms, transcendental empiricism. Reygadas uses image and sound with a strong degree of influence from Andrei Tarkovsky, Bresson, Kiarostami, Ozu, Rosselini, and though he's not mentioned among Reygadas' favorite filmmakers in the DVD interview, Hungary's Bela Tarr. Actors are non-professional, the script is loose and, and scenes are allowed to run (in the manner of Bela Tarr and Tarkovsky) for as long as they take, or for as long as they remain interesting. His camera use suggests his presence as the film's director, an eye wandering through the lens for an image that may have little to do with the action in front of the camera. Actors are captured for their authenticity and reality (verit&eacute), and their lack of professionalism only serves the film's \"higher\" motives. While this would seem to be a highly religious film, or symbolic at least, Reygadas denies having such intentions. The Madonna, Jesus Christ, miraculous events, the sacred and profane, come together in a Russian Mexico bound by the use of music familiar to Tarkovsky fans: Arvo Part's Cantus to Benjamin Britten. The film even begins with a child, a tree, and the Cantus that closes Tarkovsky's film The Sacrifice (which also ends with the child and the tree). It seems the film is a sequel to the sacrifice. And in fact our lead character (a Mexican Siddhartha, questing with cane, or Bela Tarr's Irimias from Sátántangó?) is struggling to end his life, while allowing himself to be saved by a Madonna-like Mexican villager whose faith is nonetheless redeemed in a genuine human sympathy. (Tarkovsky, on the other hand, often chooses the miraculous.) SheÁ is the Samaritan, a story referred to by the film's final road-side conclusion (I'll not give anything away). As Reygadas claims, life is in the little things. Though he clearly means that life is greater than the little things (the \"ten thousand things:\" a Taoist concept for the biggest number, for everything, the World). A transcendental empiricism, Spinozist film-making, affect-image through the shot. You will live in this film."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "No Dream Cinema",
         "Mantarraya Producciones",
         "Hubert Bals Fund"
      ],
      "summaries": ["A painter from the big city goes to a remote canyon to commit suicide. To reach some calmness, he stays at the farmstead of Ascen, an old, religious woman. Although but a few words are spoken, love grows."],
      "budget": 250050
   },
   "movielensId": 6248,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2002-01-01",
      "dvdReleaseDate": "2004-10-12",
      "directors": ["Carlos Reygadas"],
      "runtime": 130,
      "movieId": 6248,
      "title": "Japón",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0322824",
      "originalTitle": "Japón",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A painter from the big city goes to a remote canyon to commit suicide. To reach some calmness he stays at the farmstead of Ascen, an old religious woman. Although but a few words are spoken love grows.",
      "tmdbMovieId": 36211,
      "avgRating": 3.11017,
      "releaseYear": "2002",
      "numRatings": 59,
      "posterPath": "/gXnrT2anpO30xKkNe50wQ0A6Wgo.jpg"
   }
}