{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0090182",
      "video": false,
      "title": "Tokyo-Ga",
      "recommendations": [
         35075,
         104441,
         237957,
         134220,
         203226,
         147306,
         194602,
         49479,
         269969,
         334706,
         202768,
         76388,
         88302,
         33802,
         148068,
         104343,
         42206,
         148118,
         98914,
         148050
      ],
      "backdrop_path": "/Aop4ZXWGQLPnwjNE2UKgGesIy72.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4937c3a368484e1205bd",
               "name": "Yûharu Atsuta",
               "profile_path": null,
               "id": 552001,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4937c3a368484e1205c1",
               "name": "Werner Herzog",
               "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
               "id": 6818,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4937c3a368484e1205c5",
               "name": "Chishû Ryû",
               "profile_path": "/ocEzSylcvsKIKw8LciHEA3E1LEG.jpg",
               "id": 33135,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Himself (uncredited)",
               "gender": 0,
               "credit_id": "57792440c3a36832b0003f43",
               "name": "Chris Marker",
               "profile_path": "/b1DZhCEw14SKzCdfT8xmV4ZHpid.jpg",
               "id": 9956,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4937c3a368484e1205b9",
               "name": "Wim Wenders",
               "profile_path": "/ruRe7v4OaDE0zG6PLbwHDomhVLq.jpg",
               "id": 2303,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4937c3a368484e1205cb",
               "name": "Chris Sievernich",
               "profile_path": "/6ooUl8VseHvDnvvs6puNTXgPvBv.jpg",
               "id": 9884,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4937c3a368484e1205d7",
               "name": "Hartmut Eichgrün",
               "profile_path": null,
               "id": 423441,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4937c3a368484e1205dd",
               "name": "Laurent Petitgand",
               "profile_path": null,
               "id": 65266,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4937c3a368484e1205e9",
               "name": "Jon Neuburger",
               "profile_path": null,
               "id": 499852,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "546366860e0a26780d002205",
               "name": "Solveig Dommartin",
               "profile_path": "/a5wwT3RJwLKdEWPSNRXMUzX9Sgq.jpg",
               "id": 2312,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "546366970e0a26780a0022a5",
               "name": "Edward Lachman",
               "profile_path": "/yXhB83p1aRpJzd3qKke6uBYescB.jpg",
               "id": 6345,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.906616,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 76406,
      "vote_count": 18,
      "budget": 0,
      "overview": "German director Wim Wenders made this documentary in which he tries to explore the Tokyo that was depicted in the films of Yasujiro Ozu. When Wenders visits Tokyo for the first time, he finds a very different city, one with a booming fascination with technology that often clashes with the traditional elements of Japanese culture. Wenders also interviews Ozu's cinematographer, Yuharu Atsuta, and Chishu Ryu, an actor who frequently collaborated with Ozu.",
      "similar": [],
      "original_title": "Tokyo-Ga",
      "runtime": 92,
      "poster_path": "/vZkce81CO7xU7lKOO1jAVkcAV7d.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Chris Sievernich Filmproduktion",
            "id": 7949,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Westdeutscher Rundfunk",
            "id": 7950,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Grey City",
            "id": 7951,
            "origin_country": ""
         }
      ],
      "release_date": "1985-04-26",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.wim-wenders.com/movies/movies_spec/tokyoga/tokyoga.htm",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wim Wenders"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Wim Wenders"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090182/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1NTI0NzM0M15BMl5BanBnXkFtZTcwMTIxMTcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Chishû Ryû, Werner Herzog, Yûharu Atsuta | See full cast and crew »"],
      "reviews": [
         "Wim Wenders' praising, honest, confessional, hurriedly made and rather superficial love letter to the great Japanese filmmaker (and essential influence on WW's work) Yasujiro Ozu. This documentary intermingles some footage of Ozu's Tokyo Monogatari (in a bad copy, which is really a disservice to Ozu's art!); highly reverent interviews with Ozu's signature actor Chishu Ryu and longtime cameraman Yuharu Atsuta, both in their eighties but remarkably keen; and Wenders' own discovery (it's his first time there) of a high-tech, overcrowded, Americanized Tokyo, radically different from WW's preconceived image of an almost provincial post-war Tokyo that he had idealized through Ozu's films. There are beautiful images by great cameraman Ed Lachman, especially the night shots; but overall it's pretty much familiar territory: trains (old trains, new trains, bullet trains), the overcrowded subway, the concrete jungle, the neon signs, the \"copycat\" fetishism (fake food, fake golf, fake rock'n'roll), baseball games, the video game mania, Japanese politeness, Japanese formality, Japanese impenetrability. It's a traveling journal, narrated by WW himself, where insightful and obvious remarks come in turns. It's a film with too few highlights (Atsuta's interview, Werner Herzog's maniac speech about his search for \"clean, pure images\"), and inevitably superficial: like all big towns, Tokyo can't be covered and deciphered by a first-timer; and like all great artists, Ozu's unique universe can't be grasped by a couple of interviews, anecdotes or images. When WW talks about Ozu's art, he's of course telling us about himself and his own cinema. There's a telling sequence, where WW gets to meet French filmmaker Chris Marker in a Tokyo night-bar called \"La Jetée\" (the title of Marker's landmark 1962 science-fiction/photo-poem short). Marker - who spent considerable time in Japan over the years -- put Tokyo and Japanese culture at the center of one of the most brilliant personal essays/ journals ever filmed, the incomparable \"Sans Soleil\" (1982). At one point, WW mentions that \"Sans Soleil\" is filled with \"images of Japan not allowed to foreigners like me\". Hence my suggestion: if you want to know more about Ozu, watch his films; if you want to see a revealing, knowledgeable essay by a Westerner on Japan, pass on \"Tokyo-Ga\" and try \"Sans Soleil\" instead; if you want a deeply insightful look into WW's work, read the great essay on WW \"Eyes Can't Be Bought\" by Peter Buchka.",
         "I first went to Japan in 1986 as a high school exchange student. I had been studying about Japan for the past 6 years and was very excited to finally go there to see it in person. Wim Wenders was in a similar situation. He had fallen in love with a particular Japanese film-maker Ozu Yasujiru. Wim had been influenced from an early age by Ozu's work, and he decided to go to Japan while in the middle of making \"Paris, Texas.\" During the break in the making of the film in Los Angeles, Wim boarded a 747 and flew across the Pacific to Tokyo, a place he had never been to before. What we get to see when we watch this film, is not only an interview with the cameraman that worked for Ozu for 25 years, but also Wim's personal discovery of Japan. Much of the film is just straight documentary-type footage accompanied with some pretty weird music. Riding in a taxi at night. Riding in a train at night. Following a little boy who is too tired to walk in the underground shopping mall with his mom, and decides to just sit down. The Cherry Blossom Festival picnics in Tokyo, the dancers at Harajuku on Sundays. A particularly fascinating scene is of a company that manufactures the wax food models you see outside most restaraunts in Japan. Overall, a wonderful film for anyone who loves Japan or is just interested in it. I rate this film among Wim's best works. If you can find it, rent it.",
         "I'm not much attuned to Wenders or Ozu (whom Wenders hopes to rediscover with this). But I am very much attuned to Japan and their entire cosmology - their cultural images form one of the most sophisticated readings of the world. Their tea-house and the creative process that surrounds it is one of my three most valuable narratives (meant loosely). It is with Ozu that Wenders is blessed with a unique entry into that entire cosmology. Sure, he comes to Japan consciously looking for that entry, but he is so busy looking for it in the most superficial way that he completely misses. Where is Ozu's Japan? Obviously gone, with time and modernity. The sprawling megapolis refutes the quiet, provincial life of Ozu's cinema, but that's hardly worth the insight. That uniquely fortunate entry which Wenders misses, Ozu transmits from beyond the grave. It is actually inscribed on his gravestone, where in place of any other signifier we find the ideogram for \"Mu\", meaning \"not\" or \"nothing\", which is at the heart of the koan on emptiness - known as the \"MU!\" koan - so important in the teachings of the Rinzai Zen school. Wenders being so utterly a stranger in all of this, so deeply embedded in his Western worldview, he starts rattling off a painfully flaccid diatribe on our perception of reality, as shaped by cinema and otherwise. Pontificating, banal notions that 'everything we see is ours', which is another example that filmmakers, however talented with images, are usually very poor commentators on their chosen field. He is so completely out-of-tune with the importance of Ozu's gravestone lesson - which should have been his portal of understanding of the Japanese world - that he concludes said diatribe with the notion that cinema now is empty, \"mu\", whereas in Ozu's films it teemed with life and truth. The idea that emptiness is the true essence of form, and that by extension Ozu's ethos flows from that assurance, completely escapes him. Had he understood that, he could have perhaps unlocked the meaning of the images of Japanese life he captures; the group of teenagers in a park drenched in the fashions and sounds of 50's America, or the food artists preparing from wax, in tremendous detail of shape and color, exact replicas of dishes to be displayed in a restaurant's window-shop. It is all about this concentrated, joyous work in form, as flowing from an empty-centeredness. So even though the kids dressed in rockabilly attire appear to be rebelling against everything that is culturally Japanese, the very expression of that rebellion - the precise, concentrated movements, the infatuation with movement itself - brings them at the heart of it. But Wenders being Wenders, when faced with the players in an arcade parlor quietly lost in their noisy game of pachinko, he can only think that they are subsumed automaton-like by the machine. All these are merely the scenes of some indecipherable cultural gap for him. So the essay on cinematic reality is really poor, and he even chances to meet Chris Marker on a small bar called \"La Jetee\", then working on Sans Soleil about similar stuff. With the hindsight of what Soleil would grow to be, this seems even smaller. Elsewhere he is reunited so far from Germany with Herzog, in suit and tie himself so far removed from his jungles. He goes on about his own thing about pure images, which in his films always flow out from the physical landscape. So it's natural that he thinks those images are impossible to find in the artifice of modern Tokyo - yet I posit that the fascinating work of the food artists constructing replicas of tofu and icecream is exactly the pure image. But not Wagnerian enough for Herzog. What is left, and what is usually really good with Wenders, is the beauty of images tied into space. Here the electric night of the big city. He's at least attuned to the visible fabric, with a natural eye for how to synthesize it into a pervasive mood, even when he's pretty daft about the mechanisms invisible to the eye that control it. As a filmmaker he looks wonderfully, but doesn't really see. So the stuff about Ozu don't interest me overmuch and I haven't commented on that, but everyone who is a fan should see the interview with Ozu's longtime cameraman. He reveals precious tidbits of the working ethos that informs his work. We see him enact how he setup those tatami shots for Ozu.",
         "Tokyo-Ga is a 1985 documentary film directed by Wim Wenders about filmmaker Yasujiro Ozu. Wenders travels to Japan and narrates the movie as he explores the world of Ozu, alternating scenes where he observes Japan and culture with interviews with crew and cast-members from Ozu's films. Wim Wenders says, \"If in our century something sacred still existed\u0085 if there were something like a sacred treasure of the cinema, then for me that would have to be the work of the Japanese director, Yasujiro Ozu. He made fifty-four films. Silent films in the Twenties, black-and-white films in the Thirties and Forties, and finally color films until his death on December 12th, 1963, on his sixtieth birthday. As thoroughly Japanese as they are, these films are, at the same time, universal. In them, I've been able to recognize all families, in all the countries of the world, as well as my parents, my brother and myself. For me, never before and never again since has the cinema been so close to its essence and its purpose: to present an image of man in our century, a usable, true and valid image, in which he not only recognizes himself but from which, above all, he may learn about himself. Ozu's work does not need my praise and such a sacred treasure of the cinema could only reside in the realm of the imagination. And so, my trip to Tokyo was in no way a pilgrimage. I was curious as to whether I still could track down something from this time, whether there was still anything left of this work. Images perhaps, or even people\u0085 Or whether so much would have changed in Tokyo in the twenty years since Ozu's death that nothing would be left to find.",
         "Wim Wenders attempts to turn his first trip to Japan into a homage to Ozu and an exploration of Japanese modernity, contrasted with the images of a bygone era glimpsed in Tokyo Monogatari. This is a deeply personal film, an unabashed pilgrimage by Wenders in search of his muse. His rambling narration, impenetrable at times, offers little insight on Japan. What first-time visitor can encapsulate a city as complex as Tokyo? The film works better on the subject of Ozu, the interviews with actor Chishu Ryu and cinematographer Yuuharu Atsuta offering glimpses of Ozu the man behind the icon. They also reveal the affecting power of cinema, both men clearly humbled and moved by the experience of collaborating with Ozu. The bottom line, however, is that this is a film about Wim Wenders, about his nascent stage as a filmmaker and how that came to fruition in the way it did. Fans of Wenders, rather than Ozu or Japanophiles, are the audience for this film. Technically the film offers up a few gifts, the prime example being a glimpse of the craftsmanship that goes into the making of the ubiquitous wax food in restaurant display windows. Unlike the weekend rockabilly dancers, crowded commuter trains, or oppressive concrete and steel structures, this sequence brings something both long-term residents and those ignorant of Japan will find fresh and illuminating. Unfortunately, elsewhere the film is interspersed with interminable footage of being in a taxi, being in a train, men hitting golf balls... all protracted shots for no other reason than to add a touch of Ozu to the film. A funky, slightly disturbing score helps make these sequences bearable. Tokyo-Ga is recommended for Wenders fans, and perhaps as nostalgia for anyone who spent a brief time in Japan in the mid-Eighties.",
         "the footage is lush and gorgeous, German camera-work of the 70s-80s of the highest caliber. but...the content I found ... appalling! it's been 15 or so years since I saw it and haven't thought about it in a long time, but was just reminded while suffering through this documentary about a feature film called \"Jew Süss\" ... but my impression of the overall tone is ineradicable . . . I have to admit I'd entirely forgotten the \"Ozu love letter\" element of the whole thing. more enjoyable is a documentary about designer Yojhi Yamamoto that I saw at about the same time in this big Wim Wenders retrospective. another film that was a very sweet standout was \"A Trick of the Light\" about film pioneers whose work was eclipsed by developments of Lumiere in France starring Udo Kier, which I recommend highly. Wim Wenders...is kind of a shallow filmmaker in my estimation. As with Tokyo Ga I'm sure he had no idea what a potentially offensive film he made. I remember particularly a sequence about some sort of Japanese pinball game that is insanely popular there, his reflections upon which seemed the fruit of a (lack of) intelligence of the sort that characterizes also that cinema excreta \"Lost in Translation\". the deep meaning of which seems to be \"god what a bunch of freaks these Japs are for not speaking English and not modeling themselves after the oh so kewl savvy ironic US population what in god's name is wrong with them?!"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Chris Sievernich Filmproduktion",
         "Gray City",
         "Westdeutscher Rundfunk (WDR)"
      ],
      "summaries": [
         "Wim Wenders travels to Japan in search of the Tokyo seen in the films of Yasujirô Ozu. Ozu's own Die Reise nach Tokio (1953) is a helpful (but not mandatory) pre-requisite to seeing Tokyo-Ga (1985).",
         "Moved by the work of director Yasujirô Ozu, Wim Wenders travels to Japan in search of the Tokyo seen in Ozu's films."
      ],
      "budget": 0
   },
   "movielensId": 62662,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "日本語"
      ],
      "releaseDate": "1985-04-26",
      "dvdReleaseDate": "2006-12-05",
      "directors": ["Wim Wenders"],
      "runtime": 92,
      "movieId": 62662,
      "title": "Tokyo-Ga",
      "mpaa": "NR",
      "actors": [
         "Yûharu Atsuta",
         "Werner Herzog",
         "Chishu Ryu",
         "Chris Marker"
      ],
      "imdbMovieId": "0090182",
      "originalTitle": "Tokyo-Ga",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Wim Wenders says, \"If in our century something sacred still existed… if there were something like a sacred treasure of the cinema, then for me that would have to be the work of the Japanese director, Yasujiro Ozu. He made fifty-four films. Silent films in the Twenties, black-and-white films in the Thirties and Forties, and finally colour films until his death on December 12th, 1963, on his sixtieth birthday. Ozu's work does not need my praise and such a sacred treasure of the cinema could only reside in the realm of the imagination. And so, my trip to Tokyo was in no way a pilgrimage. I was curious as to whether I still could track down something from this time, whether there was still anything left of this work. Images perhaps, or even people… Or whether so much would have changed in Tokyo in the twenty years since Ozu's death that nothing would be left to find.",
      "tmdbMovieId": 76406,
      "avgRating": 3.54839,
      "releaseYear": "1985",
      "numRatings": 31,
      "posterPath": "/vZkce81CO7xU7lKOO1jAVkcAV7d.jpg"
   }
}