{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0327920",
      "video": false,
      "title": "I Am Trying to Break Your Heart",
      "recommendations": [],
      "backdrop_path": "/bsbnrHTGmmQFhVMPZmBc1U5pSLm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe45e59251416c750661db",
               "name": "Jeff Tweedy",
               "profile_path": "/bDcmqYLfWUezH4xQZU2Ejm4j2M3.jpg",
               "id": 74329,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5473e3b1c3a3687d590015bd",
               "name": "John Stirratt",
               "profile_path": null,
               "id": 1389073,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5473e3be92514120b4003348",
               "name": "Leroy Bach",
               "profile_path": null,
               "id": 1389074,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5473e3d2c3a36875de00055d",
               "name": "Glenn Kotche",
               "profile_path": null,
               "id": 1286643,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5473e3dec3a3681db60009aa",
               "name": "Jay Bennett",
               "profile_path": "/nX2f6bfn3wHy7fmenMEJjNEhwMZ.jpg",
               "id": 1389075,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5473e3f49251416e58000da1",
               "name": "Greg Kot",
               "profile_path": null,
               "id": 1357846,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5473e403c3a3685ed1000f3e",
               "name": "Tony Margherita",
               "profile_path": null,
               "id": 1389076,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5473e413c3a3681fc600076e",
               "name": "Fred Armisen",
               "profile_path": "/d4RwMcYqEGsetnYsfWUZyG1ix3P.jpg",
               "id": 61110,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5473e41e9251416e58000daa",
               "name": "Wes Orshoski",
               "profile_path": null,
               "id": 147901,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e59251416c750661e1",
               "name": "Sam Jones",
               "profile_path": null,
               "id": 76559,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a7383b30e0a266435012dda",
               "name": "Erin Nordstrom",
               "profile_path": null,
               "id": 1391544,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.404744,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14308,
      "vote_count": 5,
      "budget": 0,
      "overview": "A documentary by photographer Sam Jones documenting American rock band Wilco recording their fourth album Yankee Hotel Foxtrot. Originally intended as a showcase of the band's creative process, the film crew catches unexpected complications between the band and its record label and problems among the band members themselves.",
      "similar": [],
      "original_title": "I Am Trying to Break Your Heart",
      "runtime": 92,
      "poster_path": "/hs67GWmHwkvW9gOOVCedeFC9rmA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2002-06-21",
      "vote_average": 8.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Sam Jones"],
      "runtime": 92,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0327920/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0NTY2NTg1MV5BMl5BanBnXkFtZTcwMzk5NzIzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeff Tweedy, John Stirratt, Leroy Bach | See full cast and crew »"],
      "reviews": [
         "I am fairly confused reading some of the reviews... this was NOT a fly on the wall, eye opening documentary at all. It was something between an EPK and a longform video. Have those of you making such comments seen any real docs? This film looks like what it is... a great photographer who does not know how to tell a story in a cut, just from his still images. You learn very little about Wilco and if you are not into the music, it is not watchable. There is 33 minutes before any bit of drama or story begins to unfold. All the hyped record label struggle is REFLECTIVE and only one single phone call unfolds before your eye. I found the film great to look at but hard to watch. It looks like something that was controlled, curbed and guided, not a REAL documentary. I happen to love YHF and the most enjoyable part of this film was hearing those songs but it was a complete distraction to the story. Some Kind of Monster is a FAR FAR superior film and I cant stomach the music of Metallica. I Am Trying to Break Your Heart is flat, uninspiring and in general does not serve the story it is said to represent... ash =o)",
         "This documentary comes as a nice surprise to anyone who has been following the Uncle Tupelo/Sun Volt/Wilco chapter of rock n' roll history being quietly written in the Midwest for the past 15 years. For anyone who is a fan, the film is a must-see. For general fans of rock n' roll it offers a handy introduction to one of the few interesting rock bands in this parched musical era. Judged solely as a documentary film it is a half-hearted effort that scores some points but ultimately doesn't carry its own weight. First the good: the cinematography, a grainy black and white that is probably 16mm film, is often breathtaking...even magical. In some scenes we can't really tell if that is Chicago snow falling, or simply the film stock being blown out, but the dreamy, low-tech look perfectly complements the musical style and tradition of Jeff Tweedy's aching folk-pop music. The sound recording is also excellent; while not offering the huge sonic experience of, say, the re-released Dolby 5.1 version of the Last Waltz, the sound crew of I Am Trying to Break Your Heart did a wonderful job of capturing the raw, pulsing sounds of a band at work, both in the recording studio and on the stages of nightclubs. Finally the filmmakers do a real service to music fans by including generous amounts of footage of the band at work in the studio writing, rehearsing, recording and mixing songs. It's exciting to see an album taking shape before your eyes in this manner. Despite these strengths the documentary as storytelling gets lost when it drifts away from the recording studio and into the politics of the music business. One thing you can usually count on with documentary filmmaking is that the good guys and the bad guys are allowed to fully reveal themselves in all their naked glory or shameless depravity before our very eyes, but this movie seems to have its moral compass all screwed up. Or, perhaps it would be more accurate to say: it doesn't have a moral compass but rather buys too easily into the idea that everyone associated with Wilco is a \"good guy\", and everyone else is villainous. In fact the band's manager, Tony Margherita, who is marginally awarded the role of narrator of the story, comes off as the kind of shameless huckster who makes the music business such an embarrassing behind-the-scenes spectacle. Early in the film he crows the music biz mantra of \"taking Wilco to the next level\" with such a moronic, repetitive gusto that one wants to stuff a tambourine in his mouth. When Reprise Records rejects the new Wilco album (ironically because they *don't* think it will take the band to the next level) he changes gears and starts talking about artistic integrity. But when Reprise drops the band from its roster he leads the band into a lucrative contract with... Reprise's sister label, Nonesuch, presumably because they offered the most money. This should be funny, revelatory stuff, but the filmmakers seem so enamored with the band that they are unable to identify the crassness of this whole story arc, and in fact end the film with the schmoozy manager chortling about how he got Warner Brothers (parent company of Reprise and Nonesuch) to buy the same album twice. Ironic, yes, but the decision to stay in the Warner Bros. family while adopting a tone of moral superiority to their enterprise is nothing but hypocrisy. Worse, when Tweedy kicks Jay Bennett out of the band midway through filming, the movie essentially takes a brief interlude to mock the departed songwriter. While Mr. Bennett indeed turns in an appalling interview after the incident (\"there are some real power issues within Wilco\" he puffs like some politically correct academic), the film isn't content to let him make a fool of himself, but rather goes to each member of the band and invites them to insult their departed bandmate on screen. When manager Margherita smugly asserts that Bennett had worn out his welcome with Wilco your skin crawls: it's like Fredo has been sent out on the boat at the end of The Godfather, Part 2 to meet his untimely fate. The filmmakers all in all seem a wholly unreliable judge of character. Rolling Stone editor David Fricke is treated as an oracle of wisdom, but comes off as the kind of phony that rock n' roll used to be about mocking, not worshipping. I watch this parade of inauthentic politicians rolling across the screen and remember the iconoclastic fire of Bob Dylan in \"Don't Look Back\", and it's hard to feel anything except depressed by the state of American music in 2002. All in all this is a movie to see if you love rock music, both because Wilco *matters*, and because it is a grim portrait of the rot at the heart of the American music industry: a rot that isn't just in the office towers of the record labels, as this movie would have you believe, but is much, much closer to home, where the damage it does is more subtle, but more irreparable. Maybe it isn't Warner Brothers fault. Maybe Wilco should heed the words: Doctor, heal thyself.",
         "firstly i'm a huge wilco fan and therefore was always going to like this, even if it was directed by michael bay and shot on a ninety eighties camcorder. It has fantastic footage that allows you to get into the 'wilco world' and generally made me very jealous. however i don't believe sam jones has any clout as a film maker. The biggest flaw seems to be that it doesn't get what yankee hotel foxtrot really is as an album. Even in the commentary Jeff Tweedy shows his surprise at jones' inclusion of live versions of songs from earlier albums like 'being there'. The big problem is that the album clearly changed a great deal after mr bennett left the band and jim o rourke turned a collection of good and slightly less than good rock songs into a ground-breaking piece of rock and roll. O rourke made the album great, hearing the versions that were painstakingly put together before Jim came on board proves this and yet Jones failed to make him a central part of the doc, relagated him to one joint interview with Jeff Tweedy when he says nothing. Unfortunately this film only tells half the story and therefore feels half-finished and padded out with lots of material that could have been put on the, already very healthy, special features discs. Having said all this it is still worth watching but not worth worshipping, a bit like yankee hotel foxtrot (unless you're listening to it on vinyl of course!).",
         "Fascinating documentary focuses on Wilco recording \"Yankee Hotel Foxtrot,\" the album that caused them to be released from their record contract, only to be picked up by a subsidiary of the same label that fired them. The album (which they were already paid for by former label Reprise) becomes their biggest seller ever. Gives you a \"fly on the wall\" look into the conflicts between Wilco top guns Jeff Tweedy and Jay Bennett, which resulted in Bennett leaving the band. Great studio footage, cool live band stuff, and some less compelling live Tweedy solo performances. That fact that this story unfolded LITERALLY in front of first time director Sam Jones' eyes is pretty amazing. Talk about being in the right place at the right time (for the sake of the film, that is). Maybe the band will be better off without Bennett? Who knows. I'd think this film would easily hold the interest of those not familiar with the band, but will be very special for those familiar with the unique, uncomprimising approach of these alt. country pioneers. 4 stars.",
         "There's something so intrinsically beautiful about watching a group of musicians work so effortlessly in their own environment. Their ambition and their passion comes through in the music, but only a film like this can capture all the details of this phenomena. I Am Trying to Break Your Heart is that film that captures the talent, the perseverance, and the passion of the band Wilco. It tells the story of their recording of their album \"Yankee, Hotel, Foxtrot\" and how they were given complete freedom to make the record, only to have that freedom stripped from them when it came time to actually release the album. This is a documentary made out of the love and respect for not just Wilco, but music in general. The film is structured as one would expect from a film like this. We cut between studio footage and concert footage with some breaks here and there that highlight a very specific mood and atmosphere of the film. There is never a dull moment in this film as there is always something interesting going on either verbally or artistically. The studio footage is fascinating as we get to see the nitty gritty process of making a record come alive. We see the most trivial things receive long, sophisticated conversations. This documentary does a wondrous job of capturing what music means to these guys, and how strong their passion is for it. A non-musician type like me might not understand everything they are talking about during debates over the music, but it is still very evident that this band takes their job seriously and they respect and adore music to no end. Then of course there's the concert footage which also captures a hint of magic and motivation in this band. They play in small venues where the music seems to become more personal as they rock out on stage. This footage perfectly highlights the results of their passion and tireless determination to make their album great. It is evident that these guys love what they do and will surely never stop doing it. They love making art as much as this film loves capturing art. This is a fascinating film that really does show what making art is all about, enveloping a look and feel that matches the somber quality of the band. Wilco's music and the film's atmosphere are incredibly in sync, showing further dedication on both fronts. I Am Trying to Break Your Heart is also an interesting profile on the band's front man Jeff Tweedy. He is an incredibly interesting character whose love for music knows no boundaries. He does what he wants to do and will stop at nothing to make the record he wants to make. There is an air of pretentiousness to him, but I suppose it goes along appropriately with the amount of talent this man possesses. He and Wilco make great music, but they also talk about music in a way that shows how much more it means to them than the average person. And to see this unfold within the film is truly remarkable. When you get right down to it, this is just a fantastically well made documentary, and that's all there is to it. It's more intriguing and introspective than entertaining, and it truly is a musicians film. The non-musicians are somewhat alienated at times, but one can at least respect the obvious passion and talent these fine gentlemen display. For a middle of the road Wilco fan who isn't a musician himself, this makes a very fascinating and very enticing one time watch. For musicians and massive Wilco fans this is surely considered to be a masterpiece.",
         "Firstly I confess I am a huge Wilco fan and might be a little biased based on that! I've seen a few documentaries that follow around a band and try to capture something worthy of a feature-length documentary(radiohead's documentary 'meeting people is easy' for one example) and I'm always disappointed at how little band access they seem to have. This time, I didn't have that feeling at all. I think that Jeff Tweedy and the rest of wilco were really open and let us into their world. The story is told in such a way that you don't even realize that there is a story for the first thirty minutes or so. I like that. I don't think the story of wilco's best album could have been told any other way. If you hate the record industry, if you love great music, if you like a documentary filmmaker who knows how to keep his subject and not himself as the focus of his film (Michael Moore take note!) Then this is the film for you. It feature some amazing wilco concert footage that will make you fall in love with the band if you aren't already!",
         "I'm a big fan of Wilco, just west of Toronto and had not heard about this movie until Dec.23. Needless to say I got my brother to buy it for me for xmas and ripped it open and thoroughly enjoyed this dvd. Maybe because it is Wilco, but Sam Jones got lucky with a nice story between a bunch of corporate idiots and a group of talented musicians and came out with a great doc.",
         "This picture is a must see for any Wilco fan, and I highly recommend seeing it on the big screen if possible. Besides the great concert and 'in process' recording footage, it has great art direction and cinematography. If you're a fan, you already know the stroy; Band makes record, band gets rejected by label, bands fires member, band tours, band gets label, critics love band. Interesting behind the scenes stuff that doesn't make you want to ralph like watching that stupid VH-1 show.",
         "This is a documentary about the roots-rock band Wilco and the trials and tribulations they suffered in the production of their 2002 CD `Yankee Hotel Foxtrot.' Initially given a good deal of support by their record label (Reprise) Wilco strayed from their previous country folk-rock sound to embrace more experimental studio techniques and used synthesizers and strings to flesh out their sound. Their suits at Reprise balked at this sea-change and eventually refused to release the record and booted the band from the label. While all of this is going on the band is suffering internal strife as one of the members is let go with acrimony. The story of Wilco's last album has become legendary in the music world and this documentary, shot in grainy black and white tells the story and portrays the band and its leader Jeff Tweedy in a sympathetic light. Tweedy is shown as the disheveled genius musician pushing the art forward while the greedy evil corporate executives attempt to thwart him. It's nice to see the band triumph in the end, and the film does throw some light on the pressure that is undergone to make a record for a major label as well as showing some of the seedier sides of the music business as flaks on both sides beat their chest and trumpet their side of the story. (Rating: 7 out of 10)",
         "The splattered coverage of Wilco on film made for a entertaining viewing experience.Wilco are clearly a hard working band who make music that matters to them.Whether or not that had anything to do with Jay Bennet's departure is unclear.But,bands have problems.And when it's recorded to film it makes you watch a little closer.The commentary on the DVD was surprisingly funny as well.Let us just see if their next album is as good as their last,considering,all that has happened."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Bona Fide Productions",
         "Cowboy Pictures",
         "Experience Music Project"
      ],
      "summaries": [
         "First time director Sam Jones documents the making of Wilco's fourth studio Album, Yankee Hotel Foxtrot. Named after the Wilco song that is featured on Yankee Hotel Foxtrot, an album that strays from the Alt-country that made them famous. Jones' desire was to document the creative work of YHF's production, he seems to have found a bit more, including band members departing and a conflict with Reprise record company. This is a true documentry of art versus money-driven media conglomerates.",
         "A movie presumably intended to document Wilco's recording of what is supposed to be their \"breakthrough\" album, \"Yankee Hotel Foxtrot.\" However, the documentary quickly becomes a chronicle of a band in turmoil. Although the album is destined to later be declared a classic by critics, the band's record label rejects it and drops Wilco from the label--citing the album's lack of marketability. The problems are further complicated when band leader Jeff Tweedy fires another band member after the album is completed because of creative differences. However, the band is determined to move on and find a new record label that will accept the album and respect their need for creative freedom.",
         "First-time filmmaker and award-winning photographer Sam Jones documents the recording of Wilco's album, \"Yankee Hotel Foxtrot.\""
      ],
      "budget": 0
   },
   "movielensId": 6306,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-06-21",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Sam Jones"],
      "runtime": 92,
      "movieId": 6306,
      "title": "I Am Trying to Break Your Heart",
      "mpaa": "",
      "actors": [
         "Jeff Tweedy",
         "John Stirratt",
         "Leroy Bach",
         "Glenn Kotche",
         "Jay Bennett",
         "Greg Kot",
         "Tony Margherita",
         "Fred Armisen",
         "Wes Orshoski"
      ],
      "imdbMovieId": "0327920",
      "originalTitle": "I Am Trying to Break Your Heart",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": ["6z3hIYB8nec"],
      "plotSummary": "A documentary by photographer Sam Jones documenting American rock band Wilco recording their fourth album Yankee Hotel Foxtrot. Originally intended as a showcase of the band's creative process, the film crew catches unexpected complications between the band and its record label and problems among the band members themselves.",
      "tmdbMovieId": 14308,
      "avgRating": 3.83278,
      "releaseYear": "2002",
      "numRatings": 299,
      "posterPath": "/hs67GWmHwkvW9gOOVCedeFC9rmA.jpg"
   }
}