{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "betrayal",
            "id": 10085
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "makeover",
            "id": 34130
         }
      ],
      "imdb_id": "tt0308878",
      "video": false,
      "title": "The Shape of Things",
      "recommendations": [
         18038,
         25921,
         71910,
         138745,
         40139,
         27204,
         17035,
         18408,
         77469,
         40973,
         56821,
         44999,
         177851,
         28676,
         20053,
         34768,
         86343,
         272602,
         22792,
         332839
      ],
      "backdrop_path": "/tGjNLqnTbT6TgAHyr45DGK3b8uI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe4457c3a368484e01d9ff",
               "name": "Paul Rudd",
               "profile_path": "/8eTtJ7XVXY0BnEeUaSiTAraTIXd.jpg",
               "id": 22226,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jenny",
               "gender": 1,
               "credit_id": "52fe4457c3a368484e01da03",
               "name": "Gretchen Mol",
               "profile_path": "/46mBoe7xf3pJgQLEYNw6Msniq3r.jpg",
               "id": 15370,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Evelyn Ann Thompson",
               "gender": 1,
               "credit_id": "52fe4457c3a368484e01da07",
               "name": "Rachel Weisz",
               "profile_path": "/3QbFXeiUzXUVUrJ7fdiCn7A7ReW.jpg",
               "id": 3293,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Phillip",
               "gender": 2,
               "credit_id": "52fe4458c3a368484e01da0b",
               "name": "Frederick Weller",
               "profile_path": "/eeyLI8ED2CQIm31WNj04szabJAF.jpg",
               "id": 143017,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4458c3a368484e01da11",
               "name": "Neil LaBute",
               "profile_path": "/snHfcueBlYFinCdUoVmK9CHdZX0.jpg",
               "id": 58689,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53205145c3a368572e0013e0",
               "name": "Elvis Costello",
               "profile_path": "/iwSEIAAfvT7ZLvWgi9zqIyfs2BM.jpg",
               "id": 47990,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "53205157c3a368572e0013e3",
               "name": "James L. Carter",
               "profile_path": null,
               "id": 51783,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "53205170c3a36857350013e0",
               "name": "Joel Plotch",
               "profile_path": null,
               "id": 61192,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "53205183c3a3685754001331",
               "name": "Fiona Weir",
               "profile_path": null,
               "id": 11295,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5320519bc3a36857350013ec",
               "name": "Lynette Meyer",
               "profile_path": null,
               "id": 957249,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "532051abc3a368573c0013e1",
               "name": "Sondra Thorpe",
               "profile_path": null,
               "id": 1300463,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "532051bec3a368573c0013e7",
               "name": "Neil LaBute",
               "profile_path": "/snHfcueBlYFinCdUoVmK9CHdZX0.jpg",
               "id": 58689,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.173998,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 22958,
      "vote_count": 43,
      "budget": 0,
      "overview": "Quiet, unassuming Adam is changing in a major way, thanks to his new girlfriend, art student Evelyn. Adam's friends are a little freaked by the transformation.",
      "similar": [
         226,
         1024,
         1259,
         8325,
         19053,
         13523,
         14578,
         9769,
         86838,
         796,
         15037,
         17612,
         19918,
         2149,
         2770,
         862,
         949,
         979,
         20453,
         19913
      ],
      "original_title": "The Shape of Things",
      "runtime": 96,
      "poster_path": "/9Fi7T0WLQThhIY4XZK0mt6YukzY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/cifwIG2aVR1dRis6yoiilq4qeIh.png",
            "name": "Working Title Films",
            "id": 10163,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Pretty Pictures",
            "id": 8875,
            "origin_country": ""
         },
         {
            "logo_path": "/8T8OOQe3Xei2mW0DQepwQG1IMT0.png",
            "name": "StudioCanal",
            "id": 694,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "USA Films",
            "id": 987,
            "origin_country": ""
         }
      ],
      "release_date": "2003-01-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Seduction Is An Art",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Neil LaBute"],
      "runtime": 96,
      "synopsis": "Adam is a student at Mercy College, a fictitious Midwestern college, as an English Literature major, who wants more in his dull life then classes and studying. One day by chance, Adam meets Evelyn, an attractive graduate art student, at the local museum where he works. Afterwards, his life takes an unexpected turn. Never having had success with women, the nerd-like, socially awkward Adam is flattered when Evelyn shows an interest in him and, at Evelyn's suggestion, begins regular exercise regiment, eats healthier foods, and purchases contact lenses in place of his eyeglasses. These initial changes regarding Adam's physical appearance are well-received by Adam's friend Phillip and his girlfriend Jenny. Later however, Evelyn cajoles Adam into undergoing plastic surgery and succeeds in persuading him to cut himself off from Phillip and Jenny as well as all his old friends because Evelyn claims to Adam that SHE is his one and only friend. After another while, Adam proposes marriage to Evelyn, and right away, she accepts. But at the climax, Adam learns that he has been part of Evelyn's MFA thesis project, a topic often touched on in conversation throughout the movie but never fully explained. Evelyn relates that she had been instructed to \"change the world\" by her graduate adviser, but that she has chosen to change \"someone's world\", her academic work ultimately consisting of \"sculpting\" Adam into a more attractive human being. Her true nature and cruelness becomes known one day when she presents Adam before an audience of students and faculty as her \"creation\", which somewhat embarrasses him. Accordingly, none of the feelings she has shown him this whole time are genuine; at no stage in their \"relationship\" did she ever fall in love with him; her videotaping of their lovemaking is just a part of the project's documentation. The next day at her gallery opening, Evelyn announces before the live audience that she is not going to marry Adam and the engagement ring he offers her is simply one of the exhibits of her art installation, albeit the \"capper to my time at Clarkson.\" Publicly humiliated and devastated, Adam confronts Evelyn, demanding an explanation for her actions. Completely unapologetic, Evelyn responds by saying that he should in fact be grateful to her, claiming that, objectively speaking, she has been a positive influence on his life, making him a more attractive and interesting person in the eyes of society. Finally seeing the devious vixen that Evelyn really is, Adam tells her that they are finished. Evelyn cynically states to Adam that there never was a \"relationship\" between them to finish in the first place. In the final moments of the film, the beaten and emotionally broken Adam stands alone, surrounded by the remnants of his life before Evelyn. Even Adam's old friends, Philip and Jenny, treat him with scorn and refuse to forgive him for dropping them in favor of Evelyn. Moving to a camcorder, he watches a section of a tape recorded earlier in the film, a moment in which Evelyn had whispered in his ear what she described as the one \"true\" thing of their relationship. The film ends as Adam watches and continuously rewinds the tape, listening to Evelyn's truth over and over again.",
      "writers": [
         "Neil LaBute",
         "Neil LaBute"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0308878/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NTUxODI1OV5BMl5BanBnXkFtZTcwODY2ODUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Paul Rudd, Rachel Weisz, Gretchen Mol | See full cast and crew »"],
      "reviews": [
         "Terrifying but so true tale about the way people can control us and the reasons we just let them do it. Rachel Weisz is amazing as art student who makes changes to a lonely guy who just wants to fit in. The story in true Neil Labute fashion takes a macabre turn and makes you question everything that you have done in your relationship and gives you a well deserved punch in the stomach in the reality department as well. The acting is beyond top of its game with Rachel Weisz proving once again to be one of the most talented and gifted actresses of our generation. Her performance is beyond brilliant and she single handily carries this movie on her shoulders with her performance. Paul Rudd, Fred Weller and Gretchen Mole do great work as well and Neil Labute proves once again to be a profound playwright of uncanny wisdom of the evil that resides in the human heart. I do hope that Weisz and Labute work together again.",
         "Rachel Weisz seems to be everywhere. From a Soviet partisan in besieged Stalingrad in \"Enemy at the Gates\" to a self-assured single mom in \"About a Boy\" and most recently as a grifter in \"Confidence,\" she inhabits her roles with deft assurance. Here, in Neil La Bute's play-brought-to-the-screen, \"The Shape of Things,\" Weisz is a disturbing, thought-provoking challenging character: an artist in pursuit of a master's degree but in reality a tester of uncharted waters as she combines the creation of art with her relationship with a man who, like a canvas, is transformed from without. In this case by her. Paul Rudd is Adam, an art gallery guard who Evelyn, the art student, first encounters in a quirky exchange that suggests an unfolding comedy. There are humorous moments but a darker side slowly emerges as Evelyn carefully encourages Adam to shed his dorky exterior. There's nothing new, of course, with the theme, \"Change if you love me,\" but here Adam's relationship with his close friends, Phillip (Fred Weller) and Jenny (very well acted by Gretchen Moll) takes some disturbing turns. Is Evelyn a catalyst or an agitator? Is her commitment to art part of her persona or its sum total? These questions are increasingly explored in this short film. Does the name \"Adam\" have some esoteric meaning here? Some plays don't travel well to the screen. This one does. La Bute's play seems to have been little altered by him for a screenplay. What is the place of ideas and intellectual experimentation in the creation and fostering of an intimate relationship? Are there boundaries that must be respected even if truth is sacrificed in the process? Does art illuminate or camouflage the reality of a relationship? No ready answers and no final ones here but the effort yields a thought-provoking study. Rachel Weisz's emerging and brooding intensity is the anchor for this unusual film. She also produced the movie. The score is by Elvis Costello. His fans will appreciate the soundtrack. 8/10.",
         "\"Moralists have no place in an art gallery.\" This is the quote that is plastered over the wall of a museum in The Shape of Things, the latest film by Neil LaBute (In the Company of Men, Your Friends and Neighbors), and judging by this latest piece of his, I don't think there's any doubt as to whether or not this is where LaBute belongs. After trying to play it straight (and failing) with last year's Gwyneth Paltrow-Aaron Eckhart romance Possession, LaBute returns to what he does best: twisted expositions of the horrors of humanity. It wouldn't be appropriate to say that his films are entertaining per se (with the exception of Nurse Betty -- but even that had its shocking moments), but they ARE perversely compelling. The Shape of Things is what Pygmalion would look like if it had been directed by John Waters -- or, well, LaBute, for that matter: while the story is essentially the same (although in this case, a woman makes over a bourgeois man), there is no feel-good love story element ... whatsoever. At all. Adam (Paul Rudd) is a corduroy-wearing, tape-around-the-nose-of-his-glasses college student who develops an obsession for a femme fatale art grad named Evelyn (Rachel Weisz). His best friends Jenny (Gretchen Mol) and Phillip (Fred Weller) end up causing friction as Evelyn gradually transforms Adam into a metrosexual robot, and everything collides in a conclusion that -- while possibly predictable -- is wholly unsettling. LaBute is no stranger to abusive characters: In the Company of Men was possibly one of the cruelest films ever made -- even though it did have a message. The difference between that and The Shape of Things, however, is that here there isn't an innocent victim: every other character is just as deceptive and manipulative as Evelyn -- which makes it possibly even MORE disturbing than Company. It would be easy to just accuse LaBute of dwelling on the oppressive, but I, for one, am pleased (if that word could possibly be used in correlation with this film) that he is challenging our world and our way of thinking. At one point in the film Evelyn says, \"It is to indifference that I say [hoists both middle fingers] to.\" It is quite apparent that LaBute has the same mentality -- but take that as a good thing. The Shape of Things is a masterfully made work of art: adapted from LaBute's own stage play, it is a representation (whether condemning or accepting is purely up to you) of the cynicism of our generation. The small ensemble cast is terrific all-around: Rudd recalls the comic mannerisms of Ben Stiller and places them in dramatic context. Weisz essentially reprises the Aaron Eckhart role of in In the Company of Men, and Mol and Weller are both perplexed by-standers. The song during the ending credits is \"Tear Off Your Own Head (It's a Doll Revolution),\" by Elvis Costello, and it couldn't be more appropriate: you could argue that some of the characters are more ruthless than others in this film, but in the end, they're each responsible for their own downfall. LaBute never tries to moralize -- he leaves that part up to us -- but he does create art (sick and hopeless as it may be), and he deserves all the praise and support he can get for it. Grade: A",
         "Heart wrenching and captivating look and relationships that is Neil Labute best film since his horrifying \" In the Company of Men\" Rachel Weisz literally hold the movie and the viewer in the palm of her hand with a supercharge performance that will be talked about for years and Paul Rudd does good as well as her object of desire. The movie starts off being one thing and ends up being something completely and terrifyingly different once it was over. This is one viewer who is still blown away by the climax and will probably always remember the lesson that was learned by watching this film. Special Thanks to Neil Labute and Rachel Weisz for making one of the most compelling movies ever made.",
         "Adam Sorenson (Paul Rudd) is a simple, insecure and shy student that works half period as a security guard of a museum and in a rental. He meets the anarchist and transgressor student of Arts Evelyn Ann Thompson (Rachel Weizs) trying to paint a penis in an important statue, and after arguing with her, in the end they schedule a dinner. Evelyn becomes his girlfriend and he introduces his best friends, Jenny (Gretchen Mol) and Phillip (Frederick Weller), to her. As long as they stay together, Adam's behavior changes and his appearance and confidence improve influenced by Evelyn. He has an affair with Jenny, betraying and lying to Evelyn and to Phillip, and destroying their friendship. When Evelyn presents her thesis for the Master degree, Adam is surprised with revelations. When I saw the cruel \"In the Company of Men\" in 1997 or 1998, I became a great fan of Neil LaBute. However, his next good movies have never been in the same level of his debut. In \"The Shape of Things\", Neil LaBute is in shape again and presents a magnificent cruel and heartless tale of seduction and manipulation. I felt the same surprise as Adam with the plot point of the story, which is a great study of human behavior, with excellent performances of Rachel Weisz and Paul Rudd. My vote is nine. Title (Brazil): \"Arte, Amor e Ilusão\" (\"Art, Love and Illusion\")",
         "After the first 30 minutes I felt like the film lacked energy. The pace was a little too slow for my taste, and the intensity too low. I wanted it to be snappier, more sizzling. But then, about halfway through, it got really interesting. The second half, although it still suffers from some pacing problems, makes up for the first. And then the third act is one of the most brilliant and satisfying third acts I saw in a long time. The ending brings together all of the elements and themes that were planted throughout the movie (our obsession with the way things look, the line between art and real life) to form insights about our lives that are as brutal as they are true. I am generally fond of Neil LaBute's work - most of the time his works contain more than what they initially seem to be (I haven't see \"The Wicker Man\" remake yet, but I heard it was horrible). Here, what starts off as your run-of-the-mill romantic comedy/drama, develops into a cynic's paradise, presenting insights into our lives which are as brutal as they are true. Three of the four actors do a splendid job (Weisz, Rudd & Mol). I especially liked Paul Rudd's performance, and the way his character changes throughout. All three, and especially Rachel Weisz, are convincing in their roles, and deliver multi-layered performances with lots of subtext. Fred Weller's performance leaves something to be desired, but the fact that his role is well written somewhat makes up for that. LaBute has successfully made all four characters three-dimensional and they feel like real people. Overall, I'd say it was a pretty great movie, certainly entertaining, and an important one to watch and analyze if you are into writing, directing or acting. Somewher, though, I feel like it didn't live up to its full potential. This script, if directed with more intensity, could have become one of my favorite movies, up there with films such as \"Closer\", \"Glengary Glen Ross\" or \"Oleanna\". Maybe it's the transition from the stage to the screen that made LaBute feel like he should make everything more minimalistic and restrained. But it's definitely worth checking out.",
         "This film was absolutely not what I expected it to be. In the first half an hour, I even got a little bored, because it seemed like the story was going nowhere. Fortunately, I got my happy ending - no, not at all a film with a happy ending, just an ending that makes the film precious! It really makes you stare at the black screen, with the cast moving in front, and think about what you've seen over and over again. Of course, the brilliant play of Rachel Weisz cannot be left unmentioned, but I think that the others did a great job as well. \"The Shape of things\" is a film with actually just four actors and one great idea, and trust me, it is worth seeing. I am just wondering how would I feel the second time I watch it!",
         "When he was much younger, Woody Allen said that he would most likely have been a sniper on top of a building if he hadn't had his writing career. After seeing 3 of his self-penned movies now, I have come to the conclusion that the same fate might have awaited Neil LaBute if he hadn't gotten his writing 'thingie' off the ground. The Company of Men was vile, Your Friends and Neighbors was more subversive about it but vile just the same (even though I actually really liked that one), and now we have The Shape of Things, a 4-character indulgence which involves a personal betrayal of the vilest nature. Vile can be valid, don't get me wrong, but in LaBute's hands it seems to be more of a way for him to exorcise his own demons rather than attempt to consistently present us with believable situations and thoughtfully well-written characters. Of course he SHOULD exorcise those demons (the Woody Allen statement comes to mind again), but it would be much better if he could start doing it in a more constructive, less selfish way. This movie itself is very much like the character LaBute creates in the film (which was a play originally and feels like it, also not good)- the character played by Rachel Weitz, who portrays \"EVElyn\", a lovely little Gemini sociopath, to Paul Rudd's Adam: -=- this is NOT a spoiler because it's mentioned in the film's synopsis here at imdb -=- Weitz' character brutally exploits Rudd's character under the guise of an 'art' project for school, but in reality, her project would have been more appropriate for a psychology class experiment or even more appropriately, for a dissertation in Sadism 101. The film does the same thing - from the title, it seems like it's some sort of commentary on our society but in reality it's just an excessively mean-spirited indulgence on LaBute's part. There is no truth here, not really, and because of this, the acting isn't very good either, especially in the scenes where Rudd is supposed to be devastated by Weitz' betrayal -- at no time do we actually feel anything resembling reality in his reaction to her cruelty. He doesn't transmit genuine hurt or anger or any combination of those two, and when he sort of acts like he's crying, it's even less believable. Sort of like the film itself.",
         "A tedious, pointlessly mean-spirited film version of what appears to have been quite a bad play to begin with. Usually excellent actors (Paul Rudd, Rachel Weisz, Frederick Weller) give overly fussy, theatrical performances that seem designed to inject some energy into the script's turgid dialog and unbelievable plot turns. Apparently intending to make a significant statement about the ultimate and necessary amorality of art, the film only succeeds in making one wonder why even a schlub like the Rudd character would put up with the obvious insanity of Weisz's Evelyn, even if she is the first woman to bed him since high school. The self-conscious hatefulness of the material is puerile and unredeemed by any real insight into either art or the human condition. Truly dreadful.",
         "This is a terrible movie! A) Neil Labute is under the mistaken impression that depicting humankind as self-absorbed, cruel, shallow, misogynist, misanthropes somehow means he's really deep or hip or artistic. NOT. I argued against those who called In the Company of Men misogynist, because I thought the man was trying to make a point about misogyny and how unattractive/self-loathing it is, etc. But after seeing 5 films by this man, I realize he's not commenting on these things, he simply IS these things. He probably thinks he's very Mamet-esque, but he shares more in common with Todd Solodnz who doesn't seem to think much of humankind, either. The \"f*** you\" that Rachel Weisz delivers straight to the camera at the end, as she flips the bird with both hands -- because one bird and the words just don't quite get the point across -- is Labute's message to the world, including the audience that pays their hard-earned money to see his movies. B) This is a 4 character play put on film. It reads like a play, it's staged like a play. I didn't see the play, but I feel as though I have. I could see the scene changes, accompanied by the same scene change music, as opposed to a real film score. The dialogue had that stilted, actor-y stage quality complete with those pauses which are supposed to be filled with subtext but really just play as if the director said, count to 5 before your next line. And there are some talented actors in here, who deserve better. In short, it's contrived, it's ugly, it's poorly directed, it's not worth your $9.25 and I hate to say that about any indie film, cause I want to support indies. But I want to oppose misanthropy more. There's so much to be writing about in this world at this time that is truly important, and this is filmic equivilent of performance art which, like a self-important art student,"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Mepris Films",
         "Pretty Pictures",
         "StudioCanal"
      ],
      "summaries": [
         "While visiting an art museum, a nerdy college student named Adam meets an iconoclastic artist named Evelyn and is instantly smitten. As their relationship develops, she gradually encourages Adam to change in various ways that surprise his older friends, Jenny and Philip. However, as events progress, Evelyn's antics become darker and darker as her influence begins to twist Adam and his friends in hurtful ways.",
         "Adam Sorenson is a simple, insecure and shy student that works half period as a security guard of a museum and in a rental. He meets the anarchist and transgressor student of Arts Evelyn Ann Thompson trying to paint a penis in an important statue, and after arguing with her, in the end they schedule a dinner. Evelyn becomes his girlfriend and he introduces his best friends, Jenny and Phillip, to her. As long as they stay together, Adam's behavior changes and his appearance and confidence improve influenced by Evelyn. He has an affair with Jenny, betraying and lying to Evelyn and to Phillip, and destroying their friendship. When Evelyn presents her thesis for the Master degree, Adam is surprised with revelations.",
         "Quiet, unassuming Adam is changing in a major way, thanks to his new girlfriend, art student Evelyn. Adam's friends are a little freaked by the transformation."
      ],
      "budget": 4000000
   },
   "movielensId": 6341,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-01-01",
      "dvdReleaseDate": "2003-09-23",
      "directors": ["Neil LaBute"],
      "runtime": 96,
      "movieId": 6341,
      "title": "The Shape of Things",
      "mpaa": "R",
      "actors": [
         "Paul Rudd",
         "Gretchen Mol",
         "Rachel Weisz",
         "Frederick Weller"
      ],
      "imdbMovieId": "0308878",
      "originalTitle": "The Shape of Things",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["LXgmAGyeW8c"],
      "plotSummary": "Quiet, unassuming Adam is changing in a major way, thanks to his new girlfriend, art student Evelyn. Adam's friends are a little freaked by the transformation.",
      "tmdbMovieId": 22958,
      "avgRating": 3.39865,
      "releaseYear": "2003",
      "numRatings": 444,
      "posterPath": "/9Fi7T0WLQThhIY4XZK0mt6YukzY.jpg"
   }
}