{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "disc jockey",
            "id": 635
         },
         {
            "name": "rap music",
            "id": 897
         },
         {
            "name": "hip-hop",
            "id": 898
         },
         {
            "name": "rhyme battle",
            "id": 899
         },
         {
            "name": "subway",
            "id": 1552
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "breakdance",
            "id": 1974
         },
         {
            "name": "graffiti",
            "id": 2815
         }
      ],
      "imdb_id": "tt0086946",
      "video": false,
      "title": "Beat Street",
      "recommendations": [
         25576,
         55336,
         88863,
         34601,
         8199,
         61418,
         219674,
         20863,
         15259,
         140443,
         19033,
         33135,
         63437,
         121822,
         13941,
         51603,
         19727,
         35113,
         46924,
         273610
      ],
      "backdrop_path": "/iI2eZNZhNyPcZfQr0oJmt0KmBKn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Kenny Kirkland",
               "gender": 2,
               "credit_id": "52fe473d9251416c7509276b",
               "name": "Guy Davis",
               "profile_path": "/xTvNBX8dkHobg3PNOPBzzHYuGJX.jpg",
               "id": 82217,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Ramon",
               "gender": 0,
               "credit_id": "52fe473d9251416c7509276f",
               "name": "Jon Chardiet",
               "profile_path": null,
               "id": 82218,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Tracy Carlson",
               "gender": 1,
               "credit_id": "52fe473d9251416c75092773",
               "name": "Rae Dawn Chong",
               "profile_path": "/6mk5lSTIUav9T1M0VAdUP46FTSH.jpg",
               "id": 13312,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Chollie",
               "gender": 2,
               "credit_id": "57c6fcd2c3a3680b290027c7",
               "name": "Leon W. Grant",
               "profile_path": null,
               "id": 123896,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Carmen Cararro",
               "gender": 1,
               "credit_id": "57c6fcf0c3a3680b600026e3",
               "name": "Saundra Santiago",
               "profile_path": "/kZg57P0a0WW8IYLgJZOt6zreBaH.jpg",
               "id": 171135,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lee Kirkland",
               "gender": 0,
               "credit_id": "57c6fd1bc3a3680bb90026c0",
               "name": "Robert Taylor",
               "profile_path": null,
               "id": 1672695,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Cora",
               "gender": 1,
               "credit_id": "57f465cf9251411c7b00098a",
               "name": "Mary Alice",
               "profile_path": "/2h20nF8gvhqhgVDV6Lru55dKB44.jpg",
               "id": 9572,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Domingo",
               "gender": 0,
               "credit_id": "57f465dac3a368055d0008f8",
               "name": "Shawn Elliott",
               "profile_path": "/4g9yhQFt1Z7MFirapfgQzb4WfaC.jpg",
               "id": 1327735,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Robert",
               "gender": 2,
               "credit_id": "57f465e59251411c750009ee",
               "name": "Duane Jones",
               "profile_path": "/9JykB5zs5MVwzBQQXfxjNUbOGsj.jpg",
               "id": 97912,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "57f465f4c3a368054e000831",
               "name": "Doug E. Fresh",
               "profile_path": "/cpDLGDVHM5upw2XuE23cEwB6hML.jpg",
               "id": 217536,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "High School Student (scenes deleted)",
               "gender": 2,
               "credit_id": "57f466069251411c7e000a4f",
               "name": "Kadeem Hardison",
               "profile_path": "/aCuoYn6GdVqZyy35JmqaY6TS9bO.jpg",
               "id": 66554,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe473d9251416c75092761",
               "name": "Stan Lathan",
               "profile_path": "/zRS52BzHBNjDfiTvZYotV1tTzvB.jpg",
               "id": 60473,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe473d9251416c75092767",
               "name": "Andrew Davis",
               "profile_path": "/vE3ls4wUsHQZAtu4gIzTIeQEmMG.jpg",
               "id": 12989,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe473d9251416c75092779",
               "name": "David V. Picker",
               "profile_path": null,
               "id": 10590,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 3.079128,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17667,
      "vote_count": 29,
      "budget": 0,
      "overview": "An aspiring DJ, from the South Bronx, and his best friend, a promoter, try to get into show business by exposing people to hip-hop music and culture.",
      "similar": [
         277216,
         8328,
         650,
         65,
         342473,
         14114,
         10476,
         382399,
         6575,
         406,
         10634,
         10028,
         9817,
         16136,
         9298,
         10560,
         549,
         21724,
         13002,
         15278
      ],
      "original_title": "Beat Street",
      "runtime": 105,
      "poster_path": "/g3z0GJhLjBwCkPXJ0XARcP6dEBq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
         "name": "Orion Pictures",
         "id": 41,
         "origin_country": ""
      }],
      "release_date": "1984-06-08",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Takin' The Beat To The Streets!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stan Lathan"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Steven Hager",
         "Andrew Davis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086946/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4NTg2NDA3N15BMl5BanBnXkFtZTcwODM0NjgyNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rae Dawn Chong, Guy Davis, Jon Chardiet | See full cast and crew »"],
      "reviews": [
         "It's fine to appreciate this film through the sieve of nostalgia. Even I have a hard time viewing this film without reciting all the words- I've seen it many many times. But the important thing to note here is that while Harry Belafonte made a noble effort to shape a story out of the Bronx's greatest cultural export, it's only successful half of the time. The result is a film that garners lots of groaning through scenes while waiting for the 'good parts'. Rae Dawn Chong is flimsy and ineffective as usual, in the role of the dance school instructor who 'discovers' Lee and KK. The ensuing romance that KK and Tracy have is terribly trite and makes for sleepy viewing. Likewise the sopping wet story of Ramon and his girlfriend, who have a child and disapproving parents. Heavy handed and poorly acted to boot- even for the time period. All the graffiti was designed by stage painters, and looks like it- distant and plastic. This is a depiction of a corny world indeed. What Beat Street is notable for, is managing to compile many notable music artists and b-boys/b-girls in performance. The Rock Steady and NY Breakers footage, the Us Girls group assembled for this film, Busy Bee, Melle Mel and the Furious Five, Bambaataa & Soul Sonic Force, Tina B., Brenda Starr, Treacherous Three and Doug E. Fresh- there's loads of it which greatly outweighs the mindless fluff of the so-called plot. The soundtrack (co-produced by Arthur Baker of \"Planet Rock\" fame) is extremely notable as well. It was originally sold in 2 volumes, and while each record has several watery ballads, the classic songs like \"Frantic Situation\", \"Son of Beat Street\", \"Santa's Rap\" and \"Battle Cry\" are very much worth the purchase. If you're like me and miss 'old New York' (it was only 20 or so years ago but NY is totally different) it's really great to see painted trains, old street scenes and the Roxy. Beat Street has been contrasted to Wild Style many times, especially with the scorn of Beat Street being the Hollywood retread of Wild Style's gritty budgeted reality. This might be the case, but it would seem that Beat Street has a better focus on b-boying (breakdance) whereas Wild Style's actual graffiti by famed writers remains the strong point of that film. There's a hokey wholesomeness present in Beat Street that just isn't realistic. Regardless, Beat Street is certainly worth viewing- particularly when it pops up on TV- but be prepared for some stale, hackneyed drama strewn into the great music and killer scenes. \"Beat Street Breakdown--- RUAHHH!!!\"",
         "Cinematically, this film stinks. So does a lot of the acting. But I don't care. If there is a strong representation of what the 80's were like(For a lot of us in the innercity anyways) and what hip-hop, Zulu nation, and break dancing were really like.Great music, great dancing! It almost seems like a documentary of a time now past when hip-hop was a way of life. It's also interesting to see New York looking like ground zero from a nuclear attack. Some viewers may be too young to remember that It was a poor, run down city during the 70's and 80's. This is the best of all the hip-hop/break dancing movies that came out around that period. Of course the 80's are considered a joke now with all the bad tv shows and movies, but those of us who lived through it will always remember it fondly for a time when music, dancing, and graffiti were fresh, yo!",
         "Of all the breakdancing / hip-hop films released between 1983 and 1986, the 1984 film Beat Street is unquestionably the best one. The story follows a DJ, his younger breakdancing brother, a graffiti artist and a wanna-be showbiz promoter through one winter in which they try to break out of the ghetto using their \"street\" talent. The acting isn't always up to par and the characters aren't fully drawn out, but they are more than compensated for by down-to-earth dialogue, a plausible story, fantastic dancing sequences and a timeless hip-hop sound track. It should be noted this film was shot in the birthplace of breakdancing (\"This ain't New York, this is the Bronx!\"), and features appearances by the fathers of breakdancing, dance troupe Rock Steady Crew and rapper Afrika Bambaata. Rock Steady Crew provide the best scene in the film when they dominate a dance battle at the premiere breakdancing club of the early 80's, the Roxy. A must see for hip-hop lovers.",
         "Great time-capsule of the Bronx and 'hood in the 1980s, and the b-bop culture/dress/dance. Kids walking the snowy streets, abandoned buildings (sealed with concrete, then broken into), marked-up subway cars...New York as it was then. It's a well put-together, but not \"slick\", movie, with a good, believable story and characters with some depth. The breakdancing is \"real\" and pretty thrilling. I taught at Roosevelt High in the Bronx at this time, and this movie catches the scene. Interesting to note how upbeat, pleasant it all was, too, vs. today's more sinist",
         "Being that I am a true product of the hip-hop and electronic dance music generation, this is without a doubt one of my favorite movies of all time. Beat Street, although not as \"authentic\" in some respects as Wild Style, is a film that is guaranteed to tug the heart strings of anyone who takes pride in the culture of urban sample/DJ-based music and electro-club culture. Although I will admit that at times the dialogue is somewhat cheesy, you can't help but feel for the characters, and ultimately \"wish you were there\" for the beginnings of hip-hop culture in New York City in the early eighties. The b-boy battle scene at the Roxy nightclub (a real-life, real-time competition between the legendary Rock Steady Crew and the NYC Breakers) is just as essential to a hip-hop fan's archives as any classic album. Watch some of the breakers' moves in slow-motion if possible to truly appreciate the athletic and stylistic expertise of a seasoned B-boy/B-girl. All praises due to the Zulu Nation!!!",
         "This started out to be a movie about the street culture of the Bronx in New York. What it accomplished was to give birth to a new culture and way of life, for American youth. What other movie has done this except Rebel Without A Cause? One of the most important movies of all time. The elements are simple yet fascinating. The story is timeless, young people try to succeed against all odds. Yet the story is always believable and never depressing. The characters are so realistic, a city dweller, would recognize them as neighbors. The story is entertaining, and comes to a satisfying ending. Buy this one for your permanent collection. It is a piece of American history.",
         "A wonderful movie showing the roots of hip-hop in graffiti art and break dancing. The break battle scene is the highlight of the movie. It shows that there was a time when gangs would fight each other with dancing, not guns.",
         "The Harry Belafonte-produced \"Beat Street\" captured a slice of hip-hop back when it was dancing, graffiti, DJing and rapping not just rapping. The story line is hokey but the music performances and dancing are great. Afrika Bambaataa, Kool Herc, Kool Moe Dee and Melle Mel are among the artists that make an appearance. A decent way to check out hip-hop before NWA spoiled it all.",
         "When released in 1984, Beat Street was one of the best hip hop themed films released at the time. The movie gets a 10 just for combining all of the elements of hip hop which are the mc,dj, graff and b-boy. The soundtrack is one of the best I've ever heard.",
         "I guess when \"Beat Street\" made a national appearance, \"Flashdance\" came at the same time. The problem with \"Flashdance\" is that there was only one break dancing scene and the rest was jazz dance and ballet. That was one of the reasons why \"Beat Street\" was better. The only movie that could rival \"Beat Street\" seems to be \"Footloose\", because both movies focused on how dance had been used by people to express their utmost feelings. The break-dance scenes in \"Beat Street\" come just before the middle and at the end of the flick. And I loved all of them. Almost all of the break tricks were featured in the break jam scenes: the jackhammer, the flares, the head spins, the suicide sit, the crazy legs, the mortal, the forward flip, the figure four---almost everything. Like \"The Warriors\", \"Beat Street\" does have violence related to the gang life in the hip hop world...but in a much less violent way than the former. The only major fight scene in \"Beat Street\" was when graffiti artist Ramon (which in the movie was abbreviated as \"Ramo\") is chased by a rival gang member on the New York City subway tracks.....fighting each other on the third rail and both dying by electrocution on that rail. Well, although that chase scene ended tragically, it was better that they died that way than having blood exploding from a gang gunshot. Most of the gang stuff in the flick was graffiti related to the hip-hop culture, and rap music. A lot of rap music appeared in the flick, because hip-hop members used rap music as a diversion to the negative aspects of gang life. Even the theme song of the movie, which closed the curtain to the flick, was not just an homage to hip-hop culture--it also was an homage to the death of Ramon. By the way, during the dance scene called 'Tango, Tango', I guess the female drummer in the pit orchestra conducted by actress Rae Dawn Chong was Sheila E. making a cameo appearance."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": ["Orion Pictures"],
      "summaries": [
         "An upbeat, lets-put-on-a-show musical about the wonders of hip-hop music and culture that tells the story of Kenny, a young hip-hop artist living in the rough slums of the Bronx with his younger brother Lee and their mother Cora. Kenny dreams of making it big as a disc jockey and playing in the most swank of Manhattan nightclubs, the Roxy. Into their lives comes Tracy, a composer and assistant choreographer from the City College of New York, who inspires him to try to continue his dream while romance begins to grow between them, despite coming from different neighborhoods and worlds. Meanwhile, Lee is part of a break-dancing crew set on dominating the scene of their street. The rest of their friends include Ramon, a graffiti artist determined to spread his painting to every subway car in the city while dealing with his girlfriend Carmen and Chollie, a fellow disc jockey who becomes Kenny's manager after he lands him a gig at a Bronx club. Many hip-hop groups, electro artists, break dancers, and Latin freestyle singers, who include Us Girls, the Treacherous Three, the System, the Rock Steady Crew, Afrika Bambaataa & Soul Sonic Force and Shango, the Magnificent Force, the New York City Breakers, Grand Master Melle Mel & the Furious Five, Tina B., Johnny B. Bad, and many more, make cameo appearances.",
         "An aspiring DJ, from the South Bronx, and his best friend, a promoter, try to get into show business by exposing people to hip-hop music and culture."
      ],
      "budget": 0
   },
   "movielensId": 6347,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-06-08",
      "dvdReleaseDate": "2003-04-15",
      "directors": ["Stan Lathan"],
      "runtime": 105,
      "movieId": 6347,
      "title": "Beat Street",
      "mpaa": "",
      "actors": [
         "Guy Davis",
         "Jon Chardiet",
         "Rae Dawn Chong",
         "Leon W. Grant",
         "Saundra Santiago",
         "Robert Taylor",
         "Mary Alice",
         "Shawn Elliott",
         "Duane Jones",
         "Doug E. Fresh",
         "Kadeem Hardison"
      ],
      "imdbMovieId": "0086946",
      "originalTitle": "Beat Street",
      "genres": [
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An aspiring DJ, from the South Bronx, and his best friend, a promoter, try to get into show business by exposing people to hip-hop music and culture.",
      "tmdbMovieId": 17667,
      "avgRating": 3.02299,
      "releaseYear": "1984",
      "numRatings": 87,
      "posterPath": "/g3z0GJhLjBwCkPXJ0XARcP6dEBq.jpg"
   }
}