{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "martian",
            "id": 10539
         },
         {
            "name": "the flaming lips",
            "id": 205621
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt0363240",
      "video": false,
      "title": "Christmas on Mars",
      "recommendations": [],
      "backdrop_path": "/aHOgYg94pgZ4RSuuJPzYazsjaTd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Major Syrtis",
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062aaf",
               "name": "Steven Drozd",
               "profile_path": null,
               "id": 76351,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "The Martian",
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062ab3",
               "name": "Wayne Coyne",
               "profile_path": "/l4LbiTKKnbWPdWuDnJ3UiQXrlML.jpg",
               "id": 76347,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Major Lowell",
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062ab7",
               "name": "Steve Burns",
               "profile_path": null,
               "id": 40552,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Philosophical and Hymn-Singing Astronaut",
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062abb",
               "name": "Fred Armisen",
               "profile_path": "/d4RwMcYqEGsetnYsfWUZyG1ix3P.jpg",
               "id": 61110,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Psychiatrist",
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062abf",
               "name": "Scott Booker",
               "profile_path": null,
               "id": 76352,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mars Psychiatrist",
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062ac3",
               "name": "Adam Goldberg",
               "profile_path": "/utlFTzTDP5VDQYXmzdHBbfloYhb.jpg",
               "id": 6163,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Sunglasses-wearing Astronaut",
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062ac7",
               "name": "Michael Ivins",
               "profile_path": null,
               "id": 76353,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mother",
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062acb",
               "name": "Michelle Martin-Coyne",
               "profile_path": null,
               "id": 76354,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Faithless Astronaut",
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062acf",
               "name": "Jimmy Pike",
               "profile_path": null,
               "id": 76355,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Astronaut Confronting Cosmic Reality",
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062ad3",
               "name": "Kliph Scurlock",
               "profile_path": null,
               "id": 76356,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062a9f",
               "name": "Wayne Coyne",
               "profile_path": "/l4LbiTKKnbWPdWuDnJ3UiQXrlML.jpg",
               "id": 76347,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45cb9251416c75062aa5",
               "name": "Bradley Beesley",
               "profile_path": null,
               "id": 76349,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45cb9251416c75062aab",
               "name": "George Salisbury",
               "profile_path": null,
               "id": 76350,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.697228,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14089,
      "vote_count": 3,
      "budget": 0,
      "overview": "The film tells the story of the experiences of Major Syrtis during the first Christmas on a newly-colonized Mars. Coyne has described the film as \"Maybe Eraserhead or Dead Man crossed with some kind of fantasy and space aspects, like The Wizard of Oz and maybe A Space Odyssey, and set at Christmas-time. The story that unfolds is intended to hint at childlike magic within a tragic and realistic situation.\"",
      "similar": [
         9479,
         1585,
         10147,
         872,
         11395,
         10437,
         17979,
         13673,
         1581,
         364,
         634,
         8871,
         772,
         5255,
         10719,
         11881,
         296100,
         9714,
         15121,
         10020
      ],
      "original_title": "Christmas on Mars",
      "runtime": 82,
      "poster_path": "/pamQ0qEysbaHI14MmlZbH0HtkNH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2008-11-11",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Wayne Coyne",
         "Bradley Beesley"
      ],
      "runtime": 83,
      "synopsis": "Psychedelic rock band the Flaming Lips present Christmas on Mars: A Fantastical Film Freakout Featuring the Flaming Lips, a glorious science fiction film that marks the directorial debut of the Lips' visionary frontman Wayne Coyne. Seven years in the making, Christmas on Mars features original music by the Flaming Lips (\"The greatest US band today\" - The Guardian), with acting performances by all band members, and many others from their Oklahoma City-based team. Comedian Fred Armisen (Saturday Night Live) and actor Adam Goldberg (Dazed and Confused, Two Days in Paris) also appear. It's Christmastime, and the colonization of Mars is underway. However, when an oxygen generator and a gravity control pod malfunction, Major Syrtis (the Lips' Steven Drozd) and his team (including the Lips' Michael Ivins) fear the worst. Syrtis also hallucinates about the birth of a baby, and many other strange things. Meanwhile, a compassionate alien superbeing (Coyne) arrives, inspiring and helping the isolated astronauts.",
      "writers": ["Wayne Coyne"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0363240/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNjQ3MzE3MV5BMl5BanBnXkFtZTcwMDY2MDg4MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steven Drozd, Wayne Coyne, Steve Burns | See full cast and crew »"],
      "reviews": [
         "Okay. To try & sum this trippy little film up in (at least)one sentence: Take a jigger of Andre Tarkovsky's original Russian version of 'Solaris',mix in a dash of David Lynch's 'Eraserhead',fold in a pinch of '2001:A Space Oddyssey',add elements of John Carpenter's 'Dark Star',and just a tiny bit of 'Tetsuo:The Iron Man',shake well,pour into your cerebral cortex (with plenty of LSD),and Shazam, you have 'Christmas On Mars'. This is the absolute midnight cult film (if any cinemas had half a brain to screen midnight films,these days). This is the first feature film from the Oklahoma based rock band, the Flaming Lips. Wayne Coyne,who co writes the screenplay & co directs the film, also has a role as a space alien who never so much as speaks a word, but you somehow know exactly what he/it means. The film also features acting (?) performances by fellow Lips member,Steven Drozd as a freaked out astronaut,as well as other members of the band (and also Isaac Brock from Modest Mouse)in other roles. This film was shot over something like seven years, on a shoestring budget. Although there is no concert appearances by the band,the music & sound design was performed by the Flaming Lips (mostly a lot of deep space ambient sound). I especially admired the films visual look (which was filmed mostly in high contrast black & white with psychedelic colour bursts from time to time). This is the kind of film that will be a treat for some viewers (mostly Flaming Lips fans,who the band eternally thank at the film's conclusion), and a crashing bore to others (those who have no tolerance for something really different). The choice is yours. No MPAA rating here, but would easily snag an \"R\", due to course language, and some really surreal pseudo/quasi pornographic hallucination sequences. Leave the little one's home (who would probably be bored and/or confused out of their skulls,anyway).",
         "I just saw this film this afternoon at the KGB Theatre in NYC. It was pretty much what I expected, a little weirder maybe, but a rather great feat. This is highly recommended to fans of the Flaming Lips, to lovers of avant-garde or experimental film, to fans of sci-fi film (both campy and non-campy), and, uh, to college students. Yes, I think college students will love this movie. First, the cons: Some of the acting is weak and the plot was a bit hard to follow, of what little there seemed to be. The pros: The special effects were no less than AMAZING for a movie of such a low budget. The Flaming Lips' score for the movie was equally astonishing, perhaps one of the most effective sci-fi soundtracks I've ever heard. There were enough jokes and visual surprises throughout that the film never became dull, cheesy, or cliché. The use of black and white and color in this film was fantastic--the use of overexposed light was fantastic as well. ---***SPOILER ALERT***--- So here's how the first Christmas on Mars goes down: Major Cirtis is living on Mars with a bunch of other astronauts at a space station. He begins having a series of hallucinations at Christmas time, when a baby in a plastic womb is due to be born as the first human baby born on Mars. Major Cirtis had chosen some old man to play Santa for the celebration of the baby being born (I think), but the old man gets cabin fever and runs outside the space station with no suit on and kills himself. Just as he runs out the door, a Martian has arrived at the space station. He is brought inside, says nothing, then is charged with the task of being the replacement Santa. There is a rather disconnected close call with death for the crew of the ship, but they are ultimately saved while Fred Armisen and Major Cirtis sing 'Silent Night' together. The baby is born healthy, and the captain confides that the Martian turned out to be a pretty good Santa Claus after all.---***END SPOILERS***--- OK, so the plot of the film doesn't make a whole lot of sense, but it doesn't need to, and it doesn't dwell on it, either, so it's really only secondary to the experience. First and foremost are the amazing visuals, perfectly complemented by the music. At times a throwback to old '40s sci-fi and at times more brash than any sci-fi flick that has come before it, the film is stunning to look at. But, if you're expecting to learn something from this, or to take away a great life lesson, or wanting some incredibly intricate storytelling, then you're looking in the wrong place. This is more of a pop-up picture book than a novel. It's kind of a cross between the Monkees' movie \"Head\" but with an aesthetic and setting similar to the '70s cult classic \"Dark Star\". Fans of a film like \"Fear and Loathing In Las Vegas\" or \"Waking Life\" won't have any trouble appreciating \"Christmas On Mars\". All in all, a wildly entertaining film. Not for everyone, for sure, but anybody who likes films that *look* different than most other films will surely enjoy this. A silly, satisfying, theatrical work of art, enthusiastic to the end, and easy to get caught up in. Go see it. You won't regret it.",
         "Christmas on Mars, the debut feature of Wayne Coyne and my beloved Flaming Lips, is just as psychotic, obtuse, and delightfully up its own ass as anyone familiar with the band might expect. The film is centered around a small human colony on Mars, its patrons just barely coping with existential despair in the face of vacuous space as Christmas approaches--of course. The medium offers mixed returns for the Lips: besides its obvious psychedelic opportunities, film allows Coyne and company to occasionally subvert cultural iconography and to deliver an endless barrage of vaginal imagery; the former visual tactic being arguably more artful. Film also means dialog, however, which isn't Coyne's strong suit: where his music often packs big ideas into few words, his sprawling drugisms have trouble supporting a narrative diegesis. If there's one thing that's truly excellent about the film, it's the trippy, operatic music--one wishes the Lips were approached for film scores more often. It is also buoyed by a few fun performances: guitarist Steven Drozd is charismatically subdued, and Mark DeGraffenried adds an essential sense of humor as the foul-mouthed Captain Icaria. I can't say how well this film will play to those uninitiated in the Flaming Lips' discography, but for those of us who are fans, there's a certain pleasure of recognition in seeing Wayne Coyne in green antennae inexplicably dropping out of space to don a Santa suit: it's completely unexpected, and that's just what we expect. -TK 9/21/10",
         "Believe me, I like horror movies. I like science fiction movies. I like independent films. And, I like low-budget, B movies. Sometimes, I even like bad acting, plodding scripts, wooden lines, improbably situations, and the like. However, I did not like Christmas on Mars. It just doesn't work on so many levels. For all the reasons listed previously, and many more. That includes the nonsensical, blatant use of images of female genitalia. And the many allusions to male genitalia, in a very Freudian way. I am convinced this is purely from ineptitude. As opposed to some attempt at doing something really different. I mean any movie that takes years to film, just cannot keep up the level of congruity and focus demanded by modern audiences. I had hoped that the whole movie was just a dream or hallucination by the main character. However, sadly, it was meant to have happened, as we saw things unfold on screen. About the only kindness that I can express, is that the image at the end was stupendous. If this had been used at the beginning, instead of the end, it could have allowed the film to take off where 2001 ended... To bad they didn't try that instead. I just don't understand what was so important about this film that it even had to be made. Was it the plot? Surely, it couldn't be. Was it the characters? I doubt it; I mean, I could live without knowing about Ed 15. Was it the dialog? Emphatically, no. The music? Perhaps, but more-likely the unvarnished ego of the principals needing to be stroked. Much better efforts have died on the cutting room floor.",
         "I give this a five because I didn't feel the urge to just yank the disk out of the player-- although I did fast forward through a good portion of it. However I did watch it through to the end. . .and scratched my head when it was done. For most of you ordinary folks who might feel moved to try this video offering. It's set on Mars. That's just about ALL the Science Fiction that will make direct sense to you. The rest of the plot is rather spare and spotty. The colony is falling apart. It's Christmas Eve. A Baby is being born in some weird machine. An enigmatic Alien shows up. The Guy who's supposed to play Santa for the Base commits suicide. And a Station Manager is walking about and we hear his maundering thoughts as he listens to all the complaints, protests and hopelessness from the fellow colonists. Beyond that, the special effects are more in line with the old visual/photographic effects of the old Beatles cartoon movies--but done pretty well. The set of the Mars base/station is actually pretty cohesive and believable. . .but it's the story that requires your willful mental compliance (or is it Complacency?), not the sets or the visual effects. It's saying something about Hope and Birth and Christmas, I think-- but you'll still be scratching your head when it ends. This weird offering is best enjoyed with a group with lots of food and alcohol and conversation. The Alcohol should be liberally distributed and imbibed BEFORE the movie is started. Many of you have seen or been to parties where a big flatscreen was playing some weird video while everyone is talking and having a good time and listening to music. And every once in a while, they look at the big screen on the wall and go: Huh? That's exactly what this movie is like.",
         "The film is an absolute snoozer. Comparing this to Eraserhead, Solaris, etc. is like comparing Christmas to Kwanza-one is the established real deal and the other is a pale, pale wannabe.Yes, they both occur in December but that is where the similarities end. The only thing I can recommend about this film is the soundtrack and the incredible 5.1 surround mix. Kudos to whomever was involved in mixing. Both the music and the spoken audio are taken to new places by this mix. That would be it for anything positive I would have to say. Low low budget coupled with non-actors, no script, and the realization that nobody gives a tinker's damn about any of the characters, let alone what is happening to them weighs this turkey down. 83 minutes shot to hell.",
         "There are some outstanding films that could be called fairy tales for adults, including: \"Crouching Tiger, Hidden Dragon,\" \"Wings of Desire,\" \"Eraserhead,\" \"Pan's Labyrinth,\" \"The Night of the Hunter,\" \"Donnie Darko,\" -- and also The Flaming Lips' 2008 film \"Christmas on Mars.\" All of these films are dreamlike, filled with a childlike sense of awe and also a mature adult understanding of the brokenness & sorrow in the human condition. It's as if the adult filmmakers of these movies still retained the joy & wonder they knew from childhood, but they also developed a melancholy sense as adults of how tragic & challenging life can be. \"Christmas on Mars\" is filled with a sense of grandeur & beauty, but also of the dread & drudgery that human existence can include. During the film's story, which is set in the future, Mars has a space station but the space program has gone into decline and the people there are stranded. They're doing work on the spaceships that they used to get there. The space station has become shabby & disheveled in appearance. The scientists appear to be confident, but a heavy sense of pessimism pervades the mood. But, it's Christmas, and into this scene of defeat & peril enters a celestial being, played by singer/songwriter Wayne Coyne, who brings hope. \"Christmas on Mars\" has a refreshingly deadpan sense of humor, and a uniquely striking visual style, along with a thrilling symphonic rock soundtrack from The Flaming Lips reminiscent of their fantastic albums \"The Soft Bulletin\" (1999) and \"Yoshimi Battles the Pink Robots\" (2002). \"Christmas on Mars\" is a cinematic treat, made especially powerful through the effective demonstration of how blissfully valuable hope can be in a psychologically bleak & cold environment.",
         "The movie Christmas on Mars was a strange creative project from the group The Flaming Lips,whose music I quite enjoy; so I had a lot of curiosity how they were going to adapt their style to a film.The result is that,while I found this film moderately interesting,I also found it to be pretty disappointing.Christmas on Mars tries too hard to be a \"cult film\"...which is the main mistake from all the movies which try to be cult.I think that condition only comes when the film authentically deserves it (like,for example Donnie Darko or The Adventures of Buckaroo Banzai Across the 8th Dimension).On the contrary,making a movie intentionally bizarre or eccentric reveals some dishonesty which plays against the movie,as we can see on Christmas on Mars.If I had to make a short summary of this movie,I would say it is a combination of Eraserhead,The American Astronaut,Santa Claus Conquers the Martians,Forbidden Zone,Dark Star and 2001.On my case,that combination resulted to be moderately interesting but not very satisfactory after all.I can give a slight recommendation to this film because it has some good elements (specially,its very creative visual aesthetic),but I certainly expected more from Christmas on Mars.",
         "This is exactly the sort of movie you'd expect the Flaming Lips to make. Trippy, bizarre, overindulgent, ridiculous, but all the while very enjoyable to watch if you're a fan of experimental movies. The film tells a barely understandable (at first) story about a group of depressed, disillusioned colonists on Mars who rediscover their humanity with the help of a silent martian and a sort of \"virgin birth.\" The movie is a kind of a roller-coaster ride--at some points, it's very interesting, artistic, and beautiful to watch. The opening scene is fascinatingly bizarre, and there are a number of interesting (but horrifying!) hallucinations involving various awful things happening to babies. There's also a fair amount of the sort of ponderous, philosophical dialog you'd expect in a Flaming Lips movie. BUT there are also some problems with the movie--sometimes it seems too abstract, to the point where you have no idea what's going on. At other points, dreary, repetitive, awkwardly written and poorly acted dialog scenes nearly drag the movie to a standstill. I still recommend it though, because it's an interesting artistic experience, a bizarre treat for fans of the band, and because it does seem to have some sort of ultimate message about humanity.",
         "i'm not talking about the movie... i'm talking about the other two commentors... i come here because i'm trying to get some sort of handle by which to navigate the corridors to the films that i might enjoy...stop me if this sounds familiar... and then i get to this place where people involved with the film aren't bright enough to at LEAST vary their blurb... their 'free advertising'/hype, as it were... am i the only one that thinks that the same references, referred to in slightly varied wordings, is more than a coincidence? or maybe these two had a latte after their film festival viewing and we're privy to their all too similar insights? what are the chances? can't we, the people who are tired of these cheeseballs, do some sort of aesthetic cleansing?"
      ],
      "genres": [
         "Music",
         "Sci-Fi"
      ],
      "productionCompanies": [],
      "summaries": ["Major Syrtis goes insane as he tries to improve morale in an abandoned colony on Mars through a Christmas pageant, where the first colonist baby will be born."],
      "budget": 0
   },
   "movielensId": 63617,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-11-11",
      "dvdReleaseDate": "2008-11-11",
      "directors": [
         "Wayne Coyne",
         "Bradley Beesley",
         "George Salisbury"
      ],
      "runtime": 82,
      "movieId": 63617,
      "title": "Christmas on Mars",
      "mpaa": "",
      "actors": [
         "Steven Drozd",
         "Wayne Coyne",
         "Steve Burns",
         "Fred Armisen",
         "Scott Booker",
         "Adam Goldberg",
         "Michael Ivins",
         "Michelle Martin-Coyne",
         "Jimmy Pike",
         "Kliph Scurlock"
      ],
      "imdbMovieId": "0363240",
      "originalTitle": "Christmas on Mars",
      "genres": [
         "Music",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The film tells the story of the experiences of Major Syrtis during the first Christmas on a newly-colonized Mars. Coyne has described the film as \"Maybe Eraserhead or Dead Man crossed with some kind of fantasy and space aspects, like The Wizard of Oz and maybe A Space Odyssey, and set at Christmas-time. The story that unfolds is intended to hint at childlike magic within a tragic and realistic situation.\"",
      "tmdbMovieId": 14089,
      "avgRating": 2.76471,
      "releaseYear": "2008",
      "numRatings": 17,
      "posterPath": "/pamQ0qEysbaHI14MmlZbH0HtkNH.jpg"
   }
}