{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "miracle",
            "id": 2618
         },
         {
            "name": "religion",
            "id": 11001
         },
         {
            "name": "swashbuckler",
            "id": 157186
         },
         {
            "name": "gaucho",
            "id": 207699
         }
      ],
      "imdb_id": "tt0017918",
      "video": false,
      "title": "The Gaucho",
      "recommendations": [],
      "backdrop_path": "/uaXVfyEOYLsRaZyPfiXZbqrJyiU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Gaucho",
               "gender": 0,
               "credit_id": "52fe4acdc3a368484e167dc1",
               "name": "Douglas Fairbanks",
               "profile_path": "/l8DQc2xfFwXt5Wylj2AseWmqrMt.jpg",
               "id": 109088,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "The Mountain Girl",
               "gender": 1,
               "credit_id": "543fce16c3a36840fd000039",
               "name": "Lupe Vélez",
               "profile_path": "/3c130uo7PaH7QzAv5busdx3YFD1.jpg",
               "id": 89933,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "The Girl of the Shrine",
               "gender": 1,
               "credit_id": "543fce24c3a368410d000019",
               "name": "Eve Southern",
               "profile_path": "/4zUbXYc1wcsQAlF9yvEe7kZU1RI.jpg",
               "id": 1050223,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ruiz - The Usurper",
               "gender": 2,
               "credit_id": "543fce31c3a36840fd00003c",
               "name": "Gustav von Seyffertitz",
               "profile_path": "/v1mnrEVtPdSqTpOBHjLPmb2FElm.jpg",
               "id": 13345,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "The Usurper's First Lieutenant",
               "gender": 0,
               "credit_id": "543fce3dc3a368410d00001e",
               "name": "Michael Vavitch",
               "profile_path": null,
               "id": 1173024,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "The Padre (as Nigel de Brulier)",
               "gender": 2,
               "credit_id": "59453a73c3a368170f01199d",
               "name": "Nigel De Brulier",
               "profile_path": "/dSat7OeGS4bTrpwLZFnchCsc8vO.jpg",
               "id": 34047,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "The Virgin Mary",
               "gender": 1,
               "credit_id": "5a1dbacbc3a3680b9306cc0e",
               "name": "Mary Pickford",
               "profile_path": "/1kG12uiv0VPNaPCjbkLkRLTqmIW.jpg",
               "id": 100047,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4acdc3a368484e167dc7",
               "name": "F. Richard Jones",
               "profile_path": null,
               "id": 150176,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "543fce02c3a3684104000024",
               "name": "Douglas Fairbanks",
               "profile_path": "/l8DQc2xfFwXt5Wylj2AseWmqrMt.jpg",
               "id": 109088,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 0.354472,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 125749,
      "vote_count": 1,
      "budget": 0,
      "overview": "A girl is saved by a miracle after she falls from a cliff in the Argentine Andes, and is blessed with healing powers. A shrine is built on the site, and a whole city grows around it, rich with gold from the grateful worshipers. Ruiz, an evil and sadistic general, captures the city, confiscates the gold, and closes the shrine. But the Gaucho, the charismatic leader of a band of outlaws, comes to the rescue.",
      "similar": [
         9946,
         583,
         9693,
         10307,
         1813,
         5876,
         310,
         615,
         324786,
         6844,
         9411,
         1865,
         9509,
         22,
         87827,
         121856,
         20504,
         147441,
         9313,
         604
      ],
      "original_title": "The Gaucho",
      "runtime": 95,
      "poster_path": "/xwRWCRnRei1gK3eIJq39Xgrzw8h.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Elton Corporation",
            "id": 35431,
            "origin_country": ""
         }
      ],
      "release_date": "1927-11-21",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "INTENSELY DRAMATIC STUPENDOUS THRILLS",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["F. Richard Jones"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Douglas Fairbanks"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0017918/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAzOTM0MTc5MTdeQTJeQWpwZ15BbWU4MDkyNDQwMDIx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lupe Velez, Joan Barclay, Eve Southern | See full cast and crew »"],
      "reviews": [
         "Douglas Fairbanks wrote, produced and starred in this unusual and entertaining movie at the height of his career, and the guy sure was in his prime: you'll never find him looking as virile, athletic and sexy as he does here. Sight unseen I assumed that The Gaucho would be another escapist swashbuckler flick, cut from the same cloth as Doug's earlier vehicles and aimed primarily at boys, but it proved to be a real surprise, a combination action/adventure/morality tale with a heavier atmosphere and a darker sensibility than any other Fairbanks film. Whether or not its oddness comes as a pleasant surprise is up to the individual viewer, but for my part I enjoyed the change of pace and appreciated the filmmakers' boldness in attempting something so off-the-wall. How is The Gaucho different? For starters, Doug himself is different. Based on what little I knew beforehand I figured the title character would be an essentially decent bandit chieftain, a pseudo-Hispanic Robin Hood complete with a new band of Merry Hombres, once more pitted against the wicked forces of authoritarian rule. And in fact that's pretty much what he is, but he's also a flawed character who must mature in the course of the story, thus presenting a challenge for our leading man, who, as even his most dedicated fans admit, was never the most nuanced of actors. Here Doug is still very much the star of the show, but he's playing a decidedly selfish man who doesn't seem all that interested in avenging injustice or fighting for the peasantry. The Gaucho is no Robin Hood: he's cocky and arrogant, and in the early scenes his self-confident machismo is emphasized to the point of obnoxiousness. Like many a silent movie hero the Gaucho has a trademark physical gesture, a one-handed cigarette lighting trick, but once he's exhibited this bit two or three times we begin to roll our eyes and feel he's just begging to be taken down a peg or two. It's also noticeable that, all of a sudden, Doug is attempting to fill the dance shoes of the recently departed Rudolph Valentino. When he played Robin Hood or the Black Pirate Doug's attitude toward his leading lady was more respectful than passionate, but the Gaucho represents the most maturely sexual character Fairbanks would take on in his screen career. Doug's tango with Lupe Velez is as steamy as any sequence he ever played, even incorporating a hint of S&M when he lashes his partner to himself with a sharp twirl of his bolo. These early scenes suggest that our protagonist -- who has apparently already won the day, and has everything he needs to be happy -- must be riding for a fall. This is where the story's moralizing kicks in, as the Gaucho is compelled to recognize that there are forces at work in the universe even greater than himself. A pronounced element of religious mysticism is introduced in the prologue, when a gravely injured girl on the brink of death is visited by an apparition of the Virgin Mary. The girl is healed, whereupon she herself heals a dying baby. (The Virgin is played by Fairbanks' wife Mary Pickford, with a gravity that is unfortunately somewhat undercut by her bizarre, spinning halo.) This dollop of Hollywood Godliness, usually the province of Cecil B. DeMille, is interwoven throughout, and some viewers may find the going a bit sticky. Personally I didn't have a problem with it, perhaps in part because the 'religious' sequences are presented with such straightforward earnestness; and perhaps because, if ever a hero needed to find God, it's this one. Where matters of taste are concerned one might also question the introduction of the subject of leprosy into the scenario. The condition is identified only as the 'Black Doom,' but from the context it's perfectly clear what disease was being represented. Whatever your response, Fairbanks deserves credit for sheer moxie, and for attempting to stretch the boundaries of what was considered permissible in an adventure film. He could have played it safe and re-worked Robin Hood, or cranked out another Zorro sequel, but he took a risk, and all things considered I feel he pulled it off. And it's worth noting that the story's heavier material is counterbalanced by more typical scenes of rowdy play and athleticism. Fairbanks the canny showman also gives us two spectacular sequences: in the first, a house is dragged from its foundations by a team of horses, and later there's an amazing cattle stampede that looks quite fearsome and dangerous. The Gaucho also gives us the young and wildly sexy Lupe Velez, who takes a far more active role in the proceedings than most of Doug's other leading ladies. All told it's a helluva show, and well worth seeking out. It may not be for all tastes, but no one can call The Gaucho a routine swashbuckler. I would include it with Douglas Fairbanks' most entertaining and accomplished works.",
         "He is feared by men and adored by women - but only one woman will tame him. He acknowledges no creed, but only One Faith will claim him. No jail shall hold him or treasure elude him. He is South America's greatest bandit and soon the fate of the Andes' most venerated shrine will be in his hands. He is THE GAUCHO. Douglas Fairbanks was at the pinnacle of his fame when he made this wonderful adventure film. His buoyant on-screen charm is matched only by his superb & graceful athleticism. He is secure in his position as one of the very greatest of cinema legends. Lupe Velez makes a fiery & beautiful love interest as the Mountain Girl, flirting or fighting with Fairbanks at every twist of the plot; Nigel De Brulier as The Padre & Eve Southern as the Girl of The Shrine are saintly in their supporting roles. That's Mary Pickford in a cameo as the Virgin Mary. And once seen, who can ever forget The Victim of the Black Doom? The sets and the special effects shots - using glass mattes - are exceptional. The very long City of the Miracles set is one of the finest ever created for a silent film.",
         "Unusual but beautifully made and typically enjoyable Douglas Fairbanks vehicle, which finds the star at his most roguish (while still being his dashing and athletic self); with the Argentine pampas for backdrop, the film \u0096 whose full official title is DOUGLAS FAIRBANKS AS THE GAUCHO \u0096 can be considered a semi-Western. The narrative encompasses romance (supplied by fiery Lupe Velez), religion (via the presence of a miraculous shrine overseen by a saintly shepherdess \u0096 we even get a couple of visions of the Madonna herself, played by Fairbanks' own equally popular actress wife, Mary Pickford!) as well as more characteristic action (in the form of The Gaucho's opposition to the rule of tyrannical Gustav von Seyffertitz). A subplot which ties in with the element of faith sees the hero being deliberately contaminated by a carrier of \"The Black Doom\" whom he had previously slighted, though both are eventually cured. Fairbanks' trademark pioneering spirit in the technical department is also well in evidence here \u0096 with matte paintings giving the illusion of a truly elaborate visual design, reversed film for one particularly showy leap by the star onto his faithful steed, and even the wholesale horse-driven transportation of a house at one point!",
         "Combining the familiar Douglas Fairbanks action scenes with some unexpected material, \"The Gaucho\" is interesting and pretty good. It might be just a cut below Fairbanks's very best movies, but it has more than enough to satisfy most silent movie fans. The story is involved, and it features some creative turns, while the production is resourceful and quite good for the most part. Fairbanks's character here is not quite the same as in his usual roles. While the story does give him plenty of action and adventure sequences, his character is not nearly as likable as most of the ones that he played. The way that \"The Gaucho\" treats the other characters is not at all what you would have expected from his other movies - normally, even when his character is an outlaw in the eyes of the authorities, you get the feeling that you'd have nothing to fear from him unless you deserved it. Not so here. That does make the character interesting. As with Fairbanks's usual roles, he seeks justice and respect, but unlike most of the others, he also needs redemption in a much deeper sense. And that fits in well with the other unusual aspect of the movie, which is established at the very beginning with the founding of the miraculous shrine. It introduces a supernatural or quasi-religious dimension that is not at all part of movies like \"The Black Pirate\" or \"The Three Musketeers\". Yet, for all that it requires a suspension of disbelief, it works pretty well as part of the overall story. The detailed and sometimes impressive settings, along with the supporting cast, also help out. Lupe Velez has plenty of energy, Gustav von Seyffertitz is a suitable villain, and it's enjoyable to see Mary Pickford's brief appearance. Overall, it's pretty good, despite varying in some respects from time-tested formulas.",
         "Many things have been written about \"The Gaucho\", lots of interpretations have been made from the very day it was released, and in the almost 90 years that have passed since then, it has of course been highly praised, but it's also been subject to unjust criticism in many ways; and in recent years the public's and the critics' interest in this so very UNIQUE movie seems to slowly fade away... So I think it's high time for us to rediscover this radiant jewel of early Hollywood, and to look at it in all its unusual spirit, with the innocence and enthusiasm the audience saw it back THEN; and at the same time discover that it's lost NOTHING of its freshness and dynamism - for it's one of those films that NEVER age. And from the very beginning of the movie we have to take into account that we're about to dive right into the world of Douglas Fairbanks, that great genius and pioneer of silent film days, whose huge all-round talent as actor, director, screenwriter and producer was equaled only by that of his best friend, Charlie Chaplin. And just like Chaplin, Doug Fairbanks had his VERY own ideas of motion pictures: they should be larger-than-life, include ALL aspects of reality, and merge them into something even more beautiful, filled with more action, drama, and at the SAME time love and fun than real life itself; and, of course, with an unbreakable optimism that leads to the literally most miraculous happy endings for everyone - not only for the 'good' ones, because there ARE no 'good' and 'bad' characters in \"The Gaucho\": just as in real life, everybody have got their flaws (even the protagonist himself), and everybody have got their good points. And so, be prepared for a UNIQUE mixture of drama, comedy, love story, and action adventure, that changes moods so quickly that you've got to adapt to Doug Fairbanks' own moody, restless personality in order to follow and understand, and most of all enjoy the movie. It seems to start out as one of those religious films about Madonnas and miracles that were so popular at the time, with a girl being miraculously saved after falling from a cliff by the Virgin Mary (played by Fairbanks' wife Mary Pickford!), and the place of the miracle soon becoming a place of pilgrimage. BUT - a few moments later, we find ourselves in a COMPLETELY different scenery: the world of the Gauchos, the outlaws of the Argentinian pampas, with their daring, carefree, exuberant lifestyle; the very example being of course their leader, Doug Fairbanks himself, simply named 'The Gaucho'. Everybody admires him, having the courage, the personality and the charm of a real leader; and naturally most of all the girls - like the cheeky young 'Mountain Girl' (Lupe Velez), with whom he soon starts a REAL whirlwind romance: he literally ties her to his body with his 'bolas' (the Gauchos' weapon, not unlike a lasso, but much more effective) to dance a HOT tango with her; they kiss and make up all the time, they quarrel, tease each other, and are crazy for each other - undoubtedly one of the most beautiful, entertaining, unusual romances that have ever been brought to the screen! Then the action part ensues, with Fairbanks' famous stunts, and he frees the prosperous 'City of the Miracle' from greedy usurper Ruiz, and even becomes friends with the Padre - without sharing his beliefs, however, because the only thing the Gaucho believes in is - the Gaucho. UNTIL that fateful moment when, after his jealous girl attacked the pious 'Girl of the Shrine' with a knife, unintentionally wounding his hand when he held her back - a victim of the 'Black Doom' (meaning leprosy) INTENTIONALLY infects him with the dreadful disease (because, earlier, he had suggested to him, being in this condition, to find a lonely spot and kill himself - that's what HE would do, he said)... Appalled and frightened, he understands what's happened to him - but he IS a man of principles: he says goodbye cheerfully to the 'Girl of the Shrine' and to his own 'Mountain Girl', and, just like he'd said, sets out into the woods with a gun intending to shoot himself. And there, the religious element sets in again; but not in the 'usual style' of some epic by De Mille or Griffith - no, with a strange, wonderful child-like faith: the 'Girl of the Shrine' finds him and tells him that if he believes, he can be saved; she asks him if he DOES believe, and he looks at her, puzzled, and then answers: 'I believe in YOU!' Then he asks her to teach him to pray - and HERE's the lesson: he's not supposed to become some religious fanatic, he's merely required to leave aside for once his over-developed self-confidence and learn to be HUMBLE and BEG for something... And it works: as soon as he places his hand in the healing water, it gets well - and he jumps around JUST like a little boy: 'I'm healed, I'm healed!!' And, after a few more heroic actions from both, he gets his 'Mountain Girl', the 'City of the Miracle' gets its peace and justice - a most CLASSIC Hollywood Happy Ending; but it gives us MUCH more than that to keep within us: because the TRUE message is the Gaucho's line: 'Yesterday was yesterday. Today is today. There's no tomorrow until it's today.' A great, everlasting message for one of the very GREATEST movies ever made.",
         "Of the Douglas Fairbanks films I've seen so far, there is not one that came across as bad. The Gaucho may be my least favourite of them, it does get a tad too heavy-handed at times and the religious stuff sometimes bogs it down and give off an odd feel. But what makes Fairbanks' films as good as they are are most definitely present in The Gaucho. The sets are some of the most exotic and lavish of any Fairbanks film, and the same can be said of the costumes. The photography is equally beautiful, and the music score is appropriately rousing which make the stunts and such even more exciting than they already are. There is a strong sense of humour that is as fresh and current now as it was then, the director handles things deftly and the story cannot be called routine, if anything of all the films Fairbanks did The Gaucho is perhaps his least conventional story-wise. It is also very briskly paced and with a constant sense of fun and energy, as well as memorable scenes like the aftermath of the healing miracle. It's not a Fairbanks film without mentioning the stunts and they are spectacularly choreographed and dazzlingly executed. And with real athleticism that has not been matched much by many films today standards. Fairbanks steals the show, as he should as he is the star, he is charisma personified and clearly looks like he's enjoying every moment. His stunts are athletic and youthful and he does show some expressive acting like in the healing miracle scene and its aftermath. He is very well-supported by the rest of the cast, the standouts being Lupe Velez, who plays with a lot of appealing spunk and is sexy without even trying, and Gustav von Seyffertitz, whose suave charm but very twisted malevolence makes for one of the nastiest villains of any Fairbanks film. All in all, while not one of Douglas Fairbanks' best it is still a treat. 8/10 Bethany Cox",
         "Monday June, 7:00pm The Paramount Theater, Seattle Douglas Fairbanks chose a swarthy Argentine anti-hero for his next-to-last silent role in The Gaucho (1927). A young shepherdess is visited by the Holy Virgin while tending her flock and a mountain shrine is built on the site. Years pass, and The City of the Miracle attracts wealth and attention. When a corrupt general known as Ruiz the Usurper (Gustave von Seyfferitz) takes over the town, they are liberated by The Gaucho. Fairbanks perennial Charles Stevens plays The Gaucho's First Lieutenant and Mary Pickford appears (literally) as The Virgin, in two cameos that are almost certainly what were originally the two-color Technicolor segments now presumed lost.",
         "Technically speaking, this was a good movie. It's obvious United Artists put a lot of money behind this project (and why shouldn't they, as two of the company's creators were the star of this film and his wife!). The sets and costumes were nice, the matte paintings and backgrounds were among the best I've seen in a silent and the stunts were fantastic. However, the overall package was still very weird, as there was an uncomfortably odd combination of various earlier Douglas Fairbanks films along with what looked almost like the Jennifer Jones film \"The Song of Bernadette\"! Odd to say the least. The film begins with a religious prologue about a young shepherdess falling from a cliff but being miraculously healed by what appears to be the Virgin Mary. Soon a religious shrine is built there. Ten years have now passed. It seems that in this South American nation, a corrupt government is now oppressing the people (just like in \"The Mark of Zorro\" and \"Robin Hood\" and \"The Black Pirate\" and several other Fairbanks films). Fairbanks is a bandit (it's not clear if he steal from the rich and gives to the poor...maybe he just steals) and he and his men take over a small town run by government thugs. However, despite the lovely stunt-work and women who adore him, the Gaucho is a bit of a jerk. When, as the new town's leader, he's mean to someone who has some weird disease (that looks NOTHING like any real illness). As a result, this afflicted person sneaks up on him later and deliberately infects him! And, thanks to some prayers and a re-appearance by the Virgin, the Gaucho is healed and life is good. The story is great to look at but heavy-handed and silly. My advice is first see Fairbanks' more famous films--they are better. Then, if you're curious, try this freaky film. It's good but not among his best by any standard. By the way, speaking of weird, get a load of the 'house scene'. If you see the movie, then you'll know what I mean!!",
         "This is typical 20's Fairbanks, when he was making his grand epic swashbucklers, with typical over-complicated plots. The character reminds me of the first Zorro, but this guy is harder, and nastier (even after his miraculous reform). Fairbanks was also in his mid-forties when he made it, which explains his fined-down, but still very buff, appearance. The plot is a mythical Argentina (with a tango thrown in to define the place, but it could take place anywhere, including Zorro's Early California. Fairbanks does wear an exotic costume, though. Lupe Velez' Mountain Girl is the real departure. She is feisty, for one, and swashes every bit of buckle that Fairbanks does. These sort of characters are usually the one who DOESN'T get her man; here, it is with great satisfaction that she does--a woman ahead of her times!",
         "Douglas Fairbanks made many, many good films over the span of his career. This one, while it has its good points, does not belong in the upper echelon of his best films. In this one, he plays an outlaw who for some reason is a good guy in this film (a rather common theme nowadays). He does his usual \"Doug\" things, his athletic tricks and so forth, but what is noteworthy about this film is that he didn't do some of the stunts himself. What really kind of bothered me about this film (and the reason it gets a \"6\") is when he and the local padre decide who gets to go to a healing fountain and who doesn't. A man with a hideous disease that has to keep himself covered is told by Doug to go kill himself! Doug! Nowadays, that probably would not be considered so bad in a movie, but back then, dang! This film is also noteworthy because it was the film debut of the ill-fated actress Lupe Velez. She plays a mountain girl who early in the film falls to what should have been her death by trying to dislodge a lamb who had gotten stuck in some rocks. She sees the Virgin Mary (who I understand was played by Doug's wife at the time, Mary Pickford) and the spot becomes sacred and a healing fountain results. Lupe is very much Lupe, if you've ever seen any of her films, she's very over-the-top pretty much all the way through. In a few years, when she started doing talking pictures and added speech to that, she really came into her own, I think. Anyway, if you just have to see all of Douglas Fairbanks' films, go ahead and see it. If you just want to see a silent film, you can do much better than this one, including several Douglas Fairbanks films."
      ],
      "genres": [
         "Adventure",
         "Romance"
      ],
      "productionCompanies": ["Elton Corporation"],
      "summaries": ["A girl is saved by a miracle after she falls from a cliff in the Argentine Andes, and is blessed with healing powers. A shrine is built on the site, and a whole city grows around it, rich with gold from the grateful worshipers. Ruiz, an evil and sadistic general, captures the city, confiscates the gold, and closes the shrine. But the Gaucho, the charismatic leader of a band of outlaws, comes to the rescue."],
      "budget": 0
   },
   "movielensId": 63688,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1927-11-21",
      "dvdReleaseDate": "2001-10-09",
      "directors": ["F. Richard Jones"],
      "runtime": 95,
      "movieId": 63688,
      "title": "The Gaucho",
      "mpaa": "",
      "actors": [
         "Douglas Fairbanks",
         "Lupe Vélez",
         "Eve Southern",
         "Gustav von Seyffertitz",
         "Michael Vavitch",
         "Nigel De Brulier",
         "Mary Pickford"
      ],
      "imdbMovieId": "0017918",
      "originalTitle": "The Gaucho",
      "genres": ["Action"],
      "youtubeTrailerIds": [],
      "plotSummary": "A girl is saved by a miracle after she falls from a cliff in the Argentine Andes, and is blessed with healing powers. A shrine is built on the site, and a whole city grows around it, rich with gold from the grateful worshipers. Ruiz, an evil and sadistic general, captures the city, confiscates the gold, and closes the shrine. But the Gaucho, the charismatic leader of a band of outlaws, comes to the rescue.",
      "tmdbMovieId": 125749,
      "avgRating": 3.33333,
      "releaseYear": "1927",
      "numRatings": 3,
      "posterPath": "/xwRWCRnRei1gK3eIJq39Xgrzw8h.jpg"
   }
}