{
   "tmdb": {
      "original_language": "tr",
      "keywords": [
         {
            "name": "istanbul",
            "id": 1847
         },
         {
            "name": "hit-and-run",
            "id": 6440
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "cheat on husband",
            "id": 10337
         }
      ],
      "imdb_id": "tt1233381",
      "video": false,
      "title": "Three Monkeys",
      "recommendations": [
         18421,
         110391,
         106224,
         53230,
         41954,
         109815,
         52072,
         27957,
         45884,
         37640,
         213592,
         65534,
         56655,
         101995,
         37573,
         25564,
         1918,
         108241,
         79890,
         12578
      ],
      "backdrop_path": "/v2so9I7GcTPZS73YMiGBG0gfllc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Eyüp",
               "gender": 2,
               "credit_id": "52fe44c6c3a36847f80a9613",
               "name": "Yavuz Bingöl",
               "profile_path": "/czTk1gsbT2Y6JyD1LLIzzkk9zHt.jpg",
               "id": 87221,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Hacer",
               "gender": 1,
               "credit_id": "52fe44c6c3a36847f80a9617",
               "name": "Hatice Aslan",
               "profile_path": "/o41OZDxzhPkRnGrWhXnh86NYTSa.jpg",
               "id": 87222,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ismail",
               "gender": 2,
               "credit_id": "52fe44c6c3a36847f80a961b",
               "name": "Rifat Sungar",
               "profile_path": null,
               "id": 87223,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Servet",
               "gender": 2,
               "credit_id": "52fe44c6c3a36847f80a961f",
               "name": "Ercan Kesal",
               "profile_path": "/zWOX8jIJZ8Kanz6XgbBKgs3dhWF.jpg",
               "id": 87224,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Bayram",
               "gender": 2,
               "credit_id": "52fe44c6c3a36847f80a9623",
               "name": "Cafer Köse",
               "profile_path": null,
               "id": 87225,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "The Child",
               "gender": 0,
               "credit_id": "52fe44c6c3a36847f80a9627",
               "name": "Gürkan Aydin",
               "profile_path": null,
               "id": 87226,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c6c3a36847f80a960f",
               "name": "Nuri Bilge Ceylan",
               "profile_path": "/dtr4lXRqSet3hJ1iafzIPgsiTXy.jpg",
               "id": 56214,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53be5b17c3a3687e59002a0e",
               "name": "Nuri Bilge Ceylan",
               "profile_path": "/dtr4lXRqSet3hJ1iafzIPgsiTXy.jpg",
               "id": 56214,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53be5b2ac3a3684cf9002cf1",
               "name": "Ebru Ceylan",
               "profile_path": null,
               "id": 307141,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53be5b39c3a3684cef002e16",
               "name": "Ercan Kesal",
               "profile_path": "/zWOX8jIJZ8Kanz6XgbBKgs3dhWF.jpg",
               "id": 87224,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "590d16689251414e92005193",
               "name": "Nuri Bilge Ceylan",
               "profile_path": "/dtr4lXRqSet3hJ1iafzIPgsiTXy.jpg",
               "id": 56214,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "590d1671c3a36864ec004c7a",
               "name": "Ayhan Ergürsel",
               "profile_path": null,
               "id": 1162242,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "590d16aec3a36864d4005503",
               "name": "Fabienne Vonier",
               "profile_path": null,
               "id": 990962,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "590d1660c3a36864d40054cb",
               "name": "Gökhan Tiryaki",
               "profile_path": null,
               "id": 456963,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "590d13ad9251414e8d004c98",
               "name": "Zeynep Ozbatur Atakan",
               "profile_path": null,
               "id": 301260,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "590d16789251414edb00521a",
               "name": "Bora Göksingöl",
               "profile_path": null,
               "id": 1600453,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "590d167f9251414e890053a5",
               "name": "Harika Uygur",
               "profile_path": null,
               "id": 5137,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "590d1686c3a36864d40054e8",
               "name": "Ebru Ceylan",
               "profile_path": null,
               "id": 307141,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "590d1696c3a36864a7005044",
               "name": "Nuri Bilge Ceylan",
               "profile_path": "/dtr4lXRqSet3hJ1iafzIPgsiTXy.jpg",
               "id": 56214,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "590d169ec3a368650a004ee9",
               "name": "Valerio De Paolis",
               "profile_path": null,
               "id": 6099,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "590d16a69251414e800051bf",
               "name": "Cemal Noyan",
               "profile_path": null,
               "id": 1811270,
               "department": "Production",
               "job": "Co-Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.144855,
      "production_countries": [
         {
            "iso_3166_1": "TR",
            "name": "Turkey"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 8905,
      "vote_count": 43,
      "budget": 0,
      "overview": "A family battles against the odds to stay together when small lies grow into an extravagant cover-up. In order to avoid hardship and responsibilities that would otherwise be impossible to endure, the family chooses to ignore the truth, not to see, hear or talk about it. But does playing “Three Monkeys” invalidate the truth of its existence?",
      "similar": [
         13,
         112160,
         8967,
         6637,
         2288,
         866,
         788,
         59,
         319,
         185,
         5915,
         28178,
         40807,
         587,
         773,
         858,
         2252,
         14,
         334,
         2675
      ],
      "original_title": "Üç maymun",
      "runtime": 109,
      "poster_path": "/1gfrdOvBWHyG7xn9C6r2REuk4c.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pyramide Productions",
            "id": 186,
            "origin_country": ""
         },
         {
            "logo_path": "/cmxkBc3dmwWaIHFCrkXZoAfGoOa.png",
            "name": "BIM Distribuzione",
            "id": 225,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ministry of Culture and Tourism",
            "id": 27099,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zeynofilm",
            "id": 27100,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "NBC Film",
            "id": 27101,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Conseil de l'Europe",
            "id": 27102,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Imaj Sound Post Production",
            "id": 27103,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Imaj",
            "id": 27104,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "2008-05-16",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.nbcfilm.com/3maymun/3maymun.php?mid=1",
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nuri Bilge Ceylan"],
      "runtime": 109,
      "synopsis": "Ceylan focuses his camera on four characters, a couple and their son plus the husband's boss, showing how the family opts to stick together by playing blind, deaf and dumb to problems that should in all logic split them apart. A family dislocated when small failings blow up into extravagant lies battles against the odds to stay together by covering up the truth... In order to avoid hardship and responsibilities that would otherwise be impossible to endure, the family chooses to ignore the truth, not to see, hear or talk about it. But does playing Three Monkeys invalidate the truth of its existence?",
      "writers": [
         "Ebru Ceylan",
         "Ercan Kesal"
      ],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt1233381/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNjM3MjkyOV5BMl5BanBnXkFtZTcwMzU5MjQ0Mg@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Yavuz Bingol, Hatice Aslan, Ahmet Rifat Sungar | See full cast and crew »"],
      "reviews": [
         "Three Monkeys proved to me that Turkish cinema can rub shoulders with the very best in contemporary cinema. It has a certain maturity and mastery of the medium even if it follows the patterns of Tarkovsky, Terrence Mallick and Zvyagintsev, with its ability to externalize the internal feelings of individuals and catapult those feelings in context with the well-chosen exteriors\u0097sometimes natural environments and sometimes man-made structures. It's a film that makes the capability of a director and art director stand out even to a village idiot viewing cinema. The title of the film does refer to the proverbial three monkeys; one who refuses to hear, one who refuses to see, and one who refuses to speak. It is an interesting contemporary tale revolving around three adults that make up a Turkish urban nuclear family. The husband drives the car of a politician to make a living, the wife works in a kitchen of a large establishment, and their adult son is a student dreaming of owning a car. It is a tale that could take place in Turkey or any other part of the world suggesting that tales of individual angst fall within some external matrix that a viewer can either glimpse or reject as a cosmic play of dice. The three \"monkeys\" are a husband, wife and son living a cohesive, stable life. A fourth character is a typical creepy politician whose actions disrupt the tranquil life of the cohesive trio by a chain of lies, deceit, lust and avarice\u0097all brought about by the ripple effect of an external request. Here is a tale of three essentially good people who become entwined in actions that threaten to break up their happy but mundane middle-class lives. What is the external request that leads to the domino effect on the family? The politician falls asleep while driving a sedan and knocks down an unknown person on a remote road and the incident is noticed by a passing car. To preserve his political chances at the soon-to-be-held elections, he requests his regular driver to take the rap and go to prison for the crime he did not commit, while the politician promises to continue paying his salary and provide a large sum at the completion of his jail term. The first \"monkey\" gets hooked to the suggested plan that he hears. The son dreams of a family car that could be acquired with an advance on the politician's final payment to his father and goads his mother to meet the politician with the request. And you soon have two other \"monkeys\" trapped by their own innocent actions that spiral into grievous crimes because they choose not to see, hear or speak. Interestingly, each of the three is essentially a well-meaning, ethical individual. However, the external request of a politician to the head of the family of the trio opens up vistas for three good persons to choose a deviant path they might not have chosen otherwise. The filmmakers go on to suggest that the pattern could spillover to upset another sedate life of a good man at the end. Those affected do not seem to learn from history. The cosmic tale carries on like a Shakespearean or Tolstoyan tragedy, even as dark clouds gather over the magical landscape on the coasts of the Marmara Sea (Black Sea) captured with the digital magic of Gokhan Tiryaki (the cinematographer of Ceylan's Climates as well). Are we individuals truly in control of what happens to us in life? This is the implicit question the film asks of the viewer. Do events in our life force us take paths we never would have taken otherwise? Do we learn from our mistakes or prefer to make bigger mistakes like a \"monkey\"? Ironically, the film itself is a product of another family\u0097but this one is incredibly talented. The husband and wife team of Nuri Bilge Ceylan (director, editor, and writer of Three Monkeys, and actor of his earlier films Distant and Climates) and Ebru Ceylan (writer and art director of Three Monkeys, actor of Distant and Climates and an award-winning short-filmmaker) team up with Ercan Kesal (actor in Three Monkeys, playing the politician in the movie) to write up this interesting film. The story is only a small part of the film's broad enjoyment spectrum. Take the art direction\u0097-the building in which the trio live looks imposing at the start of the movie. Only towards the end of the movie as the lives of the individuals fall apart you see the building has an imposing front but is actually a poor tenement with a fabulous view. The railroad becomes a flight path to freedom from the drudgery of the house, but tenants of the house need to cross physical (symbolic) barriers to reach the station. Interestingly, the head (and face) of the son poking out of the train form the poster of the film a shot that is repeated with differing expressions as the film progresses. In this film, the husband-wife team of the Ceylans stays behind the camera. They introduce a TV actor Hatice Aslan who plays Hacer, the mother/wife role in the film. The performance is nothing short of spectacular. The sudden action of kicking up of her shoes while sitting and breaking into smiles of freedom is unforgettable; the true implications of the scene revealed to the viewer only much later. Turkish cinema has thrown up great filmmakers. Yilmaz Guney was my favorite Turkish filmmaker from that country. Now I have added Ceylan (and his talented wife) to that list. Guney took up subjects that mirrored politics and got into trouble for that. Ceylan appears to be apolitical except for his dark universal swipe at politicians as a tribe. Or is he?",
         "Although it can be argued that its local touches can be appreciated more fully by Turkish audiences, \"3 Monkeys\" is a film that can definitely appeal to all film-lovers all over the world. It is a human drama, centered around the family of a fall-guy for a small-time politician. It is also a story of betrayal, longings and revenge. No shot is \"left there\" just for the effect. Even while you are watching someone walk under a train crossing, you find yourself thinking about what she might be feeling, thinking, not because you force yourself to, but because the film successfully makes you. Visuals are great, as always is with Ceylan, but this time they are superior, and the film, with both its screenplay and visuals has a black-and-white feeling, although it is not a black-and-white picture. At the end, you find yourself wondering who the \"three wise monkeys\" really are. Is it the family of 3, whose members have different agendas and do not want to see or hear or tell, or is it us, for knowing, but not wanting to know about all this human drama and social corruption? I hope \"3 Monkeys\" can gain international distribution besides film festivals and be given a chance to be appreciated by everyone.",
         "Although ambitious and picture perfect, the feeling of exaggeration cannot be shaken from \"Üç Maymun\", a drama set in Turkey following the exploits and heartbreak of a nuclear family. Thwarted desires and desire-less characters are plenty; Nuri Bilge Ceylan helms the film that feels it has more style rather than substance. Could possibly be taken more as a meditative form of tragic cinema, it still cannot compare to the likes of Ki-duk Kim, also going for the same moody dialogue-less craving audience. In competition at Cannes 2008, creates more intrigue rather than a cinematic full circle. Film follows a surname-less nuclear family as they come to grips with the paternal character, Eyüp (Yavoz Bingol), who goes to prison for 9 months with either altruistic or financial reasons in mind. He leaves his wife Hacer (Hatice Aslan), who clearly needs more than what her husband can deliver and son Ismail (Ritaf Sungar), an overgrown teenager who cannot find any sort of direction in life, eventually leading himself to lethargy and apathy. Characters are definitely flawed and are interesting, however delivery of the family on celluloid still seem to be somewhat lacking. Technically, the film triumphs as it conveys more towards the plot than the characters. Cinematographer Gőkhan Tiryaki paints the image with a dull rusty palette perfectly mirroring the doom and depression the characters wear on their sleeves. Also, by the camera angles itself, film clearly wants its audience to be as disjointed to the characters as possible making them feel more voyeuristic rather than empathetic. Certain scenes filled with dramatic desperation are filmed behind the bushes, both making moments like that intensely private but nevertheless distant. As with the stylish overcast weather this universe is subjected to, the film is intensely meditative as it strictly confines these characters to themselves through limitations of the spoken word. Almost half of the film is indulged in shots that are introspective and deeply personal. It works to an extent as it diverts the thinking to the audience, although picture doesn't really have much to allow the audience to chew on. Like the sky, filled with clouds desperate to rain, audiences will be left wanting to connect with these characters. It does rain, although it only pour before the end credits. A point of liminal, it doesn't make it clear though on what's there to be liminal about. Picture's ace is Hacer. Played with much desperation by Hatice Aslan, she remains the only character with an overwhelming desire to be happy. Character takes the opportunity to explore happiness whilst her husband is away. But, the thing is, this source of pleasure is normally deemed as unorthodox even if it gives her a reason for being. Once this source of contentment is stripped off, clear anxiety strikes her as she borderlines the bathetic. Indeed a flawed character, she still becomes the reference point to the masculine characters who desire something more tangible. \"Üç maymun\" is a cinematic experience that gets richer in retrospect. Definitely not a form of transient entertainment, it caters to a specific audience devotedly. However, feeling of an overstretched plot on a surrealist setting can be a hindrance to full appreciation. It also feels rather indulgent. Extended shots could have been excised, taking with it the impression of a pretentious, not a nirvana-driven, production.",
         "Director Nuri Bilge Ceylan brings the bridge between the politics and the social order into sharp relief, after the 1996 Susurluk case in Turkey; where innocents get punished instead of the actual criminals. A strong plot yet faltering story-telling. The accord between each actors lead us to a confusion about the happenings, for all the four main characters are playing sulky and disgruntled moods. Rıfat Sungar playing İsmail-the son of the family- is the worst of all. Because he is the center of all the happenings in the movie, we see him at almost every scene. Dialogues between characters were so stuffy that a non-Turkish viewer would have a hard time to understand why a regular 20 year old handsome boy lives a life time crisis; which is because of the academic qualification exams. This is a mistake from the screenplay that disinclines the non-Turkish viewers away. As the story progresses Ceylan's talented directing takes control of our attention ultimately. As a reminder, he used to be a photographer; so get ready for strange and interesting aerial views from Istanbul which you cannot find nowhere else. Have you ever seen an apartment building that much strange looking? Believe me, people actually do live in those junk apartments, and work 2 jobs everyday just to be able to pay the rent in Istanbul. Just three steps away from that slum landlords' houses, there lies the railroad and the Bosphorus. Despite the sightly views from the city, we begin to wonder about each character's upshot. We have a broken family portrait. Father of the family has gone behind bars to save a politics party leader's ass. Then that leader who employs him gets use of his absence and begins to a sexual affair with his wife. The son of the family decodes that affair between them. After arguing with his mother, he kills the party leader the day his father got out of jail. Finally, instead of winding up behind bars to save his son's future; the father blackmails an innocent child to make him stand the racket. As a matter of fact, this waterfall effect oppressed a minority of innocents since the Susurluk case of 1996 in Turkey. Imagine a country of 70 million population bearing those politics leaders for so long. Out of cowardice and deep resentment those politics leaders never took their own responsibility of social, governmental and inflationary chaos. No one knew the consequences of their own cruelty. Nonetheless, Turkey still has enlightened individuals like director Nuri Bilge Ceylan. Thanks for his enlightening work of 3 Monkeys. Attention viewers!! Oscar-worthy directing and cinematography... The strongest nominee of the 2008 Best Foreign Language Feature Film in Hollywood!!",
         "I can't remember if I've ever seen a Turkish film before, which is a pity, because if Three Monkeys is anything to go by, I have missed some terrific movies. This is a dark, stylish, noir thriller which sees a man agreeing to take the rap for his political master who is involved in a car accident. In return for doing time for a crime he did not commit, his boss will continue to pay his salary to his family, and also settle the 'debt' with a lump sum payment when the man is eventually released. While he is in prison, his wife is left to hold the family together and she and her son quickly get caught up in a web of passion and betrayal. Director, Nuri Bilge Ceylan carried off the Best Director Award at Cannes for this, his fifth feature, and it's not hard to see why. Three Monkeys is is a dark, brooding film, where every shot has been thought through and framed with meticulous detail. Long, intense close ups of the principal characters produces sustained psychological tension as unspoken words seem to fly through the air like knives. The principal cast of Three Monkeys; Yavuz Bingöl, Hatice Aslan, Ahmat Rifal Sungar, and Ercan Kesal, are universally good, but top credits should go to Hatice Aslan, the femme fatale of the piece, who has the ability to convey many layers of meaning by saying little and feeling much. Highly recommended.",
         "As other reviewers have said this is a very \"Turkish\" movie, and as such I might have enjoyed it more than some people, having spent two years of my life living in Turkey. But really there is no such thing as a \"Turkish\" movie--Turkish movies are just as widely varied as American movies are (this is absolutely nothing like the infamous Turkish version of \"The Exorcist\", for instance). This is definitely a Turkish-flavored film in some ways, but it is also really one of those (mostly foreign) movies that really uses film as a visual medium as opposed to a purely dramatic one. It's not just that there's no Hollywood-style car chases or big explosions, or that the the one act of violence takes place entirely offscreen. But there's also not a lot of dramatic dialogue (or dialogue period). There's not the \"big\", self-important acting performances, or even the usual over-bearing, emotion-jerking musical score (which is the one thing I probably find most annoying about Hollywood movies). This is a subtle drama about a three-person family (four, actually, if you count a son who died in under mysterious, unspoken circumstances and appears occasionally in ghostly visions). The father goes to jail after taking a fall in a hit-and-run accident for his wealthy, politician employer. The post-adolescent son drifts into juvenile delinquency, and the depressed and middle-age but still quite attractive mother has to approach the employer to borrow money for a car so her directionless son can pursue a career. Infidelity, jealousy, and revenge eventually ensue, and the plot comes full circle with another even more downtrodden person taking the fall for another crime. There are a lot of long, washed-out shots of actors brooding on rooftops overlooking the sea while a thunderstorm approaches. The Midwestern American pseudo-sophisticated rubes at the film festival where I saw this were bitching afterwards about how \"slow\" it was, but personally I thought it was very beautiful (go see a Steven Spielberg flick if want roller-coaster suspense or tear-jerking schmaltz). The acting was excellent, even if it's the kind of introverted acting most \"name\" Hollywood stars today hate and couldn't pull off if their lives depended on it. This would make a poor Hollywood blockbuster, a lousy Broadway play, and a quickly-cancelled primetime TV show, but it's a very beautiful movie.",
         "Driving in the dark of night, in the middle of nowhere, a car takes a right turn and disappears. Descending. Not to death. Hell is one word for it. Another is role-playing. Another is the seer. The opposite of which, is the monkey. Three Monkeys is one of the greatest films of the year from a country that is not in its cinematic golden age, but which we ought to applaud for one of the greatest efforts of contemporary cinema. In a world wherein art has no place whatsoever, the world of the film, where death is as close as stupidity and narrow-mindedness, love forgotten and humanity reduced to means, this film attempts to rekindle a glimpse of hope for those who see it. But it is as fragile as the ghost of a child that haunts its inhabitants. A brilliant cast, almost flawless cinematography and a poetic direction reminiscent of the great works portraying Hell, this film welcomes a refreshing take on realism with surrealist brush-strokes that in my opinion could only benefit from one single element: a return of the gaze. Unfortunately, this film may be lost in the torrents of mainstream audiences. It is also to be respected then, for not making any effort, not pretending, and in my view, ultimately disregarding, any aspirations to popularity. This is fully in accord with the atmosphere of the film itself. And this, if anything, demands critical appraisal.",
         "There is something about Nuri Bilge Ceylan's films that have always set itself apart from other films on the international stage: its ability to resonate with an audience. Although set in Turkey his films' story lines have the ability to connect with an audience from any region while also being able to utilize a major city's inner-turmoil via its transmitting landscapes, exhaustive loneliness and its sheer beauty. And \"Three Monkeys\" is no exception. The story is the most complex and inter-connected of Ceylan's career and because of this he opts to use actors with previous experience for the first time (outside of his actress wife in \"Climates\"). A series of hidden secrets and unfolding lies keeps the family distant and increasingly torn apart from each other until a breaking point brings them back full circle. The \"best-laid-plans\" aspect of the film gives it a tinge of film-noir as it uses this device to present the family in its wondrous failures. Having seen each of Ceylan's previous works my first expectation before seeing this film was breathtaking cinematography (and it did not disappoint in the least). Seeing Ceylan present the wondrous rain clouds that burst and crash above the dusty traffic-filled streets of Istanbul throughout this film as well as many of his others never gets old. \"Three Monkeys\" itself starts with a beautiful presentation of a car riding hidden paths that circle inside a forest's midnight darkness before it disappears from sight completely perhaps evoking questions as to why anyone would need to make their way through such landscapes at such an hour but at the risk of being cliché: \"c'est la vie\". The use of established actors provided some consolation for the audience who could believe and connect with three characters who slowly went about their lives of self-destruction and self-deception until all secrets and lies were laid out on the table for the whole family to bear. The father who went through great hardship for his family finds only heartbreak following his efforts, the guilt-ridden son who is haunted by the memory of a younger brother whose tragic death he feels responsible for and must now deal with the knowledge of a mother who has found the love and affection of another man who is simply using her. The wide array of camera angles and mixture of shots of varying range and clarity enables Ceylan to convey the feelings and thoughts of his characters while still allowing the audience to follow the foreshadowing plot. The usual Ceylan trademarks resonate within \"Three Monkeys\" both technically and spiritually while also showing his audience that with each time-out and with each film he can take his stories and characters into a completely new direction while taking his audience along for the ride. The slow, motionless shots give the audience a silence that swells with his characters' feelings and showcases a family's ability to communicate without words. This film has the ability to simultaneously show an audience a beautiful city and its inhabitants while also revealing real-life characters who let their emotions go to the extreme due to jealousy, rage and lust which can be found within anyone in the world. Note: At Cannes, Ceylan picked up the Best Director prize and the film was subsequently chosen by Turkey to be its nominee for the Academy Award for Best Foreign Language Film.",
         "Three Monkeys (2008) **** How much would you sacrifice for the people around you? What can you ignore to keep your family together? If you pretend something didn't happen, does it matter that it ever happened in the first place? These are some of the questions that permeate the great Turkish director Nuri Bilge Ceylan's latest film, Three Monkeys. Three Monkey's is a grim affair. The film opens as a man drives his car, nodding off, and hits a pedestrian. He's a politician, and knowing what this would do to his career with an upcoming election, he phones his longtime driver in the middle of the night and offers him an proposition. Take his place, and the nine month jail sentence in return for a lump sum. He accepts for the sake of his boss. Never mind that his sacrifice is placed somewhat in vain, considering the politician loses the election anyway. While in jail, the man's family deals on their own. His son, Ismail, wants to ask the politician for an advance so they can buy a car. He can do work with the car, but the work is for shady characters according to his mother. He takes the train to visit his father every so often in jail. The mother works in a kitchen and looks to get her son a job that he would never be interested in anyway. She does eventually go to the politician on her son's behalf, it appears, to get an advance. There's a strange tension between the two. He asks her if her husband knows about \"this.\" Does he refer to getting the advance, which the father would never approve of, or is it something else? One day Ismail gets set to take the train to visit his father, and mother is preparing to attend training for work. At the station, Ismail gets sick, and vomits on himself. He returns home to get changed. After a moment he realizes the house is not empty. There's noise coming from the bedroom. He notices cigarettes, and looks through the keyhole in the door. He turns and leaves. His mother is having an affair with the politician we now know, as does he. He waits until he leaves then returns to the house. He confronts his mother, but never admits that he saw them together, just that he knows he was in the house. This is the first in a series of events which are purposely left unspoken. He does return to visit his father, and suspicious, he asks if they have someone new. After a pause, the son replies no. To admit the truth would mean the destruction of the family. When the father gets out of jail, he returns home to an emotionally absent wife. We can't really know if she was this way before he left, but it doesn't really matter now. She meets him in a nighty laying on the bed, in a brilliant scene which sees the husband go from loving, to suspicious, to anger, and near misogyny, to desperation. The wife, too, goes through a range of emotions, and at one point seems genuine but for a moment, then falls back into a distant place. Everyone knows what is happening, but no one dares speak it. Things spiral more and more into an abyss, until everything has to be at least acknowledged. There are ominous tones throughout Three Monkeys, and they climax in a crucial scene, edited in a particular manner. It involves a meeting between two people in a long take, shot from a distance, that finally cuts to another shot from a distance, but this time from a slightly different angle, and slightly obscured by objects in the foreground. What comes next will require a crucial decision be made by the Father to keep his family together, or maybe there is another way. The family had another son who died. We're lead to believe that he drowned from the oft sounds of dripping water, and his appearance in a few surreal scenes involving the son and the father - the boy's body is soaked as he observes his family members lying in bed. These moments have a creepiness, but a sad tenderness. Particularly in one scene as the Father lies in bed, his wife moving in the background. All of a sudden a tiny arm comes up from behind and embraces him. This family must have been a bomb waiting to explode for a long time. They're bleeding pain, but each other is all they have. Three Monkey's is about as well a film can be directed. Indeed, Ceylan won the best director prize at the 2008 Cannes Film Festival. The aforementioned scene is just one of many well constructed moments. Ceylan channels Tarkovsky in a few scenes, and his colour palette in particular is reminiscent of Tarkovsky. It's only suitable that a film of such dark subject matter be matched in it's look. Ceylan makes great use of locations, and particularly sounds. After the crucial event in the film, the mother wears a shirt that was certainly chosen for it's pattern, as perhaps a not so subtle accusation. Shots are brilliantly composed to represent the distance felt. That there seems to be only one tender embrace in the film - by the dead son to his father - is profound in retrospect. I can't be sure, but I have a feeling that Ceylan drew from somewhere deep inside for this film. It's a film that seems as if it were made by someone who knows all to well how something feels. These kinds of movies are almost never a treat to watch. Luckily Ceylan is a such a good director that things never become unbearable, even when they're at the darkest. It's a dark and painful film, but nevertheless doesn't refuse hold out hope for a better day. They were a whole once. Maybe they can be again.",
         "The first and the most important thing to say about \"Uc Maymun\" is already said at the 2008 Festival de Cannes; the directing is incredibly strong! The usage of every cinematographic material shows and once again proves that Nuri Bilge Ceylan is a great auteur of our time. I really don't agree with the critiques that have been made about how too technical and photographical the movie is. Simply because it's not. It's just irritating as life itself. It's reality what was filmed and so; very irritating as it should have been. It's the first movie of the auteur in which act professional actors; therefore it tastes and seems different somehow. Plus the way it's made was meant to be different than the former ones as far as I am concerned. Yet I don't think that the movie lacks the sincerity which always has been the most important reason for me to like the movies of N.B.C. Actually I think that it is more movie-like this time; thus experimental for the director, no need to say."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Zeynofilm",
         "NBC Film",
         "Pyramide Productions"
      ],
      "summaries": [
         "Near the Bosporus, Eyüp and Hacer live in a modest flat with their son Ismail, in his twenties, who's doing poorly in his studies. Few words pass between them, and a past family tragedy brings sorrow daily. On a rainy night, Eyüp's boss Servet, a wealthy businessman who's entering politics, hits a pedestrian on a lonely road. He drives off and offers money to Eyüp if Eyüp will take the fall - probably a six-month sentence. Eyüp agrees, and while he's in prison, Ismail wants his mother to ask Servet for enough money to buy a car. Servet, in turn, desires Hacer. How can this play out?",
         "While driving late night on a lonely road, the wealthy politician Servet hits a person and flees from the crime scene. The hit-and-run driver calls his employee Eyüp, who lives in a simple house with his wife Hacer and their teenager son Ismail, and offers to continue to monthly pay his salary and a large amount in the end of the sentence to Eyüp to take the blame for the accident. Eyüp accepts the offer and goes to prison along less than a year. Meanwhile, Ismail, who is a reckless student, wants to use part of the money that Servet owes to his father to buy a car to work as a school driver. When the beautiful Hacer visits Servet to receive the money, he makes a pass at Hacer. One day, Ismail returns home before traveling to visit his father and he sees Servet leaving his house and he presses his mother. When Eyüp is released, Ismail drives his father home and he leans that Hacer had taken part of the money to buy the car. When Servet does not discount the amount from the payoff, Eyüp suspects that Hacer is an unfaithful wife in the beginning of a family tragedy.",
         "While driving late night on a lonely road, the wealthy politician Servet hits a person and flees from the crime scene. The hit-and-run driver calls his employee Eyüp, who lives in a simple house with his wife Hacer and their teenager son Ismail, and offers to continue to monthly pay his salary and a large amount in the end of the sentence to Eyüp to take the blame for the accident. Eyüp accepts the offer and goes to prison along less than a year. Meanwhile, Ismail, who is a reckless student, wants to use part of the money that Servet owes to his father to buy a car to work as a school driver. When the beautiful Hacer visits Servet to receive the money, he makes a pass at Hacer. One day, Ismail returns home before traveling to visit his father and he sees Servet leaving his house and he presses his mother. When Eyüp is released, Ismail drives his father home and he learns that Hacer had taken part of the money to buy the car. When Servet does not discount the amount from the payoff, Eyüp suspects that Hacer is an unfaithful wife in the beginning of a family tragedy.",
         "A family suffers from a major communication breakdown during their struggle to get through their hardships."
      ],
      "budget": 0
   },
   "movielensId": 63698,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2008-05-16",
      "dvdReleaseDate": null,
      "directors": ["Nuri Bilge Ceylan"],
      "runtime": 109,
      "movieId": 63698,
      "title": "Three Monkeys",
      "mpaa": "",
      "actors": [
         "Yavuz Bingöl",
         "Hatice Aslan",
         "Rifat Sungar",
         "Ercan Kesal",
         "Cafer Köse",
         "Gürkan Aydin"
      ],
      "imdbMovieId": "1233381",
      "originalTitle": "Üç maymun",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["7wBznN7c8YE"],
      "plotSummary": "A family battles against the odds to stay together when small lies grow into an extravagant cover-up. In order to avoid hardship and responsibilities that would otherwise be impossible to endure, the family chooses to ignore the truth, not to see, hear or talk about it. But does playing “Three Monkeys” invalidate the truth of its existence?",
      "tmdbMovieId": 8905,
      "avgRating": 3.53125,
      "releaseYear": "2008",
      "numRatings": 112,
      "posterPath": "/1gfrdOvBWHyG7xn9C6r2REuk4c.jpg"
   }
}