{
   "tmdb": {
      "original_language": "pt",
      "keywords": [],
      "imdb_id": "tt0327201",
      "video": false,
      "title": "The Three Marias",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Filomena",
               "gender": 0,
               "credit_id": "52fe466bc3a368484e08f933",
               "name": "Marieta Severo",
               "profile_path": "/hF09L6YlIxmO7fo1Z2hbb5FqWz6.jpg",
               "id": 138327,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Maria Francisca",
               "gender": 1,
               "credit_id": "52fe466bc3a368484e08f937",
               "name": "Júlia Lemmertz",
               "profile_path": "/6JZkAAPjhGSWPNuIH7b1GiaL5O3.jpg",
               "id": 115172,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Maria Rosa",
               "gender": 0,
               "credit_id": "52fe466bc3a368484e08f93b",
               "name": "Maria Luísa Mendonça",
               "profile_path": "/42fhZo5i6aiMvPsR0NFvMggN36T.jpg",
               "id": 55029,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Maria Pia",
               "gender": 1,
               "credit_id": "52fe466bc3a368484e08f93f",
               "name": "Luíza Mariani",
               "profile_path": "/s2l6ad0FEfHTpfX7rzxpIRCC2lq.jpg",
               "id": 234571,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Firmino Santos Guerra",
               "gender": 2,
               "credit_id": "52fe466bc3a368484e08f943",
               "name": "Carlos Vereza",
               "profile_path": "/4QKizEe6tm0tYeU4lgBceBaHVN3.jpg",
               "id": 234572,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Jesuíno Cruz",
               "gender": 2,
               "credit_id": "590a9c279251414f9e00b6e9",
               "name": "Wagner Moura",
               "profile_path": "/bESNWiGHjMhMGoqBMVtbpJBazKx.jpg",
               "id": 52583,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Catrevagem",
               "gender": 2,
               "credit_id": "590a9c379251414fa100bb7e",
               "name": "Lázaro Ramos",
               "profile_path": "/bW1nvydMnQnCNrHcdIdJzEYaAGj.jpg",
               "id": 55009,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "58588341c3a3682dfe065713",
            "name": "Aluizio Abranches",
            "profile_path": "/7KKi9x5eV9WSVhR7OPfVMbg8n9c.jpg",
            "id": 130300,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.539662,
      "production_countries": [],
      "id": 61939,
      "vote_count": 3,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "As Três Marias",
      "runtime": null,
      "poster_path": "/mdBV5D365L8FO0u1wzkVilqfWHx.jpg",
      "spoken_languages": [{
         "name": "Português",
         "iso_639_1": "pt"
      }],
      "production_companies": [],
      "release_date": "2002-01-01",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Aluizio Abranches"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Heitor Dhalia",
         "Wilson Freire"
      ],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt0327201/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNjIyNDE4NF5BMl5BanBnXkFtZTcwMjIxNzY5MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Marieta Severo, Júlia Lemmertz, Maria Luísa Mendonça | See full cast and crew »"],
      "reviews": [
         "\"Three Marias (As Três Marias)\" is a lush, highly stylized, operatic story that acts as if it's telling a traditional, mythic tale of thwarted love and violent revenge with lots of Biblical references, but in modern dress and cars in rural Brazil. Medea comes to mind as an antecedent for the matriarch who sets in motion violent feelings and their brutal aftermath. The characters are types, not individuals, each representing a strong emotion, with much less seduction than I had anticipated by her \"by whatever means necessary\" instruction to her three titular daughters. I thought I either wasn't following the chronology, let alone keeping the somewhat similar characters straight, or that the projectionist had mixed up the reels, until I realized that the repetitions were supposed to be ironic as destiny takes unanticipated turns. The subtitles are full of misspellings and typos.",
         "Lame and ludicrous drama located in the Northern region of Brazil where a mother (Severo) and her three daughters (Lemmertz, Mariani and Mendonça) seeks revenge against the family that murdered their father/husband and brothers/sons. In this process, they came in contact with some strange figures like a professional killer called \"Zé das Cobras\" and some other weird parsonages. Bad dialogue, an almost amateur direction by Abranches and cardboard performances by the cast made this one a misfire in Brazilian modern cinema. I give this one a 4 (four).",
         "As Três Marias (Three Marias) is about as theatrical as a film can be without confining itself to a stage. Creative director Alusio Abranches, responding to the script by Heitor Dhalia and Wilson Freire, has elected to film this story of gory murder and revenge incorporating screen visuals that transport the contemporary setting into the realm of magical realism. And it works very well - if the viewer is willing to sacrifice linear storytelling to the metaphor-laden technique. The film begins with an extended silent view of a man and a woman in conversation beneath a bizarre rock formation: Firmino Santos Guerra (Carlos Vereza) is obviously trying to talk Filomena Capadocio (Marieta Severo) into not leaving him. Jump forward in time and the murders of three men are enacted in the most grisly of manners - one is hanged by his own intestines, on has his eyes and heart torn out, and one is burned to death - all under the familial guidance of the Santos Guerra family. The deaths represent the husband and two sons of Filomena and when she is told of the events, she stifles her tears with building hate and calls her three daughters to her home - Maria Francisca (Julia Lemmertz) Maria Rosa (Maria Luisa Mendonca), and Maria Pia (Luiza Mariani). Each daughter is given the obligation to hire a hit-man to deliver the head of Firmino to Filomena. The story then proceeds to show the engaging of Chief Tenorio (Tuca Andrada) bitten by a rabid dog, Ze das Cobras (Enrique Diaz) who never has spoken with a woman and uses a 'translator' Catrevagem (Lazaro Ramos) to communicate, and imprisoned murderer Jesusino Cruz (Wagner Moura) whose protocol for killing is always to cut his victims in half. With this trio of hit men the three Marias set out to accomplish their mother's vengeance and how this plays out is the essence of the film. Shot in stark colors and contrasts and accompanied by an operatic music score, the film succeeds as a mood piece. The actors are all quite fine despite the fact they are playing archetypes rather than credible human beings. For a heavy dose of excellent Brazilian classical theater this film is sure to please. Grady Harp",
         "When she learns that her husband and three sons have been brutally murdered, a mother bottles up her grief to ensure that it turns to hatred and a desire for revenge. With the wake complete, the mother sits with her three grown daughters and gives them each a mission \u0096 to seek out and employ the services of three men who will kill on their behalf, thus getting vengeance without her family being directly stained by more blood. At heart I am not anywhere near as clever or as discerning as I would like to think I am and at times this does mean that I just assume that any foreign film that has managed to reach the UK must, by default, be really good and worth seeing. Mostly this maxim does reward me but too often it does not and I find myself sticking with a film that I would not have bothered with had it been made in English in London for example. As Três Marias is one such film. The plot summary made me think that it would be complex and challenging as it offered up the elements of tragedy, soaked with hatred and revenge involving young women. It could have been daring and thoughtful but instead it is dull and rarely amounts to much. Visually it is very stylish and delivered with energy but director Abranches has put too much effort into this and nowhere near enough into drawing out characters and structuring this story to maximise effect. Speaking of structure, this film more or less flows forward but there are jumps around back and forward to tell us more about specific events. It is, I think, designed to create a mystery and drive it forward as a thriller but really the material lacks the thrills and intrigue that are needed for this device to then punch it home. With this lacking I was looking for the tragedy to be made more of, and it should have done with the shadow of death over every character. Sadly this is fudged as well and I never really cared for anyone involved and nobody seemed interested in doing anything in the hearts and souls of their characters. Accordingly the performances are dry \u0096 not bad per se but just lacking anything of substance. Severo pulls some faces that imply pain but has little behind it, while Lemmertz, Mendonça and Mariani are solid in terms of events but have nothing being their actions. The overall effect then is a film that just sort of happens. The narrative just about provides enough reason to keep half an eye on it but even the occasionally engaging styling of it all is not enough to hold the interest. The lack of a heart and thoughtfulness in terms of the events starts in the script and creeps through delivery right down into the performances; a key failing that means there is little about this film that I will remember even a few days from now."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Lama Filmes",
         "Teodora Film"
      ],
      "summaries": [
         "In Bahia, a woman spurns a suitor she'd rejected thirty years before. In response, he and his sons sadistically kill her husband and sons. She gathers her three daughters and swears revenge, sending each to hire a killer who's to bring her the head of his victim. Maria Francisca is to hire Zé das Cobras, who eats snakes for courage and won't talk directly to women. Maria Rosa is to hire Chief Tenório, a righteous policeman currently on the hunt for a mad dog. Maria Pia is to hire Jesuíno Cruz, whom she must first spring from prison, and who cuts his victim's in half so that God and Satan get their share. Will the daughters succeed? Will justice be done?",
         "Woman uses her three daughters to avenge their father and brothers, killed by a jealous ex-fiancé."
      ],
      "budget": 0
   },
   "movielensId": 6381,
   "movielens": {
      "languages": ["Português"],
      "releaseDate": "2002-01-01",
      "dvdReleaseDate": "2005-04-26",
      "directors": ["Aluizio Abranches"],
      "runtime": 0,
      "movieId": 6381,
      "title": "The Three Marias",
      "mpaa": null,
      "actors": [
         "Marieta Severo",
         "Júlia Lemmertz",
         "Maria Luísa Mendonça",
         "Luíza Mariani",
         "Carlos Vereza",
         "Wagner Moura",
         "Lázaro Ramos"
      ],
      "imdbMovieId": "0327201",
      "originalTitle": "As Três Marias",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 61939,
      "avgRating": 2.55,
      "releaseYear": "2002",
      "numRatings": 10,
      "posterPath": "/mdBV5D365L8FO0u1wzkVilqfWHx.jpg"
   }
}