{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0093267",
      "video": false,
      "title": "Intervista",
      "recommendations": [
         198537,
         202776,
         65045,
         42029,
         36236,
         4195,
         47439
      ],
      "backdrop_path": "/oPGuEuAEyqCPGC3j57HCC5H4duj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4742c3a36847f812bc9f",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Reporter, himself",
               "gender": 2,
               "credit_id": "52fe4741c3a36847f812bc8b",
               "name": "Sergio Rubini",
               "profile_path": "/jRUomd7KganSESVSfJk36VXOKNv.jpg",
               "id": 15915,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Antonella",
               "gender": 1,
               "credit_id": "52fe4741c3a36847f812bc8f",
               "name": "Antonella Ponziani",
               "profile_path": "/tvbpMHzPVgyrSnxV0iQsr2ZxVFJ.jpg",
               "id": 103121,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4742c3a36847f812bc93",
               "name": "Maurizio Mein",
               "profile_path": null,
               "id": 232877,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Star",
               "gender": 0,
               "credit_id": "52fe4742c3a36847f812bc97",
               "name": "Paola Liguori",
               "profile_path": null,
               "id": 232879,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4742c3a36847f812bc9b",
               "name": "Anita Ekberg",
               "profile_path": "/6cVesMXxY4dRO4K87Ni7msNdTPh.jpg",
               "id": 5961,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5a9918c60e0a2605f20061fb",
               "name": "Federico Fellini",
               "profile_path": "/iNuDmm889WbZDK4k0qxsjeNnNhV.jpg",
               "id": 4415,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4741c3a36847f812bc87",
               "name": "Federico Fellini",
               "profile_path": "/iNuDmm889WbZDK4k0qxsjeNnNhV.jpg",
               "id": 4415,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a9918e20e0a2605f2006218",
               "name": "Gianfranco Angelucci",
               "profile_path": null,
               "id": 1171533,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a9918e9c3a3680b57006799",
               "name": "Federico Fellini",
               "profile_path": "/iNuDmm889WbZDK4k0qxsjeNnNhV.jpg",
               "id": 4415,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a9918f70e0a2605c60060ff",
               "name": "Ibrahim Moussa",
               "profile_path": null,
               "id": 1988742,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a9919000e0a2605f200622e",
               "name": "Nicola Piovani",
               "profile_path": "/1TY1fOqJiv3KqxQdVyUdbMqwabM.jpg",
               "id": 9245,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5a99190d92514128be006132",
               "name": "Tonino Delli Colli",
               "profile_path": "/eZiIxNxmEJPLWsGokFX98IcgdF2.jpg",
               "id": 2361,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a991914925141289600612d",
               "name": "Nino Baragli",
               "profile_path": null,
               "id": 4670,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a99191e92514128af0061ba",
               "name": "Danilo Donati",
               "profile_path": null,
               "id": 9247,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5a99192792514128be006146",
               "name": "Danilo Donati",
               "profile_path": null,
               "id": 9247,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a99193992514128cc0064a5",
               "name": "Massimo Anzellotti",
               "profile_path": null,
               "id": 1302372,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a99194a0e0a260611006a25",
               "name": "Romano Pampaloni",
               "profile_path": null,
               "id": 1707585,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.388832,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 47715,
      "vote_count": 12,
      "budget": 0,
      "overview": "Federico Fellini welcomes us into his world of film making with a mockumentary about his life in film, as a Japanese film crew follows him around.",
      "similar": [],
      "original_title": "Intervista",
      "runtime": 102,
      "poster_path": "/k8Hh4Nnhnl5tZ5EWpvovcVm7Kne.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fernlyn",
            "id": 93146,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aljosha Production Company",
            "id": 78552,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinecittà",
            "id": 1042,
            "origin_country": ""
         },
         {
            "logo_path": "/gKP4egMJOi5rksdnplfPV1wa0sd.png",
            "name": "RAI",
            "id": 1583,
            "origin_country": "IT"
         }
      ],
      "release_date": "1987-01-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Federico Fellini"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Federico Fellini",
         "Gianfranco Angelucci"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0093267/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwMjAzMDM0M15BMl5BanBnXkFtZTcwMDUzNjgyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sergio Rubini, Antonella Ponziani, Maurizio Mein | See full cast and crew »"],
      "reviews": [
         "I don't know what the reviewers were thinking, but with Ebert leading the pack, it might be safe to say that they weren't thinking at all. Intervista is an amazing film. It takes the shape of a fake documentary, in which Fellini looks at, and pokes fun at, his entire career. In the end it is an homage, not to himself, as other reviewers have suggested, but to film itself. Praise for a medium which never ceases to amaze viewers and film makers alike with it's capacity to project and create our dreams.",
         "So to sum it all up, Fellini seems to be saying in this film, he lived for movies. Like a long train ride as a passenger, a lover, a player, a commentator he lived through it all and had his moments. When Marcello Mastroianni says to Anita Eckberg while watching the fountain scene from La Dolce Vita with the party at her mansion that for one moment they made magic, it seemed to sum it all up. For the actors, the film maker and for us the audience, there were moments that were magic. This film is a great movie makers collage of his memories of his life. If it had been cinematic itself it would have taken away from the message. Life at its very best can yield a few magic moments, and those lucky enough to make those moments of magic can appreciate the rest of it all that serves as the backdrop. Like the film studio around which Fellini's life revolved and which gave him all those great memories he shared with us here.",
         "An elegiac look-back by the Maestro on where his films were shot (Cinecitta), Intervista has the most meta-fictional plot devices Fellini's used yet. --It features Fellini himself, shooting a film \"recounting\" a location (as in \"Roma\") but here he is more forefront. --The rather casual stream-of-consciousness meandering of the happenings hearkens to \"Amarcord,\" which is similar to this, with a wistful look back on the past, with fascists, bus rides, buxom women, etc. \"Intervista\" truly seems like an alternate draft of \"Amarcord\" with Fellini personally added. --The \"young Fellini\" going on an interview, being shot by Fellini during an interview in present day, and the playful and insistent 3rd-wall being broken every so often. --And of course Marcello and Anita as themselves. For fans of Fellini, this is an absolute must-see. Its reflection on his work, himself, and making films makes it one of the most playful, subversive, and autobiographical films in Fellini's late career. (Originally a t.v. production, it displays a smaller scale that can only be attributed to the budget (too bad) and a need to make things \"play\" on a smaller screen. Although very similar to \"A Director's Notebook\", another filmic essay (that was a rough draft for \"Roma\"), this one is more assured and stands on its own. )",
         "This was the second to last film the famed director, Fellini, made and it was his most personal. Instead of being a traditional film, this is much more like having a personal visit with him as he shows you around Cinecittà Studios in Rome. Sometimes he talks to the camera (or in many cases, the fictional Japanese crew interviewing him--a plot device to represent the audience), sometimes you just watch somewhat random scenes as they are shot and other times you watch Fellini and his friends as they reminisce--such as when Marcello Mastroianni pops by the set and Fellini, impulsively, takes him on a road trip to see Anita Ekberg. While this all seems unscripted and at the spur of the moment, it was all staged for the film but it has a real home movie quality about it. At Ekberg's home, all of Fellini's guests view scenes from LA DULCE VITA (starring Mastroianni and Ekberg) and there is a very strong nostalgic air about the party. The total effect of all these elements was a lot like climbing inside Fellini's mind and it also gave a lot of amazing insights into the film making process. Because of this it was a lot like Truffaut's DAY FOR NIGHT, though a bit different because DAY FOR NIGHT stuck more to a traditional script (a movie about a movie being filmed) and seemed a lot less frivolous and fun. Fellini's is more of a \"warts and all\" and appears to be more spontaneous and ad-libbed--though because of some of the grand sets and the visit to Ekberg's, it obviously was staged to look spontaneous. My advice is to see this film and DAY FOR NIGHT. DAY FOR NIGHT is rated higher, but because of all the sentimentality of INTERVISTA, I preferred it slightly. While I have never been a huge fan of Fellini, I have seen most of his films and really enjoyed having some insights into his psyche. Most of it came as no surprise (such as the use of phallic imagery--Fellini's sexuality was never repressed in his films), but some was very sweet and charming. It was nice to see him as both director and actor--so why is the film rated so poorly??!! By the way, when the film was made, Miss Ekberg was 56 years-old and Mr. Mastroianni was 63. I was rather irritated with an IMDb review that complained about her being \"obese\" and him being \"wrinkled\". This was cruel and shallow, as most women would die to look that ravishing at 56 and most men would love to be a charming old rogue at 63! What do you expect at that age? Hmm? To quote Ekberg in a recent interview, \"I'm very much bigger than I was, so what? It's not really fatness, it's development.\" Bravo. PS--If you like this film, try watching Vincenzo Mollica's documentary on the film that's included on the DVD for INTERVISTA. It does a nice job of explaining some of the plot elements and features clips not only from this movie but several other Fellini films. My favorite part was learning that Miss Ekberg's plunge into the Trevi fountain in LA DULCE VITA was done in February!!",
         "Intervista is one of the best films I've ever seen. The strong sense in all Fellini films that reality is like a big, sad circus is even stronger in this film because fact and fiction, past and present become so confused. The fictitious carnival appears to be reality. And isn't that maybe quite a realistic view? There is not only the usual sense of nostalgia: because the film looks back at decades of Fellini nostalgia, the nostalgia is double. Who can watch the older Anita and Marcello looking back at La Dolce Vita with dry eyes? The only possible critic could be that the film is, like all Fellini movies, little coherent, but then, isn't that as well like life itself? Intervista maybe isn't the most famous Fellini films, it certainly is one of the better ones and with that one of the best films in cinematographic history.",
         "\"Intervista\" means interview and naturally that's not at all what this is. Fellini does start off with a fictional interview with a Japanese TV crew but the movie develops to include a recreation of his own first trip to Cinecitta (as a journalist to interview a famous actress), a look at the process of making a Fellini film, reminiscences of his own previous movies, cinema in general and the music of Nino Rota, sideswipes at TV and advertising and the silly questions asked by journalists. We jump about between several layers of 'reality' - the fake 'interview', the '30's recreation, the creation of that recreation, real people playing more or less fictionalised versions of themselves. At one point we have Fellini-surrogates Mastroianni and Rubini, and Fellini himself, all in a car together. The film lacks the epic sweep and spectacle of \"Roma\", perhaps due to its genesis as a TV film, and much of it will mean little to those unfamiliar with Fellini's earlier work. Nonetheless, there is much to enjoy, from Rubini and Mastroianni's discussion of masturbation, through the scenery-painters' rather blunt dialogue, to the rightly acclaimed and very poignant scene of Mastroianni and Ekberg revisiting \"La Dolce Vita\". In fact the Mastroianni/Ekberg scene probably sums up the whole film - a wistful look back at past glories and a perhaps rather rueful look at where Fellini, and the rest of us, had arrived at by 1987.",
         "While shooting a movie about his arrival to Cinecittà to interview a famous star, Federico Fellini is interviewed by the Japanese television. Fellini highlights and revisits the beginning of his career portrayed by the young actor Sergio Rubini in the early 40's. Then he casts new characters for his next movie, \"Amerika\", from Franz Kafka. Later Marcello Mastroianni performing Mandrake visits Fellini and his producers, cast and crew and together they pay a visit to Anita Ekberg in her country cottage. Last but not the least, Fellini foresees the end of the golden era to the cinema industry with the competition of the television. The beautiful and simple \"Intervista\" is a nostalgic \"movie of a documentary of a film-making\" that envisions the increasing competition to the television in this segment and consequent end of the golden era of the cinema industry and mostly of the movie theaters. The climax of the story is certainly with the unforgettable and most famous scene of the Italian cinema with Marcello Mastroianni and Anita Ekberg in the fountain of \"La Dolce Vita\". I would give a penny for the thoughts of Anita and Marcello while seeing that magic moment of their youth again. My vote is eight. Title (Brazil): \"Entrevista\" (\"Interview\")",
         "Watching Fellini's \"Intervista\" is a mixed bag--sadness, frustration because it is not better... coupled with moments of brilliance. I'm not sure there is a more poignant moment in the movies than the scene of a wrinkled Marcello Mastroianni and obese Anita Ekberg wistfully watching their former youthful black & white selves in \"La Dolce Vita\" being projected on a makeshift screen. That scene alone is a richly-charged commentary on time, memory, regret, self-delusion, love, missed opportunity, life and death--unlike any other I have ever seen.",
         "\"Intervista\" (\"Interview\") takes life and movies to an unimagined extent. An nostalgic journey into memory, experiences and life in the way Federico Fellini sees them. And he asks those kind of questions: \"What's real in movies? What's real in news and documentaries?\". Even more: \"What's real in life?\" Defying, joking, molding, constructing and deconstructing films and the human existence, Fellini challenges and fascinates viewers through four intertwined segments which echo his work, his art and his early memories when of his arrival at the famous studio Cinecittá, way before of becoming the cinematic author of \"Amarcord\" and \"Satyricon\". The movie is composed of showing the behind the scenes of a movie directed by the maestro Fellini; the movie itself (film within the film) and its long and confusing process of shooting; the interview documented by the Japanese crew who hears the director's stories that later are intercut with scenes of a young Fellini (played by the lovable Sergio Rubini) living his first experiences at Cinecittá while interviewing a impressionable film star. They're all mixed into an magical and dreamy imitation of life. But how can one distinguish what's scripted and what's real? You can't. But you can try. The reunion between Marcello Mastroianni and Anita Ekberg, 27 seven years later after \"La Dolce Vita\" is wonderful, almost brings tears to our eyes. But they really kept all this time without seeing each other as they say? Maybe, maybe not, very unlikely but somehow we buy this as a fact. It looks genuine, they're so thrilled and surprised with this event. They play themselves in the movie, watching the characters they played in another Fellini classic, when they were very young. That's the film's magic, to capture both these stars in different situations and periods of life, all captured in a beautiful frame where Marcello can play magic tricks and prepare a delightful and nostalgic surprise to Anita and then watch the famous sequence of the Fontana de Trevi that the two performed in 1960. This dialog between medias and time is hypnotic, mysterious and funny too. It's a perfect fusion of realities, facts and fiction friendly put together in one single film. One of Fellini's finest and a treasure to be sought. 9/10",
         "This is a beautiful Fellini, one the most beautiful he ever made and I don't understand why is so underrated. A joy to watch from beginning to end, a visual gem, a masterpiece; one with which the master confounds the skeptics, shows he's still in top form. I don't remember any other Fellini containing such breathtaking scenes, astonishing in their exuberance and richness in color as that in the oriental set with Maharajahs and elephants or those carrying such evocative power as that of the two aging European sex symbols of the 1960s watching themselves on a white sheet, shedding a few tears and drinking to the good old times. Oh, to be young and beautiful again...(sigh). Oh, and that final sequence of the cast and crew huddling inside the plastic tent during a storm, the collective soul going from joy and euphoric enthusiasm to muted, thoughtful melancholy, while bathed all with the music coming from the back of the truck under the rain. There's also something surreal about that haunting scene, under the rain, behind the rain, that makes it stay with us for a long time, forever: the girl blowing it away in her saxophone and the boy taking it away at the piano, both framed by the big box of the vehicle; a beautiful portrait of ineffable energy and youthful poetry. Oh, and also nobody, nobody but Fellini himself could have done a better job playing The Maestro at his best, with the juices of creativity pouring through each one of his pores. This is Fellini at his best, the full essence of his genius distilled in a single cinematographic piece, where he reaches his own outer limits. For one thing, I noticed here a great number of scenes with deep, ample backgrounds--even in some interiors--except for those where such a thing was impossible--the inside the trailer of the diva for ex.. But you will rarely see here characters in closed, claustrophobic quarters or plastered against a wall. I'm not a film scholar or a psychologist, but to me that means that at this point Fellini had finally become master of his space, that he totally owned his surroundings. He was free at last to do pure cinematographic art without being burdened by ghosts from the remote past, by the heavy load of unsolved traumas; he had finally exorcised his demons\u0097even the resident fascist here is a nice, inoffensive little old man\u0097and so become the filmmaker he always wanted to be. It is in this film where the master has reached his peak. Intervista is a cinematographic gem from beginning to end. The pacing, the acting, the score are impeccable, flawless; so much so, you find hard to believe that any of this could have been prepared, scripted, rehearsed as any regular movie, it feels so spontaneous, so authentic. This is a movie that Fellini had absolutely to make. He owed that to the world, his legacy wouldn't have been complete without it. The world can do without 8 ½ but it absolutely needs Intervista. And Fellini was one of the few chosen who could accomplish such a feat--the only other one I can think of being Buñuel. Because here we see the real man, Fellini in all his humility and humanity, a man in love with movies and people. I have seen enough movie shootings in public places to know that this can be at times a very stressful activity and tempers tend to flare during difficult times but I don't have any doubt that the joy and enthusiasm his collaborators show working with him here is real. I can't possibly imagine Hitchcock or Kubrick getting away with the same thing and I'm even less sure we would have wanted to watch their respective \"Intervistas\". But Fellini not only shows us how he shoots movies, he makes us also part of his team, we become\u0097in the flesh of the Japanese journalists, the young actors, the crew\u0097part of his family. Already in the introductory shot he makes clear we are his invites in that metaphoric opening wide of the gates of Cinecitta and in the fact that he's himself the one to greet us, no some subordinate or studio bureaucrat. That's enough to reassure us that what we'll get during the next 104 min. will be the real deal. Another thing I loved about Intervista is that it is a movie that doesn't take itself seriously, probably to the image of his creator. There are some hilarious moments that can only be seen as his ironic or sarcastic comments about movie directors in general or even himself: For ex., the director who won't settle for anything less than a pear for lunch. Or the other one who suffers a meltdown when a cardboard cut elephant drops its trunk. I found also the commercials very good and very tasty, said to have been Fellini's concepts. And finally, the score, a put pourri of some scores of other Fellini's films, the kind of music you'll like to be the last thing you hear when leaving this world. In all, perhaps not the best but certainly the most beautiful, most joyful, of all Fellini's. 9/10."
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Aljosha",
         "Cinecittà",
         "RAI Radiotelevisione Italiana"
      ],
      "summaries": [
         "Cinecitta, the huge movie studio outside Rome, is 50 years old and Fellini is interviewed by a Japanese TV crew about the films he has made there over the years as he begins production on his latest film. A young actor portrays Fellini arriving at Cinecitta the first time by trolley to interview a star. Marcello Mastroianni dressed as Mandrake the Magician floats by a window and Fellini followed by TV crew takes him to Anita Ekberg's villa where the Trevi fountain scene from Dolce vita, La (1960) is shown on a sheet that appears and disappears as if by magic.",
         "While shooting a movie about his arrival to Cinecittà to interview a famous star, Federico Fellini is interviewed by the Japanese television. Fellini highlights and revisits the beginning of his career portrayed by the young actor Sergio Rubini in the early 40's. Then he casts new characters for his next movie, \"Amerika\", from Franz Kafka. Later Marcello Mastroianni performing Mandrake visits Fellini and his producers, cast and crew and together they pay a visit to Anita Ekberg in her country cottage. Last but not the least, Fellini foresees the end of the golden era to the cinema industry with the competition of the television."
      ],
      "budget": 0
   },
   "movielensId": 6415,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "日本語"
      ],
      "releaseDate": "1987-01-01",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Federico Fellini"],
      "runtime": 102,
      "movieId": 6415,
      "title": "Intervista",
      "mpaa": "",
      "actors": [
         "Marcello Mastroianni",
         "Sergio Rubini",
         "Antonella Ponziani",
         "Maurizio Mein",
         "Paola Liguori",
         "Anita Ekberg"
      ],
      "imdbMovieId": "0093267",
      "originalTitle": "Intervista",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["yCzMCZ0aCIY"],
      "plotSummary": "Federico Fellini welcomes us into his world of film making with a mockumentary about his life in film, as a Japanese film crew follows him around.",
      "tmdbMovieId": 47715,
      "avgRating": 3.69767,
      "releaseYear": "1987",
      "numRatings": 43,
      "posterPath": "/7PwcSQFNybPWv3KRhXNO7FiLNtj.jpg"
   }
}