{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "dying man",
            "id": 9661
         }
      ],
      "imdb_id": "tt0120142",
      "video": false,
      "title": "The Sixth Man",
      "recommendations": [
         33657,
         201938,
         134464,
         41589,
         27360,
         97206,
         17207,
         46301,
         45862,
         30963,
         44020,
         37272,
         12538,
         26710,
         32316,
         12251,
         17806,
         99062,
         117904,
         11511
      ],
      "backdrop_path": "/2223beT7PTGlBPC8NDDAGyrWomA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kenny Tyler",
               "gender": 2,
               "credit_id": "52fe460d9251416c91047683",
               "name": "Marlon Wayans",
               "profile_path": "/yMBaTsPrthko9eYtSjfVduws5Cn.jpg",
               "id": 9562,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Antoine Tyler",
               "gender": 2,
               "credit_id": "52fe460d9251416c91047687",
               "name": "Kadeem Hardison",
               "profile_path": "/aCuoYn6GdVqZyy35JmqaY6TS9bO.jpg",
               "id": 66554,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Coach Pederson",
               "gender": 2,
               "credit_id": "52fe460d9251416c9104768b",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Camille Tyler",
               "gender": 1,
               "credit_id": "52fe460d9251416c9104768f",
               "name": "Saundra McClain",
               "profile_path": null,
               "id": 116299,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "James Tyler",
               "gender": 0,
               "credit_id": "52fe460d9251416c91047693",
               "name": "Harold Sylvester",
               "profile_path": "/ycHQQeuvrQ8vo9PwsmgLrffqITw.jpg",
               "id": 27540,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Mikulski",
               "gender": 0,
               "credit_id": "52fe460d9251416c91047697",
               "name": "Kevin Dunn",
               "profile_path": "/85thH2pUn2tPP97QhnYQI7MBiCW.jpg",
               "id": 14721,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Nativity Watson",
               "gender": 1,
               "credit_id": "587c5d0ec3a3684a9e0155a5",
               "name": "Octavia Spencer",
               "profile_path": "/4FEVru6fBFyJECqwqjHwlZdsL4c.jpg",
               "id": 6944,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe460d9251416c9104769d",
               "name": "David Hoberman",
               "profile_path": "/l63YjASljQOAB8ys4zR3DWUXltP.jpg",
               "id": 31710,
               "department": "Production",
               "job": "Production Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe460d9251416c910476a3",
               "name": "Randall Miller",
               "profile_path": null,
               "id": 77121,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.536403,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36807,
      "vote_count": 30,
      "budget": 0,
      "overview": "Antoine and Kenny Tyler are NCAA college basketball players, and Antoine is the star. Suddenly Antoine dies of heart attack and Kenny has to fill his shoes as leader of team. Some time later, Antoine returns as a ghost and helps Kenny in game and in life, but Kenny changes in the process and doesn't quite like it.",
      "similar": [
         2300,
         325133,
         114150,
         440021,
         8469,
         20453,
         37247,
         9285,
         10760,
         8065,
         10193,
         5559,
         73,
         23483,
         292280,
         270303,
         262500,
         262504,
         244786,
         22970
      ],
      "original_title": "The 6th Man",
      "runtime": 107,
      "poster_path": "/jJIoI6r8oYkgzllp85nXVW8cEDR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1997-03-28",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "They're lifting the game to a higher level",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Randall Miller"],
      "runtime": 107,
      "synopsis": null,
      "writers": [
         "Christopher Reed",
         "Cynthia Carle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120142/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzNDMyODgzMF5BMl5BanBnXkFtZTcwNjcyNTUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Marlon Wayans, Kadeem Hardison, David Paymer | See full cast and crew »"],
      "reviews": [
         "This is my favorite movie, i watch it all the time! it has a great plot and i never get sick of it i repeat all the lines and songs while i am watching it, its great. and when i found out it was going to be on tv for the first time i got extremely excited because i knew people would get to see how great of a movie it really is, its funny, touching, sad, and inspiring all in one, i still get tears in my eyes every time i watch it and laugh at all the same moments this movie is great, super, fantastic, and terrific and i recommend it to EVERYONE especially basketball",
         "This movie is excellent. It is hilarious and has great drama. Kadeem Hardison and Marlon are just as convincing as brothers as Marlon is with his real life brother Shawn on \"The Wayans Bros.\" The acting was great, the comedy was great, and the writing was great. This is the film that made me look at Marlon Wayans as more than just a funny guy, but also as a very talented actor. I give this movie a 10.",
         "As a child I loved the movie The 6th Man. I probably hold the world record for the most viewings of this movie so for that reason I think I should write a review of it. As I said I loved this movie as a kid but now that I'm older I realize the many flaws it has, though I still understand what I liked so much about it when I was younger. The 6th Man is a rare combination of comedy and drama. It doesn't transition between the two very well and I think that accounts for its less than stellar average rating. For the first 30 minutes or so The 6th Man is a great drama with some of the best basketball action you'll ever see. Antoine is a likable character and dies tragically. Kenny deals with his brother's death. A very heartbreaking story. It could have been a great drama if it had stuck to that. Then it violently switches to comedy, back to drama, and back to comedy so many times I am sure that is what turns off a lot of people. It doesn't turn me off, but it's one of the clear weaknesses. After the movie switches to a comedy you are given a lot of hit and miss jokes, mostly involving invisible Antoine doing poltergeist stunts and freaking people out. Some of the jokes are hilarious. Personally I love the scene where Antoine goes into the painting and kicks the guy fishing into the pond. Its undoing in the comedic aspect of this movie is that it goes back to the poltergeist stuff too often. It becomes repetitive and it takes away from the serious drama that we saw for the first 30 minutes. The basketball action in The 6th Man is among the best you will ever see. A lot of the actors in this movie were basketball players and went on to never act again. It shows both in the quality of their acting and the quality of the basketball. Travis Ford (Danny O'Grady) and Jack Karuletwa (Luther LaSalle) both put on lousy acting performances but were good on the court. Lorenzo Orr (Malik Major) also never acted again, but he seemed like he had potential as a comedic actor. The 6th Man is a very worth watching drama/comedy. The main undoing of the movie is that it seemed like it couldn't decide which one it wanted to be. As a fan of basketball, a fan of dramas, and a fan of comedies I can understand why I still enjoy watching this. It brings something to the table in all three areas.",
         "Released to coincide with the conclusion of the actual NCAA championships back in 1997, The 6th Man combines ghost and sports themes with poor results. Mixing special effects we've all seen before with the clichéd coming-back-from-an-impossible-position-in-the-final finale that has about as much uplifting excitement as the last coming-back-from, etc, that we all probably saw less than a month ago, it has only a couple of well-acted scenes, and a good chemistry between screen brothers Marlon Wayans and Kadeem Hardison in the early scenes, to recommend it. Marlon Wayans plays Kenny Tyler who, with his brother, Antoine (Kadeem Hardison,) form a formidable basketball partnership. Content to live in his flashy ball-hogging brother's shadow, Kenny suddenly finds himself thrust into the spotlight when Antoine dies unexpectedly, and soon finds himself struggling to perform. Only when Antoine returns in ghostly form do the Huskies team for which Kenny plays recover their old form and storm their way to the finals of the NCAA championship. Despite realising from the outset that this movie is going to follow a strictly formulaic path \u0096 the brother's coaching pop talks inspirational twaddle for the first five minutes, clearly marking himself out for an early grave \u0096 the movie is surprisingly quite effective in the early scenes when it concentrates on establishing the relationship between the brothers, and Antoine's untimely death (\"I'll come back\", he promises prophetically). But, upon Antoine's return, the movie abandons any pretence of pathos to subject us to an hour of largely unfunny poltergeist-lite hi-jinks both on and off the baseball court. Only Kenny can see his dead brother, so we get plenty of scenes in which he hugs the air, or twists himself into tortuous shapes as he and Antoine fight, much to the bewilderment of his team-mates and largely redundant romantic interest (Michael Michele). Barely funny the first time, by the end of the movie Wayan's mugging (he seems to be doing a Will Smith impersonation through most of the movie) soon proves to be extremely irritating. And Kenny and his mates are just a little late in finding the moral enlightenment to bar Antoine from helping them to win the championship by cheating. Getting to the final by having their ghostly sixth man stealing the ball from their competitors, or inhabiting their bodies, is fine it seems. But actually winning the final that way is a big no-no for some reason. Seems to me that when the revelation that, hey, cheating is wrong! finally sank into their thick skulls they would have forfeited the final as they shouldn't really have been there anyway. But this is a Hollywood movie, aimed at teens who, as every Hollywood producer knows, have no perceptive or critical faculties. There are two or three good scenes in this movie, which is damning enough; even more perverse is the fact that they're all the ones that are played straight. The 'comedy' here just doesn't work at all.",
         "Marlon Wayans plays Kenny Tyler and Kadeem Hardison plays Antoine his on screen brother, throughout this movie the two brothers are portrayed as an unstoppable basketball duo every since they were growing up. Due to such success in basketball both brothers earned a scholarship to play at the University of Washington. While at Washington the two lit up opposing teams scoring on them at will and carrying their team to success. Then just as quickly as their success together it fell apart and shattered and was never able to be reconnected. As Kenny and Antoine are running down court to perform their trademark alley-oop, and as Antoine is slamming the ball into the hoop his heart stops, and he collapse to the ground. He's rushed to the hospital in the hopes that they will be able to save him, unfortunately he dies of his heart attack on the way to the hospital. Once Kenny is informed about his death he becomes belligerent and has to be controlled by his fellow teammates and coaches. After Antoine's death the Washington Huskies go on a four game losing streak losing all four games by 20 points or more. After a team practice Kenny stays in the gym and breaks down and begins to break down and calls for his brother to come back to him and to help him. All the lights in the gym begin to flicker and a strong gust of wind begins to make its way through the gym. Antoine appears to Kenny, and Kenny becomes ecstatic he wants to call and tell every that his brother is back alive but then Antoine tells him that he's the only one that can see him, and that he will be with him for the rest of the season. There next game comes around and they next game comes and they win and they continue to win thanks to Antoine's help. He helps people to dunk when they never could before and helps them to make shots that they never could before. After they make it to the NCAA Tournament Antoine reveals himself to the team and they are very happy to have him back. After Antoine aids his former team to the National Championship game his former teammates along with his brother Kenny decide that they don't want Antoine's help anymore and they want to win this game by themselves, Antoine becomes infuriated and makes the lights begin to flicker and a tornado style wind to fill the gym as he storms away. The Antoine less, Huskies play the 1997 National Championship game and win, and become champions.",
         "While not as good as I hoped it would be, THE SIXTH MAN does deliver a few laughs. It wasn't the best movie I've ever seen, but it wasn't the worst. It could have been a little better if it didn't go for such cheap laughs and didn't depend so much on slapstick humor.",
         "After watching a very good game of cricket between Australia and England, it was 2 in the morning, and I wasn't interested in sleeping. After watching Tony Squires, Shane Lee and Kerry O'Keefe farewell the cricket for the night, I saw a movie starting titled \"The Sixth Man\". Being a fan of Marlon Wayans and his wacky comedy, I tuned in to watch, also being a fan of basketball and the NCAA. Kenny and Antoine Tyler (played by Marlon Wayans and Kadeem Hardison respectively) are two big-time players for the Washington University Huskies. Although Antoine is the captain and major star, his younger brother Kenny, is the play-maker at the point, and the two Tylers have their trademark alley-oop, which leaves opponents and the crowd in awe. After a huge alley-oop, in which Antoine suffers a heart-attack and dies on the way to the hospital, the team lose their spirit and give up the next four games by more than 20 points each. Kenny calls for his brother in the gym after a bad training session, begging for his help. After haunting him for a few minutes, Antoine appears in front of Kenny, and the two brothers are reunited. Kenny can't wait to tell his family and the team, but Antoine tells him that only he can see him. After Antoine helps the team to a few freak wins, and eventually, to the finals series, and after Kenny and Antoine let the team know of his presence, and they all learn that Antoine is no longer needed to help the team to victory. This movie is a story of heart and courage, and the story of a team who learn to use their hearts to achieve their goal. Marlon Wayans does a superb job at not only acting, but acting like a complete fool, which includes wrestling with himself, and giving himself really goofy faces. He's the black Jim Carrey, and he has a long future ahead of him.",
         "I saw this movie on a bus - a captive audience. The sound was too low and the screen was really small, but I still found it to be a touching comedy with a lot of heart. It was advertised as a zany \"ghost basketball player haunts brother - wackiness ensues,\" when it is actually a strong story of the relationship between two brothers who grew up as best friends and teammates, and what happens when one of their lives is tragically cut short.",
         "I enjoyed this movie thoroughly when I was a kid. I thought that is was very moving. Most movies claiming to be hardcore emotional haven't made me want to cry as much as this movie did. I think I'm going to rent it tonight just to see it again. I think it was funny as well. The rating it has received in here is a shame. It should be at least a 6, 7, or 8. The two brothers played well together and the basketball scenes were cool. This movie was good from beginning to end. Wayans was great and so was the other guy. Having brothers would make you enjoy this movie even more I'm sure. I would recommend this movie to anyone looking for a good sports movie with a lot of heart.",
         "There's nothing more worst then losing a sibling especially with one you grew up with. This movie is real touching especially when the teammates gave a moment of silence and hung up his jersey. A real tear-jerker. Then it became humorous when they were winning games by the help of Antione's ghost and kidding around with his younger brother. The movie is often silly at times but enjoying."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "All Net Productions",
         "Mandeville Films",
         "Touchstone Pictures"
      ],
      "summaries": ["Antoine and Kenny Tyler are NCAA college basketball players, and Antoine is the star. Suddenly Antoine dies of heart attack and Kenny has to fill his shoes as leader of team. Some time later, Antoine returns as a ghost and helps Kenny in game and in life, but Kenny changes in the process and doesn't quite like it."],
      "budget": 11000000
   },
   "movielensId": 6425,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-03-28",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Randall Miller"],
      "runtime": 107,
      "movieId": 6425,
      "title": "The Sixth Man",
      "mpaa": "PG-13",
      "actors": [
         "Marlon Wayans",
         "Kadeem Hardison",
         "David Paymer",
         "Saundra McClain",
         "Harold Sylvester",
         "Kevin Dunn",
         "Octavia Spencer"
      ],
      "imdbMovieId": "0120142",
      "originalTitle": "The 6th Man",
      "genres": [
         "Fantasy",
         "Drama",
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Antoine and Kenny Tyler are NCAA college basketball players, and Antoine is the star. Suddenly Antoine dies of heart attack and Kenny has to fill his shoes as leader of team. Some time later, Antoine returns as a ghost and helps Kenny in game and in life, but Kenny changes in the process and doesn't quite like it.",
      "tmdbMovieId": 36807,
      "avgRating": 2.77094,
      "releaseYear": "1997",
      "numRatings": 406,
      "posterPath": "/jJIoI6r8oYkgzllp85nXVW8cEDR.jpg"
   }
}