{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "alcatraz",
            "id": 3859
         },
         {
            "name": "reporter",
            "id": 12193
         },
         {
            "name": "malaya",
            "id": 178643
         },
         {
            "name": "1940s",
            "id": 207883
         }
      ],
      "imdb_id": "tt0041622",
      "video": false,
      "title": "Malaya",
      "recommendations": [],
      "backdrop_path": "/xqyEUTcOEkG5d1jf4FZ2iIKD2H6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Carnaghan",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fe9dd",
               "name": "Spencer Tracy",
               "profile_path": "/vnLAbTFBcKJcNfxQYwTImzZSext.jpg",
               "id": 12147,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John Royer",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fe9e1",
               "name": "James Stewart",
               "profile_path": "/aBLtt0Sl4AZVNclzFrXzbndRzux.jpg",
               "id": 854,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Luana",
               "gender": 1,
               "credit_id": "52fe466ec3a36847f80fe9f1",
               "name": "Valentina Cortese",
               "profile_path": "/dp4DfS9wO2cmaHWsmPNC7cHPTOM.jpg",
               "id": 24499,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "The Dutchman",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fe9f5",
               "name": "Sydney Greenstreet",
               "profile_path": "/4t3Aaj47DDEb4EWzFXiVM4XMsJN.jpg",
               "id": 4114,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Kellar",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fe9f9",
               "name": "John Hodiak",
               "profile_path": "/kmnFq5BoFWILFfFQ4nDsYx5iu7e.jpg",
               "id": 85437,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "John Manchester",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fe9fd",
               "name": "Lionel Barrymore",
               "profile_path": "/5BsoVPE4FBzmiRsPQK14LdcbGCK.jpg",
               "id": 17753,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Romano",
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fea01",
               "name": "Gilbert Roland",
               "profile_path": "/ofMih1UHoO2zXXbBhtxRLB66xev.jpg",
               "id": 29273,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Bruno Gruber",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fea05",
               "name": "Roland Winters",
               "profile_path": "/qYU5Z3pS6Ac9EK5fB68bamsJTmL.jpg",
               "id": 83822,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Colonel Genichi Tomura",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fea09",
               "name": "Richard Loo",
               "profile_path": null,
               "id": 10344,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Carlos Tassuma",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fea0d",
               "name": "Ian MacDonald",
               "profile_path": "/k4iNtPUa3simoTQwgzyVigoyxwm.jpg",
               "id": 4074,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Matisson",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fea11",
               "name": "Tom Helmore",
               "profile_path": "/gQdVpqYmetgOIH499Fe3xBLsj56.jpg",
               "id": 5731,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Lt. Glenson (uncredited)",
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fea15",
               "name": "DeForest Kelley",
               "profile_path": "/fUL1BY8XjLsQihueDD1UUAm0Qy6.jpg",
               "id": 1750,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Naval Officer with Businessmen (uncredited)",
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fea19",
               "name": "Frank Wilcox",
               "profile_path": "/m4RmuaNVzSFoPB3pj58eJvaIR2X.jpg",
               "id": 34625,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Army Sergeant (uncredited)",
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fea1d",
               "name": "Robert Williams",
               "profile_path": "/lFO6YQPH0byE6A7X5eF5FErc61V.jpg",
               "id": 120070,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe466ec3a36847f80fe9d9",
               "name": "Richard Thorpe",
               "profile_path": "/szbaqa5qggPXjaLbNGb2JMgsoi3.jpg",
               "id": 70862,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fe9e7",
               "name": "Manchester Boddy",
               "profile_path": null,
               "id": 135364,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe466ec3a36847f80fe9ed",
               "name": "Frank Fenton",
               "profile_path": "/9buhIacgh5xkBCvWCK5lLhIgZ6.jpg",
               "id": 20097,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a79c1870e0a26598202787b",
               "name": "Edwin H. Knopf",
               "profile_path": null,
               "id": 89906,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a79c1979251417757024b38",
               "name": "Bronislau Kaper",
               "profile_path": null,
               "id": 14861,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a79c19fc3a3682255028b1a",
               "name": "George J. Folsey",
               "profile_path": null,
               "id": 12307,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a79c1a6c3a368226102217f",
               "name": "Ben Lewis",
               "profile_path": null,
               "id": 22599,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a79c1ad0e0a26598502774e",
               "name": "Malcolm Brown",
               "profile_path": null,
               "id": 9059,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5a79c1b20e0a265991027591",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5a79c1b8c3a3682273026751",
               "name": "Edwin B. Willis",
               "profile_path": null,
               "id": 9063,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5a79c1c1c3a368227b0293d8",
               "name": "Sergei Petschnikoff",
               "profile_path": null,
               "id": 1612835,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5a79c1d1c3a368225b0221b5",
               "name": "Bert Glazer",
               "profile_path": null,
               "id": 1539054,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.676486,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43962,
      "vote_count": 3,
      "budget": 0,
      "overview": "After living abroad for several years, journalist John Royer returns to the United States just after the U.S. enters World War II. His boast that he could easily smuggle rubber, a key wartime natural resource, out of Malaya has him tasked with doing just that. He manages to get someone from his past, Carnaghan, sprung from Alactraz and together they head off to South East Asia posing as Irishmen. Once there, Carnaghan lines up some of his old cronies and with Royer and a few plantation owners plans to smuggle the rubber out from under the Japanese army's watchful eye.",
      "similar": [
         423,
         424,
         9045,
         1771,
         5925,
         14574,
         637,
         228150,
         289222,
         15764,
         369885,
         21876,
         821,
         409,
         857,
         2253,
         203833,
         16869,
         289,
         613
      ],
      "original_title": "Malaya",
      "runtime": 98,
      "poster_path": "/zZxal0Q4i78LKd04kuxxBIITKjF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1949-12-27",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Richard Thorpe"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Frank Fenton",
         "Manchester Boddy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041622/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgwNzI1NDA3MV5BMl5BanBnXkFtZTcwMTIxOTIxMw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Spencer Tracy, James Stewart, Valentina Cortese | See full cast and crew »"],
      "reviews": [
         "Malaya may seem a fantastic tale, but the story actually has quite a bit of truth to it. When World War II broke out the Japanese quickly conquered most of the rubber producing areas of the world. The modern mechanized army does run on rubber and both the USA and Germany developed types of synthetic rubber to be used. My mother told me during World War II there were all kinds of drives for recyclable material and among the most valuable was rubber. People contributed all kinds of old tires for the war effort. Lionel Barrymore plays the real life Manchester Boddy who was publisher of the Los Angeles Daily News who was the prime mover in the scheme you see portrayed here in Malaya. Though this story is fictional, the need for rubber in the USA was critical at the time and there was in fact a rubber smuggling operation going on. Spencer Tracy before he came to MGM played just the kind of two fisted action heroes at Fox which was his original studio. He expressed an interest in doing this kind of film for old time sake and got cast in it. He really isn't poaching on Humphrey Bogart's territory these were the kind of roles he originally did in film while Bogey was playing hoods over at Warner Brothers. Because the script called for a buddy team of heroes, James Stewart was approached and he even conceded top billing to Tracy. According to the Films of James Stewart, he admired Tracy as an actor so much that he was grateful just for the opportunity to work with him again. In fact Stewart's first film role was in Murder Man, a film that starred Spencer Tracy back in 1935. With the two of these big stars in the leads, MGM was able to recruit a really outstanding group of players like John Hodiak, Valentina Cortese, Roland Winters, Richard Loo, the aforementioned Lionel Barrymore and my two favorites Gilbert Roland and Sydney Greenstreet. Roland was shortchanged though. Watching Malaya I could tell his role as Tracy's adventurous friend was left on the cutting room floor. But even a little Gilbert Roland is always a pleasure to watch. This was Sydney Greenstreet's last film and in it he essentially reprises the part of Ferrari in Casablanca. He's got the best lines in the film and his scenes with his cockatoo are classic. As he says, he's just a saloon keeper with an access to gossip. Which gets put to very good use. Stewart the idealist, Tracy the cynical realist. Too bad they didn't work together more.",
         "Stewart gets Tracy out of jail to steal rubber from the Japs in Malaya during WWII. Not too much violence for a war movie but loads of adventure and twists. Obviously they'll succeed but not without a lot of conflict and action. The kind of movie you'll want to see several times because it's one of the best war movies ever made. Excellent acting, dialog, cinematography and direction. About the best actors possible to get into one movie. Wish it was on video tape.",
         "Spencer Tracy and James Stewart preside over a terrific cast in \"Malaya,\" a 1949 film also starring Valentina Cortese, Sydney Greenstreet, John Hodiak, Lionel Barrymore, Roland Winters and Gilbert Roland. This is a fictional account of a very real situation involving the shortage of rubber during World War II. Japan really dominated the countries that had the rubber, and there was smuggling of rubber to the U.S. The situation involving Tracy and Stewart, however, never happened. Tracy plays a con named Carnahan, whom the government releases from Alcatraz in order to spearhead this project, and Stewart plays John Royer, a former reporter with a shady enough past that the government (represented by John Hodiak) thinks he's a good bet to go into Malaya and smuggle tons of rubber out of that country and pay with gold. Carnahan knows the country like the back of his hand and has the connections. He and Royer pose as Irish sailors looking for work in order to get around a suspicious Colonel Tomura (Richard Loo) while they are helped by an old friend of Carnahan's, The Dutchman (Sydney Greenstreet). Cortese has the Dietrich role, that of a singer in love with Carnahan. There are some exciting scenes in this film, and it holds one's attention. One of the best performances comes from Gilbert Roland, who leads the smugglers handpicked by The Dutchmen. He's very convincing. As for Tracy and Stewart, well, although Tracy started out in tough guy Wallace Beery roles, 1949 was a little late for him to be taking them up again. Actually Hodiak would have been good, or Bogart, or John Wayne, Jimmy Cagney, someone along those lines. I thought Stewart was very good and that the two of them made an effective team. Someone said he came off as a nice guy. I thought he did cynic and hardboiled well. You can be cynical and hardboiled and averse to physical violence. All in all, pretty good.",
         "There is a scene that makes the whole picture worthwhile (although it is otherwise pretty ordinary): Sydney GREENSTREET is entering a room after app. 2/3 of the movie, where Spencery Tracey has just been \"treated kindly\" in an \"interview\", Greenstreet is sweating (as always), sitting down and looking at the molestor of Tracy, then says (roughly): \"If you say this was necessary, then of course it was necessary, but wasn't that much for a bottle of poor booze?\". The officer say: \"But he broke our rules\". Greenstreet: \"A man who drinks and then doesn't break any rules is no man. Drinking and making troubles goes together, this is also a rule.\" What a line !! Officer: \"I love your logic.\" Of course these are not exactly the lines from the picture, cause I saw the German dubbed version and re-translated them, but they can only be better in the English version. Hilarious! Tape it, when shown on TV next time and get to that scene, it is just great!",
         "Just by chance I was home to catch this terrific movie when it was shown a few days ago on cable TV...what a happy surprise! Both Stewart and Tracy play \"good-bad guys\" whose inner morality and patriotism rises to the top when the going gets tough. The supporting cast is full of top talent, including super performances from John Hodiak, Sidney Greenstreet, and Lionel Barrymore. Richard Loo and Gilbert Roland both play brilliantly to their \"type\" and are fine as well, and Roland Winters (usually in pompous comic roles) is very effective as a German rubber plantation owner who should not be trusted! Look for the always-welcome Russel Hicks in the scene on the train, and savor the sound of his elegant voice. In addition, the script by Frank Fenton is way above average, with very droll and off-hand wit in evidence throughout. All in all, a first-rate movie which deserves to be much better known!",
         "If this movie did not have Jimmy Stewart and Spencer Tracy, the film wouldn't have even merited a score of five. It was a very uninspiring and forgettable wartime film made several years after the war actually ended. It just seemed like all the energy was missing from the film. In fact, about the only energy came from Sidney Greenstreet's pet bird--now that bird can act! Another problem with the film is the idea of casting Spencer Tracy in the role of a selfish, devil-may-care smuggler in Alcatraz at the beginning of the film. The believability of the performance didn't improve once he made it to Malaya. This is actually the sort of role I might have expected for Clark Gable or maybe even Errol Flynn (yes, I know he was with a different studio), but for Tracy, an actor who often was cast as the priest or nice guy, it just wasn't terribly convincing. Plus, he just acted too nice to be as seedy as they described him as being. In the end, the only interesting thing about this film is how so much money was spent on the cast and so little bang was achieved for MGM's buck. This is purely a time-passer or film for those devotees of Stewart or Tracy.",
         "I'm an American ex-pat living in Malaysia, so I thought I'd watch this to see if there were any old scenes of life in Malaysia in the late 40's. Well, as I expected, there weren't, BUT the actual movie and story were really well done and interesting. I thought the dialog in this movie was the best I have heard from this era. I watch a lot of \"noir\", and this dialog was more realistic with a flair that wasn't overdone. For example, the interaction between Spencer Tracy and his girl wasn't flowery or sappy, it was kind of hip and snappy without being too \"40's\". Also, every line out of Greenstreet's mouth was sublime. Casting was awesome! It seemed like everybody was perfect for their role. Greenstreet was fantastic as an almost omnipotent bar owner. Tracy was rough and rugged. Stewart was convincing as a sort-of-drifter that finally finds purpose in his life. Plus, you get a cameo of Lionel Barrymore, which is worth it's weight in gold. This is a \"feel good\" movie about losers and dregs of society helping to win the war. It's tough, violent, and not everybody gets out alive. And, it's patriotic without being sappy. Watch this one on the Fourth of July, and you can't go wrong!",
         "This movie is about how close the U.S. war effort (and it's \"arsenal of Democracy\" image) came to faltering in 1942. The U.S. has been blessed with many natural resources that other country's don't have. Oil for example, or iron ore and steel. Or even huge forests of trees. But we are not a nation with huge stores of rubber. We are dependent on rubber supplies from abroad. Oddly enough one man had tried to counter this. In the teens of the 20th Century, Thomas Edison had become a close friend to Harvey Firestone, the tire king. Firestone had huge rubber plantations in Liberia, but was aware of the dangers to his shipping of rubber in World War I. He discussed the possibility of an alternative to rubber in the U.S. with Edison. It was the Wizard of Menlo Park's last big project, occupying his life until 1931 when he died. He found that golden rod came closest to being a viable substitute. But little was done with this discovery. In 1942 our rubber was coming from three areas of the globe, and none were next door to us. They were in Liberia and Brazil, both of which were across the Atlantic Ocean to the east or to the south. Nazi u-boats were making shipments from these areas difficult. The third was from southeast Asia, principally from French Indo - China or from Malaya and Indonesia. The movie RED DUST dealt with the rubber plantations in French Indo - China in the 1930s. The Japanese had these plantations and the ones in Malaya and Indonesia in their control from December 1941 onward. To counter the emergency, a rubber-collecting drive occurred across the country (similar to tin and metal drives that children got involved in). But the U.S. government was quick to organize any method to get the rubber that was in Japanese hands. This movie dealt with the scheme that was planned that involved smuggling Rubber out of Malaya. Lionel Barrymore is John Manchester, the editor of the LOS ANGELES RECORD (based on Manchester Boddy). He has gotten Jimmy Stewart, a reporter with a mixed record, to the U.S. Stewart knows about a way to get huge supplies of rubber to the U.S. under the nose (theoretically) of the Japanese. The plan requires the government springing his former friend Spencer Tracy, a big time smuggler, out of Alcatraz. With Tracy Stewart would go to Malaya (with papers showing they are sailors from the neutral Eire - Irish Free State - of Eamon DeValera). They would hook up with Tracy's old friend \"the Dutchman\" (Sidney Greenstreet) and he would help find the local wharf rats (including Gilbert Roland) to assist the matter. They would have unlimited American gold to get the men they need, and to bribe the three largest plantation owners in the area (Tom Helmore, Ian MacDonald, and Roland Winters). To sweeten the operation for Tracy, who will get a free pardon for his help, he is reunited with Valentina Cortesa - his girlfriend who works in Greenstreet's saloon. The film follows the whole operation, which (on the whole) is working well enough - but has it's dangers. The local Japanese Colonel is Richard Loo, who is suspicious (if dismissive) of westerners, and he soon zeros in on Tracy and Stewart as distinctly odd figures. And one of the three plantation owners, Winters, is a German. He is a greedy man, but he may be closer to the Japanese than the allies. The film works pretty well. My only complaint is the seeming waste of John Hodiak, who is a Federal agent and is seen for twenty minutes at the start of the film, but only turns up at the tail end of it to deliver a medal (I won't say to whom). This was Sidney Greenstreet's last movie, and he does look a trifle ill, but he certainly maintains his best standards - as a philosophical gent who knows how to safely balance his friendship with Tracy and his \"necessary\" friendship with Loo (his relationship with Loo, regarding gambling in his saloon, is similar to that of Rick Blaine with Captain Louis Renault in CASABLANCA). Winters plays his few scenes as an untrustworthy type well. Cortesa has a few good scenes with Tracy, including one where he has to forcibly cause her to leave him when she does not want him. Stewart's character believes in maintaining his own counsel. At the beginning he seems a hard bitten reporter who has seen the world and skirted the edge of the law a bit. He is cynical. Only later do we realize that a family tragedy has made him less cynical and more patriotic than we realized.",
         "This is a Classic film that can be seen over and over again. Spencer Tracy, \" Devil at 4 O'Clock,'61\", gave an outstanding performance trying to obtain rubber from a jungle infested with the Japanese Army during WWII and working hand in hand with his buddy James Stewart,\"The Shootist\",'76, in order to accomplish their mission with romance and plenty of action. Sydney Greenstreet,\" The Woman in White\",'48 gave his last performance in this film and played the owner of a cafe and lived up to a great supporting role. This entire picture had great supporting actors, Barrymore, Roland and Winters. If you love Classic films, don't miss this one!",
         "It's early 1942. Jimmy Stewart is a reporter recently returned from Southeast Asia, soured because his brother was killed on Wake Island. He's enlisted by the feds to smuggle three hidden hordes of rubber out of Malaya, but he needs the help of a former companion, Spencer Tracey, whom he sent up the river by selling a scandalous newspaper story. The fed arrange for Tracey's release. Tracey is ensconced in Alcatraz. He's brought to the warden's office and meets Stewart for the first time since his betrayal. \"Well, well, well!\", says Tracey, all smiles, as he walks up to Stewart and punches him on the jaw. Still smiling, Tracey cradles Stewart's face lovingly in his hands and says, \"I didn't really let that one go, you know,\" and then pinches his cheek like a baby. That pretty much sets the tone of the rest of the picture. Fifteen minutes with the embittered and determined Stewart and the rest of the film belongs to Tracey. It isn't that Stewart's performance is in any way inadequate. But his role has little in the way of dimension. He's played cynical and unpleasant types before, up to and including \"Rear Window.\" This is an extension of the same character. Tracey is marvelous. Here, he's a man of impulsive action and pragmatism, selfish. And he was only one year away from playing the sentimental role of the \"foxy grandpa\" in \"Father of the Bride.\" If this had been made in 1942 instead of 1949, it could easy have been a cheap flag-waver. The Japanese -- Richard Loo, a Hawaiian-born Chinese -- are still treacherous and a little fanatic. The plot is a thing of shreds and patches. Stewart and Tracey are going to save the US rubber industry by smuggling out a couple of boat loads of rubber -- one hundred and fifty thousand tons carted along a small river in small boats, without the Japanese army of occupation noticing the strange activity. But it's not nearly as bad as it might sound. The direction is efficient, the performances alone would save the film if nothing else did, and the dialog has some keen edges to it, even during dull scenes of Tracey and Valentina Cortese murmuring to each other about their mutual love. Sidney Greenstreet adds a flaccid stability. And Richard Loo is hilarious as Colonel Tomura. A few feet of location footage aside, as well as some shots of PT boats I swear was lifted from \"They Were Expendable,\" it was all shot on the MGM lot. All the white men wear white suits. (No pith helmets, and I wept at their absence.) Tracey and Stewart hire the usual movie-style riff raff in colorful and raggedy outfits to man the boats that will carry the smuggled rubber. Enjoyable. Not the stupid plot but its execution."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "After living abroad for several years, journalist John Royer returns to the United States just after the U.S. enters World War II. His boast that he could easily smuggle rubber, a key wartime natural resource, out of Malaya has him tasked with doing just that. He manages to get someone from his past, Carnaghan, sprung from Alactraz and together they head off to South East Asia posing as Irishmen. Once there, Carnaghan lines up some of his old cronies and with Royer and a few plantation owners plans to smuggle the rubber out from under the Japanese army's watchful eye.",
         "Newspaperman Royer convinces government officials of a plan to obtain rubber by stealing it out from under the Japanese. Carnahan is let out of prison to help."
      ],
      "budget": 0
   },
   "movielensId": 64365,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-12-27",
      "dvdReleaseDate": null,
      "directors": ["Richard Thorpe"],
      "runtime": 98,
      "movieId": 64365,
      "title": "Malaya",
      "mpaa": "",
      "actors": [
         "Spencer Tracy",
         "James Stewart",
         "Valentina Cortese",
         "Sydney Greenstreet",
         "John Hodiak",
         "Lionel Barrymore",
         "Gilbert Roland",
         "Roland Winters",
         "Richard Loo",
         "Ian MacDonald",
         "Tom Helmore",
         "DeForest Kelley",
         "Frank Wilcox",
         "Robert Williams"
      ],
      "imdbMovieId": "0041622",
      "originalTitle": "Malaya",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["sLwe9o06iac"],
      "plotSummary": "After living abroad for several years, journalist John Royer returns to the United States just after the U.S. enters World War II. His boast that he could easily smuggle rubber, a key wartime natural resource, out of Malaya has him tasked with doing just that. He manages to get someone from his past, Carnaghan, sprung from Alactraz and together they head off to South East Asia posing as Irishmen. Once there, Carnaghan lines up some of his old cronies and with Royer and a few plantation owners plans to smuggle the rubber out from under the Japanese army's watchful eye.",
      "tmdbMovieId": 43962,
      "avgRating": 2.16667,
      "releaseYear": "1949",
      "numRatings": 3,
      "posterPath": "/zZxal0Q4i78LKd04kuxxBIITKjF.jpg"
   }
}