{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "riddle",
            "id": 483
         },
         {
            "name": "amnesia",
            "id": 1453
         },
         {
            "name": "wife",
            "id": 4183
         },
         {
            "name": "plastic surgery",
            "id": 4585
         },
         {
            "name": "head physician",
            "id": 5406
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "private detective",
            "id": 155790
         }
      ],
      "imdb_id": "tt0102900",
      "video": false,
      "title": "Shattered",
      "recommendations": [
         83489,
         42176,
         42158,
         39140,
         18495,
         250622,
         54613,
         27224,
         19345,
         32035,
         41385,
         73249,
         33374,
         38132,
         16214,
         45225,
         13526,
         19507,
         13715,
         21332
      ],
      "backdrop_path": "/iG2szX3DQkdlGZTYsencb9s6Px.jpg",
      "revenue": 11511031,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Dan Merrick",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419b7",
               "name": "Tom Berenger",
               "profile_path": "/gueEBgqv1sWFemMXyI4TJ2peuMA.jpg",
               "id": 13022,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Gus Klein",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419bb",
               "name": "Bob Hoskins",
               "profile_path": "/mIgAC6q5HcHHxZUIiCOvE6mHLGs.jpg",
               "id": 382,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Judith Merrick",
               "gender": 1,
               "credit_id": "52fe4332c3a36847f80419bf",
               "name": "Greta Scacchi",
               "profile_path": "/uHPHNwBnhBIs1z2sJcKQODtaY2n.jpg",
               "id": 21245,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Jenny Scott",
               "gender": 1,
               "credit_id": "52fe4332c3a36847f80419c3",
               "name": "Joanne Whalley",
               "profile_path": "/fvufjTvUcY6ctqryO5sks0XDav2.jpg",
               "id": 12656,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Jeb Scott",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419c7",
               "name": "Corbin Bernsen",
               "profile_path": "/c9Y2SKgC3S6LJNq7WKcoauY88kg.jpg",
               "id": 21246,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Nancy Mercer",
               "gender": 1,
               "credit_id": "52fe4332c3a36847f80419cb",
               "name": "Debi A. Monahan",
               "profile_path": null,
               "id": 21247,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Rudy Costa",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419cf",
               "name": "Bert Rosario",
               "profile_path": null,
               "id": 21248,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Sadie",
               "gender": 1,
               "credit_id": "52fe4332c3a36847f80419d3",
               "name": "Jedda Jones",
               "profile_path": "/t8wtxbuOX01UcSt8C5pRQWQEQXC.jpg",
               "id": 21249,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Jack Stanton",
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419d7",
               "name": "Scott Getlin",
               "profile_path": null,
               "id": 21250,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041983",
               "name": "Wolfgang Petersen",
               "profile_path": "/t3Fxy4SBeOWj8T8TZbhwz3jlWAF.jpg",
               "id": 5231,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4332c3a36847f8041989",
               "name": "Richard Neely",
               "profile_path": null,
               "id": 21241,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f804198f",
               "name": "Wolfgang Petersen",
               "profile_path": "/t3Fxy4SBeOWj8T8TZbhwz3jlWAF.jpg",
               "id": 5231,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f8041995",
               "name": "John Davis",
               "profile_path": null,
               "id": 2043,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f804199b",
               "name": "David Korda",
               "profile_path": null,
               "id": 21242,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419a1",
               "name": "Wolfgang Petersen",
               "profile_path": "/t3Fxy4SBeOWj8T8TZbhwz3jlWAF.jpg",
               "id": 5231,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419a7",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419ad",
               "name": "Glenn Farr",
               "profile_path": null,
               "id": 21244,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419b3",
               "name": "Hannes Nikel",
               "profile_path": null,
               "id": 5242,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4332c3a36847f80419dd",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.14114,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2071,
      "vote_count": 42,
      "budget": 22000000,
      "overview": "Dan Merrick comes out from a shattering car accident with amnesia. He finds that he is married to Judith who is trying to help him start his life again. He keeps getting flashbacks about events and places that he can't remember. He meets pet shop owner and part time private detective Gus Klein who is supposedly done some work for him prior to the accident. Klein helps Merrick to find out more...",
      "similar": [
         9411,
         521,
         6637,
         2502,
         2059,
         1018,
         949,
         189,
         431,
         281,
         1903,
         1996,
         207932,
         681,
         336843,
         1073,
         910,
         1939,
         8834,
         85
      ],
      "original_title": "Shattered",
      "runtime": 98,
      "poster_path": "/q7AAPZtD1APYACKeMc1TEU0g0KT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Palace Pictures",
            "id": 927,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1991-10-11",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wolfgang Petersen"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Richard Neely",
         "Wolfgang Petersen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102900/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2NDA0ODQ1M15BMl5BanBnXkFtZTcwNDc0MTgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tom Berenger, Bob Hoskins, Greta Scacchi | See full cast and crew »"],
      "reviews": [
         "With a maze of plot twists and surprises, \"Shattered\" is one heck of a guesser. The plot follows Dan Merrick (Tom Berenger) after a horrifying car accident. He suffers from amnesia, and must piece his life together post-accident. As he learns more and more about his past, his life spins out of control, leaving the most horrifying revelation for the end. \"Shattered\" is carefully constructed and directed by Wolfgang Peterson. His cast really brings this one together, with great performances by Berenger and Bob Hoskins. It is simply impossible to guess the events in this film as you are watching it, and it is best to go into it knowing as little as possible. \"Shattered\" is an excellent effort and film that has been wrongly ignored over the years since its release. This is a great rental for a cold and rainy Saturday night. Grade: A",
         "This is a film which I have recommended on many a Friday night when all the new releases are already gone and others are looking for a good mystery/suspense title. I have seen it 3-4 times which is rare for me, especially for a mystery. It is fine entertainment with an excellent story. Not the highest production value, but it's unique story makes up for it. Highly recommended, especially on a weekend night when there just aren't any NEW mystery/suspense releases on the shelf.",
         "Petersen's skillful direction and a cleverly constructed script combine to make this a thoroughly entertaining and absorbing thriller. On the first viewing, you're likely to dismiss the shocking and unpredictable ending as \"far-fetched\" and \"unbelievable\" (at least that's what I did), but see it again and you'll realize that the story DOES stand up to scrutiny; there are no scenes that cheat the viewer here. Bob Hoskins steals the show as the likable private detective. And overall, this a movie worth seeing. (**1/2)",
         "Dan Merrick (Tom Berenger) and his wife Judith (Greta Scacchi) are involved in a car wreck that leaves Judith with only a scratch but Dan in critical condition that involves restructuring his face to look as much as possible like the old face. Dan has one other serious problem, the shock has left him with amnesia. He tries to put his life back together with the help of his wife but nothing seems real. In trying to piece together his former existence, he tracks down all types of hunches and leads that take him nowhere. Then one day he comes across a strange bill for $7,000 from a pet shop. When he investigates further he discovers that the pet shop owner, Gus Klein (Bob Hoskins), moonlights as a private eye. Gus tells him all kinds of strange happenings including a story about his wife's lover. He also learns that his business partner's wife Jenny Scott (Joanne Whalley) is much closer to him than he wants her to be. As Gus and Dan search for clues, they find more than either one bargained for. The ending is a grabber. The viewer won't be disappointed. Director Wolfgang Petersen of \"Das Boot\" fame directs with a flair for action and suspense. There is a wild car chase toward the end of the movie that really delivers the goods. Though Petersen's film (which he wrote based on a novel) may not exactly be film noir, it shares several elements in common with that genre including two femme fatales. There is also symbolic use of natural forces such as the pounding of the waves against the shore to enhance portions of the script, which may or may not have been inspired by the 1942 film noir picture \"Street of Chance.\" All the acting is above average, but the standout performance is by Bob Hoskins as the PI who loves animals. There are also bits of humor from a pet shop employee, Sadie (Jedda Jones), over the phone when called asking for Gus.",
         "This movie has got to be the best surprise I've ever gotten from a last second pick at the video store. The first time I saw this movie was in college, we watched it one night and it continued to be shown in our apartment almost non-stop for the next 4 days. People could not get enough of it. I won't go into the plot, etc. but will tell you it offers many twists and turns and will keep you interested and surprised at the end. You cannot go wrong renting this movie!",
         "Pretty clever mystery that will leave you gasping when the shocking twist is revealed. Tightly woven together, Wolfgang Peterson delivers a smart story about Dan Merrick, a San Francisco businessman who can't remember his past after surviving a horrific car crash. While recovering at his lovely secluded home, Dan discovers his adoring wife Judith, played by Greta Scacchi, is cheating with another man. Dan sets forth to discover that all is not what is seems to be. Bob Hoskins as Gus, the pet shop owner / part time private eye, gives a wonderful performance as well as Joanne Whalley, who knows much more than she ever wanted to know about Dan. Slick scoring by Alan Silvestri, knock out sets, and direction make this mystery / thriller a winner!",
         "The feel of this film rings of a late 1970's early 1980's action-drama TV show, like \"Hart to Hart\", \"Charlie's Angels\", or even \"Dallas\", particularly because of the location shots and the music. The scenes alternate between million-dollar mansions, ritzy hotels, billion-dollar corporations, and rural locales. And the lush strings always emerge when the characters are driving through some mountainous areas. I kept thinking that Jaclyn Smith would turn up at any moment. The opening premise is quite a stretch: Tom Berenger as Dan Merrick survives after having plunged about 6000 feet off the road in his car. It's a miracle that his legs didn't end up in the glove compartment. Despite being more or less still intact, Merrick's face has been crushed into hamburger, and he can't remember who he is or what happened to him after he awakens from a coma. His wife Judith (Greta Scacchi) is only a little scratched up after the ordeal. She nurses him back to health and tries to help put the puzzle pieces back into his \"shattered\" memory. He finds out he's a rich commercial real estate developer with a house with its own zip code. His office at the TransAmerica building in San Francisco is bigger than the average person's apartment. And he has a beautiful secretary who must have just finished a stint as a cover model for Vogue. And his colleague is the kind of guy who uses the old \"two shooter\" gesture while saying \"We'll do lunch.\" That would be a nightmare! But other pieces do not come together so easily, like why, before the accident, did he hire a private investigator (Bob Hoskins) who fronts as a pet store owner? And why did this guy's invoice end up at the development company? At one point, he thought he had bought $7000 worth of pets! (With that kind of money he could have gotten the equivalent of Magnum PI.) The film becomes a kind of noir mystery in which Merrick tries to put the pieces of his life back into perspective all the while trying to figure who he can trust. Although some of the writing and circumstances were a little hard to swallow, the movie sort of gets better as it goes along. And a great performance by Berenger holds the story together more or less. At every moment, despite its short-comings, you want to find out what happens next. And a dynamite ending that is worth the wait and the price of admission, $5 for the DVD at Fry's.",
         "The very good first hour hooked me into watching the whole movie, something I doubt I would do a second time. That first hour was interesting and led to a very suspenseful but totally implausible ending. There were just too many holes in the theory that a man suffering from amnesia could be surgically made to look exactly like the man he killed. Then, he also would actually believe that he was that person! Huh? Yeah, I know. It sounds goofy, and it is pretty hard to swallow. Anyway, the leads are interesting with Tom Berenger as \"Dan Merrick,\" Greta Scacchi showing off her form as \"Judith Merrick,\" and Bob Hoskins is the likable private detective \"Gus Klein.\" Actually, Berenger was not fun to hear speak in the last 35 minutes, using the Lord's name in vain 11 times in that short stretch.",
         "I really like this movie a lot. For a few years, it looked like Greta Scacchi was really going to become a major sex symbol. I wonder what happened. I do have one big complaint -- not about the movie itself but about the IMDb page. As of today, if you look under quotes, the very first quote completely gives away the secret of the movie. I hope something can be done about that. I'm not really giving a spoiler, just pointing one out that's already there. Tom Berenger and Bob Hoskins are excellent. Corbin Bernsen is OK in a Corbin Bernsen sort of way. Good story, great twist. I'd recommend it to anymore, but please, get rid of that spoiler.",
         "Late one night, I found myself working late in my college apartment, studying or trying to study for Spanish and it just so happened that I also had the TV on (which I wasn't really paying much attention to) when I just happened to look up and see that a new movie was starting called \"Shattered\". Seeing that it was directed by Wolfgang Petersen, I became a little curious but didn't really plan on watching it. Well, that thought went out the window when the movie opened with a bang. Husband and wife Dan and Judith are involved in a devastating car crash. But despite all odds, both survive; however the husband (played by Tom Berenger) is in critical condition and is left with no memory of who he is or what happened. His seemly loving wife (Greta Scacchi) does everything she can to help him readjust after getting out of the hospital but, alas, something just doesn't seem right. He slowly begins to realize that everything may not have been as rosy as his wife would have him believe and things get even more interesting when he learns that he paid for services by a street wise private detective named Gus (played by Bob Hoskins). \"Shattered\" is one of those unassuming movies that, going in, you're not expecting to find anything too shocking or surprising and that's where you'd be wrong. I've seen a lot of thrillers and mysteries, so much so that eight out ten times, I can probably tell you what the ending will be. However, I got to tell you, the twist at the end of this movie is so well done and so shocking that I didn't see it coming for a million miles, and believe me, that's saying something. The movie also does a good job drawing you, the viewer, deeper and deeper into the movie without even realizing it with the direction of Petersen, the story, and the actors; Tom Berenger does an excellent job in his role, as does Greta Scacchi. However, my favorite actor out of this is probably Bob Hoskins, since he's able to provide a little bit of comedy and heart to his role. If you're one who's looking for a lost gem of a film or is just looking for a good surprise at the end, then I highly, highly recommend \"Shattered\". You won't regret it!"
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Capella International",
         "Davis Entertainment",
         "Palace Pictures"
      ],
      "summaries": [
         "Dan Merrick comes out from a shattering car accident with amnesia. He finds that he is married to Judith who is trying to help him start his life again. He keeps getting flashbacks about events and places that he can't remember. He meets pet shop owner and part time private detective Gus Klein who is supposedly done some work for him prior to the accident. Klein helps Merrick to find out more about his past and true identity.",
         "A successful architect is in a car wreck with his wife. He sustains major facial injuries and loses his memory. As he recovers, he begins to find discrepancies in the description of his former life by his wife, his partner, and his partner's wife. He locates a private detective who he had hired before the accident to investigate an affair his wife was having. Now he employs the detective again to help unravel the mystery of his past."
      ],
      "budget": 0
   },
   "movielensId": 6476,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-10-11",
      "dvdReleaseDate": "2003-06-03",
      "directors": ["Wolfgang Petersen"],
      "runtime": 98,
      "movieId": 6476,
      "title": "Shattered",
      "mpaa": "R",
      "actors": [
         "Tom Berenger",
         "Bob Hoskins",
         "Greta Scacchi",
         "Joanne Whalley",
         "Corbin Bernsen",
         "Debi A. Monahan",
         "Bert Rosario",
         "Jedda Jones",
         "Scott Getlin"
      ],
      "imdbMovieId": "0102900",
      "originalTitle": "Shattered",
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["1c9qMxvb0QU"],
      "plotSummary": "Dan Merrick comes out from a shattering car accident with amnesia. He finds that he is married to Judith who is trying to help him start his life again. He keeps getting flashbacks about events and places that he can't remember. He meets pet shop owner and part time private detective Gus Klein who is supposedly done some work for him prior to the accident. Klein helps Merrick to find out more...",
      "tmdbMovieId": 2071,
      "avgRating": 3.32921,
      "releaseYear": "1991",
      "numRatings": 202,
      "posterPath": "/q7AAPZtD1APYACKeMc1TEU0g0KT.jpg"
   }
}