{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "cinéma vérité",
         "id": 190756
      }],
      "imdb_id": "tt0298050",
      "video": false,
      "title": "Manito",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Junior Moreno",
               "gender": 0,
               "credit_id": "54931d8c925141090c001e35",
               "name": "Franky G",
               "profile_path": "/2C6BTj03PQlbCIzb1zAv9gcMr5l.jpg",
               "id": 2682,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Manny Moreno",
               "gender": 0,
               "credit_id": "54931d98c3a3683cfe001f8d",
               "name": "Leo Minaya",
               "profile_path": null,
               "id": 1180559,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Oscar Moreno",
               "gender": 0,
               "credit_id": "54931da79251410918001d26",
               "name": "Manuel Cabral",
               "profile_path": null,
               "id": 555687,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Marisol",
               "gender": 0,
               "credit_id": "54931db6c3a3683cf8001d4a",
               "name": "Jessica Morales",
               "profile_path": null,
               "id": 1400937,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Miriam Moreno",
               "gender": 0,
               "credit_id": "54931dc8c3a3680efc000747",
               "name": "Julissa Lopez",
               "profile_path": null,
               "id": 1400938,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Abuelo",
               "gender": 0,
               "credit_id": "54931de3c3a3683d0d001e35",
               "name": "Hector Gonzalez",
               "profile_path": null,
               "id": 1400940,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54931bbf925141090e001d32",
               "name": "Eric Eason",
               "profile_path": null,
               "id": 151092,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54931e17c3a3683cfe001f94",
               "name": "Eric Eason",
               "profile_path": null,
               "id": 151092,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.082572,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 185465,
      "vote_count": 2,
      "budget": 0,
      "overview": "Fifteen years ago, their Washington Heights neighborhood was dubbed the crack-cocaine capital of the world, but today it is transforming into one of the most vibrant, Spanish-speaking communities in the United States. While the drug dealers continue to disappear, their violent legacy still casts a shadow over the neighborhood and its residents. Junior, an ex-convict struggling to get his life back on track, is a product of this legacy. His younger brother Manny, the salutatorian of his high school class, embodies the hope of the future. On the night of his graduation party, Manny finds himself faced with an ill-fated decision that could change his life forever",
      "similar": [
         46504,
         194944,
         201797,
         341126,
         135,
         26408,
         1386,
         162494,
         86750,
         245040,
         128779,
         260590,
         382267,
         176402,
         292175,
         333449,
         369928,
         125084
      ],
      "original_title": "Manito",
      "runtime": 78,
      "poster_path": "/1Ok0JxRagLlN4X2Fg0UeiWjcJLQ.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2002-01-15",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Eason"],
      "runtime": 78,
      "synopsis": null,
      "writers": ["Eric Eason"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0298050/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0MTAwNzUwOV5BMl5BanBnXkFtZTcwNDU0NjgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leo Minaya, Jessica Morales, Franky G | See full cast and crew »"],
      "reviews": [
         "Eric Eason's \"Manito\" is one of the most powerful films in recent memory. There is such raw energy that it involves us from the start. \"Manito\" uses a hand held camera technique that gives the viewer an intimate interaction with all the characters presented in the movie. The rhythm never stops throughout the film and at the end we don't want it to end, but wisely, Mr. Eason has given the movie the right length in this satisfying look at real people, something not to be found on a Hollywood make-believe film. \"Manito\" presents a situation about two brothers, Junior and Manny, who are as different from one another as day and night. Junior is quick tempered, has a violent nature, and Manny, is a young man that is mature beyond his years. Both brothers love one another dearly. Their environment will interfere in their lives. In the span of only a few hours, violence makes an unwelcome appearance, as Manny is faced with a situation where he is given a gun in order to take justice in his own hands, with dire consequences. In turn, Junior, trying to help Manny and the uncertain future that awaits him in jail, decides to confront his own father who years ago had let him go to prison when he was innocently charged for what the old man had done. The energy in the film is enhanced by the cast, most of them non professional actors. Franky G. makes Junior come alive. Leo Minaya plays the good brother Manny. Jessica Morales is perfect as the beautiful Marisol and Julissa Lopez is Miriam. Technically, the film has a grainy look that cinematographer Didier Gertsch gave it. The musical score by Saundi Wilson plays well in the background. The direction of Eric Eason is what makes this film come alive. We are given a real life situation that is dealt with realism and conviction. You will not regret watching it.",
         "This is the story of two brothers in a Latino area of a big city. The older brother has just been released from prison and is determined not to let his younger brother, Manny (the title is an affectionate nickname), follow the same path. Manny has excelled in school and is graduating from high school, but he is not home free yet. The film takes place over 48 hours, and was filmed in 25 days in a gritty, documentary style. The actors were mostly new to film, which probably added to the realism. It's the performances that make this film, which won a Special Jury Prize for ensemble acting at Sundance. As is often the case, it's not an easy film to watch, but it's worth it. Seen at Cinequest (the San Jose, CA film festival) on 2/24/2002.",
         "Here is an involving family drama that refuses to be categorized. Is it a Dogme film? Is it an experimental work? Is it an offspring of Cassevettes? Of Scorsese? Of Sidney Lumet? Is it a foreign film shot in America? Is it a piece of verite filmmaking? Or is it more rooted in Documentary? Set in a Manhattan Latino neighborhood, the story sets out with a very broad canvass, filled with the colors from all aspects of its world. The technique is at first documentary and little by little becomes something that feels more familiar. As if the filmmaker decided to trick you in to the story through some kind of visual artiface afterwhich you are so engrossed, you no longer are concerned with imagery but only for the characters. The story has no less than ten very memorable scenes. My favorites were the big graduation party that seemed truly captured (and not staged). There is also a scene in a prison that was one of the most emotionally moving moments I've experienced in a long time. If the film has a flaw, its that the story feels too unremittingly bleak in the end. I'm not suggesting that I wanted a happy ending. But, I did feel like the director was overally hellbent on proving his dark view of the world. I give this film a 9/10 and highly recommend it to people who enjoy Art films and World Cinema. (If you are a glossy Speilberg, this film is not for you)",
         "Here is a film (along with \"City of God\") that explores a violent world infested by drugs--and uses a cast of non-professional actors. Shot for much less money than the Brazilian masterpiece, Manito is something of a \"minor masterpiece\". I had heard that the images and editing are jarring. But I discovered it to be, on the contrary, a beautifully photographed film, the grain structure of which reminded me of 8mm Ecktachrome stocks from the 1960s...Furthermore, the camera choreography is a daring risk to mimick the exuberance of a passionate family in the throes of a tumultuous celebration that turns to tragedy. This is a style that could not be more perfectly suited to the material. The highest compliment one can say about these incredibly brutal yet beautiful images is that nothing like this has ever been seen before. \"Manito\" is better than virtually every other film made in America this year. That's not saying a whole hell of lot in year that has given us one bomb after the next. But \"Manito\" is a significant achievement.",
         "MANITO is a fine little independent film that does what few of the big movies have tried: the manner of shooting an intimate family film set in the ghetto atmosphere with a hand held camera gives it the immediacy and grit of the story far better than the expensive multicamera shoots of other similar tales with big budgets. Writer/director Eric Eason succeeds in inviting us, the outsiders as audience, to witness the machinations of a family at war with itself as though we were in the hall, at the window, or behind the wall. The result is a powerful, unpretentious little film with clout. Manito (Leo Minaya) is the younger brother of Junior (Frankie G) who has succeeded in school and in social life in a way that eluded Junior. Junior is an ex-con (we learn later how unjust that title is) who is basically a ne'er-do-well womanizer, but still works hard to make a living for his wife and child. When Manito (or Manny) wins a scholarship on graduation, Junior is bound to celebrate his love for his little brother and his pride in Manny's achievements with a big party. The father of the boys is the poison that drives the potential celebration into a disaster in a manner that summarizes all that is evil in the environment in which the brothers have survived. The story ends in a tenor that leaves as many questions unanswered as it does in finalizing the tale. Franky G is the only known actor among this talented but inexperienced cast. And despite the many small roles he has had serving as eye candy (and justly deserved!) for big movies, here he proves that he can indeed inhabit a role and give us a character who, despite his antisocial behavioral aspects, is a man we grow to love. The entire cast engages our attention as a verismo experience and witnessing the trials and smiles of this family sheds a warmer light on the Hispanic than most of the big movies afford. We doubtless - and hopefully - will be hearing and seeing more from Eric Eason. Grady Harp",
         "\"Manito\" tells of urban life in a NYC Puerto Rican hood as it follows a buff ex-con, Junior (Franky G), and his little bro, Manny (Minaya), as Manny graduates High School only to see his dreams for the future derailed. You'll find little story in this open-ended slice-of-life-in-da-hood flick which is quick to get down and dirty with family issues and personal problems. What story is in this short 78 minute flick is nothing we haven't seen before but it is very well done, especially for an indie. With kudos from all corners, \"Manito\" may not be for the public at large but it's grit and realism, good jiggle cam work, ethnic music, and convincing performances make it a rock solid little movie. Recommended for anyone into indie \"street\" flicks. Mostly English with subs for the Spanish and no CC's. (B)",
         "The beauty of the movie lies in it's grittiness. It's a small intimate portrait that subscribes to the idea that there are stories every where that's worth being told and we as audience members have the responsibility to appreciate that. Manito isn't wholly original, nor is it groundbreaking, but it is a story, and a strong story at that which provides a certain truth that has been a long absent from the regular Hollywood fare. Take the time to watch this film. I guarantee you won't be dissapointed.",
         "2002 is only three months old, but \"Manito\" is the best film so far. \"Manito\" is a tale of two brothers--Junior, an ex-convict trying to get his life together and Manny, a promising high school graduate. On the periphery of the drama is their father, Oscar, a former drug dealer who is estranged from the family. On the night of his graduation party--Manny becomes involved in a crime that threatens his future. His brother Junior--knowing full well the horrors of prison--sets out to help his little brother avoid this fate through any means he can. \"Manito\" is a straightforward, linear film. All of the action unfolds (i think) over one long weekend--the centerpiece of which is Manny's incredible graduation party. The story starts out very wide and includes several characters from the neighborhood. And by the end of the story, a show down occurs befitting Greek Tragedy. The quality of the acting is so high that many people will mistake these amazing performances as documentary filmmaking. Even more amazing is the fact that the cast is made up of non-professional actors. The Latino director (Puerto Rico) Eric Eason deserves an Oscar for his intelligent and measured guidance. And the lead actor Frankie G. (Junior) is a superstar in the making. (His debut performance is extraordinary and recalls early Marlon Brando). The rest of the cast--especially the actor Hector Gonazalez (Abuelo) are wonderful. Many viewers will no doubt find the filmmaking style of \"Manito\" off-putting. Admittedly, the film's aggressive camera and editing techniques take some getting used to. However, two minutes into the story, the style seems like a revelation. Never has a subject matter so perfectly matched it's style. I want to say that \"Manito\" (and the filmmakers behind it) introduce us to a new kind of visual language, a new way of seeing a story. The intimacy afforded by this innovation is perhaps the film's single greatest achievement.",
         "I saw \"Manito\" at this year's SXSW Festival after it won the Grand Jury Prize for Best Narrative Feature Film--when they scheduled an additional showing at the Paramount. Quite frankly, I was wasn't expecting the impact it made on me. The film starts out in a very \"slice of life/cinema verite\" style. The writer-director, Eric Eason, takes his sweet time establishing his characters and the world they live in. And at the very point where you wonder, \"where is this thing going?\", Eason grabs you by the throat and locks you into one of the most emotionally charged and authentic dramas about a family ever recorded on film. There isn't a single false moment--the acting is pitch perfect, the camera work is original and daring, and the film score (by some unknown composer Samuel Wilson) is wonderfully restrained, yet deeply felt and appropriately placed. I'm overjoyed to admit that I cried several times during the film--in places where one would normally would never shed a tear. I cried for the characters, I cried for the plight of my fellow Latinos in America. I even cried for myself. \"Manito\" is a feature debut on par with the first efforts of Cassavettes (Shadows), Scorcese (Who's That Knocking At My Door?), and Bertolucci (The Grim Reaper). It's high time for America to have a first rate Latino-Director. So--the question is: will Eason sell out to Hollywood and become a token Latino pawn? Or will he remain true to his obvious convictions and continue on the path to greatness? On behalf of Latinos everywhere--I can only hope for the latter.",
         "this film is an exceptionally strong story about how difficult it is to transcend the forces of the past, your own, your neighborhood's and your family's. the gritty urban drama uses a handheld camera to create a reality that is never broken or compromised. the exuberance of this Uptown Manhattan Latino clan is beautifully rendered as they attend the star of the family, Manny's graduation. his older brother, Junior, throws a great party and we sense that this family is on the road to recovering from the dark shadow cast by their former drug dealing father, now estranged. but Manny's bright future is jeopardized by a tragic incident that forces Junior to turn to the one person he despises above all. Franky G's turn as Junior Moreno, a live wire who negotiates all that life dishes him with charm, brute force, or simple perseverance is amazing. the climax is stunning and all i can say is this is like Shakespeare in Spanish Harlem. amazing. a multiple festival award winner: best film at south by southwest, special jury at Sundance, special jury at Miami, this film will grab you on the first frame and hold you until the final subway departs."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "7th Floor, The",
         "Smashing Entertainment"
      ],
      "summaries": ["Fifteen years ago, their Washington Heights neighborhood was dubbed the crack-cocaine capital of the world, but today it is transforming into one of the most vibrant, Spanish-speaking communities in the United States. While the drug dealers continue to disappear, their violent legacy still casts a shadow over the neighborhood and its residents. Junior, an ex-convict struggling to get his life back on track, is a product of this legacy. His younger brother Manny, the salutatorian of his high school class, embodies the hope of the future. On the night of his graduation party, Manny finds himself faced with an ill-fated decision that could change his life forever."],
      "budget": 24000
   },
   "movielensId": 6490,
   "movielens": {
      "languages": [
         "Español",
         "English"
      ],
      "releaseDate": "2002-01-15",
      "dvdReleaseDate": "2005-01-01",
      "directors": ["Eric Eason"],
      "runtime": 78,
      "movieId": 6490,
      "title": "Manito",
      "mpaa": "",
      "actors": [
         "Franky G",
         "Leo Minaya",
         "Manuel Cabral",
         "Jessica Morales",
         "Julissa Lopez",
         "Hector Gonzalez"
      ],
      "imdbMovieId": "0298050",
      "originalTitle": "Manito",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Fifteen years ago, their Washington Heights neighborhood was dubbed the crack-cocaine capital of the world, but today it is transforming into one of the most vibrant, Spanish-speaking communities in the United States. While the drug dealers continue to disappear, their violent legacy still casts a shadow over the neighborhood and its residents. Junior, an ex-convict struggling to get his life back on track, is a product of this legacy. His younger brother Manny, the salutatorian of his high school class, embodies the hope of the future. On the night of his graduation party, Manny finds himself faced with an ill-fated decision that could change his life forever",
      "tmdbMovieId": 185465,
      "avgRating": 3.22222,
      "releaseYear": "2002",
      "numRatings": 18,
      "posterPath": "/1Ok0JxRagLlN4X2Fg0UeiWjcJLQ.jpg"
   }
}