{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0304547",
      "video": false,
      "title": "Small Cuts",
      "recommendations": [],
      "backdrop_path": "/p529nHkjXqNNUDVY5Um2xFk0MyZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bruno",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f812943d",
               "name": "Daniel Auteuil",
               "profile_path": "/lWXsmJwL4H2RyJpC8p7hLFl27pZ.jpg",
               "id": 6012,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gaëlle",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f8129441",
               "name": "Emmanuelle Devos",
               "profile_path": "/5oNvZIGxSj5ruFkeEj6cXPwdgua.jpg",
               "id": 19117,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nathalie",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f8129445",
               "name": "Ludivine Sagnier",
               "profile_path": "/r9D7cZXUSpOOkXfDj4MpT91x3MR.jpg",
               "id": 4390,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Béatrice",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f8129449",
               "name": "Kristin Scott Thomas",
               "profile_path": "/9NuZGaPn3Z1svlbF9ZkdtjgrHZo.jpg",
               "id": 5470,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mathilde",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812944d",
               "name": "Pascale Bussières",
               "profile_path": "/vbfCShcj8n0eUOoKRCAGNh1auFY.jpg",
               "id": 54818,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gérard",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129451",
               "name": "Jean Yanne",
               "profile_path": "/79Z1qcDpbyRp5HPSBQvm15xwqOI.jpg",
               "id": 24381,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f8129455",
               "name": "Catherine Mouchet",
               "profile_path": "/cewBjPNq1tmHuPuHiLVyOvWcOD9.jpg",
               "id": 24762,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "l'assistant de Gérard",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129459",
               "name": "Aladin Reibel",
               "profile_path": "/vnfhtKE30oqLXB677bvDUBz8ZXJ.jpg",
               "id": 19387,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Simon, fils de Gérard",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f812945d",
               "name": "Jérémie Lippmann",
               "profile_path": null,
               "id": 96926,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f8129461",
               "name": "Dinara Drukarova",
               "profile_path": "/vrr1o35IIWvHoR0rosf8jFd3qCX.jpg",
               "id": 543366,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Paul",
               "gender": 0,
               "credit_id": "52fe4736c3a36847f8129465",
               "name": "Alain Libolt",
               "profile_path": "/e1tWOgNk2W5JhucO30vthXIQKeR.jpg",
               "id": 39349,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "André",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129469",
               "name": "Louis-Do de Lencquesaing",
               "profile_path": "/guqKGL4uLouIa4fyCjrq4DmGufe.jpg",
               "id": 230401,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "l'homme malade",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f812946d",
               "name": "Hanns Zischler",
               "profile_path": "/zlVtIH2P4cZLyftZZcfFo037N3t.jpg",
               "id": 169,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4736c3a36847f8129439",
               "name": "Pascal Bonitzer",
               "profile_path": null,
               "id": 64750,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57378f419251411322000344",
               "name": "Pascal Bonitzer",
               "profile_path": null,
               "id": 64750,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.988569,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 47499,
      "vote_count": 3,
      "budget": 0,
      "overview": "Bruno, a communist newspaper journalist, is suffering a mid-life crisis. Torn between his wife Gaëlle and his young girlfriend Nathalie, his political beliefs battered by the wind of history, Bruno seems to have lost his bearings.",
      "similar": [],
      "original_title": "Petites coupures",
      "runtime": 95,
      "poster_path": "/KZx4fic6YCdWyCsnBq6Xop8qWP.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "2003-02-12",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pascal Bonitzer"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Pascal Bonitzer",
         "Emmanuel Salinger"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0304547/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjkzNzI3NTcxOF5BMl5BanBnXkFtZTcwMzA2MTYyMQ@@._V1_SY229_CR44,0,214,229_AL_.jpg",
      "actors": ["Stars: Daniel Auteuil, Kristin Scott Thomas, Pascale Bussières | See full cast and crew »"],
      "reviews": [
         "Petites Coupures is exactly the opposite of actual american cinema : smart, elegant, fun. Daniel Auteuil plays a french journalist communist disturbed by his ideas, his wife, his girlfriend and women he meets. After \"Rien sur Robert\", Pascal Bonitzer shows us his billiant way to write and direct a good movie. He perfectly films women . This guy loves women, it's obvious. Pascale Bussière, Ludivine Sagnier, Catherine Mouchet and Kristin Scott-Thomas are beautiful. Don't waste your time, run to watch it.",
         "This is, I think, meant to be a cold film - its summing up moment for me is when we have an extended close-up of Gaelle's ring on the ground in the snow, the white gradually darkening with the stain of Bruno's dark red blood. The camera simply watches the beauty of the movement, enjoys its aesthetic simplicity, and refuses to pan back to Bruno and let us witness his emotion and what is going on with him as he slowly bleeds. This is a deconstructed road movie; Bruno goes on a mission to deliver a message - a message whose sense we never learn, and whose effects ultimately seem irrelevant or minimal. Each trip in the car sees Bruno get involved with increasingly desperate sexual couplings, but there is no sense that these will progress anywhere. Indeed, it is noticeable that this film emphasises the way in which Bruno is in fact rejected at places that connote not travel as such, but the (unromanticised) stasis that travel also necessitates - in getting lost, at the airport, at the car park. Not so much on the road, then, as off the road - our lives here are not so much the American myth of untrammeled spaces, more full of constraint, difficulty and so on. The question repeated throughout the film in reference to Bruno's putative Communism, but what about the wall, becomes symbolic for me of the film's whole point. Neither sexual desire, nor 'love', nor ideology, can overcome the blocking 'wall', the stasis that haunts us. The cuts to Bruno's hand are perhaps the least disturbing thing in this beautiful, cold, bleak film.",
         "French film critic, writer and director Pascal Bonitzer's third feature film which he also wrote the screenplay for, tells the story about journalist Bruno who is having doubts about his communists believes and who no longer knows if it is his wife or his young lover he really loves. After having received a call from his uncle who is fighting for re-election as the mayor of a small-town in Grenoble, Bruno decides to help him, but on his way he gets stuck in a dark forest. In search for someone that can help him, he encounters a secretive woman named Beatrice. This visually compelling and character-driven road-movie, a poignantly atmospheric mystery drama, which is an intriguingly written story about a middle-aged man's entwining love life, is strengthened by a fine music score and good acting performances, especially from Daniel Auteuil and Kristin Scott Thomas. Ludivine Sagnier and Emmanuelle Devos are also good in minor parts. A stylish, humorous and somewhat romantic neo-noir from Jacques Rivette's frequent collaborator, which was nominated for the Golden Bear at the Berlinale in 2003.",
         "Any movie with such a cast deserves to be seen, and if directed and written by Pascal Bonizter, more so. Auteil plays the same character we've seen him in a thousand times. He's like a caricature version of his sublime \"L'Adversaire\" (same rural unsettling geography). Here we know this film's genre is something close to ... a vaudeville, like Beatrice tells him near the end. Not a drama. Not a comedy. Not a crime novel, thou it pretends to be so. Never a love story, thou love or at least lust and routine relationships abound (our hero has 4 women in about 2 days, 2 of them married to dangerous people he knows...). Béatrice is a woman that's so mad that anybody sound would flee from her, but her mixture of sadness and personality is intriguing. Although personally I found her \"depressive hysteric\" character rather predictable. I mean, every scene in which she was with Auteil (all, for we only see her as that) we know she's going to say something high sounding (she, not him as she accuses), then allure him, rebuke him, say something depressing, make something mad, and then start again... Jean Yanne is probably the more solid character of the movie. Yes, he plays the same poker faced small time villain we've seen at Bertrand's Je règle mon pas sur le pas de mon père (1999). But unlike his role at the already mentioned \"Tenue c. e.\", here there's no comic counterbalance. Just a grim manipulator. But that's fine for this movie in which you can hardly feel anything for anybody. Emmanuelle Devos's Gaëlle is an awkward character, detached when she even offers her young \"rival\" rouge, a smoke, coiffure and even some love tips, and then XIX century hysterical for a guy she's just met. Her matter of fact talk at the travel agency was fine, proving, again, she's a fine actress. The whole affaire with Pascale Bussières Mathilde is outright ridiculous. Nice underwear for a serious working woman, thou :). Ludivine Sagnier's Nathalie is fine as a nincompoop teen with some principles. It's funny she did the beauty at the bad remake of \"Swimming Pool\"(2003). Which, again, proves she can act. Summing up, a pity such a stellar cast and director made a film only worth watching. Hope next time they decide to make a film, not play with us. Chabrol would have done it better. This is a movie about a pathological lier, and nobody seems to care (but maybe for Gaelle). The political running joke, in which everybody pokes fun about his political beliefs and \"le Mur\" is lost to me.",
         "Daniel Auteuil's Bruno in Petites Couperes is a middle-aged model of his Pierre in Christian Vincent's La Separation of 10 years ago. In both films, youthful confidence in left-wing ideology and love (mutual metaphors) crumbles into paranoia - manifesting itself as trapped aggression in Pierre and desperately comic womanizing in the more recent Bruno. Unfortunately for Auteuil fans, the actor has become reliant on a uniform world-weariness (not unlike compatriot Johnny Hallyday in Leconte's recent l'Homme du Train). Acting it ain't, and becomes rather frustrating as the film progresses. Pascal Bonitzer doesn't help as the writer/director of the project. His sequencing of episodes overlaid with connecting symbolism fail to mask the film's lack of rhythm. I was particularly furious that the imposingly dramatic/romantic backdrops of Grenoble were made virtually redundant by a cameraman who was obviously shivering in the cold. Krisitn Scott Thomas almost rescues the show with her female counterpart to Bruno, Beatrice. She dramatizes the dizzying contradictions intended as Bruno in a character of increasing complexity to the point of becoming surreal. Bonitzer cannot sustain this though, and the flagging plot demands Beatrice to even out into another bourgeois mannequin. In doing so Bonitzer shows then denies Scott Thomas the Oscar cabinet. All the characters' submersion into the bourgeoisie may be a viable and indeed tragic outcome, but in this case it's a cop-out of a cadence (unlike the brutal, painful denouement of La Separation). A serious disappointment, 4/10.",
         "The obsession of 'signifie' and 'signifiant' is not enough to make a good film. Pascal Bonitzer should have remained in our memory as a brilliant film theorist back in the '60´s. It was not necessary to take the camera. The result is quite frustrating. It´s a pity for his excellent leading actors.",
         "I happened to see this film on a flight from Paris to Boston and it reminded me of the food on the plane: generic, tasteless and obscure. The French cinema seems to have lost its footing these days and this is a good example of how a motley script can waste brilliant actors. While some may find the 'playfulness' of the script to be in line with the dictates of Euro post modernism, the whole project seems more like a post-mortem on the death of Euro-cinema's golden years and truly fabulous talents --- one is vaguely reminded here of Bunuel but without the charm or wit.",
         "The plot in Petites Coupures certainly left this viewer dumbfounded. ***spoiler*** In the space of 48hrs or so, Auteuil's character has an affair with a teenager, loses his wife's affections, attempts to seduce Scott Thomas, is rejected by her goes on to grope yet another female character in the back of a car and then is finally shot for his trouble. ***end of spoiler*** wha ??? The only saving grace in this flick is Kristin Scott Thomas. Similar to Charlotte Rampling, she seems a *natural* to star in French cinema. My hope is that one day François Ozon may cast her in a part where she can show her true talent. There are some fine French films such as the remarkable Le Colonel Chabert begging for a DVD release, yet this is the tripe that gets chosen. Avoid this one. zzzz..",
         "The distribution was good, the subject could have been interessant and comic. whereas, he described the wandering of an old non credible communist looking for loving sensations. Instead of this, the atmosphere is nor lively nor heavy."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Axiom Films",
         "Canal+",
         "Centre Européen Cinématographique Rhône-Alpes"
      ],
      "summaries": ["PETITES COUPURES tells the story of Bruno (Daniel Auteuil), a communist newspaper journalist suffering a mid-life crisis. Torn between his wife Gaëlle ('Emmanuel Devos') and his young girlfriend Nathalie (Ludivine Sagnier), his political beliefs battered by the wind of history, Bruno seems to have lost his bearings. After responding to a call for help from his uncle (Jean Yanne), who is fighting a losing battle for re-election as the communist mayor of a small town near Grenoble, Bruno gets lost in a dark forest. There he meets Béatrice (Kristin Scott Thomas), who does nothing to stop him getting even more lost"],
      "budget": 0
   },
   "movielensId": 64918,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2003-02-12",
      "dvdReleaseDate": null,
      "directors": ["Pascal Bonitzer"],
      "runtime": 95,
      "movieId": 64918,
      "title": "Small Cuts",
      "mpaa": "",
      "actors": [
         "Daniel Auteuil",
         "Emmanuelle Devos",
         "Ludivine Sagnier",
         "Kristin Scott Thomas",
         "Pascale Bussières",
         "Jean Yanne",
         "Catherine Mouchet",
         "Aladin Reibel",
         "Jérémie Lippmann",
         "Dinara Drukarova",
         "Alain Libolt",
         "Louis-Do de Lencquesaing",
         "Hanns Zischler"
      ],
      "imdbMovieId": "0304547",
      "originalTitle": "Petites coupures",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 47499,
      "avgRating": 2.33333,
      "releaseYear": "2003",
      "numRatings": 9,
      "posterPath": "/KZx4fic6YCdWyCsnBq6Xop8qWP.jpg"
   }
}