{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "melancholy",
            "id": 4232
         },
         {
            "name": "train ride",
            "id": 5552
         },
         {
            "name": "train",
            "id": 13008
         },
         {
            "name": "separation",
            "id": 18013
         },
         {
            "name": "childhood friends",
            "id": 160246
         },
         {
            "name": "anime",
            "id": 210024
         },
         {
            "name": "growing apart",
            "id": 236771
         }
      ],
      "imdb_id": "tt0983213",
      "video": false,
      "title": "5 Centimeters per Second",
      "recommendations": [
         14069,
         198375,
         28874,
         12924,
         79707,
         110420,
         37797,
         4977,
         83389,
         92321,
         33320,
         10494,
         242828,
         13398,
         12477,
         37910,
         81,
         149870,
         10515,
         16859
      ],
      "backdrop_path": "/na51OUflawJy5K2cgvF07nrgGrl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Takaki Toono (voice)",
               "gender": 2,
               "credit_id": "52fe46989251416c910596df",
               "name": "Kenji Mizuhashi",
               "profile_path": "/5GSiheT7gHfm5u2roSuNOU19tqG.jpg",
               "id": 79006,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Akari Shinohara (voice)",
               "gender": 0,
               "credit_id": "52fe46989251416c910596e3",
               "name": "Yoshimi Kondou",
               "profile_path": "/lAEyKFMkK59w0LsWZwZnDd5ZkAA.jpg",
               "id": 122180,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kanae Sumita (voice)",
               "gender": 1,
               "credit_id": "52fe46989251416c910596e7",
               "name": "Satomi Hanamura",
               "profile_path": "/5KEkffbZnEXbBjL3ryYQnkphZWg.jpg",
               "id": 85976,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Akari Shinohara (voice)",
               "gender": 0,
               "credit_id": "52fe46989251416c910596eb",
               "name": "Ayaka Onoue",
               "profile_path": "/TgyKKwd7Q8dB1sr5jb3lrquItS.jpg",
               "id": 122181,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "(voice)",
               "gender": 1,
               "credit_id": "52fe46989251416c910596fb",
               "name": "Risa Mizuno",
               "profile_path": "/3zk9Eqv19LQOU2unCHi2bJgwxmX.jpg",
               "id": 116323,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "52fe46989251416c910596ff",
               "name": "Yuka Terazaki",
               "profile_path": null,
               "id": 135523,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "52fe46989251416c91059703",
               "name": "Yûko Nakamura",
               "profile_path": "/6WvIbVHRfaayiGEU6Qsn7LncO1t.jpg",
               "id": 237168,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "(voice)",
               "gender": 2,
               "credit_id": "52fe46989251416c91059707",
               "name": "Masami Iwasaki",
               "profile_path": null,
               "id": 225656,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "52fe46989251416c9105970b",
               "name": "Rei Kondo",
               "profile_path": null,
               "id": 1173793,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "(voice)",
               "gender": 2,
               "credit_id": "52fe46989251416c9105970f",
               "name": "Hiroshi Shimozaki",
               "profile_path": null,
               "id": 1173794,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "(voice)",
               "gender": 0,
               "credit_id": "52fe46989251416c91059713",
               "name": "Takahiro Hirano",
               "profile_path": null,
               "id": 1124541,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46989251416c910596db",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46989251416c910596f1",
               "name": "Makoto Shinkai",
               "profile_path": "/xFofUu6o9iVnqh7fbnLLEcolxEw.jpg",
               "id": 74091,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46989251416c910596f7",
               "name": "Noritaka Kawaguchi",
               "profile_path": null,
               "id": 1116326,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 11.675076,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 38142,
      "vote_count": 557,
      "budget": 5000000,
      "overview": "Takaki and Akari are two classmates in elementary school. During their time together they have become close friends. Their relationship is tested when Akari moves to another city because of her parents' jobs. Both of them struggle to keep their friendship alive, as time and distance slowly pulls them apart. When Takaki finds out that he is moving further away, he decides to visit Akari one last time.",
      "similar": [
         351460,
         81,
         374205,
         378064,
         13754,
         14003,
         176983,
         28609,
         844,
         39105,
         39323,
         39108,
         34433,
         24752,
         41498,
         113082,
         39100,
         39107,
         39101,
         39324
      ],
      "original_title": "秒速5センチメートル",
      "runtime": 63,
      "poster_path": "/wX7RbjclqHoSWd4NGouDisBHq1o.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "CoMix Wave",
         "id": 3756,
         "origin_country": ""
      }],
      "release_date": "2007-03-03",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "A chain of short stories about their distance",
      "adult": false,
      "homepage": "http://5cm.yahoo.co.jp",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Makoto Shinkai"],
      "runtime": 63,
      "synopsis": "Episode 1: Oukashou Upon graduating from elementary school, Takaki Tono and his close friend Akari Shinohara drifted apart. Akari moved to Tochigi Prefecture due to her parents' jobs, while Takaki attended a junior high in Tokyo. The two kept in contact by writing letters, but despite the special feelings that existed between them, the only thing that persisted was time. When Takaki became aware that his family would move to Kagoshima, he decided to go see Akari since they would be too far apart to visit each other after he moved. However, when the day came, a severe snowstorm delayed Takaki's trip, and it would be hours before he reached Iwafune, where they promised to meet. Episode 2: Cosmonaut Takaki is now in the third year of senior high in Tanegashima, where the Tanegashima Space Center is located. Kanae Sumita, a classmate of Takaki, has special feelings for Takaki, but she does not have the courage to express her love to him. She later observes that Takaki is always staring off into the distance, as if searching for something far far away. Episode 3: Byousoku 5 Centimeter It is now 2008, and all three characters have gone their separate ways. Takaki is now a computer programmer in Tokyo, and Akari is preparing to get married. One day, Takaki goes out and sees the face of a familiar-looking woman at a railroad-crossing. Puzzled by the encounter, he tries to look back, but a train comes and cuts off his view. The plot synopsis is licensed under the terms of the GNU Free Documentation License.",
      "writers": [
         "Makoto Shinkai",
         "Steven Foster"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0983213/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MDIyNzQyNl5BMl5BanBnXkFtZTcwNDcyNTk2MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Kenji Mizuhashi, Yoshimi Kondou, Satomi Hanamura | See full cast and crew »"],
      "reviews": [
         "What you will definitely notice first is the animation. The drawings are beyond compare I have never seen such beautiful artwork in anime ever. This is 11 of 10 stars, not one less. So, the plot. I don't think there is anything more beautiful in the world as pure, young love, everyone who was in love as a child can emphasize with that. No hesitation, no questions, just two souls melting in harmony. I fear as we grow older, most of us loose their capability of feeling that way, there is just to much stress and influence on us, what a pity. So... to the point; never has a movie (not just anime) projected this feeling of a young soul desperately in love more precise and moving than this one. I am a 26 year old man and I don't know when I cried the last time, but at a certain point in the movie I found myself dropping a big tear. But beware: the movie is about chapter one. The second, still beautiful and honest, with a great metaphor and the very nice idea of changing the lead character, giving another angle on the subject, can just not compel with the first. And as many others, I did not like the last chapter either, but it is need to be said, that this plot does not harmonize with a good old fashioned Hollywood happy end, as most of the viewers would expect, or rather demand, I could say. This is a Japanese movie and Japanese movies take another angle on life itself. Just take it as it comes. This is definitely art. If you are a romantic one, and open to art movies, this will become a piece of your soul. Honest thanks to the makers.",
         "\"The movie is named 5 Centimeters Per Second for the speed at which cherry blossom petals fall, petals being a metaphorical representation of humans, reminiscent of the slowness of life and how people often start together but slowly drift into their separate ways.\" Beautiful. Absolutely an instant masterpiece by Makoto Shinkai. I enjoyed Voices of A Distant Star and The Place Promised in Our Early Days, But I never thought that he could pull off another great film. Plot-wise, it has similarities with his previous works(Voices of A Distant Star), but it manages to create a different atmosphere here. Watching all 3 short stories consecutively, I'll have to say the final chapter was the best among 3. The pinnacle, however, is the first one. Second chapter is a little slow-paced, but it matches the movie theme nicely. Can't have much complain towards the music. As usual, Tenmon proves he's got the talent with emotional piano pieces. The theme song is nice as well. Animation & visual effects is stunning. Makoto Shinkai definitely gets a solid certificate to be one of the best visual directors out there at the moment. Overall, a 9/10 for me. It's almost flawless, but nothing can be perfect, right? ;)",
         "First of all, let me start by saying that this movie has touched me more than anything I've ever watched before. The storyline isn't too complex but very realistic and that is what makes it so easy to feel connected to the characters. Many movies have those 'lucky circumstances', those unbelievably strange situations that are always nice to watch, because they are usually our fantasy-moments. However, deep inside we all know that those situations could never occur in real life, that in reality everything would have been so much more simple and probably sad. Sometimes we even find ourselves wanting to see the 'real-life versions' of the plots.. Well, in this movie there are no 'lucky circumstances', no happy-strange moments. This movie is all about real life.. Yes, it may be sad. Yes, there might be no happy ending like in those Disney fairy tales. But there will be something much better - a real life love story that will blow you away.. Recommended for all age groups.",
         "This movie blew me away - it was amazing. I can't tell you anything more other than it revolves around love, life and time. This film is stunning you simply must watch it! Don't be put off if you're not interested by the end of the first episode because by the end of the third episode everything comes together in one amazingly beautiful package. If ever a film deserved 10/10 this was it. If you have ever felt love you will adore this movie because it captures that feeling flawlessly. This is the type of movie that was made by dreamers, for dreamers. By romantics for romantics. This movie is pure art. Miss it and you're denying yourself something special.",
         "Having viewed the previous two films of Makoto Shinkai,I am enchanted by these animations.It is a beautiful and a little sorrow story in the film,but you will find the story is depicted in a totally different way after finishing reading the novel of it.Especially the 3rd chapter:5 cm per second. In the film,there are a myriad of description about Takaki,while few about Akari.Admittedlly,the plot is evolved in the eye of him.However,there are almost equal depiction about Takaki and Akari in the novel.I like the feature of Takaki,he is a industrious kid thought physical trouble(his health condition is not very good in youth)and changing of the environment(he always moves) give some disadvantage in his young days.Later he entered a Univ in Tokyo,and in his campus life he also had some beautiful affections with his workmate in some social work.So he undergo certain pain emotionally,but this makes him a more strong man.He is also a boy of achievement:in the novel,he work as a programmer in a big company,and he has considerable income.Although succeed in career,Takaki's emotional life is not supposed to be very perfect.He still care about Akari even after having worked for a few years,or even in relationship with his girlfriend.The reason why he is so confused in the film is that somebody is haunting around him. But after the train passed by,the girl(she is supposed to be Akari) in the other side of the railway disappeared.Our actor know that she had pursued her happiness.Okay,let's him start a new life!",
         "This, for me, is quite probably one of the most touching animes that I have ever seen and one of the more heartfelt pieces of cinema that I have ever experienced. Basically, 5cm Per Second is a short movies split up into 3 episodes, the first one being 30 min, the second one 20 min, and the last one 15 min. Each of these three episodes portrays a pair of people and their relationship during childhood, adolescence, and adulthood. The story that it has is very simple and could be summarized in a few sentences but that is not the point of this series. The real point is the volumes of material that could be written about the emotion, feeling, and beauty that can found in this masterpiece. As you watch this, you will be able to distinctly feel for these characters and you will be able to connect with them as if you actually knew them because of how human and relatable they feel. You will be able to feel exactly the same as they do because in your childhood you will have felt precisely the same at some point and this connection comes through wonderfully. Only adding to this sense of wonder is what might by some of the better pacing in a series to date. Simply the way the characters progress and the way that it seemingly ends as soon as it starts will haunt you for hours or days afterwards. What strongly supports this anime is the excellent animation which stunning and the music, which while not jaw-droppingly amazing, still does not leave anything to be desired. In short, do yourself a favor, take an hour out of your day to watch this beautiful work of art.",
         "This movie is basically three separate chapters, each of them showing different degrees of separation between two people. throughout the movie you'll see one of the best animation scenes in history. Its superb!!, images are incredibly neat and well done. In this department I would give the movie an 11 out of ten. first chapter is absolutely flawless, its amazing, one of the best pieces of animation I've ever seen, maybe even the best. You are captivated by the characters amazingly fast, its fantastic. another 11 out of ten. Second chapter is also very good but.. the first chapter is so perfect that you don't think much of the second one. last chapter is good. actually it is PERFECT, it allows the movie to make its point. in other words, it ends the way it has to. I did not give this chapter a 10 ONLY because it made me really sad ( I don't think I'm spoiling anything by saying this). I thought it was going to end in a completely different way. Anyway, I recommend this movie a lot, just the animation and the first chapter makes it worth it. If you like the ending you could probably rank it as a 9.5 or ten.",
         "\"5 cm per second. The speed at which cherry blossom petals fall.\" It looks like Makoto Shinkai has directed another little minimalist masterpiece. Bearing a distant resemblance to underground coming-of-age classics such as My Life as a Dog, 5 cm interweaves three short stories seen from the viewpoints of different characters. Each story revolves around a specific time period in the protagonist's life: his last days at primary school, graduating from high school, his early life as an adult. Through the prism of an early sakura-blossom romance, the film primarily explores the themes of distance and loneliness, though it does so in a gentle way that is akin to recollecting your most beautiful sunrise memory rather than resorting to being dark and gloomy. The music blends in very well with the movie, enhancing the emotional experiences conveyed, while passing almost unnoticed - as should happen in the best soundtracks. The animation is top notch and the quality of the drawings is just mesmerizing. You may often get the urge to pause the movie just to explore the richness of the tapestry. If you can find it, it's well worth a watch. 9/10",
         "The movie is subtitled \"a chain of short stories about their distance\" and I can think of no better way of summarizing it without giving away the mystery. \"5 Centimeters Per Second\" can be classified as a love-drama film as it contains plenty of both. I recommend this movie even to those that dislike anime, because if you watch just four minutes of the movie you simply forget you are looking at a Japanese-style film. The emotions are very powerful and you just cannot help but love the characters. It was very hard for me to give it 9/10 stars, but I felt like the second episode was missing something. -- Story: \"5 Centimeters Per Second\" is composed of three chapters/episodes. Makoto Shinkai does a fantastic job at creating a story that immediately finds a way into your soul. Despite being an anime movie, there are no Sci-Fi nor any Fantasy elements. It is simply a reflection of life with it's struggles and obstacles, that come together in deep moments. **SPOILER**The first chapter tells the story of close friends Takaki Tōno and Akari Shinohara and how time and space forces them to go their separate ways. After graduating elementary school the two keep in touch by writing letters and visit each other one more time before Takaki and his family move further away from Akari's town. Despite the two's mutual special feelings, they do not speak about them until their last meeting. The second chapter introduces Kanae Sumita, a classmate of Takaki that falls in love with him, but cannot express her feelings to him. One day she notices Takaki staring into the distance and understands that he is searching for something far grater than her. The third episode finds our character in very different situations. Years later, we see Akari somewhat happy, getting ready to marry a man, but still melancholic after finding an old letter of hers addressed to Takaki. In another place in Japan, Takaki has a job, but lives alone and cannot let go of his past memories.**/SPOILER** -- Art and Animation: The environment instantly sucks you in and you find yourself immersed inside the same dream-like situation like Takaki Tōno. The movie has one of the greatest artistic presentations of it's genre. Many may shy away from the prospect of watching a movie that has love and drama as center elements, but the movie is worth watching for the art alone. Makoto Shinkai has created perfect environments, enhanced by light and details such as individual grass seeds moving in the wind. The style of animation is fantastic. Takaki's simple gestures of frustration while waiting in the delayed train speak out better than any words. --Characters and voice acting: At first glance the characters look like the average Japanese hikikomori (introvert), but it's hard to imagine any other characters taking part in such sweet and heart-warming situations. All the three (soon to be adults) find it hard to express their feelings which gives the viewer something to relate to. The voice acting is relatively good. Although the fast-pace Japanese language may be hard to get used to, the actors' whispers and thoughts are able to send out powerful emotions. --Music: The music, composed by Tenmon consists mostly of piano elements and also a song used for Episode 3: \"One more time, one more chance\" written and performed by Masayoshi Yamazaki. All these go extremely well with the melancholic atmosphere of the movie. --Overall: If you like beautiful art and animation, plus a good story, then \"5 Centimeters Per Second\" is a must-see. Even though it is only one hour long, the movie talks about heart-braking situations and hidden feelings, things we can all relate to. Just make sure you have a box of tissues with you before watching. :)",
         "Three interconnected stories about love and loss and how some hearts change and some don't. Part one a boy goes to meet a girl who lies at the end of a long train ride. Part Two a girl in the boys new high school tries to attract his attention. Part Three years later. The tales are bitter sweet lovely and delicate. They are not perfect, but since they are almost tone poems of emotion its okay. I missed this at the NY Children's film festival and had to wait for the DVD release...Oh man I thought it was tough for parents to explain the Girl who Leapt through Time-What would parents and young kids have made of this? I know the kids would have trouble processing it since their experience wouldn't allow for it and the parents would probably be broken hearted...mommy why are you crying? How do you explain this sort of emotion to a child? As for me, I have no idea what to say... Similar and yet different to the directors Voices From a Distant Star, this is a film about distance and communication (or lack there of) and how the heart approaches what it yearns... I am moved to somewhere beyond words. Echoes of my own life aside there is something about the emotion that moves you-why am I crying? I don't know. The wall against such things has been punctured and while the tears were never a torrent there was a few moments where they definitely flowed. Its not perfect-frankly I don't know what it is, but it moved me... Take my advice, and that of the song at the end-tell the person you love that you love them. ------------ PS In theory the three parts of the movie can be seen separately...but in reality I doubt that they would work as well in parts- certainly the third one won't since all of the emotion come from the first two parts."
      ],
      "genres": [
         "Animation",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["CoMix Wave"],
      "summaries": [
         "Takaki and Akari are two classmates in elementary school. During their time together they have become close friends. Their relationship is tested when Akari moves to another city because of her parents' jobs. Both of them struggle to keep their friendship alive, as time and distance slowly pulls them apart. When Takaki finds out that he is moving further away, he decides to visit Akari one last time.",
         "Told in three interconnected segments, we follow a young man named Takaki through his life as cruel winters, cold technology, and finally, adult obligations and responsibility converge to test the delicate petals of love."
      ],
      "budget": 5000000
   },
   "movielensId": 64993,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2007-03-03",
      "dvdReleaseDate": "2008-03-04",
      "directors": ["Makoto Shinkai"],
      "runtime": 63,
      "movieId": 64993,
      "title": "5 Centimeters per Second",
      "mpaa": "PG",
      "actors": [
         "Kenji Mizuhashi",
         "Yoshimi Kondou",
         "Satomi Hanamura",
         "Ayaka Onoue",
         "Risa Mizuno",
         "Yuka Terazaki",
         "Yûko Nakamura",
         "Masami Iwasaki",
         "Rei Kondo",
         "Hiroshi Shimozaki",
         "Takahiro Hirano"
      ],
      "imdbMovieId": "0983213",
      "originalTitle": "秒速5センチメートル",
      "genres": [
         "Animation",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["PxKn5AwOTis"],
      "plotSummary": "Takaki and Akari are two classmates in elementary school. During their time together they have become close friends. Their relationship is tested when Akari moves to another city because of her parents' jobs. Both of them struggle to keep their friendship alive, as time and distance slowly pulls them apart. When Takaki finds out that he is moving further away, he decides to visit Akari one last time.",
      "tmdbMovieId": 38142,
      "avgRating": 3.84351,
      "releaseYear": "2007",
      "numRatings": 786,
      "posterPath": "/wX7RbjclqHoSWd4NGouDisBHq1o.jpg"
   }
}