{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "space war",
            "id": 3386
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "space invasion",
            "id": 6968
         },
         {
            "name": "martian",
            "id": 10539
         },
         {
            "name": "alien invasion",
            "id": 14909
         }
      ],
      "imdb_id": "tt1183733",
      "video": false,
      "title": "War of the Worlds 2: The Next Wave",
      "recommendations": [
         273756,
         20205,
         16173,
         86971,
         76197,
         52615,
         41997,
         17940,
         81179,
         14245,
         85949,
         230408,
         222890,
         42903,
         71285,
         68446,
         44661,
         289214,
         24617,
         35610
      ],
      "backdrop_path": "/mdV6Wnq6gosHM64j1L3MhpQ9PSF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "George Herbert",
               "gender": 2,
               "credit_id": "52fe46be9251416c750821b7",
               "name": "C. Thomas Howell",
               "profile_path": "/8PFMkxOnn1JEKwd0nlbBuZfS7Sf.jpg",
               "id": 2878,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Major Kramer",
               "gender": 2,
               "credit_id": "52fe46be9251416c750821bb",
               "name": "Fred Griffith",
               "profile_path": null,
               "id": 47387,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Squid killer",
               "gender": 0,
               "credit_id": "52fe46be9251416c750821bf",
               "name": "Zack Beseda",
               "profile_path": null,
               "id": 93190,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Pete",
               "gender": 2,
               "credit_id": "52fe46be9251416c750821d5",
               "name": "Christopher Reid",
               "profile_path": "/5grzkHY1z7ForLQN7vQx1LjQxzk.jpg",
               "id": 79320,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Victoria Reed",
               "gender": 1,
               "credit_id": "52fe46be9251416c750821d9",
               "name": "Kim Little",
               "profile_path": "/uDw7WsQcrwLtyvwFimtVfrOTi9Q.jpg",
               "id": 92027,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Gorman",
               "gender": 2,
               "credit_id": "52fe46be9251416c750821dd",
               "name": "Jonathan Levit",
               "profile_path": null,
               "id": 162369,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Sissy",
               "gender": 0,
               "credit_id": "52fe46be9251416c750821e1",
               "name": "Danna Brady",
               "profile_path": null,
               "id": 128805,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Shackleford",
               "gender": 2,
               "credit_id": "52fe46be9251416c750821e5",
               "name": "Darren Dalton",
               "profile_path": "/ilvaY9lSWPWMPXxRmrDBTl3xbWm.jpg",
               "id": 2884,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Stram",
               "gender": 2,
               "credit_id": "52fe46be9251416c750821e9",
               "name": "Jonathan Nation",
               "profile_path": "/yhIRbVE9dWZlzCQFoe00fkA2Es4.jpg",
               "id": 95988,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46be9251416c750821b3",
               "name": "C. Thomas Howell",
               "profile_path": "/8PFMkxOnn1JEKwd0nlbBuZfS7Sf.jpg",
               "id": 2878,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46be9251416c750821c5",
               "name": "Steve Bevilacqua",
               "profile_path": null,
               "id": 979418,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe46be9251416c750821cb",
               "name": "Eric Forsberg",
               "profile_path": null,
               "id": 112019,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46be9251416c750821d1",
               "name": "David Michael Latt",
               "profile_path": null,
               "id": 30053,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 1.970467,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16268,
      "vote_count": 24,
      "budget": 0,
      "overview": "Two years after the Martian invasion, George Herbert's worst fears are realized: The Aliens have returned. As a second wave of Martian walkers lay waste to what's left of Earth, an alliance of military forces prepares a daring attack on the Red Planet itself. Once again, the future of mankind hangs in the balance.",
      "similar": [
         198663,
         76341,
         19995,
         299687,
         137113,
         157350,
         281,
         604,
         605,
         335984,
         9482,
         7512,
         9739,
         5491,
         9381,
         21356,
         12244,
         2048,
         8337,
         8078
      ],
      "original_title": "War of the Worlds 2: The Next Wave",
      "runtime": 90,
      "poster_path": "/o2yvWD9nCck18FQsCnOIsxUA6mB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Anthill Productions",
         "id": 3990,
         "origin_country": ""
      }],
      "release_date": "2008-01-01",
      "vote_average": 3.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "War of the Worlds Collection",
         "id": 201061,
         "poster_path": "/rk011rZUj0svd0T3iWLa0uD56Cu.jpg"
      },
      "tagline": "Another Alien Invasion!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["C. Thomas Howell"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Steve Bevilacqua",
         "Eric Forsberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1183733/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyODE1NDM4Ml5BMl5BanBnXkFtZTcwNDcxMTA3MQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: C. Thomas Howell, Christopher Reid, Kim Little | See full cast and crew »"],
      "reviews": [
         "Oh goodness, why do people make this crap?! Are these filmmakers literally trying to kill us by demolishing our brain cells? First of all, I'm not going take long on reviewing a film that's not worth it, so let's make this quick and start off by calling out the bad stuff. (Which is basically everything about the film.) - The acting was horrendous. The worst you could possibly get. - The special effects were complete trash. Everything that had to deal with any special effects whatsoever was horrible. - The walkers were also disappointing, and they weren't cool or edgy at all, nor were they new or awesome in anyway possible. - The constant, unnecessary, background music got on my last nerve. It didn't go two seconds without playing some sort of irritating, repetitive music! - The twist at the end was incredibly stupid and predictable. There was nothing good about this film, except for the fact that it made me breathe relief when the end credits showed, because the agony of watching this movie was finally over. If you're a big fan of the story, I beg of you to not to watch this film, or even consider watching it. If you don't, you will be doing yourself a tremendous deed.",
         "When I first saw this, I couldn't believe it! War of the Worlds, from the book, the radio drama and the original '53 movie is classic, in every respect of the word. I'm not a huge fan of the Spielberg remake, to be honest, it would have been so much better setting it in the 'Victorian' era, but I digress. WOTW 2 is terrible, I mean, truly awful. The acting is some of the worst I have seen. The directing isn't that bad, but it's nothing special. The SFX are terrible...I've see TV adverts with better effects! The story seemed to be from a junior school competition. This really is an insult to H G Wells...he would be rolling in his grave over this. Avoid it at all costs.",
         "To tell you the truth, i started watching this movie because i thought that it was a Spielberg sequel.But 2 seconds into the movie i realized that...well...that it wasn't a Spielberg sequel. So all you people expecting to see a good movie, be warned you're going to regret watching it.Its 85 minutes of your life you are never getting back.The animation was bad enough to be mistaken for animation from the 80s.Even I can act better than the actors and the actress( I don't know why anyone would hire her for this movie). There wasn't even a proper storyline.I don't think it deserves the rating of 3/10.If it were up to me i would have given it a 0.5/10.Looks like the writer is a fan of the movie Independence Day because there are scenes in the movie that are just like the ones in the movie Independence Day. Anyway...if anyone still wants to watch this movie after this review...Be my guest.",
         "I felt like watching a 1969 Sci-fi movie through out the whole time... The computer generated portion of this movie is absurd and out-dated. The actors and actress mostly seemed like they are unprofessionally trained especially their voice acting. It felt like they are trying to act like they are acting, which is the most disastrous phenomena you can have in a movie. I couldn't stand finishing the movie after seeing the laboratory and the scientists that totally disgusted me with their fake acting. Compared with Independence Day, Matrix or any other Sci-Fi movies, this is the absolutely WORST! Do not waste your time and money on this!",
         "I cant believe that this movie went out to market. It should be some organization regulating sh!t from getting on the shelves. This is the kind of movies that you cant stop viewing it because you think that it will get better at some time and then BANG! the titles appear. I just registered here (this is my first review) just to put this honest comment, and I hope that it can save 1.5 hours of life to somebody. I don't know how people here could vote with 3 or even 5 stars, whoever did this should be sued. I don't have other thing to say about this movie without saying bad words, but it seems I need to complete 10 lines. Please don't ever view this movie or you will regret it",
         "One of the worst, if not the worst movie, I have seen in my life! Ed Wood could not make anything this bad! His movies are at least a couple of levels above this piece of junk! I didn't think someone could make a movie this bad in the modern era. Its an insult to the previous actors and writers of the other movie. Mr. Wells would cry in his seat if he saw this crap. Weak story line, amateurish graphics. College and Highschool students make better movies for their midterm. Please don't waste any money on this one cause they didn't. TV shows like Doctor Who, Battlestar Gallatica, and Stargate are about 100 times more interesting, better made, and have better actors. P.U. What a stinker!",
         "It baffles me every time I see one of these terrible Sci-Fi murders! Who gives these goons money to make rubbish like this? I love SciFi films, but this effort is an insult to SciFi! There is no sense of drama, you are left wondering what the hell is going on? and the action scenes (alien scenes) are repeated... Kim Little obviously got her place in this movie because she was in the first one, but she was absolutely terrible... I can't believe the director actually appeared in such a well groomed TV series as 24... He obviously learned nothing in his time there!!! The acting is wooden, the dialogue corny... in summary, don't waste 90 minutes of your life!",
         "I've never seen anything so boring... From the story (which is basically a mix between War of the World and Independence Day) to the acting (I was wondering if one can still call that acting since the trees in the forest have more attitude than the actual actors).... Not mentioning the special effects (a little \"ziiiiip\" and a ray to make people disappear). This movie had no budget and wanted to look like a million-dollar movie but frankly it was just painful to watch... Now directing... well what can I say? ... we all know C. Thomas Howell as an actor ... so let me know that he is twice as bad as a director... there's basically no direction at all... It's always sad to see someone like a former A-list actor becoming something like this but take my advice... do not buy or rent this movie.. keep your money for something worth it !",
         "Well I didn't like the first movie to this series but now they have outdone themselves in the worst possible way. A really stupid story, which I could still overlook, if there wasn't really really horrible bad acting!! I wont really comment on the computer effects, which were not good ones, because that shouldn't be what a movie is about anyway... The only thing that really bothered me is that especially in the flight scenes they showed the same sequence over and over and over and over again? Do they think i am stupid and my attention span is less than 45 seconds? This movie can only be regarded as a very bad joke gone really wrong...",
         "Horrible acting, terrible special effects, plot holes a mile wide, and not much a plot to begin with -- I had hoped for some improvement over the first version but there really is none. It's not even very good for laughs. For just one example, and this won't spoil the plot, the remnant human air force takes off to do battle. For some reason they are all launched initially by remote control from a desktop computer. (I know, I know.) Yet the pilots themselves are all taken by surprise. They don't even realize how they are going to be taking off. Huh? Trying to find something positive to say, some of the scientific dialogue is fairly sophisticated -- branes are mentioned for example. The problem is that it feels tacked on to the pedestrian plot and contributes little. You aren't going to find much in this movie. I'm still waiting to find a modern day War of the Worlds in which people actually credibly fight back. The one with Cruise had good special effects but a pathetic message. This one doesn't even have the special effects."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi"
      ],
      "productionCompanies": ["Anthill Productions"],
      "summaries": ["Two years after the Martian invasion, George Herbert's worst fears are realized: The Aliens have returned. As a second wave of Martian walkers lay waste to what's left of Earth, an alliance of military forces prepares a daring attack on the Red Planet itself. Once again, the future of mankind hangs in the balance."],
      "budget": 500000
   },
   "movielensId": 64999,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-01-01",
      "dvdReleaseDate": "2008-03-18",
      "directors": ["C. Thomas Howell"],
      "runtime": 90,
      "movieId": 64999,
      "title": "War of the Worlds 2: The Next Wave",
      "mpaa": "R",
      "actors": [
         "C. Thomas Howell",
         "Fred Griffith",
         "Zack Beseda",
         "Christopher Reid",
         "Kim Little",
         "Jonathan Levit",
         "Danna Brady",
         "Darren Dalton",
         "Jonathan Nation"
      ],
      "imdbMovieId": "1183733",
      "originalTitle": "War of the Worlds 2: The Next Wave",
      "genres": [
         "Action",
         "Science Fiction",
         "Adventure"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two years after the Martian invasion, George Herbert's worst fears are realized: The Aliens have returned. As a second wave of Martian walkers lay waste to what's left of Earth, an alliance of military forces prepares a daring attack on the Red Planet itself. Once again, the future of mankind hangs in the balance.",
      "tmdbMovieId": 16268,
      "avgRating": 1.62121,
      "releaseYear": "2008",
      "numRatings": 33,
      "posterPath": "/o2yvWD9nCck18FQsCnOIsxUA6mB.jpg"
   }
}