{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0902270",
      "video": false,
      "title": "Constantine's Sword",
      "recommendations": [],
      "backdrop_path": "/gwbwThhMVpTi9K7Ts6O8xjftXUk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46329251416c750705c3",
               "name": "Oren Jacoby",
               "profile_path": null,
               "id": 139825,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46329251416c750705c9",
               "name": "James Carroll",
               "profile_path": null,
               "id": 139826,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46329251416c750705cf",
               "name": "Oren Jacoby",
               "profile_path": null,
               "id": 139825,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.144711,
      "production_countries": [],
      "id": 15033,
      "vote_count": 4,
      "budget": 0,
      "overview": "An exploration of the dark side of Christianity, following acclaimed author and former priest James Carroll on a journey of remembrance and reckoning.",
      "similar": [],
      "original_title": "Constantine's Sword",
      "runtime": null,
      "poster_path": "/pZfE6lQGRtFzy1EwSJHmFsB93bz.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2008-04-18",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Oren Jacoby"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "James Carroll",
         "James Carroll"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0902270/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NTMzNDIyOV5BMl5BanBnXkFtZTcwNTE4MTQ4MQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Liev Schreiber, Philip Bosco, Natasha Richardson | See full cast and crew »"],
      "reviews": [
         "Constantine's Sword refers to the Christian Cross, the vision of which caused Constantine the Great, to cry out the timeless words \" In Hoc Signo Vinces\" (in this sign, you will conquer.) transforming a symbol of love and peace into an icon of war. James Carroll, an ex Catholic priest, looked at this side of his religion in his acclaimed book of the same title published in 2001. Having read the 750 pages covering the two millenniums of Christianity, fascinated by the writers ability to weave facts into a tale as absorbing as the best work of fiction, I was intrigued to see whether he could condense such a rich tapestry of history into the time limits of a commercial documentary. He couldn't; but the film that was made captures the essential message of the book,while adding a new more important role of social commentary on the America that only came into existence after the book was published. With the multi-front assault on the very concept of a \"Wall of Separation between Church and State,\" lead by right wing evangelicals, this film immediately jumps to the forefront of the intellectual resistance to this transformation of America. Constantine's Sword has two distinct threads. The first is the history of Christianity as a force of oppressive xenophobia, culminating with the abetting of the worst crime of our time, the holocaust. The other thread is in the present, focusing on the resistance of a single family, that of Mikey Weinstein, who challenges the evangelical dominance of a single institution, the U.S. Air Force Academy. Left on the editing floor, dictated by the time constraints of the medium, was adequate connecting tissue between the two. The real story of the aggressive evangelizing of the Air Force cadets is that of the future, with footage not accessible; a future that this film is attempting to prevent. Compared to centuries of atrocities by Christians against Jews, vividly shown in the film by descendants of some who suffered, the stress of the young Weinstein men at the academy is trivial. What is not trivial, is the change in tone within the current administration that encourages such actions, leaving the unasked question: if this is happening now, what will the future bring. With this film, James Carroll has continued his career of self sacrifice that began by going against his beloved father, a three star Air Force general, in opposing the war in Viet Nam, a breach that was never healed. I can only imagine how it pained him to see vital elements of his book excluded from the film in order to give it visual impact. They chose a prominent evangelical minister to present the argument for the legitimacy of aggressive evangelizing at the academy, who did so, with charismatic forcefulness. This provided the only moment of ironic laughter from the audience, as the minister was Ted Haggard, who later was publicly disgraced by exposure of his personal sexual hypocrisy. In the 21st century, America's political direction will be shaped at least as much by market share, by exposure to competing messages, as by the intrinsic merit of underlying ideas. The laughter at Haggard's words just may distract from the the profound message of the connection between past and future that Carroll is making. But then again, this segment may bring more people to see a film that otherwise would be too heavy for a night out at the movies. In a world of sound bite politics, this film is a serious study of a religious revival that is transforming our country, and as a global power, affecting the world. I give it my most enthusiastic recommendation with a single condition- that anyone who is moved by this film, as you will be, also go out and buy the book-- and take the time to savor every word.",
         "I loved this documentary. I think, though, this film is playing to the choir and should be seen by those who really need to see it. May I suggest offering it for sale at the Air Force Academy and anywhere where fundamentalist religiosity in its extreme has us by our throats influencing Washington policy. It is an existential threat to our existence as a free republic and certainly a threat to our founders determination to keep religion and state forever separate. The cross in the form of a sword as James Carroll has said, has meant death to millions and continues to morph itself into different forms which still mean murder. I love ALL of James Carroll's work. He speaks for us. Run do not walk to see this film.",
         "Seldom does one find themselves mesmerized by the sheer intelligence of a documentary, but in Constantines Sword the film makers articulate exploration of the all encompassing question of religion and it's place in the world is breathtaking. The film exposes, quietly and without manipulation, an underlying and unhealthy historical familiarity between the modern evangelical Christian movement and previous fervent Christian crusaders. Their anti-Semitic nature perfectly presented. The film expertly navigates its way through complex historical and philosophical religious concepts, made easy through the very personal story of James Carrol. Part narrator part subject Carrol's view of the world is one we wish all men could share. Pitch perfect, expertly edited, researched and directed Constantines Sword is a truly remarkable documentary, one that could only be born of such conservative times.",
         "The protagonist of this convoluted and intellectually stimulating documentary is John Carroll, once a Catholic priest, now a successful writer and the father of two grown children. The film dramatizes Carroll's best-selling 770-page 2001 book of the same name exploring reasons why he left the priesthood. Chief among these is the Church's historical role in the persecution of the Jews. According to Carroll, the New Testament falsifies what is known of history in depicting Jews as Christ-killers, and the Church's culpability all grows from there. Moreover Constantine, the Roman emperor who converted to Christianity, transformed the cross into a sword and Christianity got blood on its hands in the Crusades and the Inquisition; but it got a lot worse when Hitler came along and the Vatican stood by and watched. As the Kirkus review put it, the book 'Constantine's Sword' is essentially the \"first 2,000 years of Catholic-Jewish relations retold as a narrative with a beginning, middle, and end\u0097at Auschwitz.\" Perhaps Carroll's most eye-opening point is to remind us that the Nazis were Christians. To appreciate the film, you have to flow along with Carroll's personal journey and also humor director Jacoby's sometimes tired methodology. Scene after scene is a trite setup where Carroll poses some question, goes somewhere, and gets canned answers from some local expert. It's a device that's been used thousands and thousands of times. Luckily the material is controversial enough to keep things lively anyway. Carroll's father went from a Chicago slaughterhouse to became so successful as an FBI agent that he was promoted to Edgar Hoover's inner circle and became an Air Force general involved in high-level intelligence planning. Hence John once considered attending the Air Force Academy. So he tells us as he drives there--then dives into descriptions of how Mel Gibson's arguably anti-Semitic 'Passion of the Christ' movie was so heavily promoted at the Academy through evangelicals, cadets felt obligated to attend--and how Jewish cadet Casey Weinstein met with constant anti-Semitism, and how his father Mikey, also an Academy graduate, felt compelled to sue the Air Force for discrimination. Delving into the shocking penetration of evangelical proselytizing at the Academy, Carroll interviews the square-jawed rictus-smiling Colorado evangelical mega-church leader Ted Haggard, evidently a key figure in these machinations. It's hard to recount in a few paragraphs how it all fits together; maybe it doesn't. No; it does. But many--particularly orthodox Catholics--would hotly dispute the accuracy of some parts. For them, the fabric comes undone. Anyway, Carroll traces the history of the Emperor Constantine (voiced here by actor Liev Schreiber) as a seminal moment, when the state and Christianity were interwoven, when the Pope became a secular as well as religious leader. The cross became the main symbol of Christianity, with its bloody associations and its sword-like shape and anti-Semitic overtones (if you see the Crucifixion as the fault of the Jews), and the Crusaders went out and massacred Jews in a string of communities in the East. Another story Carroll tells is that of St. Edith Stein (voiced by Natasha Richardson), a 20th-century Jewish convert to Catholicism who begged for protection from the Nazis in a letter to Cardinal Pacelli, but got no answer and died in the camps. Pacelli became Pope Pius XII, who was called \"Hitler's Pope\" or \"Hitler's Cardinal\" for his early friendliness to the Nazis and failure to speak out against the Holocaust. This is part of Carroll's personal story because St. Edith lived in Germany and Carroll's family also lived there while his father was chief of staff of the United States Air Forces in Europe. There were nine children in the family, by the way, which impressed the Pope when the family had an audience. Carroll's time in Germany alerted him not only to St. Edith Stein but to the holy relic of The Robe kept at the Cathedral of Trier, said to have been worn by Jesus at the time of the Crucifixion, which Carroll declares a total fiction. Did he think it authentic when he first saw it in his youth? How much did he really believe, and how much does he just choose to bring up now to strengthen his main indictment? That's not so clear. But What a tangled web we weave (to coin a phrase) when first we practice to believe. The subject of the papacy leads Carroll to Rome and its ghetto--for which the Vatican was directly responsible, and whose history he presents along with some interesting personal interviews with members of old Roman Jewish families. Carroll's own fraught time as a Catholic priest was from 1969 to 1974; the (disapproving) Kirkus review asserts that he \"remains an angry 1960s-era Catholic.\" He was galvanized politically by the anti-war movement and stood in protests with Father Daniel Berrigan. His father, on the other hand, ever more deeply involved in the military establishment, headed the Defense Intelligence Agency during the Vietnam era, which led to conflicts. Follow-ups at the film's conclusion include the information about Mikey Weinstein's death threats since he brought suit against the Air Force; complicity of high officials in the US military in religious proselytizing; the resignation of Ted Haggard from his mega-church under a cloud of scandal for drug abuse and a three-year affair with a male prostitute; and information about how the present Pope Benedict XVI has waffled on the issue of Jewish guilt in the scapegoating of the Jews issue. Carroll ends with a speech about how the world of religion is a \"lake of gasoline.\" If you pitch one match in it, it can fire up. In this context it seems a pity Carroll spends so much time about his personal concern with the troubled relations between Judaism and Christianity, when it is the old conflict with Islam that looms largest nowadays. This limitation is due to the fact that Jacoby and Carroll, even though they did some updating, are basically working with a pre-9/11 source.",
         "This was an excellent documentary by a former Catholic Priest into the actions of his Church, the evangelical movement, and politicians over the years to discriminate and kill in the name of Jesus. It starts with an overview of the indoctrination of Air Force cadets at the military academy and the resulting bigotry and discrimination against Jews and those who will not accept the views of Ted haggard (the preacher who was caught in a sex scandal) and other Christo-fascists. The film ends with another visit and the attempts of the Academy to cover up what is going on and dismiss the report on the takeover by the evangelicals. James Carroll spends the time in-between visiting Germany and Italy and other places he had seen in his youth as a military dependent. he reminisced on holy sites and relics. he gave a good history of the Catholic Church and it';s relationship with the Nazis and how they contributed to the persecution and death of the Jews. Those wanting to see how Jews were persecuted and how our political leaders are infusing religion into politics would be well served by this film.",
         "On the heels of The DaVinci Code, interest among Catholics and conspiracy buffs alike has focused on Constantine, and the cruel bargain he struck in order to maintain power, while making Christianity the state religion of Rome. This bargain has not been scrutinized closely enough and, to his discredit, Carroll did not explore this topic closely enough in the screenplay of this film. We understand the central premise, but the tie between the Air Force Academy and the Holy Roman Empire was not made clear enough. Perhaps that is because there isn't a strong case to be made for that proposition. We also understand that the Religious Right and their sponsors in the Republican Party would make their brand of Christianity the state religion in the U.S., but the reality is that the First Amendment is alive and doing quite well. Yes, it is under siege, but setting up straw men like Rev. Haggard actually cuts against Mr. Carrol's point. A more interesting comparison would have been between Constantine and the current President Bush, both of whom have struck Faustian deals. For this film to really shine, it should have made the threat from the religious right come to life.",
         "The documentary \"Constantine's Sword,\" directed by Oren Jacoby, grapples with the age-old question of why, throughout the course of human history, so much bloodshed and violence have been committed in the name of God. In this case, the person making the inquiry is James Carroll, a former priest turned author who wrote the book on which the film is based. Raised a devout Roman Catholic, Carroll came to question aspects of his religion during the height of the anti-war movement of the 1960s \u0096 a movement which the Church officially condemned \u0096 and when he began to research the role the Church itself had played in fostering and implementing anti-Semitic violence in the almost two thousand years of its existence (he doesn't go much into the Catholic-on-Protestant/Protestant-on-Catholic violence occurring at the same time). He cites the conversion of Constantine as the moment when Christianity turned into a violent religion and notes how the portrayal of the Jews as \"Christ-killers\" set in motion centuries of Church-sanctioned and Church-fueled anti-Semitism. He points to the crusades of the early 1000s, the widespread persecution and extermination of Jews during the Middle Ages, and even the far more recent cozy relationship between the Vatican and the fascist dictators of the 1930s and '40s \u0096 and the Church's lack of effort in halting the Holocaust - as evidence of his thesis. Interestingly, Carroll focuses almost exclusively on acts of violence perpetrated by Christians on Jews and Muslims and ignores acts of violence perpetrated by those groups against others (i.e., the Hebrew genocide of the Canaanites found in the Book of Joshua, modern-day Islamic jihadist attacks on Israel and the West). Perhaps, due to his papist background, Carroll simply feels more personal responsibility for Catholic-approved atrocities and doesn't feel comfortable examining the other side of the religious-violence coin. However, even if that is indeed the case, it still results in a strangely unbalanced look at the subject. Then again, since when is it the job of every documentary to cover every single aspect of the subject it's documenting? Plus, he does make the case that, until Christianity owns up to its violent history, conflicts with other religions will only intensify in the years to come. Currently, one place in which Carroll sees religion and military power coming together is in the United States Air Force, where officers and cadets \u0096 including Jews, Muslims and nonbelievers - are being coerced into becoming Evangelical Christians. He travels to the Air Force Academy in Colorado Springs to document that situation. Carroll feels that a military defined by this kind of sectarian religious zeal will only further convince the other side that we are indeed engaged in some kind of modern-day holy war with Islam, a Twenty-first Century crusade. At great personal risk to themselves, a group of plaintiffs filed a lawsuit against the Air Force for the right not to be proselytized to \u0096 an act for which they've received condemnation from the powers-that-be and even death threats. This, in many ways, is the most disturbing and eye-opening section of the movie - not least of all because an obviously pre-scandal Ted Haggard gets quite a bit of air-time commenting on the subject, since it was he who filed a counter-lawsuit on the part of evangelicals to be allowed to continue preaching the evangelical gospel to a captive audience of military personnel. Carroll ends his film with the four sobering words, \"No war is holy\" - and with a title card revealing Haggard's eventual fall from grace for consorting with a male prostitute and snorting crack. I guess sometimes the good guys do win after all.",
         "Tragic marriage of religion and nationalism has born malevolence all over this shaky planet. This, not completely successful documentary, tries to grapple with the Catholic church and it's shameful history of anti-Semitism. In the same time it brushes upon a stunning situation in Air force academy in Colorado, where evangelical zealots pressure cadets to convert to their inane version of Christianity. The trouble with this movie is that while this fresh and interesting development gets about 12 minutes of movie time, the tired and often heard and repeated story about anti-Semitism in the church takes all of the rest. Why putting these two topics together without giving them equal time? It was especially amazing seeing the demented smile on the face of a joke of a preacher, Ted Haggard,notorious crystal-meth popping, male prostitute loving, face of a mind boggling evangelical movement.",
         "It wasn't the message of Jesus which moved masses of humans to fighting. It was the natural history of humans. Each camp has its own view, whether they are Christian, Muslim, Jewish, atheist or other religions. It would be hard to weave this all into a story that's easy to follow, but without being complete (in a summary form) and balanced, we have the appearance of taking sides. Should Christians drop their guard if Muslims do not? Should injustice-- such as anti-Semitism-- be the grounds for bias in the _other direction? Should liberals be mad when a conservative preacher finds his gay side after all? Modern thinkers could be tolerant and understanding of a human being's journey to self-awareness. The film is probably trying to make the world better and tackle some of the most difficult issues -- human violence and hypocrisy. But once that's resolved, humans are still leaving a huge ecological footprint on the wilderness and it's getting worse. Violence against non-humans is a major problem too! With religion, historical rigor and intelligence, this film's aspirations are higher than other films. So, the design of those higher realms should still be rigorous, to sustain the weight of reason and knowledge. And so, I'd like the filmmakers to see their calling as being.... to persuade _all sides that what's good in their theology should not impel us to mass destruction. Without the inclusive listing of atrocities by both sides ... indirectly... any story encourages the regimented opponents of Christianity... to attack. Or, if one thinks the balance is really tipped against Christians, one needs to make a full case of that in a chapter with citations for alert scholars. Some reviewers have already revealed sides of this vast topic area which the author and filmmaker could use, next time they explain things. We're all descendants of epic struggles for dominance. It's a good topic and in this film, it is told with blunt intelligence. It's a very difficult film to make and very high-minded of them to try. This film's bravery, research and sentiment for good.... earn six stars from me... for a movie that I'm not yet satisfied with. This film was rather quiet on the universal question-- that of whether our nature gives rise to religion or whether religious ideas deserve separate consideration.",
         "James Carroll has exposed some critical gaps in the history of anti- Semiticism in the Roman Catholic church. Frankly, in light of this history, the Holocaust was merely another flare-up in a long, long story. He shows how the New Testament has been obfuscated - first by Constantine and later on by those who claim to teach it - starting with crediting the Jews with the crucifixion of Christ, rather than the Romans who actually *did* it (the Romans wouldn't have delegated executions). Given the myth of the British-Hebrew tribe/migration rising right along with this, the growth of anti-Semitic behavior (particularly at the Air Force Academy) is hardly a surprise. The fact that the now-discredited Rev. Haggard was deeply involved with preaching an anti-Jewish credo to the cadets at the Academy (and the greater Colorado Springs area, to be fair) only lends credibility to Carroll's charge. The film should be required viewing for anyone trying to make sense out of the current anti-Jewish position of both the evangelical Christian movement and Islam, and especially for anyone in or considering entering a seminary."
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": ["Storyville Films"],
      "summaries": ["An exploration of the dark side of Christianity, following acclaimed author and former priest James Carroll on a journey of remembrance and reckoning."],
      "budget": 0
   },
   "movielensId": 65001,
   "movielens": {
      "languages": [""],
      "releaseDate": "2008-04-18",
      "dvdReleaseDate": "2008-09-16",
      "directors": ["Oren Jacoby"],
      "runtime": 0,
      "movieId": 65001,
      "title": "Constantine's Sword",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0902270",
      "originalTitle": "Constantine's Sword",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "An exploration of the dark side of Christianity, following acclaimed author and former priest James Carroll on a journey of remembrance and reckoning.",
      "tmdbMovieId": 15033,
      "avgRating": 3.26087,
      "releaseYear": "2008",
      "numRatings": 23,
      "posterPath": "/pZfE6lQGRtFzy1EwSJHmFsB93bz.jpg"
   }
}